[{"handle":"amandapalmer","text":"call me weird and sentimental but my god i finally felt like i was home in america when i had my first hazelnut coffee from dunkin’ on the mass goddamn pike. i didn’t even want it. it wasn’t even good. it was the coffee i liked when i was 23. 🤷🏻‍♀️☕️🛣😭 https://t.co/LzVef7Qwiz","date":"Sat Jun 11 18:37:47 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"congratulations!!! glad we could help. high school was really hard for me. if i could thank all the musicians who pulled me through (i’m looking at you robert smith, leonard cohen, elisabeth fraser and edward ka-spel)…well, some are dead. but some i’ve thanked. \n\nONWARDS!!!!","date":"Wed Jun 08 04:46:13 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"@LauraJaneGrace the germans would call it “tourendungseinsamheit” - the specific loneliness that accompanies the end of tour. i’m currently feeling it x10000 having left new zealand and not having plugged into my old life yet. neither here nor there and lonely as fuck.","date":"Tue Jun 07 02:29:38 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"sign the mailing list for music &amp; tour news please. this is really the best thing you can do to support the band right now, so that we can find you directly without having to use social media: https://t.co/8GrpgAVPkW","date":"Mon Jun 06 15:46:09 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"four years separated.\n\nso much we were going to do.\n\ngoddamn this pandemic.\n\nbut the @DresdenDolls are back. my brother-soul-music-friend-drummer: brian viglione. \n\nwe will rock your hearts off with the saddest happiest loudest quietest beautifulest music we’ve yet made.\n\nsoon. https://t.co/mr6lwcYrvm","date":"Mon Jun 06 15:46:08 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"he’s a great interviewer. takes two. @strombo","date":"Mon Jun 06 05:22:51 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"@Photobyncm thanks natalie ♥️🍩","date":"Sun Jun 05 23:54:14 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"@LauraJaneGrace @Ruby_n_lee i’m so there when you launch. and my community will be too. they’re amazing like that. can’t wait.","date":"Sat Jun 04 04:24:57 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"@caseydavidmt @JinkxMonsoon @DresdenDolls so good !!! ska cabaret","date":"Thu Jun 02 05:19:00 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"singing goodbye to the kiwis, in freyberg square, before heading to the airport. emo x100000","date":"Thu Jun 02 05:16:40 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"@gigaloff i love you.","date":"Thu Jun 02 05:07:00 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"goodbye, aotearoa. two years and three months, and i’m out…for now. \n\na final photo and a few words about the beautiful people of this country. \n\nhttps://t.co/G86ocqNQd4 https://t.co/NdpHrqa9f9","date":"Wed Jun 01 00:30:57 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"COME SAY GOODBYE TO ME, AOTEAROA. we fly to the USA tonight after two years of pandemic waylay.\n\ngather at 3pm at freyberg place &amp; parade to auckland city library if there’s weather!!! bring gifts for strangers &amp; your whole heart &amp; a hanky to wave us off this blessed motu… https://t.co/4hoUy4645m","date":"Mon May 30 22:28:55 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"@schcklhx real weird. ;)","date":"Sun May 29 19:25:02 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"@JoshLamon i have written four songs. enough for an EP when i come back. :)","date":"Sun May 29 19:23:52 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"in front of our house of 17 months. last bike ride to school. last ice cream from the gelato place ash so loves. last trip to the library to return the last books. last time i’ll wash a dish in this sink. last time i’ll buy a loaf of vogel’s and a dozen apples at island grocer. https://t.co/zsS0Ik8Arn","date":"Sat May 28 18:01:07 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"YAY THESE KIDS. \n\nthe gun violence crisis, the climate crisis…these kids should just quit school until the adults agree to stop maiming humanity. \n\ni hope this catches fire. parents, i hope you can all support your kids in striking. #GunControlNow","date":"Thu May 26 17:46:59 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"@KateAMcMullen everyone’s a critic. anyway: point well made.","date":"Wed May 25 12:19:47 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"i have not been on american soil since mid-2019. i toured for 7 months and then…covid.\n\ni miss my old community and my home terribly. and i am heartbroken by what has happened in my country since i’ve left. devastated by all of it. i don’t know anything anymore. and home i come.","date":"Wed May 25 10:55:02 +0000 2022","user_id":"10798802"},{"handle":"amandapalmer","text":"tonight i saw another american - in new zealand, i leave in 6 days - and we looked into one another’s eyes and burst into tears. \n\ni want to share today’s post from @HC_Richardson, which every american should read. \n\nwhen will it be enough?\n\nhttps://t.co/NcCO5zy8aP","date":"Wed May 25 08:32:16 +0000 2022","user_id":"10798802"}]