[{"handle":"anildash","text":"@DKThomp And it’s doomed to fail for the same reasons — it’s assuming republicans won’t use every tool in their power to destroy them for it. When we know damn well they will.","date":"Mon Jun 27 11:59:01 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@seldo True.","date":"Mon Jun 27 04:03:22 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@hutchamachutch And it’s asking too much trust from workers — who is going to tell their boss about a law they want to break?","date":"Mon Jun 27 03:47:54 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@seldo It’s the only way to form a principled stance, but the problem is they will kill the rest of us if we ever get enough power to enforce such a rational policy.","date":"Mon Jun 27 03:41:55 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@Rosscott It’s the visual design, it doesn’t mean anything more than that to them","date":"Mon Jun 27 02:04:02 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"The lesson from their lying about things that are recorded on video is you might as well do the thing they’re accusing you of. Because they’re going to act as if you did.","date":"Mon Jun 27 01:55:48 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@chrisfralic I want to write more about their influence on one another. When Prince first went to Sunset Sound, amidst Fleetwood Mac &amp; Stevie Wonder hanging out, Prince impersonated Sly Stone (also around at the time!) on the phone to ask Chaka down to the studio. He froze when she arrived.","date":"Mon Jun 27 01:06:23 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@chrisfralic Oh this is wonderful! Even in promos, it’s so rare that Prince had his songs included alongside other artists (it basically never happened after 1984), so this is a special one. Only way it could be better is if WB had included Chaka.","date":"Mon Jun 27 00:45:57 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@nelson https://t.co/ZxrJubjK0z","date":"Mon Jun 27 00:41:49 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@jbminn @blakereid That seems exceedingly unlikely!","date":"Sun Jun 26 23:05:51 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@goldman @matthh 🫡","date":"Sun Jun 26 23:04:46 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@bradmahler @JesseThorn I’m surprisingly Ewok-neutral!","date":"Sun Jun 26 23:03:49 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@blakereid @jbminn https://t.co/FkWX9gUFEM","date":"Sun Jun 26 23:03:12 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@jwz Gotta admit, all these years later, my primary thought about that passing is “man, he was young!” I… did not think that at the time.","date":"Sun Jun 26 23:02:31 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@jbminn I’m trying to picture Prince in a pair of Jordache jeans","date":"Sun Jun 26 23:00:35 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@jbminn YOU GO TOO FAR SIR","date":"Sun Jun 26 22:59:09 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@goldman There was a LOT of marketing of the 60s in that era. And honestly if it was choosing between Reagan and hippies (as was often the argument presented), it’s certainly the moral choice.","date":"Sun Jun 26 22:58:44 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@bradesposito Let’s tell them it is.","date":"Sun Jun 26 22:55:56 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"Decades before “okay, boomer”, you could use “I don’t care about the Dead” as a bat-signal to summon a boomer to get angry at you, though it is a high-risk maneuver as they were just as likely to bore you with some story about how they had sex in a van and invented marijuana.","date":"Sun Jun 26 22:53:06 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@ShortFormErnie I need to clear my calendar for that one.","date":"Sun Jun 26 22:51:24 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"One key failure of employer-backed abortion care travel that can’t be emphasized enough: it requires the worker to make a disclosure that puts them in jeopardy. Often, those seeking care can’t even disclose to a partner or family — they absolutely can’t trust their manager or HR.","date":"Sun Jun 26 19:07:59 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"I think it’s a well-intentioned response, but a flawed one for many reasons, including this one. We also already know leading Republicans will try to destroy companies for political gain; we can assume when they see employers offering this help, they’ll also begin to target them.","date":"Sun Jun 26 15:45:22 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@bradmahler @JesseThorn Someday when I have a couple of hours free to get yelled at online, I’ll go after the Hobbits too","date":"Sun Jun 26 22:48:00 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@Mat__Savage https://t.co/tNzxdbSy0R","date":"Sun Jun 26 21:13:17 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@andrew__ahhhhhh They put a lot of energy into ruining it","date":"Sun Jun 26 21:00:09 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@SPeitsch Oh I sure do","date":"Sun Jun 26 20:39:16 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"I’m not one of those old people who gets mad about young people wearing Nirvana and Metallica and Guns &amp; Roses shirts, but seeing a young person wearing a Grateful Dead shirt was a bridge too far. “No, young one! Those were *never* cool!”","date":"Sun Jun 26 20:36:21 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@natetharp I’m not sure it’s the single biggest one, but it’s absolutely in contention for that. More importantly, there’s a moral imperative to fix this.","date":"Sun Jun 26 19:09:09 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"One key failure of employer-backed abortion care travel that can’t be emphasized enough: it requires the worker to make a disclosure that puts them in jeopardy. Often, those seeking care can’t even disclose to a partner or family — they absolutely can’t trust their manager or HR.","date":"Sun Jun 26 19:07:59 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"One of the most vital things we can do is keep fighting for universal healthcare, even as things seem so dire. Linking reproductive healthcare to employers and private insurers is even more at risk in an era where most people have a pre-existing condition. https://t.co/cuoA3KhaNU","date":"Sun Jun 26 15:53:29 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"I think it’s a well-intentioned response, but a flawed one for many reasons, including this one. We also already know leading Republicans will try to destroy companies for political gain; we can assume when they see employers offering this help, they’ll also begin to target them.","date":"Sun Jun 26 15:45:22 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"More importantly, this only even attempts to assist a subset of workers, and excludes the most vulnerable, like contractors and part-timers. A more meaningful &amp; effective commitment would be stopping donations to anti-abortion candidates &amp; refusing to do business in their states.","date":"Sun Jun 26 15:45:22 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@kithrup It’s a death cult and no one will say it.","date":"Sun Jun 26 01:30:46 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@djsoulsister 🙏🏾💜","date":"Sun Jun 26 00:42:32 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@Leopard24601 @Fly_Sistah @lacadri34 @djrothkopf They’ve literally retroactively stripped citizenship from Asian Americans more than once, in addition to the many attacks on Black Americans already mentioned in this thread. Just say “it doesn’t count to me unless it affects white folks” and keep it moving.","date":"Sat Jun 25 23:28:04 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@tiffani Happy birthday! Grateful for you, and hope you have an amazing day!","date":"Sat Jun 25 21:10:02 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@craigslike Was gonna say “my bad”, but I do not actually give a fuck about their brands and we should bulldoze the hummers anyway","date":"Sat Jun 25 21:07:13 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"When are we gonna run over Hummers with bulldozers, when they can rack up dozens of tickets with no accountability, then cause crashes like this!","date":"Sat Jun 25 21:01:54 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@SaifUlI25919743 @siddi_ziddi_hai I appreciate that. This platform isn’t designed to bring the best out of us, it’s always nice when we can engage more fruitfully.","date":"Sat Jun 25 04:00:50 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@brockm @OGDoublejack @willwilkinson @ElieNYC Part of the challenge is the fundamentalists are also armed and violent and murdered a lot of people for exercising their rights. That has something of a chilling effect.","date":"Sat Jun 25 02:56:47 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"The funny thing about perception is it matters whose perception you’re concerned with, and also whether those people will lie to get what they want. The NYT is an easily gamed machine if you are a fascist who knows how to manipulate this weakness. And they don’t want to fix it.","date":"Fri Jun 24 23:53:31 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"They spend an order of magnitude more funding the anti-abortion movement than transporting their workers to get care.","date":"Fri Jun 24 23:49:08 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"I know a lot of my followers have real impact on the products that get made. If you need help to prioritize these protections, many of us will help you get that done.","date":"Fri Jun 24 21:38:24 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@LivelyVivian Ah! @Caissie is wonderful!","date":"Fri Jun 24 21:32:12 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@Beansrdone @ewarren This advice is demonstrably ineffective.","date":"Fri Jun 24 19:04:35 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@AlisonBuki Goddamnit","date":"Fri Jun 24 18:51:15 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@owillis kick them","date":"Fri Jun 24 15:22:01 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@nomadicism well, i take your point, but i will say they were not that quick to scrub ISIS, either.","date":"Fri Jun 24 15:19:58 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"https://t.co/woOkbRutXm","date":"Fri Jun 24 15:19:57 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@Lizzs_Lockeroom https://t.co/070DyIkZxX","date":"Fri Jun 24 13:04:30 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@ItsTheBrandi @katienotopoulos People who have their notifications on gotta know what they’re facing at this point.","date":"Fri Jun 24 13:03:32 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@yc INCREDIBLE softball energy","date":"Fri Jun 24 05:08:07 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@SymposiumSilver @edroso So much of their hysteria is grounded in projecting their violent tendencies onto everyone else.","date":"Fri Jun 24 04:44:10 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@naima So many of these for me but the first that comes to mind is Aaliyah, If Your Girl Only Knew. I’d already loved her, but this dropped and it was something *new*. Instantly knew that was gonna be a sound everyone would aim for.","date":"Fri Jun 24 04:37:37 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@whoistrip @naima Aw man! Yes yes yes.","date":"Fri Jun 24 04:33:35 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"It’s going to get a lot more dangerous very quickly because the fascists are working their followers into a frenzy with even bigger lies than usual.","date":"Fri Jun 24 04:31:43 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@elisawine14 @LeJaeger @snitchin_bubs @Michael_Of_Crue @radiomorillo @divinetechygirl I do not believe you have contrived your fear because two unhoused men were killed and you identify so closely with them that you see this as a com den for you. In fact, the unhoused are in *more* danger specifically because of your kind of fearmongering.","date":"Fri Jun 24 02:38:52 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@LeJaeger @radiomorillo @divinetechygirl This is a lie, as is to be expected by some dipshit who doesn’t live here, but is fixated on their insecurities about NYC.","date":"Fri Jun 24 01:21:36 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"First pick! It’s the drip.","date":"Fri Jun 24 00:11:51 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@nikiw I mean, it’s creeping up on bat villain territory already","date":"Thu Jun 23 23:29:36 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"You can juuuust make out his suit sitting to the right of center stage here, but you can feel the vibes the minute you enter the building. https://t.co/Xdfg6XnUEA","date":"Thu Jun 23 23:21:35 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"Yes I agree with Paolo Banchero’s choices for tonight’s draft. https://t.co/q8k9jgIyic","date":"Thu Jun 23 22:33:02 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@patbits @AsteadWesley nobody is ready for my galaxy-brain take that the fireworks supply chain was repurposed, and that's how we got vaccines distributed so fast","date":"Thu Jun 23 16:52:13 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@danamo happy birthday, legend!","date":"Thu Jun 23 16:51:27 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@day_diff @elisawine14 glad you took a pause from advocating for arming school shooters to make up lies about a city you hate","date":"Thu Jun 23 16:50:36 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@Medium how come old stories that had a feature image don't show that picture at the top? is that a design element in a publication, or a core change to how stories display?","date":"Thu Jun 23 16:47:54 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"Wow, this is kind of wild... I don't think I've ever seen a company bring back a conference after a dozen years. The first Chirp was a trip, I wonder what this one will be like. (I wrote up part of the experience of that first event: https://t.co/mJkWlguFQQ )","date":"Thu Jun 23 16:46:49 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@PhuckestUppist @radiomorillo @divinetechygirl Literal fucking nazis on this site and you're mad someone is pointing out that every time white women weaponize their factless fears, people of color pay the price.","date":"Thu Jun 23 15:43:43 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@DavidDarnes @zachleat Yeah! Your stuff looks great, I already had a couple tabs open to it. :) Will dig into the more once I've wrangled my content into shape.","date":"Thu Jun 23 15:38:47 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@zachleat Oh, most of the problem is my fault, 23 years of archives covering millions of words, with inconsistent formatting and URL schema over the years. 😭","date":"Thu Jun 23 15:33:57 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@reopenpa a million people died in this country alone, so that's what an actual danger looks like. Literally have to have genocidal impulses to diminish death on that scale.","date":"Thu Jun 23 15:02:39 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@zachleat It’s the right answer but still so much harder than it ought to be! I do want to move my archives over to an 11ty blog, it’s just a lot of time-consuming tasks.","date":"Thu Jun 23 14:18:47 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@jonahbenton @elisawine14 NYPD’s own stats show crime at the same levels as in 2016. To what do we attribute the shift in rhetoric? History shows us this is a tactic the right always uses to grab power, and white women are the agents of it, at the expense of people of color.","date":"Thu Jun 23 13:59:44 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@EvaChanda Ah I love that idea. Might be a nice thing for community orgs to start doing.","date":"Thu Jun 23 13:54:13 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@wwahammy Yeah at some level it’s an interesting signal of a full generation of MS execs having come aboard after the antitrust trial. The institutional concern about enforcement has faded.","date":"Thu Jun 23 13:53:29 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@jennwrites This was one of the first 45s I ever bought, on a lark, and I remember almost immediately upon listening to it, thinking “okay, this is really weird.”","date":"Thu Jun 23 13:49:38 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"One of the great simple joys of walking around the city is, when you see a nice tree, you can just look at the tree map and identify it. https://t.co/K9s22Tkg2l","date":"Thu Jun 23 13:45:36 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@patbits That’s so weird, have to imagine a lot of folks are using a kitchen iPad or something for that","date":"Thu Jun 23 13:40:21 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@lowkeyrbe It’s factually true, not my fault there are certain causes of death that you like.","date":"Thu Jun 23 13:33:43 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@jonahbenton @elisawine14 Okay, what about over the last 42 years, which is the topic?","date":"Thu Jun 23 13:33:18 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@SeventhEvan @elisawine14 I’m being sincere, anything that distracts you from your murderous agenda of getting more guns into the hands of sociopaths is a win.","date":"Thu Jun 23 13:32:17 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@meisterbuerger It’s true, only thing I know about you is you find death hilarious and that some causes of death are acceptable to you.","date":"Thu Jun 23 13:30:46 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@Humble_Analysis @elisawine14 You’re less safe in Montana in terms of external causes of death. You can try to split hairs any way you want, but don’t pretend your assertions are based on facts.","date":"Thu Jun 23 13:29:58 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@SeventhEvan @elisawine14 I’m glad you’re taking a break from your efforts to arm school shooters.","date":"Thu Jun 23 13:24:43 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@kokev @tylertringas Yeah I’m not sure it is fixable, but monetizing it definitely invites a lot more criticism.","date":"Thu Jun 23 13:22:49 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@meisterbuerger I agree, your cult does think death is hilarious. It’s one of the most terrifying things about your cohort.","date":"Thu Jun 23 13:22:04 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@park_slope_slut Millions of people pay to have their code hosted on the site! And I don’t think we know if the AI model was only trained on GitHub; to my recollection people have found code that was only hosted elsewhere excerpted by copilot. Also, hosting terms don’t supersede license.","date":"Thu Jun 23 13:21:25 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@bob84063825 @elisawine14 @snitchin_bubs @Michael_Of_Crue @radiomorillo @divinetechygirl It’s pathetic when the people trying to criminalize abortion pretend to give a shit about women in any regard.","date":"Thu Jun 23 13:19:28 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@lowkeyrbe I’m glad you’re busy fixating on me instead of trying to harm people getting abortions.","date":"Thu Jun 23 13:14:03 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@paulbiggar Yeah, I think of the IP vetting process we just went through in the company being acquired, and I couldn’t honestly answer the questions of our team had used this kind of tool to create the product. No one could, for a product of sufficient complexity.","date":"Thu Jun 23 13:12:48 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"Also, good luck to anyone who has to make any legal representations or assertions about the IP of products written using these tools. Does it violate anyone else’s copyrights or patents?” 🎱 Answer unclear, ask again later.","date":"Thu Jun 23 13:11:14 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"Here, I wrote a letter about it. In 1976. “Who can afford to do professional work for nothing?” https://t.co/tTGy4iHjDg https://t.co/sk55DiDLpA","date":"Thu Jun 23 13:08:19 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"I, personally, think it is not ideal when one of the biggest companies in the history of the world has a paid product based on the labor and intellectual property of others whose work is used without their consent.","date":"Thu Jun 23 13:03:04 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"NYPD has made traffic more dangerous for kids at this school every single school day this year, for equipment they don’t need. It’s not merely that cops are put ahead of kids, cops’ vehicles that they don’t even use are out ahead of kids’ safety.","date":"Thu Jun 23 12:58:44 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@RobinPZander All thanks to @elsangito for the prompt; I take for granted that I’ve gotten to walk in this path, but if sharing these stories has value to others, I’m grateful for it.","date":"Thu Jun 23 05:51:13 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@TechConnectify 🔪🫣","date":"Thu Jun 23 03:18:11 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@dispositive I’m so sorry. I’m glad you have your people. 💜","date":"Thu Jun 23 03:13:30 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"I have no illusions that today’s bigots are any less virulent in their hatred, they’ve just been hiding their time. I’m lucky that the few people I keep in touch with from then have all become effective, fearless advocates. I’m sad that they had to be, and will have to be again.","date":"Thu Jun 23 03:12:20 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@obra Oh yeah, the teachers who were the “allies” were the ones who told me to cool it.","date":"Thu Jun 23 03:08:06 +0000 2022","user_id":"36823"},{"handle":"anildash","text":"@plainy I mean, I had a lot more privilege than many. The first Black family in our town moved in when I was in junior high and had a cross burned in their yard.","date":"Thu Jun 23 03:07:20 +0000 2022","user_id":"36823"}]