[{"handle":"BillGates","text":"This is a sad day. Reversing Roe v. Wade is an unjust and unacceptable setback. And it puts women’s lives at risk, especially the most disadvantaged.","date":"Fri Jun 24 16:06:58 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Through renewed investments in malaria and NTDs, we can help end these endemic diseases, and prevent future pandemics.","date":"Thu Jun 23 17:18:54 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Daniel Boakye of @TheENDFund has spent 45 years working on solutions for neglected tropical diseases, including river blindness. As he says, “We have the tools we need. The priority now is to deploy them in the right way to get to elimination.” https://t.co/Mzdh5sOoCr","date":"Thu Jun 23 00:20:46 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"When most people think about what produces greenhouse gas emissions, they think about cars and electricity. But they add up to only about one third of the total. Clean hydrogen could help eliminate the rest: https://t.co/CtB8gnMB2Z https://t.co/WUocOWxKcr","date":"Wed Jun 22 20:11:02 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The Power by @NaomiAllthenews raises timely questions about the way people are connected by gender, family, community, and country. https://t.co/N0CLt6p8vK","date":"Sun Jun 19 01:30:19 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Important guidance from @TheADDF founder @a_hfillit outlining the path forward on Alzheimer’s: \n▪️ More – and better – biomarkers\n▪️ Exploratory trials\n▪️ Repurposed drugs\nhttps://t.co/P9rvDauGk4","date":"Fri Jun 17 20:57:52 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"My advice is simple: read a lot and discover a skill you enjoy. For some, that means being great at science or a great communicator. There’s so much opportunity to do good in the world.","date":"Fri Jun 17 18:21:12 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"It made me think a lot about what I would tell my younger self. I remember this guy. A lot has changed since this photo, but I remember how excited I felt for the next chapter. https://t.co/8aJPHnxp31","date":"Fri Jun 17 18:21:11 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I was recently asked what advice I would give to young people who want to make a positive impact on the world.","date":"Fri Jun 17 18:21:11 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"What a great meeting with WA’s teacher of the year, Jared Koepp. He taught me a lot about the challenges that Native students face. https://t.co/WBPqJuPqm1","date":"Thu Jun 16 17:04:01 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I guess we finally ran out of microchips.","date":"Wed Jun 15 22:25:37 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Yesterday, I had a chance to spend the day focusing on climate – and the innovations that can prevent the very worst effects of climate change. https://t.co/0qswil630a","date":"Wed Jun 15 21:19:05 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"@jaramillogroup Very cool to hear about all your exciting research. Thanks for letting me be a jaramigo for the day!","date":"Wed Jun 15 21:09:41 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"@TheChemEngineer @gatesfoundation It was great to meet you yesterday!","date":"Wed Jun 15 21:09:06 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I’m grateful for Warren’s gifts to support the foundation’s work and for our many years of friendship. When he decided in 2006 to make these gifts, it moved me to tears. It still does.","date":"Tue Jun 14 23:06:16 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The fact is, we’ve never been closer to ending polio. The huge progress Pakistan has made in the fight against polio is a reminder for why the world cannot lose sight of this goal. https://t.co/TRobY770WZ","date":"Tue Jun 14 01:17:08 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"It really is mind-blowing how quickly safe, effective COVID-19 vaccines were made: https://t.co/al6j8osekU https://t.co/2ejR43pUZL","date":"Mon Jun 13 17:44:21 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"\"The world has an opportunity to end polio in the next five years so that no child will have to suffer as I do from a disease that is entirely preventable.” @mindadentler https://t.co/fHf449a7Jk","date":"Sun Jun 12 23:52:08 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Another masterpiece from one of my favorite authors, @VaclavSmil. If you want a brief but thorough education in numeric thinking about many of the forces that shape human life, this is the book to read. You can download a free chapter of it here: https://t.co/db7Lmea4wR https://t.co/dBW8zlkndd","date":"Sat Jun 11 18:07:10 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Multiple people told me to read The Ministry for the Future by Kim Stanley Robinson and I’m glad I listened – it’s terrific. Robinson presents a stimulating story on climate change, spanning decades and continents. It's packed with fascinating ideas: https://t.co/7N2z2hZtOz https://t.co/Ei0QyzBUUc","date":"Sat Jun 11 18:06:54 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I’ve been a fan of @amortowles for a few years now and his recent novel The Lincoln Highway is fantastic. Set in 1954, he uses the story of two brothers to show that our personal journeys are never as linear or predictable as we might hope: https://t.co/3yfrJ5mgui https://t.co/4vw6IvbLFf","date":"Sat Jun 11 18:06:36 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":".@ezraklein's Why We’re Polarized is a fascinating look at human psychology. He argues that the increasing polarization in America stems from identity—the human instinct to let our group identities guide our decision-making: https://t.co/PHU4pQK555 https://t.co/Nrn9K7MtYk","date":"Sat Jun 11 18:06:18 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I recently published a list of books you might want to read this summer. Each of the writers took a meaty subject and made it compelling without sacrificing any complexity: https://t.co/8fDkR0IWaj https://t.co/Wzqrjbpd9D","date":"Sat Jun 11 18:06:02 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I’m glad that I followed @jenngates1996’s recommendation for The Power by @NaomiAllthenews. I gained a more visceral sense of the abuse and injustice women experience today. The people who tackle these issues around the world are truly heroes: https://t.co/8fboqKDntn https://t.co/6VR4GIQ8Q1","date":"Sat Jun 11 18:06:02 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"It’s amazing how much I learn from reading @TheEconomist. Here’s a fascinating article on new brain charts that could help doctors diagnose Alzheimer’s earlier. https://t.co/WAEIf75KzB","date":"Sat Jun 11 00:14:22 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"@adarpoonawalla @gatesfoundation Glad you enjoyed the book. The Serum Institute has been a fantastic partner along with other Indian manufacturers to ensure that low-cost vaccines can help save lives in India and beyond.","date":"Fri Jun 10 17:23:56 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Thank you @SenatorDurbin for the productive conversation on preparing for and preventing the next pandemic.","date":"Fri Jun 10 17:23:03 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"What if you could visit a museum exhibit about the last pandemic the world ever faced – COVID-19 – fifty years in the future? https://t.co/NDiPnkoKj4","date":"Thu Jun 09 19:02:25 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":".@mgrace_andrews of @Project_Vesta is using the natural mineral olivine and oceans to remove a trillion tons of carbon dioxide from the atmosphere. #WorldOceansDay https://t.co/cGQaC9D6TC","date":"Wed Jun 08 16:24:36 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"No matter where I am, I always have a stack of books close by. Here are five that stuck with me. https://t.co/EAu9eN1lDA","date":"Mon Jun 06 19:52:35 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"These heroes are doing incredible work. https://t.co/lGSCMsI7gE","date":"Sun Jun 05 20:01:21 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The innovators at @Ecocem have already reduced CO2 emissions in Europe by over 14 million tons. https://t.co/BbUB0svCOD","date":"Sun Jun 05 20:01:20 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The brilliant team behind the @_Oceanbird_ could reduce carbon emissions in the sailing industry by up to 90% using clean wind power technology. https://t.co/TPePKtIwpm","date":"Sun Jun 05 20:01:06 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"As Head of Operations of @CFS_energy, @RocketJoy is working to harness the same energy source that powers the stars to create clean energy here on Earth. https://t.co/54XrO6DicP","date":"Sun Jun 05 20:00:53 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Geochemist @mgrace_andrews of @Vestas is exploring how the mineral olivine can be spread across oceans to remove a trillion tons of carbon dioxide from the atmosphere. https://t.co/iZn4jSef7B","date":"Sun Jun 05 20:00:43 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Meet some of the brilliant people behind the breakthroughs that could help the world get to net-zero carbon emissions.","date":"Sun Jun 05 20:00:41 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Kim (@DaalenKim) was nominated for her outstanding research and her wider activism for global health. Just look at how much she’s accomplished so far. https://t.co/N1NguPWc4N","date":"Sat Jun 04 19:27:13 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Reetika’s research explores gender violence and the climate crisis – lifting up the experiences of Dalit and Adivasi girls. Here’s a look at @reetiks’s award-winning comic book. https://t.co/QFo6VngtLP","date":"Sat Jun 04 19:27:13 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Cynthia (@cyncoso) is an outstanding scientist, researcher, teacher, and leader. She supports hundreds of students through the African Society of Cambridge University and co-founded @africansinstem.","date":"Sat Jun 04 19:27:13 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Even though my dad is no longer with us, his wisdom and generosity lives on through the work of @Gates_Cambridge scholars. This year, 3 exceptional scholars received the Bill Gates Sr. Prize for outstanding research and leadership. https://t.co/OtbC5UtbEP","date":"Sat Jun 04 19:27:12 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Earlier this year, I made my first trip ever to Pakistan to learn more about the country’s incredible efforts to wipe out polio: https://t.co/2odxH71hbu https://t.co/C3LK5fYGcH","date":"Fri Jun 03 20:14:58 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"It was great to catch up with @PCMag 40 years after our first interview.","date":"Thu Jun 02 23:06:32 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"How it's going: https://t.co/f88xx51qFn","date":"Thu Jun 02 23:06:32 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"How it started: https://t.co/DbpuFyVUVj https://t.co/e236TIJhXI","date":"Thu Jun 02 23:06:31 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The greatest medical breakthrough of this pandemic is the creation of COVID-19 vaccines that use mRNA. Here are 4 steps to develop, manufacture, and distribute vaccines even faster next time. https://t.co/cJylwQvbBQ","date":"Thu Jun 02 17:27:47 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"To meet the world’s climate goals, clean energy technology needs to be affordable, attractive, and accessible to all.","date":"Wed Jun 01 20:32:37 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Just like we have a robust system to prevent and extinguish fires, there needs to be an equally effective system to identify and respond to disease outbreaks. This firefighting comparison is a useful way to understand the amazing work of @sofoniaskt: https://t.co/QlXHoJtHGT https://t.co/VUBcBVGFVu","date":"Wed Jun 01 16:30:48 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I can’t believe this was 15 years ago. I always enjoyed the @allthingsd conference.","date":"Wed Jun 01 00:11:22 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"@waltmossberg @Kodak Reconnecting with Steve was fantastic. And for the record, I wasn’t reluctant to take the photo. But I do wish I had an opportunity to run a comb through my hair first.","date":"Wed Jun 01 00:11:03 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Incredible. @lionheart1759\nhttps://t.co/6PqLbrJgz8","date":"Tue May 31 22:04:12 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I recently met with 33 graduate students and a few leading scientists about how to make sure disease outbreaks don’t go global: https://t.co/nDHQh9sOLE https://t.co/3DSbMvnO7V","date":"Tue May 31 20:56:38 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"While there are many great commencement speeches, I found this one from my friend Reid particularly insightful.","date":"Tue May 31 19:29:02 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"@mansukhmandviya It was great to meet Dr @mansukhmandviya and exchange perspectives on global health. India's success with the vaccination drive and the use of technology to drive health outcomes at scale offers many lessons for the world.","date":"Sat May 28 15:02:08 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Happy to meet Prime Minister @sanchezcastejon and members of his government today in Madrid. Great to see his leadership and commitment to addressing some of the most pressing global challenges, particularly more equity in global health, climate change and food security.","date":"Fri May 27 16:09:28 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The school shooting in Texas is heartbreaking. No parent should worry that their child isn’t safe at school. We must come together and act now so this never happens again.","date":"Wed May 25 16:05:22 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Not long ago, the world increased aid for global health during a time of crisis. We must do so again. https://t.co/zAOZ1tbKcw","date":"Tue May 24 17:02:16 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":".@PardisSabeti is working to detect pathogens earlier and stop pandemics in the their tracks. https://t.co/g9ejMe3O2B","date":"Mon May 23 19:13:30 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Movies like Outbreak nailed it when they imagined a global disease-fighting team who is ready to respond to a crisis on a moment’s notice. Now we need to make it a reality. https://t.co/Yn22HFLMwx","date":"Sun May 22 20:20:36 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Ruth’s discovery of rotavirus saved millions of lives. And learning about rota is what inspired us to launch @GatesFoundation. Ruth was a real hero.","date":"Fri May 20 20:49:33 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I had a great time answering questions on @Reddit yesterday about pandemic prevention, climate change, farmland, my cell phone, and much more. Here are some highlights. https://t.co/k1BRX78eta","date":"Fri May 20 17:12:20 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I’m answering your questions now on @Reddit: https://t.co/QKKfUUTiFt https://t.co/sAYwcyINyT","date":"Thu May 19 17:10:22 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Hey, @Reddit, it’s been a while. Ask me anything at 10:30AM Pacific Time.","date":"Thu May 19 15:00:13 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"This warehouse is cool – for many reasons. https://t.co/siqvwnzo2D","date":"Thu May 19 00:59:08 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I hope the spirit of Paul Farmer’s work lives on for generations. https://t.co/hADcViqog2","date":"Tue May 17 20:47:46 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I have appreciated our conversations over the years and your perspective about the importance of staying prepared.","date":"Thu May 12 21:06:47 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"It was an honor to speak (virtually) at the #GlobalCOVIDSummit today about the urgent action needed to end this pandemic and prevent the next. I'm grateful for the leadership from the US, Belize, Germany, Indonesia and Senegal. https://t.co/18CywpaFjU","date":"Thu May 12 19:38:18 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I can't wait to read this.","date":"Wed May 11 17:48:07 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Bono, you’re just as amazing a philanthropist as you are a friend. Working and learning together has been one of my greatest joys. https://t.co/5qQJVcIkV4","date":"Wed May 11 17:48:07 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"We will continue working with partners and do all we can to ensure none of us have to deal with a pandemic again.","date":"Tue May 10 21:41:54 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The Gates Foundation is coming together today for the first time in two years, and I am lucky to be on Teams to see everyone and thank them for their hard work.","date":"Tue May 10 21:41:54 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I've tested positive for COVID. I'm experiencing mild symptoms and am following the experts' advice by isolating until I'm healthy again.","date":"Tue May 10 21:41:53 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I'm fortunate to be vaccinated and boosted and have access to testing and great medical care.","date":"Tue May 10 21:41:53 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"World-changing ideas require bold thinkers and doers to transform them into reality. These new Advisory Group members for the @gatesfoundation’s Goalkeepers initiative are changing the world. https://t.co/xkzo8ot48W","date":"Tue May 10 19:54:58 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Katalin Kariko (@kkariko) saw the potential of mRNA to save lives when few others did–and she was willing to fight tooth and nail to pursue it: https://t.co/NLmWgQM8Lc https://t.co/tX6qquOe5N","date":"Sat May 07 16:44:32 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Thank you for having me, @EmmanuelMacron, and for your commitment to tackling some of the world's toughest challenges, like climate change and better health everywhere in the world. I’m excited to continue working towards a future without pandemics.","date":"Sat May 07 04:39:20 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"John’s leadership at @AfricaCDC has been remarkable – especially during the last two years. @PEPFAR’s work has saved tens of millions of lives, and there are many reasons to be hopeful about HIV prevention and treatment in the future.","date":"Fri May 06 22:54:13 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"If we’re going to prevent the next pandemic, the world needs the infectious disease equivalent of firefighters. Also in this video: a cute puppy. https://t.co/KDg2650nhe","date":"Fri May 06 17:04:56 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"@ShereenBhan @CNBCTV18Live Thanks for having me!","date":"Fri May 06 05:43:04 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"This is amazing, John and Ann. It’s great to see you supporting the next generation of innovators—the people we’re all counting on to make clean-energy breakthroughs.","date":"Thu May 05 21:39:22 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"It was an honor to meet front line heroes like Laura. Your heroic work is an inspiration to us all. https://t.co/d0Nc9Bchbu","date":"Thu May 05 01:36:43 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"What a day! I had a great time in London chatting with @amolrajan, @DrWaheedArian, and Professor Dame Sarah Gilbert about my new book. https://t.co/dJf4jfy39u","date":"Thu May 05 00:34:24 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I also had a chance to meet up with Gates Foundation Goalkeepers @DanielleAlakija, @abcholmes, @seyiakiwowo, @ThokoPooley, @je1bc, and Our World in Data's @MaxCRoser. https://t.co/SdMkxE9vhO","date":"Thu May 05 00:34:24 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Thanks, @TrevorNoah for the thoughtful conversation. I always appreciate your smart questions (and smarter jokes) about these really important issues.","date":"Wed May 04 21:44:06 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"If we’re going to make COVID-19 the last pandemic, we need the GERM team: https://t.co/VegAzRnjBE https://t.co/0CaQezG5dV","date":"Wed May 04 16:49:26 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"My new book, How to Prevent the Next Pandemic, is available now. Proceeds will be donated to Partners in Health in memory of Dr. Paul Farmer, who inspired the world with his commitment to saving lives: https://t.co/T5Nk5TVRJ2 https://t.co/4lhapJiMbw","date":"Tue May 03 17:02:21 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I was shocked to wake up to the news this morning. A reversal of Roe v. Wade would set us back 50 years and disproportionately impact the most vulnerable women in society.\n\nI support a woman's right to make their own decisions about their health care.","date":"Tue May 03 12:36:25 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"My new book comes out tomorrow – but @GatesNotes Insiders can get an early sneak peek and download a free chapter now: https://t.co/6cQv2FwB4W https://t.co/QwbjHOnywy","date":"Tue May 03 02:17:03 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"No one wants to live through this again – and we don’t have to. As @larrybrilliant says: Outbreaks are inevitable, but pandemics are optional. https://t.co/RSdJCbDyd3","date":"Mon May 02 21:29:33 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I’ve been lucky to spend time with, and learn from, many extraordinary teachers over the years, like these incredible Washington State teachers. I appreciate their dedication and resilience. #TeacherAppreciationWeek https://t.co/aZeLqEKFkz","date":"Mon May 02 18:26:09 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The world can make COVID-19 the last pandemic: https://t.co/b3bHaQ3eLr https://t.co/wnKIfARZzh","date":"Sun May 01 17:03:05 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The world wasn’t ready for COVID, but we can choose to be ready next time. https://t.co/ghjikJDkPf","date":"Sat Apr 30 22:56:50 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I’m excited to chat with one of my favorite thinkers @FareedZakaria next week at @92Y! https://t.co/5tkkpBucjA","date":"Sat Apr 30 17:44:49 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"To avoid another COVID-19 – or worse – the world needs a full-time, paid team whose entire job is to prevent pandemics. I call it GERM: https://t.co/jvpjjg1jUY","date":"Fri Apr 29 20:26:31 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"I’m looking forward to this chat with @amolrajan at @howtoacademy and @penguinlive.","date":"Fri Apr 29 16:55:20 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The best way to prevent pneumonia is to vaccinate children against the pathogens that cause it. This is an impressive effort. #LongLifeForAll @MoHFW_INDIA https://t.co/G1TOdGuDnZ","date":"Thu Apr 28 16:51:00 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Giving a TED talk is always a memorable (and nerve-wracking!) experience. Beyond the talk, I also got to listen to the stories of frontline workers and catch up with some of the people working to make the world a more equitable place: https://t.co/dTRJk1uJGM","date":"Wed Apr 27 17:10:41 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Each day, polio workers around the world cross mountains and deserts to bring vaccines to kids. It’s up to us to match their dedication with our support. #EndPolio","date":"Tue Apr 26 18:19:10 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Building a software company is nothing compared to building a Roman fire bucket. I tried my hand at it for my latest TED Talk: https://t.co/kKsR0yKIhV https://t.co/cV9lphEFtO","date":"Mon Apr 25 22:05:15 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"The Global Fund is one of the kindest things people have ever done for one another. Replenishing it will lower malaria cases by almost two thirds in just four years, strengthen health systems, and help ensure COVID-19 is the last pandemic. #WorldMalariaDay","date":"Mon Apr 25 20:26:30 +0000 2022","user_id":"50393960"},{"handle":"BillGates","text":"Happy World Book Day! I try to read every day, whether I have a busy day at the office or am out for a hike. It’s one of my favorite ways to learn new things and better understand the world. https://t.co/cW71Lsv8Zr","date":"Sat Apr 23 15:36:19 +0000 2022","user_id":"50393960"}]