[{"handle":"chrisspooner","text":"Follow along with my latest tutorial to create this colourful 3D isometric text effect in Adobe Illustrator \nhttps://t.co/VdG520qald","date":"Fri Jun 24 20:40:01 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"@moloneymike Thanks Mike!","date":"Wed Jun 22 20:05:05 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"@adrianpelletier Thanks for always being there along the way!","date":"Wed Jun 22 20:04:59 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create a colourful 3D isometric text effect in Adobe Illustrator. Watch here: https://t.co/eoYqWRTm5Q","date":"Wed Jun 22 19:59:53 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Big milestone unlocked on my Spoon Graphics YouTube channel! Thank you to everyone who has subscribed since I started it back in 2015 🙌 https://t.co/geAJ6uHqvI","date":"Tue Jun 21 21:07:51 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new download for Access All Areas members on Spoon Graphics! Easily give your photographs a hand-painted look with this ‘Painted Effect’ Action and Smart PSD for Adobe Photoshop:\nhttps://t.co/EZw153xJ5W","date":"Thu Jun 16 20:10:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"New download! Painted Effect Photoshop Action and Smart PSD: https://t.co/EZw153xJ5W","date":"Mon Jun 13 13:00:59 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create a retro logo design (without any design software!)\nWatch here: https://t.co/eNK5Y31NhJ","date":"Wed Jun 08 20:25:01 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"New tutorial! How to Create a Retro Logo Design (without any design software!)\nhttps://t.co/eNK5Y31NhJ","date":"Wed Jun 08 11:18:15 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my new Photoshop tutorial to create this retro striped text effect using the ‘Step &amp; Repeat’ technique, plus a couple of other clever PS tricks!\nhttps://t.co/dewgXrmaDI","date":"Fri May 27 20:55:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create a retro striped text effect in Adobe Photoshop. Watch here: https://t.co/fsQqEogJ88","date":"Wed May 25 09:40:28 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my new tutorial to see how you can add some really cool bitmap effects to photos and text in Photoshop with a few simple settings.\nhttps://t.co/Wq7cuMfb0Q","date":"Fri May 20 20:25:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create detailed bitmap effects in Photoshop. Watch here: https://t.co/zGer8tha6B","date":"Wed May 18 15:13:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"@Ian_Barnard I’ve had to see this every day for the last 7 years! I keep secretly turning it around 🤫😆 https://t.co/bIy05Nh2aV","date":"Tue May 17 09:54:03 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"This lovely handwritten font named Coastly is the latest premium download for Access All Areas members on Spoon Graphics. Grab it here: https://t.co/dIZyCY0wFT","date":"Mon May 16 13:44:36 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"These lovely Clean Tones Photoshop Actions and Lightroom Presets are the latest download for Access All Areas members on Spoon Graphics\nhttps://t.co/GZLY0psoZ8","date":"Mon Apr 18 19:33:53 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"This ‘Double Color Exposure’ effect is so easy to create! Find out how in my latest tutorial\nhttps://t.co/qKn35yfY42","date":"Fri Apr 15 20:20:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create the ‘Double Color Exposure’ effect in Photoshop. \nWatch here: https://t.co/9iuIaJztnB","date":"Wed Apr 13 12:03:44 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"@Jasoniusminimus Overlay also works for more contrast. You could even reduce the opacity to fine tune the result if it’s too dark/light","date":"Wed Apr 06 07:05:27 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Spoon Graphics has turned 15 years old! Come and take a look at the latest behind-the-scenes stats and figures: https://t.co/Jm5LUrj4An","date":"Mon Apr 04 20:17:31 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Discover 5 different ways to create the popular Duotone effect in Photoshop with my latest video tutorial: https://t.co/KIemBHVgIw","date":"Sat Apr 02 15:40:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new video out today showing 4 ways to create the Duotone effect in Photoshop\nWatch here: https://t.co/QoHoJqdRDJ","date":"Wed Mar 30 20:28:35 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my latest tutorial to create a surreal art piece featuring the ‘pixel sorting’ effect - https://t.co/qCyxPYQAVu","date":"Fri Mar 18 17:35:01 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create the ‘Pixel Sorting’ stretched pixel glitch art effect in Photoshop\nhttps://t.co/l7RLjMvnsW","date":"Wed Mar 16 22:23:10 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"This cool ‘Hypnotic Oil Paint Photoshop Effect’ is the latest download for Access All Areas members on Spoon Graphics\nhttps://t.co/4Q4wBnuGJV\nIt generates an amazing acid-washed effect with vibrant neon colours and grainy textures!","date":"Mon Mar 07 23:49:11 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Find out how to create detailed vintage designs the EASY way with my latest video tutorial Watch here: https://t.co/SVt3tmc6sY","date":"Fri Mar 04 20:35:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create vintage designs the EASY way with the help of this great new tool from @HeritageType \nhttps://t.co/CUGNyqWknH","date":"Wed Mar 02 21:30:09 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"New tutorial! How to Create Vintage Designs the Easy Way!\nhttps://t.co/CUGNyqWknH","date":"Wed Mar 02 12:17:29 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"This unique collection of Refracted Ray Gradient Textures is the latest download for Access All Areas members on Spoon Graphics\nhttps://t.co/WixHrRC3HW","date":"Mon Feb 21 17:05:04 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my latest tutorial to create this colourful stacked text effect. I share a clever trick to alter the spacing of the text with a cool easing effect and show how to give it the look of an old VHS tape box by adding textures in Photoshop.\nhttps://t.co/ehzANw3LzM","date":"Sat Feb 19 18:01:21 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create this colourful stacked text effect. \nWatch here: https://t.co/E4T4ea9TaC","date":"Wed Feb 16 22:55:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"NEW tutorial! How to Create a Colourful Stacked Text Effect\nhttps://t.co/E4T4ea9TaC","date":"Wed Feb 16 16:43:13 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"In my latest tutorial I show you my process of converting a rough sketch into a vector illustration by turning one of my old doodles into a cute yeti cartoon character.\nhttps://t.co/YKlF9tf2Ec","date":"Fri Feb 04 20:02:09 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"See my process of turning a rough sketch into a vector character illustration in my new tutorial for Adobe Illustrator. Watch here: https://t.co/GdB9nJbPD8","date":"Wed Feb 02 23:55:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"NEW Illustrator Tutorial! Sketch to Vector Character Illustration\nhttps://t.co/GdB9nJbPD8","date":"Wed Feb 02 16:44:27 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"This set of ‘Winter Collection’ Lightroom Presets is a brand new download for Access All Areas members on Spoon Graphics https://t.co/88BgDcHk5U","date":"Mon Jan 31 10:49:25 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my latest tutorial to discover a clever combination of Photoshop filters that converts an image into a realistic looking watercolour painting effect!\nhttps://t.co/oyrKFNYlry","date":"Fri Jan 21 21:50:01 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create a watercolour painting effect in Photoshop using a combination of built-in filters. Watch here: https://t.co/k5WVYQAUFx","date":"Wed Jan 19 09:35:43 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"This great set of textured illustration brushes for Procreate is the latest download available to Spoon Graphics Access All Areas members \nhttps://t.co/050WHDsFTx","date":"Mon Jan 17 21:02:35 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new roundup post out on Spoon Graphics collating the best grit, grain &amp; grunge texture packs. These resources are great for roughing up and distressing your digital designs!\nhttps://t.co/ej3ezA3C6z","date":"Wed Jan 12 13:20:41 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my latest tutorial for Adobe Illustrator to learn how to create this colourful geometric triangle pattern. It’s ideal for adding colourful backgrounds to your designs, or even as interesting abstract poster art!\nhttps://t.co/cMvvitWAjg","date":"Fri Jan 07 19:05:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create a geometric triangle pattern in Adobe Illustrator. I show a cool trick for automatically applying colour fills, and explain how to make the pattern seamlessly repeat.\nhttps://t.co/nQWZhBvapd","date":"Wed Jan 05 22:05:02 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"New post! How to Create a Geometric Triangle Pattern in Adobe Illustrator\nhttps://t.co/nQWZhBvapd","date":"Wed Jan 05 15:55:07 +0000 2022","user_id":"14544190"},{"handle":"chrisspooner","text":"It's that time of year again (no, not Christmas) when I look back at my most popular content. I had a big hitter this year with one of my YouTube videos!\nSpoon Graphics Greatest Hits: My Most Popular Posts of 2021 - https://t.co/o6UnkgmLRM","date":"Mon Dec 20 22:57:27 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Treat yourself to some new fonts for the new year with a 99% discount! https://t.co/Y2mVZRQMwa\nThis new bundle contains 18 font families in a variety of styles with a combined total of hundreds of individual fonts.","date":"Wed Dec 15 13:54:07 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Ever since the addition of the Object &gt; Pattern &gt; Make workflow to Adobe Illustrator in CS6, creating seamlessly repeating patterns has never been easier! Follow along with my new tutorial to learn how: https://t.co/GuPJUz3CKQ","date":"Mon Dec 13 14:50:02 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my latest tutorial to create a retro logo design with texturing effects https://t.co/07mqH0YAhD","date":"Sat Dec 11 19:00:57 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create a retro logo design with texturing effects using Adobe Illustrator &amp; Adobe Photoshop. Watch here: https://t.co/LmEY7sqnVI","date":"Wed Dec 08 22:01:06 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"New tutorial! How to Create a Retro Logo Design with Texturing Effects\nhttps://t.co/LmEY7sqnVI","date":"Wed Dec 08 09:48:38 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"This fantastic set of 28 hand-drawn burst graphics by @simonhartmann is the latest download for Access All Areas members on Spoon Graphics. Get your hands on over 2.7GB of FREE resources from his website too! https://t.co/Z0V8iBNFGE","date":"Mon Dec 06 21:50:01 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"New post! 28 Hand-Drawn Burst Elements for Access All Areas Members\nhttps://t.co/Z0V8iBNFGE","date":"Mon Dec 06 14:37:54 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new inspiration post out on Spoon Graphics showcasing abstract collage art with surreal and often hilarious results. Which one is your favourite?\nhttps://t.co/Cw5gf49g6L","date":"Thu Dec 02 15:45:08 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"New post! Showcase of Abstract Collage Art with Surreal and Often Hilarious Results\nhttps://t.co/Cw5gf49g6L","date":"Mon Nov 29 20:38:00 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my latest tutorial to create a glowing effect in Adobe Photoshop \nWatch here: https://t.co/gldvvfbda1","date":"Thu Nov 25 12:38:35 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"These great Film Look Lightroom Presets are the latest download for Access All Areas members on Spoon Graphics! https://t.co/1GxYAMeFz7","date":"Mon Nov 22 20:03:58 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Don’t miss my latest FREE download on Spoon Graphics. These Light Leaks Photo Overlays help to give your modern digital photos a nostalgic, retro look.\nhttps://t.co/LO61yAAJ2R","date":"Thu Nov 18 17:40:03 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new free download on Spoon Graphics today! Help yourself to this collection of Light Leaks Photo Overlays to add retro effects to your images\nhttps://t.co/LO61yAAJ2R","date":"Mon Nov 15 21:40:02 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Download My Free Light Leaks Photo Overlays to Add Retro Effects to Your Photos\nhttps://t.co/LO61yAAJ2R","date":"Mon Nov 15 11:24:11 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Don’t miss my latest tutorial on YouTube showing how to create this cool ‘Speed Lines’ effect in Adobe Photoshop. https://t.co/YvGTLTFqkE","date":"Fri Oct 29 13:40:04 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my new tutorial to create this ‘Speed Lines’ text effect in Adobe Photoshop. We’ll then finish it off with my FREE Grainy Speckle Textures from Spoon Graphics\nhttps://t.co/q9qRVJlkl3","date":"Wed Oct 27 18:59:13 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"This set of Wood Grit Distortion Textures by @GhostlyPixels is the latest download for Spoon Graphics Access All Areas members\nhttps://t.co/TQZ6O4b2e6","date":"Mon Oct 25 15:51:36 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I share some tips and techniques for preparing a business card design for print in my latest tutorial. See how to set up your document with bleed and discover some useful CMYK combinations to create different blacks.\nhttps://t.co/3zCreaZ3oi","date":"Wed Oct 20 10:12:54 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"In my latest video tutorial I show how to create this money text effect in Adobe Illustrator using just the Appearance panel... No need to outline the text first so it's still editable!\nhttps://t.co/T0UuQkSJfd","date":"Sat Oct 16 15:01:18 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@runninghead360 With this tutorial you can make your own! 😂","date":"Thu Oct 14 13:27:28 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create a money text effect in Adobe Illustrator, just like the engraved style on dollar bills. \nWatch here: https://t.co/LGLhOo3Dto","date":"Wed Oct 13 19:43:19 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@chewedkandi Sorry for my late response I totally missed your tweet! It's strange, I have just been having a nosy at my search performance... 25% reduction in impressions/clicks for my best performing keyword, yet still 1st place position. It's good to know it's not something I've done wrong!","date":"Tue Oct 12 09:02:20 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Loads of top design resource products are on offer at HALF-PRICE this week for the @designcutsdeals birthday event, grab as many as you can!\nhttps://t.co/uAKicCwiKk https://t.co/vDXcI0YGkd","date":"Mon Oct 11 12:30:54 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"This new bundle contains a real variety of useful tools, currently discounted by over $2000 to just $29 with a 98% discount!\nhttps://t.co/s16lObY4RB","date":"Wed Oct 06 11:35:55 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new roundup post out today featuring the best fonts for creating vintage logos and designs. These typefaces aren’t just individual fonts, they are collections of several font styles that perfectly complement each other.\nhttps://t.co/rKJozHD2GT","date":"Mon Oct 04 20:25:02 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@Ian_Barnard You're welcome! It's one of my go-to fonts along with Smoothy","date":"Mon Oct 04 11:29:39 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"New post! The Best Fonts For Creating Vintage Logos and Designs\nhttps://t.co/rKJozHD2GT","date":"Mon Oct 04 10:08:46 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my new Illustrator tutorial to learn some useful tips and tricks for creating vintage badge logos\nhttps://t.co/zmfOi3L3f7","date":"Fri Oct 01 16:45:10 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"This huge Pencils &amp; Paint Texture Kit for Procreate is the latest download for Access All Areas members on Spoon Graphics! https://t.co/7ptN5I92u2","date":"Fri Oct 01 16:42:27 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create a vintage badge logo in Adobe Illustrator.\nWatch here: https://t.co/w3t39zVxit","date":"Wed Sep 29 19:45:05 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"New tutorial! How to Create a Vintage Badge Logo in Adobe Illustrator\nhttps://t.co/w3t39zVxit","date":"Wed Sep 29 10:36:40 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@lunchboxbrain Thanks! Subscriber counts are still growing, especially over at YouTube so that's the main thing. Even after a cull of a few tens-of-thousands of inactive newsletter subscribers, it's still getting bigger every day (and costing me a fortune!)","date":"Tue Sep 28 12:44:52 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@tommythetechie Looking at the highest traffic peak in 2013, I'd need to find an additional 26,000 visitors to get back to that level, 10,778 of them from StumbleUpon... I don't think that's going to happen! 😂","date":"Tue Sep 28 12:41:15 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@thelogosmith Interestingly there are no 'poor URLs' in my Google webmaster account, but plenty that 'need improvement'. Quite a few 'Google URLs' for Desktop, none for mobile. \nThe whole site is due an overhaul but with so much old content it's a massive job","date":"Tue Sep 28 11:31:09 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@thelogosmith The only time I really check Analytics is during my yearly 'birthday post', I knew it had been in a slow decline for years, however it seems search traffic has nose dived since March 2021. I had to Google what Core Vitals were so that may well be part of the cause 😅😬","date":"Tue Sep 28 11:16:53 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@SocialMediaDale Keep an eye out for a new tutorial going out tonight!\nI also send out a newsletter the day after promoting the video on Spoon Graphics, so that might be the best way to hear about new uploads if YouTube decides not to tell anybody","date":"Tue Sep 28 10:37:57 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"What a sad picture from Google Analytics! Spoon Graphics traffic is now down to April 2008 levels, incidentally, that was back when I first joined Twitter.\nTraffic today is lower than on Christmas day from previous years.\nOh the good ol' days...\nYouTube is still on the up though! https://t.co/DiWbs3jWEO","date":"Tue Sep 28 10:32:35 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@kylegawley I've only just spotted this! That's great to hear. Sadly I don't think it would have quite the same effect these days!","date":"Tue Sep 28 10:14:38 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Help yourself to my latest free download on Spoon Graphics. These seamlessly repeating Grainy Speckle textures are supplied in JPG, PNG &amp; PAT format\nhttps://t.co/PzUcM2qkef","date":"Thu Sep 23 20:01:30 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Download my new seamlessly repeating grainy speckle textures for FREE: https://t.co/PzUcM2HVCP","date":"Mon Sep 20 14:48:24 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I totally forgot to share my new Illustrator tutorial yesterday! Follow along to create this wavy 3D distorted text effect: https://t.co/BA06wEc27l","date":"Thu Sep 16 09:43:27 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"These lovely vintage engraving lines textures are the latest premium download for Access All Areas members on Spoon Graphics\nhttps://t.co/Zts1PAoeVd","date":"Mon Sep 13 14:30:03 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my latest Photoshop tutorial to find out how to create trendy lettering illustrations the easy way! \nhttps://t.co/9nKc3yKJ58","date":"Fri Sep 03 16:20:06 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing you can create trendy lettering illustrations the easy way in Adobe Photoshop.\nWatch here: https://t.co/93PbblQym4","date":"Wed Sep 01 21:20:02 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"New tutorial! How to Create Lettering Illustrations the Easy Way!\nhttps://t.co/93PbblQym4","date":"Wed Sep 01 13:36:01 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"This brilliant collection of Black and White Lightroom Presets is the latest download for Access All Areas members. Choose from 49 dramatic effects to enhance your photos! https://t.co/h5GyCVa1fM","date":"Mon Aug 16 10:56:38 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"This latest inspiration showcase on Spoon Graphics features a real mix of art styles. Admire these stunning illustrations and digital paintings: https://t.co/ifblNlGJPs","date":"Thu Aug 12 16:50:03 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"It turns out wolves are a popular subject for artists and illustrators, but that’s no surprise when you consider these magnificent creatures have been depicted in mythology and folklore throughout history.\nCheck out my new inspiration showcase: https://t.co/ifblNlGJPs","date":"Mon Aug 09 20:38:16 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my latest tutorial to see how you can automatically generate unique digital camouflage patterns using a mixture of Photoshop filters\nhttps://t.co/mTem3R32qu","date":"Sat Aug 07 14:50:02 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to make digital camo patterns in Adobe Photoshop. Watch here: https://t.co/wfGyvHqhhk","date":"Wed Aug 04 20:50:02 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"New Video Tutorial! How to Make Digital Camo Patterns in Photoshop\nhttps://t.co/wfGyvHqhhk","date":"Wed Aug 04 13:42:02 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"@cesarmillan I'm sorry to hear about Junior's passing. We saw you live in 2010 just before we adopted our black Labrador Jake, who also passed away earlier this year at 11 years old.\nYour, Daddy, &amp; Junior's teachings helped to make him the perfect dog!  \nhttps://t.co/fnMDanZfdt","date":"Fri Jul 30 15:01:34 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"Follow along with my latest tutorial to create this modern gradient logo design.  I'll show you how Illustrator's shape tools make it easy to construct the basic vector design, then we'll apply a vibrant colour scheme using gradients.\nhttps://t.co/gkuRSQHQQp","date":"Fri Jul 23 15:35:06 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"I have a new tutorial out today showing how to create a colourful modern gradient logo design using Adobe Illustrator.\nWatch here: https://t.co/fUajEKyyQi","date":"Wed Jul 21 19:35:03 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"New Video Tutorial! How to Create a Modern Gradient Logo Design in Adobe Illustrator\nhttps://t.co/fUajEKyyQi","date":"Wed Jul 21 10:20:35 +0000 2021","user_id":"14544190"},{"handle":"chrisspooner","text":"These easy to use Actions and Smart PSD for creating halftone and engraved effects in Adobe Photoshop are the latest premium resources for Spoon Graphics Access All Areas members to download\nhttps://t.co/EMh4TaQfRY","date":"Mon Jul 19 14:40:36 +0000 2021","user_id":"14544190"}]