[{"handle":"David_Cameron","text":"As we pass 100 days since the start of Russia’s appalling and completely unjustified invasion of Ukraine, I joined @marthamaccallum on @FoxNews this weekend to discuss the ongoing crisis: https://t.co/EENbGFX4KY","date":"Mon Jun 06 09:38:17 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"As the nation comes together today to give our heartfelt thanks to Her Majesty The Queen on her #PlatinumJubilee, my tribute below: https://t.co/5REAgPLbc8","date":"Fri Jun 03 11:22:27 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"On this very special #PlatinumJubilee, I join the whole nation &amp; Commonwealth in celebrating Her Majesty The Queen's extraordinary reign &amp; thanking her for such remarkable &amp; unwavering service over 70 years. There is no greater public servant the world over. God save The Queen! https://t.co/Gc2aZO8KEL","date":"Thu Jun 02 14:24:04 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"As we start this special week of celebrations for Her Majesty The Queen's #PlatinumJubilee, I was delighted to join @Emmabarnett on @bbcworldservice to discuss The Queen's role as our country’s greatest diplomat. Listen here: https://t.co/aE7tlx3UwP","date":"Mon May 30 08:18:09 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Delighted Richard Walker is becoming an @AlzResearchUK Ambassador! @IcelandCharity are already amazing supporters of dementia research and I know having Richard on board will take that to the next level. Thank you @icelandrichard and looking forward to working together.","date":"Wed May 11 11:55:34 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"https://t.co/qs0nixbyb7","date":"Thu May 05 12:01:22 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"In their important report published today, @Policy_Exchange has lifted the lid on how a vocal minority is attempting to undermine efforts to prevent such radicalisation. We can't let the Prevent strategy be defeated by extremists. My article in @TheTimes: https://t.co/UldQcLaRuz","date":"Tue Apr 26 07:16:24 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"The full @Policy_Exchange report, including my Foreword, can be found here: https://t.co/219Bu4gMAb","date":"Tue Apr 26 07:16:24 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Extremism sows division and hatred and threatens our way of life. It's crucial that we counter the warped extremist narrative that drives many to violence and jeopardises the cohesion that is vital to Britain's success.","date":"Tue Apr 26 07:16:23 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"The pandemic has shown us the power of scientific research. The UK Vaccine Taskforce was an absolute triumph – now we can, and must, do the same for dementia.\n\nListen below to the latest Stories of our times podcast:\nhttps://t.co/zOYJjpQNyA","date":"Tue Apr 12 13:02:20 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Ultimately, this can’t go ahead if blocked in the courts but I hope the Government will pursue and exhaust all legal avenues.","date":"Sat Apr 09 12:16:29 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"This is incredibly disappointing news. I believe the arguments for a new Holocaust Memorial and Learning Centre located next to Parliament - the home of our precious democracy - are compelling. This project has my overwhelming support. https://t.co/V11dsmoa9K","date":"Sat Apr 09 12:16:29 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Great to see this latest breakthrough study. The more we understand about the potential causes of Alzheimer’s disease, the more equipped we become to treat it. #ResearchWillWin","date":"Mon Apr 04 18:20:22 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Earlier today I joined @DanaPerino &amp; @BillHemmer on @FoxNews @AmericaNewsroom to discuss the urgent need for the West to redouble our efforts in support of Ukraine. Let's do everything we can economically to show that Putin’s Russia is a pariah state. https://t.co/H0rEqjBNg5","date":"Wed Mar 30 19:30:47 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Judge Putin by his deeds, not by his words. Plus, why Putin must play no part in the G20. My interview with @JohnBerman on @CNN today.","date":"Wed Mar 30 18:14:52 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Putin’s tactics in Ukraine are truly horrific. Innocent civilians continue to be abducted &amp; deported to Russia. I join @zminaUkraine &amp; the people of Ukraine in demanding the immediate release &amp; safe return of #TheTaken. On this Day of Action, show Putin that the world is watching https://t.co/0HwQFy1PPs","date":"Mon Mar 28 17:01:30 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Dementia is not an inevitable part of ageing; it’s caused by diseases of the brain. I’m proud to be working with @AlzResearchUK to change perceptions and raise vital funds for research. https://t.co/88EkBEHAfY","date":"Mon Mar 28 14:56:45 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"“We need to prime the pump with research &amp; money &amp; resources”. On @NickFerrariLBC earlier, discussing dementia research &amp; what I’m doing as President of @AlzResearchUK to help get treatments over the line. https://t.co/0i7kaJH4Ym","date":"Mon Mar 28 12:37:58 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"10 years ago I launched the Dementia Challenge. We've made great progress in dementia research since &amp; are on the cusp of life-changing treatments. But we need to go further, faster &amp; act now to make this a reality. My interview today in @thesundaytimes https://t.co/ES4T9XgVk8","date":"Sun Mar 27 11:05:39 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"With all that's going on in the world at the moment, I was pleased to join the impressive international students at @sciencespo Paris this week to discuss everything from the heinous war in Ukraine to environmental policy; integration issues to Brexit. Thank you for your welcome. https://t.co/m6AjwMTJ8G","date":"Fri Mar 25 17:03:10 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"As this dread­ful war con­tin­ues, the ul­ti­mate ques­tion for world lead­ers will be blunt and simple: Did you do every­thing you pos­si­bly could to help? My @WSJ article on why I fear we’ve got some way to go before we get to a full-throated “yes”. https://t.co/dhDoCvOoXk","date":"Thu Mar 24 15:15:44 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Thank you to everyone involved. To Rizvana and the Chippy Larder for organising. To Bruern Farms for all their hard work and support. And, especially, to those in and near Chipping Norton who donated so generously. Now for the long drive back…!  #StandWithUkraine 🇺🇦 https://t.co/iQf65fw902","date":"Sun Mar 20 10:11:26 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"So nearly 1,000 miles covered, over 20 hours of driving, and one successful delivery made. https://t.co/V5egEM0kgf","date":"Sun Mar 20 10:11:26 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"The work that the Polish Red Cross are doing around the clock to assist Ukrainian refugees is truly inspiring, and knows no bounds. They are being supported throughout by the Polish public services and local communities. It was heartwarming and humbling to see. https://t.co/9VT6OBTwDm","date":"Sun Mar 20 10:11:25 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"We arrived at the Red Cross warehouse in Poland at about 10pm. Huge thanks to all the volunteers and local firemen for their warm welcome, and for helping unload our lorry, full of essential donated supplies for refugees arriving in Poland. https://t.co/qV8W7hlm9H","date":"Sun Mar 20 10:11:23 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"We then made good time. Solidarity with our Ukrainian neighbours being so clearly displayed on the motorways across Germany and Poland spurred us on. https://t.co/eoK54DSgLh","date":"Sun Mar 20 10:11:22 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Note to self: next time hire a van with a spare tyre! Thank you to the brilliant mechanic in Germany who put us back on the road. https://t.co/cKNI8V5rv4","date":"Sun Mar 20 10:11:17 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Ukraine delivery update… Yesterday was more eventful than we anticipated. Having hit the road before dawn our eagerness soon proved futile as our tyre blew on the motorway! This put the schedule back half a day… https://t.co/GfHzdEV5ul","date":"Sun Mar 20 10:11:10 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Delivery successfully made! #StandWithUkraine️ 🇺🇦 https://t.co/0eisBor72z","date":"Sat Mar 19 22:20:13 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"And talking of driving, there’s lots still to do! Today we head into Poland for the delivery. More later… #StandWithUkraine️ https://t.co/h8KNQ3dhDQ","date":"Sat Mar 19 09:22:24 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Another very early start this morning. Great to be doing this with the amazing Rizvana Poole - a Labour town Councillor from Chipping Norton. It’s a cross party effort! https://t.co/R3qeS5UcCF","date":"Sat Mar 19 09:22:19 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"It’s her leadership, tenacity and relentless positive energy that got the Chippy Larder off the ground and made it into the outstanding community resource it is today. It’s her drive that got us here. https://t.co/vlt1EUxb63","date":"Sat Mar 19 09:22:19 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"I'm currently driving to Poland with two Chippy Larder colleagues to make our delivery to the Red Cross. It’s going to be a long drive, but I’ll keep you updated along the way. #StandWithUkraine️ https://t.co/T0ORCT4Eek","date":"Fri Mar 18 17:24:37 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"The generosity of the community in West Oxfordshire - and of the British people more generally - has been typically phenomenal, stepping up to help our neighbours in their hour of need. 🇬🇧🇺🇦","date":"Fri Mar 18 17:24:36 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"… into this - to fill a small lorry with everything from nappies to sanitary products, warm clothes to first aid kits. https://t.co/Ql0b2MzuBE","date":"Fri Mar 18 17:24:35 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"In the last fortnight we’ve appealed for the things that refugees from Ukraine need as they arrive in Poland. The response has been amazing. The brilliant Chippy Larder team have turned this… https://t.co/VYsKXpdm4r","date":"Fri Mar 18 17:24:29 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"During lockdown we did thousands of deliveries and our “store” is now open and well used. https://t.co/3qGJtCAKiG","date":"Fri Mar 18 17:24:22 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"For the last two years I've been volunteering each week at the Chippy Larder, a food project in my local town, which helps low income families with surplus food from supermarkets (and cuts food waste at the same time). https://t.co/oXZL1os1YM","date":"Fri Mar 18 17:24:21 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"My thoughts &amp; prayers are with the family of Jamal Edwards MBE. He was a great friend to @NCS &amp; a valued Patron, supporting &amp; inspiring young people to be the best they could be, leading from the front &amp; showing what's possible with hard work &amp; determination. Such a sad loss.","date":"Mon Feb 21 14:34:16 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Great work from @AlzResearchUK – on the importance of good brain health, and how taking positive steps can help reduce the risk of dementia later on. Our brains are amazing and we need to do all we can to keep them healthy. #ThinkBrainHealth","date":"Tue Feb 08 14:25:45 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"There can be no finer example of dignified public duty &amp; service. On this 70th anniversary of her accession to the throne, I join all those across the nation, the Commonwealth &amp; the world in expressing my heartfelt gratitude to The Queen. Thank you Your Majesty. #PlatinumJubilee https://t.co/GvvLIyyeOK","date":"Sun Feb 06 08:48:43 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"As we mark the 50th anniversary of Bloody Sunday, my thoughts are with the victims' families. No words can ever dampen the pain they have suffered, but I hope the full apology I made in 2010 helped. What happened was unjustified, unjustifiable and wrong. https://t.co/I8xDpzJYyU","date":"Sat Jan 29 08:31:29 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"We must never forget. #HolocaustMemorialDay https://t.co/rxLLqRZHdN","date":"Thu Jan 27 12:51:36 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"Last month the @IGC_SFi #FragilityCouncil, which I co-chair, urged the international community to act to prevent imminent famine in Afghanistan. This op-ed from fellow council member @LakhdarBrahimi sets out three key imperatives world leaders can focus on https://t.co/LzbAqpgP6E","date":"Wed Jan 12 15:50:06 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"News that dementia cases are set to triple by 2050 reminds us of the shocking scale of the condition worldwide. And that we must act now. I'm proud to chair @AlzResearchUK's EDoN initiative which sets out to detect dementia earlier and find a life-changing treatment sooner.","date":"Fri Jan 07 16:12:36 +0000 2022","user_id":"103065157"},{"handle":"David_Cameron","text":"With the passing of Archbishop Tutu, we have lost one of the world’s great humanitarians &amp; campaigners. Gentle, yet irrepressible, with great compassion &amp; humour, but also a fierce resolve to improve lives &amp; speak up for those who struggled to be heard. His legacy will live on. https://t.co/LWsKX6HcSP","date":"Sun Dec 26 10:53:26 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"It was a privilege having your picture taken by Tom Stoddart. He was quiet &amp; unassuming, yet had such an incredible track record spanning decades. Today, I write in The Sunday Times about his huge talent &amp; why his photographs were so special to my family. https://t.co/QD2hIBDM7V","date":"Sun Dec 19 12:21:18 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Disappointing news, but today’s ruling is a call for renewed urgency and investment in dementia research. Day by day, understanding of dementia increases and – with over 125 Alzheimer’s drugs currently in clinical trials – we must redouble efforts to secure effective treatments.","date":"Fri Dec 17 15:46:18 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"The factory was itself the outcome of huge inward investment efforts and the decision to go ahead with HS2. This is great news for the North East and for the whole country. 2/2 https://t.co/7dXz0h54ZG","date":"Fri Dec 10 10:17:56 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Six years after I opened Hitachi Rail's new state-of-the-art facility in Newton Aycliffe, County Durham, I'm thrilled to hear this week’s news that the new generation of HS2 trains will be built at the factory, bringing yet more jobs to the region. 1/2 https://t.co/B3SszCks1z","date":"Fri Dec 10 10:17:25 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"The ongoing crisis in #Afghanistan is severe. War, poverty, drought &amp; COVID-19 have had a devastating impact. Today, the #FragilityCouncil, which I co-chair, has issued a statement calling on the international community to take urgent action: https://t.co/jydxnuhM6N  @IGC_SFi https://t.co/lXAwBdv8cy","date":"Wed Dec 01 18:00:03 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Great fundraiser with Grapevine this week, raising more vital funds for @AlzResearchUK and dementia research. Huge thanks to everyone who gave their support. #MakeBreakthroughsPossible https://t.co/2GQ2RpHgzS","date":"Fri Nov 12 13:45:43 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"This spurred me on to launch the 100k Genomes Project &amp; become such an enthusiast for genomics &amp; its application within the NHS. Precision medicine is the future &amp; the UK is leading the way internationally. Thank you to everyone who took part in the study &amp; has played a role! 2/2","date":"Thu Nov 11 14:52:04 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Today’s study findings are hugely encouraging. Our darling Ivan had to endure so many invasive tests &amp; procedures during his short life to find out what was wrong. It was agony for him &amp; us... 1/2   https://t.co/1tmj7hYXob","date":"Thu Nov 11 14:51:55 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Today we pay our respects to our brave Armed Forces, and remember all those who made the ultimate sacrifice. At 11am and always. We will remember them. #RemembranceDay #LestWeForget https://t.co/RsEzgZ0Glv","date":"Thu Nov 11 10:32:53 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"It is five years since the UK Dementia Research Institute was announced. The @UKDRI was established with an unprecedented investment into dementia research, following my #challengeondementia. I’m proud to see it flourish. @UKDRI @The_MRC @AlzResearchUK @alzheimerssoc https://t.co/HfgFhmPFzo","date":"Thu Nov 04 13:05:37 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Excellent to visit @Roche this week in my capacity as @AlzResearchUK President. With progress into dementia research advancing, great to discuss the current challenges and opportunities faced, by industry and more widely. Together we can #MakeBreakthroughsPossible. https://t.co/GHYhsr9hB5","date":"Wed Nov 03 14:39:38 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Distressing and deeply concerning events taking place in Sudan. A statement below from the @The_IGC Council on State Fragility, which I co-chair with @MaEllenSirleaf and @DonaldKaberuka.","date":"Wed Oct 27 13:29:45 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Very sad news as a brave, wise and kind man has passed. https://t.co/oWodHEnJkP","date":"Mon Oct 18 13:46:52 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"This is the most devastating, horrific &amp; tragic news. David Amess was a kind &amp; thoroughly decent man - &amp; he was the most committed MP you could ever hope to meet. Words cannot adequately express the horror of what has happened today. Right now, my heart goes out to David’s family","date":"Fri Oct 15 14:36:04 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Very alarming and worrying news reports coming from Leigh-on-Sea. My thoughts and prayers are with Sir David Amess and his family.","date":"Fri Oct 15 13:11:06 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Devastated to hear the heartbreaking news that James Brokenshire has died, well before his time. He was a hard working and dedicated MP but, more than that, he was a thoroughly decent and lovely man, and devoted to his family. My thoughts and prayers are with them all today.","date":"Fri Oct 08 10:57:09 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"When it comes to the climate crisis, reducing emissions and driving economic growth for the poorest and most climate-vulnerable must go hand in hand. Discussing @TheCVF @BdhcLondon #COP26 climate prosperity plan this week w/ @MohamedNasheed @Ed_Miliband @PScotlandCSG &amp; others. https://t.co/Siw2fvunnq","date":"Tue Oct 05 16:30:00 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Today @AlzResearchUK has published its 2021 Annual Report. As President, I couldn’t be more grateful to everyone who supported dementia research, even during the most challenging circumstances. Find out more about our year: https://t.co/ijnZJ4Ylop #MakeBreakthroughsPossible","date":"Tue Oct 05 13:11:41 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Huge thanks to Scott Mitchell doing the #LondonMarathon for @AlzResearchUK. Your support for dementia research is incredible, and what an amazing way to honour Dame Barbara’s memory. Best of luck Scott - and to all #TeamARUK runners. We’re willing you on all the way!","date":"Sun Oct 03 08:32:45 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"As I said in 2014, this is \"an investment in British security, in British prosperity and our place in the world, transforming our ability to project power globally whether independently or with our allies.” That’s as true today as it was then. 2/3","date":"Sat Oct 02 19:04:38 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Many congratulations to everyone who contributed to this outstanding effort - particularly our phenomenally hard-working and dedicated military personnel. This is a proud moment for the Royal Navy and all our Armed Forces. Fair winds and following seas, HMS Prince of Wales! 3/3","date":"Sat Oct 02 19:04:38 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"It is seven years since I committed the UK to a second world-leading aircraft carrier. I am immensely proud that, as of this weekend, HMS Prince of Wales is fully operational, ensuring we will always have one carrier available, 100% of the time. 1/3 https://t.co/kTh4OsrdpG","date":"Sat Oct 02 19:04:37 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Huge thanks to @BillGates and @TheADDF for their support to improve dementia diagnosis, including for the @EDoNInitiative, which I chair. On #WorldAlzheimersDay we can see huge progress being made. Earlier detection of disease will transform research efforts and people’s lives.","date":"Tue Sep 21 15:37:57 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Today is #WorldAlzheimersDay and @AlzResearchUK is launching its #DementiaAttitudes Monitor. Data shows that willingness to get involved in dementia research is at an all-time high. Find out below how UK attitudes towards dementia are changing:","date":"Tue Sep 21 09:58:00 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"20 years ago today I held my phone and anxiously pressed redial repeatedly, trying to reach Sam who was working in NYC. I will never forget the worry, and the huge relief when, after some hours, I found out she was safe. Today, we commemorate those who were not as fortunate. 1/2","date":"Sat Sep 11 10:41:48 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"We remember the victims who so sadly lost their lives, the survivors and all those who were affected from the horror and devastation of 9/11. We pay respect to the heroes who risked their own lives to respond. These are human stories; human tragedies. We will never forget. 2/2","date":"Sat Sep 11 10:41:48 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Delighted to take part in @TheReunionBBC to discuss one of the things I remain most proud of from my time as Prime Minister - legislating for Same Sex Marriage. https://t.co/GRklB82C62","date":"Mon Aug 09 14:36:27 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"I am delighted that the Holocaust Memorial and Learning Centre has been given the green light to be built in London’s Victoria Tower Gardens. Here’s why: https://t.co/WThshsrgzn","date":"Thu Jul 29 18:45:16 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"In order to better understand and treat dementia, we must diagnose sooner. @EDoNInitiative is developing the diagnostic technologies needed to achieve this – huge thanks to @TheADDF for supporting EDoN's vital work.","date":"Tue Jul 27 10:28:29 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Sorry and saddened that efforts to #KeepOurPromise to the world’s poorest and restore 0.7% did not succeed today. See my full statement on #UKaid below: https://t.co/JcnCkEsycl","date":"Tue Jul 13 16:04:59 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Well done @England. It was not to be tonight, but you have done the nation proud and lifted spirits after such a challenging year. Whatever the score, football still came home tonight and the whole squad can hold your heads high. #ThreeLions 🏴󠁧󠁢󠁥󠁮󠁧󠁿","date":"Sun Jul 11 22:05:46 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Powerful research stories like this show so well why we need focused and sustained funding for dementia research.\n\nEarly detection is critical to ensure the success of future treatments, which @EDonInitiative is prioritising.\n\n@AlzResearchUK \n\nhttps://t.co/BglGY0uBcX","date":"Fri Jun 18 15:33:35 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Having set the commitment as PM to create a ‘Blue Belt’ around the UK’s overseas territories &amp; conserve over 4 million sq km of ocean, I’m enormously proud on this #WorldOceanDay to see such leadership being demonstrated by the UK &amp; great progress made. #30by30 @pewenvironment","date":"Tue Jun 08 16:31:34 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Today’s announcement by @US_FDA approving Aducanumab is undoubtedly an important moment, which we hope will encourage a renewed vigour for focus and investment in dementia research, here in the UK and around the world.","date":"Mon Jun 07 18:19:10 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"As @AlzResearchUK President, I want to echo thanks to our volunteers for your incredible support - particularly after the many challenges of the past year. Every day, you go above and beyond to drive dementia research forward, and this #VolunteersWeek we can't thank you enough.","date":"Wed Jun 02 14:52:20 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Huge congratulations to @Jill4Hartlepool on her historic &amp; richly deserved victory! Also well done to all Conservative candidates &amp; volunteers who have campaigned so hard these past weeks. @Conservatives continue to demonstrate how we are delivering on #PeoplesPriorities","date":"Fri May 07 14:10:45 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Around the country @Conservatives are working hard - investing in local areas, delivering key local services &amp; keeping streets safe. Only @Conservatives are committed to delivering on your priorities, so vote Conservative today &amp; help us build back better!  #VoteConservative https://t.co/kGue2OPYzu","date":"Thu May 06 12:08:14 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Statement from David Cameron, on the sad news that His Royal Highness The Prince Philip, Duke of Edinburgh has passed away: https://t.co/bxPfLQHeme","date":"Fri Apr 09 13:02:03 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Peter Ainsworth was a key driver of our modernising agenda in Opposition, particularly our environmental policy. It was an honour to have him in my Shadow Cabinet. He was also such a kind, generous &amp; thoroughly decent man &amp; will be greatly missed. My thoughts are with his family.","date":"Thu Apr 08 08:31:55 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"So very sad to hear that Cheryl Gillan has passed away. A hugely valued member of my front bench team, both in Opposition &amp; Govt, &amp; such a kind, hard working &amp; formidable Parliamentarian over three decades, she will be hugely missed. My thoughts are with Cheryl's family &amp; friends","date":"Mon Apr 05 15:48:37 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"This week @AlzResearchUK is hosting its annual research conference. My best wishes for #ARUKConf21 - and a huge thank you to conference supporters @IcelandCharity, who have now raised an incredible £5m for Alzheimer's Research UK.","date":"Wed Mar 24 16:03:53 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Just over a year ago @AlzResearchUK launched the @EDoNInitiative. The world has turned on its head since, but EDoN has still managed to progress at pace. Proud to chair its Board this week. Early detection is key to beating dementia sooner: https://t.co/ZTPP7hHYKf","date":"Thu Mar 04 14:48:32 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Huge 'thank you' to our brilliant NHS &amp; all the amazing staff &amp; volunteers working on the UK’s deeply impressive vaccine programme. I was proud to have my jab this morning &amp; encourage everyone to take theirs when the call comes - it's crucial we look after ourselves &amp; each other. https://t.co/62VOMvuOgw","date":"Tue Mar 02 12:20:33 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Join Dementia Research – a service that supports vital research studies across the country, and something I’m proud to have supported in No10 and as @AlzResearchUK President. Huge thanks to @beatdementia's 50,000 volunteers to date. You are helping #MakeBreakthroughsPossible","date":"Fri Feb 26 15:20:27 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Global action on climate change is vital, and we must not leave those in fragile countries behind. Great to speak to @camanpour this week about the #FragilityCouncil and @g7plus’ call for #Energy4Stability. Full interview clip available here: https://t.co/lnDTlfrtCI","date":"Fri Feb 26 12:11:42 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Developed countries must boost investment and make clean energy in fragile states a priority. My @BDliveSA article with @MaEllenSirleaf sets out why: https://t.co/BLZ7Y1mEKR #FragilityCouncil #Energy4Stability","date":"Thu Feb 25 12:42:52 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Investing in local, green energy can reduce poverty and increase stability, for those in the most fragile states and for us all. Good to speak to @bbcworldservice earlier about @The_IGC and @g7plus call for #Energy4Stability: https://t.co/IYaj4bOt5o","date":"Wed Feb 24 18:26:27 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"800 million people have no access to electricity, and 80%+ of them live in fragile states. @The_IGC #FragilityCouncil, which I co-chair with @MaEllenSirleaf and @DonaldKaberuka launches its call today for #Energy4Stability. Join us and @g7plus in the call: https://t.co/1xm1DhZ0kl https://t.co/kCHzeufcKa","date":"Wed Feb 24 10:03:16 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Given all the gloom, here's a wholeheartedly positive book about the future of medicine. The science is thrilling, the hope &amp; compassion compelling, as Euan Angus Ashley lays out the astonishing advances in our application of the human genome to medicine. https://t.co/8Cc1pMDQAs","date":"Tue Feb 23 14:08:50 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"This month #ARUKResearchImpact has helped transform understanding of the importance of heart health in preventing dementia. Because what’s good for our hearts, is good for our heads. Huge thanks to @AlzResearchUK &amp; supporters who #MakeBreakthroughsPossible https://t.co/QTc2ghHgSC","date":"Tue Feb 16 12:24:51 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Huge congratulations to @Frank_Rothwell on completing his epic row across the Atlantic, and thank you to everyone who supported him along the way. An amazing achievement that has raised incredible funds for @AlzResearchUK. Frank, you’re an inspiration and should be very proud. https://t.co/hQhJ3fr7T9","date":"Mon Feb 08 12:40:16 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Captain Sir Tom Moore has been an inspiration - lighting up what has been such a dark year for so many. My thoughts and prayers are with his family and friends, and with all those who have so sadly lost a loved one due to this terrible virus. RIP Sir Tom, a great British hero. https://t.co/n8Zz4qK0Es","date":"Tue Feb 02 16:54:33 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"This #HolocaustMemorialDay , we honour and remember Holocaust victims and survivors. We listen and learn so we may educate future generations, and we say #NeverAgain to ensure atrocities of the past – including all acts of genocide – are never repeated. https://t.co/75WfnkWOjY","date":"Wed Jan 27 15:47:49 +0000 2021","user_id":"103065157"},{"handle":"David_Cameron","text":"Great work from @AlzResearchUK whose new campaign is all about getting us to #ThinkBrainHealth and make changes that will help reduce the risk of dementia. https://t.co/0YPZ0YoiEh","date":"Wed Jan 13 16:49:38 +0000 2021","user_id":"103065157"}]