[{"handle":"gatesfoundation","text":"ICYMI: @melindagates joined @Africa_com, @ChimamandaReal, @Shivonbk1, @ckarema, and @kachambwa to discuss the importance of equity and innovation for Africa's recovery.","date":"Thu Jun 23 21:09:41 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"#NTDs threaten the health of ½ the world’s population, but we have the tools to change this. \n\nThanks to a dedicated group of partners – and the donation of over 14 billion treatments – we’re ensuring that NTDs are #NeglectedNoMore. https://t.co/DcAaFMVgbw","date":"Thu Jun 23 18:00:09 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"The #KigaliSummit brings together global partners dedicated to supporting country programs &amp; building stronger, more equitable health systems—At @gatesfoundation we are stepping up our efforts to #EndMalaria &amp; #BeatNTDs through investments &amp; partnerships. https://t.co/BIwhhMLzOO","date":"Thu Jun 23 15:41:16 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Daniel Boakye of @TheENDFund has been working to eliminate river blindness &amp; other neglected tropical diseases (NTDs) for 45 years. Today, global support is urgently needed. “Otherwise, 45 years from now we may find ourselves back where we started.” https://t.co/TPAFiWOBuJ","date":"Wed Jun 22 20:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Don’t miss this important conversation between @ChimamandaReal and @melindagates—happening tomorrow, June 23. https://t.co/wvv92Sxfqn","date":"Wed Jun 22 13:00:12 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"The COVID-19 pandemic highlighted the importance of global collaboration. Public-private partnerships can help close the global vaccine gap by improving access for those in low-income countries. https://t.co/bMwcXOuXBn https://t.co/g7r1BHzKvK","date":"Tue Jun 21 22:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Gender equality is about more than ensuring women have access to the same opportunities as men. It is about tackling all the conditions—from poverty to climate change—that disproportionately create precarity for women in the first place.","date":"Sat Jun 18 18:00:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"The world has seen the failures of the global health system laid bare during COVID-19, but if we learn from these mistakes, we can help protect families from future pandemics. An important piece from @UNICEF and @GAVI: https://t.co/iZ21lIzhPJ","date":"Fri Jun 17 20:00:08 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Since the beginning of the pandemic, millions of working women around the world have left the workforce due to a lack of child care. \n\nInvesting in programs that help ease that burden is investing in gender equity and the economy.","date":"Fri Jun 17 18:00:08 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Women and children often bear the brunt of disease throughout the world. Building health systems that serve everyone will ensure this is no longer the case.","date":"Thu Jun 16 18:30:07 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"The impact COVID-19 has had on vulnerable communities cannot be understated, and ramping up global efforts to increase access for the most vulnerable in low-income countries will help millions.","date":"Wed Jun 15 22:00:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Kenya’s commitment to end gender-based violence is a critical step in the fight for gender equality. #EndGBV https://t.co/Slj9Rh3yxe","date":"Wed Jun 15 18:30:06 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Efforts to #EndPolio and stop #COVID19 go hand in hand.\n\nSince 2020, polio teams have:\n👩🏾‍⚕️Delivered COVID-19 vaccines around the world\n📝Trained and recruited vaccinators\n💪Strengthened local capacity for vaccine rollout \n\nRead more in @WHO's new report: https://t.co/m0PIHOnrWu","date":"Tue Jun 14 23:30:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Thank you, Warren. Your continued generosity has fueled our foundation’s impact in the U.S., and throughout the world.","date":"Tue Jun 14 22:19:35 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"The pandemic has placed significant strains on health systems in countries around the world. Investments in more equitable systems help the most vulnerable communities. https://t.co/9RfWeqRR7C","date":"Tue Jun 14 20:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"No matter where in the world you live, you should have access to life-saving treatments and vaccines. \nThat world isn’t here yet – and we have to make it so.","date":"Mon Jun 13 23:00:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Health equity should be a guiding principle for policymakers around the world. In Africa, coordination between governments, regional institutions, and global health organizations in response will help achieve this. https://t.co/wP7jIouqUd","date":"Mon Jun 13 19:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":".@EnockChikava, our interim director of Agricultural Development, shares his personal story with farming and why we're supporting small-scale farmers with a greater diversity of resilient crop varieties. https://t.co/LogBiWjBur","date":"Thu Jun 09 23:30:06 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Expanding access to quality and affordable child care will bring the world a step closer to gender equity.","date":"Thu Jun 09 22:15:03 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"The long-term campaign to eradicate polio from the world has nearly succeeded. But we are at a turning point. Cutting back on eradication efforts could lead to a global resurgence of polio paralyzing up to 200,000 children. https://t.co/YWWhk7lN1Y","date":"Wed Jun 08 18:00:09 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Every family deserves access to lifesaving vaccines.\nhttps://t.co/8P2L9DQzLA","date":"Tue Jun 07 19:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Every person deserves access to vaccines and treatments during a pandemic regardless of where they live. Health equity has to be a global priority.","date":"Sat Jun 04 13:00:09 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"“As severe weather events influenced by the climate crisis increase in frequency, women are even more vulnerable to the devastation.” Amplifying their voices is critical to addressing the climate crisis.\nhttps://t.co/MRfC3OYudr","date":"Fri Jun 03 22:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"When girls are valued as much as boys, the world prospers. Every child deserves the opportunity to achieve their full potential.","date":"Fri Jun 03 19:00:09 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"With Luxembourg increasing their pledge to the @GlobalFund by 30%, we are one step closer to saving 20 million more lives and averting 450 million infections of HIV, TB &amp; malaria. This is what it means to #FightForWhatCounts.👏","date":"Thu Jun 02 23:19:43 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"What would scaled, affordable, quality childcare do?\n\n🏁 Support women joining the labor force \n💸 Increase women's wages and decrease the pay gap \n📈 Grow national and global GDP https://t.co/D0CeHxPQnP","date":"Thu Jun 02 20:30:06 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"An amazing story for an amazing cause. Thank you @lionheart1759 for taking this courageous journey and supporting the effort to #EndPolio for good.","date":"Thu Jun 02 17:33:00 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Eradicating a disease requires dedication from scientists and community health care workers around the 🌍 —like vaccinating 18,000 people in just days to contain the final smallpox cases.\n \n@RadioDiaries shares the story of the last ever case of smallpox: https://t.co/ffTl21ysTq","date":"Thu Jun 02 04:38:37 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"“As long as humans have been dealing with it. We’ve been trying to eliminate it.”\nhttps://t.co/oDmsw4COpD","date":"Wed Jun 01 17:00:09 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"One of the great public health stories in recent years has been the advance of pneumococcal conjugate vaccinations in India 🇮🇳.\n\nThese vaccines help prevent pneumonia, meningitis, and sepsis, and they are now accessible to every child in the country. https://t.co/dJ6RsIFgo6","date":"Tue May 31 21:30:10 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"It is unacceptable that half of the world is at risk from malaria. This year, there is an opportunity to accelerate progress against this disease. \n\nBy committing $18B to replenish the @GlobalFund, the global community can #FinishtheFight and #EndMalaria within our lifetime. https://t.co/Lb4Jft4IMi","date":"Tue May 31 18:00:27 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"While the last mile of polio eradication is challenging, Pakistan's polio program has the experience and resolve to #EndPolio for good. To reach this goal, the world must provide the support that health workers need to protect against polio.\n\nhttps://t.co/x5Q866V15r","date":"Thu May 26 19:00:10 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"As @BillGates writes in a new op-ed, the world is at a turning point in the fight against preventable disease. \n\nWealthy nations can save millions of lives⁠—and prevent the next pandemic⁠—by helping low-income nations protect public health. https://t.co/JTPNi2Twe8","date":"Tue May 24 17:15:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Dr. Ruth Bishop passed away last week. She discovered rotavirus, helping to save millions of lives–and inspiring @MelindaGates &amp; @BillGates to launch the foundation. She will be missed.\nhttps://t.co/o0gTwLdxNc","date":"Mon May 23 20:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Everyone deserves the opportunity to live a healthy, productive life.","date":"Thu May 19 20:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"“The need for equitable health systems, innovative community-tailored approaches and greater political will to tackle both existing threats and future pandemics could not be clearer.”\n\nThe world must learn from COVID-19 to prepare for the next pandemic. \nhttps://t.co/ngrXWGa4pg","date":"Wed May 18 16:39:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"\"Think of it as a fire alarm for health...We need a global and national early-warning system for disease.\" https://t.co/UvHIkPx5FC","date":"Sat May 14 14:00:17 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"\"You have to be curious and question everything.\"\n\nThis optimistic and innovative thinking helped biochemist Dr. Katalin Karikó change the course of history. Her research in mRNA technology was an essential part of developing effective mRNA COVID-19 vaccines. https://t.co/LJ3EwJkJfE","date":"Fri May 13 15:38:36 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"\"With any crisis, we have to be focused on, what are the opportunities there?\" https://t.co/c4k9OgO6RC","date":"Wed May 11 17:07:56 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Saima is a volunteer in Pakistan working with families to protect children from polio. Despite vaccine refusals, violence and now two new wild polio cases, the dedication &amp; bravery of women like Saima will help us achieve a polio-free world. #EndPolio\n \nhttps://t.co/eJC8LN0yU4","date":"Tue May 10 21:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"We're excited to welcome our new Goalkeepers Advisory Group! 💫\n\nLearn more about these changemakers and community leaders  ➡ \nhttps://t.co/FC8vKXYiX7\n\n#Goalkeepers2030 https://t.co/eeBiW6p1qu","date":"Tue May 10 14:10:50 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"What would a better vaccine look like? @BillGates explains: https://t.co/Q4Wx4ehTYQ https://t.co/57RBU2aYOn","date":"Mon May 09 16:28:57 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"New diseases are inevitable, but pandemics are not. As the threat from COVID-19 recedes, @BillGates talks about how the world can stop new pathogens from becoming health emergencies. https://t.co/Vrls29Wr8M","date":"Sat May 07 14:00:13 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"COVID-19 caught the world unprepared. The next pandemic doesn’t have to.\n\nOn this episode of The Working Dinner, some of the world’s leading public health experts sat down to talk about lessons learned from this pandemic—and how to prevent the next one. \n\nhttps://t.co/nBt20cjLKp","date":"Fri May 06 17:00:11 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"“This new data suggests that we can fight Covid more effectively by refocusing our efforts on those who need it most.” - @EdwineBarasa @KEMRI_Wellcome \n\nhttps://t.co/lLtvV9nz7g","date":"Thu May 05 20:00:07 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"“If COVID-19 ends up being the last pandemic, it will be because we made the world a much more equitable place.” https://t.co/JwsmUxWo82","date":"Thu May 05 16:30:07 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Creating a world prepared for future pandemics won't be easy. But it is possible – investing in health equity can make COVID-19 the last pandemic. https://t.co/h5xTiCLtMs","date":"Wed May 04 19:07:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Follow our experts @findingpneumo, @joflakes, @ProfessorSow and @AnitaZaidi to stay informed.","date":"Mon May 02 23:02:18 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"We have lived through a historic pandemic.\n\nOn this episode of The Working Dinner, we asked some of the world’s leading public health experts: What lessons can we learn to prevent the next one from happening? https://t.co/XPpsFFHchh","date":"Mon May 02 23:01:54 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Fires 🔥 and pandemics🦠are more similar than you might think. \n\nWatch our newest episode of The Working Dinner series to see why.\nhttps://t.co/6fiM0NZrjo","date":"Mon May 02 20:29:17 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Preparing for the next pandemic will save lives. Two ways to do so are to continue developing vaccines and supporting the infrastructure needed for clinical trials. \nhttps://t.co/ahVrioE7tD","date":"Sat Apr 30 21:00:06 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Pandemic-related disruptions are leaving too many children unprotected from measles, creating a \"perfect storm\" for outbreaks.\n\n#WorldImmunizationWeek reminds us of how critical it is to restore global routine vaccinations to enable a #LongLifeForAll. https://t.co/LffJTiilHR","date":"Fri Apr 29 22:00:07 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Thanks to vaccines: \n \n🦠 Smallpox has been eliminated \n💉 Wild polio cases have decreased by over 99% \n🌎 Global child deaths have been cut in half \n👪 Generations of people can thrive and enjoy a #LongLifeForAll \n\n#WorldImmunizationWeek","date":"Fri Apr 29 14:00:14 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"In 1805, the first vaccination campaign began. \n\nOver 200 years later, we understand how important vaccines are in promoting a #LongLifeForAll. We're working together to ensure that even the most remote communities can access these lifesaving tools. https://t.co/ZcQxPagIbk","date":"Thu Apr 28 15:30:09 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Despite huge gains, malaria &amp; neglected tropical diseases continue to devastate the world’s poorest communities.  \n\nReplenishing the @GlobalFund &amp; committing to the Kigali Declaration on NTDs will give national programs resources to build a safer world.\nhttps://t.co/dlvYE37LF9","date":"Wed Apr 27 21:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"We’re thankful that vaccines have saved and improved billions of lives around the world.  \n \nBecause of these lifesaving tools, we can aim for a #LongLifeForAll. https://t.co/FiKTsXOfjg","date":"Wed Apr 27 18:29:15 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Thank you to the health workers, global leaders, and donors working towards a polio-free world.  \n\nDecades of collaboration &amp; commitment have kept millions of children safe from polio, but we must continue to fund these efforts to avoid a resurgence and #EndPolio for good. https://t.co/up4z83KjOr","date":"Tue Apr 26 16:15:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"India 🇮🇳 is making enormous progress in fighting pneumonia by making pneumococcal conjugate vaccine (PCV) available for free to all children, under its Universal Immunization Program—helping to save thousands of children under five each year. @MoHFW_INDIA https://t.co/kSiJlYM1sd","date":"Mon Apr 25 21:46:25 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Everyone deserves access to the lifesaving tools that can lead to a #LongLifeForAll.","date":"Mon Apr 25 21:46:25 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"A world free of malaria is within our sights but requires:\n\n🔬Innovation in tools and disease monitoring\n🤝Country ownership &amp; global partnerships\n💰A replenished @GlobalFund\n\nTogether, we can #EndMalaria within a generation.\n#WorldMalariaDay","date":"Mon Apr 25 18:48:14 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Paul Farmer’s generational legacy will never be forgotten. He was a global health hero who saved countless lives and inspired those around him.\nhttps://t.co/F06Xu87Ii1","date":"Sat Apr 23 18:00:07 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"The war in Ukraine and the COVID-19 pandemic are disrupting the global food supply.\n\nA new @Nature report highlights the impact of the world's intersecting crises and the steps that can help avert a global health and nutrition emergency. https://t.co/u3whAKXxWT","date":"Sat Apr 23 16:00:10 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Investing in @theGFF helps improve the health &amp; wellbeing of women and children across the world. #ReclaimtheGains https://t.co/lw1AR0UMDJ","date":"Fri Apr 22 21:45:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Health equity 🤝 pandemic preparedness\n\nBuilding fairness and accessibility into global health care systems will help protect humanity from future pandemics.\nhttps://t.co/g8dldPrjNW","date":"Fri Apr 22 17:45:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"1. Cash 2. Care 3. Data\n\nWomen's economic empowerment starts with these three priorities.","date":"Thu Apr 21 17:37:47 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"According to @EurasiaGroup, expanding access to child care could increase the global GDP by $3 trillion. \n \nThat's because access to affordable child care enables women the opportunity for better jobs and improved salaries. https://t.co/aAf220LNWR","date":"Wed Apr 20 17:20:21 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"World leaders are seeking solutions to the economic, health, and security challenges facing our planet. One remedy, writes @melindagates, starts with the women who hold up our societies in often invisible ways: https://t.co/BEJdOkU1iW","date":"Tue Apr 19 18:00:11 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Community health workers played a key role in identifying and treating Ebola cases during Liberia’s Ebola outbreak. Now the country hopes to use this model to stop the next infectious disease.\nhttps://t.co/0RUYfAcvh3","date":"Mon Apr 18 20:50:03 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Improving nutrition is critical for global economies, health, and wellbeing. https://t.co/QPrlFPYG8z","date":"Fri Apr 15 18:30:06 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Timing and geographic access are two of the top barriers to COVID-19 vaccine equity. \n\nIn Bangladesh, a mass vaccination campaign tackling these challenges resulted in 12 million COVID-19 vaccinations in three days.\nhttps://t.co/wadKTKDIpH","date":"Wed Apr 13 22:10:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Some of the most honest conversations can happen over a good meal. \n\nIn the newest episode of The Working Dinner series, @MelindaGates is joined by foundation partners. Watch as things get real when they challenge the uneven global response to COVID-19.\nhttps://t.co/fx9blxHfUW","date":"Wed Apr 13 18:02:25 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Thank you Germany 🇩🇪, Indonesia 🇮🇩, Senegal 🇸🇳 and Ghana 🇬🇭 for co-hosting the @gavi #COVAX AMC Summit. \n\nThe Summit is an important milestone in global efforts to #breakCOVID now, and will help support countries to deliver vaccines to those most vulnerable.","date":"Sat Apr 09 06:00:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Millions of children in poor countries die from infectious diseases that are easily preventable in wealthier countries. \n\nWe can change that in our lifetimes by expanding access to vaccines.","date":"Fri Apr 08 20:50:03 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"To address inequities made visible by the pandemic, we must open the door to honest feedback with leaders. \n\nOn this episode of The Working Dinner, foundation partners join @MelindaGates and discuss the uneven global response to COVID-19.\nhttps://t.co/9vOlGbw3JY","date":"Thu Apr 07 20:54:24 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Ever wonder whether foundation partners give honest feedback to leaders like @MelindaGates?  \n\nWatch our newest episode of The Working Dinner series and see for yourself. https://t.co/WxYLoyQ5Qj","date":"Thu Apr 07 14:58:50 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"“Everywhere, women and girls face the greatest threats and the deepest harm. And while they are taking action to confront the climate and environmental crises, they continue to be largely excluded from the rooms where decisions are taken.”\nhttps://t.co/XSGsY80f5G","date":"Mon Apr 04 20:35:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"If the world is going be prepared for the next pandemic, we need to leave behind the boom and bust cycle of investments in public health–and make sustainable, long-term investments instead. \nhttps://t.co/4mobrn6geC","date":"Fri Apr 01 19:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Kangaroo mother care is named for the way a baby is placed on a mother’s chest after birth. 🦘🚼\n\nThis relatively simple intervention has proven to dramatically improve neonatal care, particularly for small and sick newborns.\n✏️ by Megan Bird Illustration\n\nhttps://t.co/XtoshAVXIX https://t.co/dka0x3BIAn","date":"Thu Mar 31 23:21:01 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Public health workers across five African countries have begun administering polio vaccines to more than 23 million children.\n\nEvery child deserves to grow up in a world free of polio. \nhttps://t.co/hMf1QejgcT","date":"Wed Mar 30 22:00:09 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"COVID-19 has caused children to miss vaccinations &amp; preventable diseases to re-emerge. Wild polio in Malawi is just the latest example.\n\nWe must improve vaccine confidence &amp; strengthen health systems to ensure that we don’t see another case like this. https://t.co/hwLZsA2opR","date":"Wed Mar 30 17:02:13 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"A world without malaria is possible.\n\nThe first approval of a new treatment for children with P vivax malaria marks a milestone in the fight against the deadly disease.\nhttps://t.co/3oBqLZMld8","date":"Tue Mar 29 21:30:05 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"The climate crisis is a threat to human wellbeing and health of the planet. There’s no time to waste. \nhttps://t.co/fAT7zOLheG","date":"Sat Mar 26 13:00:08 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Kenya's HPV vaccine rollout program was designed to build trust and educate the community. \n\nThis approach was so successful, it's now being used to support their COVID-19 vaccination program. \nhttps://t.co/qBSQYPd4Av","date":"Fri Mar 25 21:00:08 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Addressing and ending the tuberculosis epidemic is possible. To do it the world needs to improve  \n💉 vaccines\n💊 effective drug treatments\n🧪 diagnostics \n\n#WorldTBDay #FightForWhatCounts","date":"Thu Mar 24 22:30:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"On the first episode of our new series, The Working Dinner, Gates Foundation experts in respiratory diseases, immunology, and vaccines join @BillGates for a conversation and a meal.   \n\n📽 Watch as they discuss lessons learned from COVID-19: https://t.co/LtxHQN7k6S https://t.co/5Y6jWnqFuT","date":"Thu Mar 24 16:38:21 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Polio cases have dropped by 99% since work began to eradicate this disease. \n\nWith renewed support for eradication, the world will #EndPolio.","date":"Wed Mar 23 22:00:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Say it with us 🗣️ child care is essential https://t.co/HuJQbZAZDw","date":"Wed Mar 23 17:00:13 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Access to 🚽  safe sanitation and 🚰  clean drinking water are essential for public health and wellbeing. #WorldWaterDay https://t.co/cWH5RmP2H7","date":"Tue Mar 22 22:00:06 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"On a scale of one to ten, how prepared do you think we are for the next pandemic? For the first episode of our new series, The Working Dinner, Gates Foundation experts join @BillGates to discuss lessons learned from COVID-19.  \n\n👀 Stay tuned for the full episode - coming soon! https://t.co/truawARkSh","date":"Tue Mar 22 16:52:31 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"The world is facing another serious crisis: food insecurity.  \n\n@EnockChikava explains how the world can avoid a spike in global hunger:\nhttps://t.co/FMNP9vaXap","date":"Mon Mar 21 17:00:13 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Want to know if your country is likely to achieve gender equality in your lifetime? 🔎  \n@Equal2030 made a calculator to find out.\nhttps://t.co/UMSZm0UbG1 https://t.co/RFI1YgLiDp","date":"Thu Mar 17 21:15:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Which gender equality issue do you want to learn more about in 2022?","date":"Mon Mar 14 18:22:36 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"10 years ago, not even 25% of rural women in Bangladesh felt empowered. By 2015, this had risen to more than 41% with continued gains in recent years.\n\nWhat caused this change? \n\n@ClaudiaSadoff explains. \n\nhttps://t.co/6D10UqNSks","date":"Fri Mar 11 03:00:04 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Jashodaben Pravinchandra is like many parents across the world. \n\nShe works hard, cares for her children, and for many years struggled to make ends meet without adequate child care.   \n\nChild care is poverty reduction: https://t.co/0vtCwUHgBg\n\n@SEWABharat https://t.co/6PjWH0frjQ","date":"Wed Mar 09 16:13:50 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Achieving gender equality means putting women at the center of communities, decisions, policies, and economies.\nLearn more about what we're doing in pursuit of this goal ⤵️\nhttps://t.co/QYfn1cJHqa","date":"Tue Mar 08 22:54:02 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Here are some fast facts for #IWD2022 on where the world stands on the road to gender equality:\n🌎 ZERO countries are on track to achieve gender equality by 2030\n🌍 1 in 3 countries aren't making any progress\n🌏 Progress IS possible by centering equality in policies and programs https://t.co/9kS4l38TWI","date":"Tue Mar 08 22:53:43 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Affordable child care is an essential element for gender equality. #InternationalWomensDay @SEWABharat\nhttps://t.co/di0Mvm1LRI","date":"Tue Mar 08 15:30:08 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Over the past two years the world has made incredible strides in scientific innovation, and learned important lessons to help prevent future pandemics.\n\nNow is the moment to build on that progress.\nhttps://t.co/q3AnFh9cPz","date":"Tue Mar 08 00:00:07 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Entering year 2 of the pandemic, most regions are still in the throes of outbreaks, and global vaccination rates are disproportionate. \n\nHow did this happen and why? What has to be done to solve this for the future? Join our live discussion Mar 2 @ 11a ET. https://t.co/eTfZlsHj3H https://t.co/41YxbDxxZj","date":"Mon Feb 28 21:00:08 +0000 2022","user_id":"17899109"},{"handle":"gatesfoundation","text":"Everyone deserves access to safe, effective vaccines and medicines.\n\nThe African Medicines Agency and other organizations advancing public health in Africa are working to make sure more people can access life-saving health innovations at lower costs. https://t.co/lYt02HLJwQ","date":"Tue Feb 22 18:00:13 +0000 2022","user_id":"17899109"}]