[{"handle":"ggreenwald","text":"@crazyuddie @davis6059 There's a huge difference between answering a question about Snowden when asked and actively speaking out and campaigning for him. As for Assange: there's no pending investigation in Sweden. Maybe learn about a case before cheering someone's imprisonment.\n\nhttps://t.co/xxEI5elwPA","date":"Sun Jun 26 22:34:57 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@davis6059 I followed this situation very closely. I reported on it, did everything I could to get pardons for Snowden and Assange. And what I'm telling you first hand is that the only ones speaking out and working on it in national politics were people on the right. I wish it weren't true.","date":"Sun Jun 26 21:20:35 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@davis6059 @murphy_jorden @AOC That was one example. You obviously know nothing about any of this.\n\nhttps://t.co/7ux86iX6P6","date":"Sun Jun 26 21:18:36 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@davis6059 @murphy_jorden @AOC People like Matt Gaetz, Rand Paul and Tucker Carlson went on a virtual crusade -- public and private -- to get Snowden and/or Assange pardoned while Trump was President. No Dem did anything close. I'm sorry that hurts but it's true.\n\nhttps://t.co/9ZlOZwmaVM","date":"Sun Jun 26 20:40:53 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Also Krugman, from his Nov. 19, 2020 NYT column entitled \"Making the Most of the Coming Biden Boom\":\n\n\"Good chance\" Dems will \"be able to run in the 2022 midterms as the party that brought the nation and the economy back from the depths of Covid despond.\"\n\nhttps://t.co/vVvtVQGs0N https://t.co/tbpAXbX7DD","date":"Sun Jun 26 19:10:17 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"When @paulkrugman forget to mention in his long thread about political cults in the GOP is in 2008 - when he was a swooning fan of Hillary - he wrote: \"the Obama campaign seems dangerously close to becoming a cult of personality.\"\n\nhttps://t.co/arJvCvFbxZ\n\nhttps://t.co/1XsYNpcgvS","date":"Sun Jun 26 19:03:35 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"All Democratic Party leaders are skillful at this, but nobody came close to Obama's ability to manipulate liberals to place their faith in him, joyfully and flagrantly betray that trust, and then have them swoon with gratitude to him for it. An absolute master at work:","date":"Sun Jun 26 18:58:24 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@ScottGWrites @AOC You can't answer the question about the persecution of Assange and Snowden, or about Biden's $40b war package to Raytheon and CIA, because your self-esteem and sole political identity depends upon your para-social love for the Squad, and thus don't want to contradict them.","date":"Sun Jun 26 18:08:50 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@ScottGWrites @AOC Are you someone who supports the efforts of the Trump and Biden DOJs to imprison Snowden and prosecute Assange? Do you support the vote of all Dems, including the radical subversive Squad, to send $40b to Raytheon and CIA for \"Ukraine.\"  Twitter clichés are worthless.","date":"Sun Jun 26 17:29:58 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@davis6059 @murphy_jorden @AOC You're very confused. It was only Republicans -- like Matt Gaetz and Rand Paul -- attempting to pressure/persuade Trump to give them pardons.","date":"Sun Jun 26 17:23:06 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@ScottGWrites @AOC US \"leftists\" think the only way one would care about the persecution of Snowden and Assange, or oppose Biden/Dems' $40b war package to Raytheon and CIA \"for Ukraine,\" is if one is paid to care. That shows how fucked-up your movement is (beyond the fact that Fox pays me nothing).","date":"Sun Jun 26 17:15:52 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@adream608 @domphillips I'd be happy to compare your life to mine any time you'd like to see which evinces the noblest values of humanity.","date":"Sun Jun 26 17:03:16 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@cedar1256 @domphillips If you don't think it's a legitimate journalistic endeavor to document and expose illegal actions by large industries - I repeat: illegal - then I don't know what would be. The Amazon is one of the most beautiful and profound parts of the earth. Its destruction would be heinous.","date":"Sun Jun 26 17:02:34 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@detetivevsilva Não sei se você está no Rio hoje, mas às 16h tem homenagem para Dom e Bruno nos Arcos da Lapa, e tenho certeza que haverá em outras cidades. Espero que você esteja bem. A meditação definitivamente também ajuda.","date":"Sun Jun 26 16:53:54 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"The British journalist @domphillips, who did such courageous work reporting on the illegal industrial pillaging of the Amazon, and who was murdered for that work on June 5 with the indigenous specialist Bruno Pereira, was laid to rest today. His obituary:\n\nhttps://t.co/i8zeojt9qz","date":"Sun Jun 26 16:50:30 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@detetivevsilva Pense e conecte-se à energia e ao espírito que os levou a fazer seu trabalho tão difícil, sob tantas ameaças e barreiras, e use isso como inspiração. Pessoas como Dom e Bruno são inspiradoras se ficar aberto a isso. Não deixe sua tristeza se transformar em resignação, mas raiva.","date":"Sun Jun 26 16:44:16 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"I spoke to the Vanguard about recent developments in the Julian Assange case and whether there's any real hope for something other than an awful and press-freedom-destroying outcome:\n\nhttps://t.co/oObbOaxu3A","date":"Sun Jun 26 16:41:52 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@strawberryfildz I'm sorry if my speaking critically of the CIA offends you. Especially during Pride Month. I'll try to be more careful in the future knowing how many good things the CIA brought to Brazil.","date":"Sun Jun 26 16:26:48 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"https://t.co/qIGqV3Fxsc","date":"Sun Jun 26 16:10:26 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"https://t.co/YpOFh8P0fJ","date":"Sun Jun 26 16:04:47 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@jamesbadcock5 @AOC Apparently you're not one of them, given that you've decided to ignore President Zelensky's pleas for people who support Ukraine to go there to help them fight Russia.\n\nYour belief that CIA and US war machine is there trying to protect Ukraine is sweet.\n\nhttps://t.co/y4dcSsA8KT","date":"Sat Jun 25 21:06:29 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@NegDiscountRt @AOC AOC has extensively addressed the third topic, hence there's no reason for me to call on her to do so.","date":"Sat Jun 25 21:04:37 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Personalities aside, I'd also like to hear @AOC address the first two questions posed here.\n\nTo this very day, AOC has refused to explain why she voted to send $40 billion to Raytheon, Boeing and CIA \"for Ukraine\" while people in her district are more deprived than ever:","date":"Sat Jun 25 20:58:27 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@benguthstew I've spoken about many aspects of yesterday's ruling, not just this one, but when deciding whether viral lies should be corrected or not, I don't take into consideration the race, gender, or age of the person being lied about. It's kind of twisted that you do.","date":"Sat Jun 25 20:53:17 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Maybe Dem leaders don't really believe the things they claim, which is why they don't do the things needed to win, but only pretend so people keep voting?\n\nIn 2006, Dems won the House on a vow to end the Iraq War, then kept funding it because they knew the war would help in 2008:","date":"Sat Jun 25 20:50:36 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@jamesbadcock5 CIA operatives use unaccounted barrels of cash and weapons in the covert proxy wars and regime change operations they wage. That's what they would do with it.","date":"Sat Jun 25 20:47:33 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@HeerJeet Here are two very good Democrats who you're afraid to criticize making exactly the same point about Cornyn's tweet as I made, so you'll either have to imply they're also clandestine racists or slink away in shame. And thanks for the correction: I noted it seconds after my tweet. https://t.co/XOnRS1MNoa","date":"Sat Jun 25 20:45:05 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"It was clear that much of Biden's $40b war package for Ukraine was going to CIA without much idea what it was for.\n\nIt's hardly a surprise there are many CIA operatives on the ground in Ukraine but it does shows the true scope of the direct US involvement in war against Russia:","date":"Sat Jun 25 20:40:18 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Few people like Cornyn. Ask any Trump supporter what they think of him, especially in light of his YES vote on the recent gun law but even before that. He's standard GOP establishment worthlessness. It's just about reading comprehension and whether dumb viral lies are good.","date":"Sat Jun 25 20:31:21 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"If even the most partisan Democrats in media are acknowledging what Cornyn's tweet did -- and did not --mean (as some are doing), maybe the people who claimed he was defending Plessy can reflect a bit on how dumb and/or dishonest they are, even if they don't retract their lies. https://t.co/59cFqipaNA","date":"Sat Jun 25 20:29:39 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@cancelmybutt @theserfstv I'm constantly in public, including in the US. I always post my public appearances beforehand. You should come to one, tough guy. \n\nhttps://t.co/09Vj5EcNGj","date":"Sat Jun 25 20:25:47 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@letsgoayo Even the most partisan Democrats in media are now acknowledging the truth about Cornyn's tweet. Have you ever considered the possibility that you're extremely dumb?\n\nhttps://t.co/RAhjim8um2","date":"Sat Jun 25 20:22:21 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@Iwantbebot4ever 👍","date":"Sat Jun 25 19:12:26 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@Iwantbebot4ever Sigh. \"Now do...\" means: \"apply the reasoning you just expressed to this other thing.\" Obama defended Roe on the ground that it's a decades-old precent. Cornyn is saying: that was also true of Plessy; thus, by Obama's reasoning, the Brown court was wrong to overturn it.😮‍💨","date":"Sat Jun 25 19:06:51 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Words aside, the idea that Cornyn woke up and decided to announce his support for Plessy is stupid and laughable on its face. But liberals use social media to create a dissent-free echo chamber so even their abject stupidity is cheered and ratified. That explains Russiagate.","date":"Sat Jun 25 18:57:52 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@scaryycat @letsgoayo Aside from the words, the idea that Cornyn woke up and randomly decided to announce his support for Plessy v. Ferguson is stupid and laughable on its face. But they use social to create a dissent-free liberal echo chamber so even their abject stupidity is applauded and ratified.","date":"Sat Jun 25 18:56:12 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Jesse, reputation aside, is a devoted lib Democrat. Listen to his 1-hour show in 2020 on why nothing is more urgent than voting for Biden. But he's able to point out the deliberate misreading of Cornyn's tweet because he believes in reading comprehension:\n\nhttps://t.co/Uum2xKa8PQ","date":"Sat Jun 25 18:53:50 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@howley__ @theserfstv I don't think these people are actual \"leftists.\" They're Bernie/AOC Democrats. And criticizing them doesn't make you a fascist, especially given how many authoritarian sentiments and beliefs they have embraced.","date":"Sat Jun 25 18:51:57 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@letsgoayo Twitter has really made me see more than ever the true depths of cognitive deficiency in US political and cultural life. I'm not sure what can be done about it.","date":"Sat Jun 25 18:49:12 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@howley__ @theserfstv It's not just Snowden. As risky as that was, the far riskier and more consequential work was the Brazil investigation that freed Lula, caused Bolsonaro to threaten me with prison, and resulted in a criminal indictment. That's why I hate leftist LARPers.\n\nhttps://t.co/7tEwy46oLQ","date":"Sat Jun 25 18:48:05 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@letsgoayo Maybe the pretty colors will help you. https://t.co/jIBqRZh3AX","date":"Sat Jun 25 18:45:46 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@Karantov It's just defending basic reading comprehension.","date":"Sat Jun 25 18:43:43 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@jessesingal LOL, quite a difference indeed. Corrected it in the next tweet.","date":"Sat Jun 25 18:43:32 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@letsgoayo I stated it explicitly in the paragraph at the end of the tweet.","date":"Sat Jun 25 18:42:55 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"*Cornyn*","date":"Sat Jun 25 18:42:31 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Tens of thousands of people - including journalists - pretending Corbyn's meaning is that Brown was wrongly decided and Plessy should have remained, even though he's so obviously making the exact opposite point (decades of precedent shouldn't shield bad decisions from overrule).","date":"Sat Jun 25 18:40:03 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@howley__ @theserfstv Yeah, also this.👇 That's the point. Leftist LARPing losers like these Serf freaks hate me because they know they will never risk anything for a cause: the same reason vapid corporate journalists despise Assange: he's a mirror to what they are.\n\nhttps://t.co/EYqIe8tPpf","date":"Sat Jun 25 18:36:58 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@JonathanFalcons @RickG_P2PRadio Both the majority and the dissent seemed to hold Roberts' anti-intellectual, cowardly attempt to wiggle out of this with contempt.","date":"Sat Jun 25 18:34:29 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@RickG_P2PRadio That you don't think major newspapers should print accurate claims -- including about how the Chief Justice of the Supreme Court voted on one of the most consequential decisions in the Court's history -- is why we live in Idiocracy.","date":"Sat Jun 25 18:30:23 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Put another way: if 5 justices had signed onto Roberts' opinion instead of Alito's, then the Mississippi 15-week law would have been upheld, but it would have been upheld by modifying/weakening Roe, but refusing to overrule it. There were 5 votes, not 6, voting to overrule Roe.","date":"Sat Jun 25 18:28:34 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@RicZambini There were 6 votes to uphold the Mississippi 15-week law as constitutional. But only 5 said that Roe should be overruled to do it. The 6th (Roberts) said that the law should be upheld and MS should win, but that Roe did not need to be and should not be overruled to do it.","date":"Sat Jun 25 18:26:16 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@Buck_IV_ EXACTLY.","date":"Sat Jun 25 18:25:26 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"I mean all you have to do is read the majority opinion (which devotes multiple paragraphs to heaping scorn onto Roberts for refusing to overrule Roe), or Roberts' own opinion, devoted to arguing why the MS law should be upheld **without overruling Roe**. Roberts:👇 https://t.co/A54EwrDHq3","date":"Sat Jun 25 18:24:48 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@NSOL_USA One last time: maybe this is the fault of legal experts for not explaining it:\n\nThe majority/dissent grouping is only about which party won the case. Rationale becomes binding only if it has 5 votes. Roberts voted to uphold the MS law because he viewed it as compatible with Roe.","date":"Sat Jun 25 18:23:08 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"There are 5, not 6, votes on the Court to overrule Roe. I'm unsure what the motive is for claiming otherwise, but it obscures this dark irony:\n\nThe 5th vote to overrule Roe came only because RBG refused to retire under Obama, allowing Trump to replace her with ACB (the 5th vote): https://t.co/xHDsRoxrv6","date":"Sat Jun 25 18:21:30 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"What's so bizarre about this amateur but common error - claiming there were 6 votes to overrule Roe when there were only 5 - is the same NYT published a long article on how Roberts is now powerless since he refused to overrule Roe, but the other 5 did:👇\n\nhttps://t.co/rHXfWQP5ej","date":"Sat Jun 25 18:19:17 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@mysterio1870 I've made clear, not just with words but actions, my support for extreme measures against corrupt establishment power, including the illegal acquisition and publication of all their relevant secrets.","date":"Sat Jun 25 18:14:37 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@mysterio1870 My point is people like him -- born and raised with extreme wealth and use this kind of empty LAPRing to find purpose, hoping others take risks for his amusement -- are worse than worthless, to say nothing of the double standards of Big Tech censorship. It's just branding for him","date":"Sat Jun 25 18:04:21 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@___Chase É por isso que pessoas como vc não devem comentar sobre países que não entende: 1) vc não tem ideia do que eu disse: só confusão total; 2) Carlos Maza não fará nada: é um bebê que vive de sua família rica e nunca arriscará nada; 3) vv acha que ele é \"aleatório\" pq não sabe quem é","date":"Sat Jun 25 17:50:09 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@theserfstv Exactly like you, Carlos Maza is a LAPRing, cowardly loser who has never risked and never will risk anything for any cause, hoping instead that he incites someone without his wealth to go do it for him so he can feel amused. He's not \"taking down\" anyone - again, like you.","date":"Sat Jun 25 17:45:06 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@mysterio1870 Carlos Maza is a LARPing loser coward who will never do anything. This is all a show, like this:\n\nhttps://t.co/e13UFhJFLs","date":"Sat Jun 25 17:43:16 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@SenorWoberto People like that are complete posers who have never risked and never will risk anything for any cause. He's LAPRing as some hardened radical while living off his mom's massive wealth, hoping to encourage others less privileged to take the risks he won't for his own amusement.","date":"Sat Jun 25 17:42:02 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@Solidarity_Star @gaywonk If you think that coddled little soft leftist living off his multi-millionaire mom is going to do anything other than LARP as some kind of dangerous radical, while he encourages less privilege people to risk engaging in violence for his amusement, then you're pathetically naïve.","date":"Sat Jun 25 17:39:39 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@rx13 https://t.co/rNVK2iPzrM","date":"Fri Jun 24 22:10:43 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Here's Ben Rhodes is his own words describing how Snowden's plan all along was to transit through Russia and immediately leave to get to Latin America, but Rhodes bullied the Cubans into not allowing him to pass through, thus preventing him from leaving.\n\nhttps://t.co/x1pePbAZBm","date":"Fri Jun 24 21:58:57 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Just your periodic reminder of what pathological lying smear artist scumbags Democrats are:\n\nDems like @brhodes boasted in their own books that they purposely tried to block @Snowden from leaving Russia and trapped him there, now use his presence there to imply he's a traitor:","date":"Fri Jun 24 21:57:49 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"The Taylor Lorenz Syndrome: https://t.co/ImZsjB9P54","date":"Fri Jun 24 21:40:39 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@regalillest \"Participate in society\" = encouraging others to risk imprisonment by engaging in violence that you yourself won't do, all while you live off your family's enormous wealth.","date":"Fri Jun 24 21:25:06 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"So amazing how often these people come from these places:\n\nhttps://t.co/oSIXLLZWBk","date":"Fri Jun 24 21:22:22 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@Pinkham_Artemis @gaywonk What kind of violence would you like to see people use? Are you planning on engaging in any yourself or just hoping others do it?","date":"Fri Jun 24 21:21:23 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"The @GayWonk has used Twitter to unveil his plan of action today in response to the Court's ruling in Dobbs. https://t.co/bymOF3tOLT","date":"Fri Jun 24 21:17:19 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@mtracey And before any dumb liberals come along and believe this, permit me to note that the real reason I can't do my own podcast today is my voice is even more monstrously hoarse than it was for this Fox debacle last night. Thank you for stepping up, M Tracey:\n\nhttps://t.co/ResoEKIjVR","date":"Fri Jun 24 20:41:16 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@defbroadcasting @uncappedturtle @KeithOlbermann I got it and stand duly chastened.","date":"Fri Jun 24 20:38:08 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@uncappedturtle Oh, god - my misreading of your initial tweet spread over two different exchanges. Extra embarrassing. Sorry!","date":"Fri Jun 24 20:37:45 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@uncappedturtle Yes, email me.","date":"Fri Jun 24 20:06:09 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@uncappedturtle That doesn't change the point at all.","date":"Fri Jun 24 20:05:51 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@beems34 @sklorbit @atrupar Here's a really great article on the pathology of the Good, Nice, Earnest White Male Ally:\n\nhttps://t.co/k5jjjifvr4","date":"Fri Jun 24 20:05:03 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@allart4u @sklorbit @atrupar She's one of the leading constitutional scholars and political experts on the issues the court decided today. It's hard to get credentials better than these:\n\nhttps://t.co/ZL38z64xhN","date":"Fri Jun 24 20:04:12 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@HawleyMO They do it to every marginalized group, which they really believe they own. Intense and virulent waves of racism, misogyny, homophobia, etc. etc. are unleashed at any members of these groups who don't display unyielding loyalty and obedience to liberal pieties and decrees.","date":"Fri Jun 24 19:54:47 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@elleboogyy @wjmaggos He means adults don't criticize liberals like Aaron Rupar.","date":"Fri Jun 24 19:48:31 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@uncappedturtle I never had a \"gig\" on MSDNC and if, as you imply, it were important to me to go on, I probably wouldn't have spent all of 2015 and 2016 bashing MSDNC and their stars and pieties with great vehemence. \n\nAlso, back then, I was opposed to this sort of casual misogyny Aaron showed.","date":"Fri Jun 24 19:48:06 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@sklorbit @atrupar Which days is misogyny worth noting and objecting to and which days isn't it? Do liberals post a calendar so the rest of us can know?","date":"Fri Jun 24 19:43:41 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"I guess Professor Hawley should at least be relieved that Aaron didn't refer to her as a \"paralegal.\" https://t.co/YVAOHJXkRc","date":"Fri Jun 24 19:39:09 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Erin Hawley: Yale Law graduate, Supreme Court clerk (for Roberts), Constitutional Law Professor (Univ. Missouri), top appellate lawyer, specialist in women's law.\n\n@Atrupar: Fox had on \"wife of Josh Hawley,\" never even made her talk about her husband.","date":"Fri Jun 24 19:38:11 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@RogerAramayo2 Feel free to criticize Robert's ruling. But saying he voted to overrule Roe, or that there were 6 votes to overrule Roe, is an absolute lie. The majority heaped paragraphs of scorn on him for refusing to do so, and the only point of his opinion was explaining why he wouldn't.","date":"Fri Jun 24 19:24:29 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"When childlike dreams are shattered. https://t.co/5olKX8RCfC","date":"Fri Jun 24 19:17:43 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"😢 https://t.co/t8Joad18rN","date":"Fri Jun 24 19:16:20 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@RogerAramayo2 You people are absolute idiots, suffering from severe adolescent entitlement syndrome. You're so accustomed to demanding people lie to please you that when someone merely points out a factual truth, you whine in the corner as if it's offensive.","date":"Fri Jun 24 19:13:54 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@JohnBurgJr You're an imbecile. Gay marriage was not legal in Brazil. David and I were legally married in New York, after that state democratically enacted marriage equality for same-sex couples. Brazil only had judicially recognized civil unions for immigration and other purposes.","date":"Fri Jun 24 17:51:52 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@DgFontanella Yes, both the majority and dissent believe Roberts is engaged in sophistry. That doesn't change the fact that his vote is what it was: he said he'd uphold the MS law without overruling Roe because, with modifications, Roe and the MS law can coexist, hence no reason for overrule.","date":"Fri Jun 24 17:48:37 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@MarkSoveign Yes, Democrats always find a way to convince their idiot followers that they can't do any of the things they promised they'd do if they won -- even when they win -- so you have to just keep voting harder and harder for them. I wrote about it in 2010:\n\nhttps://t.co/e7q9nMxGBs","date":"Fri Jun 24 17:42:30 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@TRichUtah In exactly the same way that conservatives believe they can enact a federal law banning abortions (Mike Pence vowed that today), so, too, could Dems do the opposite. There'd be legal challenges both ways but the arguments would be the same.","date":"Fri Jun 24 17:36:31 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@ete_jo @GavinNewsom You don't speak for everyone. You're just an anonymous coward, while my life speaks for itself in terms of the causes and values I believe in, and what I'm wiling to risk and sacrifice in support of them.","date":"Fri Jun 24 17:30:01 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@AMF2440 @GavinNewsom I didn't say either of those two things but, as the Court noted in the second page of its ruling, Professor Laurence Tribe said exactly that: Roe has no constitutional basis, but he'd support pro-abortion laws. https://t.co/vVmzoEMhuH","date":"Fri Jun 24 17:28:42 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@knickstrahm https://t.co/jvDAOAXXTb","date":"Fri Jun 24 17:24:11 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@MarkSoveign They could vote to eliminate the filibuster -- either in general or for this. They just can't get the votes to do so democratically despite winning the WH and both houses of Congress. Stop making excuses for your party.","date":"Fri Jun 24 17:23:25 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Last month, California Governor @GavinNewsom included in his budget significant funding increases to enable people facing economic barriers to travel to California to obtain abortions (California democratically enshrined Roe into state law):\n\nhttps://t.co/Mh8tx7ypN9","date":"Fri Jun 24 17:22:25 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"Instead of signing songs and reading poems, Dems -- holding the WH and both houses of Congress -- could 1) enshrine Roe as federal law (which just failed); 2) create funds to allow people to travel to states where abortions are allowed; 3) stop campaigning for pro-life Dems.","date":"Fri Jun 24 17:21:22 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@dcp54466257 I'm sorry, but you are extremely ignorant of how the court works. Their votes are about nothing other than which party wins in a particular case. Often, they have violently different rationale for why one party wins. If 4 Justices had voted with Roberts, Roe would still be law.","date":"Fri Jun 24 17:08:03 +0000 2022","user_id":"16076032"},{"handle":"ggreenwald","text":"@CharlotteRuse3 What was abolished is the constitutional right to have a pre-viability abortion, a right recognized by Roe and reaffirmed by Casey.","date":"Fri Jun 24 17:06:33 +0000 2022","user_id":"16076032"}]