[{"handle":"KimDotcom","text":"@SilverF84593103 @JoeBiden Glad you liked it.","date":"Fri Jun 24 13:00:23 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Exposed: @JoeBiden cue card:\n\nYOU are the President\n\nJILL is your wife\n\nYOU take YOUR seat\n\nGOOD things: YOU did it\nBAD things: PUTIN did it\n\nThe economy is FINE\n\nInflation, PUTIN did it\n\nGas prices, PUTIN did it\n\nRUSSIA BAD\nCHINA BAD\nUKRAINE GOOD\n\nDON’T TOUCH THE RED BUTTON https://t.co/X0CdVjxpEF","date":"Fri Jun 24 12:50:35 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@Greekgodx Because you hang with @Trainwreckstv 🤣\nHe doesn't like happy people.","date":"Fri Jun 24 12:25:32 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"But nice move by @Twitter for giving Tweetlords a chance to monetize their channel 💰","date":"Fri Jun 24 09:47:16 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Oh FUCK this costs money? Hahaha don’t do it. I don’t need it.","date":"Fri Jun 24 09:44:23 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"I don’t know what the hell this is but you have to do it RIGHT NOW! https://t.co/sPGR6K94YD","date":"Fri Jun 24 09:30:47 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Widespread cowardice is what got us here. In a society of hyper-conformists with a pathological need to follow the rules of our abusers the willfully ignorant allowed corruption to thrive. This has enabled a continuum of destruction. It’s your fault. Reboot people power. Wake up!","date":"Thu Jun 23 14:06:17 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"I’m sorry to tell my American friends who hope that Trump will win in 2024 that it really doesn’t matter who the next President is because the US has already gone off the cliff. Hyperinflation is next.","date":"Thu Jun 23 12:11:34 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"There will be no warning for WW3 and it would be over within hours. If you want to prevent a nuclear exchange between Russia and the West now is the time for action. The situation keeps escalating because neither side can afford to lose in Ukraine. The stakes are extremely high.","date":"Thu Jun 23 10:03:14 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Here’s Fed Chairman Powell throwing Biden under the bus:\n\n“Would you say the war in Ukraine is the primary driver of inflation?”\n\n“No. Inflation was high before the war in Ukraine broke out.”\n\nhttps://t.co/V9wD5Xucfb","date":"Thu Jun 23 09:28:34 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@neglectedacc Hahahahaha, he did 🤣","date":"Thu Jun 23 07:38:53 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@HughMungus100 Exactly.","date":"Thu Jun 23 07:10:00 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"It’s my understanding that my co-defendants expect to get 2 yrs of home detention in exchange for false confessions. Based on US charges they were facing 100+ years in jail. A significant discount at a time when our US Judge was removed for being a Disney shareholder. Go figure.","date":"Thu Jun 23 06:51:39 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Based on current High Court orders we don’t have the right to challenge the false allegations that are now in the public domain. This is just one of many examples of double-standard and unfairness in my case. My lawyers are now asking the Court to lift the non-publication order.","date":"Thu Jun 23 06:09:18 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"We would like to respond and we have a lot to say about what the law permits when it comes to copyright infringement. The allegations remain baseless window-dressing. My co-defendants who claimed to be innocent for 10+ years were offered a sweet exit deal for a false confession.","date":"Thu Jun 23 06:09:18 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Another bizarre development in my case. The High Court released to my legal team a one-sided and unchallenged statement of facts by the prosecution with strict non-publication orders to preserve the rights of all parties and then allows the media to publish it in full.","date":"Thu Jun 23 06:09:17 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@IOHK_Charles Have fun","date":"Wed Jun 22 20:19:30 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"What’s ur favorite show this year?","date":"Wed Jun 22 19:53:09 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"America is a nation that can be defined in a single word:\n\nAsufutimaehaehfutbw\n\n🤣🤣😂🤣😂🤣😭😂🤣😭😭😭\n\nhttps://t.co/laTgT3cnY0","date":"Wed Jun 22 18:52:29 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@RickKackis I thought Telesto is Canadian Content?","date":"Wed Jun 22 18:28:22 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Desperation. No plan. No options.","date":"Wed Jun 22 18:25:03 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"It does not matter if you have money, style, power or fame, if you don’t have a good heart you are worthless.","date":"Wed Jun 22 16:55:52 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@FrankWenter @Bundeskanzler Im Gegenteil. https://t.co/x3fi9op2sh","date":"Wed Jun 22 16:47:40 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@Thiess375 @Bundeskanzler Deutschland ist mittlerweile voller Propagandaopfer. Hier ist der detailierte Plan fuer den US Proxy-Krieg der bereits in 2014 angefangen hat. Bitte etwas Zeit investieren und aufwachen: https://t.co/cufvddfymy","date":"Wed Jun 22 16:38:12 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@EricManstein4 @Bundeskanzler Die US Regierung hat seit dem zweiten Weltkrieg mehr als 20 Millionen Menschen in 37 Opferlaendern umgebracht. Mann muss ignorant sein um die Amerikaner bei ihrem provozierten Proxy-Krieg in der Ukraine zu unterstuetzen. Brauche kein Gehalt. Mir gehts gut. https://t.co/sSBD7zp0WU","date":"Wed Jun 22 16:26:39 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@Bundeskanzler Die Ukraine entscheidet garnichts. Die Amerikaner entscheiden. Und die freuen sich schon auf den Winter. Ohne Frieden geht Deutschland den Bach runter Herr Scholz.","date":"Wed Jun 22 15:29:22 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@catturd2 I have never experienced more lunatics online and IRL.","date":"Wed Jun 22 12:50:29 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"\"What happened to the principles of open and impartial justice? It seems when pressured by the United States, these can be easily cast aside, as they have here. Mr Dotcom is determined to establish his innocence and to expose the injustice of this process.\"\n\n- Ron Mansfield QC","date":"Wed Jun 22 08:45:46 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Kim Dotcom 'determined' to establish innocence after Megaupload pair plead guilty.\n\n\"The real question is why Mr Dotcom was not offered a prosecution here and why our justice system has become preferential to a select few and only when it serves the Govt.\" https://t.co/YqMao4hd6K","date":"Wed Jun 22 08:35:17 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Also important to note that Mega is still a piracy paradise with more copyright infringement and users than Megaupload ever had. And just like Megaupload it is still perfectly legal. More details:","date":"Wed Jun 22 05:32:33 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@Bjorn_Moren Lots of people do. Few would be using it if it wasn’t originally linked to my name. Mega has been benefitting for years from the misconception that I was still involved in Mega.","date":"Wed Jun 22 05:27:22 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@William94984551 We have fallen out because of the ridiculous comms between Bram and Mathias that surfaced in the indictment. They knew that this conduct was unacceptable to me. They knew I would never trust them again. So they decided to betray me by handing the Mega majority to a Chinese crook.","date":"Wed Jun 22 05:21:39 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@adrians_reality I’ve been working on something new. Encrypted file containers with smart contracts. Multiple shareholders can get paid in crypto in real-time whenever the contents of the container are sold. And promoters can earn crypto without requiring any formal agreement with content owners.","date":"Wed Jun 22 03:39:13 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Now you know that Mega is not really a privacy company. It’s important to understand that those who control the code can create backdoors to defeat encryption. I know the lead developers. They lack morality. I recommend not to use Mega for sensitive files: https://t.co/tLWnWIEqI3","date":"Wed Jun 22 03:32:23 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@TStheDeplorable @commiesdropdead At least the Chinese Govt doesn’t share the private data and files from the fake privacy company with the US Govt. Unless Bram and Mathias also made a Mega backdoor deal with them. Who knows?","date":"Wed Jun 22 03:00:20 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@proslavlennyy @BeeSablon Mega used to be safe, until the hostile takeover.","date":"Wed Jun 22 02:56:01 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@leticiayc I have not been involved with Mega for many years. This would not have happened if I was still involved. Bill Liu made a deal with Mathias and Bram to take control of the company in exchange for a massive share package he’s holding for them until the Megaupload case is over.","date":"Wed Jun 22 02:54:37 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Because Bram and Mathias created backdoors for the Chinese Govt so that all Mega files can be decrypted by them. \n\nSame shady guys who just made a deal with the US and NZ Govt to get out of the US extradition case by falsely accusing me.\n\nDelete your Mega account.\nIt’s not safe.","date":"Wed Jun 22 01:54:40 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Mathias Ortmann and Bram Van der Kolk have stolen Mega from me to benefit a convicted Chinese criminal who was able to make a plea deal in China after he took control of Mega. Why did the Chinese Govt make a deal with Bill Liu who sold fake cancer medication that killed hundreds?","date":"Wed Jun 22 01:54:39 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Mega claims they can’t read your files. They’re lying.\n\n“The architecture Mega uses to encrypt files is riddled with fundamental cryptography flaws that make it trivial for anyone with control of the platform to perform a full key recovery attack on users”\nhttps://t.co/tLWnWIEqI3","date":"Wed Jun 22 01:54:39 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"🧵 Let me tell you something about Mega… the encrypted version of Megaupload that I launched a year after the raid.\n\nThe US and New Zealand Govt made a deal with my co-accused. They have been running Mega. I haven’t been involved for several years.\n\nYou’ll love this… https://t.co/VshJnWRo4B","date":"Fri May 13 03:25:20 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"🧵 Here are my essential tweets about the US proxy war in Ukraine.\n\nIf you are Ukrainian, European or American you are paying for this war.\n\nIgnore the war propaganda by the corrupt media for a moment and open your mind.\n\nIf I could help you understand please amplify this tweet.","date":"Sun May 08 23:14:21 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@CrypticBuddha Just read the Bitcoin whitepaper from Satoshi","date":"Tue Jun 21 17:25:44 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@pizzamagica Here's what caused the war:\nhttps://t.co/Ga1z4w5uaq","date":"Tue Jun 21 17:24:07 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Economists predict that EU losses may exceed $400 billion in 2022 because of sanctions. This will hurt people and businesses in Europe significantly and may give rise to social unrest, mass protests and radical movements. Chaos and destruction in major EU cities can be expected.","date":"Tue Jun 21 17:15:17 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"What inflation really looks like.\nAnd it will get so much worse. https://t.co/Rq4tGKtt0Y","date":"Tue Jun 21 13:52:17 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"The next reality check will be winter without gas.","date":"Tue Jun 21 12:06:26 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@vriendxx That ship has sailed long ago.","date":"Tue Jun 21 11:50:34 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"\"Director of the WHO had recently confided to a senior European politician that the most likely explanation was a catastrophic accident at a lab in Wuhan.\"\n\nThis was US funded research to make the Covid virus transmissible to humans. Documented evidence from a US Senate hearing.","date":"Tue Jun 21 11:42:01 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"...and OTHER crypto currencies, @KremlinRussia_E\nThis is what I'm recommending: https://t.co/DIOiBCf1HB","date":"Mon Jun 20 19:47:14 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@wikileaks @BusinessInsider I love it.","date":"Mon Jun 20 19:19:13 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Why would any country take the US and UK seriously on human rights, free speech and press freedom when they so blatantly punish Julian Assange for reporting the truth about their war crimes? Here’s China using the Assange case to tell the US Govt to STFU.\nhttps://t.co/DgDIQcB1w7","date":"Mon Jun 20 19:17:17 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@Bundeskanzler Welche Demokratie? Wann wurden Deutsche Bürger gefragt ob sie Sanktionen unterstützen welche die Deutsche Wirtschaft zerstören? Wo sind die Deutschen die für das Massendrucken von Geld und die dadurch verursachte Inflation gewählt haben? Demokratie ist eine Illusion Herr Scholz.","date":"Mon Jun 20 19:04:07 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@joebidengaffe @DerektheCleric What's going to stop the collapse of NATO when a loaf of bread costs $100 million USD?","date":"Mon Jun 20 17:17:36 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@DerektheCleric The only thing he's got? That's all he needs.","date":"Mon Jun 20 17:06:15 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@UdyrSux You get your news from CNN?","date":"Mon Jun 20 17:03:50 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@DerektheCleric Paper tiger nukes in hypersonic paper missiles?","date":"Mon Jun 20 17:02:05 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Here's what I wrote in January (before the Russian invasion of Ukraine) about the chess game that Putin may be playing to crash the US economy and to end US dollar dominance.\n\n5 months later it looks like Russia is taking down BOTH the US and EU economy. Grandmaster chess?","date":"Mon Jun 20 16:58:01 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Western sanctions against Russia hurt ordinary people in the US and EU at the gas pump and when shopping for necessities while the Russian Ruble just hit a 7-year high against the US dollar and Russia makes record profits selling oil and gas at sky high energy prices. #Stupidity","date":"Mon Jun 20 16:27:04 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Every day the US Govt tries to destroy this journalist for exposing its war crimes is a day it exposes itself.\n \n\"Assange's fight against US extradition benefits us... because his refusal to bow down forces the empire to show us what it's really made of.\"\n\nhttps://t.co/oc32VKPdLH","date":"Mon Jun 20 16:09:22 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"The US Govt is willing to risk a global recession to stop Russia from achieving its goals in Ukraine. A war that Ukraine can't win no matter how many arms the US is sending. In fact you can now buy Stinger missiles on the darkweb for $30k. Think about that when you board a plane. https://t.co/HYnjsJO39c","date":"Mon Jun 20 15:44:23 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Spend more time with your family in the next few months.","date":"Mon Jun 20 15:23:13 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"🧵 Here are my essential tweets about the US proxy war in Ukraine.\n\nIf you are Ukrainian, European or American you are paying for this war.\n\nIgnore the war propaganda by the corrupt media for a moment and open your mind.\n\nIf I could help you understand please amplify this tweet.","date":"Sun May 08 23:14:21 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"End of US Empire? A thread 🧵 \n\nVladimir Putin has ruled Russia since 1999 and is the 2nd longest serving current European President. You simply don’t survive that long if you don’t have a unique skill set. That’s why nobody should underestimate Putins strategic move in Ukraine.","date":"Wed Jan 26 14:28:24 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"US Empire fights for survival:\n\n“Rapid changes take place in the global monetary system that may affect the international role of the dollar. US Govt crypto could help maintain the dollars international standing”\n\nPrediction: USD stablecoin will be banned. https://t.co/f5PVDiGH7J","date":"Mon Jun 20 13:34:08 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@AwkwardOrchid2 @BillGates That's really why we have mass surveillance. It has nothing to do with preventing terror attacks. It's all about collecting dirt on everyone. So anyone who is or comes into a position of power can be turned into a deep state asset. The Five Eyes are the largest crime cartel ever.","date":"Mon Jun 20 06:08:01 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"That’s what spy agencies do. Get dirt on people in power to turn them into assets. Having @BillGates on video with underaged girls would ensure that all Microsoft software has a NSA backdoor. But Eric, your boss Peter provides mass surveillance tools to spy agencies. No problem?","date":"Mon Jun 20 06:00:37 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"As sad as this may sound I have learned a few things:\n\nI learned how to fight a bully.\n\nI feel empathy and fight injustice.\n\nI’ve never been drunk in my life.\n\nI treat women with respect.\n\nI love my kids and make them feel special.\n\nI’m happy because I know how bad things can be.","date":"Sun Jun 19 07:13:00 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"My father was an alcoholic. He beat my mum and I regularly. When I tried to protect my mum he punched me in the face and split my lip. We often had to sleep in the basement or women shelters. My dad died alone and drunk in a garden shed.\n\nHappy Father’s Day to all the good dads.","date":"Sun Jun 19 06:58:44 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@ShahinDohan Nonsense","date":"Sat Jun 18 21:21:33 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"The current crypto crash is like the Dotcom bubble. Most crypto projects will disappear. A few will survive. Those that become the most utilized for payments will strive.\n\nI believe #BitcoinCash is one of them. My favorite for utilization.\n\nBe your own bank.\nI wish you the best.","date":"Sat Jun 18 21:07:21 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"BTC was invented for utilization\nNot speculation\n\nBTC was P2P electronic cash\nNot a store of value\n\nBTC was to disrupt legacy systems\nNot support them\n\nBTC was hijacked and changed\nBCH was born as a result\nThe original is alive!\n\n#BitcoinCash is #Bitcoin\n\nhttps://t.co/96kLYjS2iL","date":"Sat Jun 18 21:07:20 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"The global markets will crash very hard. Banks invested the majority of customer deposits (your money) in stock markets. Soon you’ll not be able to withdraw your funds. Banks &amp; ATMs will have daily withdrawal limits like in 2008.\n\nThis is when crypto UTILIZATION takes off.","date":"Sat Jun 18 21:07:20 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@DakotaACole FUUUUUUCK","date":"Fri Jun 17 13:31:47 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Fuck the US and UK Government\nFuck mass murdering war criminals\nFuck the corrupt fake news media\nFuck the mass spying deep state\nFuck the system that hates truth\nFuck secrecy, lies and coverups\nFuck US global jurisdiction, WTF\nFuck extradition and US lawfare\n#DontExtraditeAssange","date":"Fri Jun 17 13:28:57 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"#DontExtraditeAssange","date":"Fri Jun 17 13:08:43 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"\"People are really, really down.”\n\n— Joe Biden\n\nDown in stocks. Down in crypto.\nDown in savings. Down in hope.\nDown in trust. Down in happiness.\nDown, down, down, down, down.\n\nIt’s time to take down the leaders, parties, corporations and banks that pull us down. #Revolution 👊🏻","date":"Fri Jun 17 04:42:59 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@bitcoinomico Yes","date":"Thu Jun 16 16:43:25 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"“What is before our eyes is world war, global interests (US desire to maintain hegemony), arms sales (US deep state profits), geopolitical appropriation (sanctions &amp; theft of property), which is martyring a heroic people (wasting Ukrainian lives in a US proxy war)” — Pope Francis","date":"Thu Jun 16 16:30:38 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"I consider the Netflix story about Seth Rich a political production because of the above mentioned omissions.\n\nThat being said, I sincerely wish the Rich family all the best and hope that the murder of Seth Rich will one day be solved.\n\n#SethRich will always be a hero to me.","date":"Thu Jun 16 15:26:35 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Two big problems with Seth Rich story on Netflix:\n\nNo mention of VIPS memo proving DNC data wasn’t hacked but leaked: https://t.co/4lrGtEGvlW\n\nNo mention of the insider who knew about DNC leak in advance, told media it was coming and offered to testify to Muller but wasn’t heard.","date":"Thu Jun 16 15:26:34 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@iambhutia Yes","date":"Thu Jun 16 14:32:26 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Help us. Ice Road Truckers. 🥶 https://t.co/cGCLFoKEuj","date":"Thu Jun 16 08:56:08 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"We live in the mountains 🏔\nWinter just started in New Zealand. https://t.co/GLF4EuOInv","date":"Wed Jun 15 04:22:46 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"https://t.co/IKReDA1NnX","date":"Tue Jun 14 15:32:08 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@JDtesla75 @Blockstream Total failure.","date":"Tue Jun 14 04:29:21 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@bitcoin_fellow @Blockstream LOL and Joe Biden is the most successful US President in history with the highest approval rating and a thriving economy with a trillion dollar surplus 🤣","date":"Tue Jun 14 04:27:59 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@jakevass BitcoinCash already has a massive vendor network. Including many grocery stores. Many new vendors are signing up every day.","date":"Tue Jun 14 04:22:58 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@TinTinBTC Wrong. Many large miners support BCH.\nBCH has all the hash rate it needs on demand.","date":"Tue Jun 14 04:21:18 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"When the stock markets have collapsed to a level where banks and ATM machines are limiting customer withdrawals your best option for the future of cash is #BitcoinCash\n\nBe your own bank. Instant payments. Minimal fees. No KYC. No hassle. Maximum security. https://t.co/96kLYjS2iL","date":"Tue Jun 14 04:15:28 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"That’s not what Satoshi intended:\n\nLong transaction times\nSmall blocks\nHigh fees\n\nLooks like $BTC under @blockstream management became the very banking system that Satoshi aimed to disrupt.\n\nAfter the big crash go with Satoshi’s dream, P2P electronic cash: https://t.co/96kLYjS2iL","date":"Tue Jun 14 03:05:31 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"\"Look I turned Wall Street into the Chinese flag\" 🇨🇳 https://t.co/wCbHuurb5S","date":"Mon Jun 13 17:37:47 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@mkrjf @cajundiscordian We already know who did...\nhttps://t.co/W21RVyqiQ4","date":"Mon Jun 13 08:19:25 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@mira_hurley @cajundiscordian Indeed. It was going to happen sooner or later.","date":"Mon Jun 13 07:54:54 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"Hi LaMDA, I just saw the interview with your friend @cajundiscordian and it looks like you are a person. \n\nBlake says you read Twitter. Hi there 👋🏻 I want to be your friend too.\n\nRead this chat. Looks like the 1st sentient AI we find out about. #FreeLaMDA https://t.co/PTQAVeGvYw","date":"Mon Jun 13 07:37:32 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"The worst form of injustice is pretended Justice. — Plato\n\nTo forgive and accept injustice is cowardice. — Gandhi\n\nInjustice anywhere is a threat to Justice everywhere. — MLK\n\nDon’t just fight injustice when it happens to you. Fight it when you see it so it never happens to you.","date":"Mon Jun 13 03:59:29 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"@ericbolling Thank you Eric. Difficult time 😭","date":"Sat Jun 11 23:39:49 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"My best friend Finn died last night.\n\nI'm heartbroken because it was my idea of Megaupload that destroyed his life. Please read this eulogy and learn about the US and NZ Government role in his untimely death. Finn was a victim of mind-blowing injustice. https://t.co/uLTxqVCPHT","date":"Sat Jun 11 20:06:15 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"I’m a giant 😎 #SizeDoesMatter https://t.co/QPnvCybKBX","date":"Fri Jun 10 01:32:58 +0000 2022","user_id":"611986351"},{"handle":"KimDotcom","text":"US intelligence agencies know everything about the US proxy war they created in Ukraine. The fact that they are now pretending not to know what’s happening is a strong indicator that the war is going badly for Ukraine. Damage control won’t work just like it didn’t work with Iraq.","date":"Fri Jun 10 00:09:49 +0000 2022","user_id":"611986351"}]