[{"handle":"mattcutts","text":"This ♥️ is for @aranoff, and so is the big squishy one in my chest.🫀 https://t.co/3gdQaxJfW5","date":"Mon Feb 14 23:11:25 +0000 2022","user_id":"3080761"},{"handle":"mattcutts","text":"@haahr Based on /usr/dict/words, I liked TARES, COULD, then PINKY. It turns out the Wordle list drops all (?) the plural words that end in S. So putting S in the final slot was a complete waste. 🙃","date":"Sun Jan 23 15:51:47 +0000 2022","user_id":"3080761"},{"handle":"mattcutts","text":"@haahr I went down a similar analysis path on /usr/dict/words, until I discovered that Wordle has a set of (common) words that can be the solution, and a (wider) set of exotic words that can be used as guesses: https://t.co/lN7Hl5aZUE","date":"Sun Jan 23 15:49:13 +0000 2022","user_id":"3080761"},{"handle":"mattcutts","text":"@shikibmehri please tell me that TARES scores well, because that's my cornerstone based on letter frequency, plus the odds of 'e' at the fourth slot and 's' as the final letter. :)","date":"Sat Jan 22 16:55:08 +0000 2022","user_id":"3080761"},{"handle":"mattcutts","text":"@shikibmehri Fun stuff! For your first word, did you constrain yourself to only five letter words when calculating letter frequencies? Doing that with /usr/dict/words, S was more frequent than T for me. If you're trying to maximize matches with the first word, would that lead to AROSE?","date":"Sat Jan 22 16:25:30 +0000 2022","user_id":"3080761"},{"handle":"mattcutts","text":"Today was my first Canadian snow day! Thanks to @aranoff for introducing me to this beast of a winter.\n\nTomorrow's experiment is maple syrup taffy on the snow in our backyard.\n🇨🇦❤️❄️ https://t.co/XeSnI3igIr","date":"Tue Jan 18 03:41:55 +0000 2022","user_id":"3080761"},{"handle":"mattcutts","text":"Canadians, which bank has the best user experience (website or app that works well, strong customer service, and smooth at setting up RRSPs/TFSAs)?\n\nWhich bank do you prefer and why? Thank you!","date":"Wed Dec 22 20:07:08 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"Friends, I need your suggestions. What power song gets you inspired and/or running faster? I need more + better running music.\n\nFeel free to share your whole playlist!","date":"Thu Dec 02 17:37:28 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"@aranoff I know I'm a holiday or so behind. I often am. https://t.co/4F4ESwdyJr","date":"Sun Nov 28 01:15:08 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"I'm thankful to @aranoff for introducing me to the tradition of \"pumpkin parades\" on a recent date night.\n\nThe day after Halloween, many folks in Toronto bring their pumpkins to outdoor parks. It's a safe way to bring a community together and share some fun. https://t.co/OCtl5xGYOz","date":"Sun Nov 28 01:12:02 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"@aranoff @RojoPup @RojoPup responds well to positive affirmation, and this picture is a good reminder. Thanks for sharing this. :)","date":"Thu Sep 02 18:11:39 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"Amazing: Mina Hsiang will be the next leader of the U.S. Digital Service. She's experienced, incredibly capable, and cares deeply about the work. I'm so excited for USDS, her, and the future.\n\nhttps://t.co/J6PmkS1Nc9\n\nWhat a great time to apply to serve:\nhttps://t.co/fVogIs8Gvm","date":"Thu Sep 02 16:11:12 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"New-ish blog post: You need to meet Lindsay, my force of a human: https://t.co/eVKgR1gEWP https://t.co/xonx1BqjEH","date":"Sat Aug 28 15:08:19 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"Now that I no longer have tons of meetings, it was nice to look through photos of the last two years together with @aranoff. My faves are the silly ones and dog pictures. I hope you get to take some time to reflect on the people and things that make you feel happy today. https://t.co/KEsDDPJhoh","date":"Mon May 10 16:23:15 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"At the end of April, I'm stepping down as Administrator of the U.S. Digital Service.\n\nIt's such an incredible group of people, and I'm grateful for my time working alongside them. More info: https://t.co/xJ7VCfuxDW","date":"Wed Apr 14 20:45:13 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"Huge congrats to @ClareMartorana on becoming the next Federal CIO. She's kind, empathetic, and cares most about getting good things done for people. I couldn't be more excited about Clare taking on this role.","date":"Wed Mar 10 03:40:33 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"Black lives matter.","date":"Sat Jan 30 20:56:40 +0000 2021","user_id":"3080761"},{"handle":"mattcutts","text":"@sequoia @Tracy_Young @ralphleon @rsuttong @PlanGrid @autodesk @dougleone Does anyone know if the PlanGrid shares qualified for Qualified Small Business Stock (QSBS) treatment? Asking for an accountant.","date":"Wed Jun 10 15:38:42 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"@UdayaPatnaik @CAgovernor Congratulations Udaya! That's fantastic news! I'm looking forward to the work you'll be doing for Californians!","date":"Thu May 14 19:52:28 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"These fellowships bring technical expertise into Congress, which is hugely important and impactful. I hope that USDS alumni and civic tech folks will consider applying.","date":"Thu May 07 02:23:29 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"We could really use 1-2 amazing content strategists at the U.S. Digital Service right now. If you know that person (or are that person!), please get them to apply: https://t.co/DhPlLOtRP2\n\nMore info on what to expect: https://t.co/vFxxwUmySV","date":"Wed May 06 19:14:26 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Folks who are leading or managing teams, how are you fostering a sense of community when folks are doing distributed work?\n\nWhat things have worked well for you or your team?","date":"Wed Apr 29 20:13:50 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"TechCongress is accepting fellowship applications now: https://t.co/AMtndb5obE\n\nIt's a really high-impact way to raise the tech savviness of Congress, which is incredibly important.","date":"Wed Apr 29 18:33:03 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"@1p3aDev wanted to connect about something if you can message me?","date":"Tue Apr 28 02:48:27 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Good post by @pahlkadot about ways to implement Pandemic Unemployment Assistance (PUA) faster/better, plus a group of folks who are ready and willing to help states with it: https://t.co/MV26omD4lJ","date":"Tue Apr 21 19:41:39 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Government gets better when amazing folks join and serve. You can go to https://t.co/QY5E3kCI6O now, create a profile, upload your design portfolio and resume, and apply starting this Wednesday!\n\nNow is your chance to help improve service design for a bunch of federal agencies!","date":"Mon Apr 20 18:40:48 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Have you ever wanted the US government to provide a better user experience? Good news--several federal agencies will be hiring high-level customer experience strategists! More info at https://t.co/DmBiOAfimg and https://t.co/A5Cy8MGcZj !","date":"Mon Apr 20 18:06:02 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"@shostack It's weird. It's all weird. But we're able to get good work done.","date":"Sat Apr 18 21:14:49 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Grateful to @aranoff for helping me find my inner silly. Whether it's with the help of partners, pets, friends, family, books, or just your own strength, I hope everyone is staying grounded. Please be kind to yourself. https://t.co/t2XpMW8oyk","date":"Sat Apr 18 21:06:32 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"If you're a technologist (SRE, software engineer, designer, product manager), here's some of the impact you can have in government: https://t.co/zENS12DFo5\n\nWith COVID, we need tech talent in the government more than ever now. Please consider applying: https://t.co/DhPlLOtRP2","date":"Thu Apr 16 18:07:13 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Excited to be live at https://t.co/Vjd2JJ9ps6 talking to @ClareMartorana @jj_anastasoff and the Partnership for Public Service @RPublicService","date":"Thu Apr 16 17:03:54 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"This is starting in 10 minutes! Please join us for this fun, rollicking discussion. :)","date":"Thu Apr 16 16:52:45 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"This Thursday I'll be talking with the Partnership for Public Service and @ClareMartorana (CIO of the Office of Personnel Management) about tech talent for 21st century government.\n\nWant to join? Register here: https://t.co/ib6SfIWU6q","date":"Sat Apr 11 20:49:19 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"This makes me so happy: https://t.co/ku80091qLG\n\nTechnical details here: https://t.co/u1FBhMe5ID\n\nKudos to Apple and Google for their leadership and partnership on this.","date":"Fri Apr 10 18:59:02 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"This is wonderful + huge news about Apple and Google coming together with an approach to contact tracing: https://t.co/iC35x8juGd\n\nReally happy to see this.","date":"Fri Apr 10 17:13:24 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Government employees can get free access to O'Reilly's learning library: https://t.co/XG6TGf8bQA through Independence Day weekend. Learn a little more about site reliability engineering or data science or whatever new skills would help.","date":"Mon Apr 06 21:15:09 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Want to use your product skills to help evolve health care? The Centers for Medicare and Medicaid Services (CMS) is hiring product managers. The job posting is live today and will close after 500 applications!\nhttps://t.co/RbS7gqyxyy","date":"Mon Mar 23 14:36:21 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"State, local, &amp; other government folks can ask for technical help here: https://t.co/JouX5J41xl\n\nTechies can also volunteer.\n\nThis isn't affiliated with the US Digital Service nor with the US government. Many of the volunteers have worked at @USDS, @18F or @codeforamerica though.","date":"Mon Mar 23 00:58:04 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"@bzaba @levinson0 @ericries Not sure, but @stroupaloop might know.","date":"Mon Mar 23 00:52:53 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"@philasem I do (this is my personal opinion. I'm not speaking in a work-related role.)","date":"Mon Mar 23 00:52:33 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"@kevinchen @deliberatecoder https://t.co/ENlCdPAWod","date":"Mon Mar 23 00:51:32 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"This site helps match suppliers of masks and personal protective equipment (PPE) with people who need it: https://t.co/bflvcMYQrI\n\nGreat to see this work by the civic tech community.","date":"Sun Mar 22 13:58:50 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Reading https://t.co/n9V71DYmbd right now.","date":"Fri Mar 20 13:33:15 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Lots of folks are paying attention to washing their hands. This video has pretty good guidance on how to do it well: https://t.co/VyqFbruqit","date":"Wed Mar 18 12:54:55 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Former USDSer John O'Duinn is doing free presentations this week about how teams can work in a distributed fashion: https://t.co/0MhagQmbVK","date":"Wed Mar 18 12:44:34 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"I did a TED talk about why technologists (designers, engineers, and product managers) should do a tour of public service. The talk is now live: https://t.co/zENS12VgfD\n\nLearn more at https://t.co/fVogIrR56M , or please share the talk. Thank you!","date":"Wed Mar 11 01:10:22 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Thank you for coming to my TED talk: https://t.co/zENS12DFo5","date":"Mon Mar 09 21:34:34 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"This is a big win for patient interoperability. It will improve care and health outcomes for so many people.","date":"Mon Mar 09 21:15:30 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"@digiphile @AP @USDS @GOVUK @codeforamerica @ObamaWhiteHouse Absolutely @GDSTeam + @pahlkadot + @codeforamerica deserve props for sparking civic tech, and @USDS owes huge thanks to them.\n\nI think the article also highlighted a new wave of state digital services like in Colorado; excited to see USDS alum @ktinboulder helping with Colorado!","date":"Tue Feb 18 22:01:17 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"There is such amazing work to be done to help Veterans, improve school safety, and provide better support to patients/doctors. If you've ever considered a tour of public service that uses your tech skills, learn about @USDS and apply here: https://t.co/fVogIs8Gvm","date":"Tue Feb 18 21:51:59 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Just thinking this morning about how great it is that Colorado is creating a Colorado Digital Service to improve its services to the public. And that more and more states are looking to improve their services with human-centered design and technology.","date":"Thu Feb 06 15:25:09 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"@aranoff I feel like these pictures capture some of the clumsiness and joy that I feel inside at times, and I wouldn't trade it for anything. Thank you for you. https://t.co/uycZY2DmAF","date":"Mon Feb 03 14:19:27 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"I really enjoyed doing this podcast with Stack Overflow! Give it a listen: https://t.co/o5TGgYGrtK","date":"Tue Jan 21 15:26:47 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"If you want to understand the US Digital Service, read this interview with USDS alumna @barkimedes: https://t.co/1PYjKgiMWB\n\nThen consider applying at https://t.co/0MkuUtzius.","date":"Thu Jan 16 14:51:33 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"In 2019 I met a new partner, and she's taught me so much about listening to my inner voice, being healthy, and getting offline to move my body. Thank you, @aranoff.\n\nI wish everyone a 2020 where you find people who make you happier, laugh more, and push you to be a better person. https://t.co/07ALg74usz","date":"Mon Jan 13 13:30:01 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Folks who have been to Costa Rica, where are your favorite places to stay, relax, or otherwise enjoy fun, adventure, and beauty?","date":"Sun Jan 12 22:32:15 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Maybe try a 30 day challenge instead of New Year's resolutions? https://t.co/ZFa3c27y3K\n\nFor December, my 30 day challenge was to avoid sugar. I wasn't perfect, but I'm pretty happy with how it went.\n\nFor January, I'm going to stay off social media/Twitter as much as I can.","date":"Wed Jan 01 01:38:53 +0000 2020","user_id":"3080761"},{"handle":"mattcutts","text":"Each year I get a small frisson of joy from the Festivus pole when you search Google for [festivus]. https://t.co/UzNVRHb0L1","date":"Mon Dec 23 21:17:08 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@kathytpham Yay!","date":"Mon Dec 16 21:51:37 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"I'm sitting down to answer questions on Product Hunt right now: https://t.co/R958V8CDAN Come on over and ask about what it's like working at the US Digital Service!","date":"Fri Dec 06 17:40:14 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"I chatted with the @ycombinator podcast about the early days of Google, and the US Digital Service: https://t.co/y6IRTHdIHt\n\nWe're looking for great product managers, engineers, and designers! Apply here: https://t.co/DhPlLOtRP2","date":"Wed Dec 04 22:27:09 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"I'll be doing an AMA on Product Hunt if anyone wants to submit questions!","date":"Tue Dec 03 18:48:24 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"One of my 30-day challenges this month is to cut out added sugar. If you see me with a piece of candy, slap it out of my hand and shout \"Matt, you promised!\"","date":"Mon Dec 02 23:46:49 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@quantity thank you. I appreciate that. Hope you're doing alright heading into the holidays..","date":"Sun Dec 01 23:42:43 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@Mr_Ashman @TEDTalks @KutztownAMS @KutztownASD That's fantastic! Sounds like you have an amazing group of students! Congrats to all of them for trying something new--way to go!","date":"Sun Dec 01 23:42:13 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"Congrats to the Nova Scotia Digital Service on their launch! https://t.co/bC34ums9SQ","date":"Fri Nov 29 21:37:05 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"This is a huge move forward to improve security in the US government. A vulnerability disclosure policy provides a way for folks outside government to report security issues that they find.","date":"Wed Nov 27 19:25:32 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@cephalobloop Okay, I got the Google Pixelbook Go (Intel® Core™ i5 16GB RAM 128GB Storage Full HD Display) Just Black","date":"Wed Nov 27 02:36:13 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"I had forgotten that you can run a battery test on Chromebooks. Use &lt;control&gt;-&lt;alt&gt;-t to open a crosh window, then type\n\nbattery_test 30\n\nto run a 30 second test and to see your Chromebook's battery health.","date":"Mon Nov 25 15:25:19 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@cephalobloop The one that was on the waitlist that just came off a waitlist? I think the top-end one is still waitlisted?","date":"Mon Nov 25 00:59:59 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"My short Pixel 4 XL review:\n- Nice phone\n- The people in charge of porting settings/apps from one phone to the next *really* nailed it.\n- Thicker w/more battery life please. Don't need thinner. \n- I miss the fast/explicit unlock of the fingerprint sensor. Face unlock too finicky.","date":"Sun Nov 24 17:04:02 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"My short Pixelbook Go review:\n- Screen should be 3:2 aspect ratio, not 16:9\n- Needs a USB-A port\n- Keyboard is excellent\n- Not as nice/sturdy as Chromebook Pixel 2015\n\n#ChromebookPixel2015ForLife","date":"Sun Nov 24 16:57:15 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"Seven benefits that Veterans might overlook: https://t.co/A4yoJdz2x9","date":"Mon Nov 18 17:13:35 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@ronilan @neyne @paultoo the specific situation with Totlol, but that's my best estimate of what I was trying to say ten years ago.","date":"Sat Nov 16 22:42:36 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@ronilan @neyne @paultoo or legal or internationalization or wherever. In many of the cases I saw, someone assumed that Google took some action in response to them or their site or their comments, when I knew from my position that the action had been percolating for months. Again, I don't know/recall","date":"Sat Nov 16 22:41:00 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@ronilan @neyne @paultoo For example, people often assumed that a change with Google was a deliberate reaction to an immediate stimuli. At least in my experience, changes often took weeks (or more often months) to wend their way through levels of approval, consultation with other groups, potentially PR..","date":"Sat Nov 16 22:39:23 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@ronilan @neyne @paultoo Thanks for pointer. I don't have/recall the inside word on any of that situation. What I did see many times were people attributing malice (or even just intent) on the timing of when something happens like \"I started advertising with AdWords and then my site dropped in rankings.\"","date":"Sat Nov 16 22:36:51 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"I love this short talk by @Astro_Cady, accompanied by vivid footage, of what it's like to live on the International Space Station: https://t.co/M5yirVWR3T","date":"Sat Nov 16 22:16:31 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"I'm thrilled that people like Jeff (former CTO of Stitch Fix) are bringing their technology expertise into government. Working with civil service partners, it means better services for people like Veterans and doctors/patients.\n\nHave you considered @USDS? https://t.co/fVogIs8Gvm","date":"Sat Nov 16 02:10:43 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@ronilan @neyne The original tweet doesn't seem to be available, so I'm not sure what it was about?","date":"Fri Nov 15 23:48:35 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@ShennandoahTX Any luck?","date":"Fri Nov 15 23:47:04 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@theotherlinh I'll mention this to some folks and see if we can get it in front of the right people.","date":"Fri Nov 15 23:44:54 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"Watching my friend forging a Viking broad sword is strangely relaxing: https://t.co/M8xG3R7yIJ","date":"Fri Nov 15 05:18:58 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"18F will be looking for a new executive director soon. It's a phenomenal organization that makes government better, more open, and more human-centered.\n\nProps to @angelacolter for her service as well!","date":"Fri Nov 15 02:07:37 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"Really neat to see this partnership between the VA and Apple that lets Veterans access their health records via Apple's health records service: https://t.co/z6syD2XFPd","date":"Wed Nov 06 17:12:18 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"Listen to David Holmes, our Director of Engineering at @USDS, and his story: https://t.co/sA26L353Cj\n\nIf you want to meet him, come to Afrotech Nov. 7-10 in Oakland! https://t.co/QCkRwvMv04 \n\nOr apply to @USDS and come work with him! https://t.co/DhPlLOtRP2","date":"Thu Oct 31 18:15:15 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"About to do something dumb again. In Rhode Island this time. https://t.co/VYXcdA7j2Q","date":"Sun Oct 27 11:15:42 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"Nice to see plus codes leading to better addresses for people. Pretty exciting use of tech to improve things: https://t.co/TewM8AuSmX\n\nHat tip to @sartin_shannon for spotting this!","date":"Fri Oct 25 21:36:52 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"Tech folks in California, here's a great opportunity to see if you might be interested in improving government services. Give it a try and see how meaningful it can be!","date":"Thu Oct 24 20:16:26 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"Truly proud and grateful that I get to work with people like David Holmes, @USDS Director of Engineering. Nice to see him recognized as the best of #dctech: https://t.co/OULJOVmh6g","date":"Thu Oct 24 19:55:04 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@BarbDavids I haven't done that quick of a turnaround before, so we'll see how it goes :)","date":"Tue Oct 22 04:00:34 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@RyBacorn radical candor","date":"Tue Oct 22 03:59:44 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"New blog post:  All the Fitbit activity badges https://t.co/g5Yy1NT54u","date":"Mon Oct 21 03:06:53 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@jimmyrooney best to ask folks like @googlewmc","date":"Mon Oct 21 00:22:46 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@KCartero yup!","date":"Mon Oct 21 00:21:46 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@BarbDavids Baltimore is done! It was a perfect day to run. This coming weekend, I hope to cross Rhode Island off the list.","date":"Mon Oct 21 00:21:31 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"@Birdie5146 thank you!","date":"Mon Oct 21 00:20:48 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"This is an interesting idea: non-profit ioby gives their employees five \"civic duty\" days a year that people can use to help and improve their community: https://t.co/RD1Oe0ue67","date":"Sun Oct 20 18:49:35 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"About to do something dumb again. In Baltimore this time. https://t.co/HTdqbEi3W6","date":"Sat Oct 19 11:55:55 +0000 2019","user_id":"3080761"},{"handle":"mattcutts","text":"Whoa, looks like Colorado is starting a Colorado Digital Service!","date":"Thu Oct 17 21:08:03 +0000 2019","user_id":"3080761"}]