[{"handle":"NicolasMaduro","text":"Bajo el lema “Somos libres, escribimos en un país libre y no nos proponemos engañar al público”, hace 204 años, se publicó el 1er número del Correo del Orinoco, que permitió mostrar el proceso independentista de Venezuela. Sigamos en defensa de la verdad como nos enseñó Bolívar. https://t.co/Ujdwb8AXUb","date":"Mon Jun 27 13:03:11 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Mi reconocimiento para todas y todos los periodistas en su día. El trabajo comunicacional ha sido vital para mostrar la verdad de Venezuela ante el mundo, en medio de circunstancias adversas, sin detenernos. Hoy #27Jun, celebro su ética, moral y esfuerzo. ¡Felicidades! https://t.co/oyEEpryy3X","date":"Mon Jun 27 12:32:50 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Para nosotros el “Combate en las Termópilas de Paya”, fue un paso para alcanzar la victoria definitiva que otorgaría la emancipación de nuestros pueblos hermanos. A 203 años de esta hazaña, destacamos la valentía y la lucha incansable de nuestro heroico Ejército Patriota. https://t.co/gIkd92ZNAQ","date":"Mon Jun 27 12:22:11 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Un día especial, de reconocimiento a los Comunicadores y Comunicadoras del país, que defienden la verdad; en los medios, redes y paredes. Hagamos comunicación responsable y derrotemos las mentiras de los mercenarios de la información. Pendientes, hoy estaré con ustedes.","date":"Mon Jun 27 11:50:22 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Se suman 10 Medallas más para Venezuela en los Juegos Bolivarianos Valledupar 2022. Felicito a todas y todos los medallistas, en especial al equipo de Espada Femenina, a Luis Rovaina, Rogelio Felices, Elvismar Rodríguez y Andrés Madera, ganadores de Oro. ¡Mi Abrazo! https://t.co/KYyR0A9R3a","date":"Mon Jun 27 03:03:58 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Recomiendo leer el libro: \"Pensar la ciencia de otro modo: propuestas y desafíos de(s)coloniales para una Venezuela soberana\". Un análisis sobre los desafíos de la investigación científica y la innovación tecnológica para el bienestar del pueblo. ==&gt; https://t.co/AOPF0VARwO https://t.co/z71bkqkV94","date":"Sun Jun 26 15:24:07 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Salvador Allende encarnó los principios sociales y humanistas, con gran sabiduría condujo al pueblo de Chile por los caminos de la igualdad, el respeto y la solidaridad. Lo recordamos con admiración en el 114° Aniversario de su natalicio. https://t.co/2OyN9W9YtQ","date":"Sun Jun 26 14:23:26 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Convertiremos a Venezuela en un referente mundial de protección y convivencia armónica con la Pachamama, desde los principios ecológicos de la Revolución Bolivariana. ¡Día Internacional de la Preservación de los Bosques Tropicales! https://t.co/DK2nH4mSvS","date":"Sun Jun 26 14:14:16 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"En Venezuela nos plantamos firmes para acabar con el narcotráfico en nuestro territorio, este #26Jun, Día Mundial de la Lucha contra el uso indebido y el Tráfico ilícito de Drogas, ratificamos el compromiso de garantizar una Patria segura, próspera y libre de drogas. https://t.co/7dGRy7z4nM","date":"Sun Jun 26 13:27:35 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"¡Na' Guará Venezuela! 15 Medallas para nuestros atletas el día de hoy #25Jun en los XIX Juegos Bolivarianos Valledupar 2022, entre las que destacan 5 de Oro para Luis Robaina, José Félix Quintero, Fabiola Díaz, Cleiver Casanova y Kady Cabezo. ¡Los Felicito Muchachas y Muchachos! https://t.co/cjRJ3zsG5n","date":"Sun Jun 26 02:02:40 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Gracias a la implementación del Sistema 1x10 del Buen Gobierno, hoy #25Jun, ha sido un éxito total la conformación de las #BriCoMil para la Educación. Felicito el esfuerzo y la disciplina de toda la dirigencia popular y de nuestra gloriosa FANB. ¡Vamos por más Victorias! https://t.co/0LyRssvWHa","date":"Sat Jun 25 23:12:19 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Hoy sábado #25Jun, se están conformando las Brigadas Comunitarias Militares para la Educación, que irán con fuerza a reparar, recuperar y a poner bien bonitas las escuelas y liceos del país. ¡Mosca Pues! ¡Activos, Activas! Estaré pendiente del desarrollo de esta tarea. https://t.co/It1y8F6F4D","date":"Sat Jun 25 20:02:20 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Gracias David por tus homenajes a nuestro Libertador Simón Bolívar, y por deleitar al pueblo venezolano con cada presentación. Ya eres parte de esta tierra Bolivariana que tanto te admira. https://t.co/PtfKuwJAxM","date":"Sat Jun 25 19:24:23 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Una vez más, ratificamos el compromiso de Venezuela por seguir generando relaciones de respeto, solidaridad y hermandad con los países de Nuestra América para consolidar la unión, la Paz y el bienestar de nuestros pueblos. https://t.co/SUXCeJwJqa","date":"Sat Jun 25 19:18:13 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Los invito a leer y descargar la edición N° 320 del semanario @CuatroFWeb, contiene los logros de la exitosa gira internacional que llevé a cabo y el triunfo histórico del pueblo colombiano. https://t.co/VlpzmRDJB3 https://t.co/qZBbFAbMSt","date":"Sat Jun 25 15:58:46 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Exaltamos la sensibilidad, la humanidad y el amor de Hipólita Bolívar, quien formó parte importante en la crianza del Libertador Simón Bolívar. En la mujer venezolana está inmersa la entrega y el amor maternal de la Negra Hipólita. https://t.co/3b15UrNznx","date":"Sat Jun 25 15:40:53 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Gracias a Dios el Creador, al Padre Bolívar, a nuestro guía, el Comandante Chávez, hoy Venezuela está de pie y victoriosa. Hemos enfrentado amenazas, bloqueos y sanciones criminales, y nada ni nadie detuvo nuestro empeño por construir el Socialismo Bolivariano.","date":"Sat Jun 25 15:28:24 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Los XIX Juegos Bolivarianos Valledupar 2022 quedan oficialmente inaugurados y allí están presentes nuestros atletas, quienes llevan con orgullo la bandera tricolor. Venezuela brilla con todo el esplendor del deporte que nos une como países hermanos. ¡A competir y a ganar! https://t.co/6iG065zu6X","date":"Sat Jun 25 11:02:43 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Me siento muy feliz de recibir al bailaor y coreógrafo español David Morales, quien llega a esta ciudad de Libertadores, para interpretar al Padre de la Patria, Simón Bolívar, con su espectáculo \"Invicto\", un acto cargado de gran simbolismo para nuestra historia independentista. https://t.co/AQLphOdp78","date":"Sat Jun 25 01:52:32 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Recibí de María Isabel Martínez Chavarría sus Cartas Credenciales, en su condición de Embajadora designada de la República de Nicaragua ante la República Bolivariana de Venezuela. Somos naciones hermanas, que hoy luchan por el respeto soberano de sus pueblos. ¡Bienvenida! https://t.co/48hr2GVcLg","date":"Sat Jun 25 00:49:48 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Con mucho placer recibí las Cartas Credenciales del Embajador designado de los Estados Unidos Mexicanos ante la República Bolivariana de Venezuela, Leopoldo de Gyves de la Cruz. ¡México lindo y querido! Tierra que palpita en nuestro corazón como hermanos de la patria Bolivariana. https://t.co/loPdePBZIS","date":"Sat Jun 25 00:28:01 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Venezuela saluda al pueblo granadino por la jornada democrática celebrada el #23Jun, en la que resultó electo como nuevo Primer Ministro el Sr. Dickon Mitchell. Enviamos sinceras felicitaciones y el compromiso de seguir consolidando lazos de hermandad con los pueblos del Caribe. https://t.co/j5SDbNV50g","date":"Sat Jun 25 00:21:22 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Recibo las Cartas Credenciales de los embajadores designados de la República de Nicaragua y los Estados Unidos Mexicanos. https://t.co/smkSui4ksO","date":"Fri Jun 24 22:01:09 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Emotiva y hermosa obra teatral de la Fundación “Manuelita Sáenz”, en la que pudimos ver representado al Libertador Simón Bolívar, a José Leonardo Chirino, al Negro Primero, a los héroes y heroínas de la patria. Así revivimos nuestra historia heroica y profunda. ¡Viva Carabobo! https://t.co/eY0E409Xhl","date":"Fri Jun 24 17:13:01 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Construimos un Ejército Bolivariano, anticolonialista, antiimperialista y antioligárquico, que con su moral histórica va adelante con la verdad para la construcción de la igualdad, la independencia, la justicia y la libertad. ¡Rumbo al Socialismo Bolivariano! https://t.co/i5aQ0RuRnb","date":"Fri Jun 24 17:09:53 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Hermoso acto de celebración de los 201 años de la Victoria en la Batalla de Carabobo y Día del Ejército Bolivariano de Venezuela. A cada soldado y soldada, herederos directos de las glorias de Carabobo y de los Libertadores y Libertadoras, mi felicitación profunda. ¡Un Abrazo! https://t.co/0wgtzgMwvY","date":"Fri Jun 24 17:07:51 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Comparto una gran obra: “El fuego perpetuo”, de Gabriel Jiménez Emán. Es un libro bueno, así lo cataloga en su presentación el historiador Pedro Calzadilla, y no tengo duda de ello, porque nos insta a amar aún más a nuestra historia gloriosa y victoriosa =&gt;https://t.co/Z8KK2IgoDs https://t.co/gIkrXOznIN","date":"Fri Jun 24 15:44:17 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Hace 201 años brilló la destreza y la valentía de Pedro Camejo, destinado a sellar la independencia de Venezuela con su lanza. Un digno guerrero que murió y nació en Carabobo. Hoy nos llena de su fuerza y espíritu rebelde para seguir haciendo Patria. ¡El Negro Primero nos guía! https://t.co/tWwLzlVrj8","date":"Fri Jun 24 15:25:41 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"¡Estamos de fiesta! Me siento muy feliz, porque este #24Jun, en diferentes regiones del país, nuestro pueblo canta y baila al repique de los tambores venezolanos, para homenajear a San Juan Bautista, una celebración cargada de mucha fe, alegría y esperanza. https://t.co/ddHaVrPMlU","date":"Fri Jun 24 15:24:42 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Acto de Celebración del 201° Aniversario de la Batalla de Carabobo y Día del Ejército Bolivariano. https://t.co/DWLSjQovsq","date":"Fri Jun 24 13:29:24 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Acto de Celebración del 201° Aniversario de la Batalla de Carabobo y Día del Ejército Bolivariano. https://t.co/0jBAZ8rBgP","date":"Fri Jun 24 13:09:54 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"En Carabobo se encuentran todos los sueños y los caminos que forjaron nuestros Libertadores para darnos la libertad. Son más de 200 años de lucha por la soberanía de la Patria que seguimos defendiendo con amor y compromiso. ¡Viva Bolívar y nuestro Ejército Patriota! https://t.co/BDKb8PP090","date":"Fri Jun 24 13:03:15 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Felicito al Ejército Bolivariano, hombres y mujeres que defienden el territorio nacional con dignidad y patriotismo. Su espíritu combativo, heredado de las luchas históricas de nuestros Libertadores, es clave para enfrentar las amenazas que atentan contra la Paz de Venezuela. https://t.co/NGEJVysqYh","date":"Fri Jun 24 12:01:06 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Este bello amanecer, cargado de vientos de dignidad, patriotismo y libertad, nos convoca a todas y todos los que amamos a Bolívar y a nuestra Patria, para seguir luchando por la consolidación de la nueva era de prosperidad. Tenemos el camino claro, trabajemos por lograrlo.","date":"Fri Jun 24 11:36:17 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Veamos a través de este video un resumen de la historia de la #GMVV que avanza indetenible para alcanzar la meta de las 5 millones de viviendas y más. Somos vanguardia en el mundo por la construcción de complejos habitacionales, urbanismos, casas y apartamentos. ¡Vamos Pa’ lante! https://t.co/nUEimQckIz","date":"Fri Jun 24 02:36:17 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Medallas de Plata y Bronce para nuestros jóvenes atletas Antonio Leal - Florete y Lizzie Asís - Espada Femenina. ¡Bravo Muchachos! Apenas está por iniciar este camino en los Juegos Bolivarianos Valledupar 2022 y lo que vamos es pa' lante. ¡A triunfar! https://t.co/KKbiaVSKrl","date":"Fri Jun 24 02:05:49 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"¡Cumpliendo la palabra empeñada! Aprobé recursos por más de 6 mil Petros para la ejecución de las viviendas del Movimiento de Pobladores y Pobladoras en todo el territorio nacional, a través de la adquisición de los materiales de construcción. ¡Cúmplase! https://t.co/GOjhdBtw6s","date":"Fri Jun 24 01:41:56 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Es indiscutible la capacidad de resistencia y el esfuerzo de la Revolución por garantizar viviendas dignas a las familias. Les regalo un libro y un atlas de la #GMVV Tomo 2, que reflejan parte de estos logros.\n\nLibro. ==&gt; https://t.co/v69E5OAEXA\nAtlas. ==&gt; https://t.co/F35qQBlTLq https://t.co/hyGKfcv4Qv","date":"Fri Jun 24 01:23:29 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Hoy #23Jun, realizamos un hermoso acto que ratifica el amor y compromiso de la Revolución con el pueblo venezolano, la entrega del Hito 4 millones 100 mil de la Gran Misión Vivienda Venezuela, la reina de las misiones y grandes misiones, que no se detiene ni se detendrá jamás. https://t.co/UlSppNu4NY","date":"Fri Jun 24 01:18:37 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Entrega del Hito 4 Millones 100 mil de la Gran Misión Vivienda Venezuela. https://t.co/ggeFEdABA8","date":"Thu Jun 23 21:19:24 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"La mano de obra venezolana, su fuerza e inventiva de los trabajadores y las trabajadoras están haciendo posible el milagro productivo y la recuperación económica. Juntos todo es posible, con esfuerzo propio estamos echando adelante a nuestra Patria. https://t.co/LB91pMaWLp","date":"Thu Jun 23 16:36:06 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Celebramos junto al pueblo nicaragüense los 86 años del natalicio de Carlos Fonseca Amador, sus valores democráticos, socialistas y antiimperialistas, son un referente para los que nos plantamos firmes contra una hegemonía en decadencia por la defensa de nuestra soberanía. https://t.co/04DT0R0gnA","date":"Thu Jun 23 14:52:02 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Hoy exaltamos a Micaela Bastidas Puyucahua en su natalicio, una de las lideresas más destacadas de Perú y la Patria Grande. Su valentía la llevó a enfrentarse al poder colonial. ¡Herencia de rebeldía y determinación! https://t.co/PfK1v2kK3g","date":"Thu Jun 23 14:08:25 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Mis felicitaciones a todos los abogados del país en su día, especialmente a mi compañera y primera combatiente de Venezuela, @ConCiliaFlores. Sigan ejerciendo el Derecho con ética, compromiso y moral por la justicia de nuestro pueblo. ¡Mi abrazo fraterno! https://t.co/AYuvqRdy2D","date":"Thu Jun 23 13:49:23 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"La Gran Misión Vivienda Venezuela avanza sin detener ni un segundo la construcción de hogares dignos para la familia, tomando en cuenta las propuestas del movimiento popular y de todo nuestro pueblo. Hoy #23Jun, estén atentos y atentas, que tendremos buenas noticias.","date":"Thu Jun 23 11:43:25 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Expreso en nombre de Venezuela nuestra solidaridad con el pueblo de Afganistán, en estos momentos de incertidumbre y dolor que ha dejado el sismo de 5.9 grados. Mis condolencias por las pérdidas humanas. Pedimos por la salud de las y los heridos. ¡Nuestro Abrazo y Apoyo! https://t.co/T1szZqdGXZ","date":"Wed Jun 22 22:33:16 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"El Movimiento de Pobladores y Pobladoras cuenta con todo mi apoyo y respaldo para avanzar hacia el desarrollo colectivo, la construcción de comunidades y comunas. El pueblo como sujeto participativo y protagonista de la vida comunitaria. ¡Viva la Unión del Pueblo! https://t.co/skpO2nFHAr","date":"Wed Jun 22 19:42:57 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Conversé con el presidente electo de Colombia @petrogustavo, y en nombre del pueblo venezolano, lo felicité por su victoria. Dialogamos sobre la disposición de restablecer la normalidad en las fronteras, diversos temas sobre la Paz y el futuro próspero de ambos pueblos. https://t.co/ZK3cBE8JdO","date":"Wed Jun 22 17:37:00 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Este #22Jun recordamos el día en que mi gran amigo e insigne figura del fútbol mundial, Diego Armando Maradona, causó furor en el mundo con “el gol con la mano de Dios”. Cuando el \"Pelusa\" se convirtió en el héroe de Latinoamérica con un gesto de picardía. ¡Grande Diego! https://t.co/6USL3NyxUr","date":"Wed Jun 22 14:03:13 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Hoy #22Jun, Bolívar va cabalgando otra vez, con fuerza, por los pueblos de Latinoamérica y el Caribe, así como lo hizo hace 196 años en el Congreso Anfictiónico de Panamá. Vienen nuevos y mejores tiempos de unidad verdadera para la Patria Grande. https://t.co/f9uHyldOVV","date":"Wed Jun 22 12:53:44 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"\"Todos los pueblos del mundo que han lidiado por la libertad han exterminado al fin a sus tiranos\", recordamos estas sabias palabras del Libertador Simón Bolívar, al conmemorar la hazaña histórica que emprendió en su paso por Los Andes, rumbo a la liberación de Nueva Granada. https://t.co/c9IxBAphDx","date":"Wed Jun 22 11:49:12 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Como le prometí al Movimiento de Pobladores y Pobladoras, he estado leyendo y estudiando su “Propuesta de Ley de Producción Social para la Vivienda y el Hábitat”. Soy un Presidente revolucionario que escucha las críticas y recibe las propuestas del pueblo.","date":"Wed Jun 22 11:17:42 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Instruí a la Vicepresidenta @delcyrodriguezv que me presente de inmediato la propuesta de Reglamento de la Ley de los y las Trabajadoras Residenciales. Igualmente encargué a @IMVillarroel1 y @jaarreaza, las viviendas para los y las trabajadoras residenciales que lo necesiten. https://t.co/X1GslHUaEA","date":"Wed Jun 22 01:01:44 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Estoy contento de haber recibido en el Palacio Presidencial de Miraflores al Movimiento de Pobladores y Pobladoras en resistencia, en renacimiento y en revolución permanente, hombres y mujeres con propuestas. Venezuela lo que vamos es pa’ lante, con el pueblo y el Poder Popular. https://t.co/NWOmSt2jhL","date":"Wed Jun 22 00:48:23 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Extraordinaria marcha popular del Movimiento de Pobladores y Pobladoras de la Patria, que hoy recorrieron las calles y avenidas de la bella ciudad de Caracas. ¡Las calles son del pueblo, no de la oligarquía! Llegaron bendecidos con la lluvia a Miraflores. ¡Bienvenidos siempre! https://t.co/nWNC7moWuw","date":"Wed Jun 22 00:44:59 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Encuentro con el Movimiento de Pobladores y Pobladoras. https://t.co/nUf9E9tmrZ","date":"Tue Jun 21 22:00:20 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"“La guerra del pueblo”, es un libro que recoge las reflexiones de nuestro mártir, Fabricio Ojeda, sobre el papel del Pueblo en la lucha y las posibilidades de una revolución nacional. ¡Recomiendo leerlo! ==&gt; https://t.co/HQMUJDwfAc https://t.co/BDVaj05l1A","date":"Tue Jun 21 14:42:15 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Nos unimos al júbilo de los pueblos originarios en el Año Nuevo Aymara, una tradición ancestral que celebra la Salida del Nuevo Sol, que trae renovación, sabiduría y esperanza para consolidar un mundo nuevo de solidaridad y hermandad. https://t.co/yIIoDEWXDr","date":"Tue Jun 21 13:55:24 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Destacamos la valentía de los hombres y mujeres que han estado al frente de la lucha por la libertad y la dignidad de nuestro pueblo. El espíritu de Fabricio Ojeda sigue vigente en quienes enfrentamos al imperialismo y defendemos la soberanía de la Patria. https://t.co/IODh5N72zK","date":"Tue Jun 21 13:01:02 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Hoy martes #21Jun, tendré un encuentro muy especial con el Movimiento de Pobladores y Pobladoras. Mujeres y hombres que construyen el vivir viviendo desde cada comunidad y en las bases populares del país. ¡Pendientes! ¡Todo el Poder para el Pueblo!","date":"Tue Jun 21 12:02:15 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Después de la agenda de trabajo por los países de Euroasia y África del Norte, puedo confirmar que estamos en una época de transición, hacia una nueva humanidad. Retomamos el concepto del diálogo de la diversidad de culturas, ideologías, liderazgos y modelos políticos. https://t.co/18lokCTF1t","date":"Tue Jun 21 03:15:45 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Ante los desafíos que hemos enfrentado los últimos años, nuestra gran arma ha sido promover una conciencia superior y el amor al Pueblo. Somos hijos e hijas de guerreros, llevamos la espada de las y los libertadores, siempre defenderemos la Paz de la humanidad. https://t.co/HTTsG6QKGL","date":"Tue Jun 21 03:09:26 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Un saludo al personal de Al Mayadeen, en especial al periodista Ghassan bin Jiddo, por este diálogo especial que tuvimos al finalizar mi viaje por Azerbaiyán. Ampliamos sobre los temas estratégicos que tocamos en la gira y el papel de Venezuela en el nuevo mundo que está naciendo https://t.co/kjQ9oq65Ap","date":"Tue Jun 21 03:06:45 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Entrevista con el destacado periodista Ghassan bin Jiddo, de la reconocida cadena televisiva panárabe Al Mayadeen. https://t.co/wJhmuuQd0X","date":"Tue Jun 21 01:31:11 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Decidí crear la Vicepresidencia de Ciencia, Tecnología, Educación y Salud, liderada por la ministra @Gabrielasjr. Venezuela debe ir en la vanguardia de la nueva época, avanzando en el conocimiento, la cultura y la formación de su Pueblo, aplicado al desarrollo integral del país. https://t.co/mRs6KP3SFe","date":"Tue Jun 21 01:01:34 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Igualmente el #9Jul, vamos a activar en su primera fase organizativa las Brigadas Comunitarias Militares para la Salud, para iniciar el #16Jul la reparación, equipamiento y recuperación del Sistema Barrio Adentro I y II en todo el territorio. ¡El 1x10 en Acción! https://t.co/pUJfRQk4PB","date":"Tue Jun 21 00:59:21 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"El sábado #25Jun, en todos los centros educativos del país, se conformarán las Brigadas Comunitarias Militares para la Educación. Con el favor de Dios, el #2Jul, iniciamos las reparaciones estructurales y el embellecimiento de todos los simoncitos, escuelas y liceos del país. https://t.co/C2hzBMOXPP","date":"Tue Jun 21 00:58:05 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Realizamos un balance central a nuestro pueblo de la gira internacional, necesaria y triunfante que dimos por 6 países amigos que se traduce en grandes logros para la Patria. Es impresionante la voluntad para convertir estas cooperaciones en resultados para el desarrollo. https://t.co/3HfqcwdW8P","date":"Tue Jun 21 00:56:26 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Reunión con el Consejo de Vicepresidentes Sectoriales de Gobierno. https://t.co/tsdtTykAjn","date":"Mon Jun 20 21:21:14 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Arraigados a nuestra lucha histórica antiimperialista y emancipadora de la Patria Grande, hemos logrado grandes alianzas, cooperaciones y acuerdos internacionales, que van a contribuir con el despegue de la economía venezolana. https://t.co/fuMKNQX98v","date":"Mon Jun 20 19:04:05 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Todos los ambulatorios de Barrio Adentro deben estar equipados y abiertos para atender la salud del pueblo venezolano. Con el 1x10 del Buen Gobierno, vamos a cumplir ese objetivo. Invito a las y los vecinos, a seguir haciendo sus denuncias, a través de la aplicación VenApp. https://t.co/7sn2inaq6T","date":"Mon Jun 20 14:24:20 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"A 11 años de la partida física de Clodosbaldo Russian, rendimos honores a un gran compañero, patriota y leal a los principios del Comandante Hugo Chávez. Siempre será recordado por su gran contribución y trabajo por la Patria y el Pueblo. https://t.co/eEF5alfHJE","date":"Mon Jun 20 13:49:44 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"La juventud siempre ha tenido un rol importante en la Revolución. Nosotros confiamos en los jóvenes como el principal motor en la construcción del futuro próspero de Venezuela. Agradezco a la Gran Misión Chamba Juvenil, por estar en la vanguardia. ¡Máximo Apoyo! https://t.co/LCxlCLPAXZ","date":"Mon Jun 20 13:04:26 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Iniciamos la semana con la fuerza libertaria de Carabobo para concretar grandes proyectos. Tenemos el apoyo del Pueblo, la voluntad de la Juventud, de la clase obrera, y lo más importante, la bendición de Dios para lograrlo. ¡Venceremos!","date":"Mon Jun 20 12:02:04 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Felicito a Gustavo Petro y a Francia Márquez, por la histórica victoria en las elecciones Presidenciales en Colombia. Se escuchó la voluntad del pueblo colombiano, que salió a defender el camino de la democracia y la Paz. Nuevos tiempos se avizoran para este hermano país. https://t.co/FxodCn9Uqx","date":"Sun Jun 19 23:04:32 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Arribamos a la Patria, seguros de haber logrado grandes acuerdos para el bienestar del pueblo. Somos vanguardia en la construcción de la nueva humanidad que está surgiendo. Venezuela se abre al mundo pluripolar y multicéntrico que soñó nuestro Comandante Hugo Chávez. https://t.co/sKtY6T2nps","date":"Sun Jun 19 16:28:18 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"¡Feliz Domingo Venezuela! He estudiado a profundidad el informe final de los temas que tocamos durante nuestra gira por euroasia y norte de África, y los acuerdos que surgieron de ellos. Esta semana daré detalles de los grandes logros alcanzados.","date":"Sun Jun 19 15:33:55 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Nos unimos al júbilo del pueblo uruguayo, que hoy celebra el natalicio de José Gervasio Artigas, quien cumplió un papel determinante en la Independencia de Uruguay. ¡Viva el Protector de los Pueblos Libres! https://t.co/yeVlJkVmWE","date":"Sun Jun 19 14:43:48 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Hoy se cumple un año más de la beatificación del \"Médico de los Pobres\", el Dr. José Gregorio Hernández. Un reconocimiento a la labor humanista que desempeñó el enviado celestial en nuestra Patria. ¡Protégenos! https://t.co/OSfmBM5fhv","date":"Sun Jun 19 13:31:05 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Un padre es quien cuida, protege y guía. Su presencia es vital en la familia. A todos los que asumen el rol de ser padres, todo mi aprecio y mi cariño. Sigamos fomentando valores de respeto, humanidad y solidaridad en nuestros hijos. ¡Felicidades! https://t.co/4vcrFRAJtC","date":"Sun Jun 19 12:17:16 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"En los próximos días estaremos recibiendo a empresarios de los 6 países que visitamos, para firmar acuerdos específicos de inversión en áreas estratégicas y productivas. Son proyectos innovadores que permitirán consolidar el camino de la economía diversificada. https://t.co/1xQ8bsGCbW","date":"Sat Jun 18 19:02:39 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"En el mundo hay alegría por la visión que tienen de la resistencia de nuestro Pueblo. Recibí ese cariño, convertido en palabra de aliento. ¡No estamos solos! Tenemos quien nos acompañe en el esfuerzo de salir adelante, en el camino por la recuperación económica paulatina. https://t.co/YelHCUybpZ","date":"Sat Jun 18 18:51:00 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Estamos felices de decirle a nuestro Pueblo: ¡Misión Cumplida! Luego de 11 días de una Agenda de Trabajo Internacional, intensa y necesaria, llegamos a nuestra Patria cargados de buenas noticias. Agradezco a las y los venezolanos por el apoyo que me brindan siempre. https://t.co/YV7qmce4ud","date":"Sat Jun 18 18:46:58 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Recibimiento en la República Bolivariana de Venezuela luego de cumplida la Agenda de Trabajo Internacional. ¡Éxito Total! https://t.co/R9G1BVCnr1","date":"Sat Jun 18 14:00:41 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"En nuestro paso por el sexto país en la Agenda de Trabajo Internacional, reivindicamos la lucha histórica del pueblo de Azerbaiyán y afianzamos las relaciones entre ambas naciones, con miras hacia la construcción de un nuevo mundo humanista y diverso. https://t.co/5Dc0AObO3x","date":"Sat Jun 18 11:47:31 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Tenemos un sistema educativo incluyente de la más alta calidad, que forma con altos valores humanistas a las y los médicos de nuestra Patria y de países hermanos. Un \"Ejército de Batas Blancas\" al servicio del pueblo que más lo necesita. ¡La Venezuela de Verdad! https://t.co/1ADD7XVDGr","date":"Sat Jun 18 11:35:19 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"En estos tiempos de cambios y de construcción del nuevo mundo pluripolar y multicéntrico, les invito a leer: “Geopolítica de la liberación, el siglo XXI de Chávez”, de Julio Escalona. Sin duda alguna, es el siglo de la autodeterminación de los pueblos. ==&gt; https://t.co/wwDDK1YLzt https://t.co/dh0qMi2vuI","date":"Sat Jun 18 11:17:54 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"En reunión con el Presidente de Azerbaiyán, Iham Heydar Oglu Aliyev, le reiteré la importancia de elevar a otro nivel nuestras relaciones bilaterales. Igualmente, le reconocí todas las iniciativas y esfuerzos que está haciendo desde el MNOAL, cuentan con el apoyo de Venezuela. https://t.co/lHTMklnYCO","date":"Fri Jun 17 17:29:04 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Reunión Ampliada entre las delegaciones de la República de Azerbaiyán y la República Bolivariana de Venezuela. https://t.co/t3rHMguSCL","date":"Fri Jun 17 15:45:47 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Como muestra de respeto con el pueblo de Azerbaiyán, visité el Monumento de los Mártires, donde hice homenaje en memoria de los hombres que entregaron su vida por la independencia de este país. Una historia que nos llena de su fuerza. https://t.co/sTK0UcnO3O","date":"Fri Jun 17 15:02:17 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Con una ofrenda floral, vine a rendir honores al Líder Heydar Alíyev, en su Mausoleo. Venezuela admira y respeta su lucha histórica, inmortalizada en el pueblo de la República de Azerbaiyán. ¡Es un gran honor! https://t.co/emjXgzN505","date":"Fri Jun 17 14:58:10 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Reunión con el Presidente de la República de Azerbaiyán, Iham Heydar Oglu Aliyev. https://t.co/jGEYAISAeh","date":"Fri Jun 17 14:47:19 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Visita al Monumento de los Mártires de la República de Azerbaiyán. https://t.co/H41nGpEt9H","date":"Fri Jun 17 12:43:18 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Es innegable el compromiso que tienen las naciones amigas por colocar en el centro de sus esfuerzos, el beneficio mutuo, las relaciones entre Qatar y Venezuela son una muestra de ello. Es el camino de cooperación y diálogo entre iguales. https://t.co/3Ofszktl3I","date":"Fri Jun 17 11:45:52 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Recordamos con gran admiración y respeto, al poeta, político y escritor, Rufino Blanco Fombona, quien marcó las letras latinoamericanas con sus obras y poesías. ¡Hoy exaltamos a este insigne venezolano! https://t.co/K2s80C6IIv","date":"Fri Jun 17 11:27:11 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Al calor de las luchas por la igualdad y la justicia en Sudáfrica, surgieron movimientos de resistencia como el del gran líder Nelson Mandela, a quien recordamos hoy por su contribución con el fin del Apartheid. ¡Un gran triunfo popular! https://t.co/VtZqdTVZ3P","date":"Fri Jun 17 11:25:33 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Se cumplen 9 años de mi visita al Papa Francisco en El Vaticano, un momento grato que guardo en mi corazón. Un encuentro que me permitió afianzar mi fe en Dios y renovar la esperanza de un futuro mejor para Venezuela. https://t.co/PY70gsIBO5","date":"Fri Jun 17 11:13:32 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"La Revolución Bolivariana promueve los valores de respeto por la Pachamama. Este #17Jun, Día Mundial de Lucha contra la Desertificación y la Sequía, hago un llamado a la concientización sobre este flagelo que afecta a la humanidad. https://t.co/QV4hHt2ncq","date":"Fri Jun 17 11:09:53 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"Exitosa y victoriosa ruta por los hermanos países euroasiáticos y de África. Reuniones con presidentes, empresarios, una intensa agenda de trabajo para llevar inversiones, conocimiento, tecnología, y para diversificar la economía venezolana. ¡Es el Camino!","date":"Fri Jun 17 11:06:12 +0000 2022","user_id":"1252764865"},{"handle":"NicolasMaduro","text":"#EnVivo 📹 | Visita al Monumento del Líder Heydar Aliyev. https://t.co/uokpprG7PV","date":"Fri Jun 17 10:49:27 +0000 2022","user_id":"1252764865"}]