[{"handle":"Pontifex_es","text":"Estamos llamados a servir al Evangelio y a los hermanos, a ofrecer nuestra propia vida desinteresadamente, sin buscar ninguna gloria mundana.","date":"Mon Jun 27 11:30:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Queridas familias, sean signo del Cristo viviente, no tengan miedo de lo que el Señor les pide ni de ser generosas con Él. Sean la semilla de un mundo más fraterno, el rostro acogedor de la Iglesia. Y, por favor, recen, ¡recen siempre! #WMOF22","date":"Sun Jun 26 13:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"En #Ucrania continúan los bombardeos que producen muertos, destrucción  y sufrimientos a la población. Por favor, no olvidemos este pueblo afligido por la guerra. No lo olvidemos en el corazón y en nuestras oraciones.","date":"Sun Jun 26 12:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Estoy cerca del pueblo de #Ecuador, y animo a todas las partes a abandonar la violencia y las posiciones extremas. Solo con el diálogo se podrá encontrar -espero pronto- la paz social.","date":"Sun Jun 26 12:20:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Pidamos a Jesús la fuerza de ser como Él, de seguirlo con firme decisión; de no ser vengativos e intolerantes cuando surgen dificultades, cuando nos esforzamos por hacer el bien y los demás no lo comprenden. #EvangeliodeHoy (Lc 9,51-62)","date":"Sun Jun 26 12:13:46 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La #familia es el lugar del encuentro, del compartir, del salir de uno mismo para acoger a los demás y estar junto a ellos. Es el primer lugar donde se aprende a amar. #WMOF22\nhttps://t.co/Nhf2RiZvfQ","date":"Sat Jun 25 18:00:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Confiemos al #CorazónInmaculado de María, en el que Dios se refleja, los bienes preciosos de la fraternidad y de la paz, todo lo que tenemos y lo que somos, para que sea ella, la Madre que nos ha dado el Señor, la que nos proteja y nos cuide.","date":"Sat Jun 25 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Queridos sacerdotes, sean pacientes con los fieles, estén siempre dispuestos a animarlos, sean ministros incansables del perdón y de la misericordia de Dios, nunca jueces severos, siempre padres amorosos.","date":"Fri Jun 24 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Hace falta una misericordia infinita, como la del #SagradoCorazón de Cristo, para remediar tanto mal y tanto sufrimiento como vemos que hay en la vida de los seres humanos. ¡Encomendémonos a Él y encomendémosle el mundo!","date":"Fri Jun 24 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Mientras el fragor de las armas aumenta, los alimentos disminuyen. Por eso, no dejemos de rezar, de ayunar, de socorrer, de trabajar para que los senderos de la #paz encuentren espacio en la jungla de los conflictos.","date":"Thu Jun 23 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Tenemos que vivir con la mirada puesta en el cielo, como les decían los beatos María y Luis Beltrame Quattrocchi a sus hijos, afrontando las fatigas y las alegrías de la vida “mirando siempre por encima del techo”. #WMOF22","date":"Wed Jun 22 18:10:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Las familias son lugares de acogida y ¡qué problema sería si faltaran! Una sociedad sin familias acogedoras se volvería fría e invivible. #WMOF22","date":"Wed Jun 22 18:05:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Cuando un hombre y una mujer se enamoran, Dios les ofrece un regalo: el matrimonio. Un don maravilloso, que tiene en sí mismo el poder del amor divino: fuerte, duradero, fiel, capaz de recuperarse después de cada fracaso o fragilidad. #WMOF22","date":"Wed Jun 22 18:00:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Expreso mi dolor y consternación por el asesinato en #México, anteayer, de dos religiosos jesuitas y de un laico. ¡Cuántos asesinatos en México! La violencia no resuelve los problemas, sino que solo aumenta los sufrimientos innecesarios.","date":"Wed Jun 22 14:00:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Expreso mi cercanía a los heridos y a los afectados por el terremoto en #Afganistán, y rezo especialmente por quienes han perdido la vida y por sus familias. Espero que con la ayuda de todos se puedan aliviar los sufrimientos de la población.","date":"Wed Jun 22 13:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Miremos a los jóvenes siempre con una sonrisa: ellos llevarán adelante lo que hemos sembrado. Un anciano no puede ser feliz sin mirar a los jóvenes, y los jóvenes no pueden avanzar en la vida sin mirar a los ancianos.","date":"Wed Jun 22 12:00:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Con la enfermedad, con la vejez, la dependencia crece y ya no somos autosuficientes como antes. Pero también ahí madura la fe, también ahí está Jesús con nosotros, también de ahí brota esa riqueza de la fe bien vivida durante el camino de la vida. #BendicióndelTiempo","date":"Wed Jun 22 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Mañana comenzará el X Encuentro Mundial de las Familias, que tendrá lugar en Roma y, al mismo tiempo, en otros lugares del mundo. Doy las gracias a los esposos y a las familias que darán testimonio del amor familiar como vocación y camino de santidad. ¡Feliz Encuentro!","date":"Tue Jun 21 12:30:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Necesitamos soñar, también como Iglesia, ¡necesitamos el entusiasmo y el ardor de los jóvenes para ser testigos de Dios, que es siempre joven!","date":"Tue Jun 21 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Si queremos cooperar con nuestro Padre celestial en la construcción del futuro, hagámoslo junto con nuestros hermanos y hermanas #migrantes y #refugiados. ¡Construyámoslo hoy! Porque el futuro empieza hoy, y empieza por cada uno de nosotros. #WorldRefugeeDay","date":"Mon Jun 20 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Y no olvidemos al atormentado pueblo ucraniano. Me gustaría que quedara una pregunta en todos vosotros: ¿qué estoy haciendo hoy por el pueblo ucraniano? ¿Rezo? ¿Estoy haciendo algo? ¿Intento entender? Cada uno responda en su propio corazón.","date":"Sun Jun 19 13:00:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Me uno al llamamiento de los Obispos de #Myanmar, para que la Comunidad internacional no se olvide de la población birmana, para que la dignidad humana y el derecho a la vida sean respetados, como también los lugares de culto, los hospitales y las escuelas.","date":"Sun Jun 19 12:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"En el Cuerpo y en la Sangre de Cristo encontramos su presencia, su vida donada por cada uno de nosotros. No nos da solo la ayuda para ir adelante, sino que se da a sí mismo: entra en nuestras historias, visita nuestras soledades, dando de nuevo sentido y entusiasmo #CorpusChristi","date":"Sun Jun 19 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Dios se hace pequeño como un pedazo de pan y justamente por eso es necesario un corazón grande para poder reconocerlo, adorarlo, acogerlo.","date":"Sat Jun 18 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Jesús conoce nuestras fortalezas y nuestras debilidades, y está siempre preparado para cuidar de nosotros, para sanar las llagas de nuestros errores con la abundancia de su gracia.","date":"Fri Jun 17 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Jesús habla en silencio en el Misterio de la Eucaristía, y cada vez nos recuerda que seguirle quiere decir salir de nosotros mismos y hacer de nuestra vida no una posesión nuestra, sino un don a Él y a los demás.","date":"Thu Jun 16 11:30:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"No olvidemos al pueblo martirizado de Ucrania en guerra. No nos acostumbremos a vivir como si la guerra fuera algo lejano. #OremosJuntos por este pueblo que sufre tanto y que está padeciendo un verdadero martirio.","date":"Wed Jun 15 13:00:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Los ancianos que conservan la disposición para la sanación, el consuelo y la intercesión por sus hermanos y hermanas son quizá el testimonio más alto de la gratitud que acompaña la fe. #BendicióndelTiempo","date":"Wed Jun 15 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"¡Cuántos pobres genera la insensatez de la guerra! Dondequiera que se mire, se constata cómo la violencia afecta a los indefensos y a los más débiles. #DíaMundialdelosPobres https://t.co/l86snKDZkU","date":"Tue Jun 14 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Jesús resumió sus mandamientos en uno solo: «Amaos los unos a los otros como yo os he amado» (Jn 15,12).  Amar como ama Cristo significa ponerse al servicio de los hermanos, especialmente de quienes tienen más necesidad, con lo que somos y lo que tenemos.","date":"Mon Jun 13 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"El pensamiento por la población ucraniana afligida por la guerra está siempre vivo en mi corazón. Que el paso del tiempo no enfríe nuestro dolor y nuestra preocupación por esta gente martirizada. ¡Por favor, no nos acostumbremos a esta trágica realidad! #OremosJuntos","date":"Sun Jun 12 13:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Hoy se celebra el Día Mundial contra el Trabajo Infantil. Trabajemos todos para eliminar esta plaga, para que ningún niño o niña sea privado de sus derechos fundamentales y obligado a trabajar. #EndChildLabour","date":"Sun Jun 12 12:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Amar quiere decir no solo apreciar y hacer el bien, sino antes incluso, en la raíz, acoger a los otros, hacer sitio a los otros, dejar espacio a los otros.","date":"Sun Jun 12 11:00:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La #SantísimaTrinidad nos enseña que no se puede estar nunca sin el otro. No somos islas, estamos en el mundo para vivir a imagen de Dios: abiertos, necesitados de los demás y necesitados de ayudar a los demás.","date":"Sun Jun 12 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Si en verdad podemos invocar a Dios llamándolo “Abbá”, es decir, “Papá” es porque el Espíritu Santo habita en nosotros; Él es quien nos transforma profundamente y nos hace experimentar la alegría conmovedora de sabernos amados por Dios como verdaderos hijos.","date":"Sat Jun 11 12:00:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"El acceso equitativo a vacunas seguras y eficaces es crucial para salvar vidas y medios de subsistencia. África no debe quedarse atrás. Nadie estará a salvo hasta que todos estén a salvo. @WTO #MC12","date":"Fri Jun 10 13:05:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Me uno a los Comités Panamericano y Panafricano de Juezas y Jueces por los Derechos Sociales para exhortar a la @WTO a que adopte medidas que aseguren a todos, especialmente a las poblaciones de África, el acceso a las vacunas contra el Covid-19. #MC12","date":"Fri Jun 10 13:00:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Que la #LargaNochedelasIglesias, que se celebra en numerosos lugares de culto de algunos países europeos, sea un momento de encuentro y encienda en la oscuridad de la noche muchas luces de esperanza.","date":"Fri Jun 10 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"El Espíritu Santo nos hace capaces de percibir la presencia de Dios y su obra no en las grandes cosas, en las apariencias llamativas, en las demostraciones de fuerza, sino en la pequeñez y en la fragilidad.","date":"Thu Jun 09 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Quienes atraviesan la etapa de la ancianidad pueden descubrir, a la luz del Evangelio, una nueva misión: ser signos e instrumentos del amor de Dios que señalan cuál es la meta definitiva a la que estamos llamados: la vida eterna con Dios. #BendicióndelTiempo","date":"Wed Jun 08 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Os animo a invocar a menudo durante el día al Espíritu Santo: su fuerza buena y creativa nos permite salir de nosotros mismos para ser un signo de consuelo y esperanza para los demás.","date":"Tue Jun 07 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"María es la Madre que nos da a su Hijo Jesús. María es el camino que nos introduce en el corazón de Cristo, que dio la vida por amor a nosotros. Por eso la amamos y la veneramos. #MadredelaIglesia","date":"Tue Jun 07 07:09:32 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"El Espíritu Santo, Espíritu del amor, infunde en nosotros el amor, nos hace sentirnos amados y nos enseña a amar. Él es el “motor” de nuestra vida espiritual. #Pentecostés\nhttps://t.co/zXlRTfzsnP","date":"Sun Jun 05 14:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"No habrá una ecología sana y sostenible, capaz de cambiar algo, si no cambian las personas, si no se las anima a optar por otro estilo de vida menos voraz, más sereno, más respetuoso, menos ansioso, más fraterno. #WorldEnvironmentDay","date":"Sun Jun 05 14:00:02 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Que se escuche el grito desesperado de la gente que sufre, que se respete la vida humana y se detenga la macabra destrucción de ciudades y pueblos en el este de Ucrania. #OremosJuntos y comprometámonos por la paz, sin cansarnos.","date":"Sun Jun 05 13:35:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Y mientras la furia de la destrucción y la muerte se desata y el conflicto se recrudece, alimentando una escalada cada vez más peligrosa para todos, renuevo mi llamamiento a los líderes de las naciones: ¡Por favor, no lleven a la humanidad a la ruina!","date":"Sun Jun 05 13:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"#Paz https://t.co/NGzEEd05Z3","date":"Sun Jun 05 13:00:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Invoquemos cada día al Espíritu Santo, para que nos recuerde partir siempre de la mirada de Dios sobre nosotros, para movernos en nuestras opciones escuchando su voz, para caminar juntos, como Iglesia, dóciles a Él y abiertos al mundo. #Pentecostés","date":"Sun Jun 05 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"El Espíritu Santo enseña a la Iglesia a caminar, la necesidad vital de salir, de anunciar, de no quedarse encerrada en sí misma para que todos puedan nutrirse de la belleza de Dios. #Pentecostés","date":"Sun Jun 05 11:00:02 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"El Espíritu Santo nos hace ver todo de una manera nueva, según la mirada de Jesús. En el gran viaje de la vida, Él nos enseña dónde comenzar, qué caminos tomar y cómo caminar. #Pentecostés","date":"Sun Jun 05 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"#OremosJuntos por los niños que se quedaron huérfanos y huyen de la guerra; por los que sufren en todo el mundo a causa del hambre, la falta de atención médica, los abusos y la violencia; por aquellos a los que se les ha negado el derecho a nacer. ¡Protejamos a todos los niños!","date":"Sat Jun 04 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La cultura del encuentro se construye buscando la armonía entre las diversidades; esto requiere acogida, apertura y creatividad. En la raíz de este estilo de vida está el Evangelio. ¡No nos cansemos de invocar al Espíritu Santo, Creador de la armonía!","date":"Sat Jun 04 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Le pedimos al Señor muchas cosas, pero con frecuencia olvidamos pedirle lo más importante, lo que Él desea darnos: el Espíritu Santo, la fuerza para amar. Sin amor, en efecto, ¿qué podemos ofrecer al mundo?","date":"Fri Jun 03 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"#OremosJuntos por las familias cristianas de todo el mundo, por todas y cada una de las familias, para que, con gestos concretos, vivan la gratuidad del amor y la santidad en la vida cotidiana. #IntencióndeOración https://t.co/ZuG7G1DUtb","date":"Thu Jun 02 13:58:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"El bloqueo de la exportación de trigo desde Ucrania pone en peligro la vida de millones de personas. Dirijo un apremiante llamamiento para que se garantice el derecho humano universal a la alimentación. ¡Por favor, que no se use el trigo, alimento básico, como arma de guerra!","date":"Wed Jun 01 14:00:02 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"En todo proceso educativo debemos poner siempre en el centro a las personas y dirigirnos a lo esencial. Todo lo demás es secundario, pero no dejemos nunca de lado nuestras raíces y la esperanza del futuro. #GlobalCompactOnEducation","date":"Wed Jun 01 12:40:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Los ancianos, a causa de su debilidad, pueden enseñar a quienes viven otras edades de la vida que todos necesitamos abandonarnos al Señor, invocar su ayuda. Porque Dios es siempre nuestra esperanza y nuestro apoyo. #BendicióndelTiempo","date":"Wed Jun 01 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Estamos seguros de que, con las armas de la oración, el ayuno y la limosna, y con el don de la gracia, es posible cambiar los corazones de los hombres y el futuro del mundo entero. #SantoRosario #Paz","date":"Tue May 31 17:40:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Hoy elevamos a ti nuestros corazones, Reina de la Paz: intercede por nosotros ante tu Hijo, reconcilia los corazones llenos de violencia y de venganza, que reine tu paz duradera sobre toda la tierra. #SantoRosario #Paz","date":"Tue May 31 17:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Hoy, a las 18:00, en la basílica de Santa María la Mayor, rezaremos el Rosario por la #paz. #OremosJuntos para pedir a Dios, por intercesión de la Reina de la Paz, este don que el mundo espera. #SantoRosario https://t.co/EW3P28pjYo https://t.co/8kK9FtiTC2","date":"Tue May 31 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La fe de María es una fe profética. Con su vida, María es profecía de la obra de Dios en la historia, de su obrar misericordioso que da la vuelta a la lógica del mundo elevando a los humildes y derribando a los soberbios (Lc 1,52). #VisitacióndeMaría","date":"Tue May 31 09:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La diversidad de religión no justifica la indiferencia o la enemistad. Es más, a partir de la fe religiosa, uno puede convertirse en artesano de la #paz y no permanecer como espectador inerte del mal de la guerra y del odio.","date":"Mon May 30 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Escuchar es el primer e indispensable ingrediente del diálogo y de la buena #comunicación. No se comunica si antes no se ha escuchado, y no se hace buen periodismo sin la capacidad de escuchar. #JMCS\nhttps://t.co/x3svt6ryX5","date":"Sun May 29 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Al subir al cielo Jesús, en lugar de permanecer cerca de unos pocos con su cuerpo, se hace cercano a todos con su Espíritu. El Espíritu Santo hace presente a Jesús en nosotros, más allá de las barreras del tiempo y del espacio, para que seamos sus testigos en el mundo. #Ascensión","date":"Sun May 29 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"#OremosJuntos hoy por nuestras comunidades religiosas, para que, de modo profético, se pongan al servicio del cuidado de nuestra casa común y de los últimos. #SemanaLaudatoSi #LaudatoSi7","date":"Sat May 28 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La riqueza verdadera no consiste en multiplicar cuanto se posee, sino en compartirlo equitativamente con quien tenemos a nuestro alrededor.","date":"Fri May 27 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"#OremosJuntos para que las instituciones educativas, en particular las escuelas y las universidades, sean comunidades vivas, activas, acogedoras, respondables; creen un clima fructífero de cooperación, intercambio y diálogo; y valoricen a todos y a cada uno. #LaudatoSi7","date":"Thu May 26 11:30:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"En Cristo, verdadero Dios y verdadero hombre, nuestra humanidad ha sido llevada junto a Dios; Él nos abrió el camino y nos atrae hacia sí conduciéndonos a Dios. Si le confiamos nuestra vida, estamos seguros de hallarnos en manos de nuestro Salvador. #AscensióndelSeñor","date":"Thu May 26 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Los #ancianos llenos de sapiencia y buen humor hacen mucho bien a los jóvenes. Los salvan de un conocimiento del mundo triste y sin sabiduría sobre la vida. #BendicióndelTiempo  @LaityFamilyLife @PontAcadLife","date":"Wed May 25 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Tenemos que regenerar la economía de forma que sea más justa, sostenible, solidaria y respetuosa de la Tierra, nuestra casa común. Con la mirada fija en Jesús, podemos caminar juntos hacia un futuro mejor. #LaudatoSi7 #SemanaLaudatoSi","date":"Tue May 24 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"María, Auxilio de los Cristianos, te confiamos el camino de los creyentes en #China. Te rogamos que presentes al Señor de la historia las tribulaciones y las fatigas, las súplicas y las esperanzas de los fieles que te invocan, ¡oh Reina del cielo! #OremosJuntos #MaríaAuxiliadora","date":"Tue May 24 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Quien acoge a un necesitado no solo hace un acto de #caridad, sino también de #fe, porque reconoce a Jesús en el hermano y en la hermana.","date":"Mon May 23 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Les doy mi paz (Jn 14,27). Jesús sabe que nosotros solos no somos capaces de custodiar la paz, que necesitamos una ayuda, un don, el Espíritu Santo. Es Él quien desarma el corazón y lo llena de serenidad. #EvangelioDeHoy","date":"Sun May 22 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"#SemanaLaudatoSi #LaudatoSi7 https://t.co/LQ2MhpTyvw","date":"Sun May 22 09:00:02 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"María es icono de nuestra vocación. Como Ella, estamos llamados a ser santos e irreprochables por el amor (Ef 1,4), haciéndonos imagen de Cristo.","date":"Sat May 21 11:30:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Necesitamos un cambio profundo, una conversión que desmilitarice los corazones y permita que cada uno reconozca en el otro a un hermano. #Paz #FratelliTutti","date":"Fri May 20 11:30:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La Iglesia está siempre agradecida por toda expresión de caridad fraterna y de atención mostrada a quienes han sido esclavizados y explotados, porque de este modo la misericordia de Dios se hace visible y el tejido de la sociedad se refuerza y se renueva.","date":"Thu May 19 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"A la hora de afrontar el mal, hemos de aprender -del ejemplo de muchos ancianos- a unir nuestra oración a la de Jesús, que en la cruz se abandona al Padre. #BendicióndelTiempo @LaityFamilyLife @PontAcadLife \nhttps://t.co/No6H89hQEq","date":"Wed May 18 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Como Iglesia, necesitamos volver a lo esencial, no perdernos en muchas cosas secundarias con el riesgo de perder de vista la pureza simple del Evangelio.","date":"Wed May 18 09:35:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Dejemos que Jesús, Pan vivo, sane nuestras cerrazones y nos abra al compartir, nos cure de nuestras rigideces y del encerrarnos en nosotros mismos, y nos inspire a seguirlo adonde Él quiere conducirnos.","date":"Tue May 17 11:30:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La bienaventuranza, la santidad, no es un programa de vida hecho solo de esfuerzos y renuncias, sino que es ante todo el gozoso descubrimiento de ser hijos amados de Dios.","date":"Mon May 16 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Mientras en el mundo aumentan las tensiones y las guerras, que los nuevos santos inspiren caminos de diálogo, especialmente en los corazones y las mentes de quienes ocupan puestos de gran responsabilidad y están llamados a ser protagonistas de #paz y no de guerra.","date":"Sun May 15 12:00:01 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La #santidad no está hecha de algunos actos heroicos, sino de mucho amor cotidiano. https://t.co/lctyNj9ZqX","date":"Sun May 15 11:15:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Todos estamos llamados a la #santidad, a una santidad única e irrepetible. El Señor tiene un proyecto de amor para cada uno, tiene un sueño para tu vida. Acógelo. Y llévalo adelante con alegría. https://t.co/lctyNj9ZqX","date":"Sun May 15 10:45:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"¡Apoyemos a la #familia! Defendámosla de todo lo que comprometa su belleza. Acerquémonos a este misterio de amor con discreción y ternura. Y comprometámonos a salvaguardar sus  preciosos y delicados vínculos, que permiten vivir bien y hacen la humanidad más fraterna.","date":"Sun May 15 08:22:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Las lágrimas de quienes sufren no son estériles. Son una oración silenciosa que se eleva hasta el Cielo y que encuentra siempre sitio bajo el manto de María. Con ella, Dios se hace compañero de camino, lleva con nosotros las cruces para que nuestros dolores no nos aplasten.","date":"Sat May 14 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"#VirgendeFátima https://t.co/hgsUwURT1l","date":"Fri May 13 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"#ConstruirelFuturoJuntos #JMMR2022 @M_RSeccion https://t.co/RURRv7LOvM","date":"Thu May 12 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Podremos tener un futuro mejor solamente si lo construimos entre todos y para todos. ¡Nadie debe ser excluido! A este tema he dedicado el Mensaje para la 108ª Jornada Mundial del Migrante y del Refugiado. #ConstruirelFuturoJuntos #JMMR2022 @M_RSeccion https://t.co/lYpjyz1WW8","date":"Thu May 12 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Una larga vida es una bendición -así lo enseña la Escritura-. #AbuelosyMayores son signos de la benevolencia de Dios, que da la vida en abundancia. ¡Bendita la casa que custodia un anciano! ¡Bendita la familia que honra a sus abuelos! #BendicióndelTiempo","date":"Wed May 11 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Una parte de la vocación de los abuelos es sostener a los hijos en la educación de los niños. Los pequeños aprenden la fuerza de la ternura y el respeto a la fragilidad: lecciones insustituibles que con los abuelos son más fáciles de impartir y de recibir. #BendicióndelTiempo","date":"Wed May 11 11:00:03 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Al hacernos viejos perdemos vista, pero la mirada interior se hace más penetrante, atenta y humana. Vemos cosas que antes se nos escapaban. Es así: el Señor no confía sus talentos solo a los jóvenes y a los fuertes; tiene para todos, a la medida de cada uno. #BendicióndelTiempo","date":"Wed May 11 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Queridos #AbuelosyMayores, en este mundo nuestro estamos llamados a ser artífices de la revolución de la ternura, para liberar juntos al mundo de la sombra de la soledad y del demonio de la guerra.\nhttps://t.co/BIQ0TjHsak","date":"Tue May 10 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"No debemos temer las crisis de la vida y de la fe: las crisis reavivan nuestra necesidad de Dios y nos permiten así regresar al Señor, volver a experimentar su amor.","date":"Mon May 09 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Frente a la locura de la guerra, seguimos, por favor, rezando cada día el Rosario por la paz. Y rezamos por los responsables de las Naciones, para que no pierdan “el olfato de la gente”, que quiere la paz y sabe bien que las armas no la traen, nunca.","date":"Sun May 08 14:00:03 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Hoy, en muchos países, se celebra el Día de la Madre. Recordemos con afecto a nuestras madres, también a las que no están ya con nosotros aquí, pero viven en nuestros corazones. Para todas las madres es nuestra oración, nuestro afecto, nuestra felicitación.","date":"Sun May 08 12:02:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Quien sigue a Cristo va donde está Él, en el mismo camino. Va a buscar a quien está perdido, se interesa por quien está lejos, se toma en serio las situaciones de quien sufre, sabe llorar con quien llora, tiende la mano al prójimo, se lo carga sobre los hombros. #EvangelioDeHoy","date":"Sun May 08 10:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"¡Recurramos a menudo a María, Madre de los creyentes! Las diversas formas de devoción mariana, especialmente el rezo del #SantoRosario, nos ayudarán a vivir nuestro camino de fe y de testimonio cristiano. #OremosJuntos","date":"Sat May 07 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"Como cristianos, somos llamados personalmente a una #vocación, y también con-vocados: brillamos, cada uno, como una estrella en el corazón de Dios, pero estamos llamados a formar juntos constelaciones que orienten el camino de la humanidad.","date":"Fri May 06 11:30:00 +0000 2022","user_id":"525264466"},{"handle":"Pontifex_es","text":"La Palabra de Dios, que nos libera del egocentrismo, es capaz de purificarnos, iluminarnos y recrearnos. Pongámonos entonces a la escucha de la Palabra, para abrirnos a la vocación que Dios nos confía. #Oración #Vocaciones","date":"Fri May 06 11:25:00 +0000 2022","user_id":"525264466"}]