[{"handle":"QueenRania","text":"Thank you for your condolences on the passing of my dear father. There is no remedy for this kind of grief, but as my family and I mourn his loss, we have found such comfort in the kind words and prayers you have sent.\n\nRest In Peace, father. You will be in our hearts forever.","date":"Mon May 30 17:01:41 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"شكراً من القلب لكل من قدم لنا التعزية في وفاة والدي الدكتور فيصل الياسين.. ترك الفقيد حزناً كبيراً في نفوسنا.. لكن وجدت أنا وعائلتي الكثير من السلوان في رسائلكم ودعواتكم. ممتنة لعائلتنا الكبيرة وأصدقائنا داخل الأردن وخارجه ولا أراكم الله مكروهاً في عزيز\n\nرحمك الله يا غالي..","date":"Mon May 30 17:00:42 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"اللهمّ في يوم الجمعة افتح أبواب السماءِ لروحِ أبي، وأبوابَ رحمتك وجنّتك، اللهمّ اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله، اللهم يمّن كتابهُ وهوّن حسابهُ وليّن ترابهُ وثبته عند سؤاله وألهمه حسن جوابه\n\nMy dear father, may you Rest In Peace https://t.co/Mk1Z8l6w36","date":"Fri May 27 16:19:14 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"Today we share the grief of the beloved people of the United Arab Emirates in mourning the great loss of their President His Highness Sheikh Khalifa bin Zayed Al Nahyan, who was renowned for his noble deeds and stances. May his soul rest in peace","date":"Fri May 13 12:57:37 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"نشاطر الأهل في دولة الإمارات الشقيقة أحزانهم بوفاة المغفور له بإذن الله تعالى فقيد الأمة سمو الشيخ خليفة بن زايد آل نهيان صاحب الأيادي البيضاء والمواقف المشرفة، رحمه الله تعالى وأسكنه فسيح جناته","date":"Fri May 13 12:56:45 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"Palestinian journalist Shireen Abu Aqla repeatedly put her life on the line to bring her people’s stories to light. Her killing is a crushing blow to truth and justice, but no bullet can kill a cause or crush a people’s spirit. May she rest in peace","date":"Wed May 11 13:42:48 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"خاطرت الصحفية شيرين أبو عاقلة بحياتها مراراً لنقل قصص الشعب الفلسطيني ومعاناته. قتلها هو اغتيال لمبادئ الحقيقة والعدالة، لكن لا يمكن للرصاص أن يقتل القضية وإيمان الناس بها.. رحمك الله وألهم عائلتك الصبر والسلوان #شيرين_ابو_عاقلة","date":"Wed May 11 13:35:19 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"لقاءاتنا وأحاديثنا على طاولة الإفطار ميزت رمضان هذا العام.. تقبل الله منا جميعاً وكل عام وأنتم ومن تحبون بألف خير\n#عيد_الفطر_المبارك\n\nOur heartwarming gatherings and engaging chats over Iftar have made this Ramadan a truly special one! May you all have a blessed Eid https://t.co/mTuOUpvyY0","date":"Sun May 01 18:27:06 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"https://t.co/Ne67iEryLG","date":"Fri Apr 29 13:19:22 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"https://t.co/kejPExBw1b","date":"Fri Apr 29 13:18:52 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"من مشاركتي في قمة مجلة فورين بوليسي الافتراضية حول المناخ\n\nFrom my participation in the Foreign Policy Virtual Climate Summit\n#FPClimateSummit2022 https://t.co/WKKxEcIMQd","date":"Fri Apr 29 13:17:45 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"اللّهم ارزقنا فضل ليلة القدر ونورها وبركتها، وأنعم علينا بطمأنينة النفوس يا أرحم الراحمين\n#ليلة_القدر","date":"Thu Apr 28 18:16:39 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"أجمل أيام السنة تهل علينا بالرحمة والبركة، رمضان كريم وكل عام وأنتم جميعاً بألف خير\n#رمضان_كريم\nThe year’s holiest month is upon us. May it usher in peace and blessings for all\n#RamadanMubarak","date":"Fri Apr 01 17:42:48 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"زرعت حب القراءة في الكثيرين ممن اعتادوا زيارتك في وسط البلد.. رحم الله حسن أبو علي وأسكنه فسيح جنانه https://t.co/I2pJu1sfb0","date":"Fri Mar 25 17:52:14 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"لمن تضيف المحبة على كل شيء.. لأمي ولكل الأمهات، كل عام وانتو منورين حياتنا\n#عيد_الام\nMay your lives be filled with the love that you have brought into ours… Happy #Mothersday to my mother and all mothers https://t.co/sby8EpgfYu","date":"Mon Mar 21 06:09:12 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"أفضل الصلاة والسلام على من تطيب القلوب بذكره.. أهنئكم جميعاً بذكرى #الإسراء_والمعراج لنبينا الكريم","date":"Mon Feb 28 07:37:02 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"الملكة رانيا تشارك عبر رسالة متلفزة مسجلة في جلسة عرض الابتكارات لجائزة ايرث شوت التي عقدت في #دبي #الامارات\n\nQueen Rania’s pre-recorded video message, aired at the first-ever @EarthshotPrize Innovation Showcase in \n#Dubai #UAE https://t.co/a5ISrMwpJL","date":"Thu Feb 10 13:09:30 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"للأردن ملك، قلبه وسْعُ الوطن.. وعليه قلب الوطن. كل عام وسيدنا بخير\n#عيد_الملك60 #ستون_ومعك_ماضون\n \nHe lives in our hearts, and we live in his. Happy birthday, Your Majesty\n@KingAbdullahII https://t.co/ljR3dtgvHA","date":"Sat Jan 29 16:27:02 +0000 2022","user_id":"36412963"},{"handle":"QueenRania","text":"أدام الله الفرح في قلوبكم وبيوتكم بمناسبة عيد الميلاد المجيد، وكل عام وعائلتنا الأردنية بخير ومحبة\n\nMerry Christmas to you all and may your homes and hearts be filled with love and joy\n#MerryChristmas https://t.co/CplWlPqXqt","date":"Fri Dec 24 16:18:11 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"عسى أن تزين خيوط السعادة والأمل والصحة عامكم\nMay the threads of happiness, hope and good health weave together your New Year https://t.co/E3Eb93HhbF","date":"Wed Dec 15 09:01:30 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"في ذكرى مولد الهادي نصلي ونسلم عليك يا خير خلق الله\n#المولد_النبوي_الشريف","date":"Mon Oct 18 17:30:08 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"Congratulations!","date":"Mon Oct 18 06:07:36 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"ألف مبروك للنشميات\nCongratulations to our team on winning the Arab Women’s Cup 2021","date":"Tue Sep 07 07:25:37 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"كل عام وأنتم بخير بمناسبة حلول السنة الهجرية الجديدة. ندعو الله أن يمن علينا وعليكم بالمغفرة والخير والبركة.","date":"Mon Aug 09 17:15:43 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"عيد أضحى مبارك لكم ولعائلاتكم، أعاده الله علينا جميعا بالخير والصحة والمحبة\n#عيد_الأضحى\n\nEid Adha Mubarak to you and yours. May this blessed holiday bring health, peace, and happiness to all https://t.co/9pdIdIAJpt","date":"Tue Jul 20 04:46:42 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"سعدت بلقاء السيدة الأولى الدكتورة جيل بايدن اليوم في البيت الأبيض.. حبها لعملها وإنسانيتها ملهمان\n\nIt was lovely joining U.S. First Lady Dr. Jill Biden at the White House today. Her enthusiasm, warmth, and compassion are a pleasure to behold https://t.co/3Ra7yycbE0","date":"Mon Jul 19 22:56:12 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"نناجيك يا أرحم الراحمين في أحب الليالي وأفضلها أن تنعم علينا بالأجر والسكينة والعافية #ليلة_القدر","date":"Sat May 08 19:18:01 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"حل شهر الرحمة والسكينة والخير، عسى الله أن ينعم علينا وعليكم باليمن والبركات والعافية. رمضان كريم\n#رمضان_مبارك \n\nRamadan Kareem. May the holy month bring blessings of peace, health, and happiness to all\n#RamadanMubarak https://t.co/CiiGrM6XfV","date":"Mon Apr 12 17:12:37 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"ما حدث لأهلنا في مستشفى السلط فاجعة... إهمال مؤلم ولا يمكن تبريره. رحم الله الأرواح التي فقدناها وألهم ذويهم الصبر والسلوان.","date":"Sat Mar 13 13:44:41 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"في ذكرى #الإسراء_والمعراج أدعو الله أن يزيل عنا البلاء والوباء ويديم علينا نعمه، وأفضل الصلاة والسلام على رسولنا الكريم","date":"Thu Mar 11 08:38:27 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"Participated via video conference in the Royal Health Awareness Society’s Board of Trustees meeting today for a discussion on last year’s health and awareness programs and future plans\n#Jordan #LoveJO https://t.co/Qblz87C1iO","date":"Tue Mar 02 14:02:57 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"شاركت عبر تقنية الاتصال المرئي اليوم باجتماع مجلس أمناء الجمعية الملكية للتوعية الصحية لمناقشة خطط الجمعية وما قامت به من برامج صحية وتوعوية العام الماضي \n#الأردن #حب_الأردن https://t.co/ac873DvZJg","date":"Tue Mar 02 14:02:26 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"دعائي في هذا اليوم أن يحمل لك كل عام نفس السلام الذي تسعى دائماً لنشره في العالم. كل عام وسيدنا بألف خير، والله يخليلي إياك يا أغلى الناس\n\nI hope that each year brings you the same peace you radiate to the world. Happy birthday, Your Majesty\n\n @KingAbdullahII https://t.co/qJeqeayL83","date":"Sat Jan 30 13:11:16 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"ما كنت أتخيل أن بإمكاني أن أحبكما أكثر، ثم أجد حبي لكما يزداد كل يوم. كل سنة وسيدنا وهاشم بخير\n\nIt seems impossible to love you two more, but every day proves me wrong... twice! Happy birthday Your Majesty and my Prince Hashem https://t.co/KVHKtAvimV","date":"Sat Jan 30 08:11:37 +0000 2021","user_id":"36412963"},{"handle":"QueenRania","text":"مع بداية العام الجديد نجدد أملنا بأيام أفضل تحمل لنا الخير والعافية. كل عام وأنتم جميعاً بألف خير\n \nWith every new beginning, hope is reborn. Wishing a Happy New Year to all","date":"Thu Dec 31 21:59:14 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"بمناسبة عيد الميلاد المجيد نتمنى لكم ولعائلاتكم كل المحبة والعافية\n\nWishing a merry and healthy Christmas to you and your loved ones\n\n#MerryChristmas https://t.co/3UXsRvyLc1","date":"Thu Dec 24 18:11:06 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"This year, even as we have kept our distance, we’ve all held our loved ones a little closer in our hearts. Sending prayers for health and happiness to all https://t.co/2quiU47LGy","date":"Wed Dec 09 07:41:30 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"نودع عاماً آخر حمل لنا ظروفاً غير عادية، وبالرغم من أننا ابتعدنا قليلاً عن عائلاتنا وأحبتنا، إلا أن محبتهم لدينا أكبر. مع نهاية هذه السنة نتمنى لكم ولجميع من في قلوبكم كل العافية والخير https://t.co/DKVHhBopTd","date":"Wed Dec 09 07:41:22 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"Our world is rich with devoted volunteers, eager to help those around them no matter how difficult circumstances may be. On International Volunteer Day, we salute all those making it their mission to serve as a force for good\n#InternationalVolunteerDay https://t.co/ms2bY11ifQ","date":"Sat Dec 05 08:01:21 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"مهما كانت الظروف التي يمر بها العالم، نجد دائما من يبادر لمساعدة من حوله بمحبة. في اليوم الدولي للمتطوعين نحييكم جميعا، فأنتم قوة لا يستهان بطيب أثرها\n#اليوم_الدولي_للمتطوعين https://t.co/AIX9ugGBX3","date":"Sat Dec 05 08:00:47 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"أنعم الله على وطننا بجيش أبيض لم يبخل على أبنائه بالجهد والرعاية... تركوا بيوتهم ليحموا منزلهم الاكبر ...وابتعدوا عن ابنائهم وبناتهم ليفرح كل ابن وابنة بشفاء اهلهم. رحمة الله على كل من فقدناهم من كوادرنا الطبية. تعبوا كثيرا فدعونا نلتزم من اجلهم.","date":"Sat Oct 31 18:58:44 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"Our medical workers put everything on the line to keep us safe, leaving their loved ones to care for ours. May all those who have lost their lives in the line of duty rest in peace. Let’s honor their sacrifice by adhering to safety measures.","date":"Sat Oct 31 18:54:01 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"En son temps, le Prophète Mahomet était l’objet de maintes attaques.\nHors cela ne le bouleversa guère.\nNulle insulte pourrai enfreindre son patrimoine de tolérance, de patience et de paix. Ces dogmes vivent aujourd’hui à travers ceux qui suivent son véritable exemple. https://t.co/gShZcBJDDd","date":"Thu Oct 29 07:07:21 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"In his lifetime, the Prophet Mohammad (PBUH) was subjected to endless harassment and mockery. Yet he never wavered. No insult could ever infringe upon his legacy of tolerance, patience, and peace, which lives on in all those who continue to follow his loving example https://t.co/bi4hNRCpy7","date":"Thu Oct 29 07:06:48 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"في حياته، تعرض نبينا محمد صلى الله عليه وسلم للأذى والاساءة. وفي كل مرة ثبّت الله قلبه. نغار عليك يا رسول الله ونعلم ان لا اساءة تستطيع المساس بك وبسيرتك الشريفة. وندعو الله ان يثبتنا على خطاك لنمضي على نهجك في التسامح والصبر والسلام الذي يعيش في قلوب محبيك\n#المولد_النبوي_الشريف https://t.co/P02e23ffdr","date":"Thu Oct 29 07:05:54 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"To those who teach compassion and integrity, and carry the dreams of our children and youth in their hands, to every teacher and educator, happy Teachers Day!","date":"Mon Oct 05 09:19:18 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"إلى حملة رسالة الأنبياء، إلى من يعلمون طلابهم الخير والمحبة، ويحملون أحلام أطفالنا وشبابنا بين أيديهم، إلى كل معلم ومعلمة، كل عام وأنتم بألف خير. #يوم_المعلم_العالمي","date":"Mon Oct 05 09:19:01 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"The Emir of Kuwait Sheikh Sabah Al-Ahmad Al-Jaber Al-Sabah was a great leader and a kind father to all Kuwaitis. My deepest condolences go out to his family and his nation. We all lost an icon of humanity today. My heart and my prayers are with you.","date":"Tue Sep 29 15:25:51 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"تغمد الله سمو الشيخ صباح الاحمد الجابر الصباح بواسع رحمته، القائد المحنك والأب الحاني لأبنائه الكويتيين. لعائلته ولاهلنا في الكويت مني أحر التعازي، لقد فقدنا واياكم رمزا من رموز الانسانية. قلبي معكم ودعائي لكم بالصبر","date":"Tue Sep 29 15:24:50 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"ما في أجمل من يوم بقضيه وأحبابي وعائلتي بجانبي. وشكراً من كل قلبي على المعايدات والمحبة اللي غمرتوني فيها اليوم، فرحتوني كتير\nNothing beats a day spent surrounded with the people you love most. And thank you all for your lovely birthday greetings - you made my day https://t.co/L9OhZKxUkp","date":"Mon Aug 31 21:16:32 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"أبارك للأمة الإسلامية بمناسبة ذكرى هجرة رسولنا الكريم عليه أفضل الصلاة والسلام #الهجرة_النبوية_الشريفة","date":"Thu Aug 20 07:05:26 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"The ‘way’ we celebrate Independence Day may change, but the ‘why’ remains constant; it’s the love we hold for our country and the commitment of its people to keep it safe and strong. God bless Jordan, its people and its leadership!\n#Independence74","date":"Mon May 25 08:02:18 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"اليوم نحتفل بعيد الاستقلال في ظرف استثنائي، لكن ما لا يتغير مهما اختلفت الظروف هو الانتماء والحب الذي نشعر به كأردنيين لهذا البلد الذي نفاخر به العالم. أدام الله علينا نعمة الأردن بقيادة وحكمة سيدنا وكل عام ووطننا وشعبه بألف خير\n#استقلال74","date":"Mon May 25 08:01:50 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"عيد عامر بالمحبة والخير والطمأنينة لنا جميعا، وكل عام وأنتم بخير #عيد_الفطر\n\nWishing a blessed and peaceful Eid to you and your loved ones #EidMubarak https://t.co/Dafm4OX3e5","date":"Sat May 23 17:17:18 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"في هذه الليلة المباركة التي هي سلام حتى مطلع الفجر، اللهم نسألك البشرى والطمأنينة واليقين لنا أجمعين #ليلة_القدر","date":"Tue May 19 19:15:48 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"Thanks to Jordanian workers for all that you do, every day. But thank you most of all for your patience in the face of today’s uncertainty. Whether working hard or staying home, your sacrifices make our country a better place #LaborDay #Jordan #LoveJO","date":"Fri May 01 07:13:22 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"ندعو الله أن يجعل أيام الوطن القادمة أجمل، وأن يحفظ عمال الأردن فهم حماة الدار وبناة الوطن ولهم منا تحية فخر واعتزاز #عيد_العمال #الأردن #حب_الأردن","date":"Fri May 01 07:12:25 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"في غمرة هذه الظروف يطل علينا شهر رمضان محملا بالرحمة وفيض الغفران، ونفتقد فيه لمة الأهل والخلان، وكلنا أمل أن يبدل الله عسرنا يسرا ويجمعنا معا بصحة وسلامة\n#رمضان_كريم #الأردن #حب_الأردن https://t.co/55R0ILLmDl","date":"Thu Apr 23 17:18:47 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"Ramadan is always a time of great mercy and blessings. Though we will miss sharing this holy month with friends and family gathered around Iftar, we have faith that God will soon reunite us and keep our beloved Jordan safe and healthy\n#Ramadan #Jordan #LoveJO https://t.co/t2BxXH4UHk","date":"Thu Apr 23 17:17:53 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"الله يحميك يا إربد ويحمي أهلك، ويزين كل شبر في بلدنا بالصحة والعافية وهداة البال ويزيل عنا جميعا هالشدة ويعيد الأعراس والفرح لبلادنا من شمالها لجنوبها","date":"Fri Mar 27 19:41:22 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"أهنئ الجميع بذكرى #الاسراء_والمعراج، وأدعو الله عز وجل أن تعم السكينة في قلوبنا وبيوتنا","date":"Sun Mar 22 08:13:17 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"Together or apart, our mothers are always in our hearts. Wishing a Happy #MothersDay to all","date":"Sat Mar 21 11:26:49 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"حتى لو مش جنبك، الأم دائما في قلب كل واحد فينا، كل عام وأمهاتنا بألف خير #عيد_الأم","date":"Sat Mar 21 11:26:27 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"خليك بالبيت حتى يظل أردننا بخير\n#خليك_بالبيت #StayHome https://t.co/sxqcheyenQ","date":"Thu Mar 19 20:29:12 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"شكرا بحجم الوطن\nلكل مواطن يتعاون لمصلحة الوطن\nلكل جندي يسهر على خدمة الوطن\nلكل عامل يتفانى لرفعة الوطن\nلكل مغرد يشارك حبا للوطن\nحمى الله هذا الوطن\n#الأردن #حب_الأردن","date":"Tue Mar 17 15:48:06 +0000 2020","user_id":"36412963"},{"handle":"QueenRania","text":"في ذكرى #المولد_النبوي_الشريف، صلوا وسلموا على من جاء الخير على يديه مبشراً وهادياً للبشرية جمعاء. نبينا محمد عليه أفضل الصلاة وأتم التسليم","date":"Fri Nov 08 18:04:17 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"كم أنا ممتنة لحبكم وثقتكم... أهلي وعزوتي. إنتو القوة والإلهام والأمل دائما. الله يقدرني على خدمتكم\n#الأردن #حب_الأردن\n \nI am grateful to the people of Jordan, my family, every day. You are my inspiration and what keeps me going. Thank you\n#Jordan #LoveJO https://t.co/H8Ym7MPDno","date":"Sat Aug 31 09:05:25 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"في ذكرى هجرة أشرف الخلق سيدنا محمد أدعو الله أن يكون العام الجديد عام خير وبركة للجميع #الهجرة_النبوية_الشريفة","date":"Fri Aug 30 17:08:30 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"الأردن غني بالسيدات الي بمثلوا قصص نجاح ملهمة في مختلف المجالات، واليوم التقيت بمجموعة من سيدات البادية الي بيرفعوا الراس من جمعية أم الرصاص التعاونية والي تمكنوا من دعم غيرهم من السيدات لاطلاق مشاريع صغيرة خاصة بهم https://t.co/BcI3qDxevV","date":"Wed Aug 28 17:14:28 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"Jordan is home to so many incredible women serving as role models in every field! From my meeting today with members of the Umm Ar-Rasas Women Cooperative Society, which supports other women living in the Jordanian Badia and empowers them to launch small businesses https://t.co/ZsjfSkb0wG","date":"Wed Aug 28 17:14:11 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"كل عام وأنتم بألف خير، أضحى مبارك، أعاده الله عليكم وعلى من تحبون بالخير واليمن والبركات، وعلى أردننا وأبنائه جميعا بالأمن والمحبة والسلام #عيد_الاضحى","date":"Sat Aug 10 16:03:27 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"كل عام وأنت سند لبلدك ولأهله وجندي من جنوده. كل عام والحسين بألف خير  \nHappy birthday, Prince Al Hussein. May you always remain one of Jordan’s soldiers and a pillar of support for its people https://t.co/LzTvwqS12c","date":"Fri Jun 28 08:22:44 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"#وتستمر_المسيرة \n#نيالنا_فيك\n@KingAbdullahII https://t.co/iVQUHvGBct","date":"Sat Jun 08 17:49:01 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"عيد فطر سعيد وكل عام والجميع بألف خير\nWishing you all a blessed Eid \n\n#عيد_مبارك","date":"Tue Jun 04 16:59:38 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"في هذه الليالي الفضيلة ندعو الله أن لا يحرمنا أجرها وبركتها ونورها. اللهم تقبل طاعاتنا جميعا #ليلة_القدر","date":"Fri May 31 18:20:38 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"دام عزك يا أردن. كل عام ووطننا حر شامخ \n#استقلال73  #الأردن #حب_الأردن  \n\nHappy Independence Day to our beloved Jordan\n#Independence73 #Jordan #LoveJO https://t.co/Bp7VUufC99","date":"Sat May 25 17:43:00 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"إفطار رمضاني مع سيدات عجلون بقلوبهن النابضة بالطيب والجمال وأحاديث العطاء والمحبة والخير للأردن وأهله\nBreaking fast with the kind women of Ajloun this evening. Your warmth, compassion, and deep love for Jordan and its people shine through your every gesture https://t.co/EyLr6FQFES","date":"Tue May 07 20:30:57 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"هل هلالك يا #رمضان. اللهم مَكِنّا من صيامه وقيامه وختم قرآنه. أعاده الله عليكم باليمن والبركات\nRamadan Kareem wishing a blessed and peaceful holy month to all https://t.co/aoTlB33V5O","date":"Sun May 05 17:11:45 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"تحية للأيادي التي تبني وتعمل كل يوم، كل عام والوطن بخير بسواعدكم وجهودكم #عيد_العمال","date":"Wed May 01 06:00:13 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"في الذكرى العطرة لمعراج رسولنا الكريم عليه الصلاة والسلام، أدعو للجميع بدوام السكينة والرحمة والغفران","date":"Wed Apr 03 07:46:30 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"Your Majesty, the Lamp of Peace award speaks to everything you stand for, and the global recognition you have received today is also a fitting tribute to Jordanians who share your values https://t.co/ndQ5v78IQu","date":"Fri Mar 29 18:48:12 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"جائزة مصباح السلام هي في صميم القيم التي عرفتها في جلالتك منذ اليوم الأول، والتقدير العالمي الذي حظيت به اليوم هو ايضا تقدير لأبناء بلدك الذين يؤمنون برسالتك https://t.co/01GdKTSWKl","date":"Fri Mar 29 18:47:42 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"Just arrived in Assisi, Italy, where His Majesty @KingAbdullahII will be honored tomorrow with the Lamp of Peace award. It’s always a pleasure to be here, where the only match for the landscape’s beauty is the warmth of Italians themselves.","date":"Thu Mar 28 18:54:57 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"The heinous and horrific massacre in #NewZealand has taken the lives of innocent worshipers in prayer, proving once again that terrorism has no faith. May God have mercy on the lives lost, grant their families patience, and cure the injured","date":"Fri Mar 15 12:26:33 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"مذبحة نكراء بشعة تغتال الآمنين الخاشعين في صلاتهم. الإرهاب لا دين له ولا حجة. اللهم ارحمهم وصبر ذويهم، واشف المصابين #حادث_نيوزيلندا_الارهابي","date":"Fri Mar 15 12:25:37 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"قدها #صقور_الأردن.... ألف مبروك التأهل لنهائيات كأس العالم لكرة السلة","date":"Sun Feb 24 18:47:37 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"Earlier today among the good people of the ancient city of Jerash, where I met with a number of civil society organizations, local charities, and the teachers and students of Lubaba Bint Al Hareth School #Jordan #LoveJO https://t.co/ZoGsqFKVhD","date":"Wed Feb 13 15:37:11 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"اليوم في جرش العريقة وبين أهلها الطيبين حيث التقيت بعدد من من مؤسسات المجتمع المدني والجمعيات الخيرية ومعلمات وطالبات من مدرسة لبابة بنت الحارث #الأردن #حب_الأردن https://t.co/7iVGWwXvsJ","date":"Wed Feb 13 15:36:47 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"لك في قلبي مكانة خاصة. أميري هاشم، كل عام وأنت بألف خير\n#الأردن #حب_الأردن\n\nYou hold a very special place in my heart. Happy birthday, my Prince Hashem!\n#Jordan #LoveJO https://t.co/NrRvOYxTvA","date":"Wed Jan 30 10:54:25 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"كل عام وملكي ورفيق دربي بألف خير\n#الأردن #حب_الأردن \nWishing a happy birthday to my King and lifelong partner\n#Jordan #LoveJO https://t.co/ltlzBnxn54","date":"Wed Jan 30 06:55:38 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"Our teachers are His Majesty’s soldiers, and they are here today, arming themselves with the knowledge and determination to bring up generations who are confident and capable of conquering the challenges of their time","date":"Sun Jan 27 10:54:05 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"المعلمون هم جندك سيدنا @KingAbdullahII، وها هم اليوم يتسلحون بالعلم والعزيمة لينشئوا أجيالا تمشي بثقة وتنتصر على تحديات الأزمنة","date":"Sun Jan 27 10:53:21 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"No one is more worthy of educating future generations than those who travel distances before sunrise to attend classes, and to learn how to encourage inquisitiveness. This is ambition, the foundation of citizenship, and the values Your Majesty seeks in builders of the future","date":"Sun Jan 27 10:45:23 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"ما من أحد أجدر بحمل مسؤولية تربية وتعليم الأجيال ممن اختار أن يتعلم ليُعلم. ممن تركت حضن بيتها خارج عمان لتلتزم بحضور الصفوف، ممن يخرج من بيته لتهيئة بيئة صفية تحث الطالب على التساؤل والتعلم. هذا هو الطموح، وهذا هو أساس المواطنة، وهذه هي القيم التي تريدها سيدنا لبناة المستقبل","date":"Sun Jan 27 10:44:24 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"I know you never wait for a word of thanks. Even so, from myself and on behalf of every student, father, mother, teacher, and principal – thank you, @KingAbdullahII. If not for your vast heart – where every child can find a home – this academy would not have seen the light","date":"Sun Jan 27 10:42:56 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"أعلم أنك لا تنتظر أبدا كلمة شكر... ومع ذلك؛ مني ومن كل طالب وأب وأم ومعلم ومدير... شكرا سيدنا @KingAbdullahII. بدون قلبك الواسع - الذي يجد فيه كل طفل مكانا -  لم يكن لأكاديمية تدريب المعلمين أن تبصر النور","date":"Sun Jan 27 10:41:24 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"The lucky ones among us find someone to inspire them and push them toward their goal. I am fortunate to have found that in the person closest to me, His Majesty @KingAbdullahII, and I am honored to be his lifelong companion","date":"Sun Jan 27 10:40:01 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"المحظوظون منا يجدون من يلهمهم ويدفعهم للمضي باتجاه هدفهم. وأنا محظوظة بأني وجدت ذلك الشخص... وهو الأقرب لي... ولي الشرف بأن أكون رفيقة دربه. سيدنا @KingAbdullahII","date":"Sun Jan 27 10:38:11 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"There is no one more worthy of our resources, time, and effort than the person standing at the front of the classroom – the teacher who spends a third of her day with our children, and who imparts principles and values to them alongside math and language skills","date":"Sun Jan 27 10:29:27 +0000 2019","user_id":"36412963"},{"handle":"QueenRania","text":"لا جهة أجدى بأن نضع مالنا ووقتنا وجهدنا فيها ممن يقف في مقدمة الفصل الدراسي، في المعلمة التي تقضي مع أبنائنا ثلث يومهم، في المعلم الذي ينهل منه أبناؤنا المبادئ والقيم كما سيتعلمون منه الرياضيات واللغة","date":"Sun Jan 27 10:28:53 +0000 2019","user_id":"36412963"}]