[{"handle":"richardbranson","text":"Drug prohibition has failed – it’s time to support, not punish. These examples show that policy rooted in scientific evidence and conscious of human rights and social justice is the way to go. https://t.co/sNpPFCDDpt @globalcdp","date":"Mon Jun 27 10:40:12 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":".@VirginUnite and I are proud supporters of @TheEndFund’s important work and this week’s announcement from the #KigaliSummit is an incredible step in the right direction towards ending NTDs for good","date":"Mon Jun 27 01:43:11 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@JlueCRE @WSJ @londonheathrow @SFGate @USATODAY @nytimes We're sorry to hear that, we've tagged @VirginAtlantic so that they are aware of your tweet. Thanks, VH.","date":"Sun Jun 26 12:18:59 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Overturning Roe v Wade is a devastating decision by the US Supreme Court. This will not reduce abortions, it will just make them unsafe. Reproductive rights are human rights. We must all stand up for choice. https://t.co/W0GahXLFHi","date":"Fri Jun 24 15:17:38 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Looking back at this beautiful sunrise at Ulusaba - @VirginLimitedEd’s beautiful property and safari camp in South Africa. https://t.co/uGqXp4Do9d","date":"Thu Jun 23 17:05:03 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@theurigeller Magic. Thanks for the @VirginAtlantic birthday wishes.","date":"Thu Jun 23 15:21:26 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Happy Birthday @VirginAtlantic! 38 years young. Time flies at 30,000ft... https://t.co/eqhxGlk3SI","date":"Wed Jun 22 09:02:38 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Great to see @virginmusic launch in Africa and ready to support the next wave of independent artists: https://t.co/gazpwThBCP \n#VirginFamily https://t.co/8CaCgbd4zw","date":"Tue Jun 21 19:54:02 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Excited to hear @VirginAustralia is starting direct daily flights between the Gold Coast and Bali... Two of my favourite places! Here’s more: \nhttps://t.co/R3l8r9YboU https://t.co/Iw8sHSRPT2","date":"Mon Jun 20 19:38:01 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Fantastic to see how @VirginBalloons is helping refugee entrepreneurs to grow their businesses with the help of @TERNrefugee and @VirginRed: https://t.co/AQvxgGrAQo https://t.co/Jg3D7uCEFO","date":"Mon Jun 20 16:01:24 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"To mark #WorldRefugeeDay, @VirginBalloons has teamed up with refugee entrepreneurs from @TernRefugee to upcycle old balloons into things like aprons, bags &amp; swimwear. The items can be bought on @VirginRed, with proceeds going back to refugee entrepreneurs: https://t.co/8x8C7dc5hP https://t.co/Et0s6yemcH","date":"Mon Jun 20 12:39:45 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"A family adventure with my beautiful mum and little sister. #Throwback https://t.co/65l6eNrR8V","date":"Sun Jun 19 19:34:00 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":".@VirginOrbit is supporting a UK/US joint mission aboard the United Kingdom’s first ever space mission later this year. Very excited for this historic moment: https://t.co/PYTI3vqH0H","date":"Sat Jun 18 12:06:05 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Congratulations to the whole @grovecollab team on an exciting new chapter as a publicly listed company, continuing to change business for good: https://t.co/zyoLUYLxMO @Virgin https://t.co/CSFfi9bDo1","date":"Fri Jun 17 13:39:10 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Welcome to The O2, Virgin Media O2! Exciting to see your experiential studio space opening this summer: https://t.co/DbcZHHSYH7 #VirginFamily @VMO2News https://t.co/sbRDHQckKi","date":"Fri Jun 17 10:01:24 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"“We are all impacted by war in Ukraine and world leaders cannot sit on the fence: Russia’s aggression must be condemned.” Important words from Graça Machel, reflecting on The Elders’ statement on Ukraine and the meeting we had in South Africa: https://t.co/LclUs2ssLY","date":"Thu Jun 16 17:38:01 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"The story of Kim Phuc – far more than simply the Girl in the Picture. As a child, she ran away from a napalm bomb in Vietnam. Now she is an inspiration to us all: https://t.co/AI5KTAHVVQ https://t.co/YWXOTjkqzS","date":"Thu Jun 16 14:44:01 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"I’ll always remember the day Nelson Mandela called &amp; asked me to help save 4,000 jobs in South Africa. Launching @virginactiveSA was a risk, but it was well worth it thanks to the brilliant team we had (&amp; still have) around us. Here’s more from the story: https://t.co/PG9u1sHhgq","date":"Wed Jun 15 18:02:01 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"We’ve been fighting for LGBTQ+ equality for over 50 years at @Virgin – and we are so proud of our LGBTQ+ colleagues. Here’s a look at some of the projects &amp; policies we’ve worked on over the years to drive meaningful change &amp; fight for LGBTQ+ equality: https://t.co/8BWAEAXLTe https://t.co/o0BKberGBp","date":"Wed Jun 15 09:18:06 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@Virgin @vmo2business Brilliant to see.","date":"Tue Jun 14 08:27:09 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"America needs common-sense gun laws to stop these senseless killings. Countries like Australia and the UK that went much further have massively reduced gun violence and pretty much eradicated school shootings https://t.co/XkysCEPt7T","date":"Mon Jun 13 18:40:30 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Encouraged to see bipartisan agreement on some kind of gun regulation. The common ground is very small, and much, much, much more needs to be done, but it’s a small step in the right direction. https://t.co/nrdU2vIJzj","date":"Mon Jun 13 18:40:29 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"In 2012, @sambranson and I set off with some friends to try and break several world records for kitesurfing across the English Channel. It took me two attempts and over 100 crashes to make the crossing, but I made it in the end! Here's more: https://t.co/fmPDY3YUDe https://t.co/kYMGwrMWfo","date":"Mon Jun 13 13:53:26 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Drugs should be treated as a health problem not a criminal problem - worldwide. It's the only sensible way forward.","date":"Mon Jun 13 13:40:35 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"An incredible story from an organisation in Ukraine helping children with cancer evacuate the country &amp; access medical care. Proud to support the work @tabletochki is doing through @VirginUnite. @HollyBranson has shared more about their efforts: https://t.co/ZedKB0M8Uy https://t.co/4AeRxhD3Kb","date":"Mon Jun 13 10:29:06 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@VirginRed @VirginMoney @vuecinemas Brilliant.","date":"Mon Jun 13 09:32:31 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Incredible to see a hidden world of marine life discovered beneath an Antarctic ice shelf: https://t.co/sVPtzK99a6 https://t.co/ZnD7ezpBgS","date":"Sat Jun 11 21:43:59 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Thanks to all who work so hard to end the death penalty in Southeast Asia, including Tony Fernandes.","date":"Sat Jun 11 15:33:43 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Applaud the Malaysian government decision to abolish mandatory death penalty. Hopefully this is a stepping stone on the road to full abolition and sets an example for other countries in the region. https://t.co/3oftxzaIvk","date":"Sat Jun 11 15:33:42 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"A pod of whales swimming in the waters around Necker. Incredible. https://t.co/lX68bJN7mA","date":"Sat Jun 11 14:34:44 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"I’m still filled with inspiration when I look through the pages of Virgin By Design. The book uncovers the story behind @Virgin – and how we grew from a cheeky start-up to the brand it is today: https://t.co/wNNenjJ4pU https://t.co/laIZDLFE3s","date":"Fri Jun 10 19:00:21 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"When will the Republican Party put democracy and truth ahead of narrow-self interest? All honest people must accept the shocking evidence of Jan 6th committee hearings and hold accountable all those responsible for the attempted insurrection https://t.co/sIUIJ9XPUj","date":"Fri Jun 10 17:05:51 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Powerful words from Uvalde native Matthew McConaughey. America must rise above its divisions and embrace common-sense gun regulation now. It’s time to stop the killing: https://t.co/SPWWBqTwsm https://t.co/EdX3NFiMz6","date":"Fri Jun 10 10:00:12 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"نؤمن لشعب العراق العظيم الحق المُطلق في حماية تراثه الثقافي العريق إلا إننا نلتمس من محاكم العراق وكذلك @barhamsalih إعادة النظر في الحكم الصادر بحق السيد/ جيم فيتون Jim's ذلك أنه وبحسب ما ورد أنه طلب الإذن من المسؤولين الحكوميين ومُرشده السياحي قبل أخذ الأشياء التي عثر عليها","date":"Fri Jun 10 08:05:27 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"حتى أن رئيس المحكمة أقر بأن السيد فيتون ليس لديه أي نية جنائية ولم يكن على دراية بأنه قد خرق قوانين البلاد. وبناءً على الظروف، يبدو أن القاضي قد تسرع في حكمه، فنرجو من عدالتكم التكرم والسماح له بالعودة إلى بلاده وأن يعود إلى أسرته التي تنظر عودته على أحر من الجمر.","date":"Fri Jun 10 08:05:27 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"The great people of Iraq have every right to protect their rich cultural heritage. But I hope Pres @barhamsalih and Iraqi courts reconsider Jim Fitton’s sentence, as he reportedly asked gov officials and his tour guide for permission before taking items found in his possession.","date":"Fri Jun 10 08:05:26 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Even the presiding judge admitted that Mr Fitton had no criminal intent and was unaware he was breaking the law. Given the circumstances, the judgement seems rather harsh. Please allow him to return home and reunite with his family.","date":"Fri Jun 10 08:05:26 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@VirginAtlantic Thanks for the warm welcome Texas!","date":"Thu Jun 09 14:48:21 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Very excited to see everyone’s submissions!","date":"Thu Jun 09 14:48:02 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Why you don’t need to ‘win’ in conversations, and why it’s important to discuss everything with a desire to learn, rather than a need to prove your point: https://t.co/qVpCzVmVCM https://t.co/1gwJsA3TGN","date":"Thu Jun 09 07:00:14 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"From start-ups to growth-stage business owners, the @BransonCentreCA has been supporting purpose-driven entrepreneurs for over a decade. Very inspiring to read about its 2022 accelerator programme - and the 15 wonderful businesses that have joined: https://t.co/VVGrXfjBFt","date":"Wed Jun 08 17:00:29 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Brilliant to see Virgin Radio Pride UK return to the airwaves and celebrate LGBTQ+ culture:\nhttps://t.co/rB3FivwesZ @VirginRadioUK https://t.co/ejETz7bpPV","date":"Wed Jun 08 12:45:45 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"What a photo. Striking and poignant, showing the incredible Ukrainian spirit in the face of adversity.","date":"Wed Jun 08 10:47:58 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Wonderful to read @terryoldfield’s memoir – following a musical career spanning 30 years &amp; more than 40 albums. His brother, Mike Oldfield, was the first artist we signed with Virgin Records &amp; the musical talent runs deep within the family: https://t.co/w99NuPxEDA https://t.co/yyWjFy0QcL","date":"Tue Jun 07 18:00:47 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"“Friends die in your arms.” A powerful account of the situation in Ukraine from an 19-year-old student-turned-soldier: https://t.co/I7Q4AfsbR3 https://t.co/ctpU1PvegL","date":"Tue Jun 07 10:29:29 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Excited to join the judging panel of @VirginLimitedEd's #VirtuallyWild wildlife photography competition. Find out more and submit your entry here: https://t.co/vRoap84Apv https://t.co/80TYlI8mlw","date":"Mon Jun 06 16:38:40 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"French calls not to humiliate Russia are insensitive and wrong. Russian invaders now control one fifth of the country. Thousands have died. Millions have fled. Ukraine is a sovereign country that must be helped by all of us to get their territory back.","date":"Sun Jun 05 14:11:49 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Finding joy even in the face of adversity – @TheDesmondTutu was such an inspiration to me with his approach to life. Watch his award-winning film Mission: JOY - Finding Happiness in Troubled Times, screened live: https://t.co/N60XBPbAEg https://t.co/4lmgomGTfE","date":"Thu Jun 02 21:15:46 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Applaud British Columbia for exploring pathways to drug decriminalisation. This will reduce harm and save lives. #supportdontpunish https://t.co/PK6Uo00vcm","date":"Thu Jun 02 09:11:16 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Brilliant to see @MadeByDyslexia #dyslexicthinking","date":"Wed Jun 01 10:35:36 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Kids should have the right to go to school without the permanent fear of being shot. This is what common-sense gun regulation should look like. https://t.co/mZ7lCmnJoz","date":"Tue May 31 13:03:55 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Congratulations to everyone at @VirginPulse for hosting yet another fantastic Thrive Summit this year. Here’s more: https://t.co/X85YEmJ0kg https://t.co/fWEQbQQwzv","date":"Thu May 26 15:10:04 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Sad to see state-sanctioned executions have been on the rise again in 2021. There is nothing just or fair about the death penalty. It’s inhumane and must be abolished. #BizVsDp @amnesty https://t.co/PBI1KdsBc5","date":"Tue May 24 16:41:23 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Thrilled to be in South Africa celebrating @VirginAtlantic returning to Cape Town: https://t.co/fqpYJ79svM https://t.co/fNkeb9sRwk","date":"Tue May 24 16:07:04 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Lola showing me her swimming skills! Such a special moment. @HollyBranson https://t.co/ry49A4VFPt","date":"Sun May 22 19:24:46 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"A very exciting time for @VirginOrbit. The team is expanding its fleet with two additional Boeing 747 aircraft, which will be modified to become airborne launch pads for Virgin Orbit’s rockets. It still amazes me that this is possible: https://t.co/qctMRWZzfP https://t.co/RwY75nger0","date":"Sat May 21 17:55:03 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Very cheeky.... https://t.co/LmUsfWoSKV","date":"Sat May 21 13:45:25 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"My grandkids recently presented me with a kids petition demanding to be let onboard our adults-only cruise ships. I showed a friend at @VirginVoyages who made this delightful video, which really made us all smile: https://t.co/VPrOpePGRE https://t.co/KvtwFZwQ4C","date":"Fri May 20 14:40:58 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Behind the scenes of @VirginAtlantic's latest campaign, which champions individuality and those who see the world differently. It's always been people who have made the airline so special, so it's brilliant to see them celebrated this way. #VirginFamily https://t.co/e50HML9S2X","date":"Thu May 19 08:24:50 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Swish! Very exciting to see @VirginVoyages sailing to some of the best spots in the Mediterranean, including the French Riviera, Tuscany and Ibiza: https://t.co/NY3P7bY3iN https://t.co/uSdqShq6Mv","date":"Wed May 18 14:55:12 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"A great read on the opportunities that small satellites bring. @VirginOrbit is now set to launch satellites that will help with disaster prevention, infrastructure management, agriculture, and make autonomous driving a reality. Here's more: https://t.co/gg6sDyj9x5 https://t.co/TmgNMAKA4U","date":"Wed May 18 12:00:19 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Celebrating the launch of Valiant Lady with all the crew: https://t.co/NY3P7bY3iN @VirginVoyages #VirginFamily https://t.co/GU3VVJZPNU","date":"Tue May 17 19:48:38 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"So excited to welcome @VirginVoyages’ new ship Valiant Lady to its new home port in Barcelona: https://t.co/NY3P7bY3iN https://t.co/RjXYIoi7am","date":"Tue May 17 13:48:26 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@VirginVoyages Such a fantastic trip – thanks for having me @VirginVoyages!","date":"Mon May 16 15:47:53 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"There’s nothing more thrilling than doing something that no-one has ever done before. This is what led me to try flying a hot-air balloon around the entire world – and I can’t believe I lived to tell the tale! Here’s more: https://t.co/fmPDY3YUDe #RichardsAdventures https://t.co/2d3ly4hCFX","date":"Mon May 16 14:22:57 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Very exciting to see @VirginOrbit preparing for its next launch mission, called  #StraightUp. This launch is particularly important, as it marks Virgin Orbit's first night mission. Here's more: https://t.co/TRkiAhaKoQ https://t.co/eOp2NA1dle","date":"Mon May 16 12:58:52 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Loved learning more about the women who help @VirginOrbit launch satellites into space. Wonderful to have you all in the #VirginFamily:  https://t.co/lpC8Juzh49 https://t.co/Ao1KQCMsoQ","date":"Fri May 13 12:00:26 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Can't wait to set sail down under, the Virgin way: https://t.co/1tsVdi15yn\n\n@VirginVoyages #VirginFamily https://t.co/RilD9UYFs3","date":"Fri May 13 09:14:44 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Amazing to see @VirginLimitedEd breathe new life into a historic Mallorcan finca on a UNESCO World Heritage Site. I visited recently and was so impressed by the careful and meticulous construction on-site. Son Bunyola is such a special place: https://t.co/Gz03OAyGry https://t.co/miDxSsyFOE","date":"Thu May 12 09:03:42 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"A sad milestone. The war on drugs cannot be won. Time for comprehensive, global drug policy reforms that prioritise harm reduction over criminalisation, support over punishment. @globalcdp \nhttps://t.co/UqtP0nCEa1","date":"Wed May 11 16:24:32 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Encouraging to see the strides @VirginAtlantic is making, post-pandemic. The team has re-launched its apprenticeship and graduate schemes to seek out and support the next generation of engineers: https://t.co/nSZnVu4RsU #VirginFamily https://t.co/HsskWec9Wo","date":"Tue May 10 15:05:45 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Vamos Rafa! Real privilege spending time with @RafaelNadal at his remarkable tennis academy in Mallorca: https://t.co/9tK3EC9gxS https://t.co/EzNQ9ODqw6","date":"Tue May 10 15:01:53 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"How much longer is Putin going to be allowed to maim and kill women and children? And how much longer will Russian mothers and fathers stand by whilst thousands of their children are sent to kill and be killed in the most pointless of wars? https://t.co/MGVtHO4Fsr","date":"Mon May 09 11:32:45 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"It's always inspiring to see a business that is driven by a strong purpose. @HollyBranson shares more about a great start-up she's invested in, called @AirlyOrg, that lives and breathes its purpose. Here's more: https://t.co/o6GcYerdPG #InvestingWithPurpose https://t.co/bzLXAEYBvi","date":"Mon May 09 07:57:07 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"What I'm reading this month [this one is very close to my heart]: https://t.co/lvLXeGcZAR\n\n@literati @vanessabranson #OneHundredSummers https://t.co/a8kiARyDaO","date":"Fri May 06 12:59:04 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"“Half the world’s population are women. The other half are her children. Yet in many countries women still don’t have equal rights.” - Graça Machel. What are a majority of men doing deciding on women’s reproductive rights? https://t.co/Rr00YrOI5f","date":"Thu May 05 17:03:09 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Shameful that Hungary will not support EU oil embargo","date":"Thu May 05 13:29:50 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":".@VirginVoyages is heading down under in 2023. Very excited to see the ship sail all the way from Athens to Sydney: https://t.co/s0E9svU0cd #VirginFamily https://t.co/ONPHzllp7u","date":"Thu May 05 12:00:21 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Brilliant to hear from some of the dyslexic superheroes we have in the #VirginFamily. Thank you for sharing your unique skills with us, and for making the brand a little bit brighter. Here's more from @HollyBranson:  https://t.co/52blDmHk4B https://t.co/vmRX2QlHE2","date":"Thu May 05 08:46:20 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@VirginVoyages has welcomed the fourth ship to its fleet and the #VirginFamily, which is fittingly named Brilliant Lady. The team work so hard to create exciting and radiant experiences on-board, so it feels right that the new ship reflects that! https://t.co/uyvBBl4aQl https://t.co/0C8hDbxQuo","date":"Wed May 04 16:00:50 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Their bodies, their choice: why banning abortions is poor policy with fatal consequences https://t.co/kKMmEpJYiM","date":"Tue May 03 22:00:25 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Great to see the return of @VirginStartUp's Collective Impact programme, which helps purpose-driven founders get investment-ready. Find out more and apply here: https://t.co/nQ4kvVK5ml #VirginFamily https://t.co/mSPYZBtf6n","date":"Mon May 02 23:22:40 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Five tips for running a start-up from people who have been there: https://t.co/TiBr3e5bmY @VirginStartUp https://t.co/rPNFjKwoDN","date":"Fri Apr 29 16:00:41 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Everyone benefits from embracing neurodiversity at work.\n\nThe unique skills, cognitive strengths &amp; fresh ideas of a neurodiverse workforce is exactly what businesses need to evolve &amp; succeed.\n\nHere’s how to embrace autism at work, according to @auticon_en:\nhttps://t.co/0sW3ggvgcs https://t.co/oll5Q9zq3x","date":"Fri Apr 29 10:49:35 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Great to hear about @VirginStartUp’s new podcast series, which tells the untold stories of the founders behind the start-ups that make our world so much more exciting. You can listen to #TheJump right here: https://t.co/eAXoCZnU8h https://t.co/dbtsTdS4Dk","date":"Thu Apr 28 12:13:33 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Nagen was not a criminal. He was a victim – of his circumstances; of drug cartels that prey on the vulnerable; of a justice system rigged against the marginalised and the poor. Humanity has failed him. https://t.co/BMJhrn0P27","date":"Wed Apr 27 15:59:00 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Let’s do away with the death penalty once and for all. We owe it to Nagen: https://t.co/BMJhrn0P27\n@reprieve @rbij","date":"Wed Apr 27 15:59:00 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Heartbroken to learn that Nagaenthran Dharmalingam was hanged at Changi prison. Singapore’s relentless machinery of death did what it always does. Stubbornly clinging to the letter of the law, it left no room for decency, dignity, compassion, or mercy. https://t.co/BMJhrn0P27","date":"Wed Apr 27 15:58:59 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Heartbreaking.","date":"Wed Apr 27 13:47:36 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@BRACworld is a brilliant NGO that we support at @VirginUnite. Here’s how the organisation is helping communities break out of the deepest forms of poverty: https://t.co/mWq0h2eOAD https://t.co/OBfVnowxUB","date":"Tue Apr 26 15:32:18 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@VirginVoyages Can't wait.","date":"Mon Apr 25 14:56:35 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Congratulations @UmaValeti and the @UPSIDEFoods team. Excited to be supporting a future food system with more UPSIDES for animals, the planet and people.","date":"Fri Apr 22 13:10:44 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"@Reprieve @stephenfry No one with a disability should be treated this way. Help us save him: https://t.co/0Nvyl7NmVS\n\n@reprieve @stephenfry #SaveNagaenthran #Singapore","date":"Fri Apr 22 06:31:16 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"President Halimah Yacob: please spare the life of Nagaenthran Dharmalingam\n \n@reprieve @stephenfry \n#SaveNagaenthran #Singapore https://t.co/ElpMHzsECV","date":"Fri Apr 22 06:30:00 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"One simple way to cut reliance on Russian oil: reducing speed limits by just 10 miles per hour would save around 600,000 barrels a day from cars and trucks, more than enough to replace Germany’s imports from Russia https://t.co/KkBMs0qPVs","date":"Wed Apr 20 09:20:25 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Effective military aid, economic sanctions, reducing oil consumption, cutting speed limits – ways to support Ukraine as its people fight and die for their own freedom, but also for the freedom of all of us https://t.co/KkBMs0qPVs","date":"Wed Apr 20 09:20:25 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Urgent action must be taken to stop the world funding Putin’s brutal war – here’s how: https://t.co/KkBMs0qPVs","date":"Wed Apr 20 09:20:24 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"It is preposterous for Western countries to be sending billions of dollars to Russia for fossil fuels, effectively funding Putin’s war https://t.co/KkBMs0qPVs","date":"Wed Apr 20 09:20:24 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Love @virginatlantic’s See the World Differently – such a celebration of our differences and what makes people unique https://t.co/9yNfULiqJP","date":"Thu Apr 14 13:03:34 +0000 2022","user_id":"8161232"},{"handle":"richardbranson","text":"Backed by UNHCR, Made51 helps refugee artisans to bring their products to a global market and rebuild their lives and livelihoods. I’m really proud that @VirginAtlantic and @VirginMENA are both now stocking them https://t.co/khwxus2bGg\n\n@Refugees @made51_unhcr https://t.co/YxfmBE9TFJ","date":"Wed Apr 13 15:40:59 +0000 2022","user_id":"8161232"}]