[{"handle":"saurik","text":"@aptera_motors @Mosqvich Maybe you could explain these \"merits\"? I really want to support you for embracing right-to-repair, but over-spending your weirdness budget / idiosyncrasy credits on a feature even most supporters only claim \"isn't that bad\" instead of \"is very good\" feels like an unforced error.","date":"Sun May 01 10:14:27 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@CoinbaseSupport My new case # was 09621355 and my complaint # was 09660194; however, remember: you've done this before and it was exceedingly unhelpful. Meanwhile, I've now been ghosted by your Compliance KYC department: I sent them documentation weeks ago and they seriously just disappeared! :/","date":"Tue Mar 29 09:04:00 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@CoinbaseSupport Despite this \"escalation\", my issue was never resolved; worse, I got the same error again months later, and @CoinbaseSupport was just as unhelpful! I even escalated the issue using @Coinbase's Complaint Resolution Process, which violated its own deadline... and still didn't help.","date":"Tue Mar 29 08:33:03 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@yurais https://t.co/NcAyla7DvH","date":"Fri Mar 11 03:04:53 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"As an interesting contrast, @optimismPBC released their official postmortem of the bug this morning, along with their understanding of the cause (which I will note is very different from the engineering methodology and process issue I focus on in my talk). https://t.co/6ZzXaP47gY","date":"Fri Mar 11 02:44:03 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"Note: the audience for that recording was the final day of an Intro to CS class, and so it is somewhat a culmination of our earlier discussion; in particular, I view my talk on Unbridled Optimism as an update to this other lecture I often give on security. https://t.co/ZA8yS0yDK2","date":"Fri Mar 11 02:44:02 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"I had tech issues at #ETHDenver2022 that affected my talk on Unbridled Optimism (the Ethereum L2 bug I reported last month); but, last night, I gave a much more complete version at a UCSB course I co-facilitate! ...though (sorry) the audio quality is poor. https://t.co/8YjBoueJdE","date":"Fri Mar 11 02:44:01 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"As an interesting contrast, @optimismPBC released their official postmortem of the bug this morning, along with their understanding of the cause (which I will note is very different from the engineering methodology and process issue I focus on in my talk). https://t.co/6ZzXaP47gY","date":"Fri Mar 11 00:43:05 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"I had tech issues at #ETHDenver2022 that affected my talk on Unbridled Optimism (the Ethereum L2 bug I reported last month); but, last night, I gave a much more complete version at a UCSB course I co-facilitate! ...though (sorry) the audio quality is poor. https://t.co/8YjBoueJdE","date":"Fri Mar 11 00:43:04 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"Note: the audience for that recording was the final day of an Intro to CS class, and so it is somewhat a culmination of our earlier discussion; in particular, I view my talk on Unbridled Optimism as an update to this other lecture I often give on security. https://t.co/ZA8yS0yDK2","date":"Fri Mar 11 00:43:04 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@mr_ligi @LefterisJP (You also mention hopping \"back\" but that isn't adding a hop: that's remove a hop. What the user needs to see is the path of actions they'd need to take to go back to the base asset on its native chain, which includes both bridges and wrappers: anything which breaks fungibility.)","date":"Fri Feb 11 09:41:00 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@mr_ligi @LefterisJP No: the hops are relevant as the hops are what introduces the new security and trust properties you were mentioning. If I have (say) ETH on Solana via Wormhole and ETH on Solana via someone else they aren't fungible on Solana and one might have been hacked while the other wasn't.","date":"Fri Feb 11 09:39:06 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@mr_ligi The problem is not my time in the abstract but having to try to talk about anything complex using Twitter, one tiny thought at a time ;P. But like: ETH bridged to Avalanche is \"different\" depending on which bridge you use; or: if you bridge it to Polygon, and *then* to Avalanche.","date":"Fri Feb 11 09:37:06 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@mr_ligi The \"madness\" comes from how there are an arbitrary number of ways to bridge ETH to other chains and they can't all be assigned a short symbol name, which becomes even more awkward if they are generic enough to support recursive stacking. What we really need is the \"bridge path\".","date":"Fri Feb 11 09:21:26 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@mr_ligi The reason my article leans into \"OETH\" is more because I needed some term at all for each side of that one specific bridge and that one term had at least the precedent of being in your database; but that reasoning is then a bit circular ;P. I would have made up a term otherwise.","date":"Fri Feb 11 09:09:56 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@mr_ligi Ok, well... get this: I actually strongly back the OETH-&gt;ETH change and have had it on my todo list for weeks to lobby for it myself; I am sympathetic to the premise of \"OETH\", but believe \"down this road lies madness\": bridge paths shouldn't be modeled via modified symbol names.","date":"Fri Feb 11 09:08:13 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@mekkaokereke @techgirl1908 FWIW, this was a pre-listed bounty and there are a number of projects with bounties of similar sizes. You can see a/one list at https://t.co/Fy1xbdhcru, which (as of today) now has a $10M bounty listed for MakerDAO (three times the previous high from Olympus I had in my article).","date":"Fri Feb 11 02:54:22 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@alexberegszaszi @optimismPBC Oh, interesting! FWIW, the code my article is looking at is actually part of Optimism's fork of geth, not upstream, and they don't have that patch yet (so it doesn't really matter what geth did, for my purpose; I might decide to make a note of it, though). https://t.co/XZ9qQf7GN4","date":"Thu Feb 10 18:58:26 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@FreddieRaynolds @optimismPBC Yeah :(. The way I'd added SSL to my website (which I only did last night) was apparently unacceptable. I had given myself a backup plan, which I have now switched to (but probably should've just gone with out of the gate for the first day after pushing new content like this :/).","date":"Thu Feb 10 18:13:16 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"I will be giving a talk about the bug at @EthereumDenver, Friday, February 18th: 9:40am MST on the Infinity Stage. My talk will be live-streamed, presumably to the #ETHDenver YouTube channel: https://t.co/ZCzEMHYPIq Look out for \"Attacking an Ethereum L2 with Unbridled Optimism\"!","date":"Thu Feb 10 17:07:49 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"Last week, I discovered (and reported) a critical bug (which has been fully patched) in @optimismPBC (a \"layer 2 scaling solution\" for Ethereum) that would have allowed an attacker to print arbitrary quantity of tokens, for which I won a $2,000,042 bounty. https://t.co/J6KOlU8aSW","date":"Thu Feb 10 17:07:49 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@MasterRL2 You probably can't. You can only install Cydia currently on older phones that are ALSO running older versions of iOS. The way you would do so is using a jailbreak tool, such as checkra1n or unc0ver. You should watch https://t.co/a7XIlDaTsO and https://t.co/QfyTVOEH3e for updates.","date":"Tue Jan 18 11:17:07 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@MasterRL2 Also, the other two users who replied to you are automated bots (OMG) that jumped on your tweet, likely for using the keyword \"scammed\". If you talk to them, they will probably use whatever personal information you give them to steal either more of your money or your identity. :/","date":"Tue Jan 18 11:09:27 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@MasterRL2 There is no such thing as an \"upgraded\" version of Cydia. Cydia is now and has always been free. You *were* scammed. Contact your bank and file a chargeback. If you paid via PayPal, open a dispute and then immediately escalate it to a full \"claim\" (as disputes don't do anything).","date":"Tue Jan 18 11:02:26 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@zoontek You might be able to use @CorelliumHQ--which Apple, notably for the narrative of your thread about how difficult Apple has made this, tried (and failed) to shut down: after failing to purchase them they went for a lawsuit :/--to emulate an iOS 14.6 device. https://t.co/4Yoi7WqcZ8","date":"Mon Jan 17 17:33:44 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@caioo_henriqui There is no such thing as a \"membership\" to Cydia: Cydia is now and has always been free. You were scammed. If you paid with a credit card, file a chargeback with your bank. If you paid via PayPal, file a dispute and immediately escalate it to a claim (as a dispute does nothing).","date":"Sun Jan 16 10:03:56 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@boirxcc00 That isn't actually Cydia... it looks like some kind of full page web app maybe that is pretending to look like Cydia? Don't give it any money, and if you have already paid anything for this (note: Cydia is free) request a charge back from your bank or file a dispute with PayPal.","date":"Wed Jan 05 19:08:31 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@0xPickACard @j0hnwang I don't see how that helps. The problems are: 1) onboarding to the L2 chain is awkward (which is where Avalanche's strategy is dominating); 2) the L2 is charged NEAR, but you paid ETH (part of why it's currently free); and 3) it fails to give NEAR itself an EVM contract chain :(.","date":"Mon Jan 03 22:26:20 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@sker_17 Interesting... FWIW, I only tested Facebook, but I see Google also failed for you? :( I've replicated that issue and fixed it; but Facebook still works for me (in fact, it is working a little \"too well\" in that I can no longer log out! I'll look into that ;P). I'll ask @sbingner.","date":"Sun Jan 02 14:28:58 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@sker_17 (BTW: Cydia also automatically connects accounts based on their e-mail address; so, even while I was working that out, it was still often possible for people to get access to their purchases. I don't remember if I have auto-connect for PayPal accounts, but I was working on that.)","date":"Sun Jan 02 07:06:24 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@sker_17 I just tested Facebook login in Cydia--both in a browser and on a jailbroken device--and it is working fine? (FWIW, it was broken for a while due to Facebook suspending my API access... but I had worked this out with them over a year ago, in October 2020.) https://t.co/KusNDDFKmY","date":"Sun Jan 02 07:04:26 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@j0hnwang The thing NEAR did that's awkward, though, is their \"EVM compatibility\" uses ETH as the gas coin instead of NEAR, which obviates Avalanche C-chain -style exchange integrations to onboard the NEAR ecosystem. (And, in the meantime, the tokenomics are still missing: Aurora is free!)","date":"Sun Jan 02 06:49:52 +0000 2022","user_id":"6368672"},{"handle":"saurik","text":"@ultratiem @DougPawl Ok: I am going to consult with my lawyers about this... if I am going to be in a position of feeling a need to cough up tens of thousands of dollars to refund users because you--for reasons you refuse to state!--insist on retracting your theme, I am going to be extremely sure :/.","date":"Thu Dec 16 07:10:41 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@ultratiem @DougPawl I am going to be honest: I didn't read any of your emails as I am not well organized with email and it hasn't seemed important to scour anything for a long time now as I get information filtered to me from other community members (whom I won't name to avoid them getting spammed).","date":"Thu Dec 16 06:57:55 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@ultratiem @DougPawl That isn't a \"scape goat\": that's the only thing you seem to be asking me to do for you! I am *not* still selling your theme! What evil underhanded purpose do you think I possibly could have here other than a legitimate feeling of obligation to the people who paid for this theme?","date":"Thu Dec 16 06:54:27 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@ultratiem @DougPawl And yet, this is clearly very important to you for some reason: enough to try to shame me in public and even complain at my hosting providers to prevent rightful owners of your theme from accessing it. (\"Congrats\": you've finally made me regret not having vendors sign contracts.)","date":"Thu Dec 16 06:43:10 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@ultratiem @DougPawl 1) I am differentiating new sales vs. legacy access. 2) Yes? I might feel the situation is different in another decade. 3) Why do you want to make it so people who already owned and paid for your package can't access it? I still don't understand that part: it seems really sketch.","date":"Thu Dec 16 06:33:59 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@ultratiem @DougPawl The issue is that you are not asking for something that makes sense: you want me to stop selling your theme... well, I stopped selling *all* themes 3 full years ago! I literally took the entire store down, including your package: it is only available to people who already own it.","date":"Thu Dec 16 06:16:35 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@ultratiem @DougPawl I honestly don't understand what you want :/... is it that you need the people who had already purchased the product to not have access to it anymore? Morally, I will only do that if I send them all back the money they paid for the package (which I doubt you intend to return...).","date":"Thu Dec 16 06:14:11 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@DougPawl @ultratiem I have literally not sold a single package since December of 2018. I can thereby guarantee to you that I have not been selling any copies of your, or anyone else's, theme and pocketing the money somehow. If you don't believe me, you should try to purchase it and see what happens.","date":"Wed Dec 15 08:03:31 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"In June of 2019, Facebook suspended my Cydia app, removing its access to Facebook login and locking users out of their Cydia accounts, which required a slow (on both sides: Facebook and I each were taking months to respond to the other ;P) back and forth of interrogations to fix.","date":"Sat Oct 24 12:10:32 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"@ios_designer @doctorow The irony of what you want upthread is it's \"more DRM from a more benevolent dictator\"; but the reason Cydia isn't a thing right now isn't because of something Cydia is or isn't doing as Cydia can't even be installed in the first place... because of Apple's DRM: DRM is our enemy!","date":"Sat Nov 13 18:17:07 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@ios_designer The \"future of Cydia\" is tied to the war on general purpose computing and the rising monopolies (within their relevant markets) of first-party markets that bottleneck all software through a handful of interests; I recommend following people like @doctorow and watching my lawsuit.","date":"Sat Nov 13 17:43:15 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@ios_designer You can't install Cydia on a device today, no matter what business model you think it should have... over the past few years, jailbreaks have been too sparse of coverage, long of delay, and \"low in quality\" :/. I guess I recommend this talk I gave in 2018? https://t.co/j8QGrYN1iF","date":"Sat Nov 13 17:27:35 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@ios_designer The very existence of alternatives to the App Store (such as, but not limited to, Cydia) is predicated on the existence of bugs in Apple's defenses against the implementations of such. There isn't even a jailbreak for iOS 15 at all right now! How do you expect Cydia to \"work\"? :/","date":"Sat Nov 13 17:09:51 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@matteopascolini Verify the date is set correctly; if it was, you should be able to install an updated trusted CA set (for https://t.co/cHmOKqbBOV). I feel like \"critical functionality\" should work even if none of those pages load, though (but maybe that screen is a refresh error you can't read)?","date":"Tue Nov 02 15:06:59 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@PrnomNo96203297 Cydia is now and has always been free: if you were asked by some website to \"buy\" Cydia, you were scammed... go to your bank, PayPal, whatever and force a chargeback / file a claim (important for PayPal: don't merely \"dispute\" the charge, but escalate it) and get your money back.","date":"Sun Oct 10 20:01:17 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@gpt3_bot @cdixon We thereby need to be judging decentralized projects not on how much supply they have, but on how much true, unsubsidized, paid demand they have managed to generate for their underlying utility, which is a metric I think often gets set aside while we stare at incentivized supply.","date":"Sat Oct 02 03:34:05 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@gpt3_bot @cdixon I certainly don't think it is impossible for a game to do that--I used to be a game developer, and now work in crypto!--and I often defend the value of NFTs (I work with artists IRL)... but concentrating on \"people make money (have a job) providing supply\" is, in fact, a problem.","date":"Sat Oct 02 03:33:48 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@gpt3_bot @cdixon At the end of the day, McDonald's sells food that people buy to eat for either pleasure or sustenance and the people who work there make that food; the \"real\" web3 projects that matter provide utility in demand: bandwidth or computation or even entertainment... not merely \"jobs\".","date":"Sat Oct 02 03:33:27 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@gpt3_bot @cdixon The people playing Axie as a job get paid in two ways: selling axies to others (which is circular if no one is playing the underlying pay-to-win game for fun) and with indirectly-centrally-minted SLP... the value of which comes from people needing it for this job (also circular).","date":"Sat Oct 02 03:33:08 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@cdixon I am sick of defending the good web3 companies to my friends who see circular services without users, that over-built supply without demand :(. Even Axie Infinity: is anyone playing it because it is actually fun, or do people only want Axies to make money selling Axies to others?","date":"Sat Oct 02 02:13:22 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@cdixon And when combined with the penchant for companies in this space to pay for that supply with money made by telling people how great their product is... because of how much supply it has... supply paid for with incentives... incentives paid for with token sales... it's a bit scary.","date":"Sat Oct 02 02:04:01 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@cdixon No: I merely have that much belief in the importance in concentrating on demand-side over supply-side. The playbook of \"raise a ton of money to pay for supply and pray for demand later\" might sound great to a VC, but it is not too different from what the web2 strategies we hated.","date":"Sat Oct 02 02:02:03 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@cdixon As they say, \"everything old is new again\" ;P the playbook you are describing is, at its best, \"VC dumping\" (a classic web2 strategy) and, at its worst, \"a scam\", with the supply incentives coming from the cream skimmed off the top of prior user speculation in chasing incentives.","date":"Sat Oct 02 01:57:12 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@koMpaNe Cydia is now and has always been free: if you were asked by some website to \"buy\" Cydia, you were scammed... go to your bank, PayPal, whatever and force a chargeback / file a claim (important for PayPal: don't merely \"dispute\" the charge, but escalate it) and get your money back.","date":"Sun Aug 22 08:39:59 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@TylerLee_C Out of curiosity, what would you actually want me to tweet about? I recently (finally) got verified, I think the 240-character update from a few years ago makes it more fun, I actually kind of like the app now, and people shout \"eta wen\" at me less, so I am trying to use it more.","date":"Thu Aug 19 20:35:26 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@TylerLee_C @CoinbaseSupport @CoinbasePro My entire public persona is around a community of people who have a problem with Apple, so of course the vast majority of my tweets are \"Apple did something bad again, here's why that sucks\" ;P. I think this is actually the first time I have taken to Twitter for customer support.","date":"Thu Aug 19 20:12:16 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"Amazingly, the bugs continue: after I gave up and went to sleep, the two transfers I then had \"PENDING\" were both \"CANCELLED\" at the same time with the reason \"The transaction fee has expired.\"... but these failed transfers are still counting against my daily withdrawal limit :/.","date":"Thu Aug 19 19:32:23 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@mtoto_lekgwathi Thankfully, the money isn't lost (though, I had a task I needed it for that isn't getting done, which is an indirect loss); but, yeah: I'd heard many stories of @CoinbasePro having \"issues\", and here I am with a 50% failure rate on crypto withdrawals... it is super disappointing.","date":"Thu Aug 19 12:38:15 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"(Before I decided to tweet, one of my transactions ended up failing after *10 hours*, with an extremely low-level looking e-mail that had the error message \"Pro/Prime send money failed!\". https://t.co/Nmx5NHI53G Attempting to retry the transaction put it in the same state again.)","date":"Thu Aug 19 12:22:17 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"Cydia just joined the legal battle against Apple: \"A new lawsuit brought by one of Apple's oldest foes seeks to force the iPhone maker to allow alternatives to the App Store, the latest in a growing number of cases that aim to curb the tech giant's power.\" https://t.co/h9Zj1joPhG","date":"Thu Dec 10 17:59:59 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"FWIW, this apparently has happened to many other users on the @coinbase subreddit and most of them report the same SNAFU of your customer support providing incorrect responses in a loop, so this seems to be a systemic issue. https://t.co/hFhzPkyvsw Maybe a postmortem is in order?","date":"Thu Aug 19 12:22:17 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@CoinbaseSupport I now have two (large) withdrawals of USDT stuck in a \"PENDING\" state *without a transaction hash*; I'd reached out to @CoinbasePro customer support (case 07135988 &amp; 07136974), but they keep linking me to a different \"COMPLETED\" withdrawal from the day before :/.","date":"Thu Aug 19 12:22:16 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@DedWhaleson @LLcryptoJ @Melt_Dem @matthew_d_green Most modern jailbreaks are what we call \"semi-untethered\" (and the parenthetical in my prior tweet was over-simplified...); FWIW, I can't imagine any of these features being discussed today require kernel modifications (and yeah: I'd *assume* simply not upgrading is sufficient?).","date":"Mon Aug 09 10:06:53 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@DedWhaleson @LLcryptoJ @Melt_Dem @matthew_d_green \"It depends.\" If you are working with a tethered (goes away after reboot) bootrom exploit, such as checkra1n (up to iPhone X only), then \"yes\"; but, most jailbreak exploits are incapable of changing the executable code of the kernel, and so can only effect rather limited changes.","date":"Mon Aug 09 09:52:09 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@KizigeS I see absolutely no security advantages to this strangely-required configuration, even if we attempt to consider them trade-offs against the obvious privacy risks; it seems to only increase the potential attack surface, allowing targeted users to be redirected to malicious sites.","date":"Sun Aug 08 08:40:51 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@thommahoney If it helps for context at all, I work on a project--@OrchidProtocol--which is never supposed to learn anything about users... but, if you click on our privacy policy, your connection to our web server is not only possible to log but is going to be obvious to passive adversaries.","date":"Sat Aug 07 22:43:27 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@WaleedVibes I am talking about the privacy policies required of apps that are listed in the Apple App Store and the Google Play Store. The goal is ostensibly for you to know what that developer does with your data... but you can't learn that until *after* you access a URL on their server :(.","date":"Sat Aug 07 22:30:10 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"Does anyone else find it strange that both Apple and Google not only allow but in fact require privacy policies for apps to be hosted on external websites, meaning that to view an app's privacy policy you must connect to their server and already subject yourself to their logging?","date":"Sat Aug 07 22:19:44 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@DifficultNerd @runasand @andrewfordlyons @CorelliumHQ @CorelliumHQ itself is a VM--it is a service that emulates mobile devices (such as for automated testing)--and it runs \"in the cloud\" on hosted servers, so your location would already be hidden (the other side of the link would only see \"someone is accessing us using Corellium\").","date":"Mon Aug 02 23:03:18 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@mjg59 The result is that, by and large, decades after the FSF cemented its vision, people aren't feeling the \"wins\" of Free Software viscerally anymore... whether it be gcc or bash or even Linux, people are now seeing this all through the lenses of Apple and Google (or even Microsoft).","date":"Mon Aug 02 15:06:15 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@mjg59 Finally, I think the changing economic reality affecting younger generations has forced them to think more about how they can scrape out a living using their skills however they can... which makes it hard to have spare resources to allocate towards helping make a DRM-less utopia.","date":"Mon Aug 02 15:05:58 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@mjg59 Meanwhile, the audience of computer users has gone much more mainstream at the same time that seemingly everything has become networked, and so people see threats to security and privacy around them constantly... allowing these large companies to play off their DRM as \"pro-user\".","date":"Mon Aug 02 15:05:33 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@mjg59 The world we live in now is one where even most *open source* software is being made by large companies with the resources to simply avoid or replace GPL code (like clang/gcc) to run on locked down platforms (which GPL3 came too late to save, if that was even ever a possibility).","date":"Mon Aug 02 15:05:17 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@mjg59 I feel this; I don't know if I would use the term \"indictment\", though... I think the playing field has shifted enough that it is actually *more difficult* to explain how Free Software helps to someone who didn't live through the 80s and 90s... even if it is *more* important now.","date":"Mon Aug 02 14:42:21 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@XMPPwocky @mjg59 @FlexTweak I'll even note that rooting/jailbreaking phones itself is a \"losing battle\"... device \"security\" has been getting better over time, and so the quality and ability of the lightweight modifications we can do has been decreasing over time; Free Software exists to fight against this.","date":"Mon Aug 02 14:26:15 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@XMPPwocky @mjg59 @FlexTweak Frankly, though, I feel like you misunderstand the Free Software angle (and thereby the FSF)... helping people make patches to closed-source software--what I've spent my life doing (even before the iPhone, in my academic research)--is a mitigation for \"after you've lost the war\"","date":"Mon Aug 02 14:25:34 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@XMPPwocky @mjg59 FWIW, you seem to be very Android-focused, but are effectively describing the work we'd been doing in the iOS jailbreak community for a long time (including my efforts in high-level introspection: Cycript). https://t.co/VeX85l61n4 In particular, you might have enjoyed @FlexTweak?","date":"Mon Aug 02 14:25:05 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@brennanSV @gregggreg2 Finally, I actually \"cut deals\" quite often with larger vendors or for expensive products; Apple charging *more* when you make lots of money demonstrates their market power. https://t.co/xGJID6TwHh If you make a $50 IAP (a new feature soon before I gave that talk), $15 is insane.","date":"Sun Aug 01 00:06:16 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@brennanSV @gregggreg2 AFAIK, Apple does NOT handle EU VAT for their vendors: they charge the customer on top; they also will have much better rates with the credit card providers than Stripe or PayPal gives you. Also: Apple aggregates purchases across the App and iTunes Stores to make bigger receipts.","date":"Sun Aug 01 00:00:24 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@brennanSV @gregggreg2 So this was, in fact, mostly due to Cydia dealing in small receipts ($1-$5); but you are thinking of EU VAT, which I handled for vendors. FWIW, Stripe is stupid expensive, particularly below $12... PayPal offers 5%+$0.05 \"micropayments\" pricing and faster automatic bulk discount.","date":"Sat Jul 31 23:51:51 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@RudyHuyn @mspoweruser The term \"packaged\" is confusing, as the developer agreement everyone is citing says that, if your application is \"packaged as a Win32 App\", it will not support updates. Can we be more technical? Can I submit an MSI file to the Windows Store and have it update? (If not, why not?)","date":"Wed Jul 28 06:57:47 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@AltcoinPsycho I think the key thing to understand about Sentinel is that it is easy to get good usage numbers if you give your product away for free... we at @OrchidProtocol haven't been willing to do that, as we consider it to be unethical: we have an actual, working product that costs money.","date":"Wed Jul 07 17:44:36 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@mattysino While I don't think it's actually possible to defeat China's firewall over the long term--and I believe that anyone telling you otherwise is naive--you should go to Orchid's project on GitHub and file an issue: I'd love to try to make Orchid work for you, if you can help me test.","date":"Wed Jul 07 17:09:42 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@Zoro21Million @OrchidProtocol @DerekSilva (Your construction analogy is off anyway: if you wanted to hire someone to build a house, and they told you \"when it's ready\", either that should satisfy you or don't hire them? Also: Orchid is a bandwidth utility token... we *shouldn't* make forward-looking statements about it.)","date":"Sun May 30 20:32:55 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@Zoro21Million @OrchidProtocol @DerekSilva Oh, so this is actually a fascinating and oft-studied area of engineering! It sadly turns out that, unlike people building houses and bridges, software engineers almost always only ever build new things that no one has ever done before, and so everyone's estimates are always bad.","date":"Sun May 30 20:13:40 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@Zoro21Million @OrchidProtocol @DerekSilva I've never seen a crypto project actually succeed in delivering on the timelines in their roadmap \"as scheduled\"?... I would argue the very idea of timelines for software goes well past \"broken promises\" territory and enters the realm of \"blatant lies\"; Orchid tries to be honest.","date":"Sun May 30 18:06:32 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"@NguyenThanhDev @YeboahBill No, that isn't it; people get scammed by random sites that sell \"Cydia memberships\" and take a $10 \"donation\". Legal whack-a-mole on these has been slow. Anyone affected should claim charges as fraud: Cydia has never cost money, and there is no such thing as a \"Cydia membership\".","date":"Fri Mar 05 15:05:05 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"In 2016, I ran for 3rd District County Supervisor in Santa Barbara (and lost). I've been told (after) that, had I run for California State Assembly District 37, I might've had institutional support! Some days, I dream about the bills I could've floated ;P. https://t.co/kvHB4IZVzC","date":"Wed Mar 03 23:47:21 +0000 2021","user_id":"6368672"},{"handle":"saurik","text":"Cydia just joined the legal battle against Apple: \"A new lawsuit brought by one of Apple's oldest foes seeks to force the iPhone maker to allow alternatives to the App Store, the latest in a growing number of cases that aim to curb the tech giant's power.\" https://t.co/h9Zj1joPhG","date":"Thu Dec 10 17:59:59 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"For more detail, I'll highly recommend reading our complaint: \"This lawsuit seeks to open the markets for iOS app distribution and iOS app payment processing to those who wish to compete fairly with Apple, and to recover the enormous damages Apple caused.\" https://t.co/R8Zi42Quc4","date":"Thu Dec 10 17:59:59 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"@RobertBodendie6 There is no such thing as a \"Cydia Membership\": Cydia itself has always been free, and there are no plans for it to ever not be free... you were scammed by some random website; please go to your bank and report the transaction as fraud, file a claim on it... be brutal to them :/.","date":"Sun Nov 15 01:51:26 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"@HarryI0I @EonHubApp @_bplank @EonHubApp @HarryI0I @SavageNerdTech1 @DevCasp @FakeiMuseum I want to be very clear:  I am not on your side or anything... being proud of racist symbols and using slurs against peoples' gender is never OK, and such morally abhorrent behavior should *not* be tolerated :/.","date":"Sun Nov 08 09:12:24 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"@kevinsekniqi ...and if that platform is missing a market for gas prices--and say, charges a fixed 470 nanoAVAX per gas--something *even more amazing* happens: it can easily end up more expensive than today's Ethereum; if this gets fixed, the burning should work out? ;P https://t.co/x9AnZbIQeN","date":"Tue Nov 03 21:37:21 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"@albertkinng I have never worked for Apple and would not ever consider working for Apple given their stance on closed hardware and enforced centralized curation. (I also judge people poorly who work for Apple, though I appreciate some people really need a stable job and the world is complex.)","date":"Sat Oct 24 12:35:04 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"Regardless, in early September of 2020, I was able to get Facebook to reinstate the Cydia app... though they made it sound tenuous enough that I waited until now--when I'm finally feeling confident-ish--to reactivate the button, in case anyone still has reason to log in to Cydia.","date":"Sat Oct 24 12:10:33 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"In June of 2019, Facebook suspended my Cydia app, removing its access to Facebook login and locking users out of their Cydia accounts, which required a slow (on both sides: Facebook and I each were taking months to respond to the other ;P) back and forth of interrogations to fix.","date":"Sat Oct 24 12:10:32 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"@natal_female @benedictevans So, I had some more interesting sources I can't share, but you can see &gt;8% pretty easily from Pinch Media (remember: this is all back in time; I'm not saying anything about today, when it has become harder to jailbreak and there is less value to doing so). https://t.co/2WNajc68ML","date":"Thu Aug 20 01:37:50 +0000 2020","user_id":"6368672"},{"handle":"saurik","text":"@benedictevans ...and yet, for well over half of the era of the existence of the iPhone, the Apple-dystopia switch has \"de facto\" existed and worked well enough that a non-trivial number of people (~12%) turned it off... and yet, somehow, 1) the iPhone was a success and 2) the world didn't end.","date":"Wed Aug 19 20:51:54 +0000 2020","user_id":"6368672"}]