[{"handle":"shitmydadsays","text":"\"Oh he knew how bad this would look. If a man shits his pants on purpose he's trying to cover up something that smells a lot fucking worse.\"","date":"Wed May 10 00:29:36 +0000 2017","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Thoughts &amp; prayers is for when there's nothing you can do. Like the fucking space station is gonna explode. If it's on earth you can help.\"","date":"Mon Jun 13 17:02:49 +0000 2016","user_id":"62581962"},{"handle":"shitmydadsays","text":"Short piece I wrote for Father's Day about my dad, little league, and crying. http://t.co/mqzoQ5ySpy","date":"Thu Jun 12 17:23:15 +0000 2014","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Just say 'I don't know.' I'd actually prefer that to a dumb answer.\" A short essay about my dad's thoughts on death: http://t.co/UuG0HJAJFZ","date":"Tue Mar 25 16:57:52 +0000 2014","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"1st amendment doesn't protect assholes from criticism. The right to act like an asshole and be called an asshole's the same fucking right.\"","date":"Fri Dec 20 02:26:01 +0000 2013","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Honesty and being an asshole are 2 towns in the same state. As a dad, you got houses in both but you try to only vacation in assholeville.\"","date":"Sun Jun 16 20:32:51 +0000 2013","user_id":"62581962"},{"handle":"shitmydadsays","text":"My dad's been working on a novel for 40 years that's finally coming out. I asked him to tell people what it's about: http://t.co/n1o4CFTTxb","date":"Tue May 28 16:56:10 +0000 2013","user_id":"62581962"},{"handle":"shitmydadsays","text":"A short story about why my dad doesn't celebrate Valentine's day: http://t.co/RSn7RlvX","date":"Wed Feb 13 22:27:35 +0000 2013","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I like babies, just saying they live inside a host body and feed off it. That's a parasite...Yes, I could raise a tape worm and love it.\"","date":"Tue Dec 04 19:30:04 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Anyone who thinks they know what's best for 300 million people is a titanic asshole. So we're just voting for king of the assholes.\"","date":"Thu Oct 11 16:33:38 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"The 1st amendment doesn't say I have to listen to bullshit. Just 'cause farting's legal don't mean I gotta shove my nose in your asshole.\"","date":"Mon Aug 20 20:16:22 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No. You don't read news. You read stuff you agree with. Just because somebody's shit smells like yours, doesn't mean it's not still shit.\"","date":"Fri Jun 22 17:41:34 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No Father's day gifts. Just write me a card...Of course I'm kidding. Buy me shit, I created you.\" (New book out now: http://t.co/mJOlfJRZ)","date":"Thu Jun 14 20:41:21 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"We ain't a sharp species. We kill each other over arguments about what happens when you die, then fail to see the fucking irony in that.\"","date":"Mon Jun 04 17:55:50 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Any idiot can get lucky once. Takes a special idiot to get lucky twice.\" New book #ISuckAtGirls out today. An excerpt: http://t.co/e7MIjXgl","date":"Tue May 15 19:10:39 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No. Politicians don't wanna scare you, they wanna keep you stupid. Fear is just the smell when ignorance takes a shit.\"","date":"Fri May 11 17:20:02 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No. I like talking, I just hate people. If I could find other shit to talk to, I'd be all for it.\" Pre-order new book http://t.co/NMNaDkNc","date":"Tue May 01 19:48:35 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No, you can be ugly and get laid. You just gotta be willing to screw someone uglier than you.\" Pre-order new book: http://t.co/NMNaDkNc","date":"Tue Apr 24 19:06:15 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You screw without rubbers, kids happen. Sorry-you don’t get to have the dog without the dog shit.” Pre-order new book: http://t.co/NMNaDkNc","date":"Tue Apr 17 18:04:21 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No. You don't even have hair on your balls.\" Story from my new book about asking my dad to explain sex when I was 9. http://t.co/VgZA030W","date":"Thu Apr 05 16:44:47 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You're not going bald...No, I meant you're not GOING bald 'cause you're already fucking bald. Don't make me live in your fantasy land.\"","date":"Fri Mar 23 16:07:20 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Your favorite team doesn't give a fuck about you.\" A short story about my dad's thoughts on sports. http://t.co/m7a5TS1M","date":"Wed Mar 07 16:54:06 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Valentine's day is bullshit. Our DNA demands we fuck each other, so if you need a holiday to talk your wife into screwing you, it's over.\"","date":"Wed Feb 08 17:40:45 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"These candidates are dog shit. All we're doing is picking out the dick that's going to fuck us.\"","date":"Wed Jan 04 18:56:41 +0000 2012","user_id":"62581962"},{"handle":"shitmydadsays","text":"A response to my dad's question, \"What happens when they cancel a shitty TV show like yours?\" http://t.co/2HzXdGQC","date":"Tue Dec 20 18:41:52 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"My dad explains why he thinks internet comments will end the world. http://t.co/h7g0FY3F","date":"Mon Dec 05 19:01:18 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I'm in Cincinnati at a waffle house that's across from 2 waffle houses. Everyone's fat. This city is fucking hall of fame of Diabetes.\"","date":"Mon Nov 28 17:54:49 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Bullshit. War ain't over till people stop shooting. You can't say you're done taking a crap if shit's still coming out of your ass.\"","date":"Fri Oct 21 17:49:08 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"There won't be humans in 500 years. Enough people choke themselves when they jerk off we gave it a name. We ain't a species made to last.\"","date":"Wed Oct 12 17:12:41 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Bullshit. Don't pretend you don't care about your birthday. It's like watching a hooker pretend she's out for a walk when cops drive by.\"","date":"Wed Sep 14 17:24:45 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You can't come...Because it's not a vacation if my family is with me. I could vacation in my fucking house if you people left it.\"","date":"Thu Aug 11 17:45:10 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"He's nice now but he WAS an asshole. Just 'cause a piece of shit dries up and stops smelling, doesn't mean it's not still a piece of shit.\"","date":"Mon Jul 18 17:05:22 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"A short story about why my dad thinks Father's Day is bullshit. http://t.co/7dPILbP","date":"Tue Jun 14 16:24:16 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You didn't get a good deal, you were just fucked gently. Trust me, Best Buy will not be the one with the sore asshole tomorrow.\"","date":"Wed May 11 19:17:08 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"WENT through an awkward phase? What phase you think you're in now? Ever seen yourself walk up stairs? It's like a T-rex that shit himself.\"","date":"Thu Apr 07 19:53:40 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"So he likes drugs and hookers. That's the mustard & mayo on the sandwich of life. Problem is, that's all he's got on his fucking sandwich.\"","date":"Thu Mar 10 19:47:03 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I just don't wanna celebrate a bullshit holiday. I'm plenty romantic. I own a home and have never shit my pants. Two things you can't say.\"","date":"Mon Feb 14 18:09:24 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No. Aliens exist, I just don't think they came millions of light years\njust to see earth. Be like driving 1000 miles to go to an Arby's\"","date":"Tue Jan 25 18:19:56 +0000 2011","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No thanks. I don't need a party to celebrate New Year's. All I need is a bottle of bourbon and a t-shirt that hangs down passed my balls.\"","date":"Fri Dec 31 21:34:21 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Everyone thinks their opinion matters. Don't argue with a nobody. A farmer doesn't bother telling a pig his breath smells like shit.\"","date":"Thu Dec 02 17:50:34 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No. I want the salad...Live a little? I'm ordering lunch. I don't have a choice between salad or fucking skydiving.\"","date":"Thu Nov 11 20:22:20 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"Sorry, shit my dad says got hacked. My dad isn't trying to sell you a crappy lap top, I promise. Don't open any links.","date":"Wed Nov 10 03:44:17 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You don't have to be good to succeed. You just gotta be the least shitty option. Example: We're eating at The Olive Garden.\"","date":"Thu Oct 07 19:07:44 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Nervous? In 5 billion years the sun will burn out and nothing you did will matter. Feel better?\" (Show airs tonight! 830/730c CBS)","date":"Thu Sep 23 17:10:56 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You came out of your mom looking like shit. She thought you were beautiful. Don't know what scared me most, your looks or her judgment.\"","date":"Fri Sep 17 16:51:14 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Put the rake down. I don't wanna sit around watching you 'give it your best.' Either stop sucking or get the fuck out of the way.\"","date":"Mon Aug 30 16:54:22 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"See, you think I give a shit. Wrong. In fact, while you talk, I'm thinking; How can I give less of shit? That's why I look interested.\"","date":"Sat Aug 07 21:33:53 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Don’t focus on the one guy who hates you. You don’t go to the park and set your picnic down next to the only pile of dog shit.\"","date":"Mon Jun 28 16:41:21 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Engagement rings are pointless. Indians gave cows...Oh sorry, congrats on proposing. We good now? Can I finish my indian story?\"","date":"Thu Jun 17 15:35:25 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No. Humans will die out. We're weak. Dinosaurs survived on rotten flesh. You got diarrhea last week from a Wendy's.\"","date":"Wed May 26 19:10:53 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"“You seen my cell phone?...What’s it look like? Like two horses fucking. It’s a phone, son. It looks like a phone.\"","date":"Mon May 03 17:44:58 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Stop trying so hard. He doesn't like you. Jesus, don't kiss an ass if it's in the process of shitting on you.\"","date":"Tue Apr 27 00:03:37 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"“It’s Los Angeles, son. It’s the epicenter of the asshole earthquake. They’d fuck you twice if they had another dick.”","date":"Tue Apr 20 23:04:53 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Your mom just ordered 35 copies of your book. I'm not paying for one. Fucking. Copy. Mine's free.\" http://shitmydadsays.com/book","date":"Thu Apr 01 16:37:33 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I didn't say you were ugly. I said your girlfriend is better looking than you, and standing next to her, you look ugly.\"","date":"Fri Mar 26 17:57:29 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Don't ask for my opinion then. I said congrats on the car, just saying nobody's panties are getting wet from a fucking Honda Accord.\"","date":"Mon Mar 22 17:06:20 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I lost 20 pounds...How? I drank bear piss and took up fencing. How the fuck you think, son? I exercised.\"","date":"Sat Mar 06 18:41:41 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"There's a word for people like that...No, I'm saying, there's a word and I don't know what it is. I'm not being fucking poetic.\"","date":"Thu Feb 18 19:44:46 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Nah, we don't celebrate it. Don't know who St. Valentine was, don't give a shit, and doubt he wants people screwing in his memory.\"","date":"Sun Feb 14 17:40:15 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I don't get it; I sweat, I smell fine. You sweat, you smell like mule shit...Relax, she's on the treadmill next to you, she knows.\"","date":"Tue Feb 09 20:33:01 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"“Calm down. You don’t just grab a ruler and tell everyone to whip their dicks out. You stuff your crotch and keep your pants on.”","date":"Wed Jan 27 19:39:42 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No, I'm not a pessimist. At some point the world shits on everybody. Pretending it ain't shit makes you an idiot, not an optimist.\"","date":"Tue Jan 19 18:14:51 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Might not do a damn bit of good, but tell people to donate to Haiti on your twitter thing.\"  TEXT \"Haiti\" to 90999 to donate 10$","date":"Thu Jan 14 18:46:48 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No presents goddamit. I'm turning 74. I don't need you to commemorate that with a fucking Barnes and Noble gift card.\"","date":"Mon Jan 11 22:42:47 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Been thinking for a while, and I'd say there's 1.5 pounds of shit in the dog. Tried to get the vet to weigh a sack of it. No dice.\"","date":"Sat Jan 09 20:02:52 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I'm just gonna be me and they can go fuck themselves...Don't care, that's the only attitude you can have when you go to the DMV.\"","date":"Tue Jan 05 19:52:44 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Universe is 14 billion years old. Seems silly to celebrate one year. Be like having a fucking parade every time i take a piss.\"","date":"Fri Jan 01 23:10:52 +0000 2010","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Fine, let’s take a vote.  Who wants fish for dinner?...Yeah, democracy ain’t so fun when it fucks you, huh?”","date":"Sun Dec 20 20:04:37 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Mom is smarter than you...No? Well, ask yourself this; has mom ever unknowingly had toilet paper hanging out of her ass?...Mom 1. You 0\"","date":"Thu Dec 17 19:16:05 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"“The whole world is fueled by bullshit… What? The kid asked me for advice on his science fair project so I’m giving it to him.”","date":"Fri Nov 27 21:31:06 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"“We’re banned from the dog park. Well, I guess it’s okay to hump, and it’s okay to bark, but both at the same time freaks people out.\"","date":"Sat Nov 21 21:07:57 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No. Tell 'em we're not doing Christmas dinner at a casino... Don't be an ass about it, but tell them why it's a fucking stupid idea.\"","date":"Wed Nov 18 20:59:00 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I don't need more friends. You got friends and all they do is ask you to help them move. Fuck that. I'm old. I'm through moving shit.\"","date":"Mon Nov 16 19:00:46 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Remember this: you're just a lucky fucking guy. If people start telling you your dick looks bigger, remember that it's not.\"","date":"Tue Nov 10 19:22:20 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You look just like Stephen Hawking...Relax, I meant like a non-paralyzed version of him. Feel better?... Fine. Forget I said it.\"","date":"Mon Nov 09 21:36:05 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Son, no one gives a shit about all the things your cell phone does. You didn't invent it, you just bought it. Anybody can do that.\"","date":"Wed Nov 04 18:40:56 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Oh please, you practically invented lazy. People should have to call you and ask for the rights to lazy before they use it.\"","date":"Sun Nov 01 16:44:55 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"If mom calls, tell her I'm shitting... Son, marriage is about not having to lie about taking a shit.\"","date":"Mon Oct 26 17:46:10 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I need to change clothes? Wow. That's big talk coming from someone who looks like they robbed a Mervyn's.\"","date":"Sat Oct 24 20:43:29 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"The baby will talk when he talks, relax. It ain't like he knows the cure for cancer and he just ain't spitting it out.\"","date":"Thu Oct 22 16:51:31 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Just pay the parking ticket. Don't be so outraged. You're not a freedom fighter in the civil rights movement.  You double parked.\"","date":"Sun Oct 18 19:59:53 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Remember how you used to make fun of me for being bald?...No, I'm not gonna make a joke. I'll let your mirror do that.\"","date":"Wed Oct 14 16:15:50 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"That woman was sexy...Out of your league? Son. Let women figure out why they won't screw you, don't do it for them.\"","date":"Mon Oct 12 16:10:03 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Son, people will always try and fuck you. Don't waste your life planning for a fucking, just be alert when your pants are down.\"","date":"Sat Oct 10 17:41:05 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I wanted to see Detroit win. I've been there. It's like God took a shit on a parking lot. They deserve some good news.\"","date":"Thu Oct 08 16:13:22 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"We didn't have a prom. Dancing wasn't allowed...What's Footloose?...That's the plot of the movie? That sounds like a pile of shit.\"","date":"Tue Oct 06 17:57:14 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You're being fucking dramatic. You own a TV and an air mattress. That's not exactly what I'd call \"a lot to lose.\"","date":"Sun Oct 04 00:57:03 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You're like a tornado of bullshit right now. We'll talk again after your bullshit dies out over someone else's house.\"","date":"Fri Oct 02 00:08:15 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"Do these announcers ever shut the fuck up? Don't ever say stuff just because you think you should. That's the definition of an asshole.\"","date":"Sun Sep 27 18:51:20 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"A scar ain't 13 god damned stitches. I'll introduce you to men with REAL scars, then we'll all laugh at your fucking 13 stitches together.\"","date":"Sat Sep 26 17:57:33 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I'm sitting in one of those TGI Friday's places, and everyone looks like they want to shove a shotgun in their mouth.\"","date":"Thu Sep 24 21:56:36 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"You're gonna run into jerk offs. But remember, it's not the size of the asshole you worry about, it's how much shit comes out of it.\"","date":"Wed Sep 23 17:46:25 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I wouldn't worry about money...No, it has a lot to do with happiness, I just meant YOU shouldn't worry, cause you'd just piss it away.\"","date":"Tue Sep 22 16:28:36 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"No, you can not borrow my t-shirt...How about instead of standing there looking shocked, you do your fucking laundry?\"","date":"Mon Sep 21 22:30:09 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Sometimes life leaves a hundred dollar bill on your dresser, and you don't realize until later that it's because it fucked you.\"","date":"Sat Sep 19 17:38:53 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Fucking Radio Shack. It's a wonder they even know how to use a bathroom and don't just walk around all day with shit in their pants.\"","date":"Wed Sep 16 19:08:41 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Happy birthday, I didn't get you a present...Oh, mom got you one? Well, that's from me then too, unless it's shitty.\"","date":"Mon Sep 14 16:52:17 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Anytime someone sells you food in a sack, it's not a sack of food, it's a sack of shit.\"","date":"Sun Sep 13 18:29:09 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"I turn the kitchen faucet on and the shower burns you, yes, I get it...No, I'm not gonna stop, I'm just saying yes, I get that concept.\"","date":"Fri Sep 11 15:54:25 +0000 2009","user_id":"62581962"},{"handle":"shitmydadsays","text":"\"Why the fuck would I want to live to 100? I'm 73 and shit's starting to get boring. By the way, there's no money left when I go, just fyi.\"","date":"Thu Sep 10 21:58:31 +0000 2009","user_id":"62581962"}]