[{"handle":"timoreilly","text":"@ProfPaulPoast 1838...","date":"Sat Jun 25 02:06:53 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@farnamstreet The Way of Life According to Lao Tzu (Tao Te Ching translated by Witter Bynner)","date":"Sat Jun 18 17:35:33 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@hankgreen The other highly location-specific foods, such that each location and producer gets a name (albeit with some commodity exceptions), are cheese and beer. All three are fermented products. Look not to the pasture but to the bacterium and the mold for thy answer.","date":"Mon Jun 13 13:48:45 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Very interesting post on the balance between growth and cash flow, and how that influences the strategy of tech businesses.","date":"Sun Jun 12 15:00:12 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@ProfEmilyOster I'm sorry not just for your loss, but for our loss - the loss of all who never got to experience her. \"Yeah, the math is right, but I don’t hear the music,\" is about as powerful a statement as I've ever heard! Fortunately, she lives on in you. It's not the same, but still a gift.","date":"Sat Jun 11 22:13:57 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@EricaJoy The @longnow foundation asked this question of a bunch of people some years back, and got some great answers. https://t.co/mFtqjmxujT","date":"Mon Jun 06 12:19:07 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I would add that data storytelling is also incredibly satisfying. Like actual storytelling, it’s an exploratory process of figuring out what matters and how to highlight it. https://t.co/js7Tud7nYL","date":"Tue May 24 20:11:21 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I agree. @kevin2kelly has been places the rest of us will never get to see, except through his eyes. Even that glimpse is a treasure.","date":"Tue May 24 19:02:28 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@michael_nielsen @mickeykats Also go to the Salvador Dali House Museum in Cadaques. And there's an amazing restaurant down by the water right below it. The lunch I had there was one of the best of my life.","date":"Fri May 13 03:16:04 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@DecaroliChiara @michael_nielsen La Sagrada Familia is probably the greatest Cathedral on earth. Much as I love Notre Dame and Sainte Chapelle, it may be even better.","date":"Fri May 13 03:14:06 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@bustin_atoms @michael_nielsen The Titan Missile Museum in Green Valley, Arizona is astonishing. A fabulous private museum. A trip back to the depths of the Cold War.","date":"Fri May 13 03:12:25 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@michael_nielsen @visakanv I loved Selinunte in Sicily. Acres and acres of tumbled temples that you can still clamber over. And the quarries and the old fort in Siracusa are also amazing. And don't miss Delphi! Or Mycenae.","date":"Fri May 13 03:11:13 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@michael_nielsen @visakanv Stonehenge does a good job of making it possible to visit without feeling overwhelmed by all the people. That being said, nothing like climbing on the stones when I was five years old! Angkor Wat was definitely touristy. Ta Prohm, the so-called Tomb Raider temple, was way cooler","date":"Fri May 13 03:09:02 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@macbryla No. Not surprised but disappointed, because it demonstrates how badly self-interest has overcome Amazon's one time focus on the user.","date":"Mon May 09 17:32:52 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Every time Alexa makes a suggestion to me or tries to get me to subscribe to Amazon music, I am one step closer to abandoning it. I want the service to do what I ask it to do, not what Amazon wants it to do.","date":"Mon May 09 02:35:08 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Utterly fascinating. There are indeed aliens among us. And someone or other said, the world is still full of mysteries just waiting for us to discover. It is even more true on a personal level. Someone has known this, but how great is it to learn something new every day?","date":"Sat May 07 15:32:36 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I was so happy to be able to work with @IlanStrauss on our analysis of why Big Tech needs more disclosure as the first step towards better regulation. It's really important stuff.","date":"Sun May 01 16:29:48 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I very much agree with this critique.","date":"Tue Apr 26 00:04:30 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@brigleb can you send me details? You should be able to find my email.","date":"Sun Apr 24 20:16:02 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@chrismichel Lofoten?","date":"Mon Apr 18 01:41:32 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"An extraordinarily lucid and compelling account of the interconnectedness of global financial systems. Could a plunging Japanese Yen upset the US Treasury market? by @adam_tooze https://t.co/duBd0UeSNZ","date":"Sun Apr 17 20:49:00 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@paulkrugman @GreatDismal In that regard there is no better encomium than the extended passage in Les Misérables in which Victor Hugo explains why \"Merde\" is the noblest word in the French language.","date":"Sat Apr 16 22:11:34 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@monicabyrne13 I don't remember them well, but many years ago, I did love the novels of Charles Williams, another of the Inklings.","date":"Sat Apr 16 22:10:05 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@runemadsen @OReillyMedia @odewahn @LauraABaldwin @ITP_NYU Congratulations, Rune!","date":"Sat Apr 16 22:08:15 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"This is not likely to be the last of many victories for @carlmalamud and @public.resource.org. The man has so much will and persistence, and not only that, he’s right.","date":"Mon Mar 28 20:15:00 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"\"I’m a pessimist because of intelligence, but an optimist because of will.\"  Antonio Gramsci in a Letter from Prison (December 1929). Via my friend Andy Shapiro, who used the quote in the context of climate change, and added “May our will be strong!\"","date":"Mon Mar 28 19:22:09 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Absolutely brilliant piece about the blind spots in our society. Why does framed in the context of Putin and Ukraine, it has so much wider applicability to our general inability to imagine a future very different from the past. A must read/must listen https://t.co/vBvKEaNQYt","date":"Fri Mar 18 20:40:14 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@Robert_A_Wolfe @smdiehl I agree that killer use cases don’t have to be consumer oriented. But in the case of the early internet, they were.","date":"Fri Mar 18 19:18:40 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Does anyone know when iTunes started requiring an iTunes Store login to open? Thinking about how this is a kind of user lock-in via data enclosure, and I’d love to find documentation on Apple's evolution from a user-controlled system for music to an Apple-controlled one","date":"Fri Mar 18 18:16:19 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@danablankenhorn @smdiehl Actually, I loved gopher!","date":"Fri Mar 18 04:57:53 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@teacurran @Robert_A_Wolfe @smdiehl True enough. But AOL was a dial-up phenomenon, not an internet phenomenon.","date":"Thu Mar 17 00:59:41 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@Robert_A_Wolfe @smdiehl Of course it was. But it did not get massive amounts of investment until the web came along as its killer app. And it was around for a long time before that. My point is that #Web3 is as if the big investment dollars had come during the era of FTP and telnet.","date":"Thu Mar 17 00:58:41 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@Robert_A_Wolfe @smdiehl Of course it was. But you didn't have the explosion of consumer use cases until the web came along. That's when the VC money came in. In the case of #web3, the money arrived before the innovators discovered the opportunities.","date":"Wed Mar 16 15:57:19 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@smdiehl That being said, technology does progress in layers. The internet was in its late teens when the World Wide Web was introduced. That was its first true killer app. So counting from the very beginning is probably not fair.","date":"Wed Mar 16 14:25:25 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"This makes a lot of sense to me.","date":"Sat Mar 12 14:34:39 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@EconTalker @tylercowen Another great person to talk with about this is George Saunders! His book A Swim in a Pond in the Rain is a master class not just on how to read short stories, but how to read anything (not to mention how to write!)","date":"Wed Mar 09 14:23:03 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Great, forward-looking post from @LauraABaldwin @oreillymedia about continued challenges for women in today’s workforce. One tidbit: \"A four-day workweek complicates your business model without generating the solutions women need to be successful at work.” https://t.co/JX8nHNh50M","date":"Tue Mar 08 18:56:44 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"No sh*t, Sherlock. \"Putin’s information war got key assist from Trump and right-wing media\" https://t.co/cvabJh5TWf","date":"Sun Mar 06 17:39:02 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I wish @JoeBiden had given us the modern equivalent of this speech as his #SOTU: https://t.co/KhEux6SmSX","date":"Fri Mar 04 19:59:31 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I’ve wanted to know how much crypto is being used in the operating economy. This @nberpubs paper attempts to answer that question for Bitcoin at least. https://t.co/vExpE0ah7R","date":"Fri Mar 04 16:28:19 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Me too!","date":"Fri Mar 04 03:16:32 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@longnow Sorry I couldn’t be there in person. I was planning on it, but got a bad cold, and didn’t want to be sneezing on everyone.","date":"Thu Mar 03 03:47:53 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"This is really brilliant, and so important. It’s open to the public too. I thought it was members only, but it isn’t. You should watch from the beginning. #ClimateCrisis","date":"Thu Mar 03 03:35:47 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Very interesting 🧵: #DeFi as shadow banking 2.0.","date":"Wed Mar 02 17:05:57 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@pierrelegrain @blm849 @OReillyMedia Just disabled bitly as my link shortening agent. See if this one works. https://t.co/wWKERiw7yh","date":"Mon Feb 28 19:12:06 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@pierrelegrain @blm849 @OReillyMedia Yeah, I think it’s Tweetdeck’s rewrites of the links that don’t work.","date":"Mon Feb 28 19:10:21 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Great suggestion from @billmckibben: use the defense production act to ramp up heat pump production, and send them to Europe to reduce reliance on Russian gas https://t.co/HQwP7ilFpF","date":"Mon Feb 28 18:20:00 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"A refreshing look at a new economics curriculum: \"an informal rule among publishers that no more than fifteen per cent of the material in a new textbook should deviate from the dominant ones... the figure for core is closer to seventy per cent.” https://t.co/j5M2y7oxtT","date":"Sat Feb 26 20:24:12 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I found this fascinating! A more nuanced take on past economic growth, through the lens of rise and fall of urbanization. https://t.co/qMjHL9YMaX","date":"Fri Feb 25 20:36:56 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@waldojaquith Barry's green box is also pretty good. But I agree. Yorkshire is our go-to.","date":"Thu Feb 24 00:57:05 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@drvolts See @cwarzel \"The Absurdity is the Point\" https://t.co/eiOYv0dsWx","date":"Sun Feb 20 23:19:36 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Eye-opening backgrounder on the big thinker behind China’s new cultural revolution, big tech crackdown, Belt &amp; Road Initiative, and more. https://t.co/6dEMDGfSyd","date":"Sun Feb 20 15:08:00 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I particularly like the discussion here about climate, and how the intangible economy could lead to a less energy-intensive form of growth. We’ve been having a number of discussions on this topic at #socscifoo this weekend.","date":"Sun Feb 20 14:21:00 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Excellent perspective on #web3 from the POV of a wikipedian explaining (among other things) why DAOs need to grok how hard it is to build and manage a community https://t.co/EpNxvWcQbw","date":"Sun Feb 20 12:44:24 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"If you want to read only one thread that outlines the core arguments of David Rosenthal’s critique of #web3, it should be this one. (Of course, do also read the transcript and look at the slides from Rosenthal’s brilliant talk, linked in the thread.","date":"Tue Feb 15 16:21:31 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"5/ VCs are pouring money into cryptocurrency and \"web3\" companies. This money is not going to build systems with low barriers to entry and thus low margins. Thus the systems that will result from this flood of money will not be decentralized, no matter what the sales pitch says.\"","date":"Tue Feb 15 12:07:22 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"1/ Loved this talk by David Rosenthal. He comes to much the same conclusions as I do about the failed promises of decentralization via #Web3, but through analysis of the technology. But he also marshals economic arguments. One gem in thread below. \nhttps://t.co/usmAB4FuQb","date":"Tue Feb 15 12:07:21 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"2/ \"Don't get me wrong. I am not a fan of centralization. I started building a decentralized, permissionless system almost a quarter-century ago. It would be wonderful if we could figure out how to build a Web that would resist centralization.","date":"Tue Feb 15 12:07:21 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"4/ \"Right now, there is way too much money. If a system is to be decentralized, it has to have a low barrier to entry. If it has a low barrier to entry, competition will ensure it has low margins. Low margin businesses don't attract venture capital.","date":"Tue Feb 15 12:07:21 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"3/ But all the technical and financial cleverness that's been poured into cryptocurrencies hasn't succeeded in doing that. Why? It is because It Isn't About The Technology.\"\n\nhttps://t.co/1MkvPCiWsv","date":"Tue Feb 15 12:07:21 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Well worth reading, on the fear of war in Ukraine and  on inflation, by @Noahpinion https://t.co/gBcLxoL2Zb","date":"Mon Feb 14 16:52:37 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Useful insights about technology trends from usage and search on the @OReillyMedia online learning platform https://t.co/Wy0JO1YbfY","date":"Mon Feb 14 16:20:09 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I really enjoyed this interview. We covered a lot of ground.","date":"Fri Feb 11 17:58:00 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Eye-opening indeed, and a good reminder to turn everything over to question your received knowledge, which often turns out to be bias or noise. Via @adam_tooze's marvelous Chartbook newsletter.","date":"Thu Feb 10 17:26:23 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"An important insight from @izakaminska here! A framing idea like this doesn't just open your eyes about the immediate subject; it gives you a new tool for thinking about what Izabella calls @theblindsp0t https://t.co/ceAwJrCi18","date":"Wed Feb 09 21:48:56 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Logistics matters.","date":"Wed Feb 09 03:56:23 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Burned oil on the lid of a popcorn pot.  Photo doesn't do it justice. #somethingbeautiful https://t.co/rpfAwG2yCJ","date":"Wed Feb 09 00:09:41 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"At what @stewartbrand calls the infrastructure pace layer, only some things are possible, and understanding what is possible should inform policy (and informs @d_khrennikova's brilliant political reporting!).","date":"Tue Feb 08 14:37:33 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Very proud of my son-in-law @GriffithSaul's work on climate. “If you’re thinking about how do you make the world move faster, someone needs to go first on showing what’s possible. Because then you’ve got a success story that people can be drawn to.” https://t.co/qcnQKTcpt2","date":"Sat Feb 05 03:57:13 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Really nice to see #web3 reporting that talks about actual adoption and usage rather than just valuation! About time. https://t.co/7YatFjqDFf","date":"Wed Feb 02 21:29:15 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"A very interesting take on why it is hard to fund breakthrough research. Worth thinking about and finding ways to do better.","date":"Tue Feb 01 22:27:13 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"\"A major reason why Big Tech firms have achieved such scale and become the gatekeepers to entire markets is that they have been able to obscure most of their financial and operating data. There are obvious steps that regulators can take…” \nhttps://t.co/I27gM7aSpC","date":"Mon Jan 31 22:52:37 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"\"One of the grand challenges in addressing climate change is getting from global pledges to national programs to local outcomes.” https://t.co/CEm2zjByFO","date":"Sun Jan 30 18:46:48 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"This is a fascinating thread. Well worth reading? Why did the 1945-1975 experiment, which produced such broad based prosperity, give way to neoliberalism, which created such wealth disparities? And why has neoliberalism been so sticky, despite its evident failures?","date":"Thu Jan 27 18:29:45 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@qhardy Just to be clear, that's actually @VitalikButerin speaking. Not me putting words into his mouth (as I also do with the speakers in my imagined conversation.)","date":"Thu Jan 27 01:23:43 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@swelljoe It was just that I pulled the trigger on posting too soon, when it hadn’t been put outside the firewall.","date":"Thu Jan 27 01:06:35 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"My latest thoughts about NFTs and what they tell us about the changing shape of the economy, and the ever-moving “value boundary.” Take 2, this time with a working link (the same one, but now outside the firewall.) https://t.co/iXfUaDhIe8","date":"Wed Jan 26 21:43:08 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"OK. Now this should be working.","date":"Wed Jan 26 21:42:23 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Oops! It appears I tweeted too soon. The article was not available outside O'Reilly yet.","date":"Wed Jan 26 20:47:23 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"A great overview and introduction to the application of AI and machine learning to macroeconomics. https://t.co/AcZzkrbQ1G","date":"Wed Jan 26 20:44:47 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"My latest thoughts about NFTs and what they tell us about the changing shape of the economy, and the ever-moving “value boundary.” https://t.co/6YwDZvi9sx","date":"Wed Jan 26 20:20:30 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"This is the most thought-expanding take on NFTs that I've seen. The history of ownership embodied in the link makes for a new kind of community value. via @mikeloukides in email.","date":"Mon Jan 24 18:19:05 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Good example of materials science innovation making is way into consumer products. https://t.co/7HVSBBQVDX","date":"Thu Jan 20 23:42:06 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@DKThomp \"It would channel the right’s fixation with national greatness to grow the things that actually make a nation great—such as clean and safe spaces, excellent government services, fantastic living conditions, and broadly shared wealth.\"","date":"Tue Jan 18 17:44:45 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@DKThomp \"It would tap into libertarians’ obsession with regulation to identify places where bad rules are getting in the way of the common good.”","date":"Tue Jan 18 17:44:32 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@DKThomp The abundance agenda \"would harness the left’s emphasis on human welfare, but it would encourage the progressive movement to 'take innovation as seriously as it takes affordability,' as Ezra Klein wrote.\"","date":"Tue Jan 18 17:44:02 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Instead of choosing abundance, we’ve chosen scarcity. The backups at our ports, or the lack of covid testing capacity, didn’t just happen. They are the result of bad choices we’ve made as a society. We need an abundance agenda, writes @DKThomp https://t.co/hGgK2427zj","date":"Tue Jan 18 17:38:27 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"I do wish this piece were public. I'd put it in my Next Economy newsletter!","date":"Tue Jan 18 01:05:41 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Really enjoyed this piece by @Noahpinion.  It's for subscribers only, but it's a good example of why his substack is a worthwhile subscription. https://t.co/Kvi7xpDbTH","date":"Tue Jan 18 01:02:39 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"“Bad times, hard times, this is what people keep saying. But let us live well, and times shall be good. We are the times: such as we are, such are the times.” Wonderful quote from St. Augustine (354-430 AD), from my brother Frank’s family Christmas card. A thought to remember!","date":"Sat Jan 15 23:33:44 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@econ_martens @IlanStrauss @TBourveau @sheguoman @alminas @MazzucatoM @jryancollins Disclosures could be half as long and contain 10 times as much information. Most of it is obfuscation.  Compare the 10K of a company like Garmin, which does very clear segment disclosures,  with those of Alphabet or Apple.","date":"Thu Jan 13 16:00:33 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Nice #web3 take from @RanaForoohar.  https://t.co/0MnzQh7RdC","date":"Tue Jan 11 03:04:47 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@jstogdill Lol!  I love that, Jim!","date":"Tue Jan 11 00:51:44 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Additional political (not technical) perspective on #Web3","date":"Sun Jan 09 17:03:35 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Epic: \"even if this is just the beginning (and it very well might be!), I’m not sure we should consider that any consolation. I think the opposite might be true; ... we should take notice that from the very beginning, these technologies immediately tended towards centralization\"","date":"Sun Jan 09 01:37:16 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"Brilliant essay by @billjaneway on the perils of the current moment in bubble investing, and how to navigate them. \"There'll be time enough for countin', When the dealin's done.\" https://t.co/iE2HBu4rvW","date":"Sat Jan 08 17:19:49 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@simongerman600 What happened to Constantinople and the Eastern Empire?","date":"Wed Jan 05 18:06:47 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"\"There is a range of often goofy-sounding threats to humanity that don’t track well onto our partisan cleavages or culture war battles other than that addressing them invariably involves some form of concerted action that conservatives tend to disparage.\"\nhttps://t.co/76grgv5P1v","date":"Tue Jan 04 20:15:29 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@emdashry @Ada_Palmer I do wish somebody would create a companion to @Ada_Palmer like the Dorothy Dunnett companion.  The books are so erudite, with such deep backlinks that you could spend weeks researching to understand them more deeply.  Speaking of @DunnettCentral, start with The Game of Kings!","date":"Mon Jan 03 18:16:24 +0000 2022","user_id":"2384071"},{"handle":"timoreilly","text":"@emdashry The science fiction that stretched my head the most in the past couple of years is @Ada_Palmer's  four book Terra Ignota series starting with Too Like the Lightning. Her historical essays collected on her Ex Urbe blog are also amazing and will give an on ramp to how she thinks","date":"Mon Jan 03 18:13:11 +0000 2022","user_id":"2384071"}]