[{"handle":"yokoono","text":"Make sure that you know that your rage is only to yourself, feeling helpless in this situation. Your are not helpless.","date":"Sun Jun 26 17:00:18 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Don't act like a person who is angry because the leaders of the world betrayed you. They did not betray you. They did not know that you were thinking differently from them. And if they knew, they would still follow their insticts, I'm sure.","date":"Sat Jun 25 17:00:17 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"We have been born in this particular time so we will need to open our super wisdom to go through this time of darkness. And we will.","date":"Fri Jun 24 17:01:07 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"You can carry thoughts with real meaning wherever you are and whatever you are working on.","date":"Thu Jun 23 17:00:00 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Keep doing things you are inspired to do. It all helps.","date":"Wed Jun 22 17:00:55 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Be Peaceful yourself, if you want peace. Peace does not come easily to a violent soul.","date":"Tue Jun 21 17:00:17 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"By making your life a life of love and peace, you will be adding something very important to the world.","date":"Mon Jun 20 17:01:14 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"We will obtain world peace. Yes, we will. Believe it.","date":"Sun Jun 19 17:00:19 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Change will happen. Don't try to change the world. Change your head. World peace will instantly reign over us as we change our heads. And it will be done. We don't even have to lift our fingers. We just use our wits, which is all we have.","date":"Sat Jun 18 17:00:07 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Dear Paul, Happy 80th Birthday and many, many more! From a partner in Peace... love, yoko\n\n#HappyBirthdayPaulMcCartney https://t.co/c9YkeR8CMt","date":"Sat Jun 18 09:01:15 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Sometimes it takes a frightening situation to make us realize we really want Peace - and fast.","date":"Fri Jun 17 17:01:11 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Give your children love and understanding so they can and will take care of themselves whatever the future may bring.","date":"Thu Jun 16 17:00:06 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"You are not lost. Listen. You will hear the struggle and pain of others. Send them love in your mind.","date":"Wed Jun 15 17:01:24 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Start your day in a positive way by counting your blessings","date":"Tue Jun 14 17:01:15 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Send good thoughts every day. Change your heads, not the world.","date":"Mon Jun 13 17:00:47 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"It is a waste of time to think \"what if…?\" Stand where you are now and allow the future to come into you.","date":"Sun Jun 12 17:00:15 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Are you allowing yourself to be surpressed? Shake it off in your mind. That's all you have to do. And the picture will change immediately.","date":"Sat Jun 11 17:00:17 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"When I wake up, I look around what I see and think how blessed I am. You, too. We are all blessed. Let's make the best of it.","date":"Fri Jun 10 17:00:18 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Happiness and success are all in our minds. You can be happy just looking at a beautiful sky. You can think you were successful when you baked a great loaf of bread.","date":"Thu Jun 09 17:01:17 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"We should have more stuff that we can't figure out. Mystery gives us some fun.","date":"Wed Jun 08 17:01:01 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Love is the only energy we can rely on. And all of us have known it since birth, because it is the only energy and protection that kept us going. Breathing is one of the ways we give ourselves that energy, and give others too.","date":"Tue Jun 07 17:00:00 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"When you have peace in your mind, you will get peace. If just enough people are really peaceful, we will get peace of togetherness. We're getting there!","date":"Mon Jun 06 17:00:14 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"When will we be at peace, and is there a possibility there will ever be peace?","date":"Sun Jun 05 17:00:19 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Don't miss anything you bump into. It will give you insights into life.","date":"Sat Jun 04 17:00:30 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Our heads are the source to think how to get peace. Our hearts are the source of courage to act.","date":"Fri Jun 03 17:00:00 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"You have to be peaceful to get peace. If you are angry and combative, well, that is not going to help. Please send out the strongest energy of love, peace and belief to the world. We will still be too late to save some lives. But we don't have much option.","date":"Thu Jun 02 17:00:16 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"https://t.co/oL9ok8JS0P","date":"Thu Jun 02 07:13:45 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"All we are saying is Give Peace A Chance.\nhttps://t.co/YeMKsqgMTi","date":"Wed Jun 01 22:34:01 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Negative thinking blocks, delays and slows down World Peace, Harmony and Love.","date":"Wed Jun 01 17:00:00 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Fall is when my mind becomes sharper. Winter is when it becomes easier to be more introspective. Spring is when I become totally aware of my love for everything in life. Summer is when I notice my daring energy &amp; use it. All seasons are beautiful but different for each one of us.","date":"Tue May 31 17:00:08 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Make sure you keep your head straight. Believe in yourself that if you want to stay sane, you will.","date":"Mon May 30 17:00:15 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Keep on spreading Peace without fear.","date":"Sun May 29 17:00:25 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"With being creative in giving, loving and thanking every day, you will be so busy, pretty soon you will forget about holding pain. I hope so. Be successful. You deserve it! Love, yoko","date":"Sat May 28 17:00:29 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Your brain is the thing that is creating your pain. I think your body is telling you that you are not thinking and doing things other than focusing on your pain.","date":"Fri May 27 17:02:04 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Alan White was a wonderful drummer who was an essential part of the sound of ‘Imagine’, ‘Instant Karma!’ &amp; more recordings. He was always gentle, kind &amp; good humoured. We were blessed he was part of our family. \nLove &amp; condolences to Gigi, Jesse &amp; Cassi White; JJ, Ellie &amp; Andrea. https://t.co/yrNFh0PQmy","date":"Thu May 26 23:12:47 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Thank a person when they open the door for you. That's all it takes.","date":"Thu May 26 17:00:48 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Love yourself for bravely sustaining your life for so many years.","date":"Wed May 25 17:00:04 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Don't wait for the moment for you to give in a big way. Just give a smile.","date":"Tue May 24 17:00:49 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Concentrate your mind on giving, loving, and thanking. Each time you give, you are in less pain. Give as much as you can. Find something you can love. Love as much as you can. Thank as much as you can.","date":"Mon May 23 17:00:07 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"We all have negative and positive things about ourselves. Pain is definitely negative. But you can change that pretty quickly.","date":"Sun May 22 17:00:48 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Water is a kind friend. It eliminates your pain as much as possible. A bath is more effective for that than a shower.","date":"Sat May 21 17:00:27 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"To deal with anger, just say: \"I love you, I forgive you, I accept you unconditionally.\" You are saying this to yourself. Keep saying it until you had enough.","date":"Fri May 20 17:00:01 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"We should think in terms of the big picture. Then we will know that every little action we take with good intention does help the world.","date":"Thu May 19 17:00:45 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Happy Birthday Olivia!\nlots of love, yoko https://t.co/Eeo9HwLHBX","date":"Wed May 18 22:00:07 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Don't think you have to balance life. Just enjoy life and life will balance itself.","date":"Wed May 18 17:00:16 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"There are more people than politicians. Each one of us has the power to convince the world if we believe in ourselves. We'll make it.","date":"Tue May 17 17:01:01 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"I carry sad and delightful memories, which gives me wisdom and power.","date":"Mon May 16 17:07:11 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"I kept glancing the mirror to see if I was in peace. I was. In the end, I realized that I had given myself a peaceful day, even though the newspapers were reporting violence after violence in the world.","date":"Sun May 15 17:00:27 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Open your ears wide, and you will hear the new generation spreading peace.","date":"Sat May 14 17:00:58 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Look at your mirror every day. You are the most interesting person to yourself. Your thoughts are what is most important to you. Just remember that.","date":"Fri May 13 17:00:58 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"You should know that life is lonely. You come out alone and you go out alone. If you know that, it will get better. Some people will love you and some won't. That's life. If you know that, it's a pretty good life.","date":"Thu May 12 17:00:20 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Look yourself in the mirror and tell yourself that you really don't like violence. You don't get excited watching violent films or reading about violent incidents in the newspaper. Start with that. Start being non-violent yourself. And you will make a difference in the world.","date":"Wed May 11 17:00:41 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"If you have a good feeling about something… that’s love. From the time I am up in the morning to late night when I go to sleep, I feel love for most everything I see. Artists are all like that. But still I’m a lucky girl!","date":"Tue May 10 17:00:23 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"https://t.co/bCxbWsQniL","date":"Tue May 10 08:02:51 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"I have love for all things that are beautiful to me. Every day, every moment their beauty excites me and makes me feel thankful and alive.","date":"Mon May 09 17:00:08 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Today is Mother's Day in the USA and many countries all over the world. Let’s fill Twitter with thousands of tributes to our Mothers - the love that nurtures us all - using the hashtag #mymommyisbeautiful.\n\nFind out more at https://t.co/ujHfoqH7rh\n#MothersDay #MothersDay2022 #Mom","date":"Sun May 08 17:18:05 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Dick Cavett is a very sensitive, quick minded and intelligent person. So John and I got along with him very well. We may bump into each other in the future. But we know each other so well, we don’t have to meet up or anything. I cherish the meetings we had.","date":"Sun May 08 17:00:17 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Don't be a slave to your old dreams. Just move on and see what dreams will come to you.","date":"Sat May 07 17:00:39 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Shake off your struggle. Then you will be lighter, and will know where to go.","date":"Fri May 06 17:00:35 +0000 2022","user_id":"17681513"},{"handle":"yokoono","text":"Love is like the waves in the ocean. Sometimes it's calm, and sometimes it's a tsunami. You should know that and love life with caution, just like you love the ocean carefully.","date":"Thu May 05 17:01:08 +0000 2022","user_id":"17681513"}]