[{"handle":"BobbyScott","text":"Today, @HouseDemocrats passed the #LowerFoodAndFuelCostsAct which will:\n✅ Lower fertilizer costs to lower food prices \n✅ Lower meat &amp; poultry costs by increasing meatpacking competition &amp; capacity\n✅ Lower gas prices by making cheaper, cleaner Unleaded 88 more available https://t.co/M9oOxlJOWr","date":"Thu Jun 16 18:06:10 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Enjoyed catching up with Hampton Mayor @DonnieTuck, who was in Washington for the @floodcoalition’s Mayors Summit on Flooding and Sea Level Rise. Our region is on the frontlines of this crisis and I appreciate Mayor Tuck’s work on this issue. https://t.co/PkXO90u9Vq","date":"Wed Jun 15 20:27:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, the House is considering #HR2543, the Financial Services Racial Equity, Inclusion, &amp; Economic Justice Act —a #RacialJusticePackage that will:\n \n⬇️ Help reduce costs\n💼 Create jobs\n📈 Strengthen our economy https://t.co/AQRmpcF8Fa","date":"Wed Jun 15 19:20:00 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I'm still waiting...","date":"Tue Jun 14 15:53:39 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Tune in below as @SecMartyWalsh testifies before @EdLaborCmte.","date":"Tue Jun 14 14:57:08 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Gas prices are driving inflation as Big Oil looks to profit from the #PutinPriceHike by price gouging families. That's why @HouseDemocrats passed the Consumer Fuel Price Gouging Prevention Act to lower costs at the pump. Every Republican voted against it. \nhttps://t.co/NVUrot8tCN","date":"Tue Jun 14 14:10:51 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Last night I went to @philippinesusa and celebrated the 124th anniversary of Philippine independence and the 76th anniversary of diplomatic relations with the U.S. I am proud to be the only Member of Congress of Filipino descent that is currently serving. #124thPHindependenceday https://t.co/yxp5TOe6YT","date":"Tue Jun 14 13:54:53 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to @LizShuler and @STRedmond on your historic election. Liz has been a strong advocate for working families across America her entire life. I look forward to working alongside you. #1U","date":"Mon Jun 13 19:47:36 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"There is no Republican plan to reduce the global inflation problem. However, Republicans have released plans to raise taxes on middle class families and sunset Medicare and Social Security.","date":"Mon Jun 13 17:33:15 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing @KennyAlexander and Pastor Mark Byrd at the Dedication Ceremony for New Life Metropolitan Community Church today https://t.co/zs8uCyBbOZ","date":"Sun Jun 12 21:26:12 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Celebrated Philippine Independence Day with members of the Norfolk Sister City Association https://t.co/eW62XalyBZ","date":"Sun Jun 12 19:23:22 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulated Dr. William Harvey on a successful career as President of @_HamptonU during his Retirement Gala this evening https://t.co/MQoMZINe9k","date":"Sun Jun 12 01:29:49 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s report offers the latest evidence that labor unions are workers’ best tool to access higher wages, better benefits, and safer workplaces. The Senate must pass the #PROAct.","date":"Fri Jun 10 19:10:34 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Our democracy remains endangered by those who attack the rule of law &amp; lie about the 2020 election. I look forward to the bipartisan @January6thCmte sharing their findings w/ the American people as well as their recommendations to ensure nothing like #January6th happens again.","date":"Thu Jun 09 22:30:18 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Same.","date":"Thu Jun 09 21:01:04 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"People can visit https://t.co/OzQxwgjbur if they have questions on what the Biden Administration is doing to end the baby formula shortage. If families need additional resources they should follow this link: https://t.co/mMDxBhycb2","date":"Thu Jun 09 17:46:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Working families are getting squeezed at the pump by the pandemic and the #PutinPriceHike. House Democrats passed the Consumer Fuel Price Gouging Prevention Act to prevent Big Oil from price gouging consumers. Zero Republicans voted for it. \nhttps://t.co/y2FnQ8RjaC","date":"Thu Jun 09 15:32:07 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS and Congressional Democrats are overseeing strong economic growth which has reduced the deficit by $1.6T from last year which is the largest decline in history. \n\nReducing the deficit helps us tackle inflation and cut costs for families.","date":"Thu Jun 09 15:09:48 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This comprehensive gun safety package will help save lives if enacted and is in addition to what the House passed last year to ensure universal background checks and to close the so-called Charleston loophole.","date":"Thu Jun 09 00:34:42 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Gun violence is now the leading cause of death of children in the U.S. Instead of just offering thoughts and prayers, I was proud to take action again today and vote to pass the #ProtectingOurKidsAct, but I was disappointed to only see five House Republicans vote for the bill.","date":"Thu Jun 09 00:34:21 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Children live in fear, wondering if their classroom will be next. Firearms were the leading cause of death for American children in 2020. Enough is enough. It is time to act and pass the #ProtectingOurKidsAct. https://t.co/74WWLhwJPk","date":"Wed Jun 08 18:45:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Enough is enough. It is time to act to keep our kids and our communities safe. #EndGunViolence","date":"Wed Jun 08 13:03:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It was nice to see Reverend Jerome Barber and President William R. Harvey this evening as I gave greetings during the Opening Session of the 108th Annual @_HamptonU Ministers’ Conference https://t.co/SM09s5oqZ8","date":"Tue Jun 07 01:45:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS' Operation Fly Formula is getting more formula on the shelves for American families. More information on what the Biden Administration is doing to address the infant formula shortage can be found at https://t.co/OzQxwgjbur","date":"Mon Jun 06 20:44:53 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This is unacceptable and I refuse to accept this as the status quo. @HouseDemocrats will take further action this week to keep our communities safe and #EndGunViolence. \nhttps://t.co/ACfQtljkdH","date":"Mon Jun 06 19:15:54 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Inflation is a global problem but since we enacted @POTUS' American Rescue Plan, the U.S. economy is recovering faster and stronger than other developed nations.","date":"Mon Jun 06 18:48:08 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today marks the 78th anniversary of #DDay when Allied forces stormed the beaches of Normandy. We remember all those who sacrificed that day to defend democracy and fight authoritarianism. https://t.co/p0jofVzgXU","date":"Mon Jun 06 17:18:36 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Celebrated #PrideMonth with elected officials and festival goers at the City of Portsmouth’s first Pride Festival #Pride2022 https://t.co/mzclJNFCal","date":"Sat Jun 04 23:59:31 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to the students who received scholarships at the Antoine Bethea and Bethea Family Foundation Scholarship Ceremony https://t.co/NXcFiFv2WZ","date":"Sat Jun 04 22:46:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Remembered the victims and survivors of gun violence during the Peninsula Area @MomsDemand Wear Orange Picnic. We must do better to end gun violence. https://t.co/3glzxK2Vnu","date":"Sat Jun 04 20:15:21 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the 900 Men Strong Scholarship and Community Service Awards this morning. Congratulations to all the students and award winners https://t.co/Bja2KGjxkL","date":"Sat Jun 04 17:39:49 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time catching up with  Father George Chioros, @sdncherry1,  @councilwomans, and festival attendees at the Annual Newport News Greek Festival - Spring Edition, sponsored by the Saints Constantine and Helen Greek Orthodox Church https://t.co/0knMOkeXwJ","date":"Fri Jun 03 23:26:32 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"#JobsDay: Today’s jobs data shows continued economic progress.\nHighlights: \n💼390,000 jobs added in May \n✅Almost 8.7 million jobs added under Biden \n⬇️The unemployment rate has remained at 3.6%—nearly pre-pandemic levels \n#BidenBoom","date":"Fri Jun 03 18:04:19 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The numbers are clear: Americans want Congress to pass legislation to stop the gun violence crisis. Republicans should join with Democrats in voting to save lives and #EndGunViolence. https://t.co/oWYJEAOom0","date":"Fri Jun 03 16:28:27 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the Annual Salute to Success Student Recognition Dinner tonight in Newport News and congratulated the students on a successful and productive school year https://t.co/mRL1OG9Ens","date":"Fri Jun 03 01:16:02 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a tour of @VMASC_ODU today and received a briefing on how their work supports workforce development initiatives and other applications https://t.co/hswuyj1UR3","date":"Fri Jun 03 00:50:00 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanks to Democrats enacting the American Rescue Plan, our economic recovery has been stronger and faster than expected. \nhttps://t.co/ha8b5SBaI3","date":"Thu Jun 02 20:26:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"To mark #Pride2022, I delivered $1.8 million to @LGBTLifeCenter! These funds, which I secured through the Community Project Funding process, will be used to construct a new community center to expand access to medical care for the Hampton Roads LGBTQ community. https://t.co/DnfXasueG0","date":"Thu Jun 02 18:00:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Enough is enough. I am grateful to my colleagues on @HouseJudiciary for holding an emergency markup on legislation to prevent gun violence.","date":"Thu Jun 02 14:48:49 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden Administration's Operation Fly Formula is delivering millions more bottles of infant formula. \n\nFamilies can also check here for resources to find formula: https://t.co/EYGxSdJLeq","date":"Thu Jun 02 14:25:18 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Hundreds of thousands of students were promised that a Corinthian degree would lead to a meaningful career. However, when Corinthian failed to deliver on its promise, students were left with burdensome debt &amp; useless degrees. This relief is long overdue...","date":"Wed Jun 01 23:25:02 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This doesn't happen by accident. This is because of \n the American Rescue Plan, the Bipartisan Infrastructure Law and Democrats' economic plan which has prioritized America manufacturing and resilient supply chains, and has helped usher in an historic American manufacturing boon.","date":"Wed Jun 01 20:57:47 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Yesterday, @RepElaineLuria and I toured the Jones &amp; Cabacoy Veterans Care Center with @VaVeteransSvcs Commissioner Daniel Gade. We also received a briefing on its scheduled opening this fall and how the center will provide important services to veterans in South Hampton Roads https://t.co/yTr7MGAemL","date":"Wed Jun 01 14:59:44 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I will be hosting a Telephone Town Hall tonight at 6:30 pm which will be an opportunity to hear about the work being done in Washington to invest in our economy and lower costs for families, and I can answer any questions you may have. Register here: https://t.co/objry2DtgP https://t.co/br2AZcd3ZN","date":"Tue May 31 15:27:52 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave remarks about the importance of remembering our veterans’ sacrifices and taking care of them after they complete their service during the Norfolk Memorial Day Ceremony https://t.co/Td7ZKZxCu1","date":"Tue May 31 00:35:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Was honored to attend Chesapeake Mayor Rick West’s Commission on Veterans Affairs’ Memorial Day Ceremony. Pictured with US Navy Commander Kathleen Colter, Councilwoman Dr. Ella Ward and Mayor West https://t.co/lWkQ7QyNsS","date":"Mon May 30 20:19:36 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined members of the Portsmouth City Council, @WAVY_News’ Regina Mobley, veterans and Portsmouth residents in observing Memorial Day https://t.co/peGRMr7tPX","date":"Mon May 30 18:02:31 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Honored the sacrifices of our veterans this morning at the Hampton National Cemetery on the campus of @_HamptonU https://t.co/GFhWSeXdpM","date":"Mon May 30 16:27:48 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"On #MemorialDay, we commemorate those who gave their lives for our nation.\n\nWe thank all our service members, veterans, military families and fallen soldiers for their sacrifice. \n\nMay we value our freedom and never forget its true cost. https://t.co/RSknM2IXhz","date":"Mon May 30 12:30:02 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing @BobbyDyerVB, Dr. Juan Montero and Hampton Roads’ veterans at the Montero Medical Missions Fish Fry today https://t.co/qrMrjMOtGY","date":"Mon May 30 02:42:21 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"About to join @TheRevAl on @PoliticsNation on @MSNBC. \n\nTune in!","date":"Sat May 28 21:00:24 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing everyone at the Umoja Festival today https://t.co/PC2oNzWxTa","date":"Sat May 28 19:24:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Celebrated #aapimonth by joining @RepElaineLuria and members of the Filipino American National Historical Society of Hampton Roads at a Historical Marker Unveiling Ceremony which honors the sacrifices made by Filipinos who served the U.S. Navy https://t.co/m3zRY3BatG","date":"Sat May 28 18:49:01 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This morning’s decline in inflation is a sign of progress. We can further tackle inflation by lowering families’ costs and lowering the federal deficit.\n\nRepublicans have a different economic plan, which would increase taxes on working families.","date":"Fri May 27 18:38:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined @nnschools Superintendent Dr. Parker, members of the Newport News School Board and Newport News City Council at a reception earlier this evening celebrating school division employees with 25, 30, 35 &amp; 40 years of service to @nnschools https://t.co/FtnNzcJOMi","date":"Fri May 27 01:54:40 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time celebrating the talented high school students who participated in my 29th Congressional Art Contest this evening. Congratulations to all the winners. Also, thank you to @TRADOC Band for entertaining us during the reception https://t.co/JveBmONl3D","date":"Fri May 27 01:32:38 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"88% of Americans support requiring background checks on all gun sales. In 2021, @HouseDemocrats passed H.R. 8, which would require background checks on all gun sales.\n\n202 House Republicans voted against it.","date":"Thu May 26 16:52:16 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@USCBO is projecting our deficit will fall by $1.7T in 2022 — the largest nominal reduction in the federal deficit in American history. The #AmericanRescuePlan jump-started a record-breaking economic recovery that improved America's fiscal position AND reduced our deficit.","date":"Thu May 26 15:13:56 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@USCBO's newly released baseline makes it clear: Democrats' #AmericanRescuePlan delivered lifesaving relief that changed the course of the pandemic, rescued our economy, and helped American families and small businesses stay afloat.","date":"Thu May 26 15:07:08 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Grateful to see @POTUS mark this solemn anniversary of Mr. Floyd’s murder with action. I am also very pleased to see the EO calls for a full implementation of my Death in Custody Reporting Act that I introduced in 2013 and @POTUS44 signed in 2014. https://t.co/1nKDSBcUik","date":"Wed May 25 21:01:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I remain committed to enacting comprehensive gun safety reform and I hope my colleagues will finally do something to help end this senseless violence","date":"Wed May 25 00:37:30 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Since Democrats retook the majority in 2019, the House of Representatives has passed meaningful gun safety reforms. Sadly, there remain too many in the Senate who still refuse to pass legislation to address this national crisis. This latest tragedy must be the last.","date":"Wed May 25 00:37:08 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Look at the evidence. The United States is not an outlier for individuals suffering from mental illness. We are an outlier for mass shootings. Still we refuse to address the common denominator in all of these tragedies — guns.","date":"Wed May 25 00:36:43 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Too many politicians will offer up thoughts and prayers but will take no meaningful action. I refuse to accept this as the status quo.","date":"Wed May 25 00:36:24 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Uvalde community joins a long list of other communities to face such unspeakable atrocities — and less than 2 weeks since the horrific mass shooting in Buffalo. Yet not one new federal law has been enacted in response to any of those tragedies in order to prevent another.","date":"Wed May 25 00:36:05 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"My heart is broken for the entire Uvalde community. Parents send their children to school with the basic expectation that they will come home safe at the end of the day.","date":"Wed May 25 00:35:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Since we passed @POTUS' Infrastructure Law, the Biden Administration has:\n➡️Announced $110 billion+ to rebuild roads &amp; bridges, modernize ports &amp; airports, replace lead pipes, &amp; expand high-speed internet\n➡️Funded 4,300 projects across 3,200+ communities\nhttps://t.co/BqTeHMRFxD","date":"Tue May 24 20:41:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This is why @POTUS invoking the Defense Production Act was so important. It is making the difference and speeding up production to get more infant formula on the shelves","date":"Tue May 24 20:22:16 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS signed my Access to Baby Formula Act so people can access the formula they need. \n\nNow by invoking the Defense Production Act, the Biden Administration is also working aggressively to get infant formula back on the shelves.","date":"Mon May 23 19:47:38 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I introduced the Access to Baby Formula Act with @RepJahanaHayes earlier this week. Very glad to see this legislation passed and signed into law.","date":"Sun May 22 15:54:35 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time today at the @gotrhr Birthday 5K! https://t.co/7CDAv6xDWG","date":"Sun May 22 15:46:44 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to be at @PortofVirginia today for the signing with Senator @MarkWarner, @RepElaineLuria and @ShalandaYoung46. This is another example of how @POTUS Biden’s Bipartisan Infrastructure Law is a major win for Virginians.","date":"Fri May 20 19:37:18 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Tomorrow at 10AM, @RepMcEachin, @RepElaineLuria and I will be hosting a Service Academy Day. Virginian students will hear more from our teams and representatives from the military academies. If you are interested in attending, RSVP here:  https://t.co/6zE0mKlmyV https://t.co/lla1nbtMZp","date":"Fri May 20 16:52:43 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Last night I attended @HamptonRoadsCAP’s 2022 Community Builder Awards. Good to be with @NNMayorPriceDDS @shelly_simonds @KevinGSwann @GayleneKan and honoree Dr. Janice Underwood. https://t.co/tumMVLZCAm","date":"Fri May 20 16:21:33 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The headline speaks for itself. Despite the obstruction, Congressional Democrats and @POTUS remain focused on easing the baby formula shortage. \nhttps://t.co/qpdG8PP88a","date":"Fri May 20 15:18:19 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It is regrettable that none of my Republican colleagues supported this legislation. The MAGA Republicans constantly complain about high prices and inflation, but they offer no plans to do anything about it.","date":"Thu May 19 18:04:39 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@HouseDemocrats are focused on lowering costs for American families. The Consumer Fuel Price Gouging Prevention Act will lower costs at the pump by putting an end to price gouging, penalizing market manipulators, &amp; bringing transparency to the secretive oil and gas market.","date":"Thu May 19 18:03:41 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Enjoyed speaking with students from the Harvard Kennedy School this morning about Juvenile Justice, Criminal Justice Reform, and education policy. https://t.co/265qy4nN9b","date":"Thu May 19 15:30:26 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The House has PASSED the Access to Baby Formula Act which I introduced with @RepJahanaHayes. This legislation ensures that 589,000+ babies across the nation who rely on WIC benefits to purchase formula will  have improved access to additional formula products.","date":"Thu May 19 13:44:03 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The formula shortage has disproportionately affected women &amp; children who rely on WIC benefits. The Access to Baby Formula Act will provide additional WIC flexibilities, so vulnerable families can use their benefits on other safe &amp; available formula products. #FeedOurInfants","date":"Wed May 18 17:03:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"We currently have record low unemployment &amp; job growth, yet job openings currently exceed applicants &amp; employers are clamoring for skilled workers. To help solve this problem, I led passage of the bipartisan Workforce Innovation &amp; Opportunity Act of 2022 \nhttps://t.co/vGkTZ3MKzS https://t.co/MlEEZ21xjd","date":"Tue May 17 23:53:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"We cannot protect our nation’s health or help communities recover if we do not strengthen our mental health care system. The Mental Health Matters Act takes the critical steps we need to confront the mental health crisis facing too many Americans.","date":"Tue May 17 19:02:36 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I stand with the LGBTQ+ community and will continue the fight for full equality and acceptance for all LGBTQ+ people in this country and around the world. #IDAHOBIT","date":"Tue May 17 18:38:24 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Honored to have Father George Chioros from Saints Constantine &amp; Helen Greek Orthodox Church in Newport News as my guest for today’s Joint Meeting of Congress with His Excellency Kyriakos Mitsotakis, the Prime Minister of Greece. https://t.co/ipDFPTDZ1e","date":"Tue May 17 15:18:35 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"On the anniversary of the historic Brown v. Board of Education decision, we must recommit ourselves to the eliminate persistent funding and achievement gaps and finally take actions to achieve the promise of Brown.","date":"Tue May 17 14:39:10 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"You can now order a third round of free at-home COVID-19 tests to be delivered directly to you. https://t.co/T3ZYjkX3wD","date":"Mon May 16 22:19:19 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to @GayleneKan for being the 2022 Hampton Alumnae Chapter of Delta Sigma Theta Community Woman of the Year! https://t.co/0zqVCtlZDJ","date":"Sun May 15 21:05:06 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"My thoughts are with the Buffalo community as they grapple with this tragedy. Gun violence and white supremacy are scourges on our society and require us to take meaningful action to combat these forces.","date":"Sun May 15 20:31:42 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden-Harris Administration has launched a new webpage that provides resources and places that parents can go to obtain formula, including contacts with companies, food banks, and health care providers. Visit: https://t.co/5CbG9vG78y","date":"Fri May 13 20:52:50 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"As the Chairman of @EdLaborCmte, I have been working with @SpeakerPelosi and other House leaders on legislative solutions to strengthen the WIC program and ensure all families have access to the baby formula they need.","date":"Fri May 13 18:03:41 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, I helped lead house passage of legislation to help lift millions of Americans out of poverty. By investing in local community organizations in Virginia and across the nation, we will provide Americans with the tools they need to achieve economic security. Watch: https://t.co/Bb7G9BjwpY","date":"Fri May 13 16:59:05 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@TSA’s frontline Transportation Security Officers, who have helped keep our skies secure during COVID-19, lack the same basic workplace protections as the rest of the Federal government. I'm proud to support the #RightsForTheTSAWorkforce Act today to improve TSA's workforce. https://t.co/qzBx9sJuSm","date":"Thu May 12 21:13:07 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This is extremely disappointing. Every woman, regardless of her background or socioeconomic status, deserves the right to make her own medical decisions.","date":"Wed May 11 20:57:34 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The least we can do to support firefighters who become injured or sick on the job is to help them secure the compensation and medical care they need to care for themselves and their families.\n\nThis bipartisan legislation will help achieve that goal. https://t.co/XDwkgDikjh","date":"Wed May 11 20:42:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"As the Chairman of @EdLaborCmte, I have led legislation that ensures workers can form and access all the benefits of a union. These rights should also be extended to House staffers.\n\nRead my statement for the record on House staffer's efforts to unionize: https://t.co/f4rhUQ8OTG","date":"Wed May 11 19:24:55 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It is unacceptable that dishonest employers can steal workers’ wages with little to no consequence. Each year, our most vulnerable workers are cheated out of billions of dollars. This bill would take critical steps to help workers receive the full pay they’ve earned.","date":"Wed May 11 19:05:26 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It is good to see annual inflation cooled in April. We’re making real progress, but the pandemic and #PutinPriceHike continue to drive inflation around the globe. We will continue fighting to lower costs, while Republicans' only plan is to raise taxes on working families.","date":"Wed May 11 16:51:35 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to Administrator Phillips on being confirmed to lead @DOTMARAD. This is great news for US mariners, the climate, ports, &amp; port communities as the Maritime Administration plays an important role in implementing the Biden Infrastructure Law.\nhttps://t.co/dJDOOM17vu","date":"Wed May 11 15:02:01 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Visited with Starbucks employees in Newport News this morning to hear their concerns https://t.co/fbuVCgzPRZ","date":"Mon May 09 22:06:09 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"To find out if you’re eligible for the Affordable Connectivity Program, call 877-384-2575 or head to https://t.co/h2MqTYA7QE.","date":"Mon May 09 19:27:19 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Enjoyed Dr. Willam R. Harvey’s final Commencement as President of Hampton University. Congratulations Dr Harvey on a great legacy @_HamptonU . https://t.co/9XGe8V0a8D","date":"Mon May 09 12:10:54 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"While attending the Commencement exercises at Virginia Union University today, I received recognition for my support of TRIO programs from the Staff of Student Support Services. Thank you! https://t.co/dpQUvV5QXf","date":"Sat May 07 22:19:13 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@SBAIsabel came to visit Norfolk yesterday! We had a great discussion about how the Biden Admin is supporting small businesses through the economic recovery as well as other @SBAgov programs geared toward lowering barriers so that all entrepreneurs can access the American dream. https://t.co/4UQRNvnyIg","date":"Sat May 07 16:33:03 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It was great having @SBAIsabel in  Hampton Roads today to highlight how President Biden's Executive Order on Equity in Procurement will increase opportunities for this region’s veteran owned and military spouse owned businesses during a #SmallBusinessWeek roundtable https://t.co/oZOOtzMxqn","date":"Fri May 06 23:02:50 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave remarks about the benefits of the recently passed Postal Service Reform Act during the Virginia Postal Workers Union Convention https://t.co/MR4qqavUJL","date":"Fri May 06 20:38:15 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s jobs report reflects another outstanding month of job growth and economic recovery. Under @POTUS’ economic agenda &amp; the investments Congress made through the American Rescue Plan, our economy has added 8.3 million jobs and the unemployment rate has fallen to 3.6 percent.","date":"Fri May 06 18:09:38 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Chesapeake Bay States’ Partnerships Initiative announced today by @USDA_NRCS is great news for farmers, climate, the Chesapeake Bay, and the streams and rivers that feed it. https://t.co/Tnhdw1fXbN","date":"Fri May 06 15:57:06 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"HAPPENING TONIGHT: Join me, @FAFSA, &amp; @theSBPC at 6pm via Zoom to learn if you are eligible to have your student loans erased through the Public Service Loan Forgiveness Program. Register here: https://t.co/vUF2vJ13mK","date":"Thu May 05 17:37:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Are you a teacher, firefighter, nurse, or work in another public service role? \n\nOn Thursday at 6pm via Zoom, join me, @FAFSA, &amp; @theSBPC to learn if you’re eligible to have your student loans erased under the Public Service Loan Forgiveness program: https://t.co/vUF2vJ13mK https://t.co/FMPUtrStsR","date":"Wed May 04 16:05:54 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Child hunger, diet-related illness, and inadequate access to care persist in many of our communities, particularly as we recover from the pandemic.\n\nI applaud @POTUS for launching this initiative to ensure all Americans have the nutrition &amp; care needed to live fulfilling lives.","date":"Wed May 04 13:56:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Was honored to attend the dedication and naming of the @FergCntrArts Lobby Atrium in honor of former Newport News Mayor Joe S. Frank and his late wife, Jane Susan Glasser Frank https://t.co/O0lRhklsJX","date":"Tue May 03 23:03:13 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This #TeacherAppreciationDay, I want to congratulate Virginia’s 2022 Teacher of the Year, Daphne Tamara. Thank you, Daphne, for your critical work to help students across the Commonwealth reach their full potential! #ThankaTeacher","date":"Tue May 03 21:15:48 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"These reports make it abundantly clear why the Senate must immediately pass that bill and send it to @POTUS' desk.","date":"Tue May 03 15:28:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Every woman, regardless of her background or socioeconomic status, deserves the right to make her own medical decisions. That is why I was proud to vote for the Women’s Health Protection Act last fall to protect reproductive rights at the federal level.","date":"Tue May 03 15:27:55 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It was truly an honor to join @CNRMA Commander Rock, @uscgmidatlantic Commander Dickey and @RepElaineLuria in saluting the performers, our military community and our @NATO_ACT allies at the 25th Anniversary of @VATatt https://t.co/WPqrdnjVDP","date":"Sun May 01 23:18:19 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Met with Anthony Kennedy Shriver to discuss @bestbuddies and their important work to create communities of inclusion for people with intellectual and developmental disabilities. https://t.co/Kr4JtoYmyI","date":"Fri Apr 29 22:09:30 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It's simple. Workers want higher pay, better benefits, and safer workplaces.\n\nIt is time for the Senate to pass the Protecting the Right to Organize Act! #PROAct \nhttps://t.co/UJqIPDpTrr","date":"Thu Apr 28 19:44:47 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This week, I joined @SecMartyWalsh and Asst. Secretary Parker in honoring all those who have been injured or lost their life on the job. We must continue working to ensure no worker has to risk their life for their livelihood.","date":"Thu Apr 28 16:14:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Our recovery is resilient thanks to the American Rescue Plan and @POTUS' policies. Democrats remain focused on jobs and cutting costs for families.\n\nRepublicans want to fight global challenges by raising taxes on middle class families, including half of small business owners.","date":"Thu Apr 28 16:05:12 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The U.S. has moved with unity &amp; speed to support Ukraine 🇺🇦\n \nThis week, the House will pass: \n✅Ukraine Democracy Defense Lend-Lease Act: to help send weapons &amp; supplies \n✅Asset Seizure for Ukraine Reconstruction Act: to seize &amp; sell assets of Putin’s cronies to help Ukraine","date":"Wed Apr 27 18:46:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Honored to receive the 2021 Legislator of the Year Award from the @boilermakernews. I remain committed to standing up for our nation’s workers and their families. https://t.co/L8NnDJl25d","date":"Tue Apr 26 22:52:05 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS announced plans to release up to 1M barrels of oil per day from the Strategic Petroleum Reserve over 6 months. \n\nWe must continue to combat the #PutinPriceHike and the toll of higher prices that Russia’s invasion is taking on American consumers and families. https://t.co/3RoZEJW84R","date":"Tue Apr 26 20:32:11 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Since Congressional Democrats enacted @POTUS’ American Rescue Plan, our economic recovery has been stronger and faster than other countries.","date":"Mon Apr 25 16:29:01 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to @_HamptonU President Harvey for receiving @100BlackMen of Virginia’s William A. Hines, Jr. Lifetime Leadership Excellence Award this weekend! https://t.co/vN0hAL3dhJ","date":"Mon Apr 25 12:25:11 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time listening to the Soundscapes/Peninsula Youth Orchestra this afternoon at the Virginia Community Music Festival at Christopher Newport University. These students are very talented! https://t.co/4MLKdr6EKl","date":"Sun Apr 24 22:40:13 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Enjoyed attending Terry Riddick’s Community Service Front Line Soldier’s Award Ceremony for the Best Kept Secret Program. Pictured with Terry Riddick, elected officials and honorees. https://t.co/Gqjoatxg7q","date":"Sat Apr 23 23:04:37 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing members of the Chesapeake Rotary Club and the Chesapeake Fine Arts Commission at today’s Chesapeake Spring Arts Festival https://t.co/SyHaRnOnYe","date":"Sat Apr 23 21:27:13 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Celebrated the legacy of the late PFC Frank Parker, Jr., one of the Montford Point Marines, at a ceremony to posthumously award the Congressional Gold Medal to his family https://t.co/5zqrWF9hrP","date":"Sat Apr 23 18:23:42 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended a @HabitatPGW Wall Raising Ceremony in partnership with First Baptist Church of Hampton. It’s one of the first steps in the construction process for a deserving family’s new home https://t.co/G4n1RJKIEO","date":"Sat Apr 23 16:47:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I also visited the Paradise Creek Nature Park in Portsmouth for a walking tour and to check out all the great working being done by the Elizabeth River Project to restore local wetlands. #EarthDay2022 https://t.co/RJrbpSs1Xl","date":"Fri Apr 22 18:08:44 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"And that money is being put to work right here in Hampton Roads. For example, Norfolk's Coastal Storm Risk Management Project will receive at least $339 million from the Bipartisan Infrastructure Law. https://t.co/L3RiB1RvBx","date":"Fri Apr 22 18:08:42 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Learn more about this exhibit here: https://t.co/QkLu7cnsj0","date":"Fri Apr 22 18:08:41 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Communities across the Hampton Roads region are particularly vulnerable to the adverse impacts of climate change due to sea-level rise and land subsidence. @POTUS's Bipartisan Infrastructure Law invests over $47 billion in climate resiliency projects!","date":"Fri Apr 22 18:08:41 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Happy #EarthDay! I visited the @ChryslerMuseum to tour their Waters Rising exhibit. Following the tour, I held a roundtable with local community leaders and environmental stakeholders to discuss coastal resiliency. https://t.co/Gfn41nWv3M","date":"Fri Apr 22 18:08:40 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the Annual State of the Port Address and heard many great updates on the progress the team is making with processing cargo and working to be carbon free https://t.co/mP7mzrbnWD","date":"Thu Apr 21 18:56:14 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Very proud to deliver $2.4 million to @AboutChesapeake for the Poindexter Sidewalk Extension! These funds, which I secured through the Community Project Funding process, will improve connectivity for residents and visitors alike to the Elizabeth River Park. https://t.co/JNAiv6U5vF","date":"Wed Apr 20 20:44:54 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Earlier today, I attended Project Alpha at Crittenden Middle School and spoke with a group of young men about the importance of prioritizing their education and their health. https://t.co/9R2uKcYKJN","date":"Wed Apr 20 20:28:57 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing this evening’s award recipients @AaronRouseVaBch, James Spore and Howard Kern at the @Chamber757 47th Annual Hampton Roads Volunteer Achievement Awards https://t.co/cojS8BOGQ3","date":"Wed Apr 20 02:51:06 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Was given a tour of a Suffolk Walgreens Pharmacy this afternoon. During the visit, I received a briefing and listened to the staff’s experiences with serving on the front line during the Covid 19 vaccine rollout https://t.co/9rBQMnnkVQ","date":"Wed Apr 20 00:05:49 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It was an honor to join Norfolk’s elected officials, housing officials and St. Paul’s residents this afternoon for the Groundbreaking Ceremony of the Tidewater Gardens Transformation Project https://t.co/JvmKxwoSKG","date":"Tue Apr 19 23:23:01 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"We cannot expect student loan borrowers to return to a repayment system that has failed to meet their needs.\n\nI will continue working with the Biden-Harris Admin. to ensure that the student loan system better serves our nation’s borrowers and families.","date":"Tue Apr 19 19:29:55 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time today at Sedgefield Elementary School learning how the #AmericanRescuePlan is continuing to help @nnschools get students back on track and support students' social and emotional health. https://t.co/BPiAOD1bvX","date":"Tue Apr 19 18:55:31 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Read a book to a class of preschoolers and received an update on the capital projects that are planned at the Tom and Ann Hunnicutt Family YMCA in Newport News https://t.co/GRvqVRlmkm","date":"Mon Apr 18 20:29:58 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I am committed as co-chair of the Chesapeake Bay Taskforce to continuing to advance this important work to protect the Bay.","date":"Mon Apr 18 14:20:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Just like the effort to free the Ever Forward from the banks of the Chesapeake Bay, the Bay's restoration requires partnership. Thankful that @POTUS's Infrastructure Law provides funds to advance the partnership and the Bay's recovery at a critical time. https://t.co/VKQW0jpu2K","date":"Mon Apr 18 14:20:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended Gethsemane Baptist Church’s Easter Rock Party. Pictured with First Lady Vera Riddick and attendees https://t.co/iXXVJEQz3K","date":"Sun Apr 17 19:43:10 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a good time yesterday evening at the @_HamptonU reception honoring President Harvey. Thank you for all that you have done for HU, it’s students, staff and faculty, and the greater Hampton Roads community! https://t.co/kRqoh8TpBK","date":"Sat Apr 16 19:21:04 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the reception at the YMCA Community Impact Dinner, which recognizes Volunteers of the Year from Hampton Roads, the Middle Peninsula and Northern Neck. https://t.co/ZKbGhf57h5","date":"Thu Apr 14 23:14:52 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations, Lt. Gen. Williams. I look forward to your leadership at Hampton University and thank Dr. Harvey for his 44 years of service to the Hampton community.","date":"Thu Apr 14 22:19:03 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"@EdmundXXIII Mr. Gardner, more info about the visit can be found here: https://t.co/F0Z4j7jIYJ","date":"Thu Apr 14 16:24:35 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Honored to be sanctioned by the Russian Federation for supporting @POTUS’ efforts to oppose and sanction their unjustified and unprovoked invasion of a sovereign nation. I remain steadfast in my support of Ukraine. https://t.co/Stl7BJYN1v","date":"Thu Apr 14 00:49:41 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the @Chamber757 Portsmouth State of the City Address and heard many encouraging updates on economic development initiatives and job growth https://t.co/3RXVHIkiHt","date":"Wed Apr 13 22:09:54 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The pandemic and Putin's invasion are causing worldwide inflation. \n\n@POTUS &amp; Democrats passed the Rescue Plan &amp; Infrastructure Law to invest in jobs &amp; keep looking to cut costs for families. \n\nThe GOP have no plan but to raise taxes on the middle class. \nhttps://t.co/iW1aBdbFYu","date":"Wed Apr 13 17:09:48 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Another example of how @POTUS' Bipartisan Infrastructure Law is a massive win for Hampton Roads!\nhttps://t.co/F0Z4j7jIYJ","date":"Wed Apr 13 16:26:16 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had an informative briefing this afternoon on how @NorfolkAirport plans to use funding allocated from the Bipartisan Infrastructure Deal https://t.co/jgniT2Opdh","date":"Tue Apr 12 20:13:15 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Enjoyed speaking with the Newport News, Hampton, and Denbigh Chapters of Delta Sigma Theta, Inc. this evening about their 2022 federal legislative priorities! https://t.co/QVBsdAA12f","date":"Mon Apr 11 23:31:47 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Americans are already paying more at the pump due to #PutinsPriceHike. That's why Big Oil companies need to stop #RippingOffAmericans.","date":"Mon Apr 11 18:23:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, @POTUS is taking a strong step to keep our communities safe by issuing a final rule on untraceable ghost guns &amp; announcing a @ATFHQ Director.\n \nI am working with @HouseGVP to ensure that our communities are safe as we protect #2A rights for responsible gun owners.","date":"Mon Apr 11 17:22:16 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Oil companies are currently sitting on thousands of unused drilling permits - but instead of using them to lower gas prices for American families, they're #RippingOffAmericans and using record profits to enrich shareholders.\n\nhttps://t.co/NFfqoXk9Mf","date":"Fri Apr 08 18:34:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"A 54-year low does not happen by accident. This is the result of actions taken by Congress and @POTUS when we enacted the American Rescue Plan.","date":"Fri Apr 08 13:27:13 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I am proud to cosponsor @RepElaineLuria's legislation to enhance educational and recreational opportunities and ensure we preserve Coastal Virginia for generations to come.","date":"Thu Apr 07 21:39:31 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations Justice Ketanji Brown Jackson!","date":"Thu Apr 07 18:30:18 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today is a great day to make history. #ConfirmKBJ","date":"Thu Apr 07 13:23:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"While Big Oil companies are reaping record profits, Americans are suffering at the pump. @HouseDemocrats are demanding answers.","date":"Wed Apr 06 15:49:51 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"@sosonkyrie @usedgov Sam, please contact my district office in Newport News at 757-380-1000. You’ll also need to fill out a consent form which you can do on my website at: https://t.co/wKs2TlsJDU","date":"Wed Apr 06 15:35:19 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Student loan borrowers continue to feel the impact of the economic fallout from COVID-19. We cannot let our guard down as we work to help Americans recover.\n\nI am glad that the @usedgov has the tools, authority, and competency to help borrowers get back on their feet.","date":"Wed Apr 06 14:41:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@SecBecerra is testifying before @EdLaborCmte. Tune in below. ⬇️","date":"Wed Apr 06 13:03:18 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This is good news for millions of families that haven't been able to get the tax credits they need to purchase affordable health coverage. By improving the ACA, the Administration is continuing to stand up for Americans and expand access to affordable health care. #ProtectOurCare","date":"Tue Apr 05 17:41:23 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Virginia is an offshore wind industry leader. Our bill advances that effort and reflects the critical role American workers will play in the clean energy future. I thank @BillPascrell, @DonaldNorcross, @RepMcEachin &amp; @RepElaineLuria for their partnership on this bill.","date":"Tue Apr 05 15:41:38 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Last week, the House passed the #AffordableInsulinNow Act to cap the cost for insulin at no more than $35/per month to ensure that no one has to choose between making ends meet and accessing lifesaving medication.\n\n193 House Republicans voted against it. \n\nhttps://t.co/iKGexKkNA0","date":"Mon Apr 04 15:10:00 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"You can also head to https://t.co/uAFWirQBSB to find tests, vaccines, treatments and masks near you!","date":"Sat Apr 02 15:18:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Free COVID-19 vaccines and testing are available at Boo Williams Sportsplex in Hampton. \n\nCongress must enact @POTUS’ COVID-19 funding request so vaccines and testing can remain free and available! https://t.co/eu6gR72Lgo","date":"Sat Apr 02 15:16:48 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"JOBS JOBS JOBS! \n\nSince @POTUS took office in January 2021, the economy has gained 7.9 MILLION jobs. The Biden-Harris economic agenda is getting Americans back to work","date":"Fri Apr 01 19:12:31 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden Administration didn’t create this problem but now they have an opportunity to fix it.If you've made qualifying payments, you need to get credit for them. And if the ED has lost records, then students should have the benefit of the doubt and ED should presume they were.","date":"Fri Apr 01 15:51:15 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Affordable Insulin Now Act will cut the avg. price of insulin by nearly half. This is a critical step to lower prescription drug costs for all Americans. I will continue working to ensure that no one has to choose between making ends meet and accessing lifesaving medication.","date":"Thu Mar 31 23:05:41 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This legislation would finally invest serious federal funding in our nation’s workforce development and help ensure that all workers—including women, people of color, and justice-involved individuals—have access to the resources they need to find rewarding careers.","date":"Thu Mar 31 21:12:28 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"As American families face the #PutinPriceHike, @POTUS and Congressional Democrats are taking action to keep costs low for Americans at home. \nhttps://t.co/3eXNZu1IyM","date":"Thu Mar 31 17:10:21 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Further proof that inflation is a global problem caused by the pandemic and Putin. We have more to do to cut costs for families but since @POTUS &amp; Democrats enacted the American Rescue Plan, our economic recovery is stronger and faster than other nations.\nhttps://t.co/Rofnp9ugmN","date":"Thu Mar 31 16:06:38 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden Infrastructure Law continues to deliver wins for Hampton Roads.","date":"Wed Mar 30 17:12:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden Administration has launched https://t.co/uAFWirQBSB so everyone can gain even better access to lifesaving tools like vaccines, tests, treatments, and masks, as well as get the latest updates on COVID-19 in their area.","date":"Wed Mar 30 14:15:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"For years, Americans who earned their pensions in demanding industries have been at risk of losing everything through no fault of their own.\n\n📺My convo w/ @WAVY_News about how the American Rescue Plan saved over a million pensions &amp; thousands of businesses from going bankrupt. https://t.co/NeokMQUswE","date":"Tue Mar 29 20:22:56 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Democrats enacted the American Rescue Plan and then our economy recovered faster than others and we had the strongest growth in 40 years. For the first time in over 20 years, our economy is growing faster than China's. More work to do, but we are moving in the right direction.","date":"Tue Mar 29 16:14:11 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The #BidenBudget would lower costs for American families, create a fairer tax code, grow the middle class and strengthen our economy. Follow the @HouseBudgetDems hearing below.","date":"Tue Mar 29 14:23:57 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Check out my conversation with @juliemilletnews tonight at 6 p.m. about how the American Rescue Plan helped save over a million retirees' pensions and hundreds of businesses from going bankrupt.","date":"Mon Mar 28 22:03:00 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Excited to serve as Honorary Co-Chair of the 25th Annual VA International Tattoo next month w/ @RepElaineLuria &amp; @KennyAlexander. Pictured w/ @NATO_ACT Commander Gen. Lavigne, Tattoo Producer Scott Jackson, @VaArtsFest Dir. Rob Cross &amp; LTC Souza at the Community Leaders Breakfast https://t.co/S2hILhvpKn","date":"Mon Mar 28 20:33:21 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The #BidenBudget shows how the strongest economic growth in nearly 40 years, powered by the American Rescue Plan, has put the deficit on track to drop by more than $1.3 trillion this year—the largest-ever one-year decline.","date":"Mon Mar 28 18:20:39 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The #BidenBudget reflects three important values: \n✅Fiscal responsibility\n✅Safety and security at home and abroad\n✅A commitment to building a better America","date":"Mon Mar 28 16:57:52 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing honorees Councilwoman Lisa Lucas-Burke and Leah Stith at the Zeta Pi Zeta Chapter of @ZPHIBHQ Inc.’s Finer Womanhood Award Banquet https://t.co/HwCuDR0iye","date":"Mon Mar 28 01:45:18 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Participated in an meeting with @MarkWarner, @RepElaineLuria and Isle of Wight residents to discuss broadband expansion and other investments that were made possible because of the recent omnibus spending package https://t.co/R2SVdfQ4wp","date":"Sat Mar 26 00:44:30 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"While Russia’s economy is collapsing, our job market is booming, with the fewest people on unemployment in half a century.","date":"Fri Mar 25 20:26:19 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Excited for the launch of the bipartisan Public Shipyard Caucus. I am proud to represent the oldest public shipyard in the country, and this will be a great opportunity to work with my colleagues on both sides of the aisle in support of our public shipyards.","date":"Fri Mar 25 19:55:36 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Last night, I attended the 69th @akasorority1908 Mid-Atlantic Regional Conference in Hampton. https://t.co/UbJegRE31r","date":"Fri Mar 25 16:28:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended a great event @SloverLibrary about the book that @KennyAlexander authored on Norfolk Civil Rights Icon Evelyn T. Butts https://t.co/XZCOaYl7HQ","date":"Fri Mar 25 01:11:37 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Encouraged by the many great announcements I heard during the Chesapeake State of the City address. https://t.co/cepQ4JEcOp","date":"Fri Mar 25 00:39:44 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Unemployment claims are at the lowest level since 1969. This is further evidence that @POTUS and Congressional Democrats' investments in jobs and the economy are getting Americans back to work and getting the economy back on track. \nhttps://t.co/0EkqTsydLm","date":"Thu Mar 24 17:44:25 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Celebrated the 12th Anniversary of the Affordable Care Act by participating in a roundtable with @HHShov Acting Regional Director Melissa Herd and by giving remarks about the continued benefits of the law at an anniversary celebration last evening in Hampton https://t.co/rirjChnjdJ","date":"Thu Mar 24 14:12:24 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a really informative tour and briefing about the critical services that  Thaler McCormick and the team at For Kids, Inc. deliver to families and children in our community https://t.co/usarWUfvaY","date":"Wed Mar 23 23:03:30 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Was honored to attend the Historic Marker Unveiling for Hidden Figures Katherine Johnson, Mary Jackson and Dorothy Vaughn  @VaAirandSpace. Pictured with Mrs. Johnson’s daughters https://t.co/zWeRd8fJ42","date":"Wed Mar 23 22:13:37 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"In her days before the Senate Judiciary Committee, Judge Jackson has demonstrated that she is unequivocally qualified for the Supreme Court.","date":"Wed Mar 23 14:58:15 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Exactly 12 years ago, President Obama signed the Affordable Care Act into law, protecting millions of Americans with pre-existing conditions and expanding access to medical coverage.\n\nToday, the ACA continues to fulfill the promise that health care is a right, not a privilege. https://t.co/k4sPZ3kMIm","date":"Wed Mar 23 14:42:15 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I am pleased to see @USDOL take this critical, long-overdue step to support health care workers and strengthen our COVID-19 recovery. We must provide health care workers with the consistent workplace safety protections they need to continue keeping all of us safe.","date":"Tue Mar 22 23:35:03 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It was great to have Admiral Michael Gilday, the U.S. Navy’s Chief of Naval Operations, in Hampton Roads yesterday for a briefing and tour of ship repair facilities https://t.co/WutWLhfM37","date":"Tue Mar 22 13:47:56 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Judge Ketanji Brown Jackson is eminently qualified to serve on the U.S. Supreme Court.","date":"Mon Mar 21 20:06:51 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined @NNMayorPriceDDS &amp; my sister Valerie in honoring some of the pivotal figures in @CityofNN history, such as Fmr. Delegates Flora Crittenden &amp; Mamye Bacote, Fmr. Vice Mayor Chuck Allen, Madam Annie Daniels &amp; my father Dr. C Waldo Scott at Main St. Library’s Salute to Heroes https://t.co/ltuaIfV8P1","date":"Mon Mar 21 01:23:24 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It was great seeing @RepElaineLuria, @KennyAlexander, members of Norfolk City Council, members of Norfolk School Board and constituents at Engage Norfolk today https://t.co/RCA1rJtyUi","date":"Sun Mar 20 22:00:53 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The headline speaks for itself. \n\n\"More than two dozen Senate Republicans demand Biden do more for Ukraine after voting against $13.6 billion for Ukraine\"\nhttps://t.co/L3LNUwDfaH","date":"Fri Mar 18 16:56:39 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Black women and girls should be allowed to wear their natural hair with pride and without fear of discrimination. The #CROWNAct would help make that a reality. https://t.co/JmmSrLo2n1","date":"Fri Mar 18 16:05:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"#AmeriThanks","date":"Fri Mar 18 15:06:34 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"More than 30 of our nation’s HBCUs—including NSU &amp; HU in my district—have faced an alarming series of bomb threats. These threats of violence are unacceptable.\n\nIt is critical these institutions have access to the resources they need to ensure our communities are protected.","date":"Wed Mar 16 22:47:40 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The #PutinPriceHike is squeezing Americans. And we cannot allow oil corporations to further price gouge working families.\nhttps://t.co/UDfMCeKh2a","date":"Wed Mar 16 16:28:12 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The pause on student loan payments has been critical to helping borrowers and families cope with the economic fallout of the pandemic.\n\nI am urging the Biden-Harris administration to extend relief for student loan borrowers through the end of this year. https://t.co/3hDCKESacd","date":"Wed Mar 16 14:37:56 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"A woman still makes, on average, 83 cents for every dollar earned by a man. We need to finish the job that the #EqualPay Act started 59 years ago today. \n\nThe @SenateGOP must stop blocking the Paycheck Fairness Act so we can finally secure equal pay for equal work. https://t.co/GRHlcIjbQ4","date":"Tue Mar 15 18:53:44 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined Former VA Governor Bob McDonnell, Florence Kingston from @NNDevelopment and the Executive team from East Coast Repair for a discussion about their Federal maritime work and a tour of their Maritime Training Facility https://t.co/plkgAKgJWg","date":"Mon Mar 14 21:47:50 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Enjoyed the Annual UNCF Mayors’ Masked Ball with elected officials from across Hampton Roads. https://t.co/36vbDJaSqq","date":"Sun Mar 13 01:57:24 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time watching @Norfolkstate Men’s and Women’s Basketball Teams compete in the @MEACSports Basketball Tournament. Congratulations to the Men’s team for winning the Championship! https://t.co/wPGLIohhnT","date":"Sat Mar 12 23:57:13 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to the Menchville High School Girls Basketball team (@MenchvilleAD) and the Kings Fork High School Girls Basketball team (@KFHSBulldogs) on winning the first State Championships in their schools’ history","date":"Sat Mar 12 21:08:36 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"In the #AmericanRescuePlan, we invested in families—from the bottom up and from the middle out. As a result, last year, we had the best economy that we’ve had in 40 years. This was made possible because of the proper investments in the American Rescue Plan.","date":"Fri Mar 11 20:01:12 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to @nnschools on being awarded 10 new school buses! Both the Biden Infrastructure Law and the American Rescue Plan included investments like this to make our children's commutes healthier and reduce pollution in our communities.\n\nhttps://t.co/Z0Lzan1GKK","date":"Thu Mar 10 21:11:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This legislation includes critical funds to invest in jobs, education, the environment, national security, as well as a number of important community projects and shipbuilding in Hampton Roads. My full statement: https://t.co/cPegftNE2e","date":"Thu Mar 10 03:20:01 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"2/ Learn if you qualify for the PSLF program and apply for loan forgiveness here: \n \nhttps://t.co/8npvP1IV9c","date":"Wed Mar 09 22:44:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"NEWS: Under the Biden-Harris Administration, 3,400+ nurses, teachers, first responders, &amp; other public servants in Virginia have received student loan forgiveness. \n\nI applaud @POTUS for improving the PSLF program &amp; delivering relief to borrowers across the nation. https://t.co/ImucqQ2kdL","date":"Wed Mar 09 22:44:37 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"👀\nhttps://t.co/Ppckq8eOZ8","date":"Wed Mar 09 21:37:01 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to @mayawiley, the new president and CEO of @civilrightsorg! https://t.co/B1QDXFa04o","date":"Wed Mar 09 20:49:45 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"School lunch waivers provided an additional 10M students free school meals each day during the pandemic. The last thing we should do is prematurely revoke these benefits and deprive students of the nutrition they need to help them learn and grow.\nhttps://t.co/PuxTIBZeg3","date":"Wed Mar 09 19:34:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden Admin approved more US drilling permits per month in 2021 than the Trump Administration did during each of the first three years of his presidency. \n\nThe rise in gas prices is the #PutinPriceHike. Will continue working with @POTUS to address rising prices and cut costs.","date":"Wed Mar 09 18:09:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Strong economic growth is reducing the deficit. \n\nThanks to our American Rescue Plan and @POTUS’ economic policies, the economy grew in 2021 at the fastest rate since 1984.","date":"Wed Mar 09 17:11:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"By taking these aggressive actions, we are making it clear that America stands with Ukraine, our NATO allies, and we will not subsidize Russia’s war of choice. My full statement below. \nhttps://t.co/PRo27mDYf1","date":"Tue Mar 08 19:09:42 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This crisis is another reminder of the need to diversify to clean domestic American energy. Investments in clean domestic energy and efficiency not only create jobs, they also protect us from price volatility, corporate greed, and senseless acts of aggression by petro-dictators.","date":"Tue Mar 08 19:08:57 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"As @POTUS acknowledged today, these steps may temporarily increase costs here as we confront worldwide inflation as a result of the pandemic. I remain committed to doing everything we can to cut everyday costs for American families while standing up for democracy.","date":"Tue Mar 08 19:08:24 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Ever since Vladimir Putin launched his unprovoked invasion on Ukraine, @POTUS promised that Russia would face crushing sanctions, and we would leave Russia more isolated economically and diplomatically from the world. This is another example of following through on that promise.","date":"Tue Mar 08 19:05:54 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Very pleased to see @USW8888 ratify a new collective bargaining agreement that will cover over 10,000 workers at Newport News Shipbuilding. This agreement will mean that our shipbuilders will be well-compensated and protected on the job!","date":"Tue Mar 08 15:08:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Imagine prioritizing a $2T tax cut for the wealthy &amp; corps &amp; then thinking ensuring hungry students had access to a school meal was 'too costly.'\n\nRevoking the waivers now would not only deprive hungry students the food they need, but create chaos for industry &amp; school leaders.","date":"Mon Mar 07 23:26:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan invested nearly $40 billion to help students cope with the pandemic and help colleges and universities reopen and stay open safely.\n\nToday, I joined @SecCardona and @RepAdams to discuss why investing in students means investing in our future. https://t.co/g7Dr8n9lXI","date":"Mon Mar 07 22:37:16 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"More free tests are available at https://t.co/WLduLc9FEa!","date":"Mon Mar 07 21:42:21 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Democrats enacted &amp; defended protections for people with pre-existing conditions. Republicans tried to dismantle them &amp; destroy the Affordable Care Act which expanded health care to millions of people. \n\nAnd now, they admitted they will try to do it again.\nhttps://t.co/6UIftCCxDX","date":"Mon Mar 07 20:41:11 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The good news is we passed the bill to keep our promises to veterans. \n\nThe bad news is 174 House Republicans voted against the bill. \n\nhttps://t.co/bi1XTi0oXZ","date":"Sat Mar 05 19:34:51 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today's jobs report reveals that when we invest in students, workers, and families, we can build back stronger communities and a stronger economy. #BidenBoom #DemsDeliver","date":"Fri Mar 04 15:41:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Honoring our PACT Act ensures we keep our promises to veterans and they receive the healthcare &amp; benefits they have earned. By providing care to over 3.5M veterans experiencing illnesses tied to toxic exposure, we’re upholding our promise to care for them when they come home. https://t.co/srHcXqs1Qs","date":"Thu Mar 03 16:25:25 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"“The State of the Union is strong — because you, the American people, are strong.\n \nWe are stronger today than we were a year ago — and we will be stronger a year from now than we are today.” #SOTU \n\n👏 👏 👏 🇺🇸","date":"Wed Mar 02 03:11:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congressional Democrats passed @POTUS’ American Rescue Plan which was the largest one-time investment in K-12 education. It gave schools money to re-open safely and keep kids in the classroom. #SOTU","date":"Wed Mar 02 03:03:53 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Reducing crime and keeping our neighborhoods safe means addressing gun violence and standing up to the gun lobby. #SOTU","date":"Wed Mar 02 02:59:07 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The most pro-union, pro-worker administration in history. #SOTU","date":"Wed Mar 02 02:49:23 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS’ plan to address inflation is simple. Grow the economy and lower costs for families. Let’s get it done. #SOTU","date":"Wed Mar 02 02:43:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS: “One way to fight inflation is to drive down wages and make Americans poorer. I have a better plan to fight inflation. Lower your costs, not your wages.” \n\n#SOTU","date":"Wed Mar 02 02:35:38 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"“We're done talking about an infrastructure week. We're now talking about an infrastructure decade.” \n\n#SOTU \n#DemsDeliver #BuildingABetterAmerica","date":"Wed Mar 02 02:28:13 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"“Invest in America. Educate Americans. Grow the workforce. Build the economy from the bottom up  \nand the middle out, not from the top down.” 👏 👏 👏 \n\nUnder @POTUS’ leadership, we are building a better America. #SOTU","date":"Wed Mar 02 02:25:56 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Period. #SOTU","date":"Wed Mar 02 02:23:35 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS:  “He thought the West and NATO wouldn’t respond. And he thought he could divide us at home. Putin was wrong. We were ready.\"\n 🇺🇦 🇺🇸 #SOTU","date":"Wed Mar 02 02:17:49 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"A historic way to begin #NationalWomensHistoryMonth. #SOTU https://t.co/urOAfUoigk","date":"Wed Mar 02 02:15:25 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"President Biden and Democrats are building a better America:\n✅  Grow the economy from the bottom-up &amp; middle-out and lower costs for families\n✅  Make more things here in America\n✅  Promote competition to lower prices \n✅  Eliminate barriers to good-paying jobs\n#SOTU https://t.co/Uai03xPz74","date":"Wed Mar 02 01:38:31 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The #SOTU is tonight. I expect to hear @POTUS talk about how far we’ve come in one year. \n\nFastest economic growth since 1984.\n\nA record 6.6M jobs created.\n\nOver 215M Americans vaccinated. \n\nAnd discussion of what we can do to further invest in jobs and cut costs for families.","date":"Tue Mar 01 22:10:37 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanks to @POTUS' American Rescue Plan, Virginia will receive one of these first-of-their-kind grants to ensure that all hardworking Virginians can access the unemployment benefits that they are entitled to receive. https://t.co/Wd5A7UAVZL","date":"Tue Mar 01 21:34:15 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Celebrating #BlackHistoryMonth at the @WhiteHouse with @POTUS, @VP, @RevJJackson, @NNMayorPriceDDS and @donnabrazile. https://t.co/klw2ksAQvI","date":"Mon Feb 28 21:01:58 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I am here at the @WhiteHouse with @POTUS, @VP and my colleagues from @TheBlackCaucus to celebrate #BlackHistoryMonth","date":"Mon Feb 28 19:51:30 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to the hard working students who received the Award of Excellence today at the Aviation Institute of Maintenance https://t.co/ObCne25Ab9","date":"Sat Feb 26 21:51:30 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave greetings at the Choice Neighborhood Initiative event commemorating the rich history and forthcoming revitalization of the Ridley Place neighborhood in Newport News https://t.co/Su4BQdNsaT","date":"Sat Feb 26 19:26:57 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"One of the most critical steps Congress took at the onset of the pandemic was providing Americans with free COVID-19 testing and vaccinations. The last thing families need during this ongoing public health emergency is an unexpected medical bill for a COVID-19 test.","date":"Fri Feb 25 21:02:22 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Great having the Honorable Michael Connor, Asst. Secretary of the Army for Civil Works, in Hampton Roads today for a briefing and tour of the Coastal Storm Risk Management Project https://t.co/DsFWSgC6mj","date":"Fri Feb 25 01:24:15 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Thread with photos and information about our great visit to @NASA_Langley earlier today. ⤵️","date":"Thu Feb 24 23:13:28 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The U.S. must remain steadfast in our support of Ukraine and remain resolved to ensure Russia is isolated from the world and economically and diplomatically weakened if it continues down this destructive path in violation of international law. My full statement below. https://t.co/aNho7yC9ql","date":"Thu Feb 24 20:09:27 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"All students should have access to safe and well-funded public schools. \n\nDemocrats made historic investments in K-12 education in the #AmericanRescuePlan and now schools can safely stay open while navigating the challenges of the pandemic. #PublicSchoolsWeek #PublicSchoolProud","date":"Wed Feb 23 21:34:27 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Despite the global challenges of inflation related to the pandemic and supply chains, American income levels went up in 2021 across income distribution - even after accounting for inflation - as a result of the bold actions taken by @POTUS and Democrats in Congress.","date":"Wed Feb 23 20:30:43 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s new @USGAO report is an alarming reminder that we have far more work to do to end child abuse and neglect in this country. \n \nWe can and must do more to ensure that every child has a chance to grow and learn in a healthy environment.","date":"Wed Feb 23 20:00:03 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to the @USWNT on this important victory! Now it is time for the @SenateGOP to stop blocking the Paycheck Fairness Act so we can finally close the gender pay gap.\nhttps://t.co/iiizo3vcKs","date":"Wed Feb 23 18:26:18 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I’m going to be interviewed on 1350-AM WGPL at 6:15am. Hope you can tune in","date":"Wed Feb 23 11:02:08 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Visited Newport News Shipbuilding with @timkaine and my colleagues @RepElaineLuria @RepMcEachin and @RobWittman. We were given a comprehensive tour and update by President Jennifer Boykin https://t.co/trTetRtc2s","date":"Wed Feb 23 01:32:39 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined @timkaine this afternoon for a roundtable with @VCCS_SO Chancellor Glen DuBois, regional Community College Presidents and stakeholders https://t.co/kDkEHpLiLZ","date":"Wed Feb 23 00:01:04 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Discussed the Bipartisan Infrastructure Bill and other issues during a roundtable with @timkaine and the Hispanic Chamber of Commerce of Coastal Virginia https://t.co/qeoi39vXgw","date":"Tue Feb 22 23:04:45 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"On my two-do list today is recognizing the importance of our public schools and the more than *TWO* billion dollars I helped secure for Virginia's public schools in the American Rescue Plan. #PublicSchoolProud #Twosday","date":"Tue Feb 22 22:29:41 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I support the actions of @POTUS and our allies in defense of Ukraine.","date":"Tue Feb 22 21:52:28 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It was a pleasure to join @timkaine for a policy roundtable and discussion with Muslim business and community leaders https://t.co/crH3nBlB8V","date":"Tue Feb 22 02:11:35 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"It was a pleasure to join Mayor Tuck and members of the Hampton City Council in welcoming the Honorable Joaquim do Espírito Santo, Angolan Ambassador to the U.S., to Hampton Roads for a tour of Fort Monroe https://t.co/JDHJVEmn7C","date":"Sat Feb 19 22:36:07 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave remarks about the importance of early screenings during Hampton Roads Prostate Health Forum events in Portsmouth and Newport News https://t.co/zKfJHtYXym","date":"Sat Feb 19 21:23:39 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Even before the pandemic old and hazardous school buildings put students and educators at risk. \n \nThe #AmericanRescuePlan continues to help schools update their buildings to ensure safer classrooms.","date":"Fri Feb 18 18:28:44 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This was all made possible because we passed the American Rescue Plan and the Biden Infrastructure Law.","date":"Fri Feb 18 17:11:50 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Jobs instead of mobs. \nInfrastructure instead of insurrection.","date":"Fri Feb 18 16:19:51 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Karen Ferguson founded &amp; led the Pension Rights Center for decades ensuring workers &amp; retirees received their hard-earned pensions.\n\nToday we honor Karen’s memory by celebrating the PRC’s 46th anniversary and renewing our commitment to protecting Americans’ retirement security","date":"Thu Feb 17 19:42:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Over the past decade, Democrats have helped millions of Americans get high-quality health care by expanding access to affordable coverage. Despite the progress we’ve made in lowering costs &amp; expanding access, many Americans are still struggling to afford the care they need.","date":"Thu Feb 17 17:10:58 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I applaud the Biden Admin for taking another critical step to support defrauded student borrowers of for-profit schools.\n\nThis relief is long overdue. Many of these borrowers filed discharge claims years ago, yet the previous administration refused to grant them relief.","date":"Thu Feb 17 01:26:05 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The debt limit does not constrain federal spending; it simply restricts the @USTreasury's ability to honor financial commitments previously made by Congress. A full breach of the debt limit would be catastrophic for Americans. Follow along with @HouseBudgetDems below.","date":"Wed Feb 16 16:53:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"By enacting the #AmericanRescuePlan we got people back to work &amp; saw the largest economic growth since 1984. The @WhiteHouse has taken further action to battle Omicron &amp; ease supply chains. We have more work to do but we are moving in the right direction in our historic recovery.","date":"Wed Feb 16 15:48:11 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"McConnell didn't mention enacting @POTUS' Rescue Plan last year led to:\n-a record 6.7M jobs created\n-Largest economic growth since 1984 \n-Unemployment under 4%\n\nAnd #BuildBackBetter would further cut costs for families. The GOP has no plan to address the global inflation problem. https://t.co/Z2XNM6hx7T","date":"Tue Feb 15 17:18:09 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Enjoyed remarks from Mr. J.D. Myers, II, during the @vpcorg Peninsula Executive Leadership Forum https://t.co/tc30hcPcBf","date":"Tue Feb 15 16:38:33 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Discussed how the Bipartisan Infrastructure Law will impact the @PortofVirginia and bring jobs and commerce to Hampton Roads during the @Chamber757 Infrastructure Roundtable. https://t.co/ndvMzCV0ur","date":"Mon Feb 14 20:28:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"#ElectrifyingAmerica will help us combat the growing climate crisis and create good-paying jobs right here at home. Thanks to @POTUS’ Bipartisan Infrastructure Law, Virginia will receive over $15 million this year to invest in EV charging infrastructure. https://t.co/znYEh567M9","date":"Mon Feb 14 18:29:12 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Participated in the Student Awards presentation during the @sistercities_nn Lunar New Year Celebration this evening https://t.co/3d66FZOuSD","date":"Sun Feb 13 01:53:09 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended @williamandmary’s Charter Day where I was conferred an honorary degree along with @GovernorVA and Howard J. Busbee. https://t.co/QXrg6zBZ8k","date":"Sat Feb 12 01:15:25 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"For years, workers, retirees and businesses waited on Congress to enact a solution to the multiemployer pension crisis. \n \nDemocrats delivered a historic victory with the #AmericanRescuePlan that kept the promises made to retirees and saved businesses from going under.","date":"Thu Feb 10 23:21:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"That is why we enacted @POTUS' Infrastructure Law to ease supply chain issues and why @HouseDemocrats passed the #AmericaCOMPETESAct to fight inflation by promoting domestic innovation and manufacturing. \nCongressional Republicans have NO plan to address inflation.","date":"Thu Feb 10 17:17:50 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Pregnant workers should be given simple and reasonable accommodations, like a water bottle, a stool to sit on or a better-fitting uniform. The Pregnant Workers Fairness Act would finally guarantee workers the protection they deserve. #ProtectPregnantWorkers","date":"Thu Feb 10 00:27:34 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Bipartisan Infrastructure Law provides billions to invest in our water infrastructure and create jobs. But we must also strengthen the laws that protect our water resources. That’s why I joined 120 @HouseDemocrats calling for the swift repeal of Trump’s #DirtyWaterRule.","date":"Wed Feb 09 15:51:19 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"People across the country depend on @USPS to communicate w/ friends, receive prescriptions, pay bills, receive Social Security benefits, file tax returns, vote &amp; more. Proud to vote for the Postal Service Reform Act to ensure speedy &amp; reliable delivery for Virginians.","date":"Tue Feb 08 22:55:57 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"#AmericaCOMPETES Act will super-charge American competitiveness by:  \n✅ Making Critically-Needed Semiconductors in America\n✅ Fixing the Supply Chain &amp; Strengthening American Manufacturing\n✅ Turbocharging American Scientific Research, Technology &amp; Innovation Excellence","date":"Tue Feb 08 16:31:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Under @POTUS' economic agenda and the investments we made through the #AmericanRescuePlan, our economy has had the strongest year for economic growth since 1984. Americans are getting back to work. #BidenBoom #DemsDeliver\nhttps://t.co/EUNetlXnyw","date":"Mon Feb 07 17:52:00 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s jobs report reflects another month of historic job growth. Under @POTUS’ economic agenda &amp; the investments made through the #AmericanRescuePlan, our economy has had the strongest year for economic growth since 1984. https://t.co/gnPKhawA1L","date":"Fri Feb 04 18:08:05 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I introduced the #PROAct because I believe that workers must have the right to organize and have a voice in their workplace. Congressional staffers are no exception. \n\nIf staffers decide to form a union, I will be proud to support them.","date":"Fri Feb 04 02:14:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"With the #AmericaCOMPETES Act, we all win:\n🏅Ensuring the U.S. can compete globally\n🤝Building #STEM opportunities for ALL\n💲Funding innovation\n🌎Fighting climate change\n🇺🇸Strengthening national security\n🥼Growing our semiconductor manufacturing capabilities\nAnd more! https://t.co/a1Rshdtyqj","date":"Thu Feb 03 20:27:58 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan Act delivered a historic victory to retirees, businesses, and taxpayers from the even greater cost of a multiemployer pension collapse. The Committee's Multiemployer Pension Rescue Tracker will help illustrate the impact of this transformative solution.","date":"Wed Feb 02 19:22:43 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"This will hurt Virginia's families and hurt our local economy. These Republicans should explain to Virginia's workers why they should earn less than workers in Maryland where the minimum wage is already $1.50 higher. \nhttps://t.co/nfKRulaZyq","date":"Wed Feb 02 16:58:25 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the @Chamber757 Strome Business Series with today’s speaker, President Brian Hemphill from @ODU https://t.co/eayKYJ8K5T","date":"Tue Feb 01 22:15:09 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Inflation is up worldwide from COVID.\n\nWe passed @POTUS’ Rescue Plan which led to the highest GDP growth since 1984 &amp; created a record 6.4M jobs.\n\nWe passed the Infrastructure Law which will improve supply chains and the #BuildBackBetter Act would cut costs for working families.","date":"Tue Feb 01 20:44:02 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"96% of schools were able to re-open safely and stay open because we passed @POTUS’ American Rescue Plan which included the largest one-time investment in K-12 schools to get kids back in the classroom. \n\nEver Republican in Congress voted against it.","date":"Tue Feb 01 19:34:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"#BlackHistoryMonth is a time to reflect on the truths and triumphs of the African-American experience. This month serves as a reminder of the progress we have made and a reminder of the urgent work that lies ahead. https://t.co/9ECcqLDcd1","date":"Tue Feb 01 18:30:43 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Threats, like those made today, rob students and the HBCU community of their sense of safety and security.\n\nI am in contact with ED and DOJ and will continue to monitor this disturbing situation. The individuals responsible for these threats must be held accountable.","date":"Tue Feb 01 00:28:49 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"A record-breaking 14.5M people signed up for coverage under the Affordable Care Act. Instead of sabotaging the ACA like the GOP did in the Trump years, @POTUS &amp; Democrats in Congress passed the #AmericanRescuePlan to make health care more affordable.\nhttps://t.co/7dAVTIaYwb","date":"Mon Jan 31 20:20:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I was proud to vote for @POTUS' Bipartisan Infrastructure Law and secure funding to invest in our communities and create good-paying union jobs. The link below provides key information on all available funding supporting a wide range of projects.\nhttps://t.co/fV1f6rYMiJ","date":"Mon Jan 31 18:38:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great day with @EPAMichaelRegan and @RepElaineLuria. We went to Chesapeake &amp; Smithfield to discuss  how @POTUS’ Bipartisan Infrastructure Law is removing lead from pipes and investing in rural wastewater &amp; stormwater systems. Together, we are building a better America. https://t.co/3rrWguvpLd","date":"Fri Jan 28 20:55:01 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"On Sunday, the federal minimum wage will increase to $15/hour for hundreds of thousands of federal workers &amp; contractors. \nBy raising the federal minimum wage, @POTUS is ensuring that hardworking Americans can provide for themselves &amp; their families.\nhttps://t.co/TbLJyNshSM","date":"Fri Jan 28 19:09:02 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Presented a copy of the Congressional Record entry commemorating the Hampton-Newport News Community Services Board’s 50th Anniversary to Executive Director Natalie Ward Christian and Board Chair Venerria Thomas during the organization’s board meeting this evening https://t.co/Wh6DhxTJvz","date":"Fri Jan 28 01:19:56 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Yesterday, I attended @DragasCenterODU’s Annual Economic Forecast. https://t.co/vXLNwGZXGp","date":"Thu Jan 27 22:42:51 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Fastest economic growth since 1984. #BidenBoom","date":"Thu Jan 27 14:24:46 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Students belong in the classroom. That is why Congressional Democrats passed the #AmericanRescuePlan which included the largest one-time investment in K-12 education so schools could safely re-open and stay open. \n\nEvery Republican in Congress voted against it.","date":"Wed Jan 26 20:42:47 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden #ChildTaxCredit that we enacted in the #AmericanRescuePlan lifted millions of children out of poverty and was a critical investment in families and their health.","date":"Wed Jan 26 16:23:41 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The success &amp; competitiveness of the American economy depends on the strength of our nation’s workforce. The #AmericaCOMPETES Act will connect our students &amp; workers with the skills they need to succeed in high-tech industries while keeping our economy competitive.","date":"Wed Jan 26 14:46:22 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"We passed @POTUS' American Rescue Plan last year which included the largest one-time investment in K-12 schools. Those funds helped schools reopen and safely stay open, got kids back in the classroom, and will make up for lost learning time. Not a single Republican voted for it. https://t.co/TQxvB86y9h","date":"Tue Jan 25 18:43:43 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Trump Admin &amp; Congressional GOP tried to dismantle &amp; sabotage the Affordable Care Act.\n\nLast year, @POTUS &amp; Congressional Democrats boosted the ACA when we passed the #AmericanRescuePlan. Now a record number of people have quality, affordable coverage.\nhttps://t.co/2wxq36MyGb","date":"Tue Jan 25 14:39:15 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS’ Infrastructure Law is delivering results for Virginia. I was proud to work with @MarkWarner @timkaine @RepElaineLuria and @RepMcEachin to secure this funding for Hampton Roads which will boost our economy and make our community more resilient to climate change.","date":"Sun Jan 23 18:07:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"GOOD NEWS! @POTUS has signed the Supplemental Impact Aid Flexibility Act! By delivering support &amp; flexibility, we help ensure that Impact Aid schools can keep teachers and staff on the payroll, purchase textbooks and learning supplies, and keep the lights on in their classrooms.","date":"Fri Jan 21 20:37:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to @CityofNN for being recognized for exemplary work with @ENERGY’s @GoSolSmart program. Wonderful to see Newport News recognized for making it faster, easier, and more affordable to go solar at the @usmayors #MayorsDC22 conference. ☀️https://t.co/eGWuTqqMb8","date":"Fri Jan 21 16:19:21 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS’ Infrastructure Law is a historic investment in jobs and the economy and will accelerate America’s global competitiveness in the 21st century. That might explain why Republicans want to take credit for it even though they voted against it. \n\nhttps://t.co/YfOQoFUPUK","date":"Thu Jan 20 17:38:55 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"History shows that miners and their families will be forced to pay the price if the Black Lung Disability Trust Fund sinks deeper into debt. Congress must take action to ensure coal companies pay their fair share to secure future benefits and health care for disabled miners.","date":"Thu Jan 20 17:08:52 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"In the year since @POTUS &amp; @VP were sworn in:\n💉200 million Americans vaccinated\n💼 6.4 million jobs added - the most ever in 1 year\n🇺🇸Enacted American Rescue Plan &amp; Infrastructure Law \n📉 Lowest child poverty rate ever\n⚕️ 5 million more ppl w/ health care\nhttps://t.co/5lgYz7l5MX","date":"Thu Jan 20 14:16:03 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Congressional Republicans have no agenda. No plan for the economy or COVID-19. \n\nSince @POTUS &amp; @VP were inaugurated, we enacted the American Rescue Plan &amp; the Bipartisan Infrastructure Law &amp; created over 6M jobs. We will continue investing in jobs &amp; cutting costs for families.","date":"Wed Jan 19 21:40:50 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"@TheMindOfBA @USPS @MarkWarner @timkaine Please contact my Newport News District Office at 757-380-1000. A member of my staff may be able to assist you with this issue.","date":"Wed Jan 19 20:32:43 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"#DemocratsDeliver jobs not mobs.","date":"Wed Jan 19 20:04:52 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"GREAT NEWS! Thanks to @POTUS' Infrastructure Law,  there will be $369 million in federal funding for a number of key projects, including the City of Norfolk’s Coastal Storm Risk Management project and the Norfolk Harbor Widening and Deepening project. https://t.co/ydtCDCkW0m","date":"Wed Jan 19 19:38:39 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Inflation is a global problem caused by supply chain issues caused by the pandemic. The Biden Admin has been working to unclog supply chains &amp; bring down gas costs. And the #BuildBackBetter Act will cut taxes &amp; costs for working families.\n\nThe GOP has no real plan to address it.","date":"Tue Jan 18 18:12:02 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The @WhiteHouse has announced that at-home COVID-19 tests will be available at https://t.co/T3ZYjkX3wD and will be mailed directly to American households for free. Tests will typically ship within 7-12 days of ordering, and be delivered First Class through @USPS.","date":"Tue Jan 18 17:23:31 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see the community and elected officials turn out for Mayor McKinley Price’s #MLKDayofService Food Drive at the Virginia Peninsula Foodbank https://t.co/rtdD1DGFFp","date":"Mon Jan 17 22:34:53 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"“Change does not roll in on the wheels of inevitability, but comes through continuous struggle.”\n \nToday, we pay tribute to #MLK by continuing the fight for racial justice, social justice, economic justice and environmental justice for all.","date":"Mon Jan 17 15:52:00 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Was honored to participate in the Annual Feeding 5000 event during this #MLKWeekend of service https://t.co/Tlmb4Ab6BW","date":"Sun Jan 16 21:26:19 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Omicron surge is forcing workers to choose between going to work while COVID+ and endangering their colleagues or taking 1-2 weeks of unpaid leave.\n \nWorkers need immediate relief!","date":"Fri Jan 14 19:59:26 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"As Americans continue to deal with the global inflation problem caused by the pandemic, the Biden #ChildTaxCredit payments were a critical lifeline to working families. \n\nThe Senate must pass the #BuildBackBetter Act to keep those middle class tax cuts in place. https://t.co/DwpoU3vQ58","date":"Fri Jan 14 18:26:11 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"A record number of people have signed up for insurance through the Affordable Care Act this year. Thanks to the #AmericanRescuePlan, health care is more affordable than ever at https://t.co/aUuUw8G2OG so #GetCovered before the deadline tomorrow. \nhttps://t.co/IUThL9MZOd","date":"Fri Jan 14 17:41:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I was a proud supporter of @POTUS' Infrastructure Law which is now delivering results for Virginia, which will receive $536.8 million -- the largest-ever investment in our bridges. This will make our community safer &amp; support economic growth throughout the Commonwealth. https://t.co/rl3NjHUAoI","date":"Fri Jan 14 17:29:00 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, the House passed the 3rd piece of legislation this Congress to protect access to the ballot box. The Senate must act to end the national Republican campaign to suppress the vote.","date":"Thu Jan 13 17:40:37 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Republicans have no plan to address the global inflation problem. \n\nExperts say the #BuildBackBetter Act will reduce inflationary pressures on the middle class by cutting taxes for working families &amp; by reducing the costs of child care &amp; prescription drugs.https://t.co/XSaRDYYBAL","date":"Thu Jan 13 00:04:28 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Inflation is up globally as supply chains were squeezed by COVID. Our economy is recovering faster than others due to the #AmericanRescuePlan &amp; @POTUS' policies which created 6.4M jobs &amp; reduced unemployment to 3.9%. The #BuildBackBetter Act would also cut costs for families.","date":"Wed Jan 12 16:06:17 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"We know that students learn best when they’re in the classroom. \n\nI applaud the Biden Administration for responding to schools’ urgent needs and increasing testing capacity to help schools stay open safely. \nhttps://t.co/oUzN62ta1J","date":"Wed Jan 12 14:33:05 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Americans continue dealing with the impacts of the pandemic &amp; high-energy costs. That's why @POTUS &amp; Democrats delivered double the normal investments in  Virginia from Low Income Home Energy Assistance Program (LIHEAP) through the #AmericanRescuePlan &amp; annual appropriations. https://t.co/zv4H7NeqtY","date":"Tue Jan 11 20:36:22 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Everyone but @HouseGOP can solve this one.","date":"Tue Jan 11 19:39:33 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS and Congressional Democrats spent 2021 enacting the American Rescue Plan and the Bipartisan Infrastructure Law to invest in jobs and families. \n\nCongressional Republicans spent the year obstructing and rooting against the economy. \nhttps://t.co/Vlwxmw7Ntc","date":"Tue Jan 11 17:17:49 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Happening now -- My Public Health Webinar on COVID-19 with health experts from Sentara. Join us on YouTube at: https://t.co/qxji0WR1qZ","date":"Tue Jan 11 00:26:26 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Tonight at 7:15pm, I will be hosting a public health webinar on COVID-19. I will be joined by health experts to discuss the Omicron variant, vaccinations, and answer any questions you may have. Register for the webinar at the link below. \nhttps://t.co/LswIZ3AuL5","date":"Mon Jan 10 14:24:03 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"At the Hampton Roads Convention Center with Dr Keith Newby, Janice Underwood (Gov Northam’s Chief Diversity Officer) and Gaylene Kanoyton. COVID-19 tests and vaccines are available until 4pm. https://t.co/VBilpIOP9L","date":"Sat Jan 08 18:36:00 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I have known Lani Guinier since we were in college. She was a strong and visionary advocate for voting rights. My thoughts and prayers are with her family, friends, and many others positively impacted by her life’s work. \nhttps://t.co/I6RNbVuHFP https://t.co/QwLAHLwKyz","date":"Fri Jan 07 22:10:25 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS and Congressional Democrats deliver jobs not mobs. #BidenBoom","date":"Fri Jan 07 21:20:38 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s jobs report caps a historic year of recovery. Under the Biden-Harris Administration, our nation created more jobs in 2021 than any other year on record. https://t.co/nWP1LDHpU8","date":"Fri Jan 07 16:22:37 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"About to appear on #RolandMartinUnfiltered to discuss the first anniversary of #January6th. Tune in below.","date":"Thu Jan 06 23:01:44 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"I look forward to reviewing the recommendations of @January6thCmte on how we can best preserve and protect our Democracy. It is our duty to the Constitution and the American people to get to the truth and ensure that such an assault on our Democracy never happens again.","date":"Thu Jan 06 15:01:08 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The House has already taken important steps to protect the right to vote by passing the John Lewis #VotingRightsAdvancementAct and the #ForThePeople Act. But those pieces of legislation alone are not sufficient to prevent the next attempt to overturn the will of the voters.","date":"Thu Jan 06 14:59:32 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Big Lie has been used as pretext all over the country for rampant efforts to suppress the ability to vote, to install election officials willing to openly ignore the legal votes of the people, and to enact other mechanisms to overturn the results of future elections.","date":"Thu Jan 06 14:56:59 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Sadly, the threat to our Democracy is ongoing. Adherence to the former president’s ‘Big Lie’ about the 2020 election is now the most important litmus test for my colleagues on the other side of the aisle.","date":"Thu Jan 06 14:55:20 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"While we were not deterred from fulfilling our constitutional duty, it still concerns me that just hours after this violent insurrection so many of my colleagues – 147 to be exact –voted to overturn the legally cast votes of millions of our fellow Americans.","date":"Thu Jan 06 14:54:51 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Capitol Police force was overwhelmed. Members of Congress, congressional staff, reporters, and support personnel were forced to hide from the violent mob storming and ransacking our Capitol. Several individuals lost their lives, including multiple police officers.","date":"Thu Jan 06 14:54:27 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Today marks the 1 year anniversary of the violent assault on the US Capitol. https://t.co/TvaYpXEtzc","date":"Thu Jan 06 14:54:03 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Was honored to attend the Oath of Office Ceremony this afternoon for Norfolk’s Commonwealth’s Attorney Ramin Fatehi https://t.co/7mBCnbOcL7","date":"Wed Jan 05 22:10:05 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Over 800,000 jobs were added in December. @POTUS and Congressional Democrats are delivering a robust economic recovery. #BidenBoom","date":"Wed Jan 05 16:36:29 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The Omicron variant is circulating throughout our community. Make sure you know where you can get a test. \nhttps://t.co/I6cbwlVWsX","date":"Wed Jan 05 14:40:09 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan was the largest one-time investment in K-12 schools, and it’s making sure we can safely keep kids back in the classroom.","date":"Tue Jan 04 20:38:39 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Get your shots ➡️ https://t.co/ZoUvQhr9Kk","date":"Tue Jan 04 20:16:58 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"#HappyNewYear and welcome to 2022! I am looking forward to another year working on behalf of Virginia’s Third Congressional District and leading the @EdLaborCmte. While we accomplished a lot in 2021, there is much more work to be done to #BuildBackBetter #ForThePeople. https://t.co/xrpxm2hQkx","date":"Sat Jan 01 18:54:18 +0000 2022","user_id":"161791703"},{"handle":"BobbyScott","text":"Harry Reid was one of the most consequential congressional leaders in modern history and leaves behind a remarkable list of achievements. He was a skilled legislator and critical to passage of the Affordable Care Act. Sending condolences to his family.","date":"Wed Dec 29 17:03:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Despite some headwinds, @POTUS and Congressional Democrats are delivering a robust recovery while Congressional Republicans root against the American economy. https://t.co/pWRzPgumtv","date":"Mon Dec 27 20:45:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Wishing a happy first day of #Kwanzaa to everyone celebrating! https://t.co/G3ecPJEdp7","date":"Sun Dec 26 15:30:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Wishing everyone a #MerryChristmas ! https://t.co/W9dA6OvxwK","date":"Sat Dec 25 14:30:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The vaccines could save your life. But don't take my word for it: listen to former president Donald Trump.","date":"Thu Dec 23 15:34:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Keeping former Virginia Governor and Senator Chuck Robb and his wife Lynda in my thoughts and prayers. \nhttps://t.co/JLMkRpCSJf","date":"Thu Dec 23 00:15:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is good news. Earlier this year, we made health insurance offered under the Affordable Care Act more affordable than ever when we passed the American Rescue Plan. January 15th is the deadline to sign up for coverage for 2022. Head to https://t.co/aUuUw8G2OG and #GetCovered.","date":"Wed Dec 22 20:03:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I applaud the Biden Administration’s decision to extend relief for student loan borrowers in response to the surge in COVID-19 infections. This is the right thing to do for student loan borrowers and families across the country.","date":"Wed Dec 22 17:32:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Between the American Rescue Plan and the passage of 13 bills, the @EdLaborCmte Democrats delivered results for students, families and workers in 2021. #DemocratsDeliver","date":"Wed Dec 22 15:21:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan provided schools the resources they need to reopen safely, stay open safely, and get students back on track. https://t.co/aYf1A2kw0y","date":"Tue Dec 21 20:33:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Agreed.","date":"Tue Dec 21 20:30:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The spread of the Omicron variant is concerning but @POTUS is right. Get vaccinated and get boosted at  https://t.co/ZoUvQhr9Kk","date":"Tue Dec 21 19:58:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I am holding a Telephone Town Hall tonight at 6pm to discuss the Bipartisan Infrastructure Law (BIL). We will discuss how the the BIL is a historic investment in jobs and the economy and how it will benefit Hampton Roads. You can register at https://t.co/AZ3WdpXIgk https://t.co/1dIXJyVA8a","date":"Tue Dec 21 15:20:07 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The @PortofVirginia has been awarded a $20 million grant from @USDOT to develop the Portsmouth Marine Terminal as a hub for offshore wind. I am thrilled to see this project move forward. The economic impact will be significant and far reaching. https://t.co/p4LsuJApP9","date":"Mon Dec 20 21:51:47 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"There is more work to do, but we have made significant progress this year with the passage of the American Rescue Plan and the Bipartisan Infrastructure Law. #DemocratsDeliver","date":"Mon Dec 20 21:28:25 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I will not stop working to lower costs for families and create good-paying jobs for our nation’s workers. Our constituents sent us to Congress to get things done. In the days and weeks ahead, we must find a path forward to deliver for the American people. https://t.co/sQP1OHrQ2P","date":"Mon Dec 20 19:45:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Get vaccinated and get your booster ➡️ https://t.co/ZoUvQhr9Kk","date":"Mon Dec 20 15:15:19 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended “The Biggest Holiday Event of the Year”, where Hampton Social Services and other organizations joined together to ensure a deserving local family has gifts for Christmas https://t.co/YUryLNgxhl","date":"Sun Dec 19 03:56:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see personnel from Fort Eustis, the law enforcement community and other volunteers during the Food Drop Off today at the Denbigh Community Center in Newport News https://t.co/OAFJEbtnH4","date":"Sat Dec 18 19:32:23 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to Hampton’s new Treasurer Chris Snead, who was sworn in this afternoon by retired Judge Wilford Taylor, Jr. https://t.co/flXNVN56Te","date":"Sat Dec 18 00:20:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Took a tour of @HRSDVA’s SWIFT Research Facility and discussed how the Bipartisan Infrastructure Law will boost this type of work by making investments in clean water, climate resilience, and restoring the Chesapeake Bay. https://t.co/wLhGxBBnmR","date":"Fri Dec 17 22:38:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I will be hosting a Telephone Town hall on the Bipartisan Infrastructure Law on Tuesday, December 21st at 6:00pm. You can register to join at https://t.co/oCB9QDWddr https://t.co/LAY7q62cMy","date":"Fri Dec 17 19:36:52 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today's announcement includes more than $34 million to help Virginia school meal programs deal with supply chain challenges brought on by the pandemic. https://t.co/ZJQ6rflZvG","date":"Fri Dec 17 17:31:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The COVID-19 pandemic has created unprecedented challenges for school meal programs. I applaud the Biden Administration for taking action to help provide children the healthy nutrition they need to learn and grow.","date":"Fri Dec 17 17:31:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Very honored to accept the @Chamber757 2021 Regional Statesman Award this evening during the BRAVO! Awards Dinner &amp; LEAD757 Class of 2021 Graduation https://t.co/DhRyAkVnVe","date":"Fri Dec 17 02:39:23 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Republicans undermined efforts to end the COVID-19 pandemic and attacked the American Rescue Plan which got kids back in schools, put money in people's pockets and got our economy back on track. Now those same Republicans want to take credit for it.  \nhttps://t.co/fRrw9eo8zo","date":"Thu Dec 16 20:34:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"My thoughts are with the workers who were injured or killed during the tornadoes.\n\nWorkplace safety agencies must conduct a full investigation into these tragic workplace injuries and deaths.","date":"Thu Dec 16 16:31:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden Child Tax Credit, which we enacted with the American Rescue Plan, has lifted millions of children out of poverty this year. The Senate must pass the Build Back Better Act to extend this vital tax cut for working families. \nhttps://t.co/37UpIfPTlt","date":"Wed Dec 15 17:33:02 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Get vaccinated and get your booster when you are eligible at https://t.co/ZoUvQhr9Kk. It is the best way to protect yourself and your community.","date":"Wed Dec 15 17:13:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the VA National Guard 1-111th Artillery Regiment Departure Ceremony today. Pictured with Rep Luria and the Adjutant General of Virginia, Major General Timothy P. Williams https://t.co/c6E0rVZqLh","date":"Tue Dec 14 03:07:35 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to have @timkaine and @MarkWarner in Hampton Roads for the @Chamber757 Senatorial Forum today https://t.co/uFQwYXlp4D","date":"Tue Dec 14 02:36:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS and Congressional Democrats strengthened the Affordable Care Act when we enacted the American Rescue Plan. Coverage is more affordable than ever before so head over to https://t.co/aUuUw8G2OG and #GetCovered. \nhttps://t.co/wLdjG2jod7","date":"Mon Dec 13 19:41:35 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"\"A group of 56 economists says President Biden’s Build Back Better Act would counteract the impact of rising prices on Americans’ wallets.\" \nhttps://t.co/A31sU7X5Zh","date":"Fri Dec 10 14:36:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Workers who organize a union consistently have higher pay, better benefits, and safer working conditions. Congratulations to the workers who bravely exercised their right to stand together and negotiate with their employer.","date":"Thu Dec 09 19:07:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I join @SenBillNelson in congratulating the 10 astronauts selected for the Artemis Generation and look forward to the work they will do to advance understanding and improve life on Earth. It is no surprise that half of those selected have ties to Virginia!","date":"Thu Dec 09 17:00:26 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Family caregivers provide essential support at an extraordinary cost to their own wellbeing.\n\nIt was an honor to join @DiverseElders &amp; @NA4Caregiving to discuss how we can deliver investments that protect the lives &amp; livelihoods of seniors and caregivers. https://t.co/Nh7yw9intE","date":"Wed Dec 08 22:12:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is great news for Virginia's schools.\n\nThe past 18 months have been challenging for students, parents, and teachers. Now, thanks to the funding in the #AmericanRescuePlan, teachers in Virginia may get a much needed raise.\nhttps://t.co/FNwpZsBu8V","date":"Wed Dec 08 21:21:50 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Vital infrastructure, not violent insurrection. \nhttps://t.co/fV1f6sgnah","date":"Wed Dec 08 17:40:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Get your booster to protect yourself against Omicron. https://t.co/ZoUvQhr9Kk","date":"Wed Dec 08 15:07:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This bill also includes my bipartisan EMBRACE Stormwater Management Act to reduce flooding on and around military bases, which jeopardizes military readiness, compounds stress for military families and pollutes bodies of water like the Chesapeake Bay.","date":"Wed Dec 08 03:03:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This legislation includes critical investments in shipbuilding which is a huge win for Hampton Roads. I am also encouraged by the bill’s inclusion of a well-deserved pay increase for our servicemembers as well as a guarantee of paid parental and bereavement leave.","date":"Wed Dec 08 03:02:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"As the Dean of the Virginia Congressional Delegation, I had the pleasure of welcoming Governor-elect Youngkin to Capitol Hill today. Looking forward to working together on behalf of the Commonwealth. https://t.co/kgMErnqIYJ","date":"Tue Dec 07 18:13:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We lifted millions of children out of poverty with the Biden Child Tax Credit when we enacted the American Rescue Plan. We must extend this critical tax cut for working families with the Build Back Better Act. \nhttps://t.co/ZeaIrVyNKK","date":"Tue Dec 07 17:58:19 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Good news. And the investments made in the Bipartisan Infrastructure Law and the Build Back Better Act will ease inflationary pressures and help further cut costs for families.","date":"Tue Dec 07 15:59:16 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan is getting Americans back to work and getting the country back on track.\n\nThe Bipartisan Infrastructure Law and the Build Back Better Act will build on this progress as we make further investments in jobs and families.","date":"Mon Dec 06 16:06:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"From the brothers of Alpha Phi Alpha on Capitol Hill, Happy Founders Day @apa1906NETwork! https://t.co/uIX4nt2qk3","date":"Sat Dec 04 17:09:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Bipartisan Infrastructure Law invests more than $8 billion in VA which is essential for Hampton Roads' climate readiness. The Build Back Better Act would save the average family $500 annually on their utilities AND reduce emissions to prevent the worst of the climate crisis.","date":"Fri Dec 03 18:43:35 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I am grateful that Hampton Roads was largely spared this hurricane season. The Biden-Harris Administration and Democrats in Congress continue our work to #BuildBackBetter and protect our communities moving forward.\nhttps://t.co/54aBt9eYA8","date":"Fri Dec 03 18:42:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"To continue our economic recovery, and address the potential threat of the new Omicron variant, it’s essential that you roll up your sleeve and get your vaccination and booster shot. \n \nSchedule today and protect yourself and your community: https://t.co/ZoUvQhr9Kk","date":"Fri Dec 03 15:05:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s jobs report demonstrates once again that America is on the move: \n \nJobs are up, unemployment is down, and @POTUS has created more jobs in his first year in office than any other modern President. https://t.co/BsF1tCUAK4","date":"Fri Dec 03 15:05:07 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We have created over 5.6 million jobs since @POTUS took office by passing the American Rescue Plan and  the Bipartisan Infrastructure Law. We will continue to invest in jobs and cut costs for families when we enact the Build Back Better Act.","date":"Thu Dec 02 22:55:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #BuildBackBetter Act includes more than 130 programs that would invest nearly $600 billion in climate action, clean energy jobs, and healthier living conditions for families. The Senate needs to pass it so we can send it to @POTUS’ desk. https://t.co/l3SS4hn2p2","date":"Thu Dec 02 21:15:47 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"People support the Build Back Better Act because it will reduce inflationary pressures on families &amp; cut costs for the middle class by making corporations pay their fair share. \nNot a single House Republican voted for the bill which says something about their priorities.","date":"Thu Dec 02 18:22:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The residents of Hampton Roads deserve transparency, accountability, and confidence in the investigation of Mr. Lynch's death. See more information here: https://t.co/6T3Oe2nbBD","date":"Wed Dec 01 23:08:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"In April, I urged @TheJusticeDept to open a federal investigation into the police conduct and killing of Donovon Lynch. Today, I reiterated that demand since the Commonwealth’s Attorney announced that the officer responsible for shooting Mr. Lynch would not face criminal charges.","date":"Wed Dec 01 23:07:23 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"In just the last year, AmeriCorps members in my district have helped seniors live independently and helped our youth develop literacy skills — and since its founding, over 1,900 members from my district have been mobilized, serving more than 3 million hours. https://t.co/PmR212XhkJ","date":"Wed Dec 01 16:34:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"People are hurting as corporations take advantage of the pandemic to squeeze consumers. That is why we enacted the Biden Child Tax Credit and must pass the Build Back Better Act to continue cutting costs for families.","date":"Tue Nov 30 15:46:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan was the largest one-time investment in K-12 schools in our history. And it got students back in the classroom. \n\nEvery Republican voted against it.","date":"Tue Nov 30 15:29:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Republicans already voted against the American Rescue Plan which got kids back in school, created millions of jobs &amp; cut child poverty in half. \n\nNow their plan to address inflation, which has been caused by the pandemic, is to let COVID-19 run rampant. \n\nhttps://t.co/oTL6Spuw5M","date":"Mon Nov 29 19:04:19 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Getting people vaccinated is key to keeping people safe from COVID-19, preventing the emergence of variants, keeping kids in schools and moving the economic recovery forward. \n\nRepublicans should help with that effort or get out of the way. \nhttps://t.co/IJNhc3GqPS","date":"Mon Nov 29 16:16:50 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"#HappyHanukkah to all those celebrating! May this be a time of joy, for you and your family. https://t.co/9NsKXJAh3q","date":"Sun Nov 28 21:16:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Go to https://t.co/ZoUvQhr9Kk to get vaccinated and get your booster. It is the best way to protect yourself and your community.","date":"Sat Nov 27 23:59:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Wishing everyone a #HappyThanksgiving filled with joy and gratitude! https://t.co/M4BlcUc9CQ","date":"Thu Nov 25 14:30:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great news. @POTUS and Congressional Democrats are overseeing a historic economic recovery. And we are going to keep the progress going with the Build Back Better Act to continue investing in jobs and further cut costs for families.","date":"Wed Nov 24 15:45:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined @DonnieTuck for a tour of Advanced Aircraft Company, a veteran-owned and operated manufacturer of unmanned electric-gas hybrid propulsion aerial vehicles https://t.co/aJQjBHnC5D","date":"Tue Nov 23 19:34:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS is right. Our economic recovery from COVID-19 has been largely successful and there is more work to do. The Bipartisan Infrastructure Bill and the Build Back Better Act will build on that progress, make further investments in jobs and cut down on costs for families.","date":"Tue Nov 23 15:26:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Over 83,000 Biden #ChildTaxCredit monthly payments were sent to families in VA-03 this month! Tax cuts for Virginia families before Thanksgiving means gas in the car for that trip to see loved ones and more money for groceries to put food on the table. https://t.co/qZh8u0mPpV","date":"Mon Nov 22 21:20:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined my colleagues @RobWittman @RepElaineLuria and @RepMcEachin at the @Chamber757 Congressional Forum earlier today to discuss our economic recovery from the pandemic. https://t.co/pNeDm6AqmR","date":"Mon Nov 22 19:00:44 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Stopped by the “Put the Guns Down, Pick the Mic Up\" Community Assessment Survey Kickoff and Talent Showcase in Hampton this afternoon https://t.co/EC2Rp1YxyL","date":"Sun Nov 21 02:01:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulated Chesapeake’s Andolyn Medina, the reigning Miss District of Columbia, during her send off to compete in the Miss America Pageant next month. https://t.co/6VPzFXMnTi","date":"Sun Nov 21 01:41:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great turnout at the Annual Feeding 5000 Thanksgiving Harvest and Community Celebration at New Beech Grove Baptist Church https://t.co/vWwtlV08Qi","date":"Sun Nov 21 01:22:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Honored to participate in the Thanksgiving Turkey Giveaway at Norcom High School today https://t.co/f6eQ8anltT","date":"Sun Nov 21 00:39:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see the community come together to support families in need at Suffolk City Councilman LeOtis Williams’ Annual Thanksgiving Turkey Giveaway https://t.co/xXYfvSP8Jv","date":"Sat Nov 20 22:05:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Proud to have secured another major investment for HBCUs in the Build Back Better Act. Not including this bill, we have delivered more than $6.5 billion for HBCUs over the last two years - more federal $ than they received in the previous 10 years combined.","date":"Fri Nov 19 16:33:44 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joining @SpeakerPelosi and other Democratic Leaders to celebrate the passage of the Build Back Better Act.","date":"Fri Nov 19 15:23:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The House just took a major step toward delivering historic investments in America’s future. The #BuildBackBetter Act will lower costs for nearly every family, create millions of good-paying jobs, &amp; improve the quality of life for the people we represent. https://t.co/K5nNGnIisH","date":"Fri Nov 19 14:47:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Build Back Better Act is paid for and will create jobs and cut costs for families. \n\nBy comparison, Republicans added TRILLIONS to the deficit when they enacted the 2017 GOP Tax Scam to give tax cuts to corporations and the wealthiest earners.","date":"Fri Nov 19 01:13:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The 2017 GOP Tax Scam added TRILLIONS of dollars to our deficit.","date":"Thu Nov 18 22:17:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan and @POTUS’ handling of COVID-19 is fueling our strong economic recovery. \n\nAnd we will build on this progress with further jobs investments in the Bipartisan Infrastructure Bill and cut costs for families with the Build Back Better Act.","date":"Thu Nov 18 15:08:25 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Build Back Better Act will improve the lives of American families and set the foundation for a better future for students, workers, families, and our economy.","date":"Thu Nov 18 00:52:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Throughout her tenure at the NAACP LDF, @Sifill_LDF has been a fierce and effective advocate for equity in education, workplaces, and society.\nI am grateful to Sherrilyn for her tireless work, and I know she will continue to be a strong voice on these important issues.","date":"Wed Nov 17 22:25:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Americans send us to Congress to be their voice in Washington, and we are expected to conduct ourselves with dignity and respect. The conduct of Congressman Gosar degrades the honor of the office that we hold. My statement: https://t.co/p2QCs4hJOx","date":"Wed Nov 17 21:44:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Further evidence that American Rescue Plan is working. \n\n@POTUS and Congressional Democrats are overseeing a robust economic recovery and we will build on this progress with the Bipartisan Infrastructure Bill and the Build Back Better Act.","date":"Wed Nov 17 16:47:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Do not listen to the GOP spin and misinformation. \n\nIndependent ratings agencies say the Bipartisan Infrastructure Bill &amp; the Build Back Better Act \"help to lift long-term economic growth via stronger productivity and labor force growth, and thus take the edge off of inflation.\"","date":"Wed Nov 17 14:34:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Vital infrastructure, not violent insurrection.","date":"Tue Nov 16 18:10:59 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Bipartisan Infrastructure Deal is great news for Virginia and the rest of the country.","date":"Tue Nov 16 17:27:21 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Friendly reminder that the Biden #ChildTaxCredit, alongside help for restaurants, funding for state &amp; local first responders, record job and wage growth and all other benefits of the American Rescue Plan were opposed by every single House Republican\nhttps://t.co/nanmA7W8tB","date":"Tue Nov 16 16:33:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Jobs are up. \nUnemployment is down. \nRetail sales are up. \n\nThe American Rescue Plan is working. The Bipartisan Infrastructure Deal and the Build Back Better Act are historic investments in jobs and families and will build on this momentum.","date":"Tue Nov 16 14:49:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great day in Washington as @POTUS signed the Bipartisan Infrastructure Bill into law. This is a historic investment in jobs, roads, bridges, clean drinking water, broadband and much more. A huge win for Virginia and the rest of the country! https://t.co/hkyRwtez5F","date":"Mon Nov 15 21:46:25 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"As @POTUS says: JOBS, JOBS, JOBS.","date":"Mon Nov 15 21:25:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Here at the @WhiteHouse to see @POTUS sign the Bipartisan Infrastructure Deal! https://t.co/fyhGcpCubD","date":"Mon Nov 15 21:06:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@senrobportman is right. Both the Bipartisan Infrastructure Deal and the Build Back Better Act will reduce inflation and cut costs for families.","date":"Mon Nov 15 21:01:05 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Looking forward to going to the @WhiteHouse today as @POTUS signs the Bipartisan Infrastructure Deal into law. This is how we will build back better after COVID-19 and represents a historic investment in jobs, roads, bridges, clean drinking water &amp; public transportation","date":"Mon Nov 15 17:36:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I applaud the @USDOL for halting the previous Admin’s scheme to divert funding away from proven Registered Apprenticeships.\n\nEvery $ spent on IRAPs was a $ stolen from high-quality apprenticeships that are proven to help Americans get good-paying jobs. https://t.co/s1jd9XgQBs","date":"Mon Nov 15 17:10:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Honored to attend the Christening Ceremony for the USS New Jersey (SSN-796) with my colleagues @DonaldNorcross and @RepElaineLuria today at Newport News Shipbuilding https://t.co/pA9u7TK1ME","date":"Sat Nov 13 19:06:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Visited @gohrt_com with @RepElaineLuria to discuss how the Bipartisan Infrastructure Bill invests in jobs &amp; includes funds for electrifying buses. HRT already runs multiple all-electric, zero emissions buses and we are going to take public transportation further into the future. https://t.co/IJATzNYE3V","date":"Fri Nov 12 21:40:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the City of Norfolk Annual Veterans Day Ceremony. https://t.co/1IdPm2ZF7Z","date":"Fri Nov 12 02:57:51 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Observed #VeteransDay2021 at the program presented by the Braxton-Perkins Post No. 25 of the American Legion at the Victory Arch in Newport News https://t.co/X3qAsrKpwk","date":"Thu Nov 11 20:07:09 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended a Remembrance Ceremony at the First African Landing Site at Fort Monroe this morning with special guest Nicole Hannah-Jones and elected officials https://t.co/Lxn7XuREF4","date":"Thu Nov 11 18:41:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"#VeteransDay marks an important opportunity for our nation to honor all who have bravely served &amp; remember those who made the ultimate sacrifice in the name of freedom. https://t.co/ESvQRAr5MH","date":"Thu Nov 11 13:31:35 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the Hampton VA Medical Center’s Veterans Day ceremony earlier today. https://t.co/5XwtHO57LR","date":"Wed Nov 10 21:06:05 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The bipartisan infrastructure bill is a big investment in jobs and the economy and a massive win for Virginia!","date":"Wed Nov 10 20:21:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #RISEAct will make meaningful improvements to ensure that our retirement system better serves and supports our nation’s workers and retirees.","date":"Wed Nov 10 19:36:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden #ChildTaxCredit, enacted with the Rescue Plan, is giving working families a much needed tax break and reducing child poverty in HALF! \n\nThe deadline to sign up is Nov 15th, but be on alert for scams. Sign up here: https://t.co/iQ4hOrWrys\nhttps://t.co/eEQxC4SGyz","date":"Tue Nov 09 16:27:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Bipartisan Infrastructure Bill includes a historic investment in resilient infrastructure to protect communities, like Hampton Roads, that are already living with the effects of climate change.\n\nThis is good for the economy and good for our communities\nhttps://t.co/uqfSmZovyD","date":"Mon Nov 08 22:19:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Civil rights laws are intended to protect the victims of discrimination, not empower those who seek to discriminate. I applaud the Biden Administration for taking this important step to restore civil rights protections for the employees of federal contractors.","date":"Mon Nov 08 17:30:07 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Jobs are up. ⬆️\nWages are up. ⬆️\nUnemployment is down. ⬇️\nCOVID-19 hospitalizations and deaths are down. ⬇️\n\nAnd we just passed the Bipartisan Infrastructure Deal which is a major investment in jobs and infrastructure. @POTUS and Congressional Democrats are delivering results.","date":"Mon Nov 08 16:27:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Far too many older Americans are working later in their lives and still relying on their next paycheck to cover monthly expenses. \n\nThe #RISEAct is a bipartisan proposal that will help Americans prepare for, and achieve, the secure retirement they deserve.","date":"Mon Nov 08 15:23:50 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Stopped by a vaccination and healthcare insurance marketplace enrollment event today. Great to see people taking advantage of these services. https://t.co/L2mhZsSE4G","date":"Sat Nov 06 23:45:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see the community come together to encourage our middle schoolers at the STEM Exploration Community Event at Brooks Crossing today https://t.co/3u6ZZabJ28","date":"Sat Nov 06 21:44:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave remarks this morning during the Groundbreaking Ceremony for @_BGCVP’s Citizen’s Unit, in partnership with @cityofhampton https://t.co/f4DHqk81m4","date":"Sat Nov 06 19:15:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This bill represents a much-needed investment in jobs and our economy as we rebuild America’s infrastructure, including roads, bridges, public transit, ports, and broadband, as well as making our electric grid more resilient to climate change.  https://t.co/v9lRLNcPYP","date":"Sat Nov 06 03:42:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s jobs report demonstrates that the BidenHarris economic agenda is putting people back to work. Now it’s time to pass the #BuildBackBetter Act &amp; Infrastructure Investment &amp; Jobs Act to lock in the progress we’ve seen &amp; ensure all workers can succeed. https://t.co/fc3ibEYvcb","date":"Fri Nov 05 17:49:43 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thankful for Senator @timkaine's commitment to enhancing resilience and protecting the Chesapeake Bay. Our EMBRACE Stormwater Management Act would be a win-win-win for the military, stormwater-stressed waterways, and all of Hampton Roads.","date":"Thu Nov 04 21:21:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden Administration is demonstrating the leadership that this moment requires. Workplace vaccination policies will save lives, protect our economic recovery, and help us finally get things back to normal.\n\nMy statement: https://t.co/hPSLp4zVok","date":"Thu Nov 04 13:34:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The @US_FDA and @CDCgov have now approved vaccines for children ages 5 and older. Make sure they get vaccinated at https://t.co/ZoUvQhr9Kk. The vaccines will keep you, your family, and your community safe.","date":"Wed Nov 03 20:26:59 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I was honored to call her a mentor and friend, and I send my condolences to her family, friends, and the countless individuals positively impacted by her life.","date":"Wed Nov 03 19:22:43 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Over the course of her extraordinary life and career, Flora’s work was always centered on bettering the lives of children through education, and her legacy lives on in all those she taught and mentored.","date":"Wed Nov 03 19:22:22 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Newport News and Virginia have lost a fearless leader and public servant today with the passing of Flora Crittenden. She served our community in many ways as a teacher, guidance counselor, city councilwoman, and delegate in the Virginia General Assembly.\nhttps://t.co/iqufov48A8","date":"Wed Nov 03 19:22:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanks, Gracie, for speaking with me about how the American Rescue Plan is helping students thrive.","date":"Wed Nov 03 18:04:35 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Republican leaders still deny the science of climate change. \n\nThe Build Back Better Framework will create jobs as we tackle the climate crisis.","date":"Tue Nov 02 17:02:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Reminder that families across America can now enroll in affordable, accessible and life-saving health coverage for 2022 through https://t.co/aUuUw8G2OG. Head over today and #GetCovered.","date":"Mon Nov 01 19:55:50 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Since I became Chairman of the @EdLaborCmte, we have secured more than $6.5 billion for HBCUs, which is more federal funding than they received in the last 10 years combined. As Congress finalizes the Build Back Better Act, we’re delivering for HBCUs again.","date":"Fri Oct 29 20:50:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great news!","date":"Fri Oct 29 19:28:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"My statement on the passing of former Virginia Governor Linwood Holton. https://t.co/m8ky6FWfjE","date":"Fri Oct 29 00:54:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Build Back Better Act makes historic investments by making child care affordable &amp; secures universal, high-quality preschool for all 3- and 4-year-olds. This gives parents the freedom to earn a living without having to worry whether their children will be safe &amp; cared for.","date":"Thu Oct 28 21:52:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Build Back Better framework unveiled today would lower costs for nearly every American family, create millions of good-paying jobs, and set a strong foundation for our future. And it will be paid for by making the richest Americans and corporations pay their fair share.","date":"Thu Oct 28 20:17:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great work Virginians! Let's keep the progress going. https://t.co/NNTREYQ1Vk","date":"Wed Oct 27 17:07:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Build Back Better agenda will make investments in jobs and families by making those at the top pay their fair share. Congressional Republicans don't like that. \nhttps://t.co/sKcYcMlB6G","date":"Wed Oct 27 15:06:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The pandemic has increased the risk of intimate partner violence and restricted access to services for survivors. This Family Violence Prevention &amp; Service Improvement Act strengthens supports for survivors and helps prevent intimate partner violence from harming our communities.","date":"Tue Oct 26 20:46:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Doug Parker is the right choice to lead @OSHA_DOL. With the appointment of this well-qualified safety and health expert, workers will have yet another strong ally in the Biden Administration.\n\nhttps://t.co/Ssmq8WbP40","date":"Mon Oct 25 23:26:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It was great to welcome @SecGranholm to Hampton Roads for an exciting announcement about Virginia establishing the first U.S. offshore wind turbine blade facility! This will bring good jobs to VA &amp; boost clean energy efforts. We also got to tour Jefferson Lab in Newport News. https://t.co/eUVGo7SQxS","date":"Mon Oct 25 20:40:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, the House took a major step toward strengthening workplace protections for nursing mothers. https://t.co/7hyCnGssm7","date":"Fri Oct 22 18:02:52 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Facilities that house troubled teens have a solemn responsibility to keep them safe and protect them from abuse. Thank you @ParisHilton for your advocacy on behalf of children and teens. https://t.co/OxA7gamzHu","date":"Fri Oct 22 17:18:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"And the Build Back Better agenda will build on that progress.","date":"Thu Oct 21 19:11:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Important information about COVID-19 vaccine boosters below. Get vaccinated at https://t.co/ZoUvQhr9Kk. And please follow @US_FDA &amp; @CDCgov guidelines for getting your booster when you are eligible.","date":"Wed Oct 20 21:15:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The COVID-19 pandemic upended the economy. Part of building back better means investing in our workforce to ensure we have the skilled workers we need to stay competitive and grow our economy.","date":"Wed Oct 20 18:40:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Build Back Better agenda is a critical investment in jobs and families. And the American people support it. Let's get it done.","date":"Wed Oct 20 15:41:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Get your shots now at https://t.co/ZoUvQhr9Kk","date":"Tue Oct 19 20:19:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Last night, I hosted a webinar on student financial aid where students and parents could ask questions about the federal financial aid process and other available resources. If you missed it, you can watch it below. ⤵️\nhttps://t.co/95XwpsVFJX","date":"Tue Oct 19 15:56:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Went to the @WhiteHouse earlier today to honor the 2020 and 2021 State and National Teachers of the Year with @FLOTUS @SecCardona and  @POTUS. https://t.co/2GhUr4bAcD","date":"Mon Oct 18 21:05:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I am here at the @WhiteHouse with @FLOTUS and @SecCardona to honor the 2020 and 2021 State and National Teachers of the Year.","date":"Mon Oct 18 19:00:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"He treated everyone with dignity and respect, and never put politics before his devotion to our country. I send my condolences to his family and loved ones.","date":"Mon Oct 18 14:45:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Colin Powell was a patriot and dedicated his life to serving the United States both in uniform and as a civilian. Over the course of his historic life and career, he exemplified the temperament and leadership that should be the model for all Americans.","date":"Mon Oct 18 14:45:26 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations, Ms. Fulson!","date":"Fri Oct 15 18:34:23 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"On Wednesday, I attended @Chamber757’s 2021 Resilient and Ready Military Recognition Awards. https://t.co/0crmlBUusi","date":"Fri Oct 15 12:13:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing @MarkWarner and former Norfolk Mayor Paul Fraim during Sen. Warner’s Military and Vaccine Roundtable earlier today https://t.co/gvp7XoeKxz","date":"Thu Oct 14 23:22:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I will be joined by a panel of experts to answer any-and-all questions students and parents may have about the federal financial aid process and other available resources.","date":"Thu Oct 14 21:12:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This Monday, October 18th at 6:30 pm, I will be hosting a webinar on student financial aid! Join us at the link below. ⬇️\nhttps://t.co/ZV2HSelYXw","date":"Thu Oct 14 21:10:47 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to Dr. Corey L. McCray for being selected to serve as the next president of @PDCCC! \nhttps://t.co/OSnkrmlAfS","date":"Thu Oct 14 20:44:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The EMBRACE Stormwater Management Act will protect military bases from extreme flooding fueled by climate change. Thankful for the bipartisan support from @RobWittman @RepElaineLuria @RepSarbanes @RepAnthonyBrown and @RepNancyMace. \nhttps://t.co/anJ4jX44LE","date":"Thu Oct 14 17:18:02 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"“Mandatory minimums”\n“Three strikes and you’re out”\n“Do the adult crime, do the adult time” \n🚩🚩🚩🚩🚩🚩🚩🚩\n\nWhen it comes to criminal justice reform, we need to stop codifying slogans and sound bites and start following the evidence and research instead.","date":"Wed Oct 13 21:14:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I applaud the Biden administration for taking this important step to protect the financial interests of America’s workers and retirement savers.","date":"Wed Oct 13 20:51:33 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thank you to all who have served and Happy Birthday to the @USNavy! #246NavyBirthday","date":"Wed Oct 13 16:42:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"On this #IndigenousPeoplesDay, we honor Native cultures, reflect upon their histories and dedicate ourselves to preserving their future. https://t.co/3qHVMU4F7j","date":"Mon Oct 11 14:03:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time this weekend at the Suffolk Peanut Festival! https://t.co/58NXM2DPO0","date":"Mon Oct 11 13:25:22 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Predatory institutions have cheated students and taxpayers out of billions of dollars. I applaud the Biden administration for restoring an Obama-era enforcement unit to crack down on fraud in higher education.","date":"Fri Oct 08 17:44:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I was encouraged by the great presentation this morning at the Peninsula Chamber of Commerce’s Annual State of the Region breakfast https://t.co/GFCcWzr4I3","date":"Fri Oct 08 17:20:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The investments that @POTUS and Congressional Democrats made in the American Rescue Plan are working.","date":"Thu Oct 07 13:14:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"#ICYMI: This is the comprehensive and sustainable solution that student borrowers deserve, and it will be a major victory for thousands of nurses, teachers, first responders, and other public service workers. \nhttps://t.co/tPjz6n97dG","date":"Wed Oct 06 13:28:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"A typical family of four with an infant in child care in Virginia stands to save $12,680 per year. \n\nThis is a vital investment in our families, our economy and our future. https://t.co/0T8QKNy4y4","date":"Wed Oct 06 12:50:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is why we need to pass the #BuildBackBetter Act.","date":"Wed Oct 06 12:48:44 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Virginians can get their shots at https://t.co/NNTREYQ1Vk to keep up the good work!","date":"Tue Oct 05 18:52:02 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Senate Republicans are risking an economic catastrophe if they continue to block us from raising the debt ceiling to pay for their own spending.","date":"Mon Oct 04 19:39:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave greetings at City Fest, a community festival to highlight local businesses, artists and musicians on the Peninsula https://t.co/AppnQ63MFK","date":"Sun Oct 03 23:47:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had an opportunity to learn about the cultural exchanges taking place between Norfolk and its ten sister cities during the Norfolk Sister City Association Luncheon. Pictured with NSCA President Gary Bonnewell https://t.co/rPJPbdjWwW","date":"Sun Oct 03 21:29:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great evening with the elected officials and dignitaries at the @_BGCVP 25th Dinner Auction https://t.co/CpETxEy4O3","date":"Sun Oct 03 00:37:23 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is the comprehensive and sustainable solution that student borrowers deserve, and it will be a major victory for thousands of nurses, teachers, first responders, and other public service workers.","date":"Fri Oct 01 16:59:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The good news is that we will avoid a government shutdown. \n\nThe bad news is that 175 House Republicans and 35 Senate Republicans all voted for a government shutdown.","date":"Thu Sep 30 20:11:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The @EdLaborCmte's work on emergency child nutrition programs prevented millions of children from going hungry last year. We must continue the fight against child hunger by passing the #BuildBackBetter Act.","date":"Wed Sep 29 17:19:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, the @EdLaborCmte is holding a subcommittee hearing to examine how the American Rescue Plan is helping school districts safely reopen schools. Follow along below. ⬇️","date":"Wed Sep 29 14:20:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Honored to join my friend @RepMcEachin in the effort to preserve and protect the Great Dismal Swamp and to preserve all of the history that it holds","date":"Tue Sep 28 21:23:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It is critical that the TEACH grant program actually works as intended. The House just PASSED the the Consider Teachers Act - a bipartisan legislative fix that ensures TEACH grants will continue to strengthen and expand our nation’s teacher workforce.","date":"Tue Sep 28 20:16:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"My full statement: https://t.co/iEEZ3e4M8k","date":"Tue Sep 28 18:58:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The House just voted to pass the #EQUALAct to finally end the unfair sentencing disparity between crack and powder cocaine. Thanks to @RepJeffries @RepDonBacon @RepArmstrongND for leading this bipartisan bill with me. #EndtheDisparity \n https://t.co/06Rf0KIWxb","date":"Tue Sep 28 18:56:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Republicans are risking a catastrophic default that will put the economy at risk.","date":"Tue Sep 28 01:07:59 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Vaccines work. Per @CDCgov recommendations, I received a COVID-19 booster shot today. Go to https://t.co/ZoUvQhr9Kk to get your shots. More information on boosters can be found below. https://t.co/fRpdzhWzZM","date":"Mon Sep 27 21:27:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We can do this. Go to https://t.co/ZoUvQhr9Kk and get vaccinated.","date":"Mon Sep 27 17:23:50 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Women have the right to make decisions about their health care. I was proud to vote for the Women’s Health Protection Act to finally codify the rights guaranteed in Roe v. Wade. We must protect reproductive rights. #WHPA","date":"Fri Sep 24 17:38:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The bipartisan EMBRACE Stormwater Management Act, which will mitigate flooding on military bases, passed as an amendment to the NDAA today. Thankful for the support of @RobWittman @RepElaineLuria @RepSarbanes  @RepAnthonyBrown @RepNancyMace \nhttps://t.co/j4GvBAWNdM","date":"Fri Sep 24 01:17:21 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Addressing the debt limit isn't about future spending. It is about meeting obligations the government has already made under both Republican &amp; Democratic administrations. If the GOP wants to avoid a catastrophic default that will put the economy at risk, they should vote that way","date":"Thu Sep 23 19:33:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Our nation’s firefighters perform heroically for our communities every day. I was honored to sit down with Edward A. Kelly, General President of @IAFFNewsDesk, to discuss policies to help increase their pay and protect their health and safety. https://t.co/KJtJ43HVPC","date":"Wed Sep 22 22:06:22 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Yesterday, I had the pleasure of talking with President of @UAW about how to raise wages and create innovative partnerships with employers that would benefit both workers and the economy. https://t.co/OnQhgLSHha","date":"Wed Sep 22 21:19:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Get vaccinated. It could save your life. Head to https://t.co/ZoUvQh9ylK today. \nhttps://t.co/XIpvZh4fY8","date":"Wed Sep 22 16:23:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is what Congressional Republicans are supporting by voting for the U.S. to default on its debt.\nhttps://t.co/nwGmqFtNOF","date":"Tue Sep 21 21:00:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I applaud @POTUS for launching this critical effort to protect workers and their families from extreme heat. As climate change continues to make historic heat waves more frequent and more dangerous, workers and their families desperately need strong safety standards.","date":"Tue Sep 21 15:55:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We have an obligation to do everything possible to end the horrific pervasiveness of gun violence in schools and in our communities.","date":"Mon Sep 20 20:10:54 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It is a cruel irony that schools have only just returned to the classroom for full-time instruction since the start of the pandemic and we are already grappling with another act of senseless of gun violence.","date":"Mon Sep 20 20:10:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"My thoughts are with the victims and the entire community at Heritage High School. And I want to commend @NewportNewsPD for their response. While the news crews will eventually leave, many of the students and faculty will carry this event with them for the rest of their lives.","date":"Mon Sep 20 20:09:43 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"My staff and I are closely monitoring the shooting at Heritage High School. Police are advising all parents to pick up their students from the school's tennis courts.","date":"Mon Sep 20 16:48:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Build Back Better Act will lower costs for nearly every American family, secure good-paying jobs for millions of American workers, and set a strong foundation for America’s children. \n\nAnd the American people support it.","date":"Mon Sep 20 16:11:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great evening at the Patient Advocate Foundation’s 20th Annual Promise of Hope Affair https://t.co/13a1UOPFW3","date":"Sun Sep 19 02:38:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanked our community’s military personnel and veterans for their service and sacrifices during the 12th Annual Chesapeake Mayor’s Breakfast to Honor Veterans https://t.co/epk642zAQX","date":"Sat Sep 18 21:16:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today is the beginning of early voting in Virginia.","date":"Fri Sep 17 17:46:47 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan is cutting child poverty in half. \n \nAnd every Republican in Congress voted against it.","date":"Thu Sep 16 20:26:59 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Sadly, it does need to be said. And we are going to fix that with the Build Back Better Act.","date":"Thu Sep 16 20:11:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It was an honor to attend the Presidential Investiture Ceremony for Dr. Javaune Adams-Gaston, the Seventh President of @Norfolkstate https://t.co/hA50jRluF7","date":"Thu Sep 16 19:43:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I will be on @BarbaraHammLee 's show today to discuss how the Build Back Better Act will lower costs for nearly every working family, secure good-paying jobs for millions of workers, and set a strong foundation for America's children. Listen here: https://t.co/QjNrNmjYDb","date":"Thu Sep 16 16:05:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I hope that all those observing #YomKippur have an easy and meaningful fast. https://t.co/v8VaYewC8C","date":"Wed Sep 15 23:44:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing @Norfolkstate Rector  Devon Henry, President Javaune Adams-Gaston, Keynote Speaker @AprilDRyan and Chesapeake Councilwoman Ella Ward at NSU’s Founder’s Day Breakfast https://t.co/Vpfl4cJalI","date":"Wed Sep 15 17:10:22 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanks to @POTUS and Democrats, over 12.2 million people now have quality, affordable health care through the Affordable Care Act marketplaces.","date":"Wed Sep 15 13:20:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to be with @GovernorVA as he signs the Voting Rights of Virginia into law. While many states are embracing the Big Lie and making it harder to vote, Virginia is leading the way in making sure everyone has equal access to the ballot box. https://t.co/S3AEDIvaam","date":"Mon Sep 13 19:56:35 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time at the 15th Annual Taste of Suffolk today. Mickey and Minnie made an appearance too! https://t.co/ldcqeByR5g","date":"Sun Sep 12 01:52:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Honored to attend the Pastoral Installation Ceremony for the Rev. Dr. Lesley Francisco McClendon and her husband, Assistant Pastor Caleb McClendon @C3Hampton https://t.co/ZlmbdQAcTY","date":"Sat Sep 11 22:49:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Reflected on the lives lost twenty years ago during the @CityofHampton Day of Remembrance and Hope Ceremony #NeverForget911 https://t.co/XjXELvciAX","date":"Sat Sep 11 17:30:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today we mark 20 years since the day we will #NeverForget . A day when almost 3,000 innocent people lost their lives. Let us mourn those we lost, honor our troops, and may we all have a renewed sense of patriotism and duty to our country and to each other.","date":"Sat Sep 11 13:16:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Committee Democrats have taken a major step toward delivering a transformative investment in our families and in our future.","date":"Fri Sep 10 22:34:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Strongly agree with @VP’s comments. And I may be partial, but @_HamptonU is the “real” HU! #HBCUWeek","date":"Fri Sep 10 21:24:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Day 2! Follow along ⤵️","date":"Fri Sep 10 17:45:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Investing in child care and school infrastructure is critical to rebuilding our economy. The #BuildBackBetter Act is a historic opportunity to invest in our future.","date":"Thu Sep 09 16:44:59 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Another sign that the American Rescue Plan and @POTUS’ economic agenda are putting our economy back on track. Now we must continue our work to #BuildBackBetter.","date":"Thu Sep 09 16:14:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #BuildBackBetter Agenda is going to make transformational investments in working families by finally making the wealthiest few pay their fair share.","date":"Wed Sep 08 15:01:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Happy New Year to all those celebrating #RoshHashanah! https://t.co/czyjgN8COy","date":"Tue Sep 07 15:40:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"America's labor unions are essential to rebuilding our middle class. That’s why House Democrats passed the #PROAct to protect and strengthen workers’ basic right to organize. Now the Senate must do its part to support workers and their families. #PassthePROAct #LaborDay https://t.co/I1igANK1aC","date":"Mon Sep 06 12:06:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Supreme Court ruling on #SB8 jeopardizes the health and safety of women all over the country and opens the door to further abortion restrictions in other states. Congress must enact @RepJudyChu's Women’s Health Protection Act to protect the rights guaranteed under #RoeVWade https://t.co/0V9wK3IWhf","date":"Thu Sep 02 17:58:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Participated in a roundtable this afternoon with home care workers, to listen to their stories and discuss the challenges they encounter while providing essential care https://t.co/gC8kBmVjsE","date":"Wed Sep 01 00:58:07 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I delivered the keynote address today at #iFest2021 to discuss how we can help workers succeed in the modern economy. The #BuildBackBetter Act invests in helping every American get the high-quality education and job training they need to find a good-paying job. https://t.co/spYyJ9hZp3","date":"Tue Aug 31 21:06:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is good news but we still have more work to do. The Delta variant is spreading quickly in unvaccinated people. The vaccines are free, safe and highly effective. Go to https://t.co/ZoUvQhr9Kk to get your shot. It is the best way to protect yourself and your community.","date":"Tue Aug 31 16:44:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing young children get a head start on their education during my visit at the Texie Marks Camp Children’s Center today https://t.co/cyaFdARI35","date":"Mon Aug 30 21:30:03 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Took a tour of the @Cover3Life and learned about their feeding programs for child care centers https://t.co/C75sicpPvb","date":"Mon Aug 30 19:34:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It is astonishing that some state leaders are setting policies that endanger students, families, and educators and jeopardize schools’ ability to provide in-person instruction. I applaud the @usedgov for speaking up for students, families, and educators safety.","date":"Mon Aug 30 18:08:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden #ChildTaxCredit, which we enacted with the American Rescue Plan, is making a huge difference for families and kids across the country. Very sad that no Republicans in Congress voted for this policy. https://t.co/TnVlam7tSk","date":"Mon Aug 30 14:57:54 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Stopped by the 8th Annual Shell Road Fest at the Boys and Girls Club in Hampton https://t.co/ut2SsTKX2x","date":"Sat Aug 28 23:40:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Nice to see Norfolk elected officials, business leaders, community organizations, fraternity members and sorority members at the Community Connect Resource Expo https://t.co/kxezD1awwv","date":"Sat Aug 28 22:58:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great turnout from law enforcement, community groups, Clergy and school personnel at the Back to School Community Day @HeritageHS https://t.co/1wxjs0HnOC","date":"Sat Aug 28 21:27:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It was a delight to see my longtime friend and former Va. General Assembly colleague, @SenHenryMarsh at the Grand Opening of Henry Marsh, III Elementary School https://t.co/oCaLfBMflj","date":"Sat Aug 28 16:18:22 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Hampton Roads is fortunate to have many great private partners working to support our military and maritime interests. These investments will help spur further economic growth throughout our region and Commonwealth as we continue our economic recovery from the COVID-19 pandemic. https://t.co/8CihnuoPjq","date":"Fri Aug 27 22:18:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It's very simple: Help schools reopen safely or get out of the way.","date":"Fri Aug 27 16:45:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today is a reminder that taxpayers are often forced to pay for the deceptive practices of predatory colleges.\n\n👉@usedgov should start holding for-profit executives personally liable for defrauding students\n\n👉 GOP must stop blocking stronger accountability for for-profit schools","date":"Fri Aug 27 14:06:19 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I applaud @POTUS and @SecCardona for providing defrauded student borrowers the relief they need and deserve. Numerous investigations into ITT’s conduct uncovered a pattern of predatory practices that tricked students into taking on enormous debt.","date":"Fri Aug 27 14:05:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"My thoughts and prayers are with all those killed and injured in Kabul. I am very thankful for our servicemembers who are working tirelessly and courageously to evacuate all Americans and our allies.","date":"Thu Aug 26 17:44:08 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #BuildBackBetter Agenda will deliver more jobs, cut taxes and lower costs, doing so by making the wealthiest few &amp; big corporations pay their fair share. And the American people support it.","date":"Wed Aug 25 18:55:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the ceremonial first cut of steel for the U.S. Navy’s newest aircraft carrier, USS Doris Miller (CVN 81). https://t.co/k69bAUhy9x","date":"Wed Aug 25 17:45:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Parents want students to be safe and back in the classrooms. Republicans that oppose those efforts should get out of the way.","date":"Wed Aug 25 12:42:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I am thankful for the leadership of my colleagues who were tireless in passing this critical bill. I urge my colleagues in the Senate to do everything possible to ensure its passage so we can send this legislation to @POTUS' desk. Our democracy is at stake.","date":"Tue Aug 24 23:25:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The John Lewis Voting Rights Advancement Act would restore the full strength of the Voting Rights Act of 1965 and protect voters from some of the worst aspects of these discriminatory state laws.","date":"Tue Aug 24 23:24:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Fueled by former President Trump’s ‘Big Lie’ and disastrous Supreme Court decisions in Shelby County v. Holder in 2013 and Brnovich v. DNC earlier this year, Republican-controlled state legislatures across the country have pushed extreme voter suppression laws.","date":"Tue Aug 24 23:23:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The right to vote is the cornerstone of our democracy. Everyone deserves equal access to the ballot box regardless of who they are or where they live. Unfortunately, voting rights are under assault like we have not seen since the Jim Crow era.","date":"Tue Aug 24 23:23:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s vote unlocks the potential for historic investments that will lower costs for working families and create millions of good-paying jobs. The #BuildBackBetter Agenda is a once-in-a-generation opportunity to support nearly every American family.","date":"Tue Aug 24 21:15:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Put Gracie on the honor roll.","date":"Tue Aug 24 15:59:16 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It was an honor to attend the State Historical Marker Ceremony honoring Evelyn T. Butts, a Civil Rights icon from Norfolk, who filed a lawsuit against the poll tax, which helped eradicate the discriminatory requirement around the nation https://t.co/OsgigwyGrU","date":"Mon Aug 23 19:33:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Confirming what we have known for awhile - the COVID-19 vaccines are safe and highly effective. And they are free. Get vaccinated at https://t.co/ZoUvQhr9Kk","date":"Mon Aug 23 13:52:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great afternoon with the elected officials and community leaders at @SenatorLocke’s Second Annual Community Recognition Tea https://t.co/XeraouqYwg","date":"Sun Aug 22 22:51:33 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Keyshawn represented Norfolk, Hampton Roads and the United States well at the Olympic Games. Congratulations!","date":"Sat Aug 21 22:10:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Threw out a Ceremonial First Pitch at the Inaugural 77th House District T-Ball Kickoff this morning. https://t.co/SVbbrgT5JD","date":"Sat Aug 21 21:48:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined Hampton officials in welcoming His Excellency, Joaquim do Espírito Santo, Angola Ambassador to the United States (center) and Minister Jono Fortunato, Angola Minister of Culture (center right) to Hampton for the William Tucker 1624 Society Reflection Ceremony https://t.co/U0pykx4szH","date":"Fri Aug 20 19:07:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave a legislative update this morning in support of working families during the @Virginia_AFLCIO 25th Biennial State Conference https://t.co/kuJYCxnrDo","date":"Fri Aug 20 17:12:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to @lizshuler and the historic incoming leadership team at @AFLCIO. This is a pivotal moment for workers and families. A strong labor movement built the middle class and a strong labor movement can rebuild the middle class. \n\n#PassthePROAct","date":"Fri Aug 20 16:22:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Tonight I joined @nnschools  Superintendent Dr. George Parker and School Board Member Dr. Terri Best for a virtual town hall to discuss how the American Rescue Plan is helping schools reopen safely and make up for lost time in the classroom. Watch👇\nhttps://t.co/XfvAX3YxRq","date":"Fri Aug 20 00:01:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We had a great discussion about advancing the Build Back Better Agenda with bold investments in higher education, child care, workforce development, school construction, paid leave and other important initiatives.","date":"Thu Aug 19 22:16:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I applaud the Biden Administration for once again using its authority to provide desperately needed relief to student loan borrowers and their families.\nhttps://t.co/1VfXiBhjz9","date":"Thu Aug 19 19:23:47 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It is astonishing that governors and state legislators are punishing school districts for taking action to make classrooms safer. I applaud @POTUS and @SecCardona  for speaking up on behalf of students, parents, and educators across the country. https://t.co/n9XYwjEwUL","date":"Thu Aug 19 15:20:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Another sign that the American Rescue Plan is working. Now we need to enact the rest of the #BuildBackBetter agenda so we can continue delivering results #ForThePeople.","date":"Thu Aug 19 13:22:52 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Disappointed by this move to discriminate against transgender students &amp; defy state/federal law. All students deserve to feel welcome at school. The Board should review the severe harm that not implementing these policy changes will have on student health &amp; reverse its decision.","date":"Wed Aug 18 17:03:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Republicans are politicizing masks, vaccines, and other precautions that lower the risk of COVID-19 infections. Thankfully, parents are tuning them out. We must do everything we can to protect our kids and keep schools open.","date":"Tue Aug 17 15:41:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We can stop the spread of COVID-19. Get vaccinated today at https://t.co/ZoUvQhr9Kk to protect yourself and your community.","date":"Mon Aug 16 19:32:09 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We must now protect all Americans and our allies that remain in the region.","date":"Mon Aug 16 15:46:22 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Our troops cannot be asked to stay mired in an endless civil war and be asked to sacrifice more American lives and resources, when it is clear the Afghan government could not and would not stand on its own, even after 20 years of training and support. \nMy full statement below. https://t.co/89dt2SJqie","date":"Mon Aug 16 15:45:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The second monthly payments of the Biden #ChildTaxCredit are going out now! This tax cut we created in the American Rescue Plan, will help continue the historic economic recovery and achieve a transformative reduction in child poverty.\nhttps://t.co/0JRob6vmGk","date":"Mon Aug 16 14:57:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time yesterday at Southeast Community Day at Marshall Courts in Newport News! https://t.co/zPkCymo8dL","date":"Sun Aug 15 14:16:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Enjoyed stopping by Hampton Roads Urban Agriculture in Southeast Newport News yesterday. Renee Foster and her team are doing great work in our community to reduce food insecurity. https://t.co/4v9IWE6oQa","date":"Sun Aug 15 14:12:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great afternoon at the 2nd Annual Jazz on The Lawn by the Portsmouth Jazz Experience https://t.co/x17kRAqVsG","date":"Sat Aug 14 20:41:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"OSHA's updated workplace safety guidance is an improvement over previous guidance, but it still falls well short of the enforceable workplace safety standard that is necessary to protect all workers from COVID-19. https://t.co/sBa9nuauG7","date":"Fri Aug 13 20:36:23 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #ChildTaxCredit that Congressional Democrats and @POTUS enacted with the American Rescue Plan is reducing child hunger. \n\nSadly, no Republicans in Congress voted for this initiative. \nhttps://t.co/uzJgYAfjqK","date":"Fri Aug 13 13:47:07 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended a reception to honor Ms. Andolyn Medina, a Chesapeake native who was crowned @MissAmericaDC! https://t.co/t0A2wZ0ECf","date":"Thu Aug 12 20:16:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Good. This is a critical step toward keeping students safe and keeping schools open.","date":"Thu Aug 12 18:11:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Having reliable, affordable health insurance is more important than ever during the #COVID19 pandemic. The Special Enrollment Period at https://t.co/aUuUw8G2OG CLOSES SOON. Join the 2.5 million Americans who have signed up and #GetCovered today! https://t.co/tVi9QsnwNr","date":"Thu Aug 12 15:17:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congressional Democrats and @POTUS created the #BidenChildTaxCredit when we enacted the American Rescue Plan. This tax cut for middle class families is already making a big impact. And the next round of payments goes out this week. \nhttps://t.co/muvX66zbui","date":"Thu Aug 12 14:00:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great turnout at Mayor Price’s 6th Annual Play Ball event, an evening of fun activities for young people, which was made possible through a collaboration between @MLB, @_BGCVP, @NNMayorPriceDDS and the City of Newport News Dept. of Parks, Recreation &amp; Tourism https://t.co/QeNvKPuusu","date":"Thu Aug 12 01:32:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The science should guide our response, not the politics.\n\nUnfortunately, Republicans are making it harder to get students back in schools because they spread lies and misinformation about vaccines, masks and other things that will keep kids safe in the classroom.","date":"Wed Aug 11 17:59:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"You have until August 15th to #GetCovered on https://t.co/aUuUw8G2OG!","date":"Wed Aug 11 16:24:51 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Good news. And a reminder that @POTUS and Congressional Democrats have created 4 million jobs. Wages are up. Unemployment is down. Poverty is down. \n\nThe Build Back Better agenda is working.","date":"Wed Aug 11 14:37:59 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave a legislative update and answered questions about my work in Congress during the National Active and Retired Federal Employees Chapter 682 meeting https://t.co/sCxp5PZ8vU","date":"Mon Aug 09 18:48:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The report from the @IPCC_CH is sobering and makes clear that we have no time to waste. Passing the Build Back Better agenda will ensure we prevent the worst outcomes from the #ClimateCrisis.  \nhttps://t.co/xToCO2Olz2","date":"Mon Aug 09 15:06:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great turnout at the Stuff the Bus for Hampton City Schools event today, which was sponsored by Hampton School Board Vice Chair Dr. Richard Mason and Mark Crump State Farm https://t.co/0gZI0GLQv5","date":"Sun Aug 08 23:07:07 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I applaud the Biden Administration's decision to extend the pause on federal student loans. It will help continue the momentum of our economic recovery and give student loan borrowers the time they need to restart loan repayment. https://t.co/OeBOnAwZKE","date":"Fri Aug 06 20:23:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined @RepElaineLuria at the @ODUPD 50th Anniversary Celebration today. Thanks for your service to @ODU and our community. https://t.co/Aj9h6FDbF7","date":"Fri Aug 06 17:06:43 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It was an honor to thank our community’s military personnel for their many sacrifices during the @Chamber757 Annual Military Recognition Reception https://t.co/DrqdG9mmLu","date":"Thu Aug 05 22:27:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Visited the STOP, Inc. headquarters this afternoon and received a tour of the mobile telehealth clinic and updates on the great work the organization is doing for young people, families and veterans https://t.co/RkGydjgvVw","date":"Thu Aug 05 20:58:25 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Workers shouldn’t have to choose between keeping a job and caring for a loved one. I gave remarks today about the need for paid family and medical leave for all workers during the @PaidLeaveforAll National Bus Tour event in Norfolk. https://t.co/BrInhr1cEa","date":"Thu Aug 05 19:17:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Richard Trumka was one of our nation’s fiercest and most effective champions for workers. I send my deepest condolences to Richard Trumka’s family and loved ones as we mourn his sudden passing. https://t.co/rTWmSaHvE6","date":"Thu Aug 05 18:03:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Office of the Virginia Secretary of Natural Resources is hosting a public meeting for Hampton Roads’ residents tonight at 6pm in Chesapeake about Virginia’s Coastal Resilience Master Plan (CRMP).\n\nMore information and meeting details can be found here: https://t.co/nJBZnhUda4","date":"Thu Aug 05 14:59:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great seeing @ClintonHD76, Mayor Mike Duman and the Kings Fork community at the Suffolk #NationalNightOut tonight https://t.co/MZXQgCxPzj","date":"Wed Aug 04 03:17:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Participated in a Ribbon Cutting and tour of the QTC Veterans Clinic in Norfolk this evening, which will service Southern Hampton Roads’ veterans and transitioning service members https://t.co/wvCNcoAEDy","date":"Wed Aug 04 02:45:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined city leaders, law enforcement officials and stakeholders this evening at the City of Newport News’ #NationalNightOut2021 https://t.co/ujdtCsagdx","date":"Wed Aug 04 02:09:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see @CityofNN @nnschools and @riverside making an effort to vaccinate students and adults ahead of the upcoming school year #WeCanDoThis https://t.co/oyMG5KZ5G4","date":"Tue Aug 03 21:11:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It was a pleasure to have White House National Climate Advisor @ginamccarthy46 in Hampton Roads today to discuss environmental issues related to @PortofVirginia, the military and the workforce https://t.co/X2ffndZW74","date":"Tue Aug 03 18:20:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see the vaccination effort continue at the Leo Bday Bash Cookout and vaccine clinic https://t.co/94S22gpEMk","date":"Mon Aug 02 01:13:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The COVID-19 vaccines are free, safe and highly effective. \n\nGet protected today: https://t.co/ZoUvQhr9Kk","date":"Sat Jul 31 16:09:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Over 60 million workers are currently subjected to forced arbitration clauses — which employers use to shield themselves from accepting accountability for wage theft, discrimination, and harassment. This legislation is a critical step forward in protecting the rights of workers.","date":"Fri Jul 30 16:43:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the Air Force Caucus reception and ran into 4-Star General C.Q.Brown, a 1980 graduate of Ferguson High School in Newport News. https://t.co/LzTZAEf6yI","date":"Thu Jul 29 22:33:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@HouseDemocrats voting to fund the Capitol Police over the opposition of 99.5% of House Republicans.","date":"Thu Jul 29 17:43:19 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"As we recover from this pandemic, it’s critical we take every step to protect workers’ rights and ensure they receive fair wages. I applaud the Biden-Harris Administration for defending workers from wage theft.","date":"Thu Jul 29 14:24:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Even more evidence that the American Rescue Plan is working. Now we must enact the rest of @POTUS' Build Back Better agenda to continue this historic recovery.","date":"Thu Jul 29 13:45:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We can protect ourselves against the Delta variant by getting vaccinated. Many adults have gotten their shots but there are still large portions of the population that are unvaccinated. Get protected at https://t.co/ZoUvQhr9Kk to help put this pandemic in the past. #WeCanDoThis","date":"Wed Jul 28 19:23:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I am proud to support the @HouseDemocrats funding bill because now is the time to #BuildBackBetter with an economy that works #ForThePeople. https://t.co/XuelbGMSAW","date":"Tue Jul 27 19:36:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Enjoyed meeting with my fellow Alpha brother and the new Speaker of the Illinois House of Representatives @RepChrisWelch. @apa1906NETwork  https://t.co/C3QuecawIn https://t.co/ypPXvR5UHA","date":"Mon Jul 26 23:53:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today marks thirty-one years since the Americans with Disabilities Act was signed into law. I was not in Congress at the time, but I was in the Virginia Senate where I was proud to vote for the Virginians with Disabilities Act which was enacted in 1985.","date":"Mon Jul 26 19:55:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Funding #ForThePeople means funding priorities that every American cares about, including: \n \n✅ rebuilding public health infrastructure \n✅ investments in education \n✅ support for small businesses","date":"Mon Jul 26 19:24:43 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The COVID-19 vaccines are free, safe and effective. Protect yourself and your community by getting your shot at https://t.co/zrcQqfSVgH","date":"Mon Jul 26 18:27:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"If you or someone you know is in need of eviction prevention assistance, here is some helpful information that was given during @PriceForDel95’s Know Your Rights: Housing Edition seminar today. https://t.co/jdvMe9GOs9","date":"Sat Jul 24 23:58:02 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Stopped by the Aberdeen Community Explosion earlier. Pictured with Hampton Councilman Steve Brown, Pastor Telvin Howe and Hampton Vice Mayor Jimmy Gray https://t.co/ZQPR1LrXa8","date":"Sat Jul 24 21:02:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see @NewportNewsPD officers, NNPD Chief Steve Drew, North District Councilwoman Sharon Scott and the Feel Good Crew at the North Precinct Community Day https://t.co/vZCCQXxlih","date":"Sat Jul 24 19:29:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave remarks today at the Va. State Police Community Day. Pictured with Senior Trooper and Chesapeake School Board Member Samuel Boone https://t.co/2DExxVfa7F","date":"Sat Jul 24 18:25:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, I was honored to attend a ceremony where the Law Enforcement Congressional Badge of Bravery was given to four brave @VBPD Officers for their actions during the mass shooting at the municipal center on May 31, 2019 https://t.co/9lNirh1ZnP","date":"Sat Jul 24 01:20:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Irresponsible public figures have been spreading vaccine misinformation while the Delta variant is moving quickly through unvaccinated people. \n\nThe vaccines are safe, highly effective and could save your life. \n\nGet your shot at https://t.co/ZoUvQhr9Kk and do your part.","date":"Fri Jul 23 21:28:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is me in 2009, when the federal minimum wage increased to $7.25.\n \nThis is me today. The federal minimum wage is still $7.25.\n#12yearchallenge #RaisetheWage https://t.co/ZXWXcl5pgm","date":"Fri Jul 23 14:07:35 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Yesterday, the @NRWarriors softball team was recognized at @Nationals Park for winning the state championship. Congratulations on a great season! https://t.co/6NM0JXt5R0","date":"Wed Jul 21 21:26:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@GOPLeader had a chance to support an independent commission, but voted against it. The #January6thCommittee must be serious about finding the truth. @SpeakerPelosi made the right decision.","date":"Wed Jul 21 19:51:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The sentencing disparity between crack and powder cocaine is a relic of the failed “war on drugs.” I introduced the bipartisan #EQUALAct with @RepJeffries @RepArmstrongND @RepDonBacon to eliminate the disparity.","date":"Wed Jul 21 15:28:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan created the Biden #ChildTaxCredit payments which will achieve a historic reduction in child poverty while putting the economy back on track. \n\nIt's hard for Republicans to justify voting against that. \nhttps://t.co/aOZYwz6ExL","date":"Tue Jul 20 21:37:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan and the #BuildBackBetter agenda are working.","date":"Mon Jul 19 17:06:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Are you wondering if you qualify for monthly Biden #ChildTaxCredit payments? Use this tool to check your eligibility ⬇️\nhttps://t.co/9qk19odezU","date":"Mon Jul 19 16:07:03 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Last week, the first monthly payments of the Biden #ChildTaxCredit were sent out. This tax cut for working families, secured by Democrats in the passage of the #AmericanRescuePlan, will help continue our economic recovery and achieve a historic reduction in child poverty. https://t.co/ZV33Wskf1g","date":"Mon Jul 19 16:06:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan is working. Now we must continue our work to #BuildBackBetter and enact the American Jobs Plan and the American Families Plan. \nhttps://t.co/iUqdYNaRmE","date":"Fri Jul 16 13:40:33 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today @EdLaborCmte is considering four bills that address important challenges in our communities. Read my opening statement. \nhttps://t.co/kkH6B7Fegi","date":"Thu Jul 15 17:32:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Help Is Here!  Congressional Democrats worked with @POTUS to expand the #ChildTaxCredit when we enacted the American Rescue Plan. Find out more about this major tax cut for working families at https://t.co/ZyGIbonM6I","date":"Thu Jul 15 13:55:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Good news for workers. Bad news for corporate executives who were planning on violating labor laws.","date":"Wed Jul 14 23:57:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined Hampton elected officials at the Ceremonial Groundbreaking for the Hampton Aquaplex Center, which will feature indoor and outdoor amenities for residents and tourists https://t.co/e2HOLd0w3J","date":"Wed Jul 14 20:02:54 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan, enacted by @POTUS and Congressional Democrats, expands the #ChildTaxCredit for working families. This new tax cut for working families can cut child poverty in half. Find out more below. https://t.co/ZyGIboFnvi","date":"Wed Jul 14 19:18:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Young people should get vaccinated. Visit https://t.co/zrcQqfSVgH to protect yourself and your community. #WeCanDoThis","date":"Wed Jul 14 17:13:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Julie Su will bring a wealth of knowledge and experience to the @USDOL. Throughout her distinguished career, she has stood up for vulnerable workers, championed labor rights, and improved the lives of workers and families across CA.\nhttps://t.co/BcrLYmHHws","date":"Tue Jul 13 21:47:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s financial aid announcement by @usedgov will help students stay in school and complete their degrees. This is just another example of how the Biden-Harris Administration has restored the Education Department’s commitment to serving the best interests of students.","date":"Tue Jul 13 19:39:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"DID YOU KNOW: @POTUS and Congressional Democrats passed the American Rescue Plan which expanded the #ChildTaxCredit to $3,000 per child ages 6-17 and $3,600 per child under the age of 6?\nLearn more at https://t.co/ZyGIboFnvi.","date":"Tue Jul 13 18:14:09 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Democrats delivering results for the Commonwealth.","date":"Tue Jul 13 17:49:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Democrats in Congress worked with @POTUS to expand the #ChildTaxCredit and help families make ends meet while raising children when we enacted the American Rescue Plan. Find out more about this major tax cut for working families at https://t.co/ZyGIboFnvi.","date":"Mon Jul 12 16:02:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Every Republican in Congress voted to defund the police when they voted against the American Rescue Plan. Plain and simple.","date":"Mon Jul 12 15:51:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Join us!","date":"Mon Jul 12 15:41:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Happy 80th Birthday to one of the Southeast community’s great citizens, Dorothy “Dot” Murray. https://t.co/vE89UP9tbg","date":"Sun Jul 11 01:02:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see the 200+ Men, Inc. at their Summer Cookout this afternoon https://t.co/Or7MqvBWGx","date":"Sun Jul 11 00:02:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to the Hampton Roads Youth Foundation on a successful  25th Annual All Star Football Camp today at Armstrong Field on the campus of @_HamptonU https://t.co/osBwu5M5Q1","date":"Sat Jul 10 21:07:16 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gained a new appreciation for cricket during the Opening Ceremony of the 2021 Kirit Shah Temple Premiere League Cricket Tournament https://t.co/xYsDpWSAV8","date":"Sat Jul 10 17:02:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see a nice turnout at the Temple Premiere League’s 2021 Cricket Gala https://t.co/2U3jL9mi15","date":"Sat Jul 10 01:22:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations to Chief Mark Talbot (center right) on today’s swearing in as the Chief of @HamptonVAPolice https://t.co/HSPoTHbyhs","date":"Fri Jul 09 21:44:19 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Talked to @WAVY_News earlier to stress the importance of continuing our vaccination efforts during the @_HamptonU Drive-Thru Vaccination Clinic at New Grafton Baptist Church https://t.co/8rnPCxCJt9","date":"Fri Jul 09 21:21:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time with the Q&amp;A session about my work in Congress and teen panel discussion during my visit this afternoon @_BGCVP. https://t.co/xmgnM95ogy","date":"Fri Jul 09 01:38:51 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It is our responsibility to ensure that our nation’s young people have the opportunity to thrive—not just survive. The Opening Doors for Youth Act will provide youth with a solid foundation of education &amp; the skills they need to get a good job and rewarding career. Read more⬇️","date":"Thu Jul 08 18:19:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I’m co-hosting a virtual Child Tax Credit Roundtable with @RepMcEachin this Monday at 5:30pm to discuss how families can take advantage of the changes enacted under the #AmericanRescuePlan \n\nRegister here: https://t.co/Ouq36rWkwt https://t.co/Hnte1vNBok","date":"Thu Jul 08 15:10:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Working parents are still stuck on the sidelines because they do not have access to safe and affordable child care options. Investing in child care is an essential part of our plan to #BuildBackBetter. Pictured with @FirstLadyVA @SenatorLocke @MarthaMugler @JeionWard @VASecofEdu https://t.co/czTHGJ2IgQ","date":"Wed Jul 07 20:56:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Get vaccinated at https://t.co/ZoUvQhr9Kk to protect yourself and your community. #WeCanDoThis","date":"Tue Jul 06 19:22:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time celebrating Independence Day with @KennyAlexander, @13CraigMoeller and the crowd at Town Point Park for the City of Norfolk’s 4th of July Great American Picnic &amp; Fireworks https://t.co/QcQw6urN9I","date":"Mon Jul 05 03:33:52 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Happy #July4th! \n \nCelebrate our independence safely with family and friends! 🇺🇸 https://t.co/Ay98YIFF3K","date":"Sun Jul 04 16:33:03 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the ribbon cutting for a Gazebo in Wythe neighborhood in Hampton, named in honor police officer Kenny Wallace who was tragically killed in the line of duty almost 30 years ago. https://t.co/NUxCLD97aZ","date":"Sat Jul 03 18:16:05 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The correct answer was 850,000 jobs. It’s a tough day for people who are rooting against the American economy.","date":"Fri Jul 02 14:45:25 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Further proof that American Rescue Plan is working and the Biden-Harris economic agenda is delivering results for the American people. Since @POTUS took office, the economy has created more than 3 million jobs and consumer confidence has soared to its highest rate in 21 years.","date":"Fri Jul 02 14:36:26 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan is working.","date":"Thu Jul 01 20:54:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"As @POTUS would say, this is a big deal. And it shows that the Biden economic plan is working. We enacted the American Rescue Plan but there is more work to do so we can #BuildBackBetter. \n\nWe need the American Jobs Plan and the American Families Plan.","date":"Thu Jul 01 20:22:51 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"That is why we must enact the For the People Act and the John Lewis Voting Rights Advancement Act to restore the right to vote.","date":"Thu Jul 01 17:50:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, the Supreme Court approved laws that have a racially discriminatory impact under flawed and tortured legal theories. This will greenlight all kinds of future laws that have discriminatory impact and further erode voting rights.","date":"Thu Jul 01 17:50:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"A new report shows that the Trump Administration took unprecedented and improper steps to support a failing for-profit college chain and that its actions cost American taxpayers hundreds of millions of dollars.\n \nRead my full response. 👇\nhttps://t.co/mnaj9jdljT","date":"Thu Jul 01 16:46:25 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"House Reps hoped the Senate would follow our lead and establish an independent, bipartisan 9/11-type Commission, but Mitch McConnell had Senate Republicans block the bill. \n\nWe must find the facts about #January6th and provide accountability.","date":"Wed Jun 30 19:57:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Our infrastructure is crumbling and Democrats have a bill to fix it. Today, the #INVESTAct is on the House floor to begin delivering on the bold vision that the American Jobs Plan calls for by rebuilding our nation’s roads, bridges, rail systems, transit, and water infrastructure https://t.co/5ADmbPBfZM","date":"Wed Jun 30 18:27:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This isn’t complicated. \n\nEvery single Republican in Congress voted to defund the police when they all voted against the American Rescue Plan which provided money to states and localities to keep cops, firefighters and teachers on the job.","date":"Wed Jun 30 18:16:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"…120 House Republicans voted today to keep statues of Confederate leaders in the Capitol.","date":"Wed Jun 30 00:22:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"@han_albino Please call my Newport News office and we may be able to help. 757-380-1000","date":"Tue Jun 29 17:36:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The new #ChildTaxCredit payments will be sent to families in the coming weeks thanks to the American Rescue Plan. Help Is Here! \nhttps://t.co/FkpgCt4gHc","date":"Tue Jun 29 15:30:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Republicans have already voted twice this year to defund the police. They all voted against the American Rescue Plan which contained critical funds for states &amp; localities to fund emergency services, and they also voted against the Capitol Hill security supplemental spending bill","date":"Mon Jun 28 17:28:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"There are worrying COVID-19 variants spreading so be sure to get vaccinated so we can keep driving case numbers down. Virginians should call 877-VAX-IN-VA or visit https://t.co/NNTREYQ1Vk or https://t.co/ZoUvQhr9Kk. #WeCanDoThis","date":"Mon Jun 28 16:51:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"👏👏👏👏👏","date":"Mon Jun 28 15:34:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time attending the Suffolk #Pride festival today! https://t.co/d43wT70A6M","date":"Sun Jun 27 17:12:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This week, the House passed my resolution to repeal a Trump-era rule that delays and potentially denies justice for victims of workplace discrimination. Now it heads to President Biden's desk. #JusticeforWorkers https://t.co/tnVePRP2hx","date":"Sat Jun 26 14:16:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today marks 8 years since SCOTUS gutted the Voting Rights Act. Now extremist Republicans are embracing the Big Lie and ramping up efforts to restrict the right to vote. Just this year, 17 states have enacted 28 restrictive, anti-voter laws. We need to #RestoreTheVote. https://t.co/qSAyMr4Lg0","date":"Fri Jun 25 16:54:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We know that justice delayed is justice denied.  That is why civil rights leaders and worker advocates across the country have called on Congress to pass this Congressional Review Act resolution and restore fairness for victims of workplace discrimination. https://t.co/vZjr76trLJ","date":"Thu Jun 24 18:31:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is delivering the resources schools need to reopen and stay open safely. Local school leaders like @VA_Supt are seeing its impact: https://t.co/NN2W5KQRLt","date":"Thu Jun 24 14:55:23 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Yesterday, the House passed my bill, the Protecting Older Workers Against Discrimination Act, to ensure older workers finally achieve justice for workplace discrimination. #JusticeforWorkers\n \nWatch my remarks here: https://t.co/jnpoiFa7VF","date":"Thu Jun 24 12:54:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This report makes clear the importance of addressing climate change and Environmental Justice and I agree - we must pass the #AmericanJobsPlan and put people to work slashing emissions, building resilient infrastructure and restoring treasures like the Chesapeake Bay.","date":"Wed Jun 23 20:47:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"@IRSnews announced today that they have implemented a Child Tax Credit Eligibility Assistant and a Child Tax Credit Update Portal to help families navigate the process of claiming Child Tax Credits. \n\nCheck if you are eligible for advance payments here: https://t.co/voCgugQ0Qc","date":"Tue Jun 22 20:13:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"There are a few moments left to register for my Webinar on Child Tax Credits from the American Rescue Plan, which begins at 4:00pm. \n\nYou can register here: https://t.co/9AbqtH7Gkk","date":"Mon Jun 21 19:42:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave remarks during a #juneteenthday Celebration at New Beech Grove Baptist Church yesterday https://t.co/Q1Tqu9QPpK","date":"Sun Jun 20 22:07:35 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Returned to the Boo Williams Sportsplex yesterday to check on the progress with the vaccination clinic #WeCanDoThis https://t.co/p8F14ORZZQ","date":"Sun Jun 20 18:48:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Commemorated this first #JuneteenthFederalHoliday at Fort Monroe with Governor Northam and other dignitaries https://t.co/Jh5rRY2C49","date":"Fri Jun 18 18:51:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Good to be with @POTUS and my colleagues at yesterday’s bill signing to establish #Juneteenth as a national holiday! https://t.co/FUHgqDJzs1","date":"Fri Jun 18 12:32:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Here at @WhiteHouse for the enactment of the Juneteenth National Independence Day Act which will officially make #Juneteenth a national holiday!","date":"Thu Jun 17 19:48:09 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"A victory for the people and a loss for Trump and the GOP. Again. Get covered at https://t.co/aUuUw8G2OG","date":"Thu Jun 17 16:44:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Repealing the outdated 2002 AUMF will help restore Constitutional balance to our government and preserve democratic debate before placing our military and servicemembers in harm’s way.","date":"Thu Jun 17 16:26:07 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This was another baseless lawsuit against the ACA. This decision will protect millions of Americans’ access to affordable health care, secure coverage for people with pre-existing conditions, and maintain critical protections that patients rely on every day. #ProtectOurCare","date":"Thu Jun 17 14:28:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The @HouseGOP killed legislation written by @RepBrownley that would have provided veterans with contraceptive care.","date":"Thu Jun 17 02:03:33 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congress has passed legislation to make #Juneteenth a federal holiday! My full statement below. https://t.co/I4amAaHuHs","date":"Wed Jun 16 23:37:51 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Pell Grant is the most important tool we have to help students afford college. This bill would help millions of students earn a quality degree, without being forced to take on excessive debt.","date":"Wed Jun 16 18:22:35 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Make #Juneteenth a federal holiday. \n\nPass it on.","date":"Wed Jun 16 16:58:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan is popular and putting the economy back on track. No wonder why Republicans tried to take credit for its provisions after they all voted against it.","date":"Wed Jun 16 16:26:47 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American people know that it is time to #BuildBackBetter and want Congress to pass the American Jobs Plan and the American Families Plan. \n\ncc @GOPLeader @LeaderMcConnell","date":"Wed Jun 16 16:05:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"During #Pride Month.","date":"Wed Jun 16 14:52:05 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"A sad commentary on the @HouseGOP.","date":"Tue Jun 15 22:08:44 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined my colleagues at the U.S. Capitol for a Moment of Silence for the more than 600,000 American lives lost to COVID-19. https://t.co/kNkN14hOjB","date":"Mon Jun 14 23:52:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended a home opening in Newport News earlier today. The home was built by @HabitatPGW in partnership with local chapters of @Rotary. https://t.co/iIXEatQnta","date":"Mon Jun 14 16:25:09 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The U.S. Senate is no longer a functioning legislative body. It is obvious something needs to change.","date":"Mon Jun 14 16:09:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Get vaccinated. https://t.co/ZoUvQhr9Kk \nhttps://t.co/xWblE3X1L5","date":"Mon Jun 14 14:21:03 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Kicked off the Juneteenth festivities at the City of Newport News Juneteenth Celebration Concert featuring the Calvary Chapel Newport News Worship Team, Three Brothers and the Unifics. https://t.co/8NI3JCVGEx","date":"Sun Jun 13 23:37:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Stopped by Boo Williams Sportsplex in Hampton to learn about their efforts to get Peninsula residents vaccinated #WeCanDoThis https://t.co/t1ouX9QmKC","date":"Sat Jun 12 22:05:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Commemorated the legacy of Retired Command Chief Master Sergeant and dedicated Aberdeen Gardens resident Claude Vann, Jr. this afternoon with his family and Hampton elected officials https://t.co/f9GnU0YKnV","date":"Sat Jun 12 20:50:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Impressed with the progress that is being made with the Marshall-Ridley Choice Neighborhoods Initiative with today’s opening of “The Offices @ Two Five and J” Coworking Space, where small businesses and entrepreneurs can collaborate on business ventures https://t.co/v0xr8jO7WD","date":"Sat Jun 12 20:12:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Had a great time last evening at the opening of the Hermitage Museum and Gardens’ newest exhibition, “Work in Progress: 13 Murals for Right Now” https://t.co/Sy4nRm0RcL","date":"Sat Jun 12 16:48:08 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It’s critical that the American Families Plan is passed into law, so the families I met today at Hampton Downtown Child Development Center will be able to afford child care https://t.co/dSxBPcY3mB","date":"Fri Jun 11 23:18:50 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Virginians can get vaccinated at https://t.co/NNTREYQ1Vk and if you don't live in Virginia you can visit https://t.co/ZoUvQhr9Kk to get your shot. #WeCanDoThis","date":"Fri Jun 11 20:57:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Since January 30, 2020, I have been asking the Occupational Health and Safety Administration to fulfill its mission to protect workers. While I am relieved that the Biden Admin has finally issued an ETS, today’s announcement is too little, too late for many workers and families.","date":"Thu Jun 10 18:07:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Emergency Temporary Standard issued today is a step in the right direction to protect health care workers from COVID-19. But it is long past due, and it provides no meaningful protection to many workers who remain at high risk of serious illness from COVID-19","date":"Thu Jun 10 18:07:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Wages are up and the unemployment rate is down. \n\nThe American Rescue Plan is working. And not a single Republican voted for it. \nhttps://t.co/ZNhSyWdwjB","date":"Thu Jun 10 17:15:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"\"America is back\" - @POTUS","date":"Thu Jun 10 13:37:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Hosted a virtual reception to announce this year's winners of VA-03's Congressional Art Competition. \n\nCongratulations to our 1st place winner: Avery from Maury High School! And thanks to all of our talented students that participated. https://t.co/0CcGwJshOB","date":"Wed Jun 09 22:24:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Dems passed a $39B down payment to keep child care providers open safely, keep workers on payroll, &amp; lower costs for hardworking families in the #AmericanRescuePlan. \n\nBut our work isn’t over. 1 in 7 child care jobs haven't returned. We must keep fighting for #CareEconomy jobs. https://t.co/vft909pz5u","date":"Wed Jun 09 20:51:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The federal minimum wage has not been increased since 2009. That is unacceptable. It’s time to #RaiseTheWage","date":"Wed Jun 09 15:14:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"👇","date":"Wed Jun 09 15:05:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"When something as simple as \"equal pay for equal work\" cannot break through Republican obstruction, it is obvious something needs to change.","date":"Wed Jun 09 13:55:08 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The @SenateGOP blocking the Paycheck Fairness Act is an insult to the millions of women who are doing the same job as their male counterparts for lower pay. This is further evidence that the U.S. Senate is no longer a functioning legislative body.\nhttps://t.co/k7mTQSHFBW","date":"Wed Jun 09 13:54:44 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"After a brutal year for women in the workplace, @senategop has come together to send a clear message that…they should continue earning less than men for the doing the same job.","date":"Tue Jun 08 23:15:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It's time to #BuildBackBetter with the American Families Plan and the American Jobs Plan.","date":"Tue Jun 08 15:37:03 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Virginians have made tons of progress in the fight against COVID-19 but we are not out of the woods yet. Do your part and get vaccinated at https://t.co/NNTREYQ1Vk\n\nGetting vaccinated means you can stop wearing your mask in many instances. Plus it just might save your life.","date":"Mon Jun 07 19:39:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Parents &amp; caregivers can’t go back to work, grow our economy, &amp; build better lives for their families unless they know their loved ones are safe &amp; cared for.\n \n.@POTUS’ American Families Plan &amp; American Jobs Plan will invest in the #CareEconomy so we can #BuildBackBetter. https://t.co/D3guKFe1gl","date":"Mon Jun 07 19:33:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Vaccinations are up, COVID cases are down. Job growth is up, and unemployment is down.  \n\nHowever, more must be done. \n\nWe must rebuild our communities and our economy better than before with the American Jobs Plan and the American Families Plan. It’s time to #BuildBackBetter. https://t.co/O0DfJVwdPN","date":"Mon Jun 07 16:20:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The pandemic has highlighted how having health care coverage is so important. \n\nThanks to the leadership of @POTUS, coverage through the Affordable Care Act has never been higher. \n\nMake sure you get covered at https://t.co/aUuUw8G2OG","date":"Sun Jun 06 17:14:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave a salute to the greatest generation, who were honored for fighting to preserve our freedoms during World War II, during the 2021 Virginia International Tattoo at S. B. Ballard Stadium on the campus of @ODU https://t.co/heJuFdMFHd","date":"Sun Jun 06 03:10:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Encouraged by the strong turnout at the One City Wake Up and Read Summer Kickoff today, where  @nnschools educators, members of law enforcement and community stakeholders teamed up to prevent summer slide https://t.co/3ezQ6N2BuH","date":"Sun Jun 06 02:58:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined Hampton Councilwoman @Csnead1 and Councilman Steve Brown at the Summer Open House for the Osher Lifelong Learning Institute and Grand Opening of the Asher Institute of Hampton https://t.co/EDajfgfUln","date":"Sat Jun 05 20:23:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Stopped by the Bethea Family Foundation’s Inaugural BFF Weekend Basketball Tournament, hosted by former NFL safety Antione Bethea (right). Also pictured with Vernon Lee (left). https://t.co/HwqusxrYrx","date":"Fri Jun 04 22:08:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Do your part and get vaccinated. #WeCanDoThis","date":"Fri Jun 04 20:35:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Two major takeaways from the May Jobs Report. \n\n1⃣ The Biden-Harris economic plan is working. The economy has created more than 2 million jobs since they took office. \n2⃣We still have a lot of work ahead to secure a strong, shared recovery.","date":"Fri Jun 04 15:56:03 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Biden-Harris Administration’s nomination of Dr. David Weil signals that workers can expect the @USDOL will have their backs at this critical moment in time. Perhaps no one is better prepared to address the challenges facing workers and their families.","date":"Thu Jun 03 20:27:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanks to the American Rescue Plan and the leadership of @POTUS.","date":"Thu Jun 03 15:03:43 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan is working. \n\n.@POTUS and Congressional Democrats are focused on beating the pandemic, providing critical relief to families and building back a better economy. #HelpIsHere \nhttps://t.co/W7Vn3ETot7","date":"Wed Jun 02 21:40:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan is working. And every single Congressional Republican voted against it.","date":"Wed Jun 02 15:57:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The economic plans from @POTUS and Congressional Democrats are working. The American Rescue Plan is putting our economy back on track. We must continue the progress with the #AmericanJobsPlan and the #AmericanFamiliesPlan.","date":"Wed Jun 02 14:37:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We must enact HR 1 #ForThePeople Act because everyone should have equal access to the ballot box. \n\nhttps://t.co/pKMF1XAnP7","date":"Tue Jun 01 20:51:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Happy #Pride! Every June is a chance for us to celebrate the LGBTQ community and to commemorate all the progress that has been made. It also serves as a reminder of the work that remains to combat prejudice and advance the cause of justice and equality for all.","date":"Tue Jun 01 15:09:26 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Reflected on the sacrifices that our military community has made during the Chesapeake Mayor's Commission on Veterans Affairs’ #MemorialDay Ceremony. Pictured with Keynote Speaker Col. Reginald Hairston (Ret.) and Commissioner Lincoln Smith https://t.co/2zUxGV6Typ","date":"Mon May 31 18:12:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"On #MemorialDay, we remember those who have paid the ultimate price for our freedom. \n\nWe thank all our service members, veterans, military families and fallen soldiers for their sacrifice. https://t.co/fO27OYfTn5","date":"Mon May 31 13:22:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Head over to https://t.co/ZoUvQhr9Kk if you haven’t been vaccinated yet!","date":"Sat May 29 21:53:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #BidenBudget is a blueprint for expanding opportunity and strengthening our economy. It proposes smart, significant investments in education, child care, health care, workforce training, and other key priorities that would improve the lives of Americans across the country.","date":"Fri May 28 20:13:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Here with @POTUS at Joint Base Langley-Eustis.","date":"Fri May 28 18:09:02 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Virginians have worked hard to make progress in the fight against COVID-19. Be sure to get vaccinated at https://t.co/NNTREYQ1Vk and we will finally put this pandemic behind us.","date":"Fri May 28 15:07:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Keep wearing your mask until you get vaccinated. https://t.co/4WqNKIAT8Q","date":"Fri May 28 13:38:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"🧾 🧾 🧾","date":"Thu May 27 18:55:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Fact check: True ✅","date":"Thu May 27 18:41:05 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Millions of American workers are out of a job while America’s infrastructure is in desperate need of investment. We must rebuild our communities and our economy better than before with the American Jobs Plan. It’s time to #BuildBackBetter. https://t.co/2LCYzbxnQ0","date":"Thu May 27 18:31:43 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Every child should be safe and protected while in school. Sadly, that is not always the case. That is why I have introduced the Keeping All Students Safe Act with @RepDonBeyer @RepMcEachin @ChrisMurphyCT and @PattyMurray.  https://t.co/M9NIgyXe5z","date":"Thu May 27 16:35:08 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is working and putting the economy back on track.","date":"Thu May 27 13:41:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"*Disappointed but not surprised*","date":"Wed May 26 20:35:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"A quality education cannot be achieved without a safe learning environment. The Keeping All Students Safe Act would establish nationwide requirements and provide states and teachers the support they need to improve their schools’ culture by using evidence-based interventions.","date":"Wed May 26 18:45:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"John was always focused on what was best for Virginia, and he could always be relied on to prioritize the people he served, not party or politics. I send my deepest condolences to John’s family &amp; loved ones and all those who were impacted by his life of public service.","date":"Wed May 26 12:21:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"John served as the dean of Virginia’s congressional delegation for many years and set the tone for how Democrats and Republicans should work together for the betterment of all Virginians. That is a tradition that our congressional delegation strives to continue today.","date":"Wed May 26 12:17:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"It is with a heavy heart that I learned of the passing of John Warner. A veteran of World War II and the Korean War before he served in the Senate, John dedicated his life to serving his country and the Commonwealth of Virginia.","date":"Wed May 26 12:17:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan is working.  (even though ZERO Republicans voted for it)","date":"Tue May 25 15:47:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, not only do we remember George Floyd, but we must also recognize the hundreds of lives lost to police brutality. We must enact the George Floyd #JusticeInPolicing Act to hold police accountable, improve transparency and protect our communities. #PoliceReformNow","date":"Tue May 25 13:51:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Participated in a harbor cruise on the American Rover today with @RepElaineLuria, Port of Virginia CEO Stephen Edwards, and CMA CGM North American President Ed Aldridge. https://t.co/QcCvZZHz45","date":"Mon May 24 22:46:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined @hrfoodbank and Peninsula elected officials in welcoming Claire Babineaux-Fontenot, CEO of @FeedingAmerica, to the region today. https://t.co/L5K56r5vd0","date":"Mon May 24 19:57:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s announcement is a commitment from the Biden-Harris administration to strengthen America’s higher education system. Quality higher education programs open doors of opportunity for millions of students and serve as a powerful engine for American prosperity.","date":"Mon May 24 17:22:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan has boosted vaccinations across the country and Virginians are doing their part. If we keep making progress, we can finally put this pandemic behind us. Virginians can get vaccinated at https://t.co/NNTREYQ1Vk","date":"Mon May 24 15:29:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The vaccines are safe and effective. Be sure to get yours at https://t.co/ZoUvQhr9Kk","date":"Mon May 24 00:17:22 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We need a bipartisan, independent commission to investigate the January 6th deadly insurrection at the U.S. Capitol. That’s why I voted YES on a bill to do just that. https://t.co/AHqVaGthaY","date":"Fri May 21 21:26:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is further proof of why we must enact the George Floyd #JusticeInPolicing Act - these excessive barriers to accountability are eliminated in the House-passed police reform bill. I remain committed to ensuring there is accountability in both these cases.","date":"Fri May 21 20:36:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"AAG Gupta also mentioned that there is an overwhelming preference for the state to proceed first with any criminal response, because the standards for federal criminal prosecution are significantly more burdensome.","date":"Fri May 21 20:36:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"AAG Gupta told me that officials at DOJ are monitoring Virginia's actions and that they are aware of the publicly available discrepancies in the accounts of these events. DOJ does not usually comment on criminal investigations, or confirm whether investigations are taking place.","date":"Fri May 21 20:35:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Hampton Roads is still shocked by recent events of police-involved violence in our community. That is why I had a conversation yesterday with Associate AG Vanita Gupta regarding the investigation of the shooting of Donovon Lynch and the disturbing traffic stop of Caron Nazario","date":"Fri May 21 20:32:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"...anyway. \nDemocrats are focused on jobs and building back a better economy.","date":"Fri May 21 18:05:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The headline says it all. \nhttps://t.co/svWgH6Q34N","date":"Fri May 21 00:18:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Very glad to see the COVID-19 Hate Crimes Act signed by @POTUS. This law will improve hate crime reporting and ensure more support for victims. #StopAsianHate \n\nAlso here's a reminder that 62 House Republicans voted against it.","date":"Thu May 20 20:31:51 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s bipartisan vote makes it clear that we are committed to uncovering the truth and investigating the causes and dangerous ideology behind the deadly insurrection that took place at the U.S. Capitol on January 6th.","date":"Wed May 19 22:56:54 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Good news is we passed the resolution. Bad news is that 180 Republicans voted no.","date":"Wed May 19 20:11:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is working: since @POTUS took office, we have created more than 1.5 million jobs, the most ever created in a president’s first 100 days, and have fully vaccinated over one-third of the country. https://t.co/9vWCL8hknk","date":"Wed May 19 17:11:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Vaccines work. Virginians can go to https://t.co/orVz7mJGrx to get their shots.","date":"Tue May 18 20:05:23 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan’s #ChildTaxCredit payments will set children up for success &amp; put money in hardworking parents’ pockets. \nhttps://t.co/tjJdJ47B6j","date":"Tue May 18 14:49:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Too many pregnant workers are forced to either leave their jobs or put their heath and the health of their pregnancy at risk. We can and must do better.","date":"Fri May 14 14:06:50 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Many American families could receive up to $300/month, per child as part of the advanced monthly #ChildTaxCredit payments from the #AmericanRescuePlan. File your taxes before May 17 to make sure your family starts getting your payments ASAP. https://t.co/UtVMHVTwb9","date":"Thu May 13 16:16:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is welcome news. Looking forward to things returning to normal in the coming days.","date":"Wed May 12 21:30:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Hampton Roads and communities across the country are still grappling with the economic hardships of the pandemic.\nFunds provided by the #AmericanRescuePlan keep the nation on a path to recovery and normalcy.\nhttps://t.co/Ob2q2HjRNV","date":"Wed May 12 20:33:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"As we honor the service of our nation’s nurses and grieve for those we have lost, I once again call on the Biden Administration to finalize an Emergency Temporary Standard that will establish the protections our health care workers need and deserve. #protectnurses","date":"Wed May 12 14:07:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"https://t.co/AxMwnO2Ht9","date":"Tue May 11 21:37:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thread on actions taken by the federal government in response to the Colonial Pipeline incident.","date":"Tue May 11 21:37:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Help Is Here! Thanks to the #AmericanRescuePlan and \n@POTUS, more people have access to quality, affordable health insurance. Be sure you and your family #GetCovered at https://t.co/aUuUw8G2OG\nhttps://t.co/LjPrweZoe2","date":"Tue May 11 15:47:27 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is directing more than $147 million to local colleges/universities in VA-03. This funding will secure the future of our valued institutions &amp; help struggling students stay on track and finish their education. https://t.co/VqDAxCezAs","date":"Tue May 11 13:26:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Rescue Plan’s #ChildTaxCredit payments will set children up for success &amp; put money in hardworking parents’ pockets. Secure your payment by filing your taxes for free today: https://t.co/UtVMHVTwb9 https://t.co/FMnRMRCQio","date":"Mon May 10 15:48:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today we celebrate all of the mothers. \n \nYou are truly appreciated. #HappyMothersDay ! https://t.co/b6yy3y6IcQ","date":"Sun May 09 20:12:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is working. Not a single House Republican voted for it. Now they are trying to take credit for it. \nhttps://t.co/LFxVvWRxWa","date":"Thu May 06 15:36:23 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The COVID-19 pandemic has been a stark reminder of the essential role direct care workers play in caring for our nation’s seniors and individuals with disabilities. Today, I introduced a bill to ensure that Americans have access to vital, everyday care.","date":"Tue May 04 18:39:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is putting our economy back on track. Now Congressional Republicans want to claim credit for its provisions even though they voted against it. #VoteNoAndTakeTheDough \nhttps://t.co/zYeAxGW345","date":"Tue May 04 17:20:46 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Do your part and get vaccinated so we can put this pandemic behind us.","date":"Tue May 04 16:49:25 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Here with @POTUS and @FLOTUS for their visit to @TCCva. Community colleges like TCC expand opportunities for students and create jobs in local economies. The #AmericanFamiliesPlan would allow all Americans to attend community college tuition-free.","date":"Mon May 03 17:23:52 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan created the #RestaurantRevitalizationFund to provide restaurants and other eligible businesses with critical financial relief from the pandemic. \nVisit https://t.co/rmEFIiPrZL for more information.","date":"Mon May 03 16:26:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great news and further evidence that the #AmericanRescuePlan is working. \nhttps://t.co/1Og7OE0cfd","date":"Sat May 01 16:30:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Hey, Hampton Roads! Still not vaccinated? Military Circle Mall is accepting walk-ins for first Pfizer shots through the end of TODAY from 9am-7pm, or you can make an appointment at https://t.co/orVz7mJGrx","date":"Sat May 01 13:50:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan cut child poverty in half. Let's keep moving forward. \nhttps://t.co/1BgoVDSYqE","date":"Thu Apr 29 20:18:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American people deserve to know exactly how their tax dollars are spent. That’s why @HouseBudgetDems are taking steps to strengthen Congress’ constitutional #PowerOfThePurse &amp; increase transparency of executive spending.","date":"Thu Apr 29 17:10:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS outlined a historic plan to build back a better economy. I look forward to advancing the #AmericanJobsPlan &amp; #AmericanFamiliesPlan to improve schools, create millions of jobs, protect the environment, &amp; strengthen support for families. #JointAddress","date":"Thu Apr 29 02:19:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"States and politicians across the country are trying to pass voter suppression laws that rely on falsehoods and misinformation about the 2020 elections. We must enact the #ForThePeople Act and the John Lewis Voting Rights Advancement Act. #JointAddress","date":"Thu Apr 29 02:09:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"For too long, we have been forced to live with gun violence and mass shootings at schools, places of worship, concerts, &amp; in our neighborhoods.  The House has passed bills to close gun show &amp; internet gun sale loopholes which circumvent criminal background checks. #JointAddress","date":"Thu Apr 29 02:04:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The verdict in the Chauvin trial does not absolve Congress and the federal government of our responsibility to reform policing across the country. We must enact the George Floyd #JusticeInPolicing Act.","date":"Thu Apr 29 01:57:59 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The days of unfair price gouging of Americans at the pharmacy counter must come to an end.","date":"Thu Apr 29 01:42:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanFamiliesPlan makes a significant down payment toward providing safe, affordable, and high-quality child care for working families across the country. This is one of the best investments we can make to support families and grow the economy.","date":"Thu Apr 29 01:39:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS is right. We must #PassThePROAct and #RaiseTheWage.","date":"Thu Apr 29 01:29:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Expanding access to high-quality child care and preschool is one of the best investments we can make to support families and grow the economy.","date":"Wed Apr 28 17:03:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanFamiliesPlan would help millions of Americans access a quality higher education. Drawing from @EdLaborCmte’s work on the America’s College Promise Act, the proposal calls for providing free community college tuition across the country.\nhttps://t.co/WsxRWi6tbq","date":"Wed Apr 28 16:47:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanks to the #AmericanRescuePlan, over 230 MILLION Americans have been vaccinated with at least one shot, and over 95 MILLION Americans are now fully vaccinated. #HelpIsHere https://t.co/bbrK6QZQQc","date":"Tue Apr 27 17:45:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I applaud President Biden’s consistent focus on workers’ rights and will continue working with the Administration on behalf of workers.  I also urge my Senate colleagues to #PassTheProAct so that workers can freely exercise their right to join a union.\nhttps://t.co/S0VRN5zAIX","date":"Tue Apr 27 14:12:08 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Nobody should be uninsured in a pandemic. Head over to https://t.co/aUuUw8G2OG and get covered.","date":"Mon Apr 26 16:21:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is working. \n200 MILLION shots in arms in under 100 days. \n\nhttps://t.co/trIbqcDepk","date":"Sat Apr 24 16:18:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Participated in the Ribbon-Cutting Ceremony for Eggleston Services’ Brain Injury and Veteran Programs Facility, which will allow Eggleston to double the footprint of its Brain Injury Services and Warrior Bridge Veterans’ programs https://t.co/kdzv2Rngeh","date":"Fri Apr 23 20:44:54 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I toured the Goodson House, an eco-friendly “Living Green House” and educational center, during my visit at the Virginia Living Museum. Thanks to Executive Director Rebecca Kleinhample (pictured) and the VLM staff. https://t.co/B1R4eDLQnH","date":"Fri Apr 23 18:30:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Wrote in the @virginianpilot on #EarthDay about the promise of @POTUS' #AmericanJobsPlan, a once-in-a-century investment to create millions of good paying jobs &amp; foster economic growth, while ensuring we protect the planet for future generations. \nhttps://t.co/UUdGQP0vg2","date":"Thu Apr 22 17:40:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I also want to congratulate my colleague Congresswoman @EleanorNorton, who has been a tireless champion for the citizens of our nation's capital.","date":"Thu Apr 22 16:12:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Supporting #DCStatehood is about our nation’s core principles of self-determination, opposition to taxation without representation, &amp; giving an equal voice to all Americans. This bill will end the historic injustice that has persisted for more than 200 years for the people of DC.","date":"Thu Apr 22 16:11:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #ChildCare for Working Families Act will finally provide families relief from the high cost of child care. This investment will immediately improve the lives of millions of children and families while creating new jobs and encouraging faster growth in our communities.","date":"Thu Apr 22 15:47:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today I joined my colleagues to introduce historic legislation that will lower the cost of prescription drugs and build a fairer system for American consumers. #HR3","date":"Thu Apr 22 15:08:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is great news and more evidence that the #AmericanRescuePlan is working.","date":"Wed Apr 21 17:20:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Rev. Martin Luther King frequently repeated the quote that the arc of the moral universe is long, but it bends towards justice. Others have added that it doesn’t bend that way by itself. Today’s verdict helps bends the arc towards justice.","date":"Wed Apr 21 01:06:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This verdict is a start, but it does not absolve Congress and the federal government of our responsibility to reform policing across the country, and it is a reminder of the need for the Senate to pass the George Floyd #JusticeInPolicingAct.","date":"Tue Apr 20 21:31:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"While nothing will bring George Floyd back to his family and loved ones, the verdict was just. Derek Chauvin was afforded the due process that George Floyd was denied and found guilty by a jury of his peers.","date":"Tue Apr 20 21:30:26 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Sad to hear this news. Vice President Mondale dedicated his life to public service and was a voice for the voiceless. Sending my condolences to his family and loved ones.","date":"Tue Apr 20 01:12:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Evidence shows that schools disproportionately discipline Black and Latino students more frequently than their white peers. Any law enforcement system that uses school discipline data to identify children as potential criminals would not only be illegal, but also racially biased.","date":"Mon Apr 19 19:01:03 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is working. \nhttps://t.co/hbbrsmBhUA","date":"Mon Apr 19 15:22:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave remarks about the need for equity in the vaccine distribution process during the 2nd Dose Vaccine Clinic &amp; Ramadan Fellowship at the Peninsula Islamic Community Center. Thanks to Dr. Jordan Asher (pictured) and the team from Sentara for administering the vaccine doses. https://t.co/UjCxC5DKwb","date":"Sat Apr 17 01:37:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Over the past year, we have voiced exceptional praise for health care and social service workers, who have risked their lives to care for ourselves and our loved ones. This bill protects our nation's caregivers from unacceptably high rates of workplace violence.","date":"Fri Apr 16 16:01:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Paycheck Fairness Act will ensure that gender equality on the job is not an aspiration, but a reality. Read about the bill here: https://t.co/cb2R3sBsue\"","date":"Thu Apr 15 18:55:52 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I have personally spoken with AG Garland and formally asked for @TheJusticeDept to investigate the police treatment of Donovon Lynch &amp; 2nd Lt Caron Nazario. We deserve transparency, accountability, and most of all, the truth about these incidents. https://t.co/nn0YJVexLx","date":"Thu Apr 15 15:04:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is working.","date":"Thu Apr 15 13:39:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"While the #AmericanRescuePlan is changing the course of the pandemic and delivering relief for working families, we must rebuild our communities and our economy better than before with the American Jobs Plan. It’s time to #BuildBackBetter. https://t.co/oSOqV1fCRr","date":"Tue Apr 13 19:27:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Wishing all who celebrate a peaceful and reflective #Ramadan. https://t.co/HqLOTzzLXl","date":"Mon Apr 12 21:55:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"April is #ChildAbusePreventionMonth. The House has already passed the Stronger Child Abuse Prevention and Treatment Act, which takes major steps toward preventing and treating child abuse and neglect. Learn more here: https://t.co/YnwBhiBphs","date":"Mon Apr 12 17:43:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today marks the 100th day of House Democrats fighting #ForThePeople in the 117th Congress. In four short months, we enacted the #AmericanRescuePlan, passed the #PROAct to strengthen unions, passed the #JusticeInPolicing Act and MORE. #100DaysOf117th\nhttps://t.co/GLcmLJB5LA","date":"Mon Apr 12 17:00:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"These dangerous and tragic events highlight why the Housse passed the George Floyd #JusticeInPolicing Act. I urge the Senate to immediately pass this legislation and send it to @POTUS' desk for signature. It would be a critical first step in reforming policing in America.","date":"Sun Apr 11 01:27:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The release of this video also comes while the Hampton Roads community is still mourning the loss of Donovan Lynch who was killed by officers while their body worn cameras were not activated. Both of these instances should be investigated by federal authorities.","date":"Sun Apr 11 01:26:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I was horrified when I viewed the recently released video footage of the police treatment of Caron Nazario, a second lieutenant in the U.S. Army. This should have been a routine traffic stop and the video speaks for itself.","date":"Sun Apr 11 01:25:54 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Attended the opening of the Say it Loud exhibit at Main St. Library, which honors heroes from Newport News’ Southeast community https://t.co/GdO5hA9ves","date":"Sat Apr 10 20:57:33 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is very good news! Nobody should be uninsured in a pandemic. Be sure to head over to https://t.co/aUuUw8G2OG if you need health coverage now. \nhttps://t.co/2vNQ7SAxpq","date":"Sat Apr 10 19:56:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to see organizations like Sister To Sister, Brother To Brother, Warwick SRO and the Boys and Girls Club of VA Peninsula team with Sedgefield Elementary School to serve meals to the community https://t.co/Aj0Ol35GCw","date":"Sat Apr 10 19:47:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Doug Parker is the right choice to lead @OSHA_DOL. Throughout his career, Doug has been an outspoken advocate for miners and a fierce defender of workplace safety for all Americans. With his appointment, workers will have yet another strong ally in President Biden's @USDOL.","date":"Fri Apr 09 20:02:05 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"America’s workers will not have consistent access to free, fair, and safe union elections until we strengthen our nation’s labor laws. The Senate must pass the #PROAct.","date":"Fri Apr 09 15:56:25 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"On #HolocaustRemembranceDay we remember the six million people murdered and teach about the importance of fighting antisemitism and hate. We must never allow such atrocities to happen ever again. #YomHaShoah","date":"Thu Apr 08 17:23:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Understanding the impact of the pandemic on students' education is an essential step toward helping students get back on track. We cannot solve what we do not measure. Read this important piece from @MARCMORIAL and @JMurguia_Unidos. \nhttps://t.co/Bxpae8JMIv","date":"Thu Apr 08 12:59:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"150 MILLION shots in arms and 150 MILLION checks out the door for American families! Help Is Here with the #AmericanRescuePlan. \nhttps://t.co/TraDncCRia","date":"Wed Apr 07 16:36:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This pandemic and economic crisis are hurting  many people across the country, but Help Is Here. \nThe #AmericanRescuePlan is saving lives and livelihoods by putting 150 MILLION shots in arms in the first 75 days of @POTUS’ term! https://t.co/oTgyj7nGvY","date":"Tue Apr 06 22:22:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I was deeply saddened by the passing of my friend &amp; colleague @RepHastingsFL, a steadfast advocate for civil and human rights, working families, and the most vulnerable in our society. I send my sincerest condolences to his family, friends, staff, and loved ones.","date":"Tue Apr 06 18:20:13 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Wishing a #HappyEaster to all who celebrate! https://t.co/Ay5gJYD7hj","date":"Sun Apr 04 21:48:03 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Sending my condolences to the officer’s family and loved ones. The Capitol Police keep Members of Congress, staff and visitors safe every single day and we are grateful for their service.","date":"Fri Apr 02 19:36:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Social Security recipients - you should get your direct cash payment from the #AmericanRescuePlan by April 7th \nhttps://t.co/OOfCWn8sqe","date":"Thu Apr 01 21:47:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Republicans are now praising elements of the #AmericanRescuePlan that they all voted against. \nhttps://t.co/9I2a43AW9r","date":"Thu Apr 01 18:43:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Met with members of the Virginia Air National Guard to attend a Ribbon Cutting and Groundbreaking at Langley Air Force Base. https://t.co/uDyVb0fgCM","date":"Thu Apr 01 01:07:06 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American Jobs Plan reflects many of the key legislative priorities championed by @EdLaborCmte. I applaud @POTUS for his leadership in proposing a plan that ensures all Americans can share in this recovery.","date":"Wed Mar 31 20:58:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I visited the new @fema Community Vaccination Center in Norfolk today with @GovernorVA &amp; other elected officials. The #AmericanRescuePlan will help us get more shots in more arms and be critical in making sure we equitably distribute vaccines in Hampton Roads","date":"Wed Mar 31 16:52:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"As we continue to confront the economic fallout from the pandemic, this is a vital step that will put money in the pockets of struggling Americans and their families. I applaud this action from the Biden administration and urge @usedgov to provide further relief for borrowers.","date":"Tue Mar 30 18:08:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I'm hosting a tele-town hall right now on the #AmericanRescuePlan. Join the conversation at: https://t.co/objry2DtgP or https://t.co/Imseh9p0oR.","date":"Mon Mar 29 23:12:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"You can go to https://t.co/aUuUw8G2OG and get health coverage as soon as April 1. Nobody should go without health insurance in a pandemic.","date":"Mon Mar 29 19:28:52 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Great to have community organizations like the Philippine-American Community of the Peninsula partner with local pharmacies to distribute vaccines. It’s also an honor to have Renato Villa, the Deputy Chief of Mission at the Embassy of the Philippines in the 3rd District today. https://t.co/JKiAD82kzf","date":"Sun Mar 28 20:12:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Chag Sameach to all who are celebrating #Passover. https://t.co/W71gGwRmLP","date":"Sun Mar 28 16:30:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Gave remarks in solidarity with the AAPI community today at the Stop Asian Hate rally at the NNPD HQ. #StopAAPIHate #stopasianhate https://t.co/JQ9BPQhK8Y","date":"Sat Mar 27 23:09:16 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joined USW Local 8888 President Charles Spivey at the Newport News Shipbuilding COVID-19 Vaccination Site, and received an update on their vaccine rollout from the site management team. https://t.co/Q4omPbGySa","date":"Sat Mar 27 19:16:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Sending my condolences to all the victims and their families as well as the entire Virginia Beach community for dealing with another mass shooting. We should not have to accept this as normal.","date":"Sat Mar 27 16:45:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is great news for Hampton Roads. The #AmericanRescuePlan is working and getting more shots in more arms.\nhttps://t.co/RYVVMVW0tw","date":"Fri Mar 26 18:49:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanks, Biden.","date":"Fri Mar 26 17:56:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Got a chance to visit Ivy Baptist Church and Sentara’s vaccination clinic in Newport News. Getting people vaccinated will help us crush the virus and help rebuild our economy. https://t.co/Jm82iTU915","date":"Fri Mar 26 17:44:32 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today is a National Day of Action and Healing. There were 3,800 reported cases of anti-Asian discrimination related to COVID19 over the past year. We must reject bigotry and stand up with our friends &amp; neighbors. Together we can #StopAsianHate","date":"Fri Mar 26 17:03:16 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Because of the #AmericanRescuePlan, community health centers in Hampton Roads will be receiving funds to ramp up vaccinations. Equitable distribution of vaccines will ensure that we crush the virus, get students back in schools &amp; get people back in jobs.\nhttps://t.co/bL3kuNKTWy","date":"Thu Mar 25 20:51:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Weekly jobless claims are finally falling below record-levels, but we should not be celebrating a week in which nearly 700,000 new workers filed for unemployment relief. The #AmericanRescuePlan is critical to rescuing our economy and saving American lives and livelihoods.","date":"Thu Mar 25 14:41:47 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is long overdue and an important step to ensuring equal justice under the law. \nhttps://t.co/au2xwOwB6p","date":"Wed Mar 24 19:57:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"In 30 minutes, the @EdLaborCmte is marking up three important bills to:\n-Guarantee women receive #EqualPayForEqualWork\n-Protect pregnant workers from discrimination\n-Keep health care workers safe on the job","date":"Wed Mar 24 15:30:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"By repealing this rule, Congress will eliminate wasteful litigation that would cause substantial delays or even deny justice for victims of discrimination.","date":"Tue Mar 23 20:18:22 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Because of the #ACA and the #AmericanRescuePlan, families across the country are able to enjoy the protections and security of affordable and accessible health coverage.","date":"Tue Mar 23 15:11:53 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"STARTING NOW! Join me for a telephone town hall on the #AmericanRescuePlan &amp; how we will defeat the #COVID19 pandemic. Listen live on my website at https://t.co/objry2DtgP or via Facebook at https://t.co/Imseh9p0oR.","date":"Mon Mar 22 23:00:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congratulations Secretary @MartyJWalsh!  \n\nI am confident that he will restore the mission of @USDOL to ensure that Americans can obtain meaningful employment, fair pay, a safe workplace, and a dignified retirement.\n\nhttps://t.co/Lkl94oisYk","date":"Mon Mar 22 22:45:04 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Proud to be an original co-sponsor of HR 51 - the #DCStatehood bill introduced by @EleanorNorton. Supporting DC statehood is about our nation’s core constitutional principles of self-determination, opposition to taxation without representation, &amp; giving an equal voice to all.","date":"Mon Mar 22 20:46:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Nobody should be uninsured in a pandemic. A Special Enrollment Period at https://t.co/aUuUw8G2OG is open  until May 15.","date":"Mon Mar 22 13:50:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Promises made, promises kept. 42 days ahead of schedule.","date":"Fri Mar 19 17:52:51 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I'm holding a Telephone Town Hall on Monday, March 22nd at 7:00 p.m to discuss how the #AmericanRescuePlan will safely re-open schools, ramp up vaccinations, put money in people’s pockets &amp; put people back in jobs. You can register for the town hall below.\nhttps://t.co/objry2DtgP","date":"Fri Mar 19 16:15:09 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today, the House of Representatives passed the bipartisan American Dream and Promise Act which will finally offer permanent protections to all Dreamers who are integral to our communities and our economies. #HomeIsHere \nhttps://t.co/ytqKcQW1ad https://t.co/sjwaZsxAkD","date":"Thu Mar 18 22:15:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"For too long, corporations have dumped dangerous pollution on low-income neighborhoods &amp; communities of color.\n\n@RepMcEachin and @RepRaulGrijalva's #EnviroJusticeNow bill will give communities in VA &amp; across the US the power to end this injustice and I am proud to support it.","date":"Thu Mar 18 19:14:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"$1,400 stimulus checks from the #AmericanRescuePlan have started hitting bank accounts. You can check the status of your direct payment below. \nhttps://t.co/LpBEuKdIEh","date":"Thu Mar 18 15:55:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today’s announcement by @usedgov is lifechanging for tens of thousands of defrauded student loan borrowers who will finally be granted the debt relief they deserve. I applaud the Biden Administration for doing the right thing by making these borrowers whole.","date":"Thu Mar 18 15:27:33 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Everyone – regardless of their age – should be able to go to work every day knowing that they are protected from discrimination. #POWADA is a bipartisan bill that would restore legal protections for older workers.","date":"Thu Mar 18 14:23:26 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Severe weather is predicted this afternoon in Hampton Roads. 📲Please stay alert to conditions and follow @NWSWakefieldVA @VDEM and local media for updates. More info on how to prepare here: https://t.co/6DRBZHi6nh","date":"Thu Mar 18 13:06:44 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The Violence Against Women Act is lifesaving legislation that maintains the safety, resources, and protections critical to survivors, particularly those in marginalized communities. #VAWA #VAWA4ALL https://t.co/uOwsdcdhDB","date":"Wed Mar 17 22:02:22 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan is less than a week old and it has ALREADY saved tens of thousands of jobs. No wonder more than 70 percent of Americans support this relief package.\nhttps://t.co/YZ3mKXYYYS","date":"Wed Mar 17 17:54:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The United States is the richest country in the world, but millions of Americans still can’t afford health care. Every person has the right to health care – regardless of their income. That’s why I’m joining @RepJayapal and @RepDebDingell in reintroducing #MedicareForAll. #M4A https://t.co/gcRh0nSmcw","date":"Wed Mar 17 17:18:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The shootings in Atlanta are a shocking act of gun violence but also appear to be an act of hate. While my heart goes out to the victims' loved ones, I join in the chorus of voices standing with the AAPI community. We must condemn hate and bigotry in all forms. #StopAsianHate","date":"Wed Mar 17 15:22:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Stronger CAPTA is the bipartisan solution we need to prevent child abuse and neglect from happening in the first place and provide better treatments to address child abuse when it takes place.","date":"Tue Mar 16 21:21:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan will dramatically LOWER poverty in the U.S.—cutting it by more than HALF for children &amp; households experiencing job loss and reducing disparities in poverty rates. https://t.co/VunHaABTfA","date":"Tue Mar 16 15:44:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Earlier this morning I went on @CSPAN to discuss the #PROAct which will help rebuild America’s middle class by ensuring workers can stand together and negotiate for higher wages, better benefits, and safer working conditions. https://t.co/ADYcwQstTI","date":"Tue Mar 16 13:39:07 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Happening Now!","date":"Tue Mar 16 12:31:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanks to Pastor Geoffrey Guns &amp; other Hampton Roads pastors for joining together with Hague Pharmacy  to distribute 2,000 vaccines today. https://t.co/Vz8V9r3lJx","date":"Sun Mar 14 22:45:25 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Vaccine distribution continues to ramp up thanks to #AmericanRescuePlan. Hundreds of doses were taken in Portsmouth thanks to Pastor Riddick, @StMarkVA1 staff, Nurse Iris Lundy and the team from @sentarahealth. https://t.co/Zw5g3uCMzW","date":"Sat Mar 13 20:29:10 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"At the @WhiteHouse with my Democratic colleagues to commemorate enactment of the #AmericanRescuePlan. https://t.co/LkcZfzUoP1","date":"Fri Mar 12 20:18:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"At the @WhiteHouse to celebrate enactment of the #AmericanRescuePlan. Help is here.","date":"Fri Mar 12 19:40:14 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@POTUS is right. Crushing the virus will drive our economic recovery. Thanks to the #AmericanRescuePlan, we will:\n \n💉 Ramp up vaccinations\n🏫 Safely re-open schools\n🏬 Save and create jobs\n💵 Send relief directly to working families and small businesses\n \nHelp is here.","date":"Fri Mar 12 01:53:08 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Today the House will pass #HR8 the Bipartisan Background Checks Act and HR 1446 the Enhanced Background Checks Act. These bills will help #EndGunViolence by expanding background checks, and close the gun show loophole as well as the #CharlestonLoophole. https://t.co/jf5GzjY8J4","date":"Thu Mar 11 15:57:51 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Agreed. Good thing Democrats passed the #AmericanRescuePlan without any Republican support.","date":"Wed Mar 10 23:31:56 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Joining @SpeakerPelosi and other congressional leaders to send the #AmericanRescuePlan to @POTUS. Help is on the way.","date":"Wed Mar 10 20:10:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The American people have been calling on us to deliver relief and to defeat the COVID-19 pandemic. Today, we come together to send a resounding message that help is on the way. #AmericanRescuePlan","date":"Wed Mar 10 19:13:55 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan will crush COVID19 &amp; get our economy back on track by getting:\n🩹 Shots in arms\n💵 Money in pockets\n🏫 Schools safely re-opened\n🛠️ People in jobs\n\nThat's why the vast majority of Americans support @POTUS' plan &amp; why Democrats will deliver #ForThePeople.","date":"Wed Mar 10 17:44:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Labor unions are essential to rebuilding America’s middle class and improving the lives of workers and their families. The House just took a critical step to secure workers’ right to stand together and join a union.","date":"Wed Mar 10 01:57:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Anti-union attacks funded by wealthy special interests have resulted in a steep drop in union membership, which has eroded America’s middle class. The #PROAct will help rebuild the middle class and improve the quality of life for workers and their families. https://t.co/y7JBnSPwKw","date":"Tue Mar 09 19:42:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"There is a difference between praising hard work and standing up for hardworking people. Workers need our solidarity, and they need our action. This week the House will do its part by passing the #PROAct.\nhttps://t.co/nZprrZEImm","date":"Tue Mar 09 17:28:41 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Unions are essential to rebuilding America’s middle class and improving the lives of workers and their families. Today @HouseDemocrats will pass the #PROAct, which ensures workers can stand together and negotiate for higher wages, better benefits, and safer working conditions. https://t.co/r9iPOfO3as","date":"Tue Mar 09 13:10:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"On #InternationalWomensDay we honor all the contributions of generations of women, and we must re-commit ourselves to fighting for equal pay, expanding access to child care, and preserving access to reproductive health care.","date":"Mon Mar 08 15:26:26 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Help is on the way. #AmericanRescuePlan","date":"Sat Mar 06 18:53:31 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Everyone wants schools open and safe. That’s why the #AmericanRescuePlan makes nearly $130 billion available to State Education Departments immediately so they can safely reopen schools, protect students and staff, and address the impact of lost time in the classroom.","date":"Thu Mar 04 20:05:58 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Last night, @HouseDemocrats passed #HR1 the #ForThePeople Act to protect and expand the right to vote, and expose “dark money\" in our politics. Every American should be able to participate in democracy no matter who they are or how much money they have. https://t.co/21IUGSRX5L","date":"Thu Mar 04 18:16:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Every American should have an equal voice in our democracy regardless of who they are, where they come from, or how much money they have. The #ForThePeople Act will end the era of dark money in our politics and restore power to the people. My statement: https://t.co/Cl5fxKIhpD","date":"Thu Mar 04 04:14:33 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I urge my colleagues in the Senate to pass this bill as quickly as possible. More information about the George Floyd #JusticeInPolicing Act can be found below. \nhttps://t.co/EpIIIUDmIA","date":"Thu Mar 04 02:41:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The George Floyd #JusticeInPolicing Act will:\n-Ban chokeholds &amp; no-knock warrants;\n-Create national standards for policing policies;\n-Provide for data collection; \n-Remove barriers that make it difficult to hold police officers accountable for misconduct.","date":"Thu Mar 04 02:40:08 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Last summer, Americans across the country protested the murder of George Floyd. They marched to demand an end to police misconduct &amp; more accountability in our criminal justice system. Today, the House responded by passing the George Floyd #JusticeInPolicing Act.","date":"Thu Mar 04 02:35:50 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Nobody should be uninsured in a pandemic. If you need health insurance, you can #GetCovered at https://t.co/aUuUw8G2OG between now and May 15.","date":"Wed Mar 03 21:34:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"\"Broad, bipartisan support\" for the #AmericanRescuePlan which will help safely re-open schools, ramp up vaccinations, and issue more direct cash payments to working families. \n\nThis is an American priority and Congressional Republicans are not listening.\nhttps://t.co/33jHhdnKkP","date":"Wed Mar 03 17:44:48 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is more great news in our fight to crush the virus.","date":"Tue Mar 02 21:31:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Read my full statement on the new independent watchdog report, which found OSHA failed to protect workers during the pandemic.\nhttps://t.co/sT5CnubFd8","date":"Tue Mar 02 20:46:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"#COVID19 has taken a devastating toll on workers across key sectors of the economy. Issuing an enforceable standard sooner could have saved lives. Instead, the Trump Admin left workers on their own. \nI strongly support President Biden's efforts to protect workers from COVID-19.","date":"Tue Mar 02 20:46:21 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"#HR 1 will:\n\n🗳️Protect the right to vote.\n🛡️Ensure the integrity of our elections.\n🕴️Crack down on lobbyists and Washington insiders.\n⚖️Hold elected officials accountable.\n💰End the era of big money in our politics.\n\nThat’s why I’m voting for the #ForThePeople Act this week.","date":"Tue Mar 02 16:25:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Dominion Energy is hosting virtual meetings on March 2 and March 4th for residents in Virginia Beach and Chesapeake. To join, visit https://t.co/Ya2tZKVGrD or call 1-844-319-2065","date":"Tue Mar 02 14:54:11 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Offshore wind is bringing clean energy and good jobs to Virginia as we #ActOnClimate. Input from Chesapeake and Virginia Beach residents is needed to find a path to bring the energy onshore.\nhttps://t.co/ZURefrmph9","date":"Tue Mar 02 14:51:00 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Unions are essential to rebuilding the middle class. But workers regularly face intimidation and retaliation for exercising their right to organize. That’s why we must pass the #PROAct.","date":"Mon Mar 01 23:46:08 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I look forward to working with Dr. Cardona in our shared belief that high-quality, public education is invaluable to the success of individuals and our nation. I am fully confident in his ability to lead @usedgov in its mission of educational equity for all.","date":"Mon Mar 01 23:19:01 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Virginians - make sure you pre-register for your COVID-19 vaccination at https://t.co/orVz7mJGrx or 877-VAX-IN-VA.","date":"Mon Mar 01 14:37:03 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Every House Republican voted against the #AmericanRescuePlan which will: \n🚌 Return children to school safely\n🏥 Ramp up vaccinations\n💰 Send $1,400 economic impact payments to working families\n\nThis is not a red state or blue state priority. It’s an American priority.","date":"Sun Feb 28 21:54:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"5,000 people received vaccine doses today at the Hampton Convention Center thanks to the @SentaraHealth team. It’s important that everyone gets vaccinated when it is a dose is available to you. #GetVaccinated https://t.co/Gqeb6dGjF0","date":"Sun Feb 28 02:22:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Stopped by the @AADMHS vaccination site to greet vaccine recipients. Thanks to @Riverside and all the volunteers who helped made this event a success. #GetVaccinated https://t.co/imM1k5JtW9","date":"Sat Feb 27 22:52:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Our nation’s students, workers, and families are calling on Congress to provide the relief they urgently need.  By passing the #AmericanRescuePlan, we are sending a clear message that we are listening to our constituents and that help is on the way.","date":"Sat Feb 27 07:17:57 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Americans are dying, schools are shuttered, &amp; millions of\nworkers are still struggling with unemployment. Our nation needs the #AmericanRescuePlan Act of 2021 which will: \n✔️ Deliver immediate relief to working families\n✔️Safely reopen schools\n✔️Put more vaccines in more arms","date":"Sat Feb 27 02:27:12 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Everyone agrees we want kids back in school. Today, Democrats are doing what it takes to make that happen. \n\nThe #AmericanRescuePlan will help schools re-open safely, protect students and staff, and make up for lost classroom time.","date":"Fri Feb 26 19:37:17 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Looking forward to voting for this bill which includes @RepMcEachin's Great Dismal Swamp National Heritage Area Act which I was proud to co-sponsor. By protecting #publiclands in Virginia &amp; across the US, we protect biodiversity &amp; the climate for future generations. #KeepItWild","date":"Fri Feb 26 16:17:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Freedom from discrimination is a core American value. \n\nBy passing the #EqualityAct, the House is again taking a step to ensure LGTBQ+ individuals are protected against unlawful discrimination.","date":"Thu Feb 25 21:47:19 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thread on the #AmericanRescuePlan ⤵️","date":"Thu Feb 25 15:03:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Congressional Republicans may fail to see the urgency of the moment, but Americans want Congress to pass the #AmericanRescuePlan which will put vaccines in more arms, help schools safely re-open and provide relief for small businesses &amp; working families. \nhttps://t.co/kWGfHSJxTa","date":"Wed Feb 24 21:45:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This is welcome news. Be sure to keep wearing a mask as vaccinations continue to ramp up.","date":"Wed Feb 24 18:11:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The #AmericanRescuePlan will help school districts reopen safely, protect students and staff, and make up for lost classroom time.","date":"Wed Feb 24 15:56:15 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I am encouraged that after a decade, at least a couple of Republican senators finally recognize the need to give low-wage workers a raise. But raising the minimum wage to just $10, five years from now, would be totally insufficient. #RaiseTheWage #FightFor15","date":"Tue Feb 23 22:12:38 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I’m joining @HouseBudgetDems to markup the #AmericanRescuePlan Act of 2021. The GOP is taking a “wait &amp; see” approach to #COVID relief – but we’ve seen the consequences of inaction before. Today’s markup is a critical step in getting relief to working families immediately.","date":"Mon Feb 22 18:16:29 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"COVID19 created unprecedented challenges for our education system &amp; provided a constant reminder of the critical role public schools have in communities.  \nWe face significant hurdles in defeating the pandemic &amp; addressing its impact on students – but I know we are up to the task","date":"Mon Feb 22 17:44:18 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Excellent!","date":"Thu Feb 18 21:00:37 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"In many states, a person can be denied housing, education, access to credit, or the chance to serve on a jury because of their sexual orientation or gender identity. It’s wrong. We need to pass the #EqualityAct and end this discrimination. https://t.co/GNnQNZS2pG","date":"Thu Feb 18 20:53:28 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"I look forward to working with @POTUS in getting the bipartisan and House-passed National Apprenticeship Act of 2021 through the Senate and signed into law.  This legislation will support workers, employers, and our economy as we #BuildBackBetter.","date":"Thu Feb 18 20:31:40 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Climate change fuels extreme weather, making arctic blasts and hurricanes more frequent &amp; severe. To prevent power outages &amp; keep communities safe, we must #BuildBackBetter. In creating a cleaner &amp; more resilient future, we can put people back to work in good-paying, union jobs.","date":"Thu Feb 18 16:38:34 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Tune in!","date":"Thu Feb 18 15:29:45 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"During this COVID pandemic, don’t go uncovered. A Special Enrollment Period at https://t.co/aUuUw8G2OG is now open  until May 15. Last year, 2 in 3 shoppers could find a plan for $10/month or less after tax credits. See what you qualify for at https://t.co/EAcnhBjhrj. #GetCovered https://t.co/T131i5Tu9a","date":"Wed Feb 17 20:33:24 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Proud to introduce the Pregnant Workers Fairness Act with @RepJerryNadler @RepJohnKatko @RepLucyMcBath @HerreraBeutler. This legislation has broad support across the political spectrum and across our communities – and is long overdue.","date":"Tue Feb 16 21:49:39 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@VDHgov has launched a new, centralized website that allows Virginians to pre-register for the COVID-19 vaccine. This site allows individuals to register online, check that they are registered, and access additional information on the vaccination roll-out\nhttps://t.co/PUYuyTRfcb","date":"Tue Feb 16 17:45:30 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"Thanks to @GayleneKan, Dr. Tremaine Johnson &amp; @DrDwightRiddick for bringing together faith leaders &amp; public health officials from across Hampton Roads for an important conversation &amp; update on COVID-19 vaccine distribution in Virginia. More info at: https://t.co/SLQfXFDnTl https://t.co/20Zj7mpj5Q","date":"Mon Feb 15 15:45:42 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"While he has been acquitted, again, Donald Trump was found guilty by a historic number of Senators from his own party. He will have the unique distinction in history of losing the popular vote twice and being the only president to be impeached twice. My full statement: https://t.co/Ov5imPxwno","date":"Sat Feb 13 22:26:49 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"The CDC guidance only increases the urgency of passing @POTUS' American Rescue Plan and getting schools the resources they need to safely reopen for in-person instruction and protect students and staff from this deadly virus.","date":"Fri Feb 12 21:30:26 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":".@cvspharmacy locations throughout Virginia will now be administering COVID-19 vaccines. More information can be found below.","date":"Thu Feb 11 14:36:20 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"We have a responsibility to do everything in our power to defeat the virus and build back a better America. I want to thank all of my colleagues on the @EdLaborCmte for taking this important step toward providing our communities the relief they need and serve.","date":"Wed Feb 10 09:35:36 +0000 2021","user_id":"161791703"},{"handle":"BobbyScott","text":"This legislation invests in safely reopening schools, raises wages and increases safety protections for workers, expands access to affordable care, and provides support for the surge of families facing hunger and hardship during this pandemic.","date":"Wed Feb 10 09:33:06 +0000 2021","user_id":"161791703"}]