[{"handle":"BradSherman","text":"Good to see the United States under @POTUS Biden standing up against outrageous attempts to delegitimize #Israel through biased reports. \nhttps://t.co/TOwte9wT6s","date":"Wed Jun 15 20:49:45 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The #January6thCommittee effectively demonstrated how #January6th was not only a horrific act of violence, it was an attempted coup by Trump and his allies to steal the election. \n\n#January6thCommitteeHearings","date":"Fri Jun 10 03:38:52 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":".@RepLizCheney is doing an outstanding job of presenting the facts and explaining their importance. #January6thHearings","date":"Fri Jun 10 01:13:00 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"All economies are affected by #COVID19 &amp; #Putin's invasion of #Ukraine. Price increases from March-April were higher in the U.K. &amp; E.U. than the U.S. \n\nThe #GOP, &amp; their puppets like @TuckerCarlson, are desperately trying to figure out how to blame @POTUS for inflation in Europe. https://t.co/SIWt3QJQEw","date":"Thu Jun 09 21:48:01 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Yesterday we passed the #ProtectingOurKidsAct to defend our kids from tragic school shootings. \n\nThere's more work to do and more solutions are on the way to #EndGunViolenceNow. \n\nWe refuse to wait around any longer for those who value guns over lives. (2/2) https://t.co/aqfuhaphR5","date":"Thu Jun 09 17:18:26 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Our work to #EndGunViolence continues.\n\nToday @HouseDemocrats passed the Federal Extreme Risk Protection Order Act, which will help remove weapons from people who represent a danger to themselves or others by implementing a nationwide “red flag” law. (1/2)","date":"Thu Jun 09 17:18:25 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":".@HouseDemocrats are wasting no time to enact sensible policies in response to the tragic #GunViolence plaguing our communities. \n\nToday the House passed the  #ProtectingOurKidsAct — commonsense legislation that I co-sponsored to help keep our children safe. https://t.co/QvwljgQFLG","date":"Thu Jun 09 04:35:55 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"It was great to join and speak at the @PierceCollegeCA commencement ceremony yesterday where the graduation topic was \"optimism\" -- a fitting theme for the vibrant and promising graduating class of 2022. https://t.co/qXsbFaGbI7","date":"Wed Jun 08 16:06:25 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today I had the pleasure of addressing the @LAValleyCollege commencement ceremony and expressed my best wishes to the bright and talented graduating class of 2022. Looking forward to addressing the graduating class of @PierceCollegeCA later today. https://t.co/1KcqItPzs8","date":"Tue Jun 07 20:27:18 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"As we #WearOrange for #NationalGunViolenceAwarenessDay we must offer more than thoughts &amp; prayers for the lives lost to #GunViolence.\n\n@HouseDemocrats have passed common-sense gun legislation &amp; are working on more solutions.\n\nI urge #GOP to join us to save lives &amp; #EndGunViolence https://t.co/uQLFaEHty8","date":"Fri Jun 03 21:09:21 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"It was my honor to recognize the historic achievements, and Valley roots, of Dr. Sally Ride at today's @AsmJesseGabriel dedication of a portion of the 101 as the \"Dr. Sally Ride Memorial Highway\". https://t.co/u5yuT54Z1F","date":"Fri Jun 03 18:55:15 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) We've seen 20 mass shootings since the #Uvalde tragedy, including this week in #Tulsa &amp; right here in Van Nuys\n\nWe need action - NOW\n\nWhile #GOP offers excuses for inaction, @HouseDemocrats are working to provide solutions to the scourge of #GunViolence plaguing our country","date":"Fri Jun 03 16:52:16 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The @HouseJudiciary advanced for a vote the #ProtectingOurKidsAct - a bill I co-sponsored to address many of the loopholes that allow guns to fall in the wrong hands. \n\nNext week the House will vote on a series of proposals designed to stem the rising tide of #GunViolence. (1/2)","date":"Fri Jun 03 16:52:15 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to see the @StateDept appoint Ambassador Mike Hammer as Special Envoy to the Horn of Africa. \n\nIt's my hope that he can work effectively for food convoys to #Tigray and for peace in #Ethiopia.","date":"Thu Jun 02 22:05:34 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We pray for the victims and that the shooter is apprehended without further harm. \nhttps://t.co/XiLsINi2ba","date":"Thu Jun 02 01:18:56 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The signing of these priorities into law will now allow us to support the efforts of dedicated leaders like @MayorOfLA as we work hard to enhance the lives of our residents and the future of our communities.\nhttps://t.co/ycHQKdsHAI","date":"Wed Jun 01 23:40:35 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today @MayorOfLA and I commemorated the $3 million in federal funding secured for the revitalization of the Sepulveda Basin - a wonderful park used by people from all over the Valley. I’m proud to have obtained federal funds to improve the Basin in prior years, and again today. https://t.co/Vahvk8XxHZ","date":"Wed Jun 01 23:40:34 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"#PrideMonth is a time to celebrate the LGBTQ+ community and the progress we've made towards equality. We must also use this time to reaffirm our resolve to continue advancing LGBTQ+ rights. \n\nAs a member of the @LGBTEqCaucus, I will continue this fight in the halls of Congress. https://t.co/PNVSlA1XPf","date":"Wed Jun 01 15:53:44 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"This #MemorialDay and every day, we commemorate those who gave their lives for our nation.\n\nThank you to all our service members, veterans, military families and fallen soldiers for their sacrifice. https://t.co/ig9NaDmbI6","date":"Mon May 30 13:08:55 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Was joined by @AsmJesseGabriel and by long time gun safety advocate @ChristySmithCA (2/2)","date":"Sun May 29 02:23:11 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I addressed the @MomsDemand SFV #GunViolence Vigil held today to honor all the lives we have tragically and senselessly lost in the mass shootings plaguing our country. \n\nFor our children, loved ones and communities, we must #EndGunViolenceNow (1/2) https://t.co/A9JAUr89F9","date":"Sun May 29 02:23:10 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I joined @RepCicilline and many of my colleagues in urging House leadership to immediately pass meaningful #GunViolencePrevention legislation.\n\nWe must act NOW before more lives are needlessly lost and more of our communities are tragically shattered by #GunViolence.","date":"Fri May 27 23:24:22 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The Ethiopian Government has cut the people of #Tigray off from access to the outside world for the last 1.5 years - a key tactic to prevent accountability for the atrocities committed against the Tigrayan people.","date":"Thu May 26 01:27:30 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"#NRA imposes gun safety measures for themselves -- but work to deny them for our children, families and communities. \n\nIf, as they say, \"guns don't kill people, people kill people,\" then why ban them at their own event?\nhttps://t.co/640e9RoH5j","date":"Wed May 25 20:37:35 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"As long as we keep creating such policies, tragedies like yesterday's horrendous shooting in #Uvalde will sadly be all too common.","date":"Wed May 25 20:00:15 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I introduced the Emergency #InfantFormula Act to increase supply amid the shortage crisis. Thanks to @RepDonBacon, my Republican co-lead, for joining to introduce this vital bill.\n\n@SenGillibrand is working to introduce companion legislation in the Senate.\nhttps://t.co/pxtC4FjyJJ","date":"Wed May 25 14:47:42 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"10 years since Sandy Hook.\n\n10 days since Buffalo. \n\nWhen is enough truly ENOUGH? \n\nOur families and communities are screaming in anguish for action. How many more tragedies must we endure before the GOP hear their voices over the voices of the NRA and the gun lobby? (1/2)","date":"Wed May 25 02:42:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) As @ChrisMurphyCT said to his fellow senators today: \"What are we doing? Why do you spend all this time running for the Senate…if your answer is that, as the slaughter increases, as our kids run for their lives, we do nothing? What are we doing? Why are you here?\"","date":"Wed May 25 02:42:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"It was good to join @BahrainEmbDC Ambassador H.E. Shaikh Abdullah Bin Rashid Al Khalifa @AbdullaRAK at @AIPAC to discuss the #AbrahamAccords. https://t.co/WIetgFF5ET","date":"Tue May 24 16:25:04 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to deliver words of encouragement and my best wishes to the bright and talented @CSUNNazarian graduating class. #csungrad22 https://t.co/b3XPulw6Ru","date":"Mon May 23 03:47:07 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The \"Pro-life\" party? \nhttps://t.co/OYbXjE3Y7T","date":"Fri May 20 16:52:36 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I commend @POTUS for invoking the Defense Production Act, a move my bill called for as soon as this crisis struck families across our country. We must do all we can to bring this to a swift and immediate end.","date":"Thu May 19 01:21:04 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I had the pleasure of meeting students from @sierracanyon on the Capitol steps. It was great to hear from bright young minds and answer their questions on the issues they're most passionate about. https://t.co/TxiZlTvfeT","date":"Wed May 18 04:25:52 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Most important is that we put real pressure on the governments of Eritrea and #Ethiopia to let more food in -- we need 100 trucks everyday. (2/2)","date":"Tue May 17 23:59:54 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":".@PowerUSAID heads our international aid efforts at @USAID and is famous for her work on genocide. At today's @HouseForeign hearing, I called on her to provide more aid to the people of #Tigray and Tigrayan refugees in Sudan. (1/2)\nhttps://t.co/KWPvEbxc1q","date":"Tue May 17 23:59:53 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Was pleased to meet with Ronda Wilkin, a fellow Valley resident and vocal advocate for the @alzassociation. I will continue to fight for Alzheimer's and Dementia research funding. #ENDALZ https://t.co/FJP1CJvD0X","date":"Tue May 17 22:29:00 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The devastation in #Buffalo is a painful reminder of the tragedy that can ensue when racist, anti-Semitic, nativist conspiracy theories and other vile ideologies are not strongly rebuked in one resounding, unequivocal and united voice.","date":"Tue May 17 18:47:00 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":".@kmitsotakis, Prime Minister of the #HellenicRepublic, gave an excellent speech to our joint session of Congress to commemorate the #GreekBicentennial and the strong relationship between our countries.","date":"Tue May 17 17:39:07 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I joined @CBSLA over the weekend to discuss solutions to the current #BabyFormulaShortage including my bill, the Emergency Infant Formula Act, that focuses on increasing supply. \n\nWatch the interview below: https://t.co/SnNcvngwwn","date":"Tue May 17 01:10:37 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We ended this weekend with yet another shooting, this time right here in California.\n\nAs long as we fail to get serious as a nation and act, everyday moments - a trip to the grocery store or attending church - can end in tragedy.\n\nThis is unacceptable and can't be our new normal.","date":"Mon May 16 13:59:19 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Two mass shootings in just 24 hrs, in Milwaukee and Buffalo. My heart goes out to the victims and their families. \n\nHow many more atrocities must we endure before the Senate, GOP and those who claim they’re “pro-life” finally act and join us to end this scourge of #GunViolence?","date":"Sun May 15 03:12:58 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I will be appearing on @CBSLA later tonight to discuss my bill, the Emergency Infant Formula Act – legislation that focuses on increasing the supply of infant formula in response to the #BabyFormulaShortage.\n\nLearn more about the bill here:\nhttps://t.co/pav7sOIQIM","date":"Sat May 14 23:46:35 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Will be joining @FoxNews Live today at 12:10 PM EST/9:10 AM PS to discuss the state of our economy, our efforts to combat #inflation, the SCOTUS draft opinion on #RoeVWade and more.","date":"Sat May 14 15:29:48 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"In response to the #BabyFormulaShortage that has been impacting families across the country, I am introducing the Emergency Infant Formula Act – legislation that focuses on increasing the supply of infant formula.\n\nLearn more here: https://t.co/pav7sOIQIM","date":"Fri May 13 21:34:47 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"It was a pleasure to meet once again with Jordan’s @KingAbdullahII &amp; discuss new possibilities for the longstanding friendship between the U.S. and the Hashemite Kingdom. https://t.co/rlJO5s9lUO","date":"Thu May 12 15:47:17 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(1/2) Today, I held a hearing in my @FSCDems Subcommittee on Investor Protection that focused on issues of competition and conflicts of interest within the bond rating agency. \n\nSee my opening statement ⬇\nhttps://t.co/zd6CkGQfcW","date":"Thu May 12 02:30:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) A primary concern of this hearing was a proposal by S&amp;P Global Ratings which would discourage insurance companies from purchasing securities not rated by S&amp;P. I’m pleased the S&amp;P withdrew its proposal shortly before this hearing.\n\nSee my questioning:\nhttps://t.co/6Mu6xzjMRD","date":"Thu May 12 02:30:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Outrageous, frustrating, yet not surprising.\n\nWhile Republicans continue their all-out assault on women's fundamental freedoms, we will not relent &amp; let today's vote deter us from our fight to enshrine a woman's right to choose into law &amp; protect Americans' constitutional rights.","date":"Wed May 11 23:29:50 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The House passed my legislation #HR7066 the #Russia and Belarus Financial Sanctions Act -- an important step towards enhancing the effectiveness of the U.S. sanctions imposed in response to #Putin's illegal invasion of #Ukraine.\nhttps://t.co/uXIPIy8IvN","date":"Wed May 11 22:00:04 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"#FederalFirefighters risk their lives for the health &amp; safety of our communities. That's why I was proud to support them by co-sponsoring the #FederalFirefighters Fairness Act &amp; vote to pass it today so we can provide them with the support they deserve for their heroic work. https://t.co/8Z4W9ndsl3","date":"Wed May 11 20:10:11 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"In Congress I've worked to:\n\n✅ End the dominance of big money in politics\n\n✅ Safeguard our elections from \nforeign interference\n\n✅ Protect &amp; expand Americans' right to vote\n\nI’m proud to have received an A on @stopbigmoney scorecard for my efforts to safeguard our democracy. https://t.co/S5QWsokcMl","date":"Tue May 10 23:04:09 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today we celebrate all of the mothers and mother figures across the world. \nYou are truly appreciated. \n\n#HappyMothersDay! https://t.co/8BebFwEWbZ","date":"Sun May 08 21:51:44 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I join her many friends and loved ones in mourning the passing of Dr. Eve Kurtin-Steinberg.\nhttps://t.co/jrIrZuoK3N","date":"Fri May 06 18:35:55 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"This is a step towards accountability, but also a good example of why the IRS should provide a simple and free tax filing service. The Tax Filing Simplification Act, which I'm working to introduce with @SenWarren, calls upon the IRS to do exactly that. \nhttps://t.co/mGPaA4ODYY","date":"Fri May 06 03:05:35 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"From indiscriminate rocket attacks to the use of axes and knives, #Hamas continues to display their evil and their dedication towards killing Israeli civilians, including children.\n\nWe must always stand against and defeat such vessels of terrorism and hatred.","date":"Thu May 05 22:46:34 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today we celebrate 74 years of Israel's inspiring strength &amp; commitment towards democratic values -- &amp; are reminded of the evils they've faced. May today's anniversary &amp; horrendous tragedy reaffirm our need to continue to support our ally &amp; the only democracy in the region. (2/2)","date":"Thu May 05 22:45:05 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I am deeply saddened and outraged over this horrendous terrorist attack, purposely committed on the day the people of Israel celebrate #YomHaatzmaut, their Independence Day.\n\nMy thoughts are with the victims, their families and the State of Israel. (1/2)\nhttps://t.co/bwDEaiNfGT","date":"Thu May 05 22:45:05 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"#CincodeMayo is a day that brings us together to not only remember the Battle of Puebla, but to celebrate the rich heritage and contributions of Mexican and Mexican-American culture. Wishing everyone a joyous #CincodeMayo.\nhttps://t.co/XTv5sNe4vr","date":"Thu May 05 18:22:22 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to meet with the Southland Regional Association of Realtors @SouthlandAOR. We discussed ways Congress can help expand access to affordable housing and make the dream of home ownership a reality for more Americans. https://t.co/taD5zdMQTn","date":"Wed May 04 16:10:23 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I joined those gathered outside of the Supreme Court who are demonstrating the assault on #RoeVWade and spoke on how our fight to protect 50 years of progress is on the line -- and how the fight is far from over.\nhttps://t.co/gLUH6hbDkE","date":"Tue May 03 19:51:56 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"A stark &amp; sobering reminder that the clock is ticking down to the end of legal abortion. I voted to #CodifyRoe in the #WHPA — the Senate must make it law &amp; the fight to uphold abortion rights must continue.\n\nIn the meantime, remember: Abortion is still legal &amp; is still a right.","date":"Tue May 03 03:12:23 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"As #Ramadan comes to a close, I extend my warm wishes to all those celebrating Eid al-Fitr. I hope this joyous occasion brings you peace, togetherness and many blessings. #EidMubarak","date":"Mon May 02 21:43:27 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was invited to co-host a reception for Ethiopian Finance Minister Ahmed Shide and Ethiopian Ambassador Fitsum Arega.\n\nI declined. I will not break bread with a Minister of a government that has used a food blockade to kill thousands of civilians.\nhttps://t.co/eU6YPmfkj2","date":"Fri Apr 29 18:39:59 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Spoke with @SecBlinken about the need to communicate with #Sindh with Sindhi language programming.\n\nhttps://t.co/wX3BaVHpze","date":"Fri Apr 29 04:23:52 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I spoke at today's @HouseForeign hearing with @SecBlinken about the moral and practical reasons for a robust effort to provide #COVID vaccines to poorer countries.\n\nhttps://t.co/ADwZXCm18m","date":"Thu Apr 28 22:20:07 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I asked @SecBlinken about ethnic cleansing by Azerbaijan and the need to pressure the Azeris to release POWs.\n\nhttps://t.co/UbYg6qwm7a","date":"Thu Apr 28 22:19:43 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"While @SecBlinken said atrocities have been committed by all sides in Ethiopia, only Eritreans/Ethiopians are starving millions of innocent people. (2/2)","date":"Thu Apr 28 22:19:01 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I raised #Tigray with @SecBlinken. The government of Ethiopia and Eritrea are starving people. He promised to make public a determination regarding genocide of Tigrayan people. (1/2)\n\nhttps://t.co/4py08G5d21","date":"Thu Apr 28 22:19:01 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased that @SecBlinken responded to my question that the U.S. will not impose political conditions on our defense aid to #Israel. \nhttps://t.co/wSV9HbyuEU","date":"Thu Apr 28 22:18:23 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I spoke with @SecBlinken about the need to provide humanitarian aid to Syrians without going through Bashar al-Assad. \nhttps://t.co/F4OOGpMxtW","date":"Thu Apr 28 22:17:49 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to the Valley residents who joined our Town Hall last night &amp; shared their thoughts on the critical issues we face together. A special thank you to @drlynngoldman for joining us &amp; providing sound guidance on #COVID19.\n\nMore about the event ⬇\nhttps://t.co/ZOsybsQlJK","date":"Thu Apr 28 18:42:51 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now! Dial (855) 920-0548","date":"Thu Apr 28 02:00:19 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting in 1 hour: Our Telephone Town Hall will be starting soon at 7 PM where we will discuss all the critical issues facing Congress.\n\nWe will be joined by Dr. Lynn Goldman, epidemiologist and pediatrician, who will provide updates on #COVID19. https://t.co/r3h8EyKNJN","date":"Thu Apr 28 01:02:43 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"On #YomHaShoah #HolocaustRemembranceDay we remember the 6 million Jews who perished &amp; honor the survivors who've shared their stories so such atrocities are not repeated. We must continue to fight bigotry &amp; hatred in all its forms to ensure \"Never Again\" aren't just mere words. https://t.co/ypUD9poVrY","date":"Wed Apr 27 21:55:15 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us *Tonight* for our Telephone Town Hall at 7 PM.\n\nWe'll provide updates and hear your thoughts on the many critical issues we face together: inflation, our economy, the war in #Ukraine️ and more.\n\nThere's still time to RSVP/Submit a Question at:\nhttps://t.co/GTFpvGufVl","date":"Wed Apr 27 20:08:19 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join our Telephone Town Hall tomorrow Wednesday, April 27 at 7 PM where we'll discuss the critical issues facing Congress.\n\nWe'll be joined by Dr. Lynn Goldman, epidemiologist &amp; pediatrician, who'll provide updates on #COVID19.\n\nRSVP/Submit a Question ⬇\nhttps://t.co/GTFpvGLQMT","date":"Tue Apr 26 21:35:18 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"America stands up for Muslims oppressed by #China. \nUnfortunately, #Saudi and others sell them out. \nhttps://t.co/eUFwATxUTH","date":"Mon Apr 25 19:58:37 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Congratulations!\nhttps://t.co/SMfl8mT9ix","date":"Mon Apr 25 18:46:01 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join our Telephone Town Hall this Wednesday, April 27 at 7 PM where we'll discuss all the critical issues facing Congress.\n\nWe'll be joined by Dr. Lynn Goldman, epidemiologist and pediatrician, who'll provide updates on #COVID19.\n\nRSVP/Submit a Question ⬇\nhttps://t.co/1a5vCudb3Z","date":"Mon Apr 25 05:16:19 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to be able to join the services at St. Joseph the Worker Catholic Church in Winnetka this morning where I spoke on the work of my constituent services program. https://t.co/23vM7TJzLm","date":"Mon Apr 25 00:28:11 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today I stand with the Armenian American community to commemorate #ArmenianGenocideRemembranceDay -- a solemn anniversary where we come together to remember &amp; honor the memories of 1.5 million Armenians whose lives were systematically &amp; tragically stolen. \n\n#ArmenianGenocide107","date":"Sun Apr 24 22:14:40 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to have recently joined a prayer service for #Ramadan at the Islamic Center of Northridge. I spoke on my work in Congress, including my co-sponsorship of a House Resolution recognizing the start of #Ramadan. (1/2) https://t.co/3yOPWPTbGt","date":"Sun Apr 24 06:23:18 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Mahomed Khan @itsmk786, a leader in the community, offered a fitting prayer for all those gathered. And I was pleased to receive an award from the Rohingya community. (2/2)","date":"Sun Apr 24 06:23:18 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today I joined the Citizens' Climate Lobby-San Fernando Valley Chapter's @CCLSFV #EarthDay Climate Summit where I spoke on the responsibility we have to protect our planet and on my work in Congress to mitigate the #ClimateCrisis and preserve our planet for future generations. https://t.co/r8q3rXtd9G","date":"Sun Apr 24 04:50:31 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"So many partners deserve credit, including: @CityAgouraHills @Annenberg_FDN @nwf @mrcaparks @wadecrowfoot @SamoFund @CaltransDist7 @SenatorPavley @HenrySternCA @SenAlexPadilla @laurafriedman43 @RichardBloom @LindaParks2022 @RepAdamSchiff @RepTedLieu @RepBrownley (3/3)","date":"Fri Apr 22 22:31:29 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"When completed, the crossing will link critical habitat in the @SantaMonicaMtns and preserve species diversity. (2/3) https://t.co/alf9MrvejH","date":"Fri Apr 22 22:31:28 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Excited to join @gavinnewsom @SenAlexPadilla @RepTedLieu @RepAdamSchiff @RepBrownley and many other community leaders on #EarthDay and speak at the groundbreaking ceremony of the Wallis Annenberg Wildlife Crossing, for which I've been advocating for over two decades. (1/3) https://t.co/Kyas2KFivu","date":"Fri Apr 22 22:30:27 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"In One Week - Wednesday, April 27th:\n\nWe'll be hosting a Telephone Town Hall starting at 7 PM to provide updates on many critical issues such as our efforts to combat inflation, grow our economy, assist #Ukraine️ and more.\n\nRSVP or Submit a Question ⬇\nhttps://t.co/GTFpvGufVl","date":"Thu Apr 21 02:12:49 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We're hosting a Telephone Town Hall on Wednesday April 27 at 7 PM.\n\nWe'll provide updates on the critical issues facing Congress -- combatting inflation, the state of our economy, the war in #Ukraine️, latest on #COVID19 &amp; more.\n\nRSVP/Submit a Question ⬇\nhttps://t.co/GTFpvGufVl","date":"Mon Apr 18 22:18:29 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"#Easter is a time to come together and celebrate new beginnings. Happy Easter to all who observe! https://t.co/Qv6gsv6wlZ","date":"Sun Apr 17 15:38:54 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish a #HappyPassover to all who celebrate. As we begin to gather around the Seder table this evening with family and loved ones, let us celebrate this #Passover with the spirit of freedom that has sustained our people during even the darkest of times. Chag Sameach https://t.co/XEUp3bGMvV","date":"Fri Apr 15 22:31:10 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today, we extend warm #Vaisakhi greetings to all our Sikh friends and neighbors who are celebrating. Proud to have co-sponsored a Resolution that designates Vaisakhi, one of the most significant days of the year for the world's fifth-largest religion, as \"National Sikh Day\".","date":"Thu Apr 14 21:34:42 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to the +4,000 Valley residents who joined our Town Hall last night. I want to especially thank Ukrainian Ambassador @OMarkarova for taking the time to join our event, the only Town Hall the Ambassador has joined to discuss the war in #Ukraine.\nhttps://t.co/f8IZh0y1Mj","date":"Thu Apr 07 21:59:29 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"A historic day for our nation as Judge Ketanji Brown Jackson becomes the first Black woman confirmed to the Supreme Court. Judge Jackson is not only a historic choice, but an eminently qualified choice who will serve faithfully and honorably on our nation's highest court.","date":"Thu Apr 07 20:26:53 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now! Dial (855) 920-0548","date":"Thu Apr 07 02:00:12 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting soon at 7 PM!\n\nTo Join, Dial (855) 920-0548","date":"Thu Apr 07 01:15:37 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us *Tonight* for our Telephone Town Hall starting at 7 PM where we'll discuss all the critical issues facing Congress.\n\n\nWe will be joined by Ukrainian Ambassador Oksana Markarova, who will discuss the war in #Ukraine.\n\n\nDial (855) 920-0548 starting at 7 PM to join. https://t.co/C96sDRqAsn","date":"Wed Apr 06 22:49:10 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today I spoke with Treasury Secretary @SecYellen on the importance of the U.S. government doing more to identify and prevent #Russia and its oligarchs from evading sanctions through the private securities market and cryptocurrency. See the exchange below:\nhttps://t.co/9IW2N4ZNqn","date":"Wed Apr 06 18:35:59 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"This legislation represents a significant step towards answering the Ukrainian government’s repeated calls for cryptocurrency exchanges to stop providing services for Russia-based cryptocurrency wallets. (2/2)","date":"Wed Apr 06 17:26:26 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today I introduced the Russian Digital Asset Sanctions Compliance Act of 2022, the House companion to legislation recently introduced by @SenWarren. (1/2)\nhttps://t.co/maBDK2xkEQ","date":"Wed Apr 06 17:26:26 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Tomorrow, April 6th: We’ll be hosting a Telephone Town Hall starting at \n7 PM to discuss all the critical issues facing Congress.\n\nWe'll be joined by Ambassador Oksana Markarova @OMarkarova who will discuss the war in #Ukraine.\n\nRSVP/Submit a Question ⬇ \nhttps://t.co/GTFpvGufVl","date":"Wed Apr 06 03:26:15 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Failure to include funds for Intl. vaccination efforts isn’t just cruel &amp; outrageous, it’s stupid. Every time anyone in the world gets #Covid, the disease replicates &amp; can mutate. A new variant could kill thousands of Americans &amp; cost us Trillions. (1/2)\nhttps://t.co/xjdxdXTKqs","date":"Mon Apr 04 23:43:12 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Yet most Republican Senators won’t spend $5 billion for international vaccinations. They think they are fiscally responsible, mostly because their brains can’t comprehend the difference between Billions (for vaccination) and Trillions (economic cost of another shut down). (2/2)","date":"Mon Apr 04 23:43:12 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Saddened by the news out of #Sacramento, the latest community to be devastated by #GunViolence. The House has already passed commonsense action to help end the carnage that we sadly endure too often. We cannot allow ourselves to be desensitized to this. \n\nWe must #EndGunViolence.","date":"Mon Apr 04 13:35:03 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"#RamadanKareem to all who will begin to celebrate the start of the Holy Month of #Ramadan today at sundown. Pleased to have cosponsored a Resolution that recognizes the start of Ramadan -- a cherished time to remember the common values of empathy &amp; harmony that we all hold dear. https://t.co/hVwtp72reh","date":"Sat Apr 02 00:42:01 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The State Department also commented: “The United States has no position on and does not comment on Pakistan’s internal process. We respect and support Pakistan’s constitutional process and rule of law.” (2/2)","date":"Fri Apr 01 23:33:21 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Dr. Asif Mahmood @DrMahmood40 brought the tweet below to my attention and I found it concerning. Today the State Department Bureau of South and Central Asian Affairs assured me in writing \"There is no truth to these allegations.\" (1/2)","date":"Fri Apr 01 23:33:20 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"In One Week: We'll be hosting a Telephone Town Hall on Wednesday April 6 to discuss all the critical issues facing Congress.\n\nWe'll be joined by Ambassador Oksana Markarova @OMarkarova who will discuss the war in #Ukraine\n\nRSVP/Submit a Question, visit  ⬇\nhttps://t.co/HAvbQ5zSJl","date":"Thu Mar 31 02:07:38 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"In the last week, 3 separate terror attacks in #Israel have claimed at least 11 innocent lives – Jewish and Arab alike. These vile actions are the consequence of relentless demonization of Israelis and the world's only Jewish state. My thoughts are with the victims' families.","date":"Wed Mar 30 13:46:57 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The Ethiopian govt's statement is an admission that they have the ability to allow humanitarian aid into Tigray, which has been blocked while up to several hundred thousand Tigrayans starved to death. With millions more at risk, PM Abiy must allow aid into Tigray immediately. 2/2 https://t.co/0dG9TkQCY2","date":"Wed Mar 30 00:04:17 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"PM Abiy's unilateral ceasefire is a promising and welcome development - but it is only legitimate if it leads to immediate and unrestricted humanitarian aid into Tigray, where nearly 2.5 million are either facing famine or on the brink of it. 1/2 https://t.co/1VqweSDsF7","date":"Wed Mar 30 00:04:10 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/kLFDZ1NlGT","date":"Mon Mar 28 20:41:30 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Great choice. I worked with Jolene Koester when she was President of @csunorthridge and she will serve Valley, and all California, students well.","date":"Sat Mar 26 01:05:33 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to @RepEdCase for his leadership on these issues. (2/2)","date":"Thu Mar 24 14:29:51 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"As a Co-Chair of the Pacific Islands Caucus I applaud @POTUS nominating Amb Joseph Yun as Special Envoy for Negotiations for the Compact of Free Association. Amb Yun has been a leader on many issues concerning the Pacific Islands &amp; is the right choice (1/2)https://t.co/x60Cri5Dtk","date":"Thu Mar 24 14:29:51 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/LjEBCjoada","date":"Thu Mar 24 01:55:52 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The House of Representatives has long stated atrocities against the #Rohingya constitute “crimes against humanity and genocide.” This recognition is important to addressing the human rights atrocities and holding those responsible accountable.","date":"Wed Mar 23 22:47:14 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The U.S. finally declared the disaster facing the #Rohingya a genocide. As former Chair of @HouseForeign Subcommittee on Asia, &amp; as a sponsor of numerous bills supporting repatriation &amp; protection of the Rohingya, I commend this determination by @StateDept https://t.co/za7ReNTHQ5","date":"Wed Mar 23 22:47:14 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/Lk0Pbhb6or","date":"Wed Mar 23 13:05:33 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"When the Sunday concerts resume this June, the @ladailynews will report that 5,000 people gathered to hear the band in Warner Center Park. But in fact there will be 5,001. \nhttps://t.co/HEGYAqbZXW","date":"Mon Mar 21 15:03:21 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was honored to speak yesterday at the @ValleyCulturalF “Celebration of Life” honoring Nora Ross — a kind and passionate arts leader who was the driving force behind the many years of vibrant festivals and cultural events that left a lasting imprint on the Valley. (1/2) https://t.co/TZ8phRMWcI","date":"Mon Mar 21 15:03:20 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/2eSJtmRpeP","date":"Sun Mar 20 18:14:32 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing a Happy #Nowruz to Iranians and Iranian Americans in the San Fernando Valley, across our nation and around the world. May this new year be filled with warmth, peace and compassion for all.","date":"Sun Mar 20 17:13:01 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Saddened by the passing of my colleague, “Dean of the House” Congressman Don Young.\n\nHis absence will be felt in the halls of Congress, but his legacy as a serious legislator and dedicated public servant will live on.\n\nMy condolences to his family, friends, and all Alaskans.","date":"Sat Mar 19 19:04:20 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish a vibrant and happy #Holi to all those who celebrate! \n\nMay this Holi festival bring immense joy and enthusiasm to all. https://t.co/9O94fKussU","date":"Fri Mar 18 16:29:40 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/PsIX3ZUHUC","date":"Fri Mar 18 14:09:15 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing a Happy #Purim to all who celebrate! May the spirit of Purim bring us light in times of darkness. Chag Purim Sameach! https://t.co/WhdjHV60zJ","date":"Thu Mar 17 21:05:10 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Slovakia has committed to giving #Ukraine S-300s if NATO can provide replacements. We must act fast and make sure Ukraine gets these defense systems, which @ZelenskyyUa specifically asked Congress for yesterday. #StandWithUkraine️ \nhttps://t.co/IJBvyuVhsn","date":"Thu Mar 17 19:32:35 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We should then backfill those countries with other defense systems. (2/2)","date":"Wed Mar 16 22:00:18 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today @ZelenskyyUa specifically asked Congress for S-300 surface-to-air anti-aircraft missiles -- the only system he asked for by name. The U.S. should acquire these systems from Bulgaria, Slovakia &amp; Greece then transfer them to #Ukraine. (1/2)","date":"Wed Mar 16 22:00:18 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I want to thank the over 5,000 Valley residents who joined our Telephone Town Hall last night! \n\nIt was an informative and productive discussion on the critical issues facing our country. \n\nLearn more about last night's event ⬇\nhttps://t.co/BUUpouG1Qq","date":"Wed Mar 16 16:55:49 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/2QY6m2h04I","date":"Wed Mar 16 13:15:22 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now! Dial (855) 920-0548 to join!","date":"Wed Mar 16 02:01:17 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting in 1 hour! \n\nDial (855) 920-0548 starting at 7:00 PM to join!","date":"Wed Mar 16 01:00:36 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"While all eyes are focused on the humanitarian atrocities being committed by Putin, we must also remember the people of #Tigray, where far more civilians have already died. \n\nI had another chance to discuss Tigray yesterday with Lidiya Gessese and Dr. Asif Mahmood @DrMahmood40. https://t.co/5ZFRy1ivyb","date":"Tue Mar 15 22:12:18 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us *Tonight* for our Telephone Town Hall starting at 7:00 PM where we’ll discuss the critical issues we face — from our economy, to the invasion of #Ukraine &amp; more. \n\nWe'll be joined by Dr. Lynn Goldman, epidemiologist &amp; pediatrician, who will provide updates on #COVID19 https://t.co/2MGaccwz4R","date":"Tue Mar 15 21:11:49 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Honored to congratulate and to welcome Dr. Erika Beck as incoming President of @csunorthridge \n \nLooking forward to working together to serve our Matador community which is critical to the success of the San Fernando Valley.","date":"Mon Mar 14 22:32:15 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us *Tomorrow* for our Telephone Town Hall where we’ll discuss the critical issues we face — from our economy, to the invasion of #Ukraine &amp; more. \n\nGuest: Epidemiologist Dr. Lynn Goldman who’ll discuss #COVID19 \n\nTo RSVP or Submit a Question, visit ⬇\nhttps://t.co/GTFpvGufVl","date":"Mon Mar 14 16:40:12 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"\"How do we get [fighter jets] to Ukraine without it raising the involvement of NATO? What Ukraine needs is the stingers and javelins...\"\n\nICYMI: Yesterday I joined @FoxNews Live to discuss the latest developments on the #UkraineWar ⬇\nhttps://t.co/C0jPYS5Ys3","date":"Sun Mar 13 18:33:47 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I will be joining @FoxNews Live at 9:35 AM PT/12:35 PM EST to discuss the latest developments on the invasion of #Ukraine️.","date":"Sat Mar 12 16:54:14 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Will he then say there should be no State for the Ukrainian people?\n\nOr that the border btw the Netherlands &amp; Germany is racist because there’s no reason to have a State for the Dutch people?\n\nOr is he just an anti-Semite who believes that only Jews can’t have a homeland? (2/3)","date":"Sat Mar 12 01:21:38 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"As someone who worked hard in my local AI chapter in the 80s, &amp; has worked for many of the objectives of @amnesty for 25 years on the Foreign Affairs Committee, it saddens me to see the reputation of this once noble organization degraded by its USA director. Fire him. (3/3)","date":"Sat Mar 12 01:21:38 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Outrageous! (1/3)\nhttps://t.co/9nVQAeHMJm","date":"Sat Mar 12 01:21:37 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Many people would like to help with the humanitarian crisis caused by Russia's invasion of #Ukraine. Our main foreign assistance agency, USAID, has some helpful information:\nhttps://t.co/VC7rxJUHwB","date":"Thu Mar 10 19:29:30 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The House passed Federal funding, that I requested, for 10 Valley projects. These funds will address needs across the Valley, including improvements to our parks, funds for at-risk youth, resources to address homelessness and our recovery from #COVID19.\nhttps://t.co/Y0sb76ZKMi","date":"Thu Mar 10 15:48:35 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased that the House included my Adjustable Interest Rate #LIBOR Act in the government funding package that will pass the House tonight. \n\nWe are now set to solve a $16 trillion problem before the average American knew there was a problem.\nhttps://t.co/1tfcBUuZ5M","date":"Thu Mar 10 02:06:38 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today I met with San Fernando Valley resident @BillNye along with Robert Picardo and Brendan Curry of the Planetary Society @exploreplanets where we discussed our nation's space program and space exploration. https://t.co/LCAynGeE1r","date":"Wed Mar 09 23:39:10 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us next week for our Telephone Town Hall on March 15th where we’ll discuss the critical issues we face — from our economy, to the invasion of #Ukraine &amp; more. \n\nGuest: Epidemiologist Dr. Lynn Goldman, who’ll discuss #COVID19 \n\nRSVP/Submit a Question: https://t.co/GTFpvGufVl https://t.co/y783nI39CK","date":"Wed Mar 09 05:02:55 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We need fair treatment of Federal firefighters who get cancer, a right for public safety workers to organize, and funding to fight wildfires. (2/2)","date":"Tue Mar 08 22:56:04 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Was pleased to meet with General President Edward Kelly @IAFFPresident and General Secretary Treasurer Frank Lima @IAFFGSTLima of IAFF @IAFFNewsDesk earlier this morning. (1/2) https://t.co/9JyI9oYki0","date":"Tue Mar 08 22:56:03 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"See my remarks during today's @FSCDems hearing where I discussed inflation and U.S. oil production.\nhttps://t.co/RGemP4oma8","date":"Tue Mar 08 18:03:20 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We must continue to embrace alternative energy and fuel efficiency standards, which have improved automotive efficiency by nearly 100%, and put America in a far stronger position to live without Russian oil. (2/2)","date":"Tue Mar 08 16:16:19 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Last night, I joined my colleagues in introducing the Ban Russian Energy Imports Act to halt energy imports from Russia. We must #StandWithUkraine by cutting off Putin’s cash flow that enables this unprovoked invasion. (1/2)","date":"Tue Mar 08 16:16:19 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to hear that @Mastercard &amp; @Visa will be suspending all their operations in #Russia effective immediately.","date":"Sat Mar 05 23:42:51 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/uBmizVwF5j","date":"Sat Mar 05 23:42:51 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"President Zelensky pointed out that #Ukraine had missiles, and could have rocketed Russian and Belarusian territory in response to missiles fired at Ukraine from those countries. Zelensky wisely and humanely chose not to. (3/4)","date":"Sat Mar 05 16:24:00 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Zelensky asked us to turn off MasterCard and Visa for Russia. I agree. The Financial Services committee needs to look at this next week. (4/4)","date":"Sat Mar 05 16:24:00 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"A group of us met by zoom with @ZelenskyyUa. His main ask was for the U.S. to allow Poland and Romania to transfer Soviet era jets to #Ukraine, and for the U.S. to compensate by giving more advanced planes to those two NATO allies. (1/4)","date":"Sat Mar 05 16:23:59 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"This is much safer than a “no fly zone” as it doesn’t involve Americans killing Russians. (2/4)","date":"Sat Mar 05 16:23:59 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Honored to join a call this morning w/President Zelensky @ZelenskyyUa who is an incredible example of bravery in the face of authoritarianism. We must continue to #StandWithUkraine️ by providing the military equipment &amp; Russia sanctions #Ukraine needs to combat Putin’s attack.","date":"Sat Mar 05 15:47:17 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Saddened to learn of the terrorist bombing of Kucha Risaldar mosque that occurred in #Pakistan earlier today, killing at least 57 minority Shiite Muslim worshippers. My thoughts are with the victims and the the people of Pakistan.\n\nhttps://t.co/kN1cOr40Nk","date":"Fri Mar 04 22:40:38 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"After the recent announcement that @FAANews Administrator Stephen Dickson will be resigning, I urged the Biden administration to nominate a new FAA administrator who will prioritize addressing the issue of aviation noise that has plagued our communities. https://t.co/Euq8InlpHC","date":"Fri Mar 04 21:56:00 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"No need to worry, America has many rocket engine manufacturers that are capable of manufacturing for space exploration, one of which is @AerojetRdyne which manufactures rocket engines in the San Fernando Valley.","date":"Fri Mar 04 00:26:46 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to meet with members of the Boys &amp; Girls Club of the West Valley @wvbgc in support of the of the Boys &amp; Girls Club which provides a safe, affordable, and fun place for 4.3 million kids and teens across the country during crucial out-of-school time and the summer. https://t.co/AtQb3WfCDw","date":"Thu Mar 03 22:07:29 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to have earned a 100% score on the @LCVoters 2021 #LCVScorecard.\n\nAs long as we continue to face the threat of #ClimateChange, I'll continue my efforts to preserve our environment and push for bold #ClimateActionNow to fight the climate crisis and help protect our planet. https://t.co/ZnuWQOHb0G","date":"Thu Mar 03 20:36:20 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We've seen #Russia hit civilian targets: orphanages, hospitals &amp; even Babi Yar. I've urged AG Garland to assist intl. authorities compile evidence &amp;, if appropriate, bring U.S. charges against those responsible for atrocities in #Ukraine, including high-ranking Russian officials. https://t.co/zxk75wn5yu","date":"Thu Mar 03 17:59:37 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Since 1973 every President claimed the #WarPowers Act wasn't constitutional/compliance was voluntary. \n\nToday I pressed this admin on if it will follow this troubling pattern or abide by the constitution &amp; respect the #WarPowers Act as binding law.\n\nWatch⬇️https://t.co/SAu2FstYFd","date":"Wed Mar 02 19:02:49 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The @POTUS also laid out a clear path forward for the work that lies ahead and to build on the progress we've achieved in order to continue delivering for working families across the country. (2/2)","date":"Wed Mar 02 05:01:32 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Tonight @POTUS delivered a powerful #SOTU message of progress. We've made great strides against the pandemic, set new records for jobs created, small businesses started and unemployment saw the biggest single year drop in U.S. history. (1/2)","date":"Wed Mar 02 05:01:31 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I look forward to hearing from @POTUS tonight on the progress we've made, and the work that needs to be done in order to advance our fight for an economy that grows from the bottom up and the middle out. #SOTU","date":"Wed Mar 02 01:17:09 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Honored to join my House Colleagues to #StandWithUkraine https://t.co/ixMUwAHDIj","date":"Tue Mar 01 23:06:02 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I have long advocated for prohibitions on Americans investing in Russian sovereign debt. Here's another clear reason why buying Russian government bonds is a bad idea. Russia has intentionally defaulted. Who will lend to Russia in the future? \nhttps://t.co/kgYCKQFUe3","date":"Tue Mar 01 22:54:09 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"This is what Putin's 'denazification' looks like - attacking civilians, attempting to overthrow a democratically elected president and, now, bombing the Babi Yar Holocaust Memorial, the site of one of the largest mass murders of the Holocaust.","date":"Tue Mar 01 20:35:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) The President cannot introduce American forces into hostilities for more than sixty days (in some cases, likely not applicable here, 90 days) without a \"authorization to use military force.\"","date":"Tue Mar 01 17:15:58 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(1/2) I do not think the Biden Administration is considering a no-fly zone, and for good reasons. Also, under the War Powers Act, @POTUS Biden should not impose a no-fly zone (for long) over #Ukraine without congressional approval. https://t.co/172cucYICB","date":"Tue Mar 01 17:15:57 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Saudi benefits from #Ukraine invasion. Sells its oil for a premium. Pockets the premium rather than give it to Ukraine humanitarian efforts. And by refusing to pump more, empowers Putin.\nhttps://t.co/e4AMvue4BZ","date":"Tue Mar 01 16:46:51 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"For many years I’ve been a member of the #Ukraine Caucus. We have had many meetings with Ukraine officials. Today we met with Ambassador of Ukraine to the U.S. Oksana Markarova @OMarkarova. Last September, we met with President Zelenskyy @ZelenskyyUa https://t.co/1Oot7JFXiR","date":"Tue Mar 01 03:08:22 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"A “no-fly zone” means the U.S. Air Force shooting down Russian planes. American attacks on the Russian military — on the ground, in the air, or arguably in cyber space — puts us on a dangerous path.","date":"Tue Mar 01 03:07:22 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I stand in solidarity with the Armenian American community in commemorating the February 1988 Sumgait Pogroms. On today’s solemn anniversary, we reaffirm our resolve to oppose anti-Armenian hatred and work to ensure such history will not be repeated.\nhttps://t.co/eKE9AGGGJA","date":"Mon Feb 28 00:27:52 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"After his first year in office, oil production is now higher under Biden than when Trump left office.\n\n“U.S. crude oil production forecast to rise in 2022 and 2023 to record-high levels” per the U.S. Energy Information Administration. (5/5)\nhttps://t.co/P8cF9rpZda","date":"Sun Feb 27 23:20:14 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Thanks to Democrats, we produce less of our electricity from oil than at any time in fifty years. Think of how much Putin could get per barrel if we hadn’t changed. (3/5)\n\nhttps://t.co/YdiuwOL3ix","date":"Sun Feb 27 23:20:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Thanks to #Democrats, America is using far less oil compared to our economic production than in decades past. If we were still riding in cars getting 10 mpg, Putin would be behind the wheel. (2/5)","date":"Sun Feb 27 23:20:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"And in fact our electricity production is far less dependent on all fossil fuels. Again, thank Democrats. Energy independence starts with efficiency, conservation and alternative energy. (4/5)","date":"Sun Feb 27 23:20:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"[Thread] #Republicans are using the #Ukraine crisis to divide Americans about policies that might produce more oil in five years. Pressuring Russia requires more production in five weeks. Only Saudi can do that. (1/5) @chiproytx @michaelgwaltz","date":"Sun Feb 27 23:20:12 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Next step is to do the rest of the Russian banks.\n\nExclusion from #SWIFT means key banks cannot communicate securely with banks beyond its borders.\nhttps://t.co/UN7Ht0GZuo","date":"Sun Feb 27 02:34:02 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"“Putin may rue the day when he made this mistake.” As Russian forces bear down on #Kyiv, I joined @yasminv on @MSNBC to discuss the latest on the Russian invasion of #Ukraine.\n\nWatch the full interview ⬇️ \nhttps://t.co/TtKrFXdvaT","date":"Sat Feb 26 16:59:34 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The Soviet Union suffered about 100 per month killed in action in Afghanistan for about a decade. They were forced to withdraw, and a couple of years later there was regime change in Moscow. (1/2)\n\nhttps://t.co/VhO0ZU3Pgz","date":"Sat Feb 26 05:52:46 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"What casualties will the Ukrainian people inflict on the invaders, and for how long? And will the Russian people replace a leader who led them into a costly war of choice? (2/2)","date":"Sat Feb 26 05:52:46 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I commend @POTUS nomination of Judge Ketanji Brown Jackson to the Supreme Court -- a widely respected jurist who will bring an unyielding commitment to justice and a strong voice for American values. I look forward to Judge Jackson receiving a fair and timely hearing.","date":"Fri Feb 25 22:48:30 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Saudi Arabia - now is your chance to be an ally or an enemy of those standing against Russia's attack on #Ukraine. Saudi Arabia must open taps and produce more oil so the world can turn its back on Russian oil. Otherwise, the blood of Ukrainians is also on Saudi Arabia's hands.","date":"Fri Feb 25 21:38:22 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to join @VICASFValley's Congressional breakfast forum where I discussed the crisis in Ukraine, as well as my work in Congress to support Valley businesses and our community's economic vitality.","date":"Fri Feb 25 18:43:56 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We need to deliver anti-tank and mobile anti-aircraft missiles to #Ukraine in hours. Can deliver in Poland – no American needs to leave NATO territory.","date":"Fri Feb 25 04:16:06 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Our sanctions are designed so U.S. and Europe can still buy Russian oil and gas and pay for it using the SWIFT banking system. With Iran, we used secondary sanctions to force other countries to stop buying Iranian oil. #Ukraine","date":"Fri Feb 25 04:06:15 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"It appears we are still going to allow foreign subsidiaries of U.S. corporations to loan money to the Russian government. Seeking clarification from the administration. #Ukraine","date":"Fri Feb 25 04:04:32 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I have distributed the video message of the Ukrainian Minister of Defense, addressed to Members of Congress, to all my Congressional colleagues.","date":"Fri Feb 25 02:34:15 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"While I applaud @POTUS announcement of extensive sanctions on Russia, Putin's unprovoked attack on #Ukraine must be met with the strongest possible response – that includes directly sanctioning Putin and all of his oligarchs listed in the #Navalny35, removing Russia from SWIFT.","date":"Thu Feb 24 21:46:02 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Message of Ukraine Defense Minister to the U.S. Congress. Asks that we deliver stinger and anti-tank missiles to Ukrainians in Poland.\nhttps://t.co/mOC96W5kMJ","date":"Thu Feb 24 18:08:05 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We should immediately provide additional air defense to #Ukraine now. Provide FIM 92 anti-aircraft missles to Ukrainian officials at the Poland border and leave it to them to carry to Ukraine. These are portable systems that can be carried by one person. @SecDef","date":"Thu Feb 24 05:30:42 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I have long been an advocate of sanctioning Russian sovereign debt; with Russian borrowing at a 15 year high, these sanctions will impose significant economic pressure directly on the Russian govt and protect American investors from indirectly financing Putin's agenda. (2/3)","date":"Wed Feb 23 19:02:48 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The President's sanctions package is a significant, but very measured step. We have many options left in our sanctions arsenal should #Russia continue to move against #Ukraine. The next step is to apply these sanctions to foreign subsidiaries of U.S. corporations. (3/3)","date":"Wed Feb 23 19:02:48 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I applaud @POTUS for including enhanced Russian sovereign debt as part of a significant sanctions package announced yesterday to combat Russian aggression against Ukraine. (1/3)","date":"Wed Feb 23 19:02:47 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"If the Europeans don’t want restrictions on buying Russian oil and gas and want Russia to stay in the SWIFT international banking system, sanctions won't do much to deter Putin.","date":"Sat Feb 19 23:24:10 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Great to join the North Valley Chamber @nvrcc to show support for our terrific Valley small businesses. https://t.co/PH8B2SI3zK","date":"Fri Feb 18 22:44:52 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to have talked to @USAID Administrator Samantha Power @PowerUSAID on Thursday about the need for economic development projects in #Sindh.","date":"Fri Feb 18 18:25:36 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(1/2) At yesterday’s @HouseForeign hearing on Burma, I spoke about how there can be no true democracy in Burma without the full inclusion of the #Rohingya. \n\nWatch⬇️\nhttps://t.co/N93AO7IU57","date":"Fri Feb 18 15:12:39 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) True Democracy advocates must plainly state that all #Rohingya born in Burma/Myanmar must be repatriated and given citizenship documents.","date":"Fri Feb 18 15:12:39 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Talked to @USAID Administrator Samantha Power @PowerUSAID about the food blockade of #Tigray. Clearly the Ethiopian and Eritrean government are using starvation as a weapon. I urge that we act to #EndTigraySiege.","date":"Fri Feb 18 03:15:18 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We should remember: Sanctions against Russia will impose costs on Americans too.","date":"Tue Feb 15 19:13:34 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"If Russia in effect forces #Ukraine to enter into a treaty forswearing ever joining NATO, we should impose some sanctions. (3/3)","date":"Mon Feb 14 16:08:00 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"However, the Russian invasion could be a disaster for #Ukraine and Europe. Ultimately this is a decision to be reached by Ukraine, and America should not pressure Zelensky. (2/3)","date":"Mon Feb 14 16:08:00 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"#Ukraine may need to choose between entering into a treaty with Russia forswearing ever joining NATO, or face invasion. Such a treaty commitment impairs Ukraine’s options in the decades to come and sets a bad international precedent. (1/3)","date":"Mon Feb 14 16:08:00 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"A great day for the #Rams. For Los Angeles. And especially for the San Fernando Valley. #SuperBowl","date":"Mon Feb 14 03:05:10 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/KjwU8feUrA","date":"Mon Feb 14 02:35:56 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to join @RepMalinowski in passing H.R. 6600. Ethiopia and Eritrea are blocking food aid deliveries to Tigray and using starvation of civilians as a weapon of war.\nhttps://t.co/4gEYArg5Gz","date":"Wed Feb 09 20:47:30 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The mass detention of Tigrayan civilians in unlivable conditions is a human rights violation so outrageous that it demands a forceful U.S. response. I'm pleased that H.R. 6600 passed @HouseForeign with my amendment to respond to this atrocity. Watch ⬇\nhttps://t.co/CsJt4YOwSV","date":"Wed Feb 09 20:47:30 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) Learn more about our event last night here: \nhttps://t.co/5g10XVlO0L","date":"Tue Feb 08 15:27:30 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to the nearly 7,000 Valley residents that joined our Telephone Town Hall last night! It was a great opportunity to update you on my work in Congress &amp; hear your thoughts on the critical issues we face. \n\nSpecial thanks to guests Dr. Lynn Goldman &amp; @AsmJesseGabriel (1/2) https://t.co/3fcnn02PHX","date":"Tue Feb 08 15:27:29 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now! Dial in at (855) 920-0548","date":"Tue Feb 08 03:00:39 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Soon!\n\nOur Telephone Town Hall will be starting soon at 7:00 PM where we’ll discuss all the critical issues we face together. \n\n📱Dial in at (855) 920-0548 starting at 7:00 PM tonight to join! https://t.co/HprcspIcOV","date":"Tue Feb 08 02:30:38 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Fine print hidden in a lengthy contract shouldn’t be what stops a sexual abuse survivor from telling their story.\n \nToday, I voted to pass the #EndForcedArbitration Act, a historic pro-labor piece of legislation. https://t.co/nc2AhERcPF","date":"Tue Feb 08 01:21:33 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today I cosponsored &amp; submitted an amendment to expand my friend @Malinowski ’s HR 6600 which holds Ethiopia accountable for abuses in #Tigray. My amdt. conditions sanctions relief on the Ethiopian govt allowing aid into Tigray &amp; ending ethnically-based detentions of Tigrayans.","date":"Mon Feb 07 23:13:50 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us for our Telephone Town Hall *Tonight* starting at 7 PM where we'll discuss all the critical issues facing Congress.\n\nWe'll be joined by Dr. Lynn Goldman, epidemiologist &amp; pediatrician, who'll answer questions on #COVID19\n\nRSVP/Submit a Question at: https://t.co/GTFpvGufVl https://t.co/bJMP1UmMDl","date":"Mon Feb 07 20:30:24 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us for our Telephone Town Hall tomorrow, Monday February 7th, starting at 7:00 PM where we’ll discuss all the critical issues facing Congress. \n\n📱Dial in at (855) 920-0548\n\n✅ RSVP or Submit a Question at:\nhttps://t.co/1a5vCudb3Z","date":"Sun Feb 06 20:37:01 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The @GOP's definition of \"legitimate political discourse\": https://t.co/0jNu1TiLMo","date":"Fri Feb 04 22:49:29 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today the House passed two of my provisions that will provide transparency and accountability when Chinese companies sell stock to U.S. investors.\n\nLearn more here:\nhttps://t.co/ORdd1u2LIb","date":"Fri Feb 04 18:29:12 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The #AmericaCOMPETES Act will set us on a strong path to compete globally in innovation &amp; technology. I’m proud to co-sponsor &amp; help pass this transformative bill through the House, &amp; look forward to working with my colleagues on this critical investment in our country's future. https://t.co/A4T1FeLuox","date":"Fri Feb 04 16:30:30 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Whoopi Goldberg is not anti-Semitic. I appreciate her acknowledging that her comment on the Holocaust was erroneous and her use of her platform to turn a mistake into a teaching moment. This is a reminder of the need to increase Holocaust education.","date":"Fri Feb 04 00:02:04 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"For our children, loved ones and communities across the country, the Senate must pass the Bipartisan #BackgroundChecksAct, close the Charleston loophole, and act to help us finally #EndGunViolence. (2/2)","date":"Thu Feb 03 20:55:20 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"#GVSurvivorsWeek indicates the approximate time that gun deaths in the United States exceeds the number of gun deaths experienced by peer countries in an entire calendar year. \n\nWe've already reached that point this week -- and it's only the 3rd day of February. (1/2) https://t.co/k04gBBhI61","date":"Thu Feb 03 20:55:19 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/K17cjs01xA","date":"Wed Feb 02 14:36:11 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"During #BlackHistoryMonth we commemorate the history and significant contributions African Americans have and continue to make. May this time serve as more than a celebration of our history, where we reaffirm our commitment towards achieving justice and equality for all. https://t.co/qDBubtHtPZ","date":"Tue Feb 01 16:24:26 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish a happy and healthy #LunarNewYear to all who celebrate!\n\nMay the #YearOfTheTiger bring good health, prosperity and success to all. https://t.co/4fbHV3Fode","date":"Tue Feb 01 14:15:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"In One Week: \n\nJoin us for our next Telephone Town Hall on Monday, February 7th starting at 7:00 PM.\n\nWe'll update you on all the critical issues facing Congress.\n\nRSVP or Submit a Question at:\nhttps://t.co/1a5vCudb3Z","date":"Tue Feb 01 04:34:25 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"It's with sadness that I've learned of the passing of Richard Close. A fierce advocate for the Valley &amp; an effective organizer w/@ShermanOaks914, Richard &amp; I worked closely over the years to combat Valley traffic &amp; reduce aircraft noise. My thoughts are with his family &amp; friends.","date":"Mon Jan 31 23:28:29 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you Father Art for inviting me to join services yesterday morning at Our Lady of the Valley Catholic Church in Canoga Park. Good opportunity to tell people about our constituent services program. https://t.co/4NTyMr9F1D","date":"Mon Jan 31 18:12:55 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us for our next Telephone Town Hall on February 7th starting at 7:00 PM.\n\nWe'll update you on all the critical issues facing Congress.\n\nRSVP or Submit a Question at:\nhttps://t.co/GTFpvGufVl https://t.co/X85lLNyfE4","date":"Sat Jan 29 00:42:51 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Three principles for preserving #Democracy:\n\n1) You can't just love your country when you win (Joe Biden, 2022)\n\n2) You can't condemn political violence only when it's done by the \"other side\"\n\n3) You can't just obey the laws you agree with","date":"Fri Jan 28 19:07:52 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"On Tuesday, @TuckerCarlson praised the government of Hungary for giving subsidies to parents and encouraging parenthood. \n\nDoes Tucker have the guts to endorse the #ChildTaxCredit? Or perhaps the entire #BuildBackBetter? \n\nOr does he only support parenthood in Hungary?","date":"Fri Jan 28 00:31:33 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today on #HolocaustRemembranceDay we remember and honor the memories of the millions of Jews who were murdered. \n\nAs we commemorate this solemn anniversary, may we also reaffirm our resolve to continue the fight against bigotry, anti-Semitism, intolerance and hate.\n\n#WeRemember https://t.co/b8jh2lxhxH","date":"Thu Jan 27 20:30:58 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Yesterday marked India’s 73rd #RepublicDay -- commemorating the day India's constitution came into effect. As the celebrations continue today, let us also reaffirm our resolve to deepen the bond between our nations -- an unwavering priority of mine throughout my time in Congress.","date":"Thu Jan 27 19:14:26 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) The \"Kobe Bryant and Gianna Bryant Helicopter Safety Act\" that @SenFeinstein and I introduced this Congress aims to do just that by requiring the FAA to strengthen federal safety standards for equipping helicopters. \n\nLearn more about the bill here:\nhttps://t.co/4MNTqTgCQM","date":"Wed Jan 26 16:03:24 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today marks two years since we shockingly lost Los Angeles and world icon #KobeBryant, his daughter Gianna Bryant and seven other souls in a tragic helicopter crash. We must honor their memories by working to ensure such tragedies can be prevented in the future. (1/2)","date":"Wed Jan 26 16:03:24 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"While Republicans have relentlessly attacked Democrats’ voting rights protection bills as supposed “federal takeover of elections”, here’s evidence of plans for an actual federal take over of an election. \n\nA stark example of why we must secure voting rights for all Americans.","date":"Tue Jan 25 02:20:05 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was honored to join yesterday’s morning services at Saint Catherine of Siena Catholic Church in Reseda where I got a chance to speak about our constituent services program. https://t.co/ysuoUUMBxQ","date":"Mon Jan 24 20:20:35 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"As we’ve seen a relentless assault on reproductive rights for nearly half a century, today’s commemoration of #Roe49 also serves as a vital reminder on the urgent need to codify #RoeVWade and to continue the work of protecting reproductive healthcare rights across the country.","date":"Sat Jan 22 23:54:39 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"ICYMI: Watch my recent appearance on @cspanwj where I discussed the rising tensions between the U.S. and Russia over Ukraine and the future of NATO.\nhttps://t.co/yioagOZXfB","date":"Fri Jan 21 19:47:58 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I want to thank the over 6,000 Valley residents who joined our Telephone Town Hall last night.\n\nIt was a productive review of the progress we've made in the first year with @POTUS, and an informative and spirited discussion over the challenges we face.\nhttps://t.co/K9Nr7rRjj3","date":"Fri Jan 21 18:49:55 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now! Dial (855) 920-0548 to join!","date":"Fri Jan 21 03:00:30 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Our Telephone Town Hall will be starting soon at 7 PM where we'll discuss all the critical issues facing Congress.\n\nTo participate, Dial (855) 920-0548 anytime between 7:00-8:00 PM tonight. https://t.co/mIzfOwnH60","date":"Fri Jan 21 02:25:36 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us tonight at 7 PM for our Telephone Town Hall -- exactly 1 year since Joe Biden was sworn in as @POTUS.\n\nWe'll review the progress we've made, and the challenges we face.\n\nTo participate in our Telephone Town Hall, Dial (855) 920-0548 anytime between 7:00-8:00 PM tonight.","date":"Thu Jan 20 20:27:28 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/AY5RGhuLFS","date":"Thu Jan 20 15:08:54 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"The State Order medal commemorates the establishment of diplomatic relations between Armenia and the United States; it was awarded to me by the decree of Armenian President Armen Sarkissian @Arm_President for my efforts to strengthen the U.S.-Armenia relationship. (2/2)","date":"Wed Jan 19 22:22:19 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was honored to receive Armenia’s State Order medal from Armenian Ambassador to the U.S. Lilit Makunts @LilitMakunts and President of the Armenian National Assembly Alen Simonyan @alensimonyan. (1/2) https://t.co/8KWrqZzFkf","date":"Wed Jan 19 22:22:19 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us for our Telephone Town Hall tomorrow, January 20th starting at 7:00 PM. \n\nJoining us will be Dr. Lynn Goldman, epidemiologist and pediatrician, who will answer questions on #COVID19\n\nRSVP or Submit a Question at: \nhttps://t.co/1a5vCudb3Z","date":"Wed Jan 19 22:10:03 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Starting today: Every home in America can order four at-home #COVID19 tests. The tests are completely FREE.  \n\nClick below to order:\nhttps://t.co/vUdq3zBJWI","date":"Wed Jan 19 18:55:33 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"My father, Maurice H. Sherman, was born 100 years ago today. \n\nHis service in the U.S. Navy, to the Southern California community, and to the Jewish community inspires me everyday. https://t.co/pq2Ocdcr1P","date":"Wed Jan 19 15:55:26 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Join us for our Telephone Town Hall this Thursday, January 20th starting at 7:00 PM.\n\nJoining us will be Dr. Lynn Goldman, epidemiologist and pediatrician, who will answer questions on #COVID19\n\nRSVP or Submit a Question at:\nhttps://t.co/dQ3YWORDkk","date":"Tue Jan 18 23:00:05 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"#MLK stood up for civil rights for all Americans, including the sacred right to vote. \n \nHis commitment to do what is right inspired generations and helped bring millions fair access to the ballot.\n \nToday, we honor his life and legacy and continue fighting to secure his vision. https://t.co/wIWXCvNhK2","date":"Mon Jan 17 17:26:39 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We pray for those in danger and those held hostage.\nhttps://t.co/n8BImy1n3p","date":"Sat Jan 15 23:28:28 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"\"No where in the world are we witnessing hell like in Tigray. Even in Syria we have access during the worst of crisis in Syria. In Yemen the same, we have access\"","date":"Fri Jan 14 00:03:11 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing a happy #KoreanAmericanDay to the thousands of Korean Americans in the San Fernando Valley and across the nation. In 1903, the first wave of Korean American immigration began; today, Korean Americans are an integral part of our nation.","date":"Thu Jan 13 18:47:07 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"This is an outrageous trivialization of the Holocaust. Equating health guidelines that protect lives with the systematic murder of millions of Jews and others is abhorrent.","date":"Thu Jan 13 17:51:36 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"For 100 days Republican Sen. Rand Paul has endangered Israeli civilians by blocking critical funds for the Iron Dome, a purely defensive system that saves countless civilian lives from Hamas rockets. It's time for Sen. Paul to stop helping Hamas and start defending our ally.","date":"Wed Jan 12 20:26:21 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/Kk48EaW4eE","date":"Wed Jan 12 18:59:23 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Our next Telephone Town Hall will be on Thursday, January 20th -- exactly one year after Joe Biden was sworn in as @POTUS. \n\nWe'll review the progress we've made, and the challenges we face.\n\nRSVP or Submit a Question at:\nhttps://t.co/GTFpvGufVl","date":"Tue Jan 11 04:17:13 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/oGqSMrEemn","date":"Mon Jan 10 02:30:37 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"\"We would have had a higher vaccination rate if we didn't politicize the vaccine\"\n\nICYMI: Watch my appearance on @FoxNews earlier today where I provided some context to our efforts against #COVID19. \nhttps://t.co/gJ9CtxL5CX","date":"Sat Jan 08 23:54:58 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"We must stand with the people of Kazakhstan and against dictatorship. Putin is acting as a mercenary-for-hire by endangered kleptocrats.","date":"Sat Jan 08 18:46:56 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I'll be appearing on @FoxNews Live today at 9:05 AM (12:05 PM EST) to discuss the latest developments on ending the #COVID19 pandemic and on our economic progress.","date":"Sat Jan 08 15:01:25 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"I was honored to join @SpeakerPelosi @SenSchumer and many of my colleagues on the steps of the Capitol for a prayer vigil marking the one year anniversary of the #January6th attack. https://t.co/iyBe99y5DK","date":"Thu Jan 06 23:55:01 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":".@POTUS Biden spoke the truth today: \"You can't love your country only when you win, you can't obey the law only when it's convenient.\" I would add: you can't condemn political violence only when it's committed by \"the other side\".","date":"Thu Jan 06 18:35:56 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Today, as we mark one year since the #January6th attack, we must not allow anyone to rewrite history or whitewash the gravity of what took place. I stand in solidarity with my colleagues in working to ensure that such an assault on our Democracy cannot ever happen again. https://t.co/nctnReHrpM","date":"Thu Jan 06 16:20:32 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"L.A. County residents can receive FREE at-home #COVID19 tests in the mail. \n\nFor more information, click below:\nhttps://t.co/EeVKeE1K8R","date":"Tue Jan 04 16:44:05 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/a8OHWqkDj1","date":"Sun Jan 02 05:57:51 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing everyone a #HappyNewYear and welcome to 2022! Here’s to this being a year of growth, health and happiness for communities across our country. https://t.co/rN5LWIfEpU","date":"Sat Jan 01 17:19:03 +0000 2022","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing a happy first day of #Kwanzaa to everyone celebrating! May the new year bring bountiful blessings to you all! https://t.co/ypTNkTnWo9","date":"Sun Dec 26 21:34:11 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing everyone who celebrates a #MerryChristmas \n and #HappyHolidays.\n  \nMay your day be filled with good times, love and cheer. https://t.co/VH0kiPa2FM","date":"Sat Dec 25 18:26:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This tells us what everyone already knows about the government of China, and what some hoped wasn’t true about Amazon...I wonder if the Washington Post will cover this story.\nhttps://t.co/ROlDu4NBO0","date":"Wed Dec 22 02:07:44 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Disasters like Deepwater Horizon and Aliso Canyon reveal that we cannot rely upon the fossil fuel industry’s claims about safety. We need to work to #ShutDownAlisoCanyon.\nhttps://t.co/n63hkYmuu6","date":"Tue Dec 21 23:59:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The authors do not “advocate for a ‘regime change’ strategy under cover of non-proliferation.”(4/4)","date":"Tue Dec 21 15:34:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The authors, while arguing for the development of a credible threat to Iran’s nuclear infrastructure, built at such great cost &amp; a source of pride for Iran's government, note that “only by diplomatic agreement” can we resolve the problem that is Iran’s nuclear program. (3/4)","date":"Tue Dec 21 15:34:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Included on this list is my friend and one-time opponent, Howard Berman. Howard, it should be noted, was one of the most powerful voices in 2015 in support of the JCPOA. (2/4)","date":"Tue Dec 21 15:34:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"An important statement from some of our most distinguished foreign and defense policy officials, as well as former Democratic House members with a wealth of foreign policy experience on the Democratic side of the aisle. (1/4)\nhttps://t.co/EWJxP4kL0f","date":"Tue Dec 21 15:34:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We need forces to disengage, and stop fighting, and allow ground delivery of humanitarian relief. This statement from the TDF is a big step in the right direction.","date":"Mon Dec 20 21:52:17 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Congressman Lowenthal has served our country for 30 years and leaves behind an extraordinary legacy of service on behalf of Californians, our environment and our democracy. It's been an honor to serve with him. Wishing my friend @RepLowenthal all the best.","date":"Fri Dec 17 15:20:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"~1 million continue to face famine in Tigray after a year of blockade of food and humanitarian aid by PM Abiy Ahmed and by Eritrea. We must take all available action to establish food access corridors. (2/2)","date":"Thu Dec 16 22:18:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today's @hrw and @amnesty report makes it clear - a genocide maybe unfolding in Tigray. With ~30k Tigrayans rounded up into concentration camps, the need for an immediate ceasefire and international monitoring has never been more dire. (1/2)","date":"Thu Dec 16 22:18:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I suggested the Western Kentucky Relief Fund was a great way to help and the mongoose community responded with a $5000 contribution. This should inspire all Americans, regardless of currency preferences. (2/2) https://t.co/cJVMtGqM4z","date":"Thu Dec 16 21:55:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"#MarkMeadows texts and emails reveal his extensive and alarming involvement with the #January6th attack. He owes a full, truthful testimony to the American people and his refusal to honor a legally binding subpoena is why I voted tonight to hold him in contempt of Congress.","date":"Wed Dec 15 04:44:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today the House took action against China’s ongoing oppression of Uyghurs by passing the #Uyghur Forced Labor Prevention Act, which I cosponsored. The ongoing internment of China’s Muslim population, and the practice of forced labor, must be confronted.","date":"Wed Dec 15 03:23:12 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The government of Kentucky has established the \"Team Western Kentucky Tornado Relief Fund\" to assist those impacted by the tornadoes. If you would like to help, click here: https://t.co/SJRvwjj1NE","date":"Tue Dec 14 22:22:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Our hearts are with Kentucky and the communities across the central U.S. \nthat were impacted by these devastating tornadoes.\n\nWe join together across the nation in praying for their swift recovery and stand ready to aid and assist.","date":"Sun Dec 12 21:02:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Although today's #SCOTUS decision allows challenges to #SB8 to proceed, the Court's failure to block Texas' abortion ban means #SB8 will continue to wreak havoc on women's lives every day it's still in effect. (1/2)","date":"Fri Dec 10 23:57:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As we fight to protect the constitutional right to abortion care nationwide, my bill, the Medical Travel Assistance to Protect Women’s Right to Choose Act,  will cover costs for patients who are forced to cross state lines to avoid near-total bans on abortion, like #SB8. (2/2)","date":"Fri Dec 10 23:57:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I joined “One World” with @ZainAsher on\n @cnni to discuss the situation in #Ethiopia. We must get food to those who are starving and Eritrea should open its ports to U.N. relief agencies. All parties should agree to a ceasefire. \nhttps://t.co/R9KnTVdp9q","date":"Fri Dec 10 22:06:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Mongoose defeats Cobra \n\nMongoose defeats Hamster-like creature \n\nThis tweet is not intended to provide investment advice. https://t.co/UmNhpDreup","date":"Thu Dec 09 22:52:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I voted to pass the #ProtectingOurDemocracy Act, a bill I co-sponsored. It's the third pillar in our fight to protect our democracy, along with the #JohnLewisVotingRightsAct and the #ForThePeopleAct, two bills I helped to introduce and pass in the House. https://t.co/AlVPtvA3Yp","date":"Thu Dec 09 21:55:57 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As I said on the House Floor:\n\nAs Co-Chair of the CPA caucus, I can certify that this is the most important genuinely boring bill we will deal with all year. \n\nAnd it passed 415 to 9","date":"Thu Dec 09 01:08:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I want to thank Chairwoman @RepMaxineWaters and my colleagues for their help in advancing this vital bill, and for demonstrating how Congress can come together and solve an impending crisis before it hits. (2/2)\nhttps://t.co/jO6Vh2F76e","date":"Thu Dec 09 00:05:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today the House passed with bipartisan support my Adjustable Interest Rate (#LIBOR) Act -- legislation to protect the U.S. financial system from $16 Trillion LIBOR uncertainty. (1/2)\nhttps://t.co/W2eoPnybrW","date":"Thu Dec 09 00:05:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(1/2) My staff has told me that there are quite a number of tweets attacking my position with regard to the Horn of Africa and attacking me personally along the following lines:","date":"Tue Dec 07 23:17:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) They say the San Fernando Valley is a terrible place to live and they reach this conclusion by citing statistics about the City of San Bernardino. Seems some of my critics know very little about the San Fernando Valley, the City of San Bernardino, or my efforts in Congress.","date":"Tue Dec 07 23:17:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I am pleased that the State Department has spoken out about the troubling roundup of tens of thousands of ethnic Tigrayans by the Ethiopian Government and reaffirmed the need for an immediate ceasefire by all parties, which I have been calling for since November of 2020. https://t.co/mGcCP4VSHW","date":"Mon Dec 06 20:03:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In 2017, I filed articles of impeachment against #Trump based on obstruction of justice for firing Comey. \n\nHere he is 4 years later casually confessing to it.","date":"Mon Dec 06 18:01:51 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/7oe0Kyq5kr","date":"Sat Dec 04 19:43:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The fact is Eritrean forces, sometimes disguised as Ethiopian troops, have worked to block food shipments into Tigray. So it would be a wonderful and surprising reversal if Eritrea would allow food shipments though its own territory. (4/4) https://t.co/GjnR9yxDVq","date":"Fri Dec 03 18:52:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"It is good that Eritrea acknowledges its obligation under intl. law to allow aid in. I welcome a commitment from the Eritrean Govt to allow its ports/roads to be used to send aid to dying Tigrayans. When can UN start moving aid through Eritrea to Tigray? (3/4)","date":"Fri Dec 03 18:52:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Do you think they all failed to notice that the closest ports to Tigray are in Eritrea and the relevant truck routes can't be blocked by Ethiopian troops? Truck routes from Djibouti and Sudan are blocked by Ethiopian troops and allied militia. (2/4)","date":"Fri Dec 03 18:52:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"~1 million in Tigray are facing famine. The U.N., U.S. and others are desperate to ship food to a port, and truck it into Tigray. (1/4)\nhttps://t.co/ki1mQM9BIi","date":"Fri Dec 03 18:52:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The U.S. must take every available action to end PM Abiy &amp; Eritrea's blockade of Tigray, get food aid to the 1 million facing famine, and prevent genocide. (3/3)","date":"Wed Dec 01 22:26:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In the last few weeks alone, over 30,000 Tigrayans have been rounded up into concentration camps across Ethiopia. Government officials have referred to Tigrayans as “rats” and a “cancer”. Given PM Abiy's media blackout, the situation could be worse than what we already know.(2/3)","date":"Wed Dec 01 22:26:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"What’s unfolding in Ethiopia has all the makings of a genocide and we cannot wait for this to become another Rwanda before we take action. See my questioning of @AsstSecStateAF &amp; @USAIDAfrica #SenDepAsstAdministrator (1/3)\nhttps://t.co/brofWCRKuw","date":"Wed Dec 01 22:25:59 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Tragic events like yesterday's shooting in Oxford, Michigan underscore the need for stronger gun control laws. I applaud the 9th Circuit's decision here, but there's more work to do to create safe and sensible gun policies that protect the lives of Californians and all Americans.","date":"Wed Dec 01 16:50:59 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Last night on “Life Liberty &amp; Levin” Trump asserted the Spanish flu was the major reason for the end of WW1. He was completely wrong, as usual. I don't know which is worse. That Trump is completely ignorant about history. Or that Trump does not know that he's completely ignorant.","date":"Tue Nov 30 02:32:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/FiOSodGSFN","date":"Mon Nov 29 17:47:01 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing a very #HappyHanukkah\n to all those celebrating! May this #FestivalOfLights fill our homes with brightness, and our hearts with hope and happiness. https://t.co/reVOAF5oYe","date":"Sun Nov 28 22:22:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@ReaganWorld thank you for all you do for foster youth, especially through @mixedroots and thank you for bringing that wonderful organization to my attention. God bless and go #Bruins!","date":"Sat Nov 27 19:13:11 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Happy #Thanksgiving to all across the nation! May this year’s gathering be filled with many blessings, laughter and thanks. https://t.co/gHqnnQzjhl","date":"Thu Nov 25 18:44:45 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I was pleased to meet with Moroccan Minister of Foreign Affairs Nasser Bourita and Ambassador of Morocco to the United States, her Highness Princess Lalla Joumala. (1/2)","date":"Mon Nov 22 23:35:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We discussed relations between the U.S. and #Morocco, the Western Sahara, the U.S. commitment to recognize Moroccan sovereignty, and the commitment of Morocco to open an embassy in Israel. (2/2)","date":"Mon Nov 22 23:35:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) Biden's appointment of Powell and Dr. Lael Brainard as Vice Chair is applauded by @SpeakerPelosi: https://t.co/yKkch5kRxl","date":"Mon Nov 22 18:17:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(1/2) I've been advocating for the reappointment of @federalreserve Chair Jerome Powell for one term. See from @WSJ article: https://t.co/9a80mOO0dp","date":"Mon Nov 22 18:17:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@GOPLeader in his 8 hour speech challenged Democrats to debate him in his district on tax administration provisions of #BuildBackBetter. I renewed my acceptance of his challenge -- but he won't debate because I'm a CPA, and because he's wrong. (3/6)","date":"Sun Nov 21 21:10:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The Trump Tax Bill increased the deficit by $2 trillion. Republicans responded by using loosey-goosey \"dynamic scoring\". If we had used dynamic scoring for #BuildBackBetter, it would eventually cut the deficit by trillions. (5/6)","date":"Sun Nov 21 21:10:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Under Ronald Reagan we had one IRS employee for every 2,400 Americans. Now it's one for every 4,400. If Republicans respected Reagan, they'd support the tax administration provisions of #BuildBackBetter. (4/6)","date":"Sun Nov 21 21:10:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Think of the long-term boost to our GDP of universal Pre-K (a better workforce decades from now), Child Care (bringing more parents into the labor force now) and a healthy workforce with an expanded Obamacare.  (6/6)","date":"Sun Nov 21 21:10:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"See my @FoxNews Live appearance: I said #Trump (and I'd add @TuckerCarlson) has blood on his hands for discouraging vaccination. \"Ghoulish political strategy\" to keep the economy closed and improve GOP chances in 2022. (1/6)\nhttps://t.co/Le49oxLjpU","date":"Sun Nov 21 21:10:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Also explained that #BuildBackBetter will more than pay for itself by helping to close the $1 trillion annual tax gap -- taxes owed by the wealthy and not collected. (2/6)","date":"Sun Nov 21 21:10:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Will be joining @FoxNews Live with @MikeEmanuelFox today at 1:10 PM EST (10:10 AM PS) to discuss the #BuildBackBetter Act and more.","date":"Sun Nov 21 16:47:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing a very Happy Birthday to @POTUS Joe Biden! \n\nThank you for your dedicated leadership on helping America #BuildBackBetter https://t.co/azelzGcIRz","date":"Sat Nov 20 20:48:45 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As Co-Chair of the Congressional India Caucus, I want to wish the Sikh community in the San Fernando Valley and across the world a very Happy #Gurpurab – a day meant to commemorate the birth of Guru Nanak Dev Ji, founder of the Sikh faith.","date":"Fri Nov 19 22:27:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I proudly voted to pass the #BuildBackBetter Act -- a transformative investment in the future of our nation that will revitalize the economy, create millions of new jobs, combat the climate crisis, and uplift working families across the country. https://t.co/Dk4FIrEWYE","date":"Fri Nov 19 16:06:05 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@GOPLeader watched your speech and accept your challenge. Happy to do joint Town Halls in your district or mine or the one in between on Tax Enforcement. Big talk on the floor, but I’m sure you don’t have the courage to debate a CPA.","date":"Fri Nov 19 06:39:27 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@GOPLeader #McCarthy: \"Build Back Slower\"","date":"Fri Nov 19 05:22:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I didn't know the House had a filibuster problem too...","date":"Fri Nov 19 05:08:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"At this rate, we'll get to the year 2022 before @GOPLeader stops talking","date":"Fri Nov 19 04:47:27 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I cosponsored and today voted for a resolution to censure Rep. #Gosar for promoting violence against another Member of Congress and the President. Graphic depictions and threats of violence are never appropriate and are especially unbecoming of a Member of Congress.","date":"Wed Nov 17 23:02:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I wrote today to @SecGranholm @ENERGY to get answers regarding the demolition of a building last month at the Santa Susana Field Lab site, as covered by @NBCLA @JoelNBCLA. (1/2) https://t.co/AJgXoqc3cW","date":"Wed Nov 17 19:17:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"My constituents and I require confidence that a full cleanup will move forward expeditiously, while always conforming to the highest standards of public safety. #SSFL (2/2)","date":"Wed Nov 17 19:17:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I want to thank the thousands of Valley residents that joined our Telephone Town Hall last night!\n\nIt was a productive and spirited conversation on the many critical issues we face together.\n\nICYMI, learn more about our event here:\nhttps://t.co/h2rsu1N29h","date":"Wed Nov 17 17:19:36 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting now! Join now by dialing (855) 920-0548","date":"Wed Nov 17 03:01:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting soon at 7:00 PM Pacific!","date":"Wed Nov 17 02:16:57 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us *Tonight* for our Telephone Town Hall starting at 7:00 PM Pacific to discuss all the critical issues facing Congress.\n\nWe'll be joined by Dr. Lynn Goldman, Dean of @GWpublichealth\n\nTo RSVP or Submit a question, visit: https://t.co/1snLNRj3hZ https://t.co/tzKnDkaYhu","date":"Tue Nov 16 22:42:27 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to have joined my colleagues in supporting @POTUS's vision that will create millions of good-paying jobs and lay the foundation for strong economic growth for decades to come.","date":"Mon Nov 15 22:17:11 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This Sunday is an opportunity for the rest of the nation to learn more as the documentary, In the Dark of the Valley, will be shown nation-wide by MSNBC on Sunday, November 14th, at 7pm PST/10pm EST. (2/2)","date":"Sun Nov 14 00:07:41 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Many of us in the Valley are aware of the contamination at the Santa Susana Field Laboratory site and have been pushing for cleanup. (1/2)","date":"Sun Nov 14 00:07:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, @RepSchakowsky and I asked the State Department to take meaningful steps to ensure Iraqi Christians are not marginalized in elections. The organized disenfranchisement of Christian minorities during Iraq’s recent elections is unacceptable. Read our letter below. https://t.co/e3OJm2a6Bt","date":"Sat Nov 13 00:43:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"On #VeteransDay, we salute all who have and are bravely serving our country and pledge to honor their sacrifice today and every day. https://t.co/n8W8RK7bn2","date":"Thu Nov 11 15:52:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In One Week: I'll be hosting a Telephone Town Hall on Tuesday, November 16th starting at 7 PM.\n\nWe'll discuss the latest on the #BuildBackBetter agenda, our efforts to defeat #COVID19 and all the critical issues facing Congress.\n\nRSVP/Submit a Question at:\nhttps://t.co/Xu1cx6kTtP","date":"Tue Nov 09 23:34:48 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"A mutual declaration ending the 1950 state of war between the United States, South Korea and North Korea is not a concession to Pyongyang - it's a vital step towards peace. \n\nRead the letter that I, along with 22 of my colleagues, sent @POTUS on this critical issue. https://t.co/OEYgurrMp0","date":"Mon Nov 08 22:33:45 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I am confident that we will pass an important \n#BuildBackBetter bill later this month. (2/2)","date":"Sat Nov 06 03:58:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I proudly voted for @POTUS's Infrastructure Investment &amp; Jobs Act; a-once-in-a generation investment in our infrastructure that'll help create millions of jobs, unleash the full potential of working families &amp; position the U.S to win the 21st century.(1/2)\nhttps://t.co/A1Rb30LcAt","date":"Sat Nov 06 03:58:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As war in Ethiopia escalates, we must get aid into Tigray where ~ 1 million face famine. It's unacceptable that no humanitarian aid has gotten into Tigray since Oct 18 due to PM Abiy Ahmed and Eritrea’s blockade. See my interview w/@BBCWorld News America: \nhttps://t.co/bVSrMSEgbe","date":"Thu Nov 04 23:01:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I want wish a happy and safe #Diwali to all those who celebrate the #FestivalOfLights. The lessons of this tradition remind us to let good triumph over evil, choose love over hate, and joy over despair. https://t.co/r15vjQcLgS","date":"Thu Nov 04 16:06:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I urged the California Public Utilities Commission (CPUC) @californiapuc to reject plans to increase natural gas storage at the Aliso Canyon Natural Gas Storage Facility, site of the largest methane gas leak in U.S. history.\nhttps://t.co/dVbzYL4Ahw","date":"Thu Nov 04 14:47:05 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(2/3) This is not a new issue. In the U.S.’s evacuation of 15,000 Americans from Lebanon in 2006, the subsequent GAO report found that the lack of registration significantly hampered evacuation efforts, just like it did in Afghanistan this year.","date":"Wed Nov 03 18:11:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(3/3) My commonsense legislation will better prepare the State Department to assist Americans in emergencies abroad. I urge my colleagues to support it. Read my bill here: https://t.co/5gjpT6h5uI","date":"Wed Nov 03 18:11:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(1/3) During today’s @HouseForeign hearing, I was pleased that Dep. Sec. McKeon confirmed that requiring U.S. citizens to register with the State Department when entering war zones would have vastly improved the Afghanistan evacuation. My SAFE Act (H.R. 5387) would do just that.","date":"Wed Nov 03 18:11:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I remain committed to strengthening the U.S.-Armenia partnership and was pleased to discuss these important issues with Ambassador Makunts. (2/2)","date":"Tue Nov 02 18:55:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This afternoon, I joined the Congressional Armenian Caucus in meeting with Armenian Ambassador to the United States @LilitMakunts. We spoke about the need to demine #Artsakh, Armenian POWs in Azerbaijan, and the possibilities of a U.S.-Armenia Tax Treaty. (1/2) https://t.co/QtY2x4Jz5X","date":"Tue Nov 02 18:55:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I am deeply concerned about the deteriorating health condition of former Georgian President Saakashvili and urge the Government of Georgia to guarantee his access to hospital care and full legal representation. Read my full statement here:\nhttps://t.co/Js2w2GYHcC","date":"Sat Oct 30 18:40:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(3/3) The American @LungAssociation recent report on EVs finds that “lower-income communities and communities of color often face disproportionate exposures to harmful pollution.” Let’s not leave struggling communities behind in the transition to EVs.","date":"Thu Oct 28 21:43:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"1/3) Proud of the work @MaxineWaters, @FSCDems and I have done to see $150 Billion included in the #BuildBackBetter bill to make critical investments in safe &amp; affordable housing. This long-overdue investment in our nation’s housing infrastructure is key to #BuildingBackBetter.","date":"Thu Oct 28 21:43:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(2/3) Also proud to report that I’ve worked with @FSCDems to include a provision in the #BuildBackBetter package to ensure funding is available for the installation of electric vehicle chargers in eligible apartment buildings.","date":"Thu Oct 28 21:43:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) We discussed my bill, the Peace on the Korean Peninsula Act. Read the bill here: https://t.co/15J7QYnyqk","date":"Thu Oct 28 20:05:36 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to meet with South Korean leaders Seok-Hyun Lee, Vice Chair of the Peaceful Unification Advisory Council, Youngsun Park @Park_Youngsun, former Member of the National Assembly of South Korea, and Casey Choi @CaseyK_Choi, President of #KAPAC. (1/2) https://t.co/wlWLyIbN7u","date":"Thu Oct 28 20:05:35 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"For the record: I no longer bother to correct the record when right-wing or anti-Israel media misquotes me or mischaracterizes my statements. Happens too often. I have a lot to do. (1/2)","date":"Wed Oct 27 14:52:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"For the record: Sometimes I list options the U.S. could take, or should consider, or could threaten to take under certain circumstances. That is not the same as calling for each listed action to be taken immediately. (2/2)","date":"Wed Oct 27 14:52:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today marks the third anniversary of the deadliest anti-Semitic massacre in American history at the #TreeofLife Synagogue in Pittsburgh. May their memory be a blessing. We remain resolute in our stand against anti-Semitism and will always be #StrongerThanHate.","date":"Wed Oct 27 13:29:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"See my questioning of the witnesses from the hearing here: \nhttps://t.co/R7kNRvMFyu","date":"Tue Oct 26 22:10:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, as Chair of the House Financial Services Subcommittee on Capital Markets and Investor Protection, I convened a hearing examining the risks #China poses to American investors and U.S. capital markets. See my opening statement below.\nhttps://t.co/5Di5kS4Ghy","date":"Tue Oct 26 20:34:38 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"6 yrs ago Aliso Canyon became the site of the largest gas blowout in US history. We must shut it down. I helped intro a bill requiring the fed gov issue improved safety regulations. Yesterday I was assured by @PHMSA_DOT such regulations will be published.\nhttps://t.co/8nyp8Px9TE","date":"Fri Oct 22 16:16:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I recently joined @SenAlexPadilla @RepBrownley @RepLouCorrea and @gracenapolitano in expressing our strong concerns about delays in the clean-up of #SSFL.\nhttps://t.co/iYpU0HKKkb","date":"Fri Oct 22 14:17:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Steve Bannon has actively undermined the #January6th Committee and prevented Congress from doing its job investigating the horrible attack on our Capitol. That's why I joined today's bipartisan vote to hold him in contempt of Congress. \n\nNo one is above the law.","date":"Thu Oct 21 21:06:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to meet with Indian Ambassador to the U.S. Taranjit Singh Sandhu @SandhuTaranjitS. We discussed continuing the US-India partnership on #COVID19 vaccines, China and ways in which Congress can work to improve the U.S.-India relationship. https://t.co/X1BVtR27fn","date":"Wed Oct 20 19:04:23 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to meet with Armenian Ambassador to the U.S. Lilit Makunts @LilitMakunts and discuss the ways in which Congress can work to strengthen the U.S.-Armenia relationship. https://t.co/3Sp1QXfQLn","date":"Tue Oct 19 19:41:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Saddened by the passing of General Colin Powell, the first Black Secretary of State, the youngest Chairman of the Joint Chiefs of Staff, a trailblazer and dedicated public servant. My prayers are with his family during this difficult time.","date":"Mon Oct 18 21:06:52 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"ICYMI: Joined @MikeEmanuelFox on @FoxNews earlier today to discuss where negotiations over the #BuildBackBetter agenda stands in Congress. \nhttps://t.co/y1u4l6SScS","date":"Sun Oct 17 21:18:44 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"TCM to air tribute tomorrow to the life and work of the Valley's very own Marsha Hunt; a legendary actress and one of Hollywood’s first ever “actor-vists”. \nhttps://t.co/ZbDHkumpoB","date":"Sun Oct 17 02:48:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The Medical Travel Assistance to Protect Women’s Right to Choose Act that I authored will cover costs for patients who are forced to cross state lines to avoid near-total bans on abortion. But what we need is abortion rights in all 50 states. (2/2)","date":"Sat Oct 16 02:16:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"These terrible stories show the problems with the Texas law #SB8 as women have had to travel hundreds of miles to get abortion care, and illustrate why we must work to protect the constitutional right to abortion care nationwide. (1/2)","date":"Sat Oct 16 02:16:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish everyone who celebrates a happy and prosperous #Dussehra https://t.co/4mi6VdwoMK","date":"Sat Oct 16 00:23:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Was pleased to join the Chatsworth/Porter Ranch Chamber of Commerce @cprcoc “State of the Community” luncheon yesterday and be able to discuss programs like PPP and the Restaurant Revitalization Act that support valley businesses. https://t.co/CoIBUtdr03","date":"Fri Oct 15 18:43:39 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Best game ever! #Dodgers","date":"Fri Oct 15 04:45:15 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I stand in agreement with my colleagues on the @FSCDems and Chairwoman @RepMaxineWaters that #HousingIsInfrastructure. We must seize this once-in-a-lifetime opportunity to invest in the long-overdue need for #AffordableHousing by making it a part of the #BuildBackBetterAct. https://t.co/TruQT7R8pT","date":"Wed Oct 13 18:25:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The #AmericanRescuePlan continues to deliver as the next advance #ChildTaxCredit payment arrives for millions of families this Friday, October 15th. \n\nFor more info visit the IRS's #ChildTaxCredit Portal here: https://t.co/CyfKYVKSTt\nhttps://t.co/6Ex3wOlohe","date":"Tue Oct 12 18:16:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"On behalf of my team, thanks Ray.","date":"Tue Oct 12 03:36:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Was pleased to join the North Valley Regional Chamber of Commerce @NVRCC Oktober Festival yesterday where we highlighted the work of our constituent services team. https://t.co/NWrWut3op4","date":"Mon Oct 11 18:22:51 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This is also why I authored the Medical Travel Assistance to Protect Women’s Right to Choose Act, to defray the costs for women who are forced to cross state lines to avoid restrictive bans like this. (2/2)","date":"Thu Oct 07 21:41:10 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I applaud the recent decision preventing the enforcement of #SB8, the most extreme abortion ban in the country. We must ensure that the constitutional right to abortion care is protected nationwide, which is why I helped introduce the Women’s Health Protection Act. #WHPA (1/2)","date":"Thu Oct 07 21:41:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I am honored to celebrate this #HispanicHeritageMonth with my colleagues in the @HouseDemocrats. Our diversity is our strength — and I am proud to serve alongside all of you as we fight for our Hispanic communities and our American values.","date":"Thu Oct 07 17:18:52 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Yesterday’s #FacebookWhistleblower testimony that Facebook’s engagement-based ranking promoted hateful content targeting Rohingya and Tigrayans during ongoing atrocities is an outrage.","date":"Thu Oct 07 02:39:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Was glad to speak at @CSUNorthridge about my efforts to fight for federal aid for higher education at today’s @CAGovernor Newsom bill signing with great California champions of higher education @EleniforCA @AsmJesseGabriel @AsmKevinMcCarty @MariaEDurazo @AsmReyes47 @AsmMarcBerman https://t.co/ei5aRhKVds","date":"Wed Oct 06 21:00:25 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The devastating oil spill across the Southern California coast serves as a painful reminder of why, for 25 years in Congress, I've fought against offshore drilling off of California's coast and have worked to hold big oil accountable for their pollution. \nhttps://t.co/XpA234sLsV","date":"Tue Oct 05 19:04:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In May, we saw how vital the #IronDome defense system is to saving thousands of lives when Hamas fired +4,500 rockets into Israel. It's critical that the U.S. continues to stand with Israel and help support these crucial, life saving programs. (2/2)","date":"Mon Oct 04 21:56:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I was proud to join so many of my colleagues a couple weeks ago in voting to replenish Israel's #IronDome.  Despite this overwhelming bipartisan vote to stand with our ally Israel, Senator Rand Paul now stands in the way of the bill coming to the Senate floor. (1/2)","date":"Mon Oct 04 21:56:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Rent and utility assistance will also still be available for renters and landlords impacted by #COVID19. \n\nFor more info, visit: https://t.co/PoJ6Sv7MZN","date":"Fri Oct 01 22:28:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Many state eviction protections are set to expire today. I've fought for an extension of Federal eviction protections and joined @RepCori's sit-in on the Capitol steps to highlight this urgent need.\n\nFortunately, @LACity's protections remain. Learn more at https://t.co/IQ2uhQDwGl https://t.co/XBnWIXAjMN","date":"Fri Oct 01 22:28:39 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"At our @HouseForeign hearing on South East Asia, I focused on the oppression of the Rohingya people by Burma/Myanmar. Watch my full remarks above on the need for more urgent action.","date":"Wed Sep 29 23:16:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sherman: “The fact that we're still providing millions of dollars to help the government of Myanmar/Burma achieve its economic objectives-when that government is engaging in genocide and ethnic cleansing- is a stain on the morality of the United States.”\nhttps://t.co/gpzGnfiWuE","date":"Wed Sep 29 23:16:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sherman: “The Ethiopian gov continues to block humanitarian aid from entering #Tigray. Is it our position that this is a gross depravation of human rights/war crime?” \n\nDep. Asst. Sec Gonzales: “We certainly see it as a gross depravation of human rights.”\nhttps://t.co/zLQ4D2NzZO","date":"Wed Sep 29 23:01:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"During yesterday's @HouseForeign hearing, I asked the administration what we're doing to aid #Tigray. As millions face starvation, we must ensure that the Ethiopian government allows humanitarian aid to reach the people of Tigray.","date":"Wed Sep 29 23:01:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to all who joined our Telephone Town Hall last night! It's always great to hear what's on the minds of Valley residents and keep them informed on all the critical issues we face together. \nhttps://t.co/3PeqNKyQzR","date":"Wed Sep 29 17:28:10 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now!\n\nTo Join Dial (855) 920-0548!","date":"Wed Sep 29 02:00:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting tonight in about 1 hour!","date":"Wed Sep 29 01:04:18 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us *Tonight* for our Telephone Town Hall starting at 7:00 PM Pacific where we'll update you on all the critical issues facing Congress.\n\nWe'll be joined by Dr. Lynn Goldman, Dean of the @GWpublichealth \n\nTo participate, Dial (855) 920-0548 anytime during the event tonight. https://t.co/N8VNWZHtYR","date":"Tue Sep 28 22:03:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you Tucker for endorsing one of the most progressive provisions in the most progressive bill of the century. Unfortunately, the refundable #ChildTaxCredit expires next year. Unless we pass the Democratic #ReconciliationBill #BuildBackBetter. [2/2]","date":"Tue Sep 28 16:39:10 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"[1/2] Last night, @TuckerCarlson interviewed the President of Poland @prezydentpl who described his country's program of paying money to parents. Tucker said he wished the US had a similar program. We do. It's called the #ChildTaxCredit ($250 per child/month; $300 kids 5 &amp; under) https://t.co/EvlW1piESC","date":"Tue Sep 28 16:39:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us *Tomorrow* for our Telephone Town Hall starting at 7 PM Pacific where we'll discuss all the critical issues facing Congress.\n\nWe'll be joined by Dr. Lynn Goldman, Dean of the @GWpublichealth \n\nRSVP or Submit a Question in advance at: https://t.co/1snLNRj3hZ","date":"Mon Sep 27 22:12:32 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We need to impose tariffs on China now in order to negotiate from strength to deal with China's wrongful behavior. The article below describes the latest outrage. \nhttps://t.co/DltS1yPf9X","date":"Mon Sep 27 14:34:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"After the Supreme Court greenlit the most restrictive ban on abortion we've ever seen, today the House passed the Women's Health Protection Act -- legislation I helped introduce that would protect the right to access abortion throughout the United States. #WHPA https://t.co/xM9JudqWhv","date":"Fri Sep 24 21:45:44 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"They deserve dignity, living wages and safe work conditions. #IASolidarity (2/2)","date":"Fri Sep 24 20:45:32 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Our favorite shows and movies would literally not be possible without the work of @IATSE members. In addition to their contributions to our culture, their work is of major importance to the U.S. economy, and especially here in the Valley. (1/2)","date":"Fri Sep 24 20:45:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The bill is an imperfect solution to a problem that should not exist. The Supreme Court should re-affirm and enforce Roe v. Wade so that women in all states have the right to choose. (2/2)","date":"Fri Sep 24 19:28:27 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I introduced the Medical Travel Assistance to Protect Women's Right to Choose Act -- to support women living in states that have enacted abortion bans by providing funding to travel to states where they can access full reproductive healthcare. (1/2)\nhttps://t.co/KskWCuU701","date":"Fri Sep 24 19:28:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Good to meet with President of Zambia @HHichilema along with @RepGregoryMeeks of Foreign Affairs and @RepKarenBass of the Africa Subcommittee. The President spoke of his dedication to Democracy and the rule of law.","date":"Fri Sep 24 17:25:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to report that the House passed an amendment offered by @RepCardenas @RepAdamSchiff and I calling for Azerbaijan’s immediate release of Armenian prisoners of war and for an investigation into their actions during their 2020 attacks against #Artsakh.","date":"Fri Sep 24 16:46:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"A great victory for the US-Israel alliance. House votes to replenish Iron Dome. Supported by 96% of Democrats and 99% of Republicans. \n\nThe most bi-partisan vote this year.","date":"Thu Sep 23 18:56:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The House voted to pass the amendment offered by @RepMaxineWaters and I to punish Russia for its interference in U.S. elections.\n\nThis sends a powerful message that the U.S. is prepared to act against Putin’s efforts to undermine our democracy.\nhttps://t.co/SSVSavi7x9","date":"Wed Sep 22 20:47:44 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’m pleased we will vote on a separate Iron Dome bill soon. I am confident it will pass by a wide margin— as it should. Iron Dome saves lives.","date":"Wed Sep 22 04:38:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In ONE WEEK: Join us for our Telephone Town Hall on Tuesday September 28th starting at 7 PM where we'll update you on all the critical issues facing Congress.\n\nWe'll be joined by Dr. Lynn Goldman, Dean of the @GWpublichealth.\n\nRSVP or Submit a Question at: https://t.co/1snLNR1rTp","date":"Tue Sep 21 22:03:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Was good to share some time and New Year greetings with former ambassador and Israel’s current representative to Southern California and over a dozen western states, @Hillel_Newman. Continuing my efforts to strengthen US-Israel relationship. https://t.co/QuD3MFmJEx","date":"Sat Sep 18 23:32:42 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Nice meeting with Valley members of the Hindu Volunteer Group on the occasion of the festival #RakshaBandha. Always good to see Sunil Agrawal, Chairman of the \nIndia Association of Los Angeles. https://t.co/dP9z2Wko36","date":"Sat Sep 18 23:02:41 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As I just discussed with @bbcworldservice, we should propose an Indo-Pacific conference on naval limitations to prevent a naval arms race. If China agrees to a reasonable deal, great for everyone but arms merchants. (1/2)","date":"Sat Sep 18 22:01:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"If not, at least we stood up for peace. And the American people and the world will know where China stands. (2/2)","date":"Sat Sep 18 22:01:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"G'Mar Chatima Tovah to all who are getting ready to observe #YomKippur. May it be a day full of reflection, atonement and continuance of tradition. https://t.co/FbqL6kHVuK","date":"Wed Sep 15 22:04:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We'll be hosting a Telephone Town Hall on Tuesday September 28th starting at 7:00 PM Pacific to update you on all the critical issues facing Congress.\n\nTo RSVP or Submit a Question, visit: https://t.co/1snLNRj3hZ","date":"Wed Sep 15 21:34:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"ICYMI -- Sherman tells @FoxNews: This is a smashing victory and a repudiation of the Republican party by a massive margin.\nhttps://t.co/tCSqXblL5K","date":"Wed Sep 15 19:57:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Why would a Chinese General believe General Milley? American hubris leads us to believe that everyone thinks we’re the good guys, and never lie. Our adversaries don’t believe that.","date":"Wed Sep 15 19:30:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"See my questioning of @SecBlinken during today's @HouseForeign hearing evaluating the U.S. withdrawal from #Afghanishtan. The questioning shows that Trump had committed to withdraw by May 1, but had no plan on how. \nhttps://t.co/xEDc1glJIf","date":"Mon Sep 13 21:16:38 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Honored this weekend to pay tribute to my friend and advisor Larry Horner, veteran, public servant, Mayor @CityofTO, and beloved husband and father. May his memory be a blessing. @eltongallegly24 @lindaparks2021 @CBill_delaPena @ASM_Irwin @hageltim @AyubBill https://t.co/QyCk7qZV1O","date":"Mon Sep 13 15:28:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today we remember the lives lost on September 11th, and come together as a nation to honor their memories.\n\nWe remember and honor the selfless first responders, firefighters, and police officers for their heroism on that fateful day.\n\nToday and everyday we will #NeverForget https://t.co/TF8ke9HpiS","date":"Sat Sep 11 14:08:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As families get ready to celebrate #RoshHashanah, I want to wish all who are celebrating a sweet, happy and healthy New Year – Shanah Tovah U’Metukah. https://t.co/WRAXUo0uFL","date":"Mon Sep 06 19:45:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"On #LaborDay, we recognize the achievements of America’s labor movement and reaffirm our resolve to continue the fight for workers’ rights.\n\nThrough such transformative actions like passing the #PROAct, @HouseDemocrats continue to honor and support American workers. https://t.co/539eJQEK4V","date":"Mon Sep 06 17:10:46 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Very sad to hear of the passing of tremendous Valley activist, Elaine Berke. Her leadership in Jewish institutions, as well as her support of @csunorthridge, will have long-lasting impacts. My deepest condolences to her family.","date":"Fri Sep 03 21:45:36 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today marks the 30th anniversary of the declaration of independence of #Artsakh. As a proud Member of the Congressional Armenian Caucus, I stand in solidarity with the people of Artsakh. https://t.co/Ny8QAhCcjg","date":"Thu Sep 02 18:30:11 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The failure of #SCOTUS to stop #SB8 is an egregious affront to women’s rights, health and reproductive freedoms. (1/2)\nhttps://t.co/MR6Jm48v2s","date":"Wed Sep 01 23:28:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Congress can act now, without waiting for action from SCOTUS, by passing the Women's Health Protection Act #WHPA -- a federal bill that will protect the right to access abortion care throughout the U.S. which I helped introduce. (2/2)","date":"Wed Sep 01 23:28:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Was pleased to join my colleagues on the Congressional Ukraine Caucus in welcoming Ukrainian President Zelensky @ZelenskyyUa to the Capitol during his official visit to Washington. https://t.co/NpOYEfV8H0","date":"Wed Sep 01 21:43:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Saddened to hear of the passing of legendary actor and the Valley's own, Ed Asner. My thoughts are with his family during this difficult time.\n\nIt’s been an honor to represent him in Congress. He will be missed.\nhttps://t.co/FYGy6d1cwE","date":"Tue Aug 31 15:06:39 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The historic #ChildTaxCredit, championed by @HouseDemocrats @SenateDems &amp; @POTUS, kept 3 million children out of poverty in just its first round of payments.\n\nWe will continue to build on this success and #BuildBackBetter #ForThePeople.\nhttps://t.co/41LZT0zBbe","date":"Mon Aug 30 19:46:07 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/YvGOcF1fDo","date":"Sun Aug 29 02:14:41 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We commemorate the 58th anniversary of the #MarchOnWashington during a time where voter suppression laws are sweeping the nation. \n\nAs we mark this solemn day, we must honor the Civil Rights heroes by passing:\n\n🤝HR1 the For The People Act\n\n🗳️HR4 the John Lewis Voting Rights Act","date":"Sat Aug 28 16:24:51 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Reminder: This will NOT immediately impact California renters. The state’s eviction moratorium remains in effect until September 30th and the City of Los Angeles eviction protections remain in effect until August 1st, 2022. (2/2)","date":"Fri Aug 27 15:47:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"A devastating blow to thousands at risk of eviction during a pandemic. We'll continue our work to ensure the immediate disbursement by states and localities of the over $45 billion allocated by Congress for rental assistance. (1/2)","date":"Fri Aug 27 15:47:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Does Kevin doubt our troops face imminent hostilities? (2/2) https://t.co/v85eVra32w","date":"Thu Aug 26 23:11:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@GOPLeader says we should be called back to D.C. to pass Rep. Gallagher's bill to prohibit withdrawal until every American is out. Fails to mention the bill allows withdrawal if the Sec Def certifies that our troops “face imminent hostilities\". (1/2)\nhttps://t.co/QNiygHS48r","date":"Thu Aug 26 23:11:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Deeply saddened to learn of the deaths of U.S. servicemembers and civilians by the terrorist attacks in Kabul. We mourn their loss and will forever honor their sacrifice. My prayers are with our brave servicemembers who are continuing these vital evacuations.","date":"Thu Aug 26 20:38:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Was pleased to join the Southland Regional Association of Realtors @SouthlandAOR virtual forum on housing issues. I discussed L.A. city's efforts to better distribute federal rental assistance and steps Congress should take to expand the supply of affordable housing.","date":"Wed Aug 25 20:49:45 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Driven by the Big Lie, states across the country are ramping up efforts to restrict the right to vote. Congress has the power and the duty to act and that's why I was proud to help introduce and pass the #JohnLewisVotingRightsAct \n\nWe must #RestoreTheVote https://t.co/QX4eDy8HJx","date":"Tue Aug 24 23:48:25 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Tonight @TuckerCarlson attacked @SpeakerPelosi for not wearing a mask OUTSIDE, and juxtaposes video of Pelosi saying masks are required INSIDE. Guess he figures people are listening to his show on SiriusXM radio. You have to close your eyes to not see through Tucker’s arguments.","date":"Tue Aug 24 02:22:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Payments from the historic expansion of the #ChildTaxCredit secured by @HouseDemocrats &amp; @POTUS in the #AmericanRescuePlan are being delivered!\n\nAre you wondering if you qualify for monthly #ChildTaxCredit payments? Use this tool to check your eligibility:\nhttps://t.co/5b9rISrsAT","date":"Mon Aug 23 21:58:41 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Important meeting with my Afghan-American constituent Hayat Jalala and leader @itsmk786 at Brent’s Deli’s outdoor patio. We discussed helping those American citizens and others who are in #Afghanistan presently. https://t.co/fnypGS6ETr","date":"Sat Aug 21 04:47:18 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pakistan's military budget is $8.8 billion.\n\nIn 2021, the U.S. sent $36.2 million in economic aid to Pakistan, 0 went to their military.\n\nIn 2020, $87.1 million in economic aid was sent to Pakistan, $39.6 million to their military. (2/3)\n\nSource: https://t.co/k9EUgCXyiK","date":"Sat Aug 21 03:09:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"While @TuckerCarlson endorses the statement that we pay Pakistan's entire military budget, in fact our total government to government aid or military aid to Pakistan in the current and prior year is a tiny percent of its military budget. (3/3)","date":"Sat Aug 21 03:09:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"True to form, @TuckerCarlson believes something is right at face value without \"testing it against anything\", such as reality. (1/3) https://t.co/67Ao1T9tEl","date":"Sat Aug 21 03:08:59 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"No better place and partner to discuss Valley policy with than @AsmJesseGabriel at @brentsdeli outdoor patio. https://t.co/WERUEupyz7","date":"Fri Aug 20 23:29:48 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As we continue to monitor the crisis in #Afhganistan, it's imperative that we do all we can to protect U.S. citizens and our loyal Afghan partners who are still in harm's way. (1/2)","date":"Fri Aug 20 18:50:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"My constituent services team remains in constant contact with the State Department and Consul officers in order to identify people who need to be evacuated from #Afghanistan. If you live in CA-30 and know of someone who needs help, please contact my office. (2/2)","date":"Fri Aug 20 18:50:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to help commemorate the completion of @AerojetRdyne’s major expansion of its San Fernando Valley facility that will play a critical part in the future of NASA and human space exploration. https://t.co/kTyUtW00If","date":"Wed Aug 18 20:15:54 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As the situation in #Afghanistan continues to develop, I stand ready to assist constituents regarding evacuations of loved ones from Afghanistan and other issues. \n \nPlease contact my office if my staff and I can assist.  https://t.co/7pasaRRqw5","date":"Mon Aug 16 19:10:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, August 15th, is #IndiaIndependenceDay marking the 75th year of India’s independence from British colonial rule. As Co-Chair of the House India Caucus, I will continue to work to further strengthen the U.S.-India relationship. #IndiaAt75","date":"Sun Aug 15 16:34:57 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"ICYMI: I joined @IssuesOn1 on @SpecNews1SoCal earlier this week to discuss some of the vital issues facing our nation, such as what the #InfrastructureBill means for the Valley and Los Angeles, the #ChildTaxCredit, and the situation in #Afghanistan. \n\nhttps://t.co/aD7EOERz2H","date":"Sun Aug 15 01:36:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The tragedy reminds us of the importance of gun safety at the federal level. While California has adopted sensible laws, the assailant brought his arsenal from Washington State. (2/2)","date":"Tue Aug 10 20:23:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today we commemorate the anniversary of the mass shooting at the North Valley Jewish Community Center &amp; Chatsworth.\n\nOn this solemn anniversary, &amp; in honor of the memory of Joseph Ileto &amp; the survivors, we must reaffirm our resolve to combat hate &amp; work to end #GunViolence (1/2)","date":"Tue Aug 10 20:23:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today’s #IPCC #ClimateReport is a call to action. This Congress, I have worked with my colleagues on the @HouseScience to bring back #ScientificSolutions to policymaking. \n\nWe must do more to #ActOnClimate and combat the climate crisis before it’s too late.","date":"Mon Aug 09 22:24:32 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@TuckerCarlson claims that no one is fit for high public office unless they’re a parent. His guest @JDVance1 then particularly referenced @VP Harris, who is a stepmother to Ella and Cole.\n\nI wonder if they are willing to apply the same standard to George Washington. (1/2) https://t.co/NylGaPJx23","date":"Fri Aug 06 18:12:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"George Washington was the father of our country, and a stepfather to the children of Martha Washington. \n\n@TuckerCarlson &amp; @JDVance1 hate the current @VP so much they are willing to insult our first President. (2/2)","date":"Fri Aug 06 18:12:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We discussed commemorating the 30th anniversary of Ukraine's modern independence and U.S. support for #Ukraine when it faces aggression from Russia. (2/2)","date":"Thu Aug 05 22:29:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to meet with @DmytroKuleba, Minister for Foreign Affairs of Ukraine, and @OMarkarova, Extraordinary and Plenipotentiary Ambassador of Ukraine to the U.S. (1/2) https://t.co/FIml8IFnY4","date":"Thu Aug 05 22:29:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Greatly saddened by the passing of @AFLCIO President Richard Trumka. \n\nMay his tremendous legacy as a champion for American workers inspire us to rededicate ourselves to fighting for working families.","date":"Thu Aug 05 17:38:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Yesterday I was pleased to meet with Pakistani National Security Adviser Dr. Moeed Yusuf @YusufMoeed. We discussed Afghanistan and the economic relationship between the U.S. and Pakistan. Thank you to @AsifMahmood90 for organizing this lunch. https://t.co/U3WyP8sJzQ","date":"Thu Aug 05 15:42:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"At the rate things are going, L.A. will not be able to finish distributing federal money to help tenants and landlords until early 2023. This is a disaster for tenants and landlords. This is not L.A.’s fault. L.A. is doing better than most other cities. (1/2)","date":"Wed Aug 04 22:26:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Treasury’s rules are too complex. We saw this coming. That’s why in January I joined @RepAOC and @RepBowman in sending a letter calling on Treasury and HUD to streamline the process to get people the help they need before they are facing eviction. (2/2)","date":"Wed Aug 04 22:26:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing a very happy 60th birthday to President @BarackObama! https://t.co/oEEnYliVi8","date":"Wed Aug 04 20:35:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Also discussed with @RepJimmyGomez efforts to speed up LA City's disbursement of the $330 million of renters' aid money we all secured for the city. (2/2)","date":"Tue Aug 03 22:52:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Many of us have been pushing the Administration to protect tenants. Good to join @RepCori @AOC @RepJimmyGomez @RepMondaire as we awaited the announcement from the CDC. (1/2) https://t.co/9yMuUiSoiZ","date":"Tue Aug 03 22:52:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"@aleeagain @RepCori @aleeagain we will keep fighting on this, but please make sure your neighbors are aware they are likely protected under the California statewide eviction ban which was recently extended. They can find more information here: https://t.co/3lhyHxtVvi","date":"Mon Aug 02 20:56:12 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We continue to fight to extend the national #EvictionMoratorium. However, California tenants should not be fooled. CA tenant protections to prevent evictions for failure to pay rent due to a #COVID19 related hardship have been extended until Sept. 30.\n\nhttps://t.co/3lhyHxtVvi","date":"Mon Aug 02 20:24:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"These funds will address community needs across the Valley including improvements to our public parks, funds for at risk youth, additional resources to address homelessness, and additional support to aid in our recovery from the #COVID19 pandemic. (2/2)","date":"Fri Jul 30 22:22:25 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to the family members, Ismael Ileto, Donna Finkelstein, Stewart Kwoh, Jerry Wayne, @LAPDHQ, the @USPS, @PaulKoretzCD5, @AsmChristySmith, @ASMGabriel for participating in today’s commemorative ceremony. Congress has the power to prevent this all too common violence. 3/4 https://t.co/PueUl5S6CL","date":"Sun Aug 11 00:02:57 +0000 2019","user_id":"30216513"},{"handle":"BradSherman","text":"Proud to announce that nearly $9 million in federal funds for projects in the San Fernando Valley that I requested have been included in legislation passed by the House. (1/2)\nhttps://t.co/C9xJp6YsXC","date":"Fri Jul 30 22:22:25 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As a co-sponsor of @RepCori's \"Protecting Renters from Evictions Act of 2021\", I stand with Rep. Bush &amp; my Democratic colleagues working to extend the federal #EvictionMoratorium.\n\nAlthough the CA eviction moratorium is valid until Sept. 30, we MUST extend the federal moratorium.","date":"Fri Jul 30 21:33:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The passage of this bill represents an instance of Congress proactively moving to fix an impending problem. Failure to transition away from #LIBOR will leave parties unable to calculate the interest due on $10 trillion of debt instruments, a systemic risk to the economy. (2/2)","date":"Thu Jul 29 22:03:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I greatly appreciate the support of Chairwoman @RepMaxineWaters and my colleagues advancing my bill, the \"Adjustable Interest Rate (#LIBOR) Act of 2021\" through the Financial Services Committee. (1/2)","date":"Thu Jul 29 22:03:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Report from the floor of the House. Republicans are angry about having to be on the floor wearing masks. So they are engaging in dilatory tactics that will keep us all on the floor. Wearing masks.","date":"Thu Jul 29 19:48:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to meet #MadeleineFugate from Studio City, a bright and talented student who created the remarkable #COVID19 Memorial Quilt to commemorate all those we lost to the pandemic. \n\nAs Madeleine aptly said, \"They aren't numbers, they're people...we need to remember them.\"","date":"Wed Jul 28 21:47:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@Varneyco show part of the clip and distort it. They don't have the courage to bring me on.\n\nIt's simple: if you defund cities, you defund police.","date":"Tue Jul 27 22:01:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today we celebrate 31 years since the #AmericansWithDisabilitiesAct became law, which provided better accessibility for those with disabilities.\n\nToday must also be a day where we recommit ourselves to the work that remains in order to achieve the full promise of the ADA. #ADA31","date":"Mon Jul 26 18:42:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"ICYMI: Catch my appearance from earlier today where I brought some reason and truth to @FoxNews. \nhttps://t.co/RmNBOO4vV7","date":"Sun Jul 25 01:54:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I will be joining @FoxNews today at 12:30 PM EST (9:30 AM PS) to discuss the Congressional negotiations over our national #infrastructure.","date":"Sat Jul 24 14:06:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to meet with Texas State Representative @GeneforTexas, who is among the Texas House Democrats trying to stop dangerous, GOP-backed voting bills. We had a productive conversation on protecting voting rights across the country. https://t.co/DYRMBqKnI1","date":"Thu Jul 22 20:26:32 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Learn more about last night's event below. (2/2)\nhttps://t.co/nLv14L12aE","date":"Thu Jul 22 18:36:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to the thousands of Valley residents who joined our Telephone Town Hall last night! It's always a spirited and productive discussion on the many critical issues we face together. (1/2) https://t.co/voJofwtWhA","date":"Thu Jul 22 18:36:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now!","date":"Thu Jul 22 02:00:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting in 1 hour at 7 PM Pacific!","date":"Thu Jul 22 01:00:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us tonight for our Telephone Town Hall starting at 7:00 PM Pacific where we'll discuss all the critical issues facing Congress. \n\nWe'll be joined by Dr. Lynn Goldman, Dean of @GWpublichealth to update us on our fight against #COVID19. https://t.co/Kuz8JiJNU4","date":"Wed Jul 21 21:17:15 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Proud to be a part of this year’s @USProgressives Caucus, a group dedicated to fighting hard everyday for the American people. https://t.co/0HWMTD6L1X","date":"Wed Jul 21 20:14:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The House passed two important bills I helped to introduce, H.R. 826 and H.Res. 294. Both support reunions for the 100,000 or more Americans who are still divided from family members in North Korea.","date":"Tue Jul 20 16:28:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us this Wednesday July 21 for our Telephone Town Hall starting at 7 PM to update you on all the issues facing Congress. \n\nWe'll be joined by Dr. Lynn Goldman, Dean of @GWpublichealth who'll update us on the fight against #COVID19\n\nRSVP/Submit a Q at: https://t.co/1snLNRj3hZ","date":"Mon Jul 19 21:47:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"It was a great weekend of events welcoming India’s Ambassador @SandhuTaranjitS to SoCal.\n\nThanks to hosts India Assoc. of L.A., Dr. Vatsala &amp; Nadadur Kumar and Dr. Amarjit Marwah for bringing our people and our nations closer together. https://t.co/gAJGMqTTUf","date":"Mon Jul 19 16:05:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"During a @FSCDems hearing, I questioned @federalreserve Chair Powell on the importance of federal legislation on Libor, the significance of wire fraud, and if anti-money laundering standards would be applied to a federal digital currency. \nhttps://t.co/65AaVnsdyJ","date":"Fri Jul 16 19:30:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I questioned @USAID during a @HouseForeign hearing on their plans and efforts to provide aid to #Tigray, where they face ethnic cleansing, famine and perhaps genocide. \nhttps://t.co/BoLIOi1Tr0","date":"Fri Jul 16 19:24:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"During a @HouseForeign hearing, I urged @USAID to bolster U.S. aid to Armenia to help them deal with the aftermath of recent Azeri aggression. \nhttps://t.co/rwKHkCXVGi","date":"Fri Jul 16 19:21:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@ANCA_DC @ARAMAC_DC","date":"Fri Jul 16 13:57:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"My heart is with Betty, Kymberly and the entire Horner family at this time. (2/2)","date":"Thu Jul 15 18:50:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Saddened to learn of the passing of my friend &amp; public servant Larry Horner, #veteran, long time Mayor &amp; City Council member of @CityofTO &amp; key member of my congressional staff. Was honored when Larry agreed to head my Ventura County office in my first 6 years in Congress. (1/2)","date":"Thu Jul 15 18:50:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In One Week: Wednesday, July 21st  \n\nWe'll be hosting a Telephone Town Hall starting at 7 PM Pacific where we'll discuss our economic recovery after #COVID19 and all the critical issues facing Congress. \n\nTo RSVP or Submit a Question, Visit: \nhttps://t.co/1snLNRj3hZ","date":"Wed Jul 14 21:47:42 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Outraged over reports that the Iranian regime planned to kidnap a U.S. citizen. Those responsible must be held accountable, and we must strongly condemn the Iranian regime's continued attempts to silence dissent. \nhttps://t.co/dOmJoHAamQ","date":"Wed Jul 14 20:13:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting July 15, the #ChildTaxCredit payments will be arriving in bank accounts or heading for the mailboxes of families. \n\nLearn more about what these payments will mean for your family at https://t.co/LsfLb0I6e4 (1/2) https://t.co/13LIcD2jn9","date":"Tue Jul 13 19:04:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Families who did not file taxes - you can receive the #ChildTaxCredit too if:\n\na couple👥makes under $24,800\n \nhead of household🏠makes under $18,650\n\nsingle filer👤makes under $12,400\n\nHead to https://t.co/LsfLb0I6e4 to sign up for the payments. (2/2)","date":"Tue Jul 13 19:04:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to Saint Peter Armenian Apostolic Church for hosting me on the Armenian Holiday of Vardavar (Feast of Transfiguration). https://t.co/ReIWNqMzha","date":"Tue Jul 13 03:59:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Always good to attend Sunday services at Holy Martyrs Armenian Apostolic Church with Greg Martayan, Director of Public Safety @PaulKoretzCD5. Was able to discuss the recent recognition of the #ArmenianGenocide and the situation in #Artsakh. https://t.co/U8TlnzEw0I","date":"Mon Jul 12 21:24:59 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Was great to be back at my office’s constituent service booth yesterday for the @ValleyCulturalF concert at Warner Center Park. We’ll be here all summer, bringing government resources direct to Valley residents. https://t.co/21GY6iBJdr","date":"Mon Jul 12 16:44:12 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thanks to @VICASFValley for inviting me to speak at today’s Congressional Luncheon about my efforts to grow our economy and provide support to Valley small businesses.","date":"Fri Jul 09 21:34:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As Co-Chair of the Congressional India Caucus, I look forward to working with @MayorOfLA Garcetti to strengthen the relationship between the world’s oldest and largest democracies.","date":"Fri Jul 09 20:32:57 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/AL6fug2Fax","date":"Fri Jul 09 19:31:07 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"It was great to talk to Josh Raper, Regional Manager of Southwest Regional Council of Carpenters. (2/2) https://t.co/hxCzapciyE","date":"Thu Jul 08 23:46:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to visit the @SouthwestCarps Sylmar training center this morning. Had a productive conversation about the #AmericanJobsPlan and the importance of passing infrastructure legislation that will create good, union jobs. #SWCarpenters #UnionCarpenters (1/2) https://t.co/Mgz6VQX8mp","date":"Thu Jul 08 23:46:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I urged the @StateDept and @USAID to ensure that food and medicine reaches the people of #Tigray. The U.S. must do more to ensure that assistance reaches those in need in order to stop the unfolding humanitarian crisis. https://t.co/c1jK1xGBIP","date":"Thu Jul 08 02:09:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"“I didn’t vote for this thing that will help you, but it will help you” is #McConnell’s interesting way of highlighting how @POTUS and Congressional Democrats’ #AmericanRescuePlan is helping millions of Americans, including Mitch’s own state.","date":"Wed Jul 07 04:26:35 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@ValleyCulturalF did a great job bringing fireworks and a sense of community at last night’s #July4th Extravaganza. Thanks to the @usairforce for the flyover and for all who turned out to celebrate America’s #IndependenceDay.","date":"Mon Jul 05 21:54:45 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This morning I joined the Valley Village Residents Association in collecting food for the North Hollywood Interfaith Food Pantry.  The Valley’s spirit of volunteerism is always on display, even on a holiday morning. https://t.co/MeM2O3JFCf","date":"Sun Jul 04 21:30:32 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Happy #July4th! \n \nOn a day meant to celebrate Americans’ resilience, I’m proud of the progress we’ve made to get our country back on track. \n\nWishing everyone a happy and safe #IndependenceDay https://t.co/79muUc0xZI","date":"Sun Jul 04 15:07:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"It was a pleasure to speak at St. Mary’s Assyrian Church of the East yesterday evening and address more than 400 youth attending the @ACEYA Annual Youth Conference.  \n\nThanks to my friend Father George for hosting and inspiring. https://t.co/E0TnzD5eZc","date":"Sat Jul 03 17:53:54 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to announce that the House passed a transportation bill with over $21 million that I requested in transportation projects for the San Fernando Valley.","date":"Fri Jul 02 22:41:42 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to announce that today Congress advanced nearly $900,000 in funding that I requested for San Fernando Valley projects. (1/2)\nhttps://t.co/j9UFAdrUUy","date":"Thu Jul 01 20:58:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The funds are to both provide technical assistance to small businesses in the Valley and to reduce fire risks in our region while also restoring public park land. @TreePeople_org @ValleyAlliance (2/2)","date":"Thu Jul 01 20:58:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, during an @FSCDems hearing, I highlighted the threats posed to Americans and the U.S. Financial system by #cryptocurrencies. \nhttps://t.co/oPMFEWyePo","date":"Wed Jun 30 19:21:32 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to participate in a @HouseScience hearing about #wildfires, particularly important in the San Fernando Valley.\n\nThank you to Frank Líma @IAFFGSTLima of @UFLAC  for the guidance and information. \nhttps://t.co/nOVyinDtpx","date":"Tue Jun 29 21:42:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The House passed my Resolution, H. Res. 402, recognizing the devastating impact of #COVID19 in #India and expressing the sense of the House to urgently facilitate assistance. We must work with our global partners to stop the virus everywhere it persists.\nhttps://t.co/glZdfvNLhG","date":"Tue Jun 29 18:48:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Interesting article from my good friend and former colleague from my days practicing law, Professor Dan Morrissey.\nhttps://t.co/oc3WTDdJeG","date":"Fri Jun 25 19:26:38 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I am particularly concerned by efforts in the Texas bill to politicize the post-post election (the challenge to the 2020 election after the recount efforts which seems to have been designed to placate Trump supporters). (2/2)","date":"Fri Jun 25 18:08:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to join a meeting hosted by @RepJayapal   between @USProgressives Members and the Democratic members of the Texas House of Representatives who prevented the Republican Texas voter suppression bill from passing by walking out of their legislative session. (1/2)","date":"Fri Jun 25 18:08:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to the thousands of Valley residents who joined our Telephone Town Hall last night. It was an engaging and productive discussion on the critical issues we're facing together as a nation. \n\nLearn more on last night's event here: \nhttps://t.co/ggCK4UuPQg","date":"Fri Jun 25 17:10:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now!","date":"Fri Jun 25 02:00:25 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting soon at 7:00 PM Pacific our Telephone Town Hall! \n\nTo participate, dial (877) 229-8493 and Enter PIN Code 13402 anytime during the event tonight. https://t.co/k7CzqAq8M1","date":"Fri Jun 25 01:34:15 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us tonight for our Telephone Town Hall starting at 7 PM Pacific where we'll discuss emerging from #COVID19, our economic recovery and other critical issues.\n\nWe'll be joined by Dr. Lynn Goldman, Dean of \n@GWpublichealth \n\nRSVP/Submit a question: https://t.co/Xu1cx6kTtP","date":"Thu Jun 24 20:37:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pressed the @NASA Administrator on cleaning up the Santa Susana Field Lab at today’s Science Committee hearing. We are long past due for a full cleanup of the site.\nhttps://t.co/NlkB7sLjPI","date":"Wed Jun 23 19:04:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I want to thank Kim Kyung-hyup, Chairman of the National Assembly of the Republic of Korea for this plaque. Pictured below is Chairman Kim and Casey Choi, President of #KAPAC. (3/3) https://t.co/EjoCz4JTX3","date":"Wed Jun 23 04:20:05 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I want to thank the Forum and the 186 members of the National Assembly of the Republic of Korea for their support. Thank you #KAPAC for making this connection. (2/3)","date":"Wed Jun 23 04:20:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Great to meet with a delegation from the National Assembly of the Republic of Korea who are members of the Forum for Peace and Diplomacy. I introduced HR 3446 Peace on the Korean Peninsula Act which calls for a formal end to the Korean war and establishing liaison offices. (1/3) https://t.co/pBy8qDSAqO","date":"Wed Jun 23 04:20:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us for our Telephone Town Hall this Thursday, June 24 @ 7 PM Pacific where we'll discuss emerging from #COVID19, our economic recovery &amp; other critical issues.\n\nWe'll be joined by Dr. Lynn Goldman, Dean of @GWpublichealth.   \n\nRSVP/Submit a question: https://t.co/henYXMkPvr","date":"Wed Jun 23 00:58:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"More than two-thirds of Americans support protecting our freedom to vote and oppose billionaires secretly buying elections. 100% of Senate Republicans just disagreed. \n\nThis isn’t the end of the fight. I'll continue to work to protect our freedom to vote #ForThePeople. https://t.co/xrGH5BkUiF","date":"Tue Jun 22 22:40:45 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We worked together to curb #airportnoise, efforts which are unfortunately as necessary as ever today. (2/2)","date":"Tue Jun 22 00:47:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Saddened to learn of the passing of #GeraldSilver, who worked for decades at the Homeowners of Encino and many other organizations to improve the quality of life for all Valley residents. (1/2)\nhttps://t.co/L0jJmWUpfB","date":"Tue Jun 22 00:47:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/G1hG2bzAKP","date":"Mon Jun 21 17:26:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing all the dads out there a happy #FathersDay! https://t.co/yiQbt3yQmK","date":"Sun Jun 20 19:35:57 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"#Juneteenth has stood as a proud celebration of freedom for African Americans, but it stands for so much more than just a special day. This #JuneteenthDay must be a day of reflection that motivates our nation towards meaningful action to achieve justice and combat inequalities.","date":"Sat Jun 19 17:24:54 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to meet with Ming Chiang who gave me a stuffed #Formosan Black Bear, a great reminder to #KeepTaiwanFree, as it is embroidered on the back! Thank you to @FAPA_HQ for making the connection. https://t.co/UlVaLmLevj","date":"Thu Jun 17 22:44:35 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In One Week: Thursday, June 24 @ 7 PM Pacific\n\nWe'll be hosting a Telephone Town Hall on our emergence from #COVID19, our economic recovery, including @POTUS's #AmericanJobsPlan, and other issues facing Congress. \n\nTo RSVP or to submit a question, visit:\n\nhttps://t.co/1snLNRj3hZ","date":"Thu Jun 17 19:12:17 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/8LaJBYJdLh","date":"Thu Jun 17 17:43:38 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Appears to be another human rights abuse by Erdogan. Government of Kyrgyzstan should not allow anyone to be forcibly held in an embassy or extradited without proof and due process of law. (1/2)\nhttps://t.co/0uj4K0bSbl","date":"Thu Jun 17 17:43:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The #ACA, and the transformational protections it provides every American, is here to stay. \n\nWe should work to build on the progress of the Affordable Care Act so that every American can get the care they need.","date":"Thu Jun 17 15:41:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As Chair of the Subcommittee on Investor Protection and Capital Markets, I am proud to say that the bills in this package were first considered in this Congress during a hearing we held in February. (2/2) See video of the hearing: https://t.co/wHQOjQNVCG","date":"Wed Jun 16 22:42:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, the House passed a package of important legislation to make public companies more accountable and transparent to their shareholders by establishing new disclosures related to climate change, workforce investments, political spending, and tax avoidance. (1/2)","date":"Wed Jun 16 22:42:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you @mackenziescott \nhttps://t.co/ZRJGaFqMBA","date":"Tue Jun 15 19:03:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, with an estimated 70% of the state vaccinated and #COVID19 case rates continuing to decline, California is re-opening. \n\nFor more info on the @CountyofLA's new guidelines, watch @lapublichealth's reopening town hall: \nhttps://t.co/Ljn9YZHEsq\nhttps://t.co/Nnqzk8WV92","date":"Tue Jun 15 18:32:15 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Very concerned over reports of the extrajudicial disappearance of Sanan Khan Qureshi in #Sindh. It is important that his rights, and the rights of all of those who have been arrested following recent protests, are respected in accordance with the rule of law.","date":"Mon Jun 14 18:26:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to announce that the House Committee on Transportation and Infrastructure approved more than $21 million for San Fernando Valley road improvements and mass-transit projects that I requested. \nhttps://t.co/K8AGSA4AkZ","date":"Fri Jun 11 21:27:36 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Actually we are more united than at any time in my 25 years here. Our whole leadership is united behind this statement below. Democratic Members are united behind our leadership. Republicans just fired their #3 leader. Who is in disarray? (2/2) https://t.co/xJGb2Noe1h","date":"Fri Jun 11 19:39:59 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Republican Members of Congress say that the Democratic Caucus is in disarray because we don't all agree on the Middle East and some other issues. (1/2)","date":"Fri Jun 11 19:39:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Those that received their first dose of the #COVID19 vaccine at @csunorthridge can get their second doses at the Balboa Sports Complex site.","date":"Thu Jun 10 01:46:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We should likewise send our stockpile of AstraZeneca vaccines to India and other countries facing a surge as long as U.S. FDA, or the health officials in the recipient countries, determine it is safe and effective. (2/2)","date":"Wed Jun 09 21:12:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I welcomed @POTUS's announcement in May regarding the sharing of unused Covid vaccines. The current surplus stockpile of J&amp;J vaccines should be shared immediately with countries combating #COVID19 surges, such as India. (1/2)","date":"Wed Jun 09 21:12:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"North Korea threatens South Korea. China threatens Taiwan. Japan faces concerns about both. China has hardly shown its gratitude for our efforts. It has subsidized North Korea and thereby subsidized the North Korean nuclear program. (2/3)","date":"Wed Jun 09 19:12:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"For half a century, America has successfully persuaded Japan, South Korea and Taiwan to forgo efforts to obtain nuclear weapons. This effort has been successful, even though our three allies face real threats from countries that possess nuclear weapons. (1/3)","date":"Wed Jun 09 19:12:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"China's bellicose attacks against Taiwan make it more difficult to persuade that country to forgo nuclear weapons. (3/3)","date":"Wed Jun 09 19:12:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"America stands up for the Muslim Uyghurs. Then America gets attacked for being anti-Muslim. Meanwhile...\nhttps://t.co/23fzWcofKy","date":"Tue Jun 08 14:19:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"It is not a far out idea that China did “gain of function” research creating #COVID that could readily infect humans. Could have done it for medical research or to invent bio weapon. What is a far out idea is that it was released intentionally. (1/2)\nhttps://t.co/gMwwWnvPC3","date":"Mon Jun 07 19:26:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"A 2018 inspection by the U.S. State Department showed the lab was sloppy and it’s not clear that anyone did anything to change that. They just kept working on dangerous viruses. (2/2)\nhttps://t.co/wctbc57o7H","date":"Mon Jun 07 19:26:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In response to a Sherman question, @SecBlinken reiterates American commitment to replenishing Israel rocket defenses. #IronDome (2/2)","date":"Mon Jun 07 17:08:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sherman tells @SecBlinken at @HouseForeign hearing: every #Hamas rocket is a war crime; its sole purpose is to kill as many Jews as possible. (1/2)\nhttps://t.co/1Y40AAMqS3","date":"Mon Jun 07 17:08:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sherman tells @SecBlinken at @HouseForeign hearing thank you for helping #India with #COVID19 \nhttps://t.co/tPBiWwkZyo","date":"Mon Jun 07 17:08:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sherman to @SecBlinken at @HouseForeign hearing: Repeal the #HelmsAmendment and provide abortion aid for poor women around the world. \nhttps://t.co/XkqXcs4ybA","date":"Mon Jun 07 17:08:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sherman to @SecBlinken at @HouseForeign hearing: fight for full rights for #Rohingya Muslims. \nhttps://t.co/dDU5nznso4","date":"Mon Jun 07 17:07:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sherman to @SecBlinken at @HouseForeign hearing: Reverse 907 waiver. Stop all arms sales to #Azerbaijan \nhttps://t.co/B71SycroXF","date":"Mon Jun 07 17:06:42 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/B0jvpj23WM","date":"Mon Jun 07 02:35:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We need to reverse on appeal the ruling of this one federal judge. The lives of Californians depends upon it. \nhttps://t.co/OZwSMEw6ol","date":"Sun Jun 06 02:30:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Happy #Pride Month - a time to celebrate the progress made for #LGBTQ+ equality, and a time to raise awareness and reaffirm our commitment towards the work that still needs to be done to achieve equality for all.","date":"Wed Jun 02 05:09:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’m deeply saddened over the tragedy that took place today at the LA County Firefighter Station 81 in Agua Dulce. Our love and support goes out to the victims and to all the hardworking men and women of the @local1014 family.","date":"Tue Jun 01 22:29:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today marks the centennial of the 1921 #TulsaRaceMassacre, where a thriving Black community in Tulsa, Oklahoma was ruthlessly attacked by a white supremacist mob—as many as 300 Black Americans were killed and 10,000 were left homeless.","date":"Tue Jun 01 22:24:51 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/TydDrKFoqH","date":"Mon May 31 22:13:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Congratulations \nhttps://t.co/7MT2s31LAS","date":"Mon May 31 22:11:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This #MemorialDay, we honor the lives of those who made the ultimate sacrifice on behalf of our country and our freedom. Let us also use our voices every day to thank our active military personnel, who continue to answer the call.","date":"Mon May 31 18:24:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I questioned Goldman Sachs CEO David Solomon on the collapse of Archegos Capital, and whether large wealthy investors get to play by a different set of rules. See the exchange here: \nhttps://t.co/1IYoOf5ITL","date":"Fri May 28 01:44:42 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"See CEOs of six top U.S. banks affirm the need for federal legislation to avoid a chaotic transition away from LIBOR. Look forward to working with my colleagues to pass this bill and resolve this risk to our financial system.\nhttps://t.co/reITzYLgwr","date":"Fri May 28 01:44:01 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sindh represents a case study as to the debilitating impacts of both a changing climate and human rights abuses. I want to thank my colleagues @RepAdamSchiff @repmarkpocan @CongressmanRaja @RepSchneider @RepRaskin @RepMaloney for joining me on this important letter. (2/2)","date":"Thu May 27 22:40:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As Chair of the Sindh Caucus, I led a letter to @SecBlinken urging the Administration to pay attention to the human rights abuses in #Sindh, and to take immediate action to combat #climatechange. (1/2) https://t.co/2PkAw11h2n","date":"Thu May 27 22:40:05 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We need to do more than mourn the #SanJose victims. We need common sense gun safety laws, and help for the mentally ill. While further analysis will show if such measures would have stopped this recent tragedy - we already know these measures will save lives.","date":"Thu May 27 19:07:27 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Excellent working dinner with India's External Affairs Minister @DrSJaishankar and Ambassador @SandhuTaranjitS. Learned how #India is fighting #COVID19 and working to disentangle its economy from China.","date":"Thu May 27 19:06:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This is an opportunity to discuss how the U.S. can further help India as it continues to battle #COVID19, global vaccine production, and security issues in the Indo-Pacific. (2/2)","date":"Wed May 26 22:11:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I look forward to meeting with India’s External Affairs Minister @DrSJaishankar, Ambassador @SandhuTaranjitS, and other leaders concerned with the U.S.-India relationship, for dinner this evening. (1/2)","date":"Wed May 26 22:11:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Last year following this tragedy, I joined @RepKarenBass and others to introduce the George Floyd #JusticeInPolicing Act. The #JusticeInPolicing Act needs to become law. Now. (2/2) https://t.co/lyBtgpve6R","date":"Tue May 25 21:52:48 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, we remember the day that #GeorgeFloyd was murdered at the hands of the police. “My Daddy changed the world,” said Gianna Floyd, daughter of George Floyd. George Floyd did just that, and now we must do the same. (1/2) https://t.co/VH4QqNOyAa","date":"Tue May 25 21:52:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The Lab-Leak Theory has always seemed credible to me. \"Leak\" should not be confused with intentional propagation, which seems far less likely. \nhttps://t.co/jqT0zWorj7","date":"Tue May 25 18:48:15 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"#MarjorieTaylorGreene's equation of masks to the Holocaust is as absurd as it is offensive. Simplistic comparisons like this demean the memory of the victims of the Shoah. She also discourages safety measures that save lives. \nhttps://t.co/SaTRDc8Vyr","date":"Tue May 25 17:19:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Excellent article: “How influencers have legitimized anti-Semitism”\n\nhttps://t.co/EmmMCunYGI","date":"Tue May 25 16:48:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We seek justice for Daniel Pearl. \nhttps://t.co/oIDf4g3NYx","date":"Tue May 25 15:32:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) See my 5 min Q &amp; A from the hearing, here: \nhttps://t.co/XI4fJtOlkp","date":"Mon May 24 21:31:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(1/2) Today, as Chair of the Subcommittee on Investor Protection, Entrepreneurship, and Capital Markets, I held a hearing to spotlight gaps in our investor protections around IPOs, SPACs, and direct listings. See my remarks below:\nhttps://t.co/eU2JeTwema","date":"Mon May 24 21:31:42 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Congratulations \nhttps://t.co/KSMDisOEhP","date":"Mon May 24 20:29:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I will be joining @FoxNews today at 1 PM EST to discuss @POTUS’s #AmericanJobsPlan and the Israeli-Hamas ceasefire.","date":"Sun May 23 16:26:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/JFgmTPV0uL","date":"Sat May 22 17:02:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now!","date":"Fri May 21 02:00:02 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Our Telephone Town Hall will be starting soon at 7 PM Pacific. \n\nTo participate, dial (877) 229-8493 and enter PIN Code 13402 anytime during the event tonight. \n\nWe'll be joined by Dr. Lynn Goldman, Dean of the @GWpublichealth https://t.co/Fw3MGJJV73","date":"Fri May 21 01:19:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Good news.","date":"Thu May 20 20:23:57 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us tonight at 7 PM Pacific for our Telephone Town Hall where we'll discuss our efforts to defeat #COVID19, rebuild our economy and all other issues facing Congress.\n\nWe'll be joined by Dr. Lynn Goldman, Dean of the \n@GWpublichealth","date":"Thu May 20 17:28:17 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I spoke on the House Floor against recent anti-Semitic violence in Los Angeles, and recent anti-Semitic rhetoric in Washington D.C. \nhttps://t.co/0AJyRz4uNp","date":"Wed May 19 23:33:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us tomorrow, May 20th, at 7 PM Pacific for our Telephone Town Hall. \n\nTo participate, dial (877) 229-8493 and enter PIN Code 13402 anytime during the event tomorrow night. \n\nThere's still time to RSVP or Submit a question at: https://t.co/1snLNRj3hZ","date":"Wed May 19 22:57:52 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’m deeply disturbed by the anti-Semitic attack in West L.A., as well as the vandalism at a kosher restaurant in Sherman Oaks, and it is appropriate that they are being investigated as hate crimes. (1/2) \nhttps://t.co/20VazTJjuS","date":"Wed May 19 21:36:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We must stand up to #Antisemitism in all its forms, wherever it occurs, including our own backyard. (2/2) @LA_ADL @ICANAction @JFedLA @LAPDHQ","date":"Wed May 19 21:36:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Congratulations \nhttps://t.co/2nMZITqV0r","date":"Wed May 19 18:01:15 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The House passed my Homebuyer Assistance Act of 2021 to ease the home buying process for the thousands of first-time and low-income borrowers who rely on the FHA mortgage program. See my floor statement here:\nhttps://t.co/XcYF5zV6Ds","date":"Wed May 19 04:34:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to say that the House passed @jahimes's Insider Trading Prohibition Act. It is well past time we strengthen our rules against insider trading by establishing a clear, statutory prohibition.","date":"Wed May 19 04:10:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today marks the 12th anniversary of the end of the 26-year civil war in Sri Lanka. Tens of thousands of #Tamils were forcibly disappeared, displaced &amp; killed. (1/2)","date":"Wed May 19 00:22:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I commend the @UN Human Rights Council for prioritizing the collection &amp; preservation of evidence related to such human rights violations. I urge the U.S. to work with the @UN to establish accountability for the grave crimes committed during the war in Sri Lanka.  (2/2)","date":"Wed May 19 00:22:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Join us for our Telephone Town Hall on Thursday May 20 starting at 7 PM Pacific where we’ll discuss our efforts to rebuild our economy and finally defeat #COVID19. \n\nWe’ll be joined by Dr. Lynn Goldman, Dean of @GWpublichealth \n\nRSVP/Submit a Question: \nhttps://t.co/1snLNRj3hZ","date":"Tue May 18 02:27:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Greatly concerned over reports of Azeri troops crossing over into #Armenia. The United States must unequivocally condemn this violation of international law, and work for the withdrawal of Azeri forces from Armenian territory. \nhttps://t.co/VLTjAeqwou","date":"Fri May 14 17:57:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In One Week: \n\nWe'll be hosting a Telephone Town Hall on Thursday May 20th starting at 7 PM Pacific where we'll discuss our efforts to finally defeat #COVID19, rebuild our economy and fully re-open our nation. \n\nTo RSVP or Submit a Question, visit: https://t.co/1snLNRj3hZ","date":"Fri May 14 03:33:07 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I spoke on the House Floor supporting #Israel in the wake of the rocket attacks by Hamas. \nhttps://t.co/Bd5zIwpBD9","date":"Thu May 13 22:42:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Proud to work with @RepCardenas to deliver $196 million in emergency funding for colleges and universities in the San Fernando Valley. \n\nThese funds will provide direct relief to students in the Valley, helping them to continue their education and to graduate on time.","date":"Thu May 13 20:34:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/4kFJKa4Isi","date":"Thu May 13 16:33:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today @ClimateEnvoy John Kerry appeared before the @HouseForeign to discuss the global response to climate action. I proposed tariffs on #China, particularly if they don't reduce global warming. China is now building a coal-fueled power plant every week. \nhttps://t.co/YPUiO90OFE","date":"Wed May 12 16:13:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"To anyone having trouble getting to a  #COVID19 vaccination site, all rides will be free until July 4th. \n\nThe program will start in 2 weeks, when Uber/Lyft users will be able to request a free ride to and from a vaccination site directly in the Uber/Lyft apps.","date":"Tue May 11 21:33:46 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As we emerge from the #COVID19 pandemic and work to restore our normal way of life, having accurate information is critical.\n\nThat's why we'll be hosting a Telephone Town Hall on May 20th starting at 7 PM Pacific.\n\nTo RSVP or submit a question, visit:\nhttps://t.co/1snLNRj3hZ","date":"Tue May 11 01:01:57 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The latest rocket fire underscores the need for Israel’s missile defense programs, such as Iron Dome. I will continue to be a strong supporter of robust U.S. funding for these critical programs. (3/3)","date":"Mon May 10 19:29:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Hamas is firing these rockets in an effort to kill as many Israeli civilians as they can. Each rocket is a war crime, whether it achieves Hamas’ bloody objective or not. (2/3)","date":"Mon May 10 19:29:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I strongly condemn Hamas’ rocket attacks against Israel. \n\nThere is no justification for indiscriminate rocket fire. This only further escalates the situation. (1/3)","date":"Mon May 10 19:29:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Great player. Great man. Not a great decision.\nhttps://t.co/NSnlYuH43e","date":"Thu May 06 22:30:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Jane Boeckmann left an indelible mark in the San Fernando Valley through her work at @Galpinford and many of the Valley's nonprofit organizations. She will be missed. \nhttps://t.co/SD3vLZ9kEy","date":"Wed May 05 23:42:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We’re facing public health, economic &amp; climate crises. We can't afford to let @SenateGOP block progress when lives are on the line. I joined @RepCori, @RepCasten, @RepJasonCrow, and @RepJayapal in calling on the Senate to #EndTheFilibuster. https://t.co/yzLDDNRJ8V","date":"Wed May 05 18:31:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Wishing everyone a happy and safe #CincodeMayo in celebration of Mexican and Mexican-American culture.","date":"Wed May 05 16:06:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"See my questioning of Burma/Myanmar’s dissent @UN Ambassador Kyaw Moe Tun. He speaks eloquently against the coup but, like many democracy advocates from #Burma, gives disappointing answers regarding the #Rohingya. \nhttps://t.co/jnU5gYmmcg","date":"Tue May 04 20:16:27 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I join @valleybeth and the Jewish community throughout the Valley in mourning the passing of Malkah Schulweis. The loving wife of Rabbi Harold Schulweis, z”l, Malkah was a beloved teacher, spiritual guide and friend to so many.","date":"Tue May 04 00:52:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Congratulations\nhttps://t.co/ls7RR317uf","date":"Sun May 02 16:56:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’ve always stood with artists on this issue. \n\nLocal Radio Freedom Act has a nice title, but isn’t a fair bill.","date":"Sun May 02 00:55:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I'm saddened by the tragedy that unfolded at Mt. Meron, Israel last night. My thoughts and deepest sympathies are with the victims and all those affected. \nhttps://t.co/6eAiL02KGm","date":"Fri Apr 30 18:59:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, I joined my fellow India Caucus Co-Chairs and Vice Chairs, @RepRoKhanna @RepSteveChabot @michaelgwaltz, to urge the Biden administration to bolster the United States’ efforts to assist #India as they battle an alarming second wave of #COVID19. \nhttps://t.co/2bvHPsNEbQ","date":"Fri Apr 30 15:51:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"It was an inspirational, interfaith, virtual Iftar gathering tonight, hosted by my friend Mahomed Akbar Khan. I especially appreciated the words of prayer offered by Mohamed, @hyepin and Rabbi Susan Nanus of @wbtla. #Ramadan https://t.co/S6SCpHUM66","date":"Fri Apr 30 03:38:11 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Looking forward this evening to continuing my tradition of joining my Muslim constituents for an Iftar gathering.  Pre-COVID, I hosted an Iftar, #Ramadan break fast meal, at my home, and we’ve gone virtual the last couple years until we can safely gather again.","date":"Fri Apr 30 00:51:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Tonight, @POTUS reminded Americans of the challenges we’ve endured and how we’re uniting to face them head-on. We need to seize this opportunity to build on the vision and goals set by @POTUS in order to address the crises facing our country. #JointAddress","date":"Thu Apr 29 02:22:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Strong speech from a strong and thoughtful leader. Delivery effective. #JointAddress","date":"Thu Apr 29 01:57:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I'm looking forward to hearing, not just about what's been accomplished during Biden's first 100 days, but how we can continue to work on the progress being made on behalf of the American people. (2/2) #BidenAddress","date":"Thu Apr 29 00:25:07 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I'm heading to @POTUS’s first address to Congress tonight. Pleased to be one of 200 people who will be there in-person. (1/2)","date":"Thu Apr 29 00:25:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Looking forward to gathering with @SindhiFDN tomorrow at 4PM at the Lincoln Memorial to mark the end of the #LongMarch4LoveNatureNFreedom. A great opportunity to raise awareness about global human rights and climate change issues!","date":"Wed Apr 28 23:31:38 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We appreciate the Ambassador’s recommendations as to what the Caucus can do to urge the Biden Administration to take further action with respect to vaccine manufacturing, PPE supplies and oxygen concentrators and canisters. (2/2)","date":"Wed Apr 28 20:16:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Great to speak to Ambassador @SandhuTaranjitS today about the #COVID crisis in India with India Caucus leadership @RepRoKhanna @RepSteveChabot @michaelgwaltz. As Democratic Co-Chair of the India Caucus, I am of course committed to helping India at this critical time. (1/2)","date":"Wed Apr 28 20:16:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Also spoke about reducing tensions with China -- while holding them accountable on global warming (building a new coal fueled electric plant every 10 days) and trade. (2/2)","date":"Wed Apr 28 19:16:02 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to have just concluded a briefing with former Secretaries of State @HillaryClinton and @CondoleezzaRice. Spoke about how opening State Department jobs to Civil Service will improve considerably diversity and better everyday experienced diplomats. (1/2)","date":"Wed Apr 28 19:16:02 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I paid tribute to Rabbi Feinstein in 2019. (2/2) https://t.co/cqtTBcGwx1","date":"Wed Apr 28 18:02:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’m sorry to learn of the passing of Rabbi Morley Feinstein, of blessed memory, rabbi emeritus of University Synagogue @UniSynagogue . He was a leader, a teacher and a beacon in our community. I fondly recall attending many services he officiated. (1/2)","date":"Wed Apr 28 18:02:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’m told that just-released annual scorecard put out by the American Conservative Union Foundation (the group who host the CPAC conference) grades my voting record this year with a 0%. Only my F grade from the #NRA has given me more pride.","date":"Tue Apr 27 21:15:27 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The U.S. maintains a moral obligation to assist our ally India as they face severe challenges posed by #COVID19. We must take every necessary step to ensure the Indian people receive the aid and assistance they need in order to emerge from this crisis. \nhttps://t.co/HBCluOOkIC","date":"Tue Apr 27 19:02:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"#Taiwan is an important partner in the fight against #COVID19 and infectious diseases. That’s why I’m proud to join colleagues around the world in urging the @WHO to #LetTaiwanHelp by inviting Taiwan to participate in the 74th World Health Assembly. https://t.co/hWl2o5vnVV","date":"Tue Apr 27 18:10:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Actually California gained almost 2.3 million people. Up about 6%. Hardly a place people are fleeing.","date":"Mon Apr 26 20:56:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"California gained 5% or 1.9 million people over the last 10 years. We lose a seat in Congress because the country grew by over 7%. Trump states gained 4 electoral college votes, while Biden states lost 4. (1/2)","date":"Mon Apr 26 19:40:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"California growing by 5% clearly shows that Republican assertions that \"EVERYONE is leaving\" California are off by about 105%. (2/2)","date":"Mon Apr 26 19:40:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/FDcFYQ3MCa","date":"Mon Apr 26 03:30:10 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Dennis here’s to fifty more years. \nhttps://t.co/l0V4Vu0Vfm","date":"Sun Apr 25 17:32:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As we commemorate today's solemn anniversary and applaud the significant action by President Biden, let us also reaffirm our commitment toward encouraging education and broader public understanding of the facts of the #ArmenianGenocide (2/2)","date":"Sat Apr 24 17:19:07 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, on the 106th Anniversary of the #ArmenianGenocide, @POTUS became the first U.S. President to formally recognize the systematic murder of 1.5 million Armenians as a genocide. (1/2)\nhttps://t.co/zPw1p7Kuo5","date":"Sat Apr 24 17:19:07 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As we celebrate #EarthDay we must continue to fight climate change for future generations. If we don’t act on the #ClimateCrisis now in a meaningful way, our children will inherit an economy and a world beyond their capacity to repair. https://t.co/4nlDMlisP5","date":"Thu Apr 22 20:35:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Enjoyed meeting last evening with the #ValleyVillageResidentsAssociation. \n\nWe spoke about the noise and pollution associated with concentrated flights out of Burbank Airport, the importance of home-ownership and efforts to reform the filibuster. https://t.co/SEkc2iPNGZ","date":"Thu Apr 22 16:55:27 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"After 4 years of bias and bigotry dictating policy, Congress must pass the #NoBanAct to prevent the rampant xenophobia that led to the Muslim Ban from ever becoming law again. \n \nToday, the House is voting to bring the #NoBanAct one step closer to @POTUS’ desk. https://t.co/nO5OdoB7m8","date":"Wed Apr 21 18:42:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"While today’s verdict cannot undo the tragic murder of George Floyd, it is an important step in restoring confidence in our justice system.","date":"Wed Apr 21 00:23:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"It's time! Starting today, all adults in the U.S. are now eligible for a #COVID19 vaccine. \n\nFor your family, friends and neighbors, #PlanYourVaccine","date":"Mon Apr 19 18:51:48 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Certainly this is an important part of the investigation into the Indianapolis tragedy. \nhttps://t.co/WrwSLsh5ww","date":"Sat Apr 17 17:19:11 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@HouseDemocrats already at work to advance a transformational infrastructure package. It’s time to #BuildBackBetter.","date":"Fri Apr 16 18:32:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Perhaps you can make money and hurt your country at the same time — and perhaps some Members of Congress will applaud your efforts. \n\nHere’s the real picture: “Bitcoin, it’s not just for narco-terrorists anymore...it’s for tax evaders too.” https://t.co/JnMcQq73Ek","date":"Fri Apr 16 01:39:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’m proud to join every House Democrat to co-sponsor the Paycheck Fairness Act – a bill that will finally fulfill the promise of #EqualPay https://t.co/aLNlApIPzp","date":"Thu Apr 15 21:25:25 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I applaud the decision by @POTUS to impose new sanctions against Russian debt, policy which parallels legislation advanced by Chairwoman @RepMaxineWaters and I starting in 2019. \n\nWe must make it clear that we'll hold Russia accountable for its actions. \nhttps://t.co/x37i6kak8i","date":"Thu Apr 15 18:54:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sherman attacks Walmart Bank and #Bitcoin\nhttps://t.co/13dr6Z1sE9","date":"Thu Apr 15 17:57:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Beginning today, April 15th, every Californian age 16 and older will become eligible for #COVID19 vaccines.","date":"Thu Apr 15 17:21:41 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today we wish a Happy Independence Day to Israel, a nation that’s faced and overcome many challenges. Israel has stood as a critical ally for 73 years. The U.S.-Israel relationship will only be made stronger in the years to come. #YomHaatzmaut","date":"Thu Apr 15 00:22:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I urged the House Transportation &amp; Infrastructure Committee to include federal funding for a subway through the Sepulveda Pass. Improving the Sepulveda Pass is a priority for the San Fernando Valley, Southern California &amp; our national infrastructure.\nhttps://t.co/PBs3bsQyyl","date":"Wed Apr 14 22:25:36 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"On this historically significant day for Sikhs, I'm wishing our Sikh neighbors, friends and community members a happy #Vaisakhi!","date":"Wed Apr 14 20:01:10 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Ramadan Kareem to all who celebrate. May this month of #Ramadan bring hope, prosperity and peace. #RamadanMubarak","date":"Mon Apr 12 20:50:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today marks the 100th day of House Democrats fighting For The People in the 117th Congress. In just four months, we delivered #COVID19 relief, supported our Dreamers and farmworkers, strengthened unions, fought for justice in policing and so much more. \n#100DaysOf117th https://t.co/buSGLJmgiZ","date":"Mon Apr 12 19:24:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Great to address the Korean American Public Action Committee @KAPAC9 “Spring Forum” this evening. We discussed peace on the Korean Peninsula, the shameful rise in violence against the AAPI community and many other important issues. https://t.co/ycpTw0vpk9","date":"Sat Apr 10 03:21:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This #YomHaShoah, we honor the more than six million Jews and countless others killed during the Holocaust, and honor their memories by continuing to speak out against and combat hate and intolerance in all its forms. \n\n#HolocaustMemorialDay","date":"Thu Apr 08 01:18:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I'm saddened by the passing of our colleague, Congressman Alcee Hastings. A respected leader and trusted voice, Congressman Hastings was a historic force in our nation's politics and leaves behind a powerful legacy. His leadership and friendship will be missed.","date":"Tue Apr 06 23:40:12 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Good\nhttps://t.co/ZFAA7uyFRt","date":"Tue Apr 06 18:54:17 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As Co-Chairs of the India Caucus, @RepSteveChabot and I are dedicated to advancing the US-India defense relationship, particularly in support of maintaining a free and open Indo-Pacific. (2/2)","date":"Mon Apr 05 21:28:51 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Great to see the U.S. and India participating in the Quad + France naval exercise beginning today in the Bay of Bengal. (1/2)\n https://t.co/jK5aQL7aSv","date":"Mon Apr 05 21:28:51 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Proud to be a #Bruin. Two great college basketball teams.","date":"Sun Apr 04 03:33:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to @CaseyK_Choi, K. Freeman Lee and the Korean American Public Action Committee for donating hand sanitizer to El Proyecto Del Barrio. (2/2) https://t.co/FXQMlpqzVv","date":"Sun Apr 04 01:17:10 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Grateful to join the volunteers and staff today at the El Proyecto Del Barrio Vaccine Distribution Site in Winnetka. Outstanding work taking place to bring greater equity to vaccine access. (1/2) https://t.co/j1Q3t5WcKw","date":"Sun Apr 04 01:17:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish a #GoodFriday and a very happy #Easter weekend to all who celebrate. May this time serve as a source of hope and a time of reflection for us all.","date":"Sat Apr 03 03:10:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Our nation is shocked and horrified by today’s tragic events at the U.S. Capitol. We mourn the loss of one of our Capitol Police heroes, Officer William Evans. As Speaker Pelosi aptly stated, “he is a martyr for our democracy.”","date":"Sat Apr 03 01:08:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Touched and grateful to my friend Senator Bob Hertzberg for his moving tribute to my mother, Lane Sherman who passed away in October at 91.","date":"Fri Apr 02 18:06:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"During my visit to the @csunorthridge Vaccine Distribution Center earlier today, I was happy to learn that CSUN medical staff is often able to get a seventh dose from a Pfizer bottle. (1/2)","date":"Fri Apr 02 03:06:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Prior to the late afternoon of December 16, medical personal nationwide were discarding the bottle after five doses. (2/2)","date":"Fri Apr 02 03:06:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"To schedule an appointment, go to https://t.co/UoVLlMTgqP or call 833-540-0473. (2/2)","date":"Fri Apr 02 02:48:25 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Beginning today, all Californians 50+ are eligible to be vaccinated. So grateful to join the members of @LACoFDPIO, the outstanding volunteers, the CSUN community and especially those receiving vaccinations today at the Vaccine Distribution Center at @csunorthridge (1/2) https://t.co/2aqFYToKdB","date":"Fri Apr 02 02:48:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Trans rights are human rights. I voted for the #EqualityAct because the trans community warrants the same civil rights protections afforded to anyone else. It's long past time for the Equality Act to become law.\n\n#TransDayOfVisibility","date":"Wed Mar 31 21:24:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"#Bruins are asking: First four, to #FinalFour. Has it ever happened be four? Go #UCLA!","date":"Wed Mar 31 05:23:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"#HappyHoli to all those celebrating. Wishing everyone a joyous, safe and colorful celebration.","date":"Tue Mar 30 02:04:17 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish all who celebrate a #HappyPassover \n\nLet us celebrate this Passover with the spirit of freedom that has sustained our people during even the darkest of times. Chag Sameach #Passover2021 https://t.co/4AZ0SqAQlf","date":"Sat Mar 27 18:36:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Asian Americans have faced a relentless increase in attacks throughout the pandemic. This disturbing surge in anti-Asian hate crimes is NOT just an #AsianAmerican issue, but an American issue. I stand in solidarity with my @CAPAC colleagues &amp; the #AAPI community to #StopAsianHate","date":"Fri Mar 26 17:16:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to the thousands of Valley residents who joined us last night for our Telephone Town Hall. It was a productive conversation about the work Congress is doing to defeat the #coronavirus, rebuild our economy and get our nation back on track. \nhttps://t.co/65aoUsVTsy","date":"Fri Mar 26 16:13:23 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"(1/4) This information is from the Acting Associate Commissioner of @US_FDA: https://t.co/DyIxtiuI2I","date":"Wed Dec 16 23:55:26 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now!","date":"Fri Mar 26 02:00:12 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"‼️Starting Soon‼️\n\nOur Telephone Town Hall will be starting Tonight at 7:00 PM Pacific. \n\nWe’ll be joined by Dr. Lynn Goldman, Dean of @GWpublichealth, and @AsmJesseGabriel. \n\nTo participate, Dial (877) 229-8493 &amp; Enter PIN code 13402 anytime during the event tonight https://t.co/QlUdsSvlJt","date":"Fri Mar 26 01:21:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Tonight at 7:00 PM Pacific.\n\nTo participate, dial (877) 229-8493 and enter PIN code 13402 anytime during the event tonight. \n\nThere's still time to RSVP/Submit a Question at: https://t.co/1snLNRj3hZ","date":"Thu Mar 25 17:03:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"A guide to #EqualPayDay:\n\n🗳vote for equity-based legislation\n\n💪support women leadership\n\n🗣invite women to the table when making policy decisions\n\nIt's time to take a stand against pay inequity and discrimination. We need equal pay for women everywhere. #EqualPayDay","date":"Wed Mar 24 20:51:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"❗️TOMORROW - MARCH 25th❗️\n\nJoin us for our Telephone Town Hall starting at 7 PM on the #coronavirus, the economy &amp; other issues facing Congress. \n\nWe’ll be joined by Dr. Lynn Goldman, Dean of @GWpublichealth and @AsmJesseGabriel\n\nRSVP/Submit a Question at https://t.co/1snLNRj3hZ https://t.co/OWcklFRKoV","date":"Wed Mar 24 19:45:10 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The Biden administration is extending the special enrollment period for health insurance to August 15. \n\nVisit https://t.co/RWxT97s3UJ to #GetCovered","date":"Wed Mar 24 18:41:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I have also introduced legislation to make this a permanent provision of law - The War Powers Act Enforcement Act. The witnesses confirmed that it's essential to tie Congress’ power of the purse to the War Powers Resolution to ensure congressional oversight over #warpowers. (3/3)","date":"Tue Mar 23 20:56:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Since FY2012, every Defense Appropriations bill has included a provision, first adopted as an amendment I offered in 2011, that states that no funds may be expended in contravention of the War Powers Resolution. (2/3)","date":"Tue Mar 23 20:56:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I questioned three distinguished legal scholars during a @HouseForeign hearing today on reclaiming Congress’ war powers. (1/3)\nhttps://t.co/CETiIhwxfx","date":"Tue Mar 23 20:56:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The gun violence in Boulder was the latest horrific attack.  Enough is enough. We need to take action and pass commonsense gun safety legislation now.  #EndGunViolence","date":"Tue Mar 23 19:41:18 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Chairman Powell &amp; @SecYellen testified before the House Financial Services Committee. I stressed the need for legislation to address LIBOR transition, providing states flexibility in changes to tax laws &amp; extending the tax-filing deadline for gig workers. \nhttps://t.co/YH4zCfpHeG","date":"Tue Mar 23 19:15:35 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you for the memories.\nhttps://t.co/eSVGNC9zUi","date":"Mon Mar 22 23:26:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"It was great to join @encinochamber for their virtual installation and pay tribute to those who have supported the Valley’s small businesses at a crucial time.","date":"Sun Mar 21 14:34:02 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, I introduced the War Powers Act Enforcement Act that will allow Congress to use its authority to prevent any President from violating the War Powers Act. \nhttps://t.co/BBdXhpW87Y","date":"Fri Mar 19 18:10:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, I'm proud to have supported and see the House pass the bipartisan #FarmWorkforceModernizationAct\n\nFarmworkers work tirelessly to grow our food, but often live in fear of deportation. This bill addresses the ag labor shortage and provides fairness to farmworkers. https://t.co/OVMeDMpRVL","date":"Fri Mar 19 00:17:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The #DreamAct allows Dreamers, TPS and DED holders—essential workers, teachers, and medical personnel—to fully contribute to our country and make America stronger. Proud to have voted for and see the House pass the bipartisan Dream Act. #HomeIsHere https://t.co/zoriiCVTdy","date":"Thu Mar 18 22:11:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I questioned Dean @ashishkjha on the international impacts of #COVID19. I emphasized the need for studies to stretch the global vaccine supply, &amp; for us to make use of global manufacturing capacity to get more shots into arms across the world. (1/2)\nhttps://t.co/rAZftAcNhC","date":"Thu Mar 18 21:03:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The Chinese Communist Party should pay the full reputational cost for its failure to alert the world to the outbreak of #COVID19 and its continued failure to allow for honest investigations into the origins of the virus. (2/2)","date":"Thu Mar 18 21:03:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"🚨IN ONE WEEK: I’ll be hosting a Telephone Town Hall on Thursday March 25 at 7:00 PM PT ☎️\n\nWe’ll be joined by Dr. Lynn Goldman, Dean of @GWpublichealth &amp; @AsmJesseGabriel to help discuss the latest on #COVID19\n\nTo RSVP or Submit a Question, Visit: https://t.co/1snLNRj3hZ","date":"Thu Mar 18 16:42:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Good meeting today with Israeli-American Civic Action Network @ICANAction about their work to confront Holocaust distortion and anti-Semitism in Europe. https://t.co/QttLhjyxP3","date":"Thu Mar 18 04:05:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"See my questioning of witnesses on short selling, the conflicts of interest involved in payment for order flow and other important issues that affect investors from today's second @FSCDems #GameStopHearing \nhttps://t.co/qtJoHRb0LM","date":"Thu Mar 18 00:51:25 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"\"This is a hearing on important technical issues that affect investors and that both parties should be trying to protect.\" \n\nSee my opening statement from today's @FSCDems #GameStopHearing \nhttps://t.co/ZcvYEg4ztu","date":"Thu Mar 18 00:47:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I am glad to hear the State Dept has had multiple, substantive conversations with Baku calling for the release of all POWs. It seems to be that Baku gave POWs access to @ICRC in response to US efforts. I will continue to work with the State Dept to release all POWs. (2/2)","date":"Thu Mar 18 00:07:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I spoke with Assistant Secretary Reeker @StateDept regarding #Armenian POWs in Azerbaijan. Azerbaijan is in violation of the ceasefire agreement by not having released all POWs. (1/2)","date":"Thu Mar 18 00:07:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to meet with the Community Clinic Association of LA County @CCALAC and discuss clinics' experiences during #COVID19. https://t.co/kAlsTd4L7k","date":"Wed Mar 17 21:51:21 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’m horrified by the news coming out of Georgia and my heart goes out to all the victims, the people of Atlanta and the AAPI community. \nhttps://t.co/jgAg2uLZGC","date":"Wed Mar 17 20:41:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I'm proud to have joined @RepJayapal and my colleagues to reintroduce #MedicareForAll — bold legislation that will help ensure that millions of uninsured and underinsured Americans receive access to quality, affordable healthcare. #M4A https://t.co/o6qVvaX26e","date":"Wed Mar 17 19:40:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’ll be hosting a Telephone Town Hall on Thursday March 25 at 7 PM PT.\n\nWe’ll be joined by Dr. Lynn Goldman, Dean of @GWpublichealth and @AsmJesseGabriel to help discuss the latest on our efforts to defeat #COVID19. \n\nTo RSVP or Submit a Question, Visit: https://t.co/1snLNRj3hZ https://t.co/3NNRYxsPbF","date":"Sat Mar 13 19:19:51 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I spoke with George Kent, Deputy Assistant Secretary European and Eurasian Affairs RE the one sided comments coming from our Ambassador in #Baku. @USEmbassyBaku has honored the Khojaly massacre, but @usembarmenia has remained silent on Sumgait, Baku, and Kirovabad.","date":"Fri Mar 12 23:02:18 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I met with @TECRO_USA Director General in Los Angeles Louis Huang. We discussed my efforts to help Taiwan regain observer status in the @WHO, the Chabot-Sherman Taiwan Travel Act, and bilateral trade between the US and Taiwan. (1/2)","date":"Fri Mar 12 22:46:23 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I am looking forward to working with my colleagues on @HouseForeign to advance the US-Taiwan relationship.(2/2)","date":"Fri Mar 12 22:46:23 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today we #WearOrange to honor all those lost and forever changed by gun violence. And today we take action in their memory by voting to pass #HR8, expanding background checks, and #HR1446, addressing the dangerous #CharlestonLoophole. https://t.co/U17DtIivpt","date":"Thu Mar 11 17:16:44 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"During @SecBlinken's appearance before the @HouseForeign, I questioned the Secretary on Iran and asked him if he can assure us that the Admin. will not make concessions to Iran just to get Iran to agree to a meeting. The Secretary assured me they would not.https://t.co/IhrcyG3zDT","date":"Wed Mar 10 22:47:42 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today @SecBlinken appeared before @HouseForeign to discuss the Biden administration's priorities for U.S. foreign policy. I raised many issues with the Secretary such as Iran, the release of Armenian POWs and enforced disappearances in Pakistan. \nhttps://t.co/zOsfAVVT6o","date":"Wed Mar 10 22:41:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Rescuing our nation from the depths of this #COVID19 crisis is not a red state or a blue state priority — It’s an American priority. \n\nThat’s why I was proud to support the #AmericanRescuePlan today, so all Americans get the relief they need. https://t.co/qQmc9ojOAF","date":"Wed Mar 10 19:53:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Great to speak to the Studio City Residents Association this evening about my work in Congress and efforts to reduce the airport noise. https://t.co/iKA2IPMYV7","date":"Wed Mar 10 04:44:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, I put out a statement commenting on two recent letters I signed to the Biden Administration on #Iran. We must quickly bring Iran back into compliance with the JCPOA and address Iran’s other non-nuclear behavior.\nhttps://t.co/IAZUVTBc7h","date":"Wed Mar 10 03:59:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Nice discussion with the @NorthridgeWest Neighborhood Council tonight. I’m always impressed by those who have stepped up to serve their community during a difficult time.","date":"Wed Mar 10 02:57:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, @HouseDemocrats passed the #PROAct – the most significant upgrade for workers’ collective bargaining rights in more than 80 years. We must protect workers’ right to negotiate for better wages, benefits, and working conditions. \nhttps://t.co/vRJd5Bm0aW","date":"Wed Mar 10 02:13:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today is #InternationalWomensDay and I’m proud to co-sponsor the #GlobalHERAct to end the #GlobalGagRule; a harmful policy that prevents access to critical reproductive health care. An important step, but there's still much to be done to support women around the globe. #IWD2021","date":"Mon Mar 08 19:09:32 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I met with Amb @giladerdan1 Israel’s new Amb to the US &amp; @UN and discussed issues important to the US-Israel relationship for over an hour. Looking forward to working together &amp; in Congress to address Iran, US-Israel scientific cooperation, anti-Semitism, &amp; other issues.","date":"Fri Mar 05 00:54:52 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The 2020 election underscored the need for structural democracy reform. That’s why I’m proud to have cosponsored &amp; voted for #HR1, the #ForThePeople Act – the most comprehensive anti-corruption &amp; clean elections effort in a generation. \n\nWe need to make voting easier, not harder. https://t.co/wKcWHPSH4q","date":"Thu Mar 04 04:14:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Tonight, I’m proud to have voted for and see the House pass the George Floyd #JusticeInPolicingAct of 2021 — a bold, comprehensive approach to hold police accountable, change the culture of law enforcement, and foster trust between law enforcement and our communities. (2/2)","date":"Thu Mar 04 02:26:46 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Last summer, in the wake of George Floyd’s murder, I joined my colleagues to help introduce the #JusticeInPolicingAct in order to hold police accountable. Since then, millions have marched &amp; voiced an urgent call to end deadly police violence that’s claimed too many lives. (1/2) https://t.co/PkR0NDBxhY","date":"Thu Mar 04 02:26:45 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Family of five with taxable income of $149,900 gets $7,000 tax free check. Same family, taxable income of $160,100, gets zero. Not sure that’s fair. In fact, the second family will net less after taxes than the first. \nhttps://t.co/G21as6UYL6","date":"Wed Mar 03 22:40:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Good to speak last night with the board of the Granada Hills North Neighborhood Council @GHNNC.","date":"Wed Mar 03 17:02:38 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Earlier today I joined @FoxNews's @ANHQDC to praise the #AmericanRescuePlan and discuss its impact on our economy and our fight against Covid. \nhttps://t.co/6QKhaCtPcB","date":"Sat Feb 27 22:14:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I will be joining @FoxNews’s @ANHQDC at 9:10 AM Pacific/12:10 PM EST to discuss @POTUS’s #AmericanRescuePlan and more.","date":"Sat Feb 27 16:49:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@HouseDemocrats promised the American people that we would fight for the big, bold #COVID relief they need--and we’re not going to let them down. That’s why I’m voting to support the #AmericanRescuePlan Act of 2021. https://t.co/50JJuBnRek","date":"Sat Feb 27 03:31:40 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/sSdpBEUkkk","date":"Sat Feb 27 02:17:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Good to address the @NorthridgeSouth Neighborhood Council this evening.  It’s important for every community to receive information about resources available and how my office can assist.","date":"Fri Feb 26 04:53:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Chag Purim Sameach! Wishing a Happy Purim to all who celebrate. Purim reminds us to stand up against anti-Semitism and hate. May the spirit of Purim bring us light in times of darkness. Have a safe, healthy, and joyful holiday. https://t.co/f2pItjFz98","date":"Fri Feb 26 03:54:51 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"“This is the time to pass the #EqualityAct. We need it to set all our people free.” Rep. John Lewis\n \nEquality is about fairness. The LGBTQ community deserves the same rights and protections as every other American. I’m proud to have cosponsored and to help pass the #EqualityAct. https://t.co/SfJIjmfXGv","date":"Thu Feb 25 22:32:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I met with Ambassador @VaruzhanN to discuss how Congress can work to strengthen the U.S.-Armenia relationship. We discussed the ongoing issues in #Artsakh as a result of the devastation caused by Azeri and Turkish attacks against Artsakh last year. (1/3)","date":"Wed Feb 24 01:02:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We also discussed the importance of securing a U.S.-Armenia Tax Treaty, which would remove barriers to the growth of U.S.-Armenia economic relations and prevent double taxation. I am looking forward to working with @JanetYellen to make this a reality. (3/3)","date":"Wed Feb 24 01:02:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I expressed my strong support for immediate U.S. assistance to Armenia and Artsakh, and I look forward to working with my colleagues on these important issues. (2/3)","date":"Wed Feb 24 01:02:26 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Earlier this year, I urged @POTUS's #COVID19 Response Team bolster our #COVIDVaccine production by having pharmaceutical companies manufacture vaccines invented by others. (1/3) https://t.co/O0kSpXjJN8","date":"Tue Feb 23 23:19:59 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Have talked at length to #Moderna and #Pfizer experts and urged the administration to use the Defense Production Act to force Pfizer and Moderna to license other manufacturers if they failed to do it on their own. (2/3)","date":"Tue Feb 23 23:19:59 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I'm very encouraged to see this approach becoming a reality as some of the biggest pharmaceutical companies are joining forces to help produce vaccines and substantially increase supplies by this summer. None of us are safe until all of us are safe. (3/3)\nhttps://t.co/UtvzYH89ne","date":"Tue Feb 23 23:19:59 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today the Biden administration released new Treasury Department guidance for the Emergency Rental Assistance Program in order to help communities quickly distribute emergency rental assistance to renters in need.","date":"Tue Feb 23 00:17:36 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I was honored to swear in the incoming board of directors for the North Valley Chamber of Commerce \n@NVRCC today, as well as to discuss my efforts to assist the Valley's small businesses during the pandemic. https://t.co/EFtUBYEXR4","date":"Thu Feb 18 23:56:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today at the #GameStopHearing, Citadel Securities CEO Kenneth Griffin couldn't answer my question - do brokers that receive payment for order flow (kickbacks) from Citadel on average get worse trade execution for their customers than brokers who don't?\nhttps://t.co/MwJM6i9K7q","date":"Thu Feb 18 21:47:22 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"See my opening statement from today's #GameStopHearing \nhttps://t.co/F9Be5cTLhN","date":"Thu Feb 18 21:44:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"President Biden @POTUS has opened up a special enrollment period until May 15 to allow more time for Americans to sign up for health insurance and #GetCovered under the #AffordableCareAct. \n \nVisit https://t.co/uaPOCjXIkc or call 1-800-318-2596 to learn more. https://t.co/liEpap8UdZ","date":"Tue Feb 16 17:56:48 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/4DBoGdGVko","date":"Sun Feb 14 22:13:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thankful for the opportunity to join this morning’s live-streamed Sunday services at Congregational Church of Chimes. https://t.co/JiEI1kkJfj","date":"Sun Feb 14 20:36:01 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The Sindhi Foundation Long Walk for Freedom, April 7 – 29, from the UN in NYC to DC, will draw attention to issues like enforced disappearances and climate change. (2/2)\nhttps://t.co/ld57YhT6Oz","date":"Sun Feb 14 01:20:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I was pleased to meet with leaders of the Sindh community. We discussed issues such as enforced disappearances in Sindh #Pakistan. We also discussed the need to reach out to Sindhis in their own language and my efforts to establish a Sindhi language service at the @VOANews (1/2)","date":"Sun Feb 14 01:20:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The evidence, brilliantly &amp; passionately presented by House managers, was overwhelmingly clear: Donald Trump incited the attack on the U.S. Capitol. \n\nAlthough many Senate Republicans chose party over country, Trump’s role in the Jan 6 attack will forever be recorded in history.","date":"Sat Feb 13 22:33:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I joined @ABC7 today to discuss the #ImpeachmentTrial of Donald Trump. \nhttps://t.co/VI70kiPDAi","date":"Sat Feb 13 03:30:50 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Enjoyed my discussion with the San Fernando Valley Retired Teachers Association this morning, particularly today’s strong advocacy on behalf of students with special needs. Thank you all for your careers of service to our students.","date":"Fri Feb 12 19:59:58 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Families are still hurting, as seen by long line of cars gathered for @lcs_losangeles food distribution in the Valley. I was glad to join Sergio Rascon &amp; Ernesto Pantoja of @LIUNA Local 300 &amp; the working men &amp; women of @LALabor who are helping those experiencing food insecurity. https://t.co/gtrEyUuYxl","date":"Fri Feb 12 05:06:07 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"A president must be held accountable for every day in office, beginning to end. There cannot be a “January exception” to the Constitution. \n\nThe Senate must convict Donald Trump. It’s time to defend our democracy.\n\n#HoldTrumpAccountable https://t.co/UDxPPbqJDF","date":"Thu Feb 11 19:12:44 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I urged that all U.S. assistance to Burma/Myanmar should be virtually eliminated until Burma/Myanmar allows for the safe return of Rohingya refugees &amp; has provided them with Burmese citizenship documents. The $135 million can be spent helping Rohingya refugee camps. (2/2)","date":"Tue Feb 09 21:56:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I spoke with the House Asia Subcommittee and the \n@StateDept's Bureau of East Asian and Pacific Affairs \n@USAsiaPacific regarding the coup in Burma/Myanmar. We currently give $135 million in assistance to Burma/Myanmar.  (1/2)","date":"Tue Feb 09 21:56:18 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"On my way to witness the #ImpeachmentTrial of Donald Trump. I was the first to file Articles of Impeachment in July 2017. My co sponsor was @RepAlGreen and we are heading in together to watch the beginning of the trial. https://t.co/btUU9otFNY","date":"Tue Feb 09 18:52:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Great speaking this morning with Wings Over Wendy’s, a Valley veterans organization, about U.S. foreign policy and constituent services, including help with the VA.","date":"Mon Feb 08 20:07:14 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/nZJHXRDnhk","date":"Sun Feb 07 20:33:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I urged the Indian government to make sure that the norms of democracy are maintained, that protesters are allowed to protest peaceably and to have access to the Internet, and to journalists. All friends of India hope that the parties can reach an agreement. (2/2)","date":"Fri Feb 05 23:06:01 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I convened a meeting of the leadership of the India Caucus with Co-Chair @RepSteveChabot and Vice Chair @RepRoKhanna to speak with the Ambassador of India @SandhuTaranjitS regarding the farmers’ demonstrations. (1/2)","date":"Fri Feb 05 23:06:01 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The family of slain letter carrier Joseph Ileto, and that shooting’s survivors all deserve action to #EndGunViolence. This #GunViolenceSurvivorsWeek, let’s recommit to that goal. (2/2)\n\n@momsdemand @bradybuzz","date":"Thu Feb 04 23:12:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The scourge of our nation’s gun violence epidemic leaves no person or community unscathed. Communities like ours, when in 1999 a white supremacist attacked the North Valley Jewish Community Center. (1/2)","date":"Thu Feb 04 23:12:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/WAj51VRFd1","date":"Thu Feb 04 19:42:18 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I called on Amb. Litzenberger @USEmbassyBaku to clarify his recent concerning statements congratulating Azerbaijan for “restoring its territorial integrity.” We need a permanent solution to the #Artsakh conflict that supports Artsakh’s long-term security and stability. https://t.co/8hzUZMGuDy","date":"Thu Feb 04 03:20:32 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We must take action to tackle the #COVID crisis. @HouseDemocrats budget resolution will give Congress another tool to pass @POTUS’s #AmericanRescuePlan and:\n\n☑️ Expand #COVID testing &amp; treatment\n\n☑️ Implement a safe, effective vaccination strategy\n\n☑️ Rebuild our economy","date":"Wed Feb 03 21:26:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Much needs to be done to address the damage and human rights abuses committed by Azerbaijan and Turkey. (2/2)","date":"Wed Feb 03 20:26:45 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to co-sign an important letter to @SecBlinken and @SecDef led by the Co-Chairs and Vice-Chairs of the #ArmenianCaucus urging them to take significant steps to strengthen the US-Armenia strategic relationship and provide urgently needed aid to the people of #Artsakh. (1/2)","date":"Wed Feb 03 20:26:44 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We expect the Pakistani government to expeditiously move to recall the order of acquittal to ensure justice is served. (2/2)","date":"Wed Feb 03 00:53:35 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I sent a letter to @asadmk17, signed by 36 of my colleagues, urging the Ambassador to ensure that the @GovofPakistan conducts a full review of the acquittal in the case of Daniel Pearl, my constituent. (1/2) https://t.co/TDZD1d24HN","date":"Wed Feb 03 00:53:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":".@laobserved is right that the Valley has long been an “integral part of Los Angeles.”  Thanks to @pattmlatimes for shedding light on our history.\nhttps://t.co/mEqTWiwTv1","date":"Tue Feb 02 23:59:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"U.S. tax dollars should not go for general economic development of a country guilty of ethnic cleansing. We must also sanction those individuals responsible using the Global Magnitsky Act. (2/2)","date":"Mon Feb 01 19:34:56 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The situation in Burma/Myanmar has gone from bad to worse. We must pause and review all assistance to Burma as we see the affect of this possible coup, and see if the government moves to provide citizenship papers to the Rohingya. (1/2)\nhttps://t.co/xgVDyDWaNB","date":"Mon Feb 01 19:34:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, as we mark the start of #BlackHistoryMonth, may we honor the powerful impact of generations of trailblazing African Americans, and draw inspiration to continue the work towards achieving equality and justice for all.","date":"Mon Feb 01 19:18:25 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As Chair of the Caucus on India and Indian Americans, I condemn the act of vandalism which took place in Davis, California and resulted in the destruction of the statue of Mahatma Gandhi. Gandhi’s legacy is one of peace and the promotion of non-violence.","date":"Sun Jan 31 20:26:39 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Good to update @ShermanOaksCC today on support for small businesses.  Likewise, it was good to address community activists at @myvalleyvillage, @encinochamber and the Sherman Oaks Homeowners Association in recent days.","date":"Fri Jan 29 19:52:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I joined @CNBC earlier today to discuss the #GameStop trading frenzy. \n\nhttps://t.co/vY023Mvebg","date":"Fri Jan 29 17:12:46 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Robinhood should not prohibit its customers from buying certain stocks. Robinhood should be able to warn its customers about the risks of certain stocks and Robinhood does not need to lend its customers money to buy certain stocks.","date":"Thu Jan 28 23:38:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As Chair of the Subcommittee on Investor Protection, Entrepreneurship, and Capital Markets, I look forward to working closely with @RepMaxineWaters to ensure Congress and regulators are taking the steps necessary to make our markets more fair and efficient for everyday Americans.","date":"Thu Jan 28 23:06:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The killers of Daniel Pearl go free. And Dr. Afridi, who helped the U.S. get Osama Bin Laden, rots in jail. \nhttps://t.co/PGvOFpa4P1","date":"Thu Jan 28 22:51:17 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, President Biden repealed the harmful #GlobalGagRule. I was pleased to join with @RepBarbaraLee and others to introduce Rep. Lee’s Global HER Act to make this repeal permanent.","date":"Thu Jan 28 21:39:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Most billionaires, and the companies they control, will be socially liberal. But they will not be economically progressive. \nhttps://t.co/jO5NKsTKsT","date":"Thu Jan 28 19:11:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I’m looking forward to bringing science back into policymaking with the Biden Administration. We are going to build a better future through   #ScientificSolutions in order to work towards #SolvingTheClimateCrisis","date":"Wed Jan 27 21:57:41 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today on #HolocaustRemembranceDay, the anniversary of the liberation of Auschwitz-Birkenau, we remember the victims, honor their memory and continue to share the stories of the survivors. We must continue to counter Anti-Semitism and Xenophobia wherever it takes hold. #NeverAgain","date":"Wed Jan 27 17:53:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As a member of the Congressional Asian Pacific American Caucus, I’m glad to see the important actions taken by @POTUS today.","date":"Wed Jan 27 00:42:52 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We must not waste any available #COVIDvaccines. Today I urged the FDA to allow vaccines to be split between two vials from the same manufacturing lot. https://t.co/bbWiFC6MTd","date":"Tue Jan 26 23:06:35 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I look forward to continuing to work with Ambassador @SandhuTaranjitS to continue the relationship between the world’s oldest and largest democracies. (2/2)","date":"Tue Jan 26 20:11:05 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As the Democratic Chair of the House Caucus on India and Indian Americans, I extend my congratulations to India on this #RepublicDay- marking 71 years since the signing of India’s constitution. (1/2)","date":"Tue Jan 26 20:11:05 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We need good therapeutics in addition to vaccines. This is a positive development. \nhttps://t.co/CDBOlQUSfQ","date":"Mon Jan 25 21:22:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today @SenFeinstein &amp; I re-introduced the Kobe Bryant and Gianna Bryant Helicopter Safety Act, which requires the FAA to strengthen safety standards for helicopters in the wake of last year's tragedy that claimed the life of Kobe, Gianna and 7 others. https://t.co/obgpjbGa1Q","date":"Mon Jan 25 18:06:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"48 years ago Roe v. Wade established the legal right to reproductive freedom. Today we celebrate that victory and commit to making the right to choose accessible to all. We must ensure everyone has equal access regardless of income, race, and ZIP code. #RoeAnniversary","date":"Fri Jan 22 19:52:33 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Thank you to the thousands of Valley residents who joined our Telephone Town Hall last night. It was a productive discussion on the many critical issues facing our nation. \n\nLearn more about our event last night, below\nhttps://t.co/zNlksaVT4L","date":"Fri Jan 22 17:09:01 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting Now!","date":"Fri Jan 22 03:00:16 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Starting in one hour at 7 PM Pacific!","date":"Fri Jan 22 02:00:07 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"TONIGHT:\n\nI’ll be hosting a Telephone Town Hall tonight starting at 7 PM Pacific where we’ll discuss the latest developments on the #coronavirus, the recent attack on the Capitol and the new Biden Administration.\n\nVisit https://t.co/1snLNRj3hZ to RSVP or Submit a Question. https://t.co/NGmbZl85nJ","date":"Thu Jan 21 20:52:19 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Pfizer deserves credit for developing the first vaccine and manufacturing as quickly as they can, but they still haven't provided a reason they haven't licensed competitors to get doses more quickly. This is a crisis until everyone in America and the world, is vaccinated. (3/3)","date":"Thu Jan 21 17:18:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I urge them to grant licenses to competing companies to be able to manufacture the vaccine as soon as possible, but so far, Pfizer is refusing to do this. (2/3)","date":"Thu Jan 21 17:18:05 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Recently talked to Dr. Cane, North America Chief of Scientific and Medical Affairs, Pfizer Vaccine and Lisa Coen, U.S. Public Affairs, Pfizer Vaccines. They boasted of Pfizer’s efforts to produce more vaccines. (1/3)","date":"Thu Jan 21 17:18:05 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"What a difference a day makes. https://t.co/OIOYcXWXIL","date":"Thu Jan 21 15:27:01 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The bag contains everything an L.A. boy needed to survive outdoors in a Washington winter. Gloves, hat, blanket, ear muffs, and a box of Joe-Joes. https://t.co/APAM0Udw2X","date":"Thu Jan 21 01:01:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Proud of Los Angeles's own Amanda Gorman, the United States of America's first National Youth Poet Laureate. \n\n\"We've...witnessed a nation that isn't broken, but simply unfinished...\"     \n\n#Inauguration2021","date":"Wed Jan 20 19:51:52 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Can't believe Bill Clinton left office twenty years ago. https://t.co/KRTkxMMf82","date":"Wed Jan 20 18:30:09 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"A new day begins #InaugurationDay https://t.co/5aivOAVy7T","date":"Wed Jan 20 18:26:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Joseph R. Biden has now been officially sworn in as the 46th President of the United States. Our four-year national nightmare is officially over. I look forward to working under new leadership to meet and solve the great challenges our nation faces. #InaugurationDay","date":"Wed Jan 20 16:50:08 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"California's very own Kamala Harris has now been officially sworn in as the first female, the first Indian-American and the first African American Vice President of the United States. This is a truly historic moment that illustrates the aspirational power of the American Dream.","date":"Wed Jan 20 16:42:34 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"As I sit on the dais during the #Inauguration, I’m struck at how profoundly different this Inaugural ceremony is from previous years. I’m confident that under the new administration, we will rebuild and emerge stronger than ever. https://t.co/kjEeeUl1nQ","date":"Wed Jan 20 16:30:24 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Never have I been so happy to see Mike Pence. https://t.co/48zbK0Ixsq","date":"Wed Jan 20 16:10:17 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Just arrived at the Capitol. I'm honored to attend the Inauguration of President Joseph R. Biden and Vice President Kamala Harris as we officially end our four-year national nightmare and hopefully usher in a new era of progress and unity. #InaugurationDay","date":"Wed Jan 20 15:30:46 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Dr. Martin Luther King once said “We must use time creatively, in the knowledge that the time is always ripe to do right.” \n\nSo on this #MLKDay may we honor his legacy by continuing to press through challenges and doubts in order to change our world for the better.","date":"Mon Jan 18 15:47:54 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I know vaccine distribution hasn’t been as fast as we would like. Here is some useful information. \n\nLearn more on when you can receive your free #COVID19 vaccination by visiting https://t.co/y2zcBKfYQr https://t.co/BjeAflCuOw","date":"Sun Jan 17 15:00:20 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In One Week: \n\nI’ll be hosting a Telephone Town Hall on Thursday January 21st starting at 7 PM Pacific where we’ll discuss Impeachment, the recent attack on the Capitol and the latest developments on the #coronavirus \n\nVisit https://t.co/1snLNRj3hZ to RSVP or Submit a Question https://t.co/PCnfMGEU16","date":"Fri Jan 15 02:00:27 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/lQBminb6TO","date":"Thu Jan 14 22:20:12 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Great to see our ally India purchasing and supplying millions of doses of #COVID vaccines, manufactured in India, to its neighbors and partner nations around the world. (1/2)\nhttps://t.co/pRuqp0P3Yn","date":"Thu Jan 14 22:00:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"India is one of the world’s largest manufacturers of inoculations. In a time of great need for the entire international community, India is stepping up to help the world overcome this pandemic. (2/2)","date":"Thu Jan 14 22:00:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We should also deprive Donald Trump of any post presidency benefits, except security. Trump should live-on as a bad example, and not die as a pseudo-martyr. (2/2)","date":"Wed Jan 13 21:00:42 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today I spoke on the House Floor to urge my colleagues to vote to #ImpeachTrump (1/2)\nhttps://t.co/x4RBHvf98L","date":"Wed Jan 13 21:00:41 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Sherman questions cabinet secretary on the 25th Amendment on October 12, 2017:\nhttps://t.co/nvzfNuwmzT","date":"Wed Jan 13 18:36:05 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I will be speaking on the House Floor today around 2:30 PM EST (11:30 PT) to support a yes vote to #ImpeachTrump","date":"Wed Jan 13 18:22:32 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This is huge. \nhttps://t.co/zHRRPMM7ZK","date":"Wed Jan 13 00:04:30 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The Small Business Administration has reopened the Paycheck Protection Program (PPP) this week to provide direct assistance for small businesses affected by #COVID19\n\nAs always, my office stands ready to assist.\nhttps://t.co/gxlT7RPSvv","date":"Tue Jan 12 21:29:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Ironic: a Presidency that begins focused on an unnecessary wall along our southern border, ends by creating the necessity for a wall around our Capitol. \n\nhttps://t.co/dACAK5CuFp","date":"Mon Jan 11 23:11:13 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"See my letter to my constituents on the recent attack on our Capitol. https://t.co/sGH8MNeqhg","date":"Fri Jan 08 22:40:49 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"We all loved Tommy Lasorda. RIP. \nhttps://t.co/LBXSchX6vB","date":"Fri Jan 08 18:18:36 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I am pleased to join @davidcicilline and many others in introducing Articles of Impeachment. I introduced Articles of Impeachment in the 115th, 116th, and now the 117th Congress. https://t.co/an4aubPoWy","date":"Thu Jan 07 23:12:02 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Capitol police have extensive video. Just as important, the thugs are posting pictures of themselves, but will soon delete them. Those who download and preserve these pictures will be in a position to help law enforcement. (2/3)","date":"Thu Jan 07 20:11:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The thugs who invaded the Capitol must be prosecuted to deter future attacks on our Democracy. I’m confident #MerrickGarland and the new Justice Department will do their duty. (1/3)","date":"Thu Jan 07 20:11:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"And those who can identify the thugs in the pictures we already have can help law enforcement too. (3/3)","date":"Thu Jan 07 20:11:43 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In July 2017, I was the first member of Congress to introduce articles of impeachment. Nearly a year ago, I voted to impeach. Trump’s actions yesterday once again demonstrated the need to impeach and remove this President.","date":"Thu Jan 07 18:29:45 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"This one victory, their only victory in any state, affected fewer than 100 ballots - in a state President-Elect Biden won by more than 80,000 votes. It’s now 3 a.m. and I will go to the floor to vote to accept Pennsylvania’s electors. (2/2)","date":"Thu Jan 07 08:04:35 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In Pennsylvania, the Trump campaign, state Republicans and others have filed more than 20 election-related lawsuits. They won one of these lawsuits and lost the rest. (1/2)","date":"Thu Jan 07 08:04:35 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"No objection is even considered unless signed by a Senator and a House Member. (2/2)","date":"Thu Jan 07 05:03:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Republican Senators changed their plan. None was willing to challenge Georgia or Michigan electors. Didn’t want to be on the same side as the rioters. Hopefully there will be no Senator objecting to Pennsylvania or any other state. (1/2)","date":"Thu Jan 07 05:03:53 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"In Arizona, the Trump campaign filed 8 election-related lawsuits. All were withdrawn/dismissed. The Arizona Supreme Court unanimously dismissed the state Republican party’s election challenge, even though all 7 of the court’s justices were appointed by Republican governors. (1/2)","date":"Thu Jan 07 04:50:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I voted to accept Arizona’s electors. (2/2)","date":"Thu Jan 07 04:50:04 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"House goes back in at 9 pm Eastern Time. Thugs can delay Democracy (for 8 hours in this case). But they can’t stop it.","date":"Thu Jan 07 02:10:07 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Senate back in session. Hopefully House soon.","date":"Thu Jan 07 01:10:37 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The Congress will continue its work tonight, complete the count of the electoral college votes, defeat Republican objections, and confirm that Joe Biden is the next President and Kamala Harris is our next Vice President. Democracy wins. Thugs lose.","date":"Wed Jan 06 23:45:55 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I don’t know when the security situation in the Capitol will be resolved but my Democratic colleagues and I are ready to complete the process. As soon as the Capitol is secure, we should resume and we should complete our work.","date":"Wed Jan 06 23:05:02 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I never thought I’d tweet this: Today Senator Mitch McConnell gave an excellent speech.","date":"Wed Jan 06 19:45:54 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The American people will not accept Trump and the violence he applauds. And the Republican Party can’t win without Trump’s most crazed supporters.","date":"Wed Jan 06 19:36:31 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today the party of Ronald Reagan died. Cause of death, suicide.","date":"Wed Jan 06 19:36:00 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Today, Vice President Pence adhered to the Constitution, and that made Donald Trump very sad.","date":"Wed Jan 06 18:54:44 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Trump disruption. Dangerous. Disgraceful. Pitiful.","date":"Wed Jan 06 18:53:06 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"The circus has begun, and the votes from Arizona have been challenged for no good reason. The certification process may take several (20) hours to complete. In the end, we will have concluded this hopefully last chapter of our four-year national nightmare.","date":"Wed Jan 06 18:37:48 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"President Trump's inability to accept his loss doesn't change the facts: #AmericaHasSpoken and today, the House and Senate will certify President-elect Biden's historic victory.","date":"Wed Jan 06 16:25:29 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"China's obfuscation is costing lives and causing many to believe that China has something to hide -- particularly with regard to labs at the Wuhan institute of Virology (1/3)\nhttps://t.co/IV5tR0Hmav","date":"Mon Jan 04 20:07:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"\"...That's prevented painstaking epidemiological detective work.\" (3/3)","date":"Mon Jan 04 20:07:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"From the article: \"China has ignored appeals for an independent investigation into the virus's origin, hammering Australia with trade restrictions after it called for one. It's also stalled efforts by the WHO to get top infectious disease experts into Wuhan this year...\" (2/3)","date":"Mon Jan 04 20:07:47 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Congratulations to @SpeakerPelosi on her historic re-election as Speaker of the House. \n\nI’m proud to welcome her once again as #MadameSpeaker and look forward to the work ahead under her leadership.","date":"Sun Jan 03 23:08:03 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Trump's absurd theatrics over an election he lost are threatening to corrosively undermine the integrity of our democracy.","date":"Sun Jan 03 19:40:42 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"Finally, in his last days, Republicans in the Senate stand up to Trump. \nhttps://t.co/57Wdhv0hW1","date":"Fri Jan 01 21:55:39 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish everyone a healthy and #HappyNewYear! \n\nAlthough this past year proved to be quite challenging, wishing you and your loved ones an abundance of health, joy and happiness in 2021.","date":"Fri Jan 01 17:26:28 +0000 2021","user_id":"30216513"},{"handle":"BradSherman","text":"I am requesting that the Defense Department fulfill California’s requests for additional medical personnel to assist with the surge in #COVID19 cases in Los Angeles and across the state. https://t.co/pTYVYnWPO5","date":"Thu Dec 31 21:31:57 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Critical that Democrats in the House are able to be on the House floor next week. \nhttps://t.co/3Fv32HLHn2","date":"Thu Dec 31 00:31:07 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/lWSXLcGEWd","date":"Wed Dec 30 23:37:49 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"See my letter to the editor responding to the @WSJ's recent editorial critiquing passage of the Kennedy-Sherman to de-list foreign companies which don't comply with U.S. audit requirements. \nhttps://t.co/1mnE5NI63U","date":"Tue Dec 29 22:29:56 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I was disturbed by yesterday’s horrendous Christmas Day bombing in #Nashville. My thoughts go out to our fellow Americans who were injured. We must bring those responsible to justice while helping their community heal. \nhttps://t.co/aZArAWYmU1","date":"Sun Dec 27 02:08:29 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today marks the start of #Kwanzaa . Although this year is different, I want to wish all those celebrating a holiday still full of joy, warmth and peace.","date":"Sun Dec 27 01:08:49 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I was glad to join the Armenian American Medical Society on their Christmas Day telethon where I described my efforts to support the U.S. – Armenia relationship and to aid the people of #Artsakh during this difficult time. https://t.co/jcD2Y6Ckf5","date":"Fri Dec 25 21:34:12 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish all a very safe and #MerryChristmas &amp; #HappyHolidays. Although we may be physically apart this holiday season, may this time still allow us to reflect on the blessings of family, community and country.","date":"Fri Dec 25 15:26:02 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Not good. \nhttps://t.co/NvMCypqwM5","date":"Thu Dec 24 16:46:53 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"The new #COVIDReliefPackage extends the eviction protection for one month until January 31. This is more important than it sounds because on January 20th, we get a new president, who has the authority to extend the eviction moratorium until the #COVID crisis is over.","date":"Wed Dec 23 23:43:47 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Shameful. Will be overridden.","date":"Wed Dec 23 21:30:29 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Will be interesting to see if Republicans really want larger stimulus payments. https://t.co/ISLUgQLLab","date":"Wed Dec 23 18:41:17 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"While we had success in convincing FDA to issue guidance regarding giving up to 7 doses (not just 5) from the @pfizer vaccine vials, there are other ways we may be able to vaccinate more people, faster. (1/3)","date":"Wed Dec 23 15:48:26 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"#Pfizer should be doing the same research (doses are already smaller). There may be variations in the dose size necessary for different age groups and other health factors, but the lowest effective amount of each vaccine should be used so we can vaccinate everyone ASAP. (3/3)","date":"Wed Dec 23 15:48:26 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Moderna is looking at the efficacy of a 50 or 25 microgram dosage administered twice, as opposed to the current two doses of 100 micrograms it uses. If they're successful, this'll double or quadruple the amount of Moderna vaccinations possible w/the same amount of material.(2/3)","date":"Wed Dec 23 15:48:26 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I’ve known Alex for decades, and soon the entire country will see what we in the Valley have long-known: that Alex will be a champion for working families and will bring his characteristic intelligence and drive to solve problems for all Americans. (2/2)","date":"Wed Dec 23 01:06:52 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Congratulations to the San Fernando Valley’s own, @AlexPadilla4CA on his appointment to the U.S. Senate. He ably represented the Valley as L.A. City Council President and state legislator, and as Secretary of State guided CA through the most challenging election in memory. (1/2)","date":"Wed Dec 23 01:06:52 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"The recent Russian cyber attacks are alarming, &amp; Trump’s continued refusal to act is unacceptable. Congress, with the Biden Admin, will work to secure our nation’s digital defenses &amp; end the impunity for such attacks on our national security &amp; democracy. \nhttps://t.co/aBLNfwanow","date":"Sat Dec 19 05:40:22 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Very sorry to hear of the passing of Matthew Wheeler, pictured here at the far left. Matthew’s enormous heart and joyful spirit will be missed. Special condolences to his friend Wade Alexander, pictured here -as always- by his side. https://t.co/sBYf91qLcj","date":"Sat Dec 19 01:40:51 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Senator @ChrisVanHollen @RepAGonzalez and I released the following statement regarding the signing of our bipartisan Holding Foreign Companies Accountable Act into law.\nhttps://t.co/IaIGRZP8Vi","date":"Fri Dec 18 21:45:35 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Congratulations @Kelly4LASchools. I’m so proud to see a former intern of my office rise to become the youngest female president of the @LASchools board.","date":"Fri Dec 18 02:08:40 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Sadly this announcement only confirms concerns my colleagues and I have raised that Robinhood has chosen profit over the basic responsibilities it owes to its users. \n\nFurther investigations may be necessary. \n\nSee our letter to Robinhood co-CEOs here: https://t.co/Yo1tgpsA5i","date":"Thu Dec 17 21:57:47 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today marks 47 years since the Helms Amendment was passed. \n\nI co-sponsored H.R. 7816, the Abortion is Health Care Everywhere Act, to repeal the Helms amendment once and for all!","date":"Thu Dec 17 21:04:32 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Great to join my colleagues and the Jewish Federation of L.A. @JFedLA to celebrate #Hanukkah https://t.co/4Mal3XLcq1","date":"Thu Dec 17 19:38:50 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"See my statement below on working to prevent #Pfizer vaccine waste\nhttps://t.co/veKW6GXLGb","date":"Thu Dec 17 01:32:41 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Guidance in more formal form from the @US_FDA.\n\n@CVSpharmacy @Walgreens @ahahospitals @CalHospitals https://t.co/0oX1bUFgEQ","date":"Thu Dec 17 00:11:29 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"(3/4) I’ve urged FDA to get this up on their website and out to those administering the @pfizer vaccine, including @cvspharmacy @Walgreens @ahahospitals @CalHospitals","date":"Wed Dec 16 23:55:27 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"(4/4) Above is what I tweeted about two hours ago. If we can get 7 doses rather than 5 from each vial, that’s a 40% increase.","date":"Wed Dec 16 23:55:27 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"(2/4) @US_FDA is clear: “acceptable to use every full dose available (the sixth or possibly a seventh) from each vial”. We now need to get the word out to those administering the vaccine.","date":"Wed Dec 16 23:55:27 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"(1/4) This information is from the Acting Associate Commissioner of @US_FDA: https://t.co/DyIxtiuI2I","date":"Wed Dec 16 23:55:26 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Doctors are telling me that 40% of the #Pfizervaccine is being wasted. The vials contain enough vaccine for 7 shots. But the FDA rules require a vial be discarded after 5 shots. Working with @US_FDA to get a change in policy.","date":"Wed Dec 16 21:45:45 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Perhaps, at last, the nonsense is over. \n\nPerhaps republicans will stop undermining our democracy.\n\nAmerica's constitution is strong and has survived four years of attack. \nhttps://t.co/FjXO4dp89y","date":"Sat Dec 12 00:46:45 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish all lighting the first candle tonight a joyous and #HappyHanukkah https://t.co/lLX1tWmYRa","date":"Fri Dec 11 05:39:54 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"In the midst of a global pandemic, it's unsurprising that India’s farmers are worried about the impact of recent agricultural reforms. As we know from our own experience in the US, citizens have every right to protest peaceably, be accommodated &amp; their concerns listened to. (2/3)","date":"Wed Dec 09 01:00:09 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"The farmers yearning to be heard are another powerful example of how peaceful protest is just one of the many cherished democratic traditions binding our countries together. Thank you Jaspal Singh &amp; Global Punjabi’s Forum for sharing your perspective w/me on these issues. (3/3)","date":"Wed Dec 09 01:00:09 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"As chair of the Caucus on India &amp; Indian Americans, I’ve proudly championed the close partnership between the world's largest and oldest democracies. It's a partnership built on both interests and values, including a shared dedication to human rights and freedom of speech. (1/3)","date":"Wed Dec 09 01:00:09 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today we remember the thousands of Americans who lost their lives at #PearlHarbor and honor their heroism and bravery.","date":"Tue Dec 08 02:30:18 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Local city councils are best positioned to decide how to spend their funds on public safety, and how much of that should be spent on traditional policing. (2/3)","date":"Sat Dec 05 19:19:08 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"In May Dems in Congress passed the #HeroesAct which would’ve provided about $1 trillion for state &amp; local gov. Senate Republicans refused to consider the bill, knowing that by blocking it, they were defunding the police in LA and around the U.S.A. (1/3)\n\nhttps://t.co/CZyNgPp8xJ","date":"Sat Dec 05 19:19:08 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Senate Republicans have worked to starve local government, which have lost revenue due to #COVID. This hurts schools, public health, firefighters, and public safety. (3/3)","date":"Sat Dec 05 19:19:08 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to say Congress has now acted on the Commission's \"top recommendation\" by passing the Kennedy-Sherman bill, the Holding Foreign Companies Accountable Act, yesterday.  https://t.co/ZfHcUUNTFf","date":"Thu Dec 03 20:47:00 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Saddened to learn of the passing of U.S. Olympic legend Rafer Johnson. His dedication to charity and youth in the San Fernando Valley, as well as his support for the Special Olympics, will long be remembered.","date":"Wed Dec 02 20:46:38 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today I join in remembrance of those tragically killed on Nov 26 2008 in Mumbai, India by the foreign terrorist organization, Lashkar-e Tayyiba. We must continue to work with our partners to dismantle terrorist networks &amp; hold those responsible for such heinous attacks to account","date":"Fri Nov 27 00:16:43 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish everyone a safe and #HappyThanksgiving. Although some of us may be apart this year, may this day still serve as a reminder on the importance of family, friends and community. https://t.co/31bSg6HrDh","date":"Thu Nov 26 17:30:27 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"And, I strongly agree that the FAA must address the unacceptable impact on San Fernando Valley residents from aviation flights over our community. (2/2)","date":"Thu Nov 26 00:32:57 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to speak with LA City Attorney Mike Feuer today about the city’s efforts to address the increased volume of flights over schools and neighborhoods. (1/2)","date":"Thu Nov 26 00:32:56 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Yesterday @RepRaskin &amp; I introduced H.Res.1231, calling for an end to enforced disappearances in Asia and around the world. This resolution calls for justice for victims of enforced disappearances and accountability for those who commit these crimes.\nhttps://t.co/cvOWECNCAM","date":"Fri Nov 20 19:53:55 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"This is a step backwards. This temporary decision must be reversed soon.  \nhttps://t.co/o5MTKmD0cc","date":"Thu Nov 19 21:20:27 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"The AP provides for greater safeguards &amp; access to additional sites in a country with a nuclear program. It's essential, especially for a country that wants to play around w/enrichment. If you can’t trust a regime with a bone saw, you can't trust them with nuclear weapons. (3/3)","date":"Thu Nov 19 20:14:41 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Saudi Arabia wants to partner with the United States on a civil nuclear program. They need a Section 123 agreement with us in order to do so in a meaningful way. (2/3)","date":"Thu Nov 19 20:14:41 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Yesterday I spoke to the NDAA Conference Committee urging the inclusion of my amendment that would prevent the submission of a 123 Agreement unless the partner nation signs an Additional Protocol. (1/3)","date":"Thu Nov 19 20:14:41 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Happy #Diwali to all those celebrating the Festival of Lights. \n\nNow more than ever, we should heed the lessons of this cherished tradition and help ensure that light triumphs over darkness, knowledge prevails over ignorance and empathy is prioritized over apathy.","date":"Sat Nov 14 20:39:14 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I ask the @StateDept and the US Co-Chair to the @OSCE to work with our partners to achieve a fair and balanced long term settlement. Artsakh’s right to self determination must be preserved. (3/3)","date":"Thu Nov 12 04:46:56 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"The terms of the Russia and Turkey-backed ceasefire ending Azerbaijan’s unprovoked violence against #Artsakh and #Armenia are unfair. The Trump Administration’s absence was glaring and led to disastrous results for the people of Armenia. (1/3)","date":"Thu Nov 12 04:46:55 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Who drafted this ceasefire agreement? None other than Putin and Erdoğan. This is the result of a lack of U.S. leadership. We must not stand for this disastrous deal forced on Armenia. We must not view it as a final settlement. (2/3)","date":"Thu Nov 12 04:46:55 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Welcome to the San Fernando Valley and the 30th Congressional district.\nhttps://t.co/KwHLUhB5HB","date":"Wed Nov 11 23:00:20 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Although on this #VeteransDay we are separated in person, we are bound together through our collective respect, admiration and immense gratitude to all who have served and sacrificed so much to defend our freedom. Today, and every day, we carry the memory of their service. https://t.co/zLesnkHTmz","date":"Wed Nov 11 15:42:05 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"This is beyond an unacceptable and dangerous statement by @SecPompeo. The integrity of our democracy and the peaceful of transition of power is no laughing matter, especially for someone who is supposed to be America’s emissary to the world.","date":"Tue Nov 10 20:11:53 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Last month, over 100 Members of Congress joined me in calling for renewed cooperation with the international community on global public health (1/2)\n\nhttps://t.co/T2rrUpOAnU","date":"Tue Nov 10 00:34:06 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Pleased to see that President Elect-Biden’s newly released plan for a stronger response to #COVID19 will include these important recommendations. (2/2)\nhttps://t.co/nxDUizDilT","date":"Tue Nov 10 00:34:06 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Saddened by the passing of legendary @Jeopardy host Alex Trebek, a man who brought joy to millions of Americans for so many years. His tremendous support for San Fernando Valley charities, like @hopeofthevalley, is a testament to his overall character &amp; legacy. He will be missed.","date":"Mon Nov 09 00:30:02 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/yihwyDI8pr","date":"Sun Nov 08 02:57:45 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/LPSQSo9rIX","date":"Sun Nov 08 01:52:52 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Congratulations President-Elect Biden and Vice President-Elect Harris. Our four year national nightmare is over.","date":"Sat Nov 07 21:59:28 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"When the US joined the #ParisAgreement under Obama, we pledged to cut our emissions by 26-28% by 2025. We are nowhere near hitting those targets and this week, the US became the only country to officially exit the agreement. #AcceptScience #ClimateCrisis  \nhttps://t.co/G1fr3ApoEy","date":"Fri Nov 06 23:18:58 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I am shocked and saddened by the horrific attack in #Vienna. My thoughts are with the victims, their families and the Austrian people. \n\nWe stand in full solidarity with Austria and must stand firmly together against hatred and terror everywhere.","date":"Tue Nov 03 02:18:26 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Global leadership is not lashing out at decisions we don’t like, but rallying international support behind America’s position. (2/2)","date":"Sat Oct 31 02:16:45 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Last month the Trump admin. sanctioned International Criminal Court officials, including the chief prosecutor. This admin continues to undermine our credibility, and meanwhile has done nothing to address U.S. concerns regarding the ICC. (1/2) https://t.co/bdXKbzdRMi","date":"Sat Oct 31 02:16:44 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I put my ballot in the mail last week. Angelenos, if you haven’t mailed your ballot, please do so today or tomorrow. \n\nMail it, or put it in one of the many ballot collection boxes. Or vote in person. But whatever you do, #Vote! https://t.co/GNEfAXuaja","date":"Fri Oct 30 22:35:08 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"As the author of the US-Israel Energy Cooperation Program, whose projects are administered by the Binational Industrial Research &amp; Development (BIRD) Foundation, I oppose expanding the scientific cooperation agreements to include Israeli settlements. (1/3) https://t.co/DmbGDxCV30","date":"Thu Oct 29 21:50:56 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Funding from BIRD, BARD and BSF has gone to important research. For several years I have led the effort to seek robust appropriations for these valuable scientific research programs. They are particularly good scientific investments because Israel funds half the cost. (2/3)","date":"Thu Oct 29 21:50:56 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"The Trump administration’s action is transparently political. It will undermine efforts to fund cooperative scientific research, which has wide bipartisan support, by linking it to highly controversial settlement policies. (3/3)","date":"Thu Oct 29 21:50:56 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/tYXSQ4LToU","date":"Thu Oct 29 16:09:12 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"https://t.co/yHjlZfsELu","date":"Thu Oct 29 14:53:24 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"From inviting Michael’s wife Helen as a witness to meeting with the Ambassador of Vietnam, I want to thank @RepKatiePorter for involving me in her tireless efforts to release Michael. (2/2)","date":"Wed Oct 28 21:32:59 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I joined @RepKatiePorter @RepLowenthal @RepAlGreen @RepLouCorrea @RepTedYoho and @RepHarley to herald the release of Michael Nguyen who was imprisoned in Vietnam since July 2018. His release is an important step for the U.S.-Vietnam relationship. (1/2)\n\nhttps://t.co/tziD08a3A5","date":"Wed Oct 28 21:32:59 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Looking forward to virtually hosting the Parliamentary Exchange in November. (2/2)","date":"Wed Oct 28 19:18:59 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Great to see India &amp; the U.S. conclude another successful 2+2 Ministerial yesterday to further expand the U.S.-India relationship. Also great to see mentioned the U.S.-India Parliamentary Exchange I established with my India Caucus Co-Chair last Dec. (1/2)\nhttps://t.co/n2JNBUlS7q","date":"Wed Oct 28 19:18:59 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Congrats to the #Dodgers on winning the 2020 #WorldSeries! \n\n#LATogether","date":"Wed Oct 28 03:42:51 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I want to thank Dr. Asif Mahmood for his advice on matters of public health, human rights and international relations. His attention to issues affecting Uighurs, Kashmiris and Rohingya, shed light on the experiences of those peoples.","date":"Tue Oct 27 21:42:43 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today marks two years since the tragic murder of worshipers at the Tree of Life Synagogue in #Pittsburgh. We remember and honor those we lost, and we must continue to stand against and combat anti-Semitism and hate in all its forms. #StrongerThanHate","date":"Tue Oct 27 20:13:14 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I Stand with @SEIU2015 by supporting their pledge! Time to invest in #LongTermCare! Read more about the pledge here: https://t.co/9JlptxRotR #Congress4Caregivers (2/2)","date":"Sat Oct 24 18:13:31 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Caregivers are essential, not sacrificial! Vice President Biden is the first presidential candidate to create a Care Plan to support caregivers. We need an Administration that recognizes their contributions and invests in #LongTermCare! (1/2) https://t.co/vmaU3CPehu","date":"Sat Oct 24 18:13:31 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Extremely disturbing to see the U.S. sign an anti-abortion declaration with largely illiberal or authoritarian governments. Reproductive rights are human rights. Despite the name, this flies in the face of existing consensus about these rights at the @UN.\nhttps://t.co/3ISp90vNuC","date":"Fri Oct 23 19:34:10 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today @RepTjCox @RepJimCosta @RepKClark and I led many of our colleagues in calling on the Trump administration to impose significant consequences on those responsible for Azerbaijan’s campaign of aggression against the people of #Artsakh.\nhttps://t.co/8ZalQgPHCm","date":"Fri Oct 23 16:15:32 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Four weeks on and Azerbaijan has violated TWO ceasefire agreements and continues its indiscriminate targeting of Artsakhians. The message from Azerbaijan is clear: violence, not negotiations, is the answer. (1/2)","date":"Thu Oct 22 22:24:28 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"The U.S. must send a different message: if the offensive continues, we are prepared to recognize the Republic of #Artsakh as an independent nation. (2/2)","date":"Thu Oct 22 22:24:28 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Tonight, in a last minute press conference two weeks before election day, DNI John Ratcliffe says the US is \"using the most powerful weapon we have to combat\" foreign interference. This couldn't be further from the truth. See my recent op-ed for @thehill: https://t.co/E9aBb8AIhf","date":"Thu Oct 22 01:57:33 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Trump's approach to international health cooperation is simply reckless. Today 100 Members of Congress joined @RepJudyChu @RepMcGovern &amp; me in calling for renewed cooperation w/ the international community to address the current crisis &amp; future pandemics.\nhttps://t.co/T2rrUpOAnU","date":"Thu Oct 15 01:10:01 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"It is with a heavy heart that I announce the passing of my mother, Lane Sherman. Below is an obituary that describes her remarkable and long life. \nhttps://t.co/jbIbpXnPMQ","date":"Mon Oct 12 05:56:42 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today I was honored to stand in solidarity with the thousands who gathered at the #MarchForVictory in Los Angeles to condemn Azeri and Turkish aggression against #Artsakh and Armenia. \n\n#ArtsakhStrong https://t.co/CLkD02XzTB","date":"Mon Oct 12 04:51:24 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I will be marching with and speaking to the thousands gathering for the #MarchForVictory as we express our solidarity with the people of #Artsakh. \n\n#ArtsakhStrong","date":"Sat Oct 10 23:37:07 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"It’s time for the U.S. to apply Global Magnitsky sanctions on Azeri officials responsible for targeting civilians in #Artsakh. It’s also time to end security cooperation w/Azerbaijan without delay, including any arm sales, security assistance &amp; training.\nhttps://t.co/sgG4k8A3g3","date":"Sat Oct 10 00:28:46 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I'm proud to once again receive a 100 on @HRC‘s Congressional Scorecard. I will continue championing #LGBTQ rights until true equality is achieved. #HRCscorecard \n\nhttps://t.co/BNZyI9TlKV https://t.co/trJ68BF0Ai","date":"Thu Oct 08 21:13:21 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I’ve received my share of anti-Semitic comments and threats online. And it’s not just Members of Congress: journalists, student activists and others face intimidation daily. \n\nWe must never become complacent to anti-Semitism. @ADL","date":"Wed Oct 07 21:31:40 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I urged @StateDept to continue to push Turkey that the deployment of foreign fighters in the region is unacceptable and will be met by a response from the United States. (2/2)","date":"Wed Oct 07 03:12:38 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today, I spoke to Deputy Assistant Secretary #GeorgeKent and U.S. @OSCE Minsk Group Co-Chair Andrew Schofer about reports that Turkey is recruiting and deploying fighters from “jihadist groups” in Syria to the Artsakh-Azerbaijan border. (1/2)","date":"Wed Oct 07 03:12:37 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Attention Woodland Hills voters. Check your ballot carefully.\nhttps://t.co/dlOPIAFoYx","date":"Wed Oct 07 00:36:12 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Is he trying to lose?\nhttps://t.co/SLptxZMxkW","date":"Tue Oct 06 22:23:00 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"In light of the acts of aggression by Azerbaijan along the Artsakh border, we must stand in support of the people of Armenia. That’s why I joined @RepSpeier to introduce H.Res. 1165 that condemns Azerbaijan's military operation and Turkish interference in #Artsakh.","date":"Mon Oct 05 23:20:09 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Russia's interference in our elections is unacceptable and the President has failed to stop it. \n\nThat's why I, along with @RepMaxineWaters, am introducing the SECURE Act which places significant economic sanctions on Russia until this interference stops.\nhttps://t.co/3Kkt0ml7rj","date":"Fri Oct 02 01:59:23 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"We must condemn this aggression and urge Baku to cease offensive military action and return to the peace table. We should halt military aid to Azerbaijan and urge Turkey to abstain from sending arms or fighters. (2/2)","date":"Sun Sep 27 21:49:33 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"At this sacred time for my family and co-religionists, I’m troubled by the recent Azeri attacks on Artsakh. (1/2) \n\nhttps://t.co/4QZl1ObKav","date":"Sun Sep 27 21:49:33 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"This #YomKippur, my family and I will be watching the virtual service hosted by our San Fernando Valley synagogue.\n\nMay it be a day full of reflection, atonement and continuance of tradition. G'Mar Chatima Tovah.","date":"Sun Sep 27 19:05:35 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today I paid my respects in the U.S. Capitol to the notorious Ruth Bader Ginsburg. The first woman, and the first Jewish American, to lie in state in the Capitol. May her legacy and memory continue to inspire us all. https://t.co/pHSiQGreIa","date":"Fri Sep 25 19:38:29 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"575 days. That’s how long it’s been since the House passed #HR8, the Bipartisan Background Checks Act and how long McConnell has ignored the bill. Today as gun deaths continue to rise as our nation is sheltered in place, we #WearOrangeMasks to urge the Senate to take action. https://t.co/5gL1OaUYyP","date":"Thu Sep 24 21:05:02 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"[This tweet written by staff]\n\nThe Congressman is praying this Rosh Hashanah and will certainly remember the family of the indomitable Ruth Bader Ginsburg in his prayers.","date":"Sat Sep 19 15:13:06 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I want to wish a sweet and healthy New Year to everyone celebrating #RoshHashanah \n\nMay this be a time for reflection and renewal. L'shana Tova! https://t.co/LkKhMHnfEd","date":"Fri Sep 18 21:12:20 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I was horrified to see reports of mass hysterectomies performed on detained women in the #ICE facility without their consent and request. That's why I joined @RepJayapal and my colleagues to urge DHS Inspector General to immediately investigate these startling allegations. https://t.co/hsjHpqOEbH","date":"Thu Sep 17 17:57:16 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"\"If people are going to be fired because there's low morale, it starts with the top.\" \n\nToday I questioned three key witnesses in the probe over the firing of State Department Inspector General Steve Linick.\n\nhttps://t.co/Vwe94weHdz","date":"Wed Sep 16 18:38:25 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"If the horrendous conditions detailed by the whistleblower are true, then this is beyond outrageous &amp; an egregious violation of human rights. \n\nThe @DHSOIG must immediately investigate these allegations.","date":"Tue Sep 15 19:57:46 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Today, Bahrain is joining the UAE and taking an important step forward for peace in the Middle East. This brings us one step forward towards two states for two peoples.","date":"Tue Sep 15 16:03:35 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"We are seeing the direct impact of the #ClimateCrisis: Our air is unbreathable, our homes are burning and lives are being lost. \n\nTo continue to deny #ClimateChange is dangerous and reckless.","date":"Tue Sep 15 00:05:27 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) Only Brad Sherman accounts with the verified check mark are accounts that Congressman Brad Sherman controls. Other accounts are from other persons named “Brad Sherman” or they are parody accounts.","date":"Mon Sep 14 19:16:00 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"(1/2) I respond to constituents who email me at Brad.Sherman@mail.house.gov \n\nIf you need any assistance that my office can provide, contact my office at 818-501-9200 or visit: https://t.co/7pasaS91UF","date":"Mon Sep 14 19:16:00 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Bahrain is taking an important step for peace.\nhttps://t.co/5woq3Pu3x1","date":"Sat Sep 12 04:00:03 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Every September 11, we come together as a nation to mark this solemn day and to reaffirm our promise to #NeverForget those we lost and to never forget the strength and unity we found. https://t.co/ooNrcaWcqL","date":"Fri Sep 11 14:24:25 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Excellent article by @ronakdd","date":"Thu Sep 10 23:21:41 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"(2/2) View the House Asia Subcommittee hearing here:\nhttps://t.co/g91hPhwnJC","date":"Thu Sep 10 21:06:56 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"I chaired hearings on the Rohingya in the Asia House Subcommittee last year. This article underlines what we learned then. (1/2)\nhttps://t.co/UdvAlMXilU.","date":"Thu Sep 10 21:06:56 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"A Democratic House would have to approve any trade deal. \nhttps://t.co/rJhMa2lJbA","date":"Thu Sep 10 18:00:03 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Had an excellent conversation today with French Ambassador Etienne about our international cooperation and assisting Africa respond to COVID-19. I strongly support including the additional $11 billion to our COVID response for global health programs.","date":"Thu Sep 10 02:32:40 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"March 19: \n\n12,600+ confirmed COVID cases in U.S.\n\n265 confirmed COVID deaths in U.S.\n\nToday:\n\n6,334,150+ confirmed COVID cases in U.S.\n\n189,970+ confirmed COVID deaths in U.S.\n\n#TrumpKnew and still he buried the facts, costing thousands of lives in communities nationwide.","date":"Thu Sep 10 00:48:07 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"117 days ago, @HouseDemocrats passed the #HeroesAct and did something Trump has failed to do - #LEAD. It responds to the #COVID19 pandemic by supporting states with:\n\n🏠 Rental assistance\n🚌 Safe public transportation\n📚 Safe reopening of schools\n🏬 Small biz aid\n\n#SaveOurStates","date":"Wed Sep 09 17:52:48 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"This #LaborDay, we recognize the hard-fought achievements of the labor movement and reaffirm our commitment to continuing the fight #ForThePeople &amp; for workers’ rights, especially during this #COVID19 pandemic. https://t.co/MPCEMKHTzN","date":"Mon Sep 07 14:06:51 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"Despite today’s heat, I was proud to attend the #BlackLivesMatter protest at the Sherman Oaks Galleria &amp; stand with those who are demanding change. \n\n@HouseDemocrats passed the George Floyd #JusticeInPolicing Act— it’s time for @SenateGOP to listen to the people &amp; pass this bill. https://t.co/DJbpgkvj5V","date":"Sun Sep 06 05:14:13 +0000 2020","user_id":"30216513"},{"handle":"BradSherman","text":"(3/3) The rights to free expression and assembly are absolute and must be protected. I commend the work of @amnesty to detail these heinous acts and their efforts to hold Iran accountable. The report can be found here: https://t.co/uQNj1CXDsn","date":"Sat Sep 05 04:29:05 +0000 2020","user_id":"30216513"}]