[{"handle":"CathyMcMorris","text":"ICYMI: I joined @CNBC to discuss how out of touch President Biden is with his war on American energy and actions we can take right NOW to drive down costs at the pump. ⬇️\nhttps://t.co/vQ3BfTzqte","date":"Thu Jun 16 20:30:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"American energy is foundational to everything in our lives.\n\nThis administration seems to be more interested in their own political agenda than what is best for hardworking American families. It’s making everything MORE expensive. https://t.co/1kaTWSrNwa","date":"Thu Jun 16 19:59:47 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":".@WSUPullman President Kirk Schulz &amp; several WSU representatives stopped by my office in D.C. to give me an update on the exciting developments taking place at the university. I always appreciate hearing how WSU is preparing our next generation of leaders for success. #GoCougs! https://t.co/gYeFAU4Whr","date":"Thu Jun 16 18:23:06 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"In the PNW, forest fires have become an unfortunate part of life, but it doesn’t have to be that way. Today, I introduced the FORESTS Act with @RepNewhouse to put in place real solutions that can protect our forests. Read more: \nhttps://t.co/bMAI5socgM","date":"Wed Jun 15 19:23:37 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"American families are struggling to pay to fill their gas tanks and the price of everything they buy is going up, including food.\n\nTo improve people’s standard of living and lower costs, we MUST unleash American energy.\nhttps://t.co/klbVfCtp3z","date":"Tue Jun 14 21:00:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"President Biden’s anti-American energy agenda has been clear since day one in office.\n\nRepublicans tried to warn of the consequences.\n\nInstead of reversing course, @POTUS continued to shut down American energy.\n\nThe result? A national average gas price over $5/gal.","date":"Tue Jun 14 19:00:01 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"The American flag is one of the greatest symbols of freedom and promise in the world. No matter how tough things get, Old Glory will be there to remind us there’s so much more that unites us than divides us. One nation under God, indivisible, with liberty &amp; justice for all!🇺🇸 https://t.co/vLGMp8NvXB","date":"Tue Jun 14 18:00:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"Read what people are saying about our new framework to establish a national privacy standard.\n\n@HouseCommerce’s solutions protect Americans and set clear rules for consumer privacy and data security. 🔐\nhttps://t.co/im1Bgz4cZN","date":"Tue Jun 14 17:25:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"Today, we celebrate the @USArmy’s 247th birthday. To all the brave men and women — past and present — who have put on the uniform: thank you for your unparalleled devotion to duty, unit, and country. We are incredibly grateful for your service to our nation. https://t.co/4iKzF1W1FA","date":"Tue Jun 14 16:30:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"Let’s keep working together on the American Data Privacy and Protection Act so America wins the future in technological innovations that raise our standard of living and improve people’s lives all across the globe. https://t.co/e330q3pjxZ","date":"Tue Jun 14 16:00:03 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"The internet doesn't end at state lines, and neither should privacy protections. Americans deserve better than a patchwork of different state laws.\n\nThe American Data Privacy and Protection Act creates a national standard so people can trust how their data is collected and used.","date":"Tue Jun 14 15:40:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"Americans can’t afford $5/gal gas.\n\nWe need to #FlipTheSwitch on American energy production and help lower prices at the pump. https://t.co/WGV3gXWJ82","date":"Mon Jun 13 20:04:13 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"Democrats have had SIX CHANCES to vote yes on unleashing American energy production to lower prices at the pump.\n\nInstead, they’ve BLOCKED the American Energy Independence from Russia Act SIX TIMES.","date":"Mon Jun 13 16:00:01 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"How expensive will gas prices need to get for President Biden to say “YES” to American leadership that unleashes our abundant energy resources and technological innovation?","date":"Sat Jun 11 15:25:27 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"My colleagues and I are demanding that the Biden administration provide specific plans for how it will prevent potential electricity emergencies this summer. \n\nRead our letter to @SecGranholm and @FERC ↓ \nhttps://t.co/DfXOB3XSKx","date":"Fri Jun 10 16:30:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"Today, I introduced the bipartisan DEFEND Act with my colleagues in the Abraham Accords Caucus. It sends a clear message that our country is prepared to do what it takes to help our allies stand up to Iran &amp; preserve the peace we’ve worked hard to achieve.\nhttps://t.co/GcqIOpYKsG","date":"Thu Jun 09 21:30:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"While Governor Inslee and Senator Murray forge ahead with their political agenda to tear out the four Lower Snake River dams, we will continue promoting real solutions to reduce carbon emissions, drive down energy costs, and help recover endangered salmon.","date":"Thu Jun 09 20:23:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"Great news! The House passed the Water Resources Development Act last night with my provisions to protect the Lower Snake River dams and advance Columbia River Treaty negotiations.\n\nThis bill is a HUGE win for our Eastern Washington community. Read more:\nhttps://t.co/GYh6jo4R3j","date":"Thu Jun 09 18:45:29 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"It’s estimated this year Americans will spend $5,000 dollars on gas, a 78% increase from last year. 📈   \n\nPresident Biden’s attack on American energy production and jobs created the #BidenEnergyCrisis.\nhttps://t.co/ISIVVhL7Mf","date":"Thu Jun 09 16:30:00 +0000 2022","user_id":"17976923"},{"handle":"CathyMcMorris","text":"Chloe's life is proof that every life is worth living. \n\nRead and share her story ↓  \nhttps://t.co/yEXSPvIr7s","date":"Thu Jun 09 14:25:29 +0000 2022","user_id":"17976923"}]