[{"handle":"CongMikeSimpson","text":"https://t.co/fnSoG6hNy9","date":"Thu Jun 16 23:43:43 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Like many others, the auto industry has suffered from severe supply chain issues. These issues have caused delays &amp; increased costs for dealers. \n\nH.R. 7382 would provide greatly needed relief for Idaho’s auto businesses &amp; I hope the House acts quickly to pass this bill.","date":"Thu Jun 16 23:43:43 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Meet Alora Thorton, she is representing Idaho's 2nd Congressional District at the 75th Annual Idaho Syringa Girls State!\n\nFrom her hometown of Rigby, ID Alora is learning how government works in Idaho, and empowering other young women to enter the field of public service https://t.co/tzc02X6AJD","date":"Thu Jun 16 19:15:44 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Gas prices have now doubled under the Biden Administration. The American family should not have to pinch pennies simply to commute to work, school, and the grocery store.\n\nI will continue to stand for American energy independence, and fight for Idaho families. https://t.co/st2xwOVkKv","date":"Thu Jun 16 19:12:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"HEADS UP! The Boise VA is implementing a new software program on June 25th called Cerner that will be used to manage electronic health records. If you are a veteran, be sure to review the following from the Boise VA. https://t.co/DDNf9Ng7KA","date":"Wed Jun 15 21:47:23 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am hopeful that all Americans will pause a moment to take stock of the way we talk about politics and to lower the temperature on divisive political rhetoric, remembering that our words and actions have very real consequences. (2/2)","date":"Tue Jun 14 23:20:53 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"When individuals choose violence and threats to express their policy disagreements, we are all less safe.\n\nHR 7705 is essential to protect the families of justices as well as the overall rule of law in our country. (1/2)\n\nhttps://t.co/62rF7dLabD","date":"Tue Jun 14 23:20:52 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to the Hailey FC Lightning! Good luck in the 2022 Far West presidents Cup.\nhttps://t.co/Yyc0MgwUxq","date":"Tue Jun 14 19:46:18 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"247 years of bravery, sacrifice, and dedication.\n\nThank you to all the brave veterans and current service members who defend out great nation.\n\nHappy 247 years of excellence 🇺🇸 https://t.co/RSmJSrBV19","date":"Tue Jun 14 17:11:55 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"May we all look to our flag as a symbol of unity and strength and take a moment to appreciate our great nation.\n\nHappy #FlagDay 🇺🇸 https://t.co/1hfyxAFPGU","date":"Tue Jun 14 17:03:38 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Summer is the perfect time to explore Idaho’s beautiful outdoor spaces. \n\nHelp preserve and protect these spaces by learning how to recreate responsibly. \n\n#RecreateResponsiblyIdaho\n\nhttps://t.co/1Y1xS39Vdn","date":"Fri Jun 03 16:57:36 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"These Guardsmen with the Air Force Special Tactics lived up to their motto to be “First There…That Others May Live.”\n\nThank you to all National Guardsmen who put community over self.\n\nhttps://t.co/Zi4HBXE97s","date":"Thu Jun 02 20:10:03 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is #WorldMilkDay and the start of #NationalDairyMonth.\n\nJoin me in raising a glass🥛to celebrate Idaho’s incredible dairy farmers. They produce more milk per capita than anyone else in the U.S., and provide our state with healthy and delicious dairy products!","date":"Wed Jun 01 21:18:28 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The #CongressionalAppChallenge is among the most prestigious tech contests for middle &amp; high school students in the U.S. &amp; I have enjoyed helping Idaho’s students participate.\n\nRegistration for the contest opens today! Find out more by visiting my website: https://t.co/puIlSj9fyH https://t.co/QplQnrAzP9","date":"Wed Jun 01 17:58:35 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I was glad to join the Idaho Potato Commission’s Ag affairs meeting last week to discuss important things happening in Washington — like immigration workforce reform, the Farm Bill, &amp; rising costs.\n\nI look forward to working with them to find solutions to these important issues. https://t.co/w6hnqTuS8a","date":"Tue May 31 22:49:35 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On #MemorialDay we remember and honor those who gave their lives in defense of the freedoms we cherish. God bless all who serve 🇺🇸 https://t.co/9LHQWzDa6s","date":"Mon May 30 15:40:39 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My statement on the horrific shooting in Uvalde, Texas. https://t.co/mVvmMPGKer","date":"Thu May 26 19:57:25 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Biden’s “incredible transition” is crushing American families. https://t.co/bnjdSV2QAR","date":"Tue May 24 21:37:15 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Armed Forces Day to all those who have served our great country. God bless you all 🇺🇸🇺🇸 https://t.co/6ljdsSL8MJ","date":"Sat May 21 19:22:15 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today marks 11 days straight of record high gas prices. \n\nDaily life is far more expensive today than it was on Jan 20, 2021 and Democrats refuse to do what is necessary to build domestic energy production.\n\nhttps://t.co/lcVLrVtzGH","date":"Fri May 20 22:40:49 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Irresponsible federal spending is one of the drivers of #Bidenflation. The Democrats bill shows that the Administration just wants to continue the same failed policies that are hurting American families.","date":"Fri May 20 17:20:31 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Biden Administration is currently sitting on $1 billion of appropriated funds to address supply chain issues that the FDA could use for the formula crisis. But instead they want another $28 million for “salaries and expenses.”","date":"Fri May 20 17:20:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to James and Luke from Timberline High — they finished 2nd in the cyber security award at the 2022 Regeneron International Science and Engineering Fair. \n\nWhat an exciting accomplishment!","date":"Thu May 19 21:30:22 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"After only a few weeks since it was first announced, Biden’s ‘Disinformation Governance Board’ is being paused. \n\nSimply put, the federal government has no business being the arbiter of truth and the American people are better off without this Board in place.","date":"Wed May 18 18:35:39 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"1 in 5 people experience a mental health condition. \n\nTaking care of your mental health is important and Idahoans can find resources to help them do that. https://t.co/PxUSf6BmhB\n\n#MentalHealthAwarenessMonth https://t.co/V4e0iP6CCH","date":"Wed May 18 15:30:52 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"To the parents of young children impacted by the shortage of baby formula, please beware of these scams. \n\nLearn about the warning signs and prevent scammers from taking advantage of your situation.","date":"Tue May 17 16:28:33 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In light of the recent nationwide debates on abortion, I remain fervently committed to protecting the rights of the unborn. \n\nI am pleased to reaffirm this priority by cosponsoring the Life at Conception Act\n\nhttps://t.co/sdXewGXg9e","date":"Mon May 16 21:10:31 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is exciting news for Potato growers in Idaho and a great step to ensuring Mexico keeps their end of the deal. \n\nI will continue to use my seat in Congress to support open trade that benefits our state’s growers.","date":"Thu May 12 23:25:08 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Biden has repeatedly told the American people how his administration has done nothing to harm domestic energy production. \n\nAll the while, @POTUS continues to cancel oil sales from Alaska to the Gulf and prices at the pump continue to skyrocket.","date":"Thu May 12 21:07:11 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The baby formula shortage is a serious health &amp; safety concern for American families. It’s time @POTUS step up to help parents in this time of critical need.\n\nI joined 105 of my colleagues to urge Biden to take immediate action. Read the letter here ⬇️\n\nhttps://t.co/eWY5kPTz4T","date":"Thu May 12 18:20:36 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Milk comes from a cow – not an almond or coconut or anything else.\n\nI am fully committed to supporting the dairy producers of our state and providing honest labelling for consumers.\n\nRead about how I am supporting Idaho Dairy ⬇️\n\nhttps://t.co/ALjzAogq4R","date":"Wed May 11 23:57:56 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho is blessed with some of the best police officers in the nation. As we kick off #NationalPoliceWeek, let’s remember that these brave men and women put everything on the line to keep us safe.\n\nMore than ever, they need our support. That is why I will always #BackTheBlue. https://t.co/r1mUoAp4Uk","date":"Wed May 11 21:19:47 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“A breather”\n\nMeanwhile…\n\n📈Gas is UP 43.6%\n📈Groceries UP 14.3%\n📈Electricity UP 11 %\n\n#Bidenflation is a tax on all Americans.","date":"Wed May 11 15:05:29 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Over the course of the last year, fentanyl has crossed our southern border at skyrocketing rates.\n\nOn #FentanylAwarenessDay, I am proud to support legislation to stop this dangerous drug from crossing the border and harming our communities.\n\nhttps://t.co/AbF8SHkEG4","date":"Tue May 10 23:27:48 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho’s gas prices are expected to reach a new record high at over $4.50/gallon. \n\nWith #Bidenflation and rising gas prices wreaking havoc on Idaho families, it’s long past time for @POTUS to unleash American energy production and make America energy independent again!","date":"Tue May 10 21:47:41 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"House Dems have attempted a federal takeover of elections in the name of “voting rights.” \n\nWhile I will continue to fight for voting rights &amp; the integrity of U.S. elections, we all must be wary of election reforms that do not achieve this purpose.\n\nhttps://t.co/VN0BoFgbjC","date":"Tue May 10 19:21:55 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Protesting is an American right but violence and intimidation are never acceptable.","date":"Mon May 09 23:06:26 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Americans are not only paying more for everything because of  #Bidenflation, but real wages have decreased in nearly every month since Biden took office.\n\nIt is no wonder that Americans are less confident about the economy today than they’ve been in over a decade.","date":"Mon May 09 17:22:56 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho is home to one of the richest supplies of essential critical minerals in the nation.\n\nI look forward to working with Idaho’s mines and @EPAMichaelRegan to build up a domestic supply of these important resources.","date":"Mon May 09 16:00:58 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"When small business is strong, Idaho is strong. #SupportLocalGems today by visiting the small businesses that make our state unique.\n\nWhat are some of your favorite local businesses in your community? https://t.co/Fv7bF6rI71","date":"Fri May 06 18:38:45 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":".@POTUS needs to worry less about putting the government in charge of the ‘truth’ and get to work on solutions for the very real problems that are facing our country — problems his Administration created. \n\nhttps://t.co/1OVrvlY9re","date":"Thu May 05 23:58:50 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Americans should recognize Biden’s “Disinformation Governance Board” for what it is: an authoritarian power grab by Democrats who want to tell us how to think.","date":"Thu May 05 23:58:49 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am glad to hear that these two brave officers are in stable condition. Kathy and I will be praying for a speedy and full recovery.\n\nOur law enforcement put everything on the line to keep us safe. I remain committed to do what I can in Congress to support them. #BackTheBlue","date":"Thu May 05 21:02:57 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In response to the burden the vaccine mandate has placed on Idaho’s farmers I have cosponsored the TRUCKERS Act, which would prohibit the Biden Admin from requiring vaccines for Canadian and Mexican drivers who temporarily enter the country. (2/2)\n\nhttps://t.co/3KvFQNOJKe","date":"Thu May 05 18:12:55 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Speaking with Idaho truck companies, I have heard repeatedly how Biden Covid restrictions at our northern border are making current supply chain issues &amp; inflation worse.\n\nNo industry understands this more than Idaho Ag, who are not receiving the seedlings they depend on. (1/2)","date":"Thu May 05 18:12:54 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Small business is the backbone of our economy and @SenatorRisch is right — it’s time for us to be there for them. \n\nOn May 6th, #SupportLocalGems by visiting the local businesses in your community.","date":"Wed May 04 22:02:32 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#SCOTUS\n\nhttps://t.co/vWYXENkgmF https://t.co/Ny4tlfUEDF","date":"Wed May 04 20:01:10 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Yesterday was #NationalTeachersDay and it’s #TeacherAppreciationWeek. \n\nI want to thank all of Idaho’s incredible educators for their dedication to our students.","date":"Wed May 04 19:24:10 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Join me in wishing my friend @SenatorRisch a Happy Birthday! \n\nThank you for your leadership and for the many years of service you have dedicated to our state. https://t.co/xipc7iVDUF","date":"Tue May 03 22:30:56 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In Congress, I continue to support many initiatives that protect gun ownership, eliminate onerous existing limitations on gun ownership, and prevent additional limitations from being realized. \nhttps://t.co/ZGOF0hYtPX","date":"Mon May 02 17:09:40 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to Vera C. O'Leary Middle School for advancing to the National Science Bowl's National Finals!","date":"Mon May 02 16:51:15 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho’s forests contribute $2 billion annually to the state’s economy and provide nearly 31,000 jobs. The REPLANT Act is crucial in guaranteeing this important industry’s long-term sustainability.\n\nI thank American Forests for this recognition.\nhttps://t.co/ULCxUrWwIc","date":"Fri Apr 29 20:41:35 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/JXgdeXIgT1","date":"Thu Apr 28 16:19:49 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"What Americans want is order, yet Biden’s border policy is chaos. \n\n@POTUS45 and @SecMayorkas must listen to the warnings from those at the border — revoking Title 42 would be a serious oversight and create heavy burdens on the already strained border control workforce.","date":"Thu Apr 28 16:19:49 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/zAmkRUf8Aj","date":"Tue Apr 26 21:59:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I have fought for years against expansive WOTUS overreach and supported President Trump’s efforts to implement the Navigable Waters Protection Rule, which responsibly outlines the jurisdiction of federal, state, and local authorities and appropriately respects states like Idaho.","date":"Tue Apr 26 21:59:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“Inflation is as violent as a mugger…” – Ronald Reagan\nThe average rate of inflation in states like Idaho is 10.4% - far above the national rate. #Bidenflation is robbing you of your living.\nhttps://t.co/qTzCAeKu7Y","date":"Tue Apr 26 18:07:36 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/Y4Yn9A9BbW","date":"Mon Apr 25 20:24:28 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"China’s goals of trade &amp; military dominance are a threat to the U.S. &amp; we should not neglect our policies of countering China’s aggressive &amp; reckless trade, health, human rights, &amp; military practices.\n\nLike many in Congress, I support efforts to send a strong message to China.","date":"Mon Apr 25 20:24:28 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Biden’s proposed change to the NEPA process will lead to overreaching regulation, increased costs, and unnecessary litigation on important infrastructure projects across the country.\n\nhttps://t.co/t7dZbKHpvF","date":"Mon Apr 25 16:00:36 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Orrin Hatch was one of the greats, and I will dearly miss him. His lifelong leadership and service will forever be remembered. Kathy and I send our love and prayers to the Hatch family at this time.","date":"Sun Apr 24 15:41:13 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The failure of the Biden Admin to take control of the border has allowed fentanyl to cross over at alarming rates.\n\nI am proud to cosponsor H.R. 7359 and take action when @POTUS won’t.\n\nhttps://t.co/AbF8SHkEG4","date":"Sat Apr 23 01:17:06 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Since Biden took office, I have been alarmed at efforts to drastically expand the federal regulatory reach.\n\nH.R. 986 will take important steps to reign in the federal bureaucracy by solidifying Trump rules to eliminate two regulations for every new one.\n\nhttps://t.co/CO8I20syPA","date":"Fri Apr 22 15:34:59 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Yesterday, a Clinical Resource Hub — the first of its kind in the VA — opened its doors in Boise.\n\nThis will be an incredible resource for Idaho Veterans and their families as they seek the care they deserve. I am excited to see this Hub come to Idaho. https://t.co/uJKSEUEYGs","date":"Thu Apr 21 18:11:57 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Putin is just the latest target of Biden’s blame game, but inflation has been an issue in EACH MONTH of his presidency. \n\nThis Administration’s unfriendly energy policies and trillions in reckless spending are the cause.","date":"Wed Apr 20 23:35:41 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I enjoyed the opportunity to visit with the great team at the Idaho Women’s Business Center in Twin Falls. \n\nIWBC offers a variety of important resources to help women start small businesses, and I am proud to support each of the states four centers. https://t.co/K20bQ4Rmz7","date":"Wed Apr 20 21:49:07 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks to the Idaho Trucking Association and Allen Hodges for allowing me to test out their simulator. \n\nIf recent events have taught us anything, it’s that we need more truck drivers. Idaho is leading the way in educating our young people about this essential trade. https://t.co/rVILxYBcOW","date":"Wed Apr 20 19:38:33 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s #NationalParksWeek — which means we celebrate “America’s Best Idea.”\n\nIdaho is home to a number of national park sites like Craters of the Moon &amp; the Minidoka Historic Site. As a lifelong supporter of National Parks, I will continue working to protect these precious spaces. https://t.co/eLoT1wYNZV","date":"Wed Apr 20 15:46:15 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Like many other issues facing our nation, Biden’s crisis at the southern border has only worsened throughout his presidency. \n\nAmericans expect a secure and safe border — Biden and House Dems have failed to do just that.","date":"Tue Apr 19 23:00:48 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"SRS payments are critical in funding schools and infrastructure — especially in Idaho’s rural counties. I am glad to see these important funds come to our state.","date":"Tue Apr 19 21:26:48 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Tax Day Idaho —\n\nLet’s not forget that while @POTUS promised no new tax increases on people making less than $400k, rampant inflation is a tax on everyone. #InflationIsTaxation","date":"Mon Apr 18 23:01:35 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As an artist myself, I enjoy hosting this competition each year. Find more information about participating on my website ⬇️\n\nhttps://t.co/0PyHk2yZun","date":"Mon Apr 18 20:31:06 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I had the privilege of spending World Art Day with the talented young artists who participated in the 2022 Congressional Art Contest.\n\nCongrats to Macie from Idaho Falls, who is this year’s contest winner. Her piece will represent our district while on display in the Capitol. https://t.co/wacKiVS82x","date":"Mon Apr 18 20:31:05 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idahoans should be proud of the position our state is in. \n\nCovid created challenges for everyone, but the balanced approach from our leaders put Idaho in a better economic position than most of the country.","date":"Mon Apr 18 18:21:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“He is not here, but is risen.” Luke 24:6\n\nHappy Easter! https://t.co/sXFoiS8iH3","date":"Sun Apr 17 15:13:27 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Closing federals lands to oil and gas drilling was a terrible mistake. \n\nFor months I have joined other House Republicans to urge returning to the energy independence under Pres. Trump. It’s a great first step @POTUS, but there is still of work to do.\n\nhttps://t.co/IZV9A8CkYz","date":"Sat Apr 16 14:24:35 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Idaho Congressional Delegation recognized #CommunityCollegeMonth &amp; Idaho’s four community colleges in a Congressional Record statement. \n\nThese institutions improve Idaho’s quality of life &amp; our economy. Thanks to @MikeCrapo for leading the charge.\n\nhttps://t.co/oL5UIIb2Ey","date":"Fri Apr 15 23:33:34 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"April is Community College Month. To honor the occasion, my office celebrated with CEI a $100k workforce grant I secured for their campus.\n\nCEI, like other colleges, is a life changing resource for many Idahoans as they prepare for successful careers.\n\nhttps://t.co/HBtMwxZzcy https://t.co/OcQzNmXhXE","date":"Fri Apr 15 23:33:33 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On April 15th, 1947 — 75 years ago  today — 42 changed the game of baseball. #JackieRobinsonDay https://t.co/jTMf4XtkwD","date":"Fri Apr 15 19:46:07 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I want to wish all a peaceful #GoodFriday. https://t.co/XjTruPtcjW","date":"Fri Apr 15 14:54:29 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Last year I worked hard to keep the bipartisan, pro-life Hyde Amendment intact.\n\nBiden and House Dems are trying to remove it again. I will continue fighting to protect this important provision and prevent taxpayer dollars from funding abortions.\n\nhttps://t.co/3r00qw79LK","date":"Fri Apr 15 00:17:36 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am one of the lucky 398 members of Congress who has been sanctioned by Russia. Dare I say I’ll wear this badge of honor with pride? \n\nCongress will continue to support Ukraine and its people in this senseless war 🇺🇸🇺🇦 https://t.co/eTeuDopLbt","date":"Thu Apr 14 14:02:33 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In Congress, I have pushed for EAJA reform to prevent special interest groups from creating excessive backlogs in our justice system &amp; taking advantage of the program.\n\nI remain committed to fighting misuse &amp; preserving legitimate access to our courts.\n\nhttps://t.co/vJbau3phz2","date":"Wed Apr 13 22:54:23 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Bright Future in Nuclear scholarship is a great opportunity for Idaho students interested in STEM. \n\nIf you know students interested in a STEM career path, let them know about this opportunity.","date":"Wed Apr 13 21:02:22 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In March, the CPI increased 8.5% from a year ago — its highest rate since December 1981.\n\n#Bidenflation is devouring paychecks and draining savings. The American people simply can’t afford Biden’s reckless policies.","date":"Tue Apr 12 15:58:48 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"What a catch, Tyler! \n\nSturgeon like this are one of many reasons that Idaho wilderness and wildlife are in a league of their own!","date":"Mon Apr 11 21:35:15 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"80% of fentanyl in the U.S. is trafficked through our southern border. These alarming numbers impact every community in the country, and Biden’s DEA expects the problem to get worse.\n\n@POTUS can’t ignore the border crisis any longer.\n\nhttps://t.co/FdD8HttRnF","date":"Mon Apr 11 18:12:13 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The impact of Idaho Ag cannot be overstated. That is why I have used my time in Congress to support Idaho’s ranchers &amp; producers and protect them from federal overreach.\n\nFind out more about how I have delivered for Idaho Ag in the 117th Congress: https://t.co/DHGKbG2oDL","date":"Fri Apr 08 23:06:08 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Biden is turning over every stone to fix the problems his domestic energy policies have created…except for expanding American energy production.\n\nIf the Admin truly cared about the environment or energy costs, they’d stop their regulatory assault on U.S. energy development.","date":"Wed Apr 06 17:42:21 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Farmers across Idaho are feeling the burden of high input costs. If we fail to act, farms could be jeopardized and inflation could become more burdensome.\n\nI am proud to join my colleagues in urging @POTUS to take actions &amp; lower costs for our farmers.\n\nhttps://t.co/NOYYReY00v https://t.co/hI2nc6Gz5D","date":"Wed Apr 06 15:19:52 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"62% of Americans can’t keep up with rising costs caused by rampant inflation.\n\nAs @HouseApropsGOP begins creating a responsible budget that addresses our nations crises, I will focus on policies that lower prices &amp; reign in Biden’s radical spending.\n\nhttps://t.co/8wegEtwmnz","date":"Tue Apr 05 22:50:40 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Our courageous service members sacrifice so much, but we also ask a lot of their spouses too. \n\nGod bless our Gold Star Spouses. We are so grateful for your selfless acts in support of our country. 🇺🇸 https://t.co/95RuVdt0VY","date":"Tue Apr 05 18:14:27 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congrats to Mr. Howell on receiving this recognition as Company Driver of the Year.\n\nSupply chain shortages over the last year have shown just how important drivers like Robert are to our national and state economy. Thank you for your hard work!\n\nhttps://t.co/j5qyQjQQQK","date":"Tue Apr 05 01:41:21 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In just the first half of FY23, the U.S. is on track to hit 1M illegal border crossings — a 63% increase from a yr ago. \n\nWith plans to eliminate Title 42, Biden and House Dems have created a crisis just waiting to explode. It’s clear they have no intention of securing the border","date":"Mon Apr 04 19:43:58 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I join the thousands of Idahoans who are mourning the loss of this incredible human being. \n\nLarry was one in a million and I’m honored I was able to know him. Sending love to his families, both personal and work.","date":"Sat Apr 02 23:37:17 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Current events have shown that the U.S. is far too reliant on unfriendly foreign nations for important resources. Whether it be oil &amp; gas or the critical minerals we need to power modern technologies, we can and should be sourcing these domestically.\n\nhttps://t.co/18QJ0LGWi3","date":"Fri Apr 01 23:05:18 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The average price per gallon in Idaho is $4.37 today — $1 more expensive than it was a month ago. \n\nWhat Idahoans need to find relief at the pump are policies that expand U.S. energy production. Tapping into the oil reserves is simply a political Hail Mary by @POTUS.","date":"Fri Apr 01 17:07:00 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congrats to the dedicated Idaho Cleanup Project employees for this important milestone. \n\nI applaud your efforts to protect one of Idaho’s important natural resources — the Snake River Plain Aquifer.\n\nRead the Congressional Rec. honoring the occasion: https://t.co/2qDpJq4eQ2 https://t.co/KItbIch4O0","date":"Fri Apr 01 15:34:26 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Finding common sense solutions to our immigration labor issues is among the most important issues I have worked to address in Congress.\n\nThe Farm Workfoce Modernization Act provides the urgently needed updates to our immigration system and the Senate needs to act.","date":"Thu Mar 31 20:12:45 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"President Biden has once again proposed eliminating the bipartisan #HydeAmendment in his budget. This means your tax dollars would be used to fund abortions.\n\nI strongly oppose taxpayer funded abortions and will fight to ensure this life-saving provision remains intact. https://t.co/AtwDFIWY7b","date":"Thu Mar 31 17:35:25 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The fact is, most police officers are selfless servants who risk their lives each day. Congress has a responsibility to #BackTheBlue not defund them.\n\nI am working hard to promote this philosophy in Congress.\n\nhttps://t.co/HQXz5R01KA","date":"Wed Mar 30 22:27:33 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Americans are tired of conflicting public health recommendations.\n\nIt’s time for the Biden Admin to end the mandates!\n\nhttps://t.co/xaHe6UPsiz","date":"Wed Mar 30 17:36:42 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am proud to support the College of Eastern Idaho’s ‘Trade Up’ program, which will expand virtual education opportunities and grow Idaho’s trade pipeline for years to come.\n\nhttps://t.co/wNvMkT8Z1Z","date":"Wed Mar 30 00:02:23 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to all Vietnam War veterans!\n\n#VietnamWarVeterans Day gives us the opportunity to express our appreciation for their service and sacrifice to our country. https://t.co/d3UybJufXo","date":"Tue Mar 29 22:27:23 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":".@POTUS budget also includes:\n- the highest sustained deficit levels in U.S. history\n- $58 trillion in taxes\n- $16 trillion of new debt\n\nIt’s clear Biden’s plan is to add to the crushing economic crises facing Americans, not solve them.","date":"Tue Mar 29 20:02:18 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Read my full statement: https://t.co/8wegEtwmnz","date":"Tue Mar 29 20:02:18 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"For Idahoan’s interested in attending any of our nations prestigious military academies, Academy Day’s is a great opportunity to learn about the nomination process and the academies themselves. \n\nWe hope you will join us in April! https://t.co/jdpi2SqNq0","date":"Mon Mar 28 23:29:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Biden’s new European energy plan needs more gas from U.S. companies, yet he refuses to use that same gas for American energy consumption to secure lower prices here. A serious proposal will: \n\n✅ end the freeze on oil &amp; gas projects\n✅ approve all pipelines\n✅ cut the red tape","date":"Mon Mar 28 19:12:13 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday to the Love of my Life - thank you for being my partner on this incredible journey! https://t.co/yXRtnYj1Bz","date":"Sat Mar 26 18:17:15 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I was glad to visit two Boise-based community projects for which I was able to secure millions of dollars in federal funds. \n\nThe positive impact of the projects at Gowan Field and the Boise Airport will be felt by community members across Idaho.\n\nhttps://t.co/0Xv1PuOGgn https://t.co/ueWdrZmdb2","date":"Fri Mar 25 20:37:23 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A new Idaho Grain &amp; Ag Center will serve as a bridge to the future of Idaho Ag and solidify the importance of the agricultural industry to our state.\n\nI was glad to work with @IdahoGrain and fund this exciting project!\n\nRead more: https://t.co/AS2YFfBayK https://t.co/lVDdW5jYow","date":"Thu Mar 24 22:21:24 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Habitat for Humanity Idaho Falls has worked hard to create a “Community of Hope”, where families can become successful homeowners.\n\nThis a worthy project that I am proud to support by directing $3M in federal funds their way. I look forward to seeing the completed Cmty of Hope! https://t.co/Sgi0DEjWvl","date":"Thu Mar 24 02:04:40 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"For years, the Fort Hall Fire Station has had to serve the tribal community with antiquated equipment and failing infrastructure. \n\nThrough Community Project Funding, we were able to secure $7M to help the fire dept make the updates they desperately need. https://t.co/LrXaMUhCQZ","date":"Wed Mar 23 21:15:39 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Cyber attacks are a real threat to our national security. \n\nThe @INL plays an important role in protecting our nations critical infrastructure and I am proud to support their efforts to improve our cybersecurity defenses. https://t.co/2Gawjsegly","date":"Wed Mar 23 18:49:26 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/qvvZFTixC7","date":"Tue Mar 22 19:15:10 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I oppose discrimination of any kind &amp; support efforts to ensure everyone is treated FAIRLY. I also believe that the Constitutional right to religious freedom must not be eroded.\n\nThe Fairness for All Act is a proven conservative approach to balance these important priorities.","date":"Tue Mar 22 19:15:10 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy #NationalAgDay to all of Idaho’s farmers, ranchers, and producers.\n\nThanks for feeding the world! 🚜\n\n#AgDay22 #ThankAFarmer https://t.co/sfXFztXicv","date":"Tue Mar 22 15:02:42 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am extremely concerned by @ATFHQ attacks on law-abiding gun owners as many Idahoans are facing new Form 1 denials. \n\nRead the letter I signed to demand answers for this decision: https://t.co/qPGN6k1gtg https://t.co/KX4l5KBnBS","date":"Tue Mar 22 00:16:02 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Since 1998, the @salmonchallisnf has supported local youth through the Jackie Caivano Memorial Scholarship.\n\nGraduating seniors from Salmon, Leadore, Challis, and Mackay should apply by April 25th.\n\nFind out more by visiting the SCNF website: https://t.co/MIZq2CYFHO","date":"Mon Mar 21 21:31:47 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"While Russia’s war in Ukraine has escalated some price increases, let’s not forget that #Bidenflation has increased during every single month of Biden’s presidency.\n\nRepublicans warned what the Democrats reckless spending would do to our economy.","date":"Mon Mar 21 19:31:45 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to Tiffany Lemos and Dane Beorchia, teachers from Pocatello and recipients of the #MilkenEducatorAward. \n\nThis award is given to the very best — those who go beyond the call of duty. Thank you both for your service in the classroom!\n\nhttps://t.co/U3Wv3QjNOE","date":"Mon Mar 21 15:01:32 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy &amp; I were shocked &amp; deeply saddened to hear that my colleague &amp; friend has passed away.  Don Young was truly one of a kind, &amp; he represented Alaska fiercely &amp; loyally. I learned a lot from him, as did many in the House. My prayers are with his family. May he Rest In Peace.","date":"Sat Mar 19 03:49:07 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Biden Admin has constantly told us to ‘follow the science,’ which makes the extension of the public transportation mask mandate absurd. \n\nIt is time for Americans to get back to normal life while case rates are low, and it is clearly safe to do so.\n\nhttps://t.co/QKTWMfnox5","date":"Fri Mar 18 21:42:46 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is heartbreaking news. Kathy and I offer our condolences to Jimmy’s family.\n\nMore and more civilians continue to lose their lives as a result of horrific and merciless Russian attacks. It’s long past time for Putin to put an an end to this senseless war.","date":"Fri Mar 18 16:30:44 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Did you know that I send out a weekly newsletter?\n\nInterested Idahoans can signup to receive up-to-date information about the work being done in Congress.\n\nSign up here: https://t.co/E5FqPHyMpz","date":"Thu Mar 17 23:56:05 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"$3,000 a year. \n\nThat is the cost of #Bidenflation and his administration’s disastrous energy policies. American families can’t afford anymore of this!\n\nhttps://t.co/z16LzY2jri","date":"Thu Mar 17 21:42:59 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"While #SBDCDay was yesterday, Idaho’s 6 Small Business Development Center support business owners 365 days a year.\n\nThey can help connect your business to a variety of critical resources and support our local economies. \n\nhttps://t.co/v0C3H6rPpz","date":"Thu Mar 17 20:32:23 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"President Zelenskiy gave a moving speech today before Congress.\n\nThe Administration should seriously consider his requests and continue to provide Ukraine with the lethal aid necessary to defend itself against Putin’s evil attack on their country. Slava Ukraini! 🇺🇸🇺🇦 https://t.co/RGOZX7O2IP","date":"Thu Mar 17 00:48:52 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The U.S. continues to honor its end of the U.S. Potato Export Agreement and it’s imperative USDA ensure Mexico do the same.\n\nMy colleagues and I call on the USDA to protect potato growers and reconsider its decision to rewrite the agreement with Mexico.\n\nRead our letter ⬇️ https://t.co/GcgHl9Pdam","date":"Tue Mar 15 23:09:53 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"House Republicans agree — any future agreement with Iran must hold them accountable for their destructive actions.\n\nLet’s not make the same mistakes as the Obama administration. \n\nRead more here ⬇️\nhttps://t.co/IeTbXRDusm https://t.co/9uBhi5JtTl","date":"Mon Mar 14 22:19:29 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to @BroncoSportsMBB, the Mountain West Conference champs! \n\nI look forward to cheering you on in the Big Dance! https://t.co/tSh98u0t4q","date":"Mon Mar 14 16:35:23 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Three years ago President Trump signed this significant public lands package into law, marking a greater commitment to support conservation on public lands.","date":"Mon Mar 14 15:45:23 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to @IdahoStateU for this great achievement. This ‘Military Friendly’ designation reflects the university’s commitment to support our veterans and to honor their sacrifices to our country.","date":"Fri Mar 11 21:33:58 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"There is no better time than now to take real action to prioritize domestic sourcing and to reduce our reliance on Russia and China. \n\nWe are calling on the Biden Admin to take back control of critical minerals production in the U.S.\n\nRead more ⬇️\nhttps://t.co/Fpi1TvtP7T","date":"Fri Mar 11 17:17:46 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I have always believed that collaborative state-management plans will better protect sage-grouse populations.\n\nInstead of threatening an ESA listing or locking up public lands, let’s empower state &amp; local conservation efforts to support this species.\n\nhttps://t.co/A31bwupvhh","date":"Thu Mar 10 23:00:39 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"February saw the highest inflation rates in 40 years — even reaching a crushing 9% in states like Idaho. \n\nThis trend has continued in virtually every month of Biden’s presidency, and I’m not sure who else he can blame for his harmful policies that brought us here. https://t.co/2vJdsqzqtE","date":"Thu Mar 10 17:58:17 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/koZGjZxjGR","date":"Thu Mar 10 00:38:53 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Biden Admin wants to waste time &amp; taxpayer dollars for another federal overreach on WOTUS — ignoring calls by Republicans to leave it alone before SCOTUS decides.\n\nIn Idaho, we know how to manage and protect our water and don’t need anymore “help” from the federal government.","date":"Thu Mar 10 00:38:53 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Despite many attempts by Democrats to remove it, the life-saving Hyde Amendment has been restored. This will continue to protect American taxpayers from being forced to fund abortions.","date":"Wed Mar 09 23:01:35 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I want to wish my good friend @RepRussFulcher a Happy Birthday! \n\nIt has been a pleasure to serve with you in Congress. https://t.co/l9HC0hxAyN","date":"Wed Mar 09 21:02:03 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I appreciated the opportunity to join @POTUS as he signed this significant public lands package. Two Idaho bills I authored were included in addition to the reauthorization of #LWCF. This legislation will be a benefit to Idahoans for years to come. https://t.co/U8IoxBLn60","date":"Tue Mar 12 21:21:03 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Read more inspiring stories about the ‘Trailblazing Women of Idaho’ here: https://t.co/sdQLas9TqL","date":"Tue Mar 08 17:55:03 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is International Women’s Day – and March is Women’s History Month.\n \nIdaho is blessed with a rich history of revolutionizing women, like Sally Reed. In 1971, she won the unanimous favor of SCOTUS to revolutionize anti-discrimination protections for women. https://t.co/l0n8VOj9kB","date":"Tue Mar 08 17:55:02 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As a long-time supporter of the SRS program, I am glad that my colleagues in the House and Senate recognized the importance of this issue to our rural communities and came together to pass this critical fix.","date":"Tue Mar 08 00:31:49 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/yhLZvNhpvK","date":"Tue Mar 08 00:31:49 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Biden Admin would rather work with authoritarian dictators than reopen American oil and gas production. \n\nAmerica should be buying American oil.\n\nhttps://t.co/pTpASdhA2x","date":"Mon Mar 07 21:51:25 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/sXpxlWb9Wn","date":"Sat Mar 05 00:26:05 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I consider protecting our God-given right to life as one of my most important responsibilities. I have fought back against Dems challenges to the pro-life message by opposing taxpayer funded abortions &amp; protecting healthcare providers who do not perform abortions. \n\nRead more ⬇️","date":"Sat Mar 05 00:26:04 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Idaho Day!\n\n159 years ago, Abraham Lincoln created the Idaho Territory. Today, we look back and celebrate what makes Idaho such a great place to live. https://t.co/AtpIuaxnpC","date":"Fri Mar 04 17:18:26 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I proudly support the American Energy Independence from Russia Act.\n\nThis bill will strengthen our economy &amp; our national security, and cut off one of Putin’s income streams. It must be a part of our effort to stop Putin and his egregious war on Ukraine.\n\nhttps://t.co/6DOVBCTs20","date":"Thu Mar 03 22:44:18 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am always happy to see familiar faces at the National Potato Council’s Summit.\n\nThanks for the opportunity to speak @ThisSpudsForYou","date":"Thu Mar 03 01:54:57 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“A reader lives a thousand lives before he dies…the man who never reads lives only one.”\n\n#ReadAcrossAmericaDay is a special day to celebrate the joy of reading and learning, and I hope you will celebrate with me.\n\nWhat is your favorite book? https://t.co/yeJW2y5cJ5","date":"Wed Mar 02 17:51:22 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Read my complete statement on tonight’s State of the Union Address ⬇️ \n\nhttps://t.co/RahYa3P6Mj","date":"Wed Mar 02 04:03:22 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s hard to believe @POTUS did not address U.S. energy independence — this should be a top priority.\n\nHere are major steps we can take now to make the U.S. more secure:\n\n✅ Approve the Keystone XL Pipeline\n✅Approve domestic oil &amp; gas leases\n✅ Responsibly mine critical minerals","date":"Wed Mar 02 04:03:21 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"With the #SOTU tonight, I am looking forward to hearing @POTUS address the accomplishments of his first year in office: \n\n❌ The U.S. National Debt &gt; $30T\n❌ Historic Inflation Rate\n❌ Increased Energy Dependence","date":"Tue Mar 01 23:22:22 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy 150th Birthday @YellowstoneNPS!\n\nPreserving our public lands is a priority of mine, which is why I championed legislation like the Great American Outdoors Act. Idaho is blessed with amazing public lands &amp; I will continue working to ensure future generations can enjoy them.","date":"Tue Mar 01 18:20:40 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Here is my statement on the recent events in Ukraine: https://t.co/h4j61ncPGH","date":"Tue Mar 01 01:44:43 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"…on advanced nuclear and grid security which will contribute to the U.S. remaining safe and secure. (2/2)","date":"Mon Feb 28 19:19:44 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The last few weeks have shown how critically important a domestic energy supply is for the U.S.\n\nAs ranking member of the Energy &amp; Water Approps Subcmte, I will continue to support meaningful and effective energy legislation —like promoting the essential work of the @INL…(1/2)","date":"Mon Feb 28 19:19:43 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"After an exciting court decision in 2021 to expand U.S. potato exports, this is a disappointing move by the Mexican government. \n\nBoth Mexico and Idaho’s Potato Growers stand to benefit greatly from open trade. I hope these issues will be resolved quickly.","date":"Fri Feb 25 21:26:20 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I had a wonderful time this morning with an impressive group of FFA students at American Falls High School.\n\nThey presented to me their project on the Columbia Basin Initiative and our work to secure a stable future for Agriculture in Idaho. https://t.co/F5feIwe5xH","date":"Wed Feb 23 22:41:12 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Read more here: https://t.co/dWQGOM4oIc","date":"Tue Feb 22 23:56:52 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It was a pleasure to visit with McCain Foods today and discuss the challenges impacting our Ag supply chain. \n\nAs Chairman of the Congressional Potato Caucus, I enjoy working with McCain Foods and others to address the needs of our food processors and growers. https://t.co/KX5hvuB1dq","date":"Tue Feb 22 23:56:51 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Find out more about my work in Congress to address our state’s workforce needs: https://t.co/aqGG5gZ8Q2","date":"Tue Feb 22 20:47:05 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho employers, including those in the Ag industry, have struggled to find enough workers. \n\nThe Farm Workforce Modernization Act will help solve the workforce issues that Idaho Ag faces, and I hope the Senate will quickly pass this important piece of legislation.","date":"Tue Feb 22 20:47:05 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The negative effects of a struggling supply chain are among many concerns shared by Idaho’s small businesses. \n\nDems and the Biden Admin have dismissed these concerns, yet 47% of businesses believe the economy is getting worse acc. to JCN.\n\nhttps://t.co/0VmF0ONIsX","date":"Tue Feb 22 16:58:35 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today we celebrate #PresidentsDay.\n\nOriginally meant to recognize George Washington’s birthday, we now honor Presidents past and present and their service to our great nation. Who is your favorite U.S. President? https://t.co/bzdRy4ctMB","date":"Mon Feb 21 21:03:34 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Small businesses play a vital role in our country and are the backbone of our state’s economy.\n\nIdaho is one of the most business-friendly places in the U.S., &amp; I am committed to seeing that Idaho entrepreneurs &amp; the businesses they build are given every opportunity to succeed. https://t.co/dk00pUROyv","date":"Sat Feb 19 17:33:53 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am proud to support the veterans who have served in defense of our freedoms, and I am pleased to share some of the progress Congress has made in recent years in support of them.\n\nhttps://t.co/Yy6IhRzXK7","date":"Fri Feb 18 16:18:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Veterans of the United States military have fought and sacrificed to protect our freedoms and way of life.  Just as they have served our nation in times of need, we have a duty to remember them in their time of need.","date":"Fri Feb 18 16:18:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Before the White House rushes to spend more money we don’t have, let’s think about the best way to put the $800 billion unspent stimulus dollars to use.\n\nhttps://t.co/lB8MYjgnJX","date":"Thu Feb 17 23:03:58 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I will be joining the Neil Larson Show this morning on NewsTalk 107.9. Tune in at 8:30am MST to hear our discussion.\n\nYou can listen live using the link below ⬇️ \n\nhttps://t.co/1qFHzHVg5o","date":"Thu Feb 17 14:31:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"During National Salute to Veterans Patients Week, I want to send a special thank you to our veterans. We are forever grateful for your service and sacrifice. https://t.co/vvMLhd7YAo","date":"Wed Feb 16 17:12:18 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday @GovernorLittle!","date":"Wed Feb 16 00:02:19 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":".@POTUS’s approach to border security has been a disaster from the beginning. House Republicans are committed to accountability and transparency for Biden’s deeply unpopular border policies.","date":"Tue Feb 15 21:15:24 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The irresponsible calls by some Democrats to “defund the police” have created added dangers for law enforcement all across the country. \n\nI will always stand with Idaho’s brave police officers. #BackTheBlue","date":"Mon Feb 14 23:40:21 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“Let us remember that all American citizens are brothers of a common country, and should dwell together in the bonds of fraternal feeling.”\n\nHappy Birthday to our 16th President. https://t.co/ii3hPe93LK","date":"Sat Feb 12 18:59:46 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It is clear that federal mandates handed down by the Biden Administration are doing more harm than good — @POTUS must develop a plan for our country to return to normal life.\n\nhttps://t.co/Xkh8Y7LwSK","date":"Sat Feb 12 00:16:15 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A Judge restored protections for gray wolves across much of the US — but not in Idaho!\n\nI worked hard to return wolf management back to the states. In Idaho, we’ve shown that we are more than capable of managing this species.\n\nhttps://t.co/8DZMqvx4EF","date":"Fri Feb 11 16:58:20 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In 1982, the last time inflation was as high as it is today, I was practicing dentistry with my dad and uncle in Blackfoot.\n\nFrom heating their homes to putting food on the table, Americans are paying more for just about everything. Simply put,  #Bidenflation is crippling. https://t.co/h3q0e88zbx","date":"Fri Feb 11 00:30:54 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Watch the session here: https://t.co/X8bmOR9P2Q","date":"Thu Feb 10 20:45:48 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I have been a proud supporter of nuclear energy and the research opportunities at the INL.\n\nIt was great to join the Idaho LINE Commission this morning to discuss news from Congress, the budgeting process, and our work to advance nuclear energy. https://t.co/lJuQc4NziZ","date":"Thu Feb 10 20:45:47 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Educating our children is perhaps our most important responsibility. \n\n@GovernorLittle's Leading Idaho bill gives our hard working teachers what they deserve.","date":"Thu Feb 10 17:53:32 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I had a great meeting this morning with College of Southern Idaho Board Chair Laird Stone and VP of Administrarion Jeff Harmon. \n\nI always enjoy when Idahoans come to visit! https://t.co/NUylHzl7wb","date":"Wed Feb 09 18:15:02 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The American people expect us to secure the border — that’s our job in Congress. The majority party is failing to do that.","date":"Wed Feb 09 16:04:40 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Wildfires, drought, and invasive grasses all pose the biggest threats to our sage grouse populations today. Addressing these immediate threats should be the focus – not harming our rural communities by locking up land.\n\nhttps://t.co/t5C8XzYbfr","date":"Wed Feb 09 00:30:55 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"What an interesting piece of Idaho history!","date":"Tue Feb 08 22:34:39 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The compounding economic struggles we've seen under the Biden Admin - labor shortages, supply chain disruptions, &amp; rising gas prices - are creating many financial burdens for Americans. \nhttps://t.co/uyElBx9prt","date":"Tue Feb 08 18:36:45 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"1 in 2 men and 1 in 3 women will be diagnosed with cancer. On #WorldCancerDay, take a moment to learn how to take preventive and proactive action against this disease. \n\nRead more: https://t.co/8aSYJtJRGf https://t.co/AT5XXMUaea","date":"Fri Feb 04 22:05:04 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Of the many important lessons this pandemic has taught us, ensuring the U.S. has control of our supply chain should be atop the list. Creating and promoting a domestic supply of critical minerals needs to be a part of that process.\n\nhttps://t.co/xH5oUG0Ubm","date":"Fri Feb 04 01:05:25 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It looks I’ll have to wait quite a while to read about “The Adventures of Dillon Helbig’s Crismis.” Rest assured I’ll be ready for what Dillon comes up with next!","date":"Thu Feb 03 01:15:08 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Not many people can say that their 8th grade science project made it to space. What an exciting opportunity and accomplishment for these Madison Jr. High Students! \n\nhttps://t.co/vhaRZy6PFZ","date":"Wed Feb 02 20:29:50 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Yesterday, the U.S. National Debt officially reached $30 trillion. If you stacked a trillion dollars, it would reach heights of nearly 70,000 miles - now do that 30 times. \n\nOur debt crisis is unsustainable, yet Dems are still determined to pursue a reckless spending agenda.","date":"Wed Feb 02 16:12:11 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/YFy0jJskp3","date":"Wed Feb 02 00:40:17 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Programs like this, hosted by @IdahoTrucking, are essential to train the next generation of drivers &amp; fix our supply chain crisis. \n\nRecently, I urged the DOT to quickly implement the FMCSA’s Under-21 Commercial Driver Pilot Program to support this critical facet of our economy.","date":"Wed Feb 02 00:40:17 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On this day in 1865, Abraham Lincoln signed a House &amp; Senate Resolution that would later become the 13th Amendment — meaning the abolishment of slavery in the U.S. \n\nOn #NationalFreedomDay, we honor our country’s idea of freedom and our commitment to form a more perfect union. https://t.co/qEz7gdhMkW","date":"Tue Feb 01 19:39:29 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The St. Anthony Sand Dunes are one of the many places that make Idaho the best state to live and recreate. What a beautiful picture!","date":"Mon Jan 31 23:04:54 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This year’s nominations are some of Idaho’s best and brightest students, and we are lucky to have them represent our state. \n\nRead the full release to find more information on service academy nominations: https://t.co/ckL2U5TSZQ https://t.co/rCwZzGXx3I","date":"Fri Jan 28 19:00:31 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Changes to the Earned Income Tax Credit will help more hard working American families. \n\nVisit https://t.co/00xx3j1ENc to see if you qualify for tax savings through the #EITC","date":"Fri Jan 28 17:12:05 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idahoans have asked me to fix our immigration laws since my first day in Congress, and there is perhaps no more important facet of reform for our economy than the agriculture workforce. I am a proud sponsor of the Farm Workforce Modernization Act.","date":"Thu Jan 27 23:32:02 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On this International Holocaust Remembrance Day, we honor the memory of the 6 million Jewish lives taken by the Nazis and pledge to #NeverForget. https://t.co/TtPRq7NczQ","date":"Thu Jan 27 19:31:53 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Vaccines work, and more Americans should choose to get vaccinated — but let me be clear, I will never support a vaccine mandate.\n\nThat is why I have cosponsored several bills to block Biden’s vaccine mandates.\n\nhttps://t.co/F1Xf1BbtK9","date":"Thu Jan 27 00:20:31 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Wishing my friend @GOPLeader a very happy birthday! Thank you for your leadership. https://t.co/TtaZUqgpnN","date":"Wed Jan 26 23:30:06 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho’s resources provide the U.S.  with an opportunity to become less reliant on foreign nations for critical minerals, but access to mining is essential in this effort.\n\nhttps://t.co/0mI4xUAoDx","date":"Wed Jan 26 20:20:17 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Last month I sent a letter urging the Admin to develop a plan that empowers states, instead of restricting them, to protect sage-grouse and reduce risk to future populations. https://t.co/RPgGxFh2Gl","date":"Wed Jan 26 00:56:38 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Biden Admin is currently considering an update to the sage-grouse land management plan, including locking up nearly 10 million acres of federal land.","date":"Wed Jan 26 00:56:37 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":".@POTUS might think those who ask about inflation are “stupid,” but this impacts every single American. Clearly Biden is just out of touch with the concerns of the American people.\n\nhttps://t.co/5NnnPnaFXZ","date":"Tue Jan 25 20:05:06 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I was an early advocate of this bill, which was signed into law by President Trump. I am proud to see the GAOA bringing results by improving Idaho’s forests and supporting our local economies.","date":"Mon Jan 24 18:29:58 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I proudly stand with those marching today in Washington for the 49th @MarchforLife. I am grateful for these faithful marchers that give their voice to those who do not have one. \n\n#MarchforLife","date":"Fri Jan 21 20:26:34 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"There is a new federal resource that will allow you to get FDA-authorized COVID test kits delivered to your home. \n\nThese tests are completely FREE of charge. Find out more below⬇️","date":"Fri Jan 21 18:19:02 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"After a year in the White House, the American people have given Biden an “F”. \n\nWhatever radical mandate Dems &amp; @POTUS think they have, it’s clear now that many Americans want a different path for our country. https://t.co/WKlZ89Kd75","date":"Thu Jan 20 16:30:19 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am proud to have earned an A+ on @SBAList’s pro-life Scorecard. I will always vote to protect the rights of the unborn &amp; the conscience rights of taxpayers who don’t want their tax dollars paying for abortion. #WhyWeMarch \n\nhttps://t.co/fCStKzKUCS","date":"Wed Jan 19 23:31:00 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"For information on future App Challenges, visit my website ⬇️\n\nhttps://t.co/z3e0sEpMLa","date":"Wed Jan 19 21:19:31 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to Sophie, the creator of ArtQuizzer and the winner of the 2021 Congressional App Challenge for Idaho’s 2nd District #Congress4CS! https://t.co/8kLmJgepYv","date":"Wed Jan 19 21:19:30 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"For Idahoans, responsible mining means investment in local economies, including good-paying jobs. We must work to responsibly utilize Idaho’s invaluable resources so we can loosen the grip that foreign nations currently have on the global critical mineral supply chain.","date":"Tue Jan 18 19:01:23 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today, on this #MLKDay, we remember the champion of civil rights and honor his legacy of love, opportunity, and unity. \n\n“Darkness cannot drive out darkness, only light can do that. Hate cannot drive out hate, only love can do that.”  - Dr. Martin Luther King, Jr. https://t.co/XYQe4KHsFP","date":"Mon Jan 17 17:36:09 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As your representative in Congress, I feel a great responsibility to ensure that Idaho's agricultural sector has access to the resources and tools it needs to thrive into the future.\nhttps://t.co/xaSsRtI0BZ","date":"Fri Jan 14 18:43:52 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Like I've said before, the future of Idaho is tied to agriculture. For generations, farmers and ranchers have shaped or state and Ag is still a major force in our economy today. \nhttps://t.co/IoZif8QW9j","date":"Fri Jan 14 18:43:51 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Democrats are disguising the expansion of voter rights with a federal take-over of state and locally managed elections. \n\nI do not support this power grab.\nhttps://t.co/NfA9NQKuPo","date":"Thu Jan 13 22:43:46 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Supreme Court agrees — the federal government has no business telling private employers how to run their businesses.\nhttps://t.co/xa0Y40HKrL","date":"Thu Jan 13 21:14:25 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The grid and cybersecurity experts at @INL are among the best in the world. I was pleased to support their vision to construct this test grid and create a research environment that will benefit all Americans.","date":"Thu Jan 13 15:45:57 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Consumer prices have increased in nearly every month of Joe Biden’s presidency. \n\nAmerica is facing an inflation crisis and you are bearing the burden. Democrats must stop the reckless spending.","date":"Wed Jan 12 20:20:21 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Did you know that dairy is Idaho’s No.1 agricultural product? \n\nProducing over 13 billion pounds of milk a year, Idaho’s Dairy Farmers work to keep our fridges and shelves stocked. Happy #NationalMilkDay to the great dairy farmers in #ID02🥛🐄 https://t.co/Wd7uNnmmPn","date":"Tue Jan 11 16:56:48 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to all who answer the call to serve and protect. Our law enforcement officers need our support now more than ever.\n\n#BacktheBlue #LawEnforcementAppreciationDay https://t.co/k5Hb7gPxN3","date":"Mon Jan 10 00:33:43 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today SCOTUS will hear the case of Biden’s vaccine mandate.\n\nI hope they will recognize Biden’s unconstitutional overreach of private business, and stand up for the right of every American to make their own medical decisions.","date":"Fri Jan 07 19:06:24 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"One of these things is not like the other.\n\nIdaho Economy  &gt;  Biden Economy https://t.co/TVulQsIb4X","date":"Fri Jan 07 16:12:07 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"while simply doing their jobs. We now know that at least 140 law enforcement officers were injured, one died from injuries sustained in the line of duty, 4 officers committed suicide in the weeks following, &amp; 153 Capitol Police officers have left the force since the attack. (2/3)","date":"Fri Jan 07 01:42:01 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"January 6th was a dark and tragic moment for our nation. Like most Americans, I was deeply troubled by the events at the Capitol building that day. I was especially dismayed by the images of brave law enforcement officers, themselves public servants, put in danger…(1/3)","date":"Fri Jan 07 01:42:01 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am incredibly grateful for the bravery of each of the Capitol Police officers — we owe it to them, and all other law enforcement officers, to ensure nothing like January 6th happens again. (3/3) https://t.co/8T6owdrUEK","date":"Fri Jan 07 01:42:01 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks to Biden and Dems reckless spending plans, Idahoans are among those more negatively impacted by inflation. \n\nThat means we can expect to pay more than just about anyone for just about anything. https://t.co/92EoHWBmUD","date":"Thu Jan 06 00:29:42 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":".@idfg , along with avid sportsmen, has worked hard to detect &amp; manage Chronic Wasting Disease in Idaho deer pops. To support their efforts, I voted for the CWD Research &amp; Management Act — a bill that will help states fight the disease, and provide safety for hunters &amp; wildlife.","date":"Wed Jan 05 00:07:33 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is National Write to Congress Day. \n\nMy offices in Washington and across the district are open to take your calls, letters, or emails. Whatever the issue, your feedback on current events helps me best serve Idaho’s 2nd District! https://t.co/0ZLpBCxNml","date":"Mon Jan 03 18:59:07 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Share your opinion on current events, find help with a federal agency, and access other services here:\n\nhttps://t.co/aQ0OARDR1z","date":"Sat Jan 01 03:08:08 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"With 2021 coming to an end, I want to highlight ways in which we have been able to serve you. My staff and I have worked hard to help Idahoans and to represent Idaho’s 2nd District well. \n\nThank you for the honor of serving in Congress - we look forward to a great year in 2022! https://t.co/VMYpK4tTBq","date":"Sat Jan 01 03:08:08 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Steve was a giant in his community. As a state legislator, editor of the Times-News, &amp; a friend his perspective was always valuable — even when we didn’t see eye-to-eye because those were opportunities to learn. Kathy and I send our heartfelt condolences to Linda &amp; their family.","date":"Sat Jan 01 00:07:02 +0000 2022","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"What exciting news for DOE and the Idaho Cleanup project. A successful clean-up means protection for the region and the Snake River Plain Aquifer.\n\nCongratulations on this accomplishment for all who have been involved!","date":"Thu Dec 30 20:30:57 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to all the road crews across Southern and Eastern Idaho who are working hard to clear our highways!\n\nFor those planning after-holiday travel, please drive carefully! https://t.co/xfFRxoV7I8","date":"Sun Dec 26 22:47:40 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As Kathy and I celebrate the birth of Christ, we want to wish each of you a very Merry Christmas https://t.co/4PnhykiXGa","date":"Sat Dec 25 01:45:41 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Change is coming, and I’d rather act than have decisions forced upon us. \n\nhttps://t.co/wQcS6BWRQC","date":"Tue Dec 21 22:35:59 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A lot may have changed since 1951, but the @INL still stands as a leader in nuclear energy and research. \n\nHere’s to 70 more years of innovation!","date":"Tue Dec 21 16:59:01 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I had a great discussion this morning with the East Idaho Water Rights Coalition. As we continue to work together, I have great hope in the future of Idaho salmon and water. https://t.co/9KjtkS6T2D","date":"Tue Dec 14 18:42:54 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I got vaccinated and I am comfortable with my decision to do so, but it was just that, my decision. Although I was deeply disappointed in @POTUS decision to mandate vaccines, I applaud the efforts of Idaho’s leaders to maintain personal freedom. https://t.co/FxmevcDzqT","date":"Tue Dec 14 01:42:29 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I join America in sending our prayers to all of those impacted by last night’s tornado. The images are beyond horrific and we are ready to help in any way possible.","date":"Sat Dec 11 17:06:19 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is the Biden economy. \n\n⛽️Gas prices +58%\n🔥Heating/Utilities +25%\n🛒Food/Groceries + 8%\n🚗 Used Cars +31%\n\nAmericans are paying more for just about everything. But don’t worry…it’s just your fair share, folks!","date":"Fri Dec 10 16:59:27 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am proud to support this legislation that provides a pay raise to our troops, upgrades military family housing, and bolsters national security. https://t.co/Vf6m5336Tg","date":"Fri Dec 10 00:30:19 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The federal government has no business telling private business owners how to manage their employees. I am proud to join @RepFredKeller and EVERY Congressional Republican in efforts to nullify Biden’s vaccine mandate on private employers.","date":"Thu Dec 09 00:51:52 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congrats on this well-deserved recognition, Brad. There is no doubt Idaho has one of the best governors in America!","date":"Wed Dec 08 17:58:12 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"December 7th, 1941 — a day which will live in infamy. 80 years ago our country was “suddenly and deliberately attacked,” and over 2,400 Americans lost their lives in the defense of our freedoms. May their sacrifice never fade from the memory of our nation. https://t.co/Ol9iZEdVXt","date":"Tue Dec 07 15:05:10 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“The fact is, Republicans’ 2017 tax reform law did exactly what was promised: It lowered taxes for all income groups, [and] provided the greatest benefits for middle-income households…”\n\nSome of us have known this since TCJA passed in 2017.","date":"Tue Dec 07 01:01:48 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"While Americans suffer the consequences of Biden's poor economy, he has considered compensating illegal immigrants. Last week I cosponsored legislation to prohibit this ridiculous misuse of taxpayer dollars. \n\nRead more here: https://t.co/ol5aa2LMPW","date":"Mon Dec 06 20:47:48 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am saddened to hear of Bob Dole’s passing. I’ll never forget him traveling to Idaho to campaign for me during my first Congressional election. \n\nFrom his heroic efforts in WW2 to his stalwart Senate leadership, Bob Dole will be remembered for his selfless service to our nation. https://t.co/04F1bRBTOL","date":"Sun Dec 05 20:10:32 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Wonderful news for my friend - @RepRussFulcher , you have been in our thoughts and prayers over the last few months and I am very excited to hear that you are now CANCER FREE! https://t.co/SeGgvI5VwN","date":"Sat Dec 04 15:58:11 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#SupportLocalGems by doing your holiday shopping at the small businesses that make your communities unique.\n\nFind out how you can support your local gems here: https://t.co/SDFXtyXBoD","date":"Sat Dec 04 01:58:35 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho Falls ranks among the very best cities in America as a destination for prospective IT Security Analysts. This is not just good news for @INL, but other industries that also benefit from a diverse workforce in Idaho. Well done!","date":"Fri Dec 03 20:07:40 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations! What a blessing for you and your family.","date":"Fri Dec 03 15:42:26 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Yesterday SCOTUS heard oral argument on the Dobbs v Jackson late-term abortion case. Their decision will be monumental — not just for the precious lives of the unborn, but for the many Americans who don’t want unelected judges deciding how we protect human life. #ModernizeOurLaw https://t.co/g4q7MwZl6q","date":"Thu Dec 02 20:14:56 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Every day Idaho’s police officers put themselves in harms to way to keep us safe. Let’s do our part, when passing police slow down, and move over. #BacktheBlue https://t.co/sJm96KP91d #FoxNews","date":"Thu Dec 02 17:59:56 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Doing the same thing over and over is insanity.\n\nIf the Biden admin has plans for immigration reform, their current track just isn’t working. Securing the border is the obvious first-step to any meaningful reform and it’s long passed time for House Dems to take action. https://t.co/GkDJ3ZSnyK","date":"Wed Dec 01 22:16:22 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As #MilitaryFamilyMonth comes to a close, I want to thank those that offer special support to our service members. Our nation owes you and your families a great debt of gratitude. https://t.co/88OjJYAq9q","date":"Wed Dec 01 03:08:11 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As supply chain issues and worker shortages create added stress for many Americans, I applaud the Blackfoot Sage Truck Driving School for their efforts to train the next generation of drivers. https://t.co/pUaowCFhFl","date":"Tue Nov 30 18:46:22 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“A little bit of light dispels a lot of darkness”\n\nHappy #Hanukkah to all who celebrate. https://t.co/z9Z37j90iE","date":"Mon Nov 29 19:18:02 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I wish you all and your family a very Happy Thanksgiving. \n\nWhat are you most grateful for today? https://t.co/BIMaACu8w3","date":"Thu Nov 25 17:02:32 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This move is like putting a band-aid on a bullet hole. Tapping into the petroleum reserve should be for emergencies, not a political ploy just days before Thanksgiving.","date":"Wed Nov 24 02:34:19 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This horrific scene in Wisconsin has left many of us in shock. Our hearts go out to those who were involved. Parades are an important part of life in Idaho, and disgusting acts like this have no place in our country.\n\nhttps://t.co/0Tj7Hqjl9X","date":"Mon Nov 22 18:34:06 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am thankful for the first responders who fought to contain this mornings fire and ensure everyone was safe.\nhttps://t.co/LO2ebXtGWA","date":"Fri Nov 19 19:36:57 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This morning I voted against Biden’s #BuildBackBetter Act. Here’s why: https://t.co/MjUzfvXMZQ","date":"Fri Nov 19 15:15:09 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#BuildBackBetter was built on the lie that it would cost nothing. Now we know the real price tag. $367B ≠ $0","date":"Fri Nov 19 01:43:05 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I do not agree or believe that a vaccine mandate is constitutional, and that is why I cosponsored the Congressional Review Act legislation to try to stop the enforcement of President Biden’s mandate. https://t.co/wzOPNvZ17y","date":"Thu Nov 18 19:54:57 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"If Green New Deal Democrats were serious about reaching their climate goals, they would be embracing nuclear energy as an essential part of their strategy. https://t.co/02VAju0ZPh","date":"Thu Nov 18 00:08:28 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Inflation is reaching record levels under the Biden presidency. Unless @POTUS and House Dems stop their excessive spending spree, everyday Americans will continue to pay the price of his harmful economic policies. https://t.co/npd7F7Pbw4","date":"Wed Nov 17 17:39:14 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great work, Jonah! Many people will benefit from your service in Twin Falls. \n\nhttps://t.co/ObArNSSmTq","date":"Tue Nov 16 16:34:56 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Let’s never forget why we celebrate. \n\nThank you to those who have served and that do serve today. 🇺🇸 https://t.co/CBT52OjYBM","date":"Thu Nov 11 17:18:55 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The new East Idaho Vet Center is a great addition to the area. They offer confidential help for Veterans, service members, and their families at no cost in a non-medical setting. https://t.co/jb8k6xjhgV","date":"Wed Nov 10 20:02:51 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday @USMC. Thank you for 246 years of service 🇺🇸 https://t.co/5SVC6x7kzg","date":"Wed Nov 10 15:54:27 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Many Idahoans in my district are the first in their family to earn a college degree. First-Generation College Celebration Day recognizes these pioneers and the tremendous grit they display while achieving their educational goals. https://t.co/1JxxT5j6bN","date":"Mon Nov 08 22:35:33 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The 5th Circuit cites “grave statutory &amp; constitutional” concerns in blocking Biden’s vaccine mandate for private businesses. This is exactly what R’s in Congress have been saying --Biden’s mandate is unconstitutional &amp; flies in the face of freedoms that make our country great.","date":"Sat Nov 06 23:20:24 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My statement on today’s vote for the Infrastructure Investment and Jobs Act. https://t.co/toDaN3iWbe","date":"Sat Nov 06 03:10:28 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Even some Dems agree that a vote on these radical spending bills without a CBO score is absurd.\n#NoScoreNoVote  https://t.co/CWcLBvKbVV","date":"Fri Nov 05 21:43:13 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A vote on such massive spending legislation without knowing the price tag is absurd. Our national debt is at crisis level &amp; inflation is higher than it’s been in decades. I hope @SpeakerPelosi will put on the brakes until the true cost is known. https://t.co/yy8ynTCqqa","date":"Thu Nov 04 19:48:15 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho is the top destination for mining business is the world. As the demand for clean energy and other technology grows, we need to be able to mine for critical minerals domestically. \n\nWe welcome that here in Idaho!\n\nhttps://t.co/wYO802oFl9","date":"Wed Nov 03 23:22:26 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The federal government has no business mandating vaccines for employees of private business. The No Vaccine Mandate Act will prevent this gross overreach by the Biden admin and allow Idahoans to make their own medical decisions. https://t.co/16iHxE4cfM","date":"Wed Nov 03 18:34:21 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":".@POTUS is in Glasgow “solving” the climate crisis. Back home, Americans are paying the price of his disastrous energy policies. You can’t create one crisis to solve another. https://t.co/WWo9SDCSuf","date":"Wed Nov 03 01:37:52 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I have always believed that the future of Idaho’s economy is tied to agriculture. Congratulations to these students from the Rigby FFA for their achievements in the program. Your recognition is well deserved! https://t.co/SCAI4kqxbb","date":"Tue Nov 02 18:56:39 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"These Dem Senators have no business getting involved in how Idaho manages our wolf populations. @POTUS should leave this issue to the States! In 2011 I led the charge to delist wolves because the @idfg is well prepared to manage this species. https://t.co/X35kiKdaEG","date":"Mon Nov 01 17:56:16 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Biden wants to pay illegal immigrants $450,000?! This administration is taking Halloween way too serious with these terrifying policies!","date":"Fri Oct 29 16:21:27 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today Idaho thanks every one of its dedicated first responders — fire fighters, police, paramedics, and EMTs — for serving and protecting our communities everyday. https://t.co/bii3sl6JKx","date":"Fri Oct 29 00:36:19 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Global supply chain issues have created higher prices and extreme delays for all Americans. \n\nCongress and @POTUS can take steps now to turn the tide but pushing through another astronomical spending bill can’t be one of them. https://t.co/o0StFyowSd","date":"Thu Oct 28 00:56:15 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"These awards demonstrate the @INL commitment to being at the forefront of cutting-edge research and technology. It’s exciting to see this happen in our own backyard.","date":"Tue Oct 26 21:59:21 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I was proud to vote yes on @RepLisaMcClain bill to award the Congressional Gold Medal to the 13 men and women who lost their lives in Afghanistan. This is a small but worthy effort in comparison to their brave sacrifice — I hope they are never forgotten.","date":"Tue Oct 26 16:25:23 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"While we await more information, our hearts go out to those affected at the Boise Towne Center Mall today. We appreciate our heroes in blue and pray for everyone involved.","date":"Mon Oct 25 22:26:11 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Many Idahoans have reached out to my office to express strong opposition to this proposal. This will undoubtably bloat the size of the IRS and increase federal bureaucracy. https://t.co/OWAJPy1pFc","date":"Mon Oct 25 20:08:23 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Pelosi’s Jan 6 Commission has become the partisan circus I wanted to avoid. Congress doesn’t get to play law enforcement when it’s politically convenient for the Dems just to score political points.","date":"Thu Oct 21 23:43:39 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The left’s eagerness to play law enforcement while supporting efforts around the country to defund the police shows their extreme hypocrisy has no limits.","date":"Thu Oct 21 23:43:39 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Economists are speaking. Biden's excessive and reckless spending plans are already shrinking paychecks and making trips to the pump more expensive. Pushing through the Dems $3.5T spending bill will make #Bidenflation worse. https://t.co/3CKRQJFNpx","date":"Wed Oct 20 17:13:49 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to Jamey Higham for being named the new CEO and President of the Idaho Potato Commission. I look forward to working with him while he serves in this important role. https://t.co/hG9Nh2rLoc","date":"Wed Oct 20 00:18:40 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am glad to finally see the Biden admin take some action at the border - even if a court forced their hand. Since February, 1.2 million people have been apprehended by border agents. It’s time @POTUS looks at every avenue to control the border crisis. https://t.co/lP9rIt29Pv","date":"Mon Oct 18 22:53:34 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Colin Powell consistently put country over party and service over self. His life of dedication to the American people is an example to us all and I am saddened by his passing.","date":"Mon Oct 18 15:26:42 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"But don’t worry, this is just a “high class problem”","date":"Fri Oct 15 18:59:29 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Biden Admins latest proposal to require banks to report financial activities over $600 to the IRS is an absurd violation of privacy and a hugely inappropriate govt overreach.\n\nhttps://t.co/SmhbnLlgtO","date":"Fri Oct 15 15:57:38 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Why would I kick this hornets nest?\n\nMaybe I'm worried that no one will be compensated when the dams come out.\n\nMaybe I don't want Idaho's iconic salmon to disappear on my watch. \n\nMaybe I believe leadership means solving problems &amp; not ignoring them.\n\nFind out tonight @IdahoPTV","date":"Thu Oct 14 22:14:26 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Biden Admin calling inflation a “high class problem” shows just how out of touch they are with the average American. \n\n#InflationIsTaxation https://t.co/F8HkNXD7b0","date":"Thu Oct 14 15:34:48 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to the College of Eastern Idaho on this impressive designation. It’s crucial that students in Eastern Idaho have opportunities to study cyber security and I applaud CEI for this putting this program together. https://t.co/Q7hoeAVP0U","date":"Wed Oct 13 22:28:14 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I fear that without taking serious efforts to turn the debt around and to address the Dems irresponsible spending plans, raising the debt ceiling will become an annual crisis of our own making. If we want to improve the economy, Congress must act responsibly.","date":"Wed Oct 13 00:30:10 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho’s past, present, and future are tied to agriculture, and I feel a responsibility to ensure Idaho Ag can thrive - now and in the future. Thank you to our farmers and ranchers who feed the world! #NationalFarmersDay https://t.co/OwouPrIasM","date":"Tue Oct 12 17:38:15 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Since day one of the Biden admin, economic recovery has suffered at the hand of high inflation and disappointing job reports. It is clear that Americans aren’t responding to the Dems economic priorities. https://t.co/aWKmdTAvSP","date":"Sun Oct 10 15:52:09 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congrats to the INL on this well deserved recognition. It is because of their incredible workforce, our friends and neighbors, that the nation looks to the Lab for nuclear and cyber innovation. https://t.co/wQNg3cdsay","date":"Fri Oct 08 15:28:22 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to the Boise-area fire departments who rushed to scene of the Goose Fire last night - your hard work saved homes. https://t.co/Eq073kkAxS","date":"Thu Oct 07 16:00:05 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"@POTUS has let the border crisis become a humanitarian crisis - with no end in sight. Meanwhile, House Dems won’t bother to give a cent of their $5.5T Reconciliation package to support border security or DHS agents. https://t.co/Wd1nAJrnF0","date":"Wed Oct 06 18:07:12 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It is unfortunate that while our Governor is working to find real solutions to the crisis at our border, he must also deal with these distractions from his Lt. Governor.","date":"Wed Oct 06 01:33:32 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The rise of social media has corresponded with an alarming rise in American teens struggling with mental health issues. If Facebook has known how harmful their products are, the American people deserve answers.","date":"Tue Oct 05 20:10:55 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Salmon are resilient, but it is clear the status quo won’t work for them. My Columbia Basin Initiative will give salmon their river, invest in clean energy in the NW, &amp; leave our producers better off. Thanks @TroutUnlimited &amp; Vice Chair Wheeler for having me during “Trout Week”!","date":"Tue Oct 05 17:49:22 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In the $5.5 trillion reconciliation package, House Dems plan on giving $3.5 billion for a make-work civilian climate corps program - using tax dollars to promote their Green New Deal.\nhttps://t.co/plOKWKcc9M","date":"Tue Oct 05 00:04:57 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The pandemic has shown us that the entrepreneurial spirit in Idaho is unmatched. While no one is immune to the economic challenges of the last year, it seems the country can learn a thing or two from Idaho's business and State leaders.","date":"Mon Oct 04 16:45:38 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The consequence of consolidating the Pocatello mail processing facility is lower service standards - a detriment to rural communities. @USPS must provide answers to Congress.","date":"Sat Oct 02 00:13:49 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Dems $5.5 trillion tax and spending plan will \n▪️ increase U.S. debt by $2.4 trillion\n▪️ tax employers at one of the highest rates in the world\n▪️ add $2.1 trillion in new taxes on American families\n\nYet somehow this will cost us nothing?","date":"Wed Sep 29 19:34:31 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This weekend we honored the sacrifice of the families who lost loved ones while in the service of our country. I am eternally grateful for them and for those who serve. God bless our Gold Star families. https://t.co/nynp7QyUqQ","date":"Mon Sep 27 16:09:08 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"@POTUS might not have a clear picture of what's going on at the border - what is clear is that his administration has failed to take any action on a preventable crisis. Mr. President, securing the border is the first step.","date":"Fri Sep 24 18:47:37 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"House Dems are working hard to push through their radical pro-abortion bill - which would override state and federal pro-life protections and go far beyond Roe v Wade. We must honor the sanctity and dignity of every life by opposing HR 3755! https://t.co/HrViL68JRc","date":"Fri Sep 24 16:10:37 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The next generation of Idaho leaders aren’t shy about their desire to see Idaho’s iconic salmon runs return. I welcome their energetic minds to the cause. https://t.co/0mV6SMMUhn","date":"Fri Sep 24 00:05:51 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am proud to support Israel’s right to defend itself - that is why I voted to pass critical funds for the Iron Dome. This defense system has saved countless lives! I hope the Senate will act quickly and honor our commitment to the Israeli people. #StandwithIsrael 🇮🇱🇺🇸","date":"Thu Sep 23 20:51:36 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I was glad to visit with a team at Great Western Malting in Pocatello where we spoke of ways to support additional geothermal energy use. Idaho tops the list of clean energy production thanks to our business leaders - something to celebrate this Clean Energy Week #NCEW21 https://t.co/8spzfkhAVv","date":"Tue Sep 21 20:27:30 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"House Dems have refused to discuss meaningful budget reforms. Now at risk of shutdown they want a blank check, to raise the debt ceiling, and to kick the can down the road with a Continuing Resolution. All for their $3.5 Trillion tax and spending spree…that’s just bad governance https://t.co/GPl7O8nd1h","date":"Mon Sep 20 23:11:27 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy &amp; I are deeply saddened to learn of the passing of Louise McClure. She was an incredible woman who dedicated her life to her amazing family &amp; to Idaho. We are blessed for her public service &amp; for her friendship. Kathy &amp; I send our love and prayers to the McClure family.","date":"Mon Sep 20 20:24:26 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“The Strength of the Constitution lies entirely in the determination of each citizen to defend it.”\n\nHappy #ConstitutionDay 🇺🇸 https://t.co/072jjb4YYA","date":"Fri Sep 17 17:49:30 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It is no longer a debate: Active forest management is the key to preventing wildfires in the West. I strongly urge @POTUS to adopt the tools identified by Idaho’s land managers necessary to implement commonsense forest management reforms. https://t.co/9pyLTH66OZ","date":"Thu Sep 16 23:34:26 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Hard to imagine that 20 yrs have passed. On that day extremists tried to destroy our way of life but they didn’t know how resilient the American people and spirit are.  \nMy hope is that we #NeverForget the lives lost, the heroes who sacrificed, and the country that came together. https://t.co/g8rGuNekuG","date":"Sat Sep 11 16:52:40 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ultimately, the decision to get vaccinated must remain a personal choice.  I am deeply disappointed in President Biden’s new strategy of coercion, and I support Governor Little in his efforts to maintain personal freedom in Idaho. (2/2)","date":"Fri Sep 10 22:37:17 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"From the beginning of the COVID-19 pandemic, I have encouraged Americans to speak with their doctors and heed the advice of public health officials.  While vaccination is the single best way to prevent the spread of serious illness and protect our vulnerable neighbors…(1/2)","date":"Fri Sep 10 22:37:16 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I enjoyed touring the @Perpetua_Idaho mine last week to discuss how important access to critical and rare earth minerals are to many sectors of our economy. Thanks @LaurelSayer and team for showing me around!","date":"Thu Sep 09 23:05:04 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Cpl. Baldwin's efforts to ensure that this local hero is never forgotten is nothing short of inspiring. #NeverForget \nhttps://t.co/6kmp5PnlL6","date":"Wed Sep 08 17:48:58 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to my friend and colleague @RepHalRogers on becoming the longest-serving member of Congress from the Bluegrass State. \n\nHis 40 years of dedicated service to his country &amp; Kentucky is an inspiration for us all. I’m lucky to serve you with you Hal! https://t.co/B8mh3zYfCs","date":"Thu Sep 02 22:33:30 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Undoubtedly, the 13 American service members killed in Afghanistan last week are heroes.  I hope Congress will act quickly to award the Congressional Gold Medal in honor of their service and sacrifice.","date":"Tue Aug 31 18:44:51 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"currently putting their lives on the line in Afghanistan. To President Biden: it is time to consider all available options to get our troops, American citizens, allies, and Afghan partners out of harm’s way and to put an end to this completely avoidable tragedy. (2/3)","date":"Thu Aug 26 19:13:21 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Speaker Pelosi should bring Congress back into session immediately to engage with the Administration on their failed withdrawal strategy and to pursue appropriate measures to prevent further violence in this appalling situation. (3/3)","date":"Thu Aug 26 19:13:21 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We are watching a nightmare situation unfold in Afghanistan. I am profoundly saddened to learn of the US Marines killed and injured in Kabul. Kathy and I are praying for the injured, the families and friends of those killed, and ALL our US troops…(1/3)","date":"Thu Aug 26 19:13:21 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy birthday to the @NatlParkService - 105 never looked so good!\n\nFor more than a century the NPS has been dedicated to protecting our country’s natural heritage. We are lucky to be able to enjoy so much of that here in Idaho! https://t.co/rrgo76lyKV","date":"Wed Aug 25 18:10:00 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today House Democrats decided to force through a $3.5 Trillion budget resolution. This budget will create a debt increase greater than the GDP of nearly every country on Earth. I can’t support this level of spending because it is unsustainable and down right irresponsible. https://t.co/Qe57sgAj2s","date":"Tue Aug 24 22:02:54 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is the result of a failure in preparation and leadership from the Biden administration. I urge President Biden to do everything in his power to get Americans and our allies and partners to safety. (2/2)","date":"Thu Aug 19 22:49:02 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The events of the last few days in Afghanistan have been heartbreaking and deeply troubling. Certainly, US troops could not stay in Afghanistan forever, however, there should have been no reason for our withdrawal to lead to such chaos… (1/2)","date":"Thu Aug 19 22:49:02 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations the the back-to-back American Legion World Series champs - Go Bandits! https://t.co/UnFfLieyTO","date":"Wed Aug 18 22:10:56 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s always great to be with the Idaho Falls City Club so I am glad that I could join them earlier this week. Thanks to everyone there for allowing me to share the Columbia Basin Initiative with you! https://t.co/nKTMBE90f1","date":"Fri Aug 13 17:31:15 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Inflation has increased every month during the Biden administration. Not only are Idahoans now paying more for just about everything, they are also making less. The culprit is absolutely Biden’s out-control-spending agenda.\nhttps://t.co/yePpUpxHNd","date":"Thu Aug 12 18:07:09 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A year ago today, Congress sent the Great American Outdoors Act to President Trumps desk. Since he singed it into law, Idaho has benefited from dozens of projects aimed at preserving our precious outdoor spaces. \n\nSimply put, the GAOA is good for Idaho! #GreatAmericanOutdoorsAct https://t.co/5pdDOodbqe","date":"Thu Jul 22 21:01:35 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My days are full of meetings - but my favorite meetings by far are like the one I had yesterday with these Future Farmers of America officers from Idaho. The future of agriculture is in great hands! https://t.co/xdPe5qUPuw","date":"Wed Jul 21 18:20:26 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congrats to George and Nathan for being selected to attend Boys Nation this year. We are lucky to have such bright, young minds representing Idaho! \n\nCome stop by office while you’re in town!\n https://t.co/AVQFiRWFrB","date":"Tue Jul 20 16:17:30 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As Democrats celebrate the removal of the #HydeAmendment I'd invite you to listen to my remarks from yesterday's markup⬇️","date":"Fri Jul 16 17:21:09 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"You may have the right to support pro-choice organizations - but you don’t have the right to tell people who believe abortion is morally wrong to fund it with their tax dollars. That is wrong. https://t.co/zM9iRdvKck","date":"Thu Jul 15 23:22:37 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"58% of Americans agree - tax dollars shouldn’t pay for abortions. That’s why the #HydeAmendment is crucial, and that’s why I am fighting efforts by House Democrats to repeal this life saving amendment. #HydeSavesLives https://t.co/g4GesPeSC8","date":"Thu Jul 15 15:57:45 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Even without his hair he's the better looking Congressman.\n\n#GoRuss #BeatCancer #IdahoStrong","date":"Wed Jul 14 19:26:47 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today I think about the many people who have worked so hard and sacrificed so much to make our great country what it is - especially with all that has happened over the last year.  They make me proud to be an American 🇺🇸 \n\nKathy and I wish you all a happy and safe Fourth of July! https://t.co/mxyygntgDH","date":"Sun Jul 04 14:44:24 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday, Idaho! https://t.co/wZBsJI705y","date":"Sat Jul 03 15:04:57 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am glad Eastern Idaho could give such a warm welcome last night to the crew and officers of the USS Idaho. \n\nOnce commissioned it will be the first Navy vessel to bear our State’s name in over 100 years. We are proud that these young men are representing Idaho! https://t.co/PpVSzsGPC3","date":"Fri Jul 02 20:57:47 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The @NIFC_Fire is projecting an above normal wildfire risk over the next month - making responsible recreation  essential! 🔥\n\nPlease keep this in mind as you celebrate the Fourth of July this weekend. https://t.co/Z4X2iLO8Tu","date":"Fri Jul 02 17:33:42 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As catastrophic wildfires worsen in the west State and Federal collaboration is essential. The President is making a mistake by not having Idaho at the table","date":"Thu Jul 01 15:23:51 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congrats to Juan Alvarez for his recognition by the National Diversity Council. The Leadership Excellence Award is a great honor – Idaho and the INL are certainly better because of his leadership.","date":"Tue Jun 29 19:56:02 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Like many of you, I am looking forward to commemorating the birth of our nation this weekend. As we celebrate America the beautiful, let's be careful not to light her on fire.","date":"Mon Jun 28 15:08:06 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"71 years ago the United States became involved in Korea. Today I am thinking about the nearly 40,000 troops who gave their lives in this conflict - and the countless others who served.","date":"Fri Jun 25 21:36:46 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The @VP and I must have very different definitions of “progress”","date":"Fri Jun 25 18:50:36 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"51 years with my high school sweetheart by my side. Happy Anniversary Kathy! Here’s to 51 more 🥂 https://t.co/MJvvzQDlGN","date":"Thu Jun 24 19:06:33 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Welcome to the Gem State","date":"Sat Jun 19 15:31:43 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"What was supposed to be a benefit to small businesses, the ⁦⁦⁦⁦@SBAgov’s⁩ Shuttered Venue Operators Grant has become a burden for those seeking help. I am glad to join 200 colleagues in an effort to find the answers and improvements many desperately need. https://t.co/di7Yy6HlwE","date":"Thu Jun 17 16:18:40 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to Senator @MikeCrapo @SenatorBennet &amp; @SecVilsack for keeping the Farm Workforce momentum going.  \n\nWe have a unique opportunity to improve our ag workforce system and stem illegal immigration.","date":"Wed Jun 16 19:53:41 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is a wonderful opportunity to get more students involved in #STEM. \n\nGreat work @INL and Shoshone-Bannock School District.","date":"Wed Jun 16 18:48:47 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"For youth in Eastern Idaho interested in becoming a firefighter, this is a great opportunity to learn firsthand from firefighters ready to teach the next generation. What a great event put on by many volunteers around Pocatello!\nhttps://t.co/X7bYm0ECQm","date":"Tue Jun 15 20:30:54 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Pardon me while I call my 95 year old mother and let her know that the Biden administration wants to me refer to her as my birthing person. What has this ‘woke’ world come to 🤦🏻‍♂️ https://t.co/Hk5ribVauR","date":"Tue Jun 15 14:49:14 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy birthday @USArmy! We are forever indebted to the many men and women who have served in your ranks over the last 246 years. #ArmyBDay","date":"Mon Jun 14 22:16:12 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"For Americans, our flag means freedom and opportunity. On #FlagDay, we celebrate the heroes who have protected the way of life it represents. https://t.co/VIYvCtAfG0","date":"Mon Jun 14 16:59:51 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Proud to join @RepRussFulcher on this letter","date":"Mon Jun 14 15:11:32 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A few weeks ago, @EPAMichaelRegen assured me that the Biden Admin had no intention of returning to Obama-era WOTUS rules. I am disappointed to see they’ve changed their minds. This decision will only hurt Idaho’s farmers and rural communities.\nhttps://t.co/urLywPfsww","date":"Thu Jun 10 01:22:42 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"There is no overstating the importance of dairy to Idaho’s Agriculture industry. I was glad to join @dairyidfa to talk about the work we’re doing in Congress to support Idaho dairy.","date":"Wed Jun 09 16:47:16 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho is the fastest growing state in the nation, and our infrastructure is in dire need of repair and modernization. These Idaho projects are long overdue, and their completion will have a huge economic impact in their respective communities. https://t.co/CrSOdDldXP","date":"Tue Jun 08 17:36:10 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We have a humanitarian and security crisis at our Southern Border. President Biden has given the reigns to @VP and we have yet to see any real leadership. The American people deserve answers and solutions, and this administration is failing on both.\n\nhttps://t.co/HxGaZLfRl2","date":"Mon Jun 07 16:42:21 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Two years ago marked the 75th anniversary of #DDay. Below you will find my commemoration of that remarkable event. I still believe we can come together and better honor the heroes of D-Day.\n\nhttps://t.co/bbDRDu3YEw","date":"Sun Jun 06 17:33:59 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As the nation’s economy struggles to rebound, Idaho has positioned itself to thrive in the post-COVID world. The country can learn a lesson from the Idaho way of doing business","date":"Fri Jun 04 16:00:35 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I spent yesterday with my friends at the Idaho Grain Producers. We continue to work closely to ensure Idaho agriculture is represented in DC 🌾 https://t.co/5VuRQ2XDiO","date":"Thu Jun 03 16:19:16 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho’s Gold Star Family Memorial is a true monument to sacrifice - the sacrifice of those gone too soon and of a community who worked so hard to honor them. This will be a beautiful tribute to Gold Star Families for years to come!  https://t.co/HdUKJbbg5L","date":"Wed Jun 02 19:24:24 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is #NationalMilkDay. Raise a glass to all our incredible dairy producers and processors 🥛🐄\n\nAs Co-Chair of the Dairy Caucus I am proud to represent Idaho - the 3rd largest milk producing State in the US!","date":"Tue Jun 01 17:38:06 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today we honor those who offered the “last full measure of devotion.” We are a free people today because of their sacrifice - let us never forget #MemorialDay2021 https://t.co/gZLxuU0YBn","date":"Mon May 31 17:13:36 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Field of Heroes in Pocatello is a great reminder of the ultimate sacrifice many of our brave men and women in uniform made for us. Let’s not forget who we honor during this “long weekend” https://t.co/LpNVfoUY52","date":"Sun May 30 19:35:40 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As the school year comes to an end here in Idaho, I want to congratulate the graduating class of 2021! The last year has surely been difficult but you have a lot to be proud of! https://t.co/LtnqsN4Emw","date":"Sat May 29 17:58:28 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Despite only being in middle school, Topher is doing his part to bring attention to the dwindling salmon runs with his Lonesome Larry Project. https://t.co/tqIvVOwp9T","date":"Thu May 27 22:16:31 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I was glad to spend time with the great officers in the Boise Police Department! I am grateful for all that they do. https://t.co/adYyVDVkrs","date":"Thu May 27 18:20:28 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m proud to join @RepKimSchrier and @RepSchrader in cosponsoring this new bill! We know how devastating wildfires are in Idaho and this legislation will pay significant dividends in reducing the cost of firefighting and restoration.","date":"Wed May 26 19:51:26 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We can #REPLANT trees on our national forests that have been decimated by wildfire, all without using taxpayer funds 🌲","date":"Fri May 21 16:53:52 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho business is small business! Join us by supporting the local gems in your community - if you need help @SenatorRisch has a few ideas #SupportLocalGems","date":"Thu May 20 20:06:42 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am proud to join @RepAshleyHinson  in supporting the elimination of the $200 tax on firearm transfers &amp; purchases.\n\nIt’s time we remove this unnecessary burden on our Second Amendment rights.","date":"Thu May 13 22:34:54 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Friendly reminder when visiting @YellowstoneNPS they are called wildlife for a reason, they are not pets, be sure to keep a safe distance.🐻","date":"Thu May 13 12:45:56 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Absolutely horrific images coming out of Israel today. I support Israel’s right to defend its citizens from this terrorism. The United States stands with Israel, and we are praying for de-escalation and a resolution to this conflict. 🇺🇸🇮🇱","date":"Wed May 12 14:51:19 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This week is #NationalPoliceWeek, a time to honor those who put their lives on the line everyday and keep our communities safe. Thank you to all our officers! https://t.co/6rm44OvLhF","date":"Mon May 10 22:35:20 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“Life doesn’t come with a manual, it comes with a mother.” Happy Mother’s Day to all the moms in our lives! Thank you for all that you do. https://t.co/TDc7jh7tNg","date":"Sun May 09 14:35:07 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am monitoring the heartbreaking events in Rigby today and my heart goes out to all of those involved in this tragedy. To the first responders and our heroic teachers and faculty who are keeping our children safe, thank you.  https://t.co/CjZqWic5Ug","date":"Thu May 06 16:47:19 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is National Day of Prayer. I hope you will join me today in praying for our nation and for those who selflessly serve. https://t.co/asI3hgkun5","date":"Thu May 06 15:15:50 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s great to see how educators work to provide opportunities like these for our students - especially during teacher appreciation week!","date":"Wed May 05 19:07:15 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"If anything, the last year has shown us how important teachers are to our children. I am grateful for Idaho’s excellent teachers and the time they dedicate to our students future. #IDedu","date":"Mon May 03 22:31:21 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy birthday to my friend and colleague, @SenatorRisch!","date":"Mon May 03 15:22:29 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Wise words from @SenatorTimScott tonight. He also noted that “Weakening our southern border and creating a crisis is not compassion” and I couldn’t agree more.","date":"Thu Apr 29 02:41:40 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today’s ruling is encouraging news to Idaho potato growers. The Mexican government will keep their promise to grant our farmers true access to the market. I look forward to this mutually beneficial trade relationship being implemented. https://t.co/f1TLD73dpS","date":"Wed Apr 28 22:24:14 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"@POTUS ran as a moderate who promised to unite.\n\nReckless spending, a crisis at the border, and lost jobs are results of the divisive and progressive agenda that have defined his first 100 days. https://t.co/k82wll4Otf","date":"Wed Apr 28 21:11:59 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I support the @INL because their influence is deeply connected to our state.\n \nIn 2020, they invested over $160M in the 2nd District. These investments benefit our communities, students, and businesses.","date":"Tue Apr 27 21:44:47 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"D.C. statehood would disrupt the careful balance of power envisioned by the Framers, something I, a Representative from the State of Idaho, cannot in good conscious support. \n\nRead my full statement here: https://t.co/L6cMyPKqCk","date":"Mon Apr 26 17:19:56 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy 113th Birthday, @USArmyReserve! I am grateful everyday to the men and women who stand ready to serve and who have sacrificed so much. https://t.co/DHS3t3kjDZ","date":"Fri Apr 23 15:18:02 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The dairy industry deserves accurate labeling, milk comes from a cow - not an almond or coconut or any other fruit or vegetable.","date":"Thu Apr 22 20:56:35 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I had a productive exchange with @EPA Administrator Regan yesterday. He assured the subcommittee that he does not intend to return to the controversial Obama-era definition of Waters of the U.S.\n\nhttps://t.co/urLywOXREY","date":"Thu Apr 22 14:48:36 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Spoke with @Interior @SecDebHaaland on the importance of having access to critical and rare earth minerals. As the demand for clean energy technologies increases, we need to be able to mine these critical minerals domestically.  \n\nhttps://t.co/j1yf1SEuzC","date":"Wed Apr 21 15:09:36 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today @RepAOC and @SenMarkey will reintroduce the #GreenNewDeal. \nIt was a bad idea the first time they introduced it and it's  bad idea today.\nHere's why - \nhttps://t.co/S4yNBbEVbi","date":"Tue Apr 20 16:29:01 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Facts are Facts","date":"Thu Apr 15 16:39:49 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Joining Neal and Julie live this morning, you can listen below. \n\nhttps://t.co/SmQZzuX7yw","date":"Tue Apr 06 15:05:42 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho will be well represented in the @DOE_SC_NSB National Science Bowl. Congratulations to Boise and Madison High Schools and Vera C. O'Leary Middle School in Twin Falls for winning their regional competitions. Good luck at Nationals! \n\nhttps://t.co/npXSrlAfuQ","date":"Mon Apr 05 14:30:59 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today I celebrate the empty tomb and our risen Savior. \nWhile we all miss loved ones who have passed on, Easter Sunday is a testament to joyful reunions. \n\n#HeIsRisen  #HappyEaster https://t.co/RDoBg2u8sA","date":"Sun Apr 04 13:21:14 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m deeply grateful for the USCP who protect our Capitol, please join Kathy and I as we pray for those who were harmed.","date":"Fri Apr 02 19:14:43 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As the lifeblood of our economy, Idaho agriculture has always, and will always, remain a top priority as I work in Congress. \n\nThank you to all the farmers and ranchers who keep us clothed and fed.","date":"Tue Mar 23 22:28:03 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I've joined @westerncaucus Chairman\n@RepNewhouse &amp; Senate Western Caucus Chairman @SteveDaines in sending a letter to President Biden demanding answers on his #30x30Initiative.\n \nFor more information https://t.co/snvgDgLome https://t.co/ZI3ctIpnNb","date":"Thu Mar 18 15:56:04 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"🍀 #HappyStPatricksDay  🍀","date":"Wed Mar 17 16:19:16 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Something isn't right here....","date":"Wed Mar 17 15:36:48 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is a crisis.\n\nWe need to secure our border and discourage illegal immigration. These failed #OpenBorder policies are shortsighted and dangerous. https://t.co/mox6BZFe2L","date":"Tue Mar 16 19:29:05 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today I voted against two unconstitutional gun control bills that put more restrictions on law-abiding citizens without reducing gun violence.  #2A https://t.co/rHL3VCJfBO","date":"Thu Mar 11 20:25:29 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Our country’s broken immigration system affects all facets of our economy, not least of all Idaho’s agriculture industry.  I am proud to reintroduce the Farm Workforce Modernization Act to address this ongoing issue.  \n\nhttps://t.co/psQ6Kamb82","date":"Thu Mar 11 15:45:55 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"There is a crisis at our border, pretending there isn't wont make it go away.\n\nToday, I joined my Republican colleagues on the @HouseAppropsGOP asking for a hearing to address this problem. https://t.co/qiqbw0Ps6u","date":"Wed Mar 10 21:00:44 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday @RepRussFulcher, Idaho is lucky to have you serving in Congress. https://t.co/DMeuJ8vNu3","date":"Tue Mar 09 15:15:01 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"👏👏👏 well said @RepDanCrenshaw","date":"Mon Mar 08 17:11:59 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"\"This country can accommodate both civil liberties for LGBT individuals and religious freedom.\"\n\nI'm proud to cosponsor @RepChrisStewart's bill, the Fairness for All Act.\n\nhttps://t.co/Hf46zCiR3d","date":"Fri Mar 05 19:49:55 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Idaho Day https://t.co/w70U546PYN","date":"Thu Mar 04 13:21:51 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday @Interior 🌄","date":"Wed Mar 03 16:48:35 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I agree with @GOPLeader #HR1 is dangerous legislation that would only weaken our election system.","date":"Wed Mar 03 15:38:29 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"From top to bottom #HR1 is a bad idea https://t.co/JJcoAnsp7F","date":"Tue Mar 02 16:44:49 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On March 1, 1872 President Grant signed the @YellowstoneNPS Protection Act into law, making it the world’s first national park(and my favorite). It took the work of forward thinking leaders to recognize the value of Yellowstone and to protect it, and aren’t we glad they did. https://t.co/JPNSUcShU5","date":"Mon Mar 01 23:08:34 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Each time I visit the @INL I am impressed by the incredible workforce. Hats off to their award winning team.","date":"Mon Mar 01 19:35:58 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Russ is a good guy, I’m glad to see these false claims put to rest.","date":"Fri Feb 26 21:22:44 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Rigby High School celebrating National  #FFAWeek the Idaho Way \n\n@NationalFFA","date":"Fri Feb 26 01:41:57 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"While I miss meeting the #potatodcflyin in person, it was a perfect opportunity to show off my #POTATO mask.","date":"Thu Feb 25 17:41:58 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The science is clear and kids need to be back in the classroom.","date":"Fri Feb 19 02:14:42 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Touch down! Congratulations to all the great minds who made this happen.","date":"Thu Feb 18 21:03:41 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Kids Baking Champion is from #Sugar City Idaho - which makes perfect sense. \n \nCongratulations Keaton!\n\nhttps://t.co/Ie1K2diieN","date":"Wed Feb 17 18:09:38 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In Idaho we understand firsthand the impact of catastrophic wildfire, which is why I am joining @RepJoeNeguse &amp; @RepJohnCurtis to launch the Bipartisan #WildfireCaucus.\n\n“An ounce of prevention is worth a pound of cure”","date":"Tue Feb 16 20:00:47 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Joining the Neal Larson Show at 8:30MT. Listen live below \n\nhttps://t.co/iHGhhlVHf1","date":"Mon Feb 15 15:20:24 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am pleased to see @Interior respond to our bipartisan letter asking for the bureaucratic red tape to be removed and #LWCF restored.","date":"Thu Feb 11 17:06:19 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"One of Idaho's top youth volunteers Topher Jones, a 7th grader at Hillside Junior High School, has raised more than $15,000 through his “Lonesome Larry Project,” a conservation initiative dedicated to saving sockeye salmon by selling sockeye-themed socks. \nhttps://t.co/Yp1IOz1Tcx","date":"Thu Feb 11 14:39:12 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We can develop a Northwest solution that protects our stakeholders and modernizes our energy system, and we can do this on our terms.\n\nVisit : https://t.co/IxhA1IWvAE\n\n https://t.co/cPRDoHb1Ql","date":"Sun Feb 07 12:30:08 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My dad used to say, “Don’t go down a road that you can’t come back from.”This partisan stunt from Pelosi and Democrats is a dangerous road.","date":"Fri Feb 05 00:11:08 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It's a privilege to continue to serve on the Appropriations Committee both on Interior and as Ranking Member of the Energy and Water Subcommittee. Let's get to work!","date":"Fri Jan 29 18:53:13 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Protecting the rights of the unborn is not something we should take lightly. Today and everyday I #standforlife. \n #ProLife https://t.co/klt89HRVIw","date":"Fri Jan 29 16:45:10 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On this #HolocaustRemembranceDay we pledge to #NeverForget","date":"Wed Jan 27 22:28:05 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Putting aside any political, historical or emotional arguments, the numbers speak for themselves on why a split of the Ninth Circuit is inevitable and why it is beyond time to authorize another judgeship for Idaho.\n\nhttps://t.co/dCqCytz9CJ","date":"Wed Jan 27 16:35:53 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This administration is putting our energy supply chain in jeopardy and costing Americans their jobs. This short sighted policy decision risks bankrupting precious conservation programs and would make us more reliant on countries like China for strategic minerals.","date":"Wed Jan 27 01:06:28 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I joined 199 of my Republican colleagues urging Congressional leadership to protect the Hyde Amendment, which has saved the lives of over 2 million innocent babies by preventing the federal government from using taxpayer dollars to fund abortions. https://t.co/blhhNf0LHR","date":"Tue Jan 26 16:04:43 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The sport owes a great deal to Hank Aaron ⚾️","date":"Fri Jan 22 17:54:45 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho ingenuity on display\n\nhttps://t.co/srk2CZqdNu","date":"Wed Jan 20 18:42:53 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/OblCn3pR6m","date":"Wed Jan 20 17:04:14 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“Man must evolve for all human conflict a method which rejects revenge, aggression and retaliation. The foundation of such a method is love.”\n\n #MLKDay2021 https://t.co/en7eXzheB5","date":"Mon Jan 18 14:26:41 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today’s vote unfortunately does not put us on a path to healing. \n See my statement on impeachment below.\n\nhttps://t.co/nCI9AK8QVL","date":"Wed Jan 13 22:24:11 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I want each and every Capitol Hill Police officer who walks by my office to know how much I appreciate their service. #heroes https://t.co/Fa9xGAScZx","date":"Mon Jan 11 19:19:38 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is an opportunity to thank the brave men and women in blue who spend their days and nights keeping our streets safe. #LawEnforcementAppreciationDay","date":"Sat Jan 09 20:05:21 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am heartbroken at the passing of Officer Brian Sicknick. Like many Capitol Police officers, he heroically put himself in harms way to keep lawmakers, staff, and our Capitol safe. \nHis family deserves our prayers and his perpetrators deserve prosecution to the fullest extent.","date":"Fri Jan 08 15:51:29 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We have a constitutional right to peaceful protests but the clashes with police and destruction of property must stop now. We can disagree in a better way.","date":"Wed Jan 06 20:10:18 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Russ is a great friend and congressman, I am honored to serve Idaho alongside him. https://t.co/POFLmS3xLz","date":"Wed Jan 06 15:58:01 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Looking forward to working with these new lawmakers","date":"Mon Jan 04 16:18:29 +0000 2021","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/z2nkNOiABY","date":"Tue Dec 29 03:00:54 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“A thrill of hope, the weary world rejoices” Kathy and I hope each of you have a happy and healthy holiday as we celebrate the birth of Christ.\n\n#MerryChristmas https://t.co/CwIFmEIH2W","date":"Fri Dec 25 13:57:38 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am relieved that a deal has been reached to help Idaho families and small business during this uncertain time.","date":"Tue Dec 22 02:19:49 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"To those around the world celebrating, #HappyHanukkah tonight the final candle is lit 🕯 https://t.co/Ds6hNj39GB","date":"Thu Dec 17 22:32:29 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The @DeptVetAffairs has launched a single access point to all VA contact centers. \n1-800-MyVA411 (1-800-698-2411) is available 24 hours a day 265 days a year, to service Veterans, their families, caregivers and survivors. \n\nhttps://t.co/evGpSwZ76c","date":"Wed Dec 16 21:33:27 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"229 years ago the Bill of Rights became part of the US Constitution.   Today and everyday I am grateful for the guarantee and safeguards of these God-given rights. \n\n#BillofRightsDay https://t.co/88NscMVvTR","date":"Tue Dec 15 16:52:26 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Welcome to the job Director @john_c_wagner \n\nhttps://t.co/ECVlRcoEnC","date":"Mon Dec 14 22:00:02 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Rexburg Children’s Choir led by Ben Watson was featured on @NBC for putting together a seemingly impossible Christmas concert. I’m amazed at the level of talent in our communities.\n\nhttps://t.co/pBvMKtSELL","date":"Mon Dec 14 15:44:58 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As a former health care provider, I understand how vitally important NIH research is.  I am proud to strongly support the @NIH and provide it with the funding it needs to fulfill its mission.","date":"Thu Dec 10 20:31:17 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Wishing a quick recovery to my friend Rob.","date":"Thu Dec 10 03:14:57 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is a horrible act and there is no room for this in Idaho.","date":"Wed Dec 09 22:24:33 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Had a great (virtual) discussion with @IdahoBankers today about the importance of PPP for businesses in Idaho and the necessity of #CovidRelief","date":"Wed Dec 09 17:37:11 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"79 years ago today our nation was ‘suddenly and deliberately attacked’. Today we remember the 2,403 military personnel and the 68 civilians who lost their lives while defending our nation at PearlHarbor. \n#PearlHarbor79 #PearlHarborRemembranceDay https://t.co/LVdPVAMDHW","date":"Mon Dec 07 15:32:35 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On this #GivingTuesday Kathy and I found a fun and creative way that we can help those in need. \n\nhttps://t.co/8vdT3JaWG6","date":"Tue Dec 01 19:58:48 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"2021 will bring a new postage stamp to honor the Japanese American soldiers of World War 2 \n\nhttps://t.co/0QevVZ8im6","date":"Tue Dec 01 18:33:37 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congrats to @ifchukars and @MLB on this new partnership. \n\nhttps://t.co/oo1c3wlydx","date":"Tue Dec 01 15:48:51 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I want to wish each of you a Happy Thanksgiving. Despite this challenging year, we have so much to be thankful for. I’m grateful to live in this beautiful, free county and for my loving family. \n#givethanks https://t.co/QagalJQI9F","date":"Thu Nov 26 16:29:18 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A tradition unlike any other #themasters","date":"Sun Nov 15 15:16:55 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The loss of these 5 American soldiers is a tragedy. Our hearts go out to the families as we pray for a successful recovery for the remaining US solider.","date":"Sat Nov 14 15:27:21 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On Veterans Day we pause and honor the selfless service of our nation’s heroes. May we all find an opportunity to thank a veteran today for the freedoms that we enjoy. 🇺🇸 https://t.co/zvXrSL8cwE","date":"Wed Nov 11 15:27:12 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday to the @USMC\n245 yrs of sacrifice and service!\n\nJoin me in thanking Marines past, present, and future.  \n\n#Marines #SemperFi https://t.co/l4Lt1fkS3J","date":"Tue Nov 10 13:49:45 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to Kim Layne, a veterinary student, Miss Idaho, and now 1st runner up #MissUSA \nYou made the Gem State proud tonight.","date":"Tue Nov 10 03:19:15 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks to President Trump’s  #OperationWarpSpeed, we will have 100 million doses of the Pfizer vaccine ready for distribution following FDA approval!\n\nhttps://t.co/c156NHdchw","date":"Tue Nov 10 00:28:14 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am thrilled to hear that John Wagner will be taking the helm at @INL. \nI have enjoyed working with John previously and know that he is uniquely positioned to guide the lab in the exciting years ahead for nuclear energy.","date":"Thu Nov 05 18:38:48 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The @USDA delivered to Congress its priority list of deferred maintenance projects for @OutdoorsAct. I’m pleased to see so many Idaho projects included. Idaho’s public lands will start receiving much needed improvements thanks to this historic legislation.\nhttps://t.co/b7EEB7ckC4","date":"Tue Nov 03 21:03:04 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I applaud this decision and look forward to other states following the lead of Idaho and successfully managing the gray wolf population.\n\nhttps://t.co/dT4K0EGT1J","date":"Thu Oct 29 22:40:20 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"If high school rivals can find a way to work together, what’s our excuse?\n#Bipartisan \n\nhttps://t.co/qiMHRpjhet","date":"Thu Oct 29 14:43:36 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I always appreciate the opportunity to sit down with my friends from @IDFarmBureau. They are kind to recognize my efforts for Idaho’s farmers and ranchers. https://t.co/X2Ib0Mbpj4","date":"Wed Oct 28 18:17:21 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"163 yrs ago today Teddy Roosevelt was born. He was a leader who understood conservation means access for hunting fishing &amp; hiking and that our @NatlParkService are some of our greatest treasures. Can’t  think of a better early birthday gift than the @OutdoorsAct 🎁\n#FindYourPark https://t.co/1ZZ4rS3pFs","date":"Tue Oct 27 17:40:12 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Confirmed. \n\nCongratulations to our newest #SCOTUS Justice, Amy Coney Barrett. She is an incredibly qualified individual with an impressive legal mind.  I am confident she will uphold the Constitution and the rule of and law. 🇺🇸 \n\nGreat pick @realDonaldTrump https://t.co/TRnHcRan8g","date":"Tue Oct 27 15:35:24 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Wise words from @Senator_Hill \n\nhttps://t.co/e4cxjMKPe1","date":"Sun Oct 25 15:17:42 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Enjoyed taking question from business leaders today with @ifchamber. \n\n#SupportYourLocalChamberofCommerceDay https://t.co/IKEtlLyTZ5","date":"Wed Oct 21 20:33:32 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m looking forward to speaking with the @ifchamber today.  #ChamberProud","date":"Wed Oct 21 14:07:01 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today we celebrated the opening of @IdahoWBC in Idaho Falls. @SenatorRisch deserves a great amount of credit for championing this cause, and we are excited to have the IWBC become part of the Eastern Idaho business community. https://t.co/wfYbbrRa21","date":"Tue Oct 20 21:47:27 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to UAMPS on their $1.355 billion cost-share award from @ENERGY to be located at the @INL .  \n\nSMRS = clean, reliable, carbon free power that will keep the lights on in the future💡","date":"Fri Oct 16 16:28:45 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Less than 3 months after enactment and the Great American Outdoors Act is already benefiting #Idaho.  \n\nhttps://t.co/C5NR31Ij9j","date":"Thu Oct 15 21:11:55 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I was fortunate to address @GovernorLittle's Leadership in Nuclear Energy Commission this morning concerning  @HouseAppropsGOP  and advancements in #nuclear energy. \nThanks to Co-Chair @Dr_Mark_Peters for your incredible leadership to @INL and #Idaho. https://t.co/EBMFFCHl3o","date":"Wed Oct 14 19:17:08 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Joining @nateshelman on @KBOI670  at the top of the hour. \n\nListen here \n\nhttps://t.co/dzbBr77frp","date":"Fri Oct 09 20:50:56 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"You’ll never appreciate a teacher more than when you try to fill in for one. Please join me in thanking all the amazing educators who are continuing to put our students first. https://t.co/19rILK9f1w","date":"Thu Oct 08 18:38:16 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The @IRSnews announced that it’s extending the deadline to claim an Economic Impact Payment by five weeks to help individuals who haven’t yet received a stimulus payment.\n\nhttps://t.co/tusObwy2ct","date":"Tue Oct 06 14:34:23 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday @SteveScalise, a great colleague and friend!","date":"Tue Oct 06 14:13:46 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A beautiful time of year in Idaho","date":"Sat Oct 03 16:54:47 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It's frustrating that @SpeakerPelosi &amp; House Democrats continue to block a vote on commonsense legislation to help small businesses. That's why @RepRussFulcher and I signed a discharge petition calling for a vote on HR8265, a bill to extend #PPP.\n\nhttps://t.co/1EGwuC3DbS","date":"Wed Sep 30 20:36:58 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A great story from Skyline High School to start you day.","date":"Tue Sep 29 13:21:36 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I'll be joining Neal and Julie on News Talk 107.9 at the top of the hour. \n\nYou can listen LIVE below \n\nhttps://t.co/SmQZzuFwGY","date":"Fri Sep 25 14:55:35 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It's great to see @LAYS recognize such an incredible organization.\n\nhttps://t.co/L6UX3GL6yX","date":"Wed Sep 23 19:49:11 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"While Congress has enacted meaningful wildfire reforms in recent years, it is clear we must do more. That is why I joined @MikeCrapo @SenatorRisch @RepRussFulcher in asking Senate and House leadership to pass broad, bipartisan, forest management reforms. https://t.co/dWRo2aV4m9","date":"Wed Sep 23 15:29:00 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I appreciate that she could disagree with her colleagues and yet still respect them, forming lasting friendships, like the one she and the late Justice Scalia shared. \n\nOur thoughts and prayers go out to her family during this difficult time.","date":"Sat Sep 19 15:33:59 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I join a mourning nation with the loss of Justice Ruth Bader Ginsburg. She leaves a legacy of countless accomplishments and will be remembered for her relentless support for women’s equality. There is no doubt she was an icon in our justice system.","date":"Sat Sep 19 15:33:21 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Starting Monday eligible farmers and ranchers can begin submitting applications for the next round of CFAP administered by @USDA. \n\nhttps://t.co/v9UTR67Q59","date":"Fri Sep 18 21:17:09 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Please join me in wishing Happy Birthday to our incredible @usairforce. 73 years of keeping our skies safe. https://t.co/djTo40jXhp","date":"Fri Sep 18 17:37:16 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Last night we dedicated the Dwight D. Eisenhower Memorial. Even in the rain it was an inspiring night honoring a great American leader. \n\n#IStillLikeIke https://t.co/z2zh60EWty","date":"Fri Sep 18 15:53:01 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"233 years ago today, our Founding Fathers signed the U.S. Constitution, a transformative and divine document. \n\nToday we celebrate the rights and responsibilities that this document protects. #ConstitutionDay https://t.co/q4qax4gnlv","date":"Thu Sep 17 15:23:39 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It's been a pleasure to serve on the @IStillLikeIke Memorial Commission. This memorial is a fitting tribute for all Americans to learn about and remember one of America’s great Presidents, Dwight D. Eisenhower.\n\n #IStillLikeIke\n\nhttps://t.co/pJ64qn5QgU","date":"Wed Sep 16 21:18:59 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks to legislation in 2018 there are sufficient federal resources available to fight these terrible wildfires. Now we must shift our focus to preventing these fires through common sense forest management practices.\n\nhttps://t.co/9hQ7sIWm0C","date":"Wed Sep 16 16:19:52 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The peace deal currently being signed between Israel, the UAE, and Bahrain is a historic step for peace in the Middle East. I applaud the President’s leadership and I encourage other Arab states to come to the table. https://t.co/2zJT284w1p","date":"Tue Sep 15 17:06:09 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I admire the teachers and administrators who refuse to let Idaho’s students fall behind.","date":"Sat Sep 12 17:14:28 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#NeverForget","date":"Fri Sep 11 15:35:04 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today we mourn the victims, we honor the heroes and we celebrate the survivors. The attacks that day brought so much pain to our nation yet somehow we came together. We set aside partisan bickering &amp; became one nation under God. It’s my hope that we can return to such unity. 🇺🇸 https://t.co/oliHwklD72","date":"Fri Sep 11 11:40:44 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On this #SuicidePreventionDay I invite anyone who is struggling to carry on to keep going. Seeking professional help is not a sign of weakness and whether you believe it or not the world is a better place with you in it. \n\nHelp is just a click call away \nhttps://t.co/bGg4rSWw3w https://t.co/p66kzoLyq5","date":"Thu Sep 10 17:50:00 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks Russ, the feeling is mutual!","date":"Tue Sep 08 19:37:59 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This year I am particularly grateful for the hardworking men and women who keep this country going. To the farmers and the ranchers who keep us fed, our military and healthcare workers who keep us safe, and the countless others, thank you! \nHappy #LaborDay 🇺🇸 https://t.co/nMoowGhfJW","date":"Mon Sep 07 15:12:52 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As schools start back up I want to applaud the dedicated teachers students and parents for their patience and persistence in an unpredictable time. I truly believe the future is in great hands because our students are in great hands. \n\nHappy back to school 🍎 📚","date":"Mon Aug 31 15:13:31 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Friday - here's something we can all smile about","date":"Fri Aug 28 16:14:12 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"104 years ago today the @NatlParkService\n was established. Happy Birthday to our beloved national parks, thanks to the Great American Outdoors Act they'll have many more birthdays to come! \n\nhttps://t.co/fgAX7FBdAp\n\n#NPSBirthday #FindYourPark #GAOA https://t.co/y9Iwe5xwuI","date":"Tue Aug 25 18:27:30 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This morning we celebrated the groundbreaking of the  @USGS Forest &amp; Rangeland Ecosystem Science Center. Water is the lifeblood of Idaho’s economy and we're always looking for ways to save money, streamline government &amp; better serve – this is a big step in achieving these goals. https://t.co/BVgUzmVAzA","date":"Tue Aug 25 16:38:08 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congrats to New Path Community Housing in Boise for their award of excellence, which is given only to the best affordable housing developments in the nation.\nMade possible by #PacificCompanies #NorthwestIntergrityHousing @IdahoHousing helping some of our most vulnerable citizens.","date":"Mon Aug 24 21:35:11 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’ve heard a lot about the @USPS this week. Some are scared that @realDonaldTrump &amp; @HouseGOP are trying to sabotage the USPS in order to win an election.  It's Not True.\n\nRead my article below to see what is REALLY happening at the Postal Service. 📬\n\nhttps://t.co/XOrwUWJfSC","date":"Fri Aug 21 19:50:37 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Mark and Ann Marie have been an incredible asset to @INL and our whole community they will certainly be missed. Fortunately I’ll continue to have a close working relationship with @Dr_Mark_Peters in his new role with @Battelle.","date":"Thu Aug 20 16:06:22 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"100 years ago today the  #19thAmendment was ratified and women were granted the right to vote. Those voices have been essential in shaping our democracy and creating a more perfect union. \nToday we honor them. https://t.co/G4HwYrnUzB","date":"Tue Aug 18 15:04:26 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today @SenatorRisch and I presented a congressional record honoring the retiring  @CSIEagles President,  Jeff Fox. He was a great leader, but CSI is in good hands with Dr. Fisher. https://t.co/ANsats3Uro","date":"Thu Aug 13 19:33:16 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It's been just over a week since the Great American Outdoors Act became law. https://t.co/frUdkLHpzw","date":"Thu Aug 13 17:09:48 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Enjoy @YellowstoneNPS but remember they are called WILDlife for a reason.","date":"Wed Aug 12 16:03:15 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#DidYouKnow Idaho has such a robust dairy industry 🐮 🥛 ? Without our fantastic farmers it simply wouldn’t work.","date":"Wed Aug 12 13:58:43 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Welcome home!","date":"Mon Aug 10 01:37:25 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Tens of billions of dollars remain unspent from the CARES Act.   Many in our communities are still in crisis, and we need to provide targeted relief now instead of playing these shameful partisan games.","date":"Sun Aug 09 01:38:33 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I applaud @realDonaldTrump for taking action to help those who need it most.  People  are struggling to make ends meet. Speaker Pelosi knows this, but she is too concerned with making outrageous demands for a non-COVID related wishlist of items to come to the table seriously.","date":"Sun Aug 09 01:37:14 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is Purple Heart Day - a day to honor our heroes who were wounded or killed in combat. https://t.co/dYVMkuNw8I","date":"Fri Aug 07 13:26:00 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I have long advocated for reforming our immigration system but these radical proposals are not the way to do it.","date":"Wed Aug 05 16:10:28 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to these brave men and women of the @USCG for defending our shores since 1790.","date":"Tue Aug 04 19:59:00 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In honor of the Great American Outdoors Act @SecBernhardt has signed a proclamation making August 4th a free day in all #NationalParks.","date":"Tue Aug 04 17:13:40 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"President Trump Participates in a Signing Ceremony for H.R. 1957 – The Great American Outdoors Act. Watch it Live at 8:30 MT\n\nhttps://t.co/yVJFq9mEPV","date":"Tue Aug 04 14:05:07 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"You can read my latest e-newsletter below and sign up for updates here - https://t.co/E5FqPHhby1\n\nhttps://t.co/nID3aLRfbK","date":"Mon Aug 03 16:39:03 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am pleased to join @SecretarySonny and a #bipartisan, bicameral, and diverse group of stakeholders who are on the ground replanting our national forests.","date":"Fri Jul 31 17:19:12 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"History was made today and Idaho's fingerprints were all over it thanks to the incredible work done at @INL 🚀\n\nLearn More https://t.co/ltkMNcbz9S\n\n#CountdownToMars #PoweringPerseverance","date":"Thu Jul 30 21:38:37 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We can replant trees in our wildfire stricken forests, without using taxpayer funds. This will benefit our environment through carbon sequestration, our economy through job creation in rural communities, and recreation all across the country.\n\nhttps://t.co/Mgf0EFMLyO","date":"Thu Jul 30 17:20:20 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I couldn't agree more","date":"Tue Jul 28 21:35:06 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"While enjoying public lands a little prevention can make a large difference in reducing human-caused fires this season.\n\n#KnowBeforeYouGo  #OnlyYou","date":"Tue Jul 28 20:13:20 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We had a wonderful tela-townhall tonight. Thank you to the thousands of Idahoans who participated. If you have questions, concerns, and yes even complaints, you can best reach me at  https://t.co/0b8vJQcy3g https://t.co/P8qieqSNzc","date":"Fri Jul 24 03:18:35 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This bipartisan and historic legislation will guarantee future generations will be able to enjoy our great outdoors. It has been a privilege to lead these efforts w/ @SenCoryGardner  &amp; @SteveDaines. \nIt's headed your way @realDonaldTrump https://t.co/bKngXgvTxK","date":"Thu Jul 23 18:17:53 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am thrilled to see this legislation on its way to President Trump’s desk where he will sign the bill into law. This bill is great for Idaho and public lands across this country.\n\n#FundLWCF #FixOurParks\n\nhttps://t.co/lpR3rSdWz8","date":"Wed Jul 22 22:07:23 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I agree @SteveDaines, Let's get this done!","date":"Wed Jul 22 17:09:43 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I will be speaking on the House floor in a few moments in favor of The Great American Outdoors Act.\n\nYou can watch live here https://t.co/tIC1GlxXgh","date":"Wed Jul 22 16:19:55 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks to the @WhiteHouse #NEPAModernization has simplified an arduous process all while protecting environmental safeguards.","date":"Tue Jul 21 17:07:25 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho has, and continues to, make incredible contributions to space explorations. \n\n#SpudsAndSpace","date":"Tue Jul 21 15:29:32 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The House paid tribute today with a moment of silence for John Lewis. See my statement below on the passing of this larger than life leader. https://t.co/ha11vthPtF","date":"Mon Jul 20 17:55:26 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is long overdue but I'm pleased that I will get a chance to vote in favor of this incredible bill next week. \n\n#fundLWCF #FixOurParks #GreatAmericanOutdoorsAct","date":"Fri Jul 17 19:11:49 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We also appreciate @SecBernhardt’s efforts to help move this legislation to preserve and protect our public lands without using taxpayer money.","date":"Thu Jul 16 14:53:53 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Science should be transparent and I don’t understand how Democrats could oppose a rule that is designed to make @EPA’s science publicly available so we can better understand how &amp; why they create rules &amp; regulations. \n\nWatch my comments to learn more. https://t.co/fgJ0ihQ3hx","date":"Mon Jul 13 14:14:34 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The level of partisanship that the D's have inserted into the approps process is disappointing. R's were ready &amp; willing to work together but were left out of the process. It’s time to get off our partisan high horses and put the American people first.\nhttps://t.co/W2Ku2sDOSy","date":"Thu Jul 09 17:25:07 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Growing up in Yellowstone’s backyard, I was afforded the opportunity to enjoy our nation’s first national park. I feel it's important to pay it forward to future visitors that deserve the same quality experience. \n\nThe Great American Outdoors Act would do just that. https://t.co/fWBhEFpciv","date":"Wed Jul 08 16:25:58 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Without the normal celebrations, today is a chance to ponder &amp; appreciate what it means to live in this beautiful nation. Kathy &amp; I consider our citizenship one of the greatest blessings we’ve received &amp; we’re thankful for this day to celebrate that. Be safe &amp; God Bless the USA! https://t.co/AhDWoIuGvN","date":"Sat Jul 04 16:22:27 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As we kick off the 4th of July weekend, let’s remember those who are keeping us safe. From our courageous military to healthcare workers and firefighters, and yes our incredible police force, we enjoy this holiday because others are putting on the uniform &amp; for that I thank them. https://t.co/8GMUei1dp0","date":"Fri Jul 03 21:44:08 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today #USMCA goes into full effect. This 21st century trade agreement is a big win for #Idaho industry. https://t.co/canpGAvxct","date":"Wed Jul 01 15:58:14 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Students in 3-12 grade have been invited by @FLOTUS to submit artwork depicting individuals, objects, and events representing the women’s suffrage movement. Artwork submissions are due by July 6th. More information below.\n\nhttps://t.co/dHwRfNqHav","date":"Wed Jul 01 14:18:58 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The President’s call to #FixOurParks and #fundlwcf is exactly what Congress needed to finally address this procrastinated problem. I look forward to working with @SecBernhardt and my colleagues in Congress to get this bill to @realDonaldTrump’s desk.\n\nhttps://t.co/o6i0cPH1La","date":"Tue Jun 30 15:00:18 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Here's to 50 more 🥂 https://t.co/XSmV6N4RvR","date":"Wed Jun 24 17:10:39 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I have long supported integrated energy systems in my capacity on the House Energy and Water Appropriations subcommittee and I thank @RepRussFulcher for introducing this legislation to keep the focus on this important work.\n\nhttps://t.co/6oI39foIWB","date":"Thu Jun 18 21:32:06 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Honored to join @ENERGY @SecBrouillette showing our support for the incredible work being done at @INL https://t.co/idlK5muZCB","date":"Thu Jun 18 20:15:17 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The most important conservation &amp; outdoor rec bill in 50yrs just passed the Senate with overwhelming bipartisan support. As the lead House sponsor I look forward to shepherding  The Great American Outdoors Act to @realDonaldTrump’s desk. \n\n#RestoreOurParks #LWCF https://t.co/H67cKr1GJk","date":"Wed Jun 17 17:09:11 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"President Teddy Roosevelt's great-grandson weighs in on the bipartisan Great American Outdoors Act. \nThis legislation is close to my heart and the leadership of @SenCoryGardner will help make this happen. \n\n#FundLWCF #RestoreOurParks","date":"Tue Jun 16 20:08:40 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ICYMI - My thoughts on 'Defunding the Police' \n\nhttps://t.co/Bjt5mWjvsq","date":"Mon Jun 15 20:14:54 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I proudly joined @MartinHeinrich and @LandTawney in the op-ed below, urging Congress to listen to the American people and throw their support behind the bipartisan Great American Outdoors Act. \n\nhttps://t.co/NxiuoQ0hxB","date":"Mon Jun 15 18:25:23 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy #flagday2020 https://t.co/BpgcxGFghC","date":"Sun Jun 14 16:45:32 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today we celebrate 245 years of @USArmy protecting this nation and defending our freedoms. \nThank you America’s Army. #ArmyBday https://t.co/MgqU1t7hpD","date":"Sun Jun 14 15:36:24 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you for your leadership on this bill @senatemajldr","date":"Sat Jun 13 00:50:08 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A bipartisan group of former secretaries of @Interior, including Idaho’s own Dirk Kempthorne, voice their support for the Great American Outdoors Act.\n#fundlwcf \n\nhttps://t.co/fY9yLW8zbD","date":"Fri Jun 12 16:52:55 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks for your support @IvankaTrump of this important legislation.","date":"Mon Jun 08 20:11:25 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you @Backcountry_H_A, this is an important piece of legislation and I appreciate your supporting it.","date":"Mon Jun 08 14:55:40 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is a sacred day for the free world. On June 6th 1944 the beaches of Normandy were stormed in the name of freedom. \nI am a thankful recipient of those brave soldiers’ sacrifice. \n#DDay76 #DDay2020 https://t.co/265BpxcgDn","date":"Sat Jun 06 16:50:58 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Encouraging news - America's economy is showing strong signs of recovery. Today, we have added 2.5 million jobs, the biggest one-month job surge in US history, since 1939. #CARESAct programs like #PPP are helping keep doors open and workers paid.  \n\nhttps://t.co/UprBQH7rPT","date":"Fri Jun 05 16:33:59 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Great American Outdoors Act would #FundLWCF and #FixOurParks so generations to come will be able enjoy these amazing places as we do today. https://t.co/bJBf7C0On4","date":"Thu Jun 04 18:38:47 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today I'm excited to introduce the Great American Outdoors Act along with @JoeCunninghamSC and a bipartisan coalition. This is an answer to @realDonaldTrump call for a bill to fully fund @LWCF and restores our National Parks. \n\nhttps://t.co/RR9trKc3Rg","date":"Thu Jun 04 15:55:31 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/ixpYqHvUyf","date":"Mon Jun 01 19:59:56 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I had a wonderful time talking spuds, thanks for having me!","date":"Fri May 29 16:45:58 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Our @ifchukars are a staple of the community &amp; with this legislation we can offer them a lifeline. The Chukars like many organizations have significant local public resources invested in their facilities. To give up on these would be devastating. \nhttps://t.co/Gr4Tx3N8tm","date":"Thu May 28 16:52:10 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Starting TODAY eligible farmers and ranchers can begin submitting applications for the Coronavirus Food Assistance Program (CFAP) administered by @USDA \n\n https://t.co/AY39aXLONm","date":"Tue May 26 14:51:17 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Incredible tribute from @IDNationalGuard. Thank you for your dedicated service.","date":"Thu May 21 20:48:24 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Starting on Tuesday, May 26th, eligible #farmers and #ranchers can begin submitting applications for the Coronavirus Food Assistance Program (CFAP) administered by @USDA.\n\nhttps://t.co/h2eoPbbxtY","date":"Thu May 21 19:21:24 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In times like this our community must come together. Kathy and I are heartbroken to hear of this tragedy, our prayers are with the family and the Bonneville County Sheriff's Office.","date":"Mon May 18 21:21:37 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Access to #PPE will ensure #Idaho can open up in a safe and timely manner.  Thanks @realDonaldTrump and @GovernorLittle for your leadership to make this happen. https://t.co/ypRnUOHgbQ","date":"Mon May 18 17:49:18 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This #ArmedForcesDay we honor our heroes by saluting their service. Please join me in thanking all the brave men and women who keep this nation safe, strong, and the best country on Earth 🇺🇸 https://t.co/6UCGI5HimK","date":"Sat May 16 16:17:28 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Starting at 10am MT the F-15 Friday Flyover begins. This is an incredible way to honor the incredible healthcare workers in #Idaho.","date":"Fri May 15 15:56:11 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"House Democrats have put forward legislation with a price tag of 3 trillion dollars, and I will not be supporting it. They accepted no Republican input &amp; instead included every single left wing item on their progressive agenda &amp; are somehow trying to call it a recovery bill. https://t.co/T3hQw93rrG","date":"Fri May 15 15:52:34 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Farmers who are looking for information about direct payments from the recently passed #CARESAct can visit the @USDA link below\n\nhttps://t.co/AY39aXLONm","date":"Thu May 14 17:33:16 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you @SecBernhardt for helping reopen @YellowstoneNPS in a safe and timely manner. That is one of the most beautiful places on this planet and it deserves to be seen.","date":"Thu May 14 15:52:54 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The 4th of July will be very different this year without the Melaleuca Freedom Celebration. We'll all look forward to a bigger and better show in 2021 🎆","date":"Thu May 14 15:50:29 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Should have stuck to #Idaho","date":"Wed May 13 15:36:07 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"President Lincoln said  “All that I am or ever hope to be, I owe to my angel mother” and those wise words are felt by many today. \n#HappyMothersDay to all those wonderful mothers out there. We certainly wouldn’t be here without you. https://t.co/nTO89SojkA","date":"Sun May 10 15:50:09 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It appears you were ill-informed Bob. Sharing this manipulated video is beneath you &amp; we expect more from journalists. For the record my full quote said “Covid-19 isn’t a Republican problem or a Democrat problem, it’s an American problem.”\n\n#StrongerTogetherEvenWhenApart","date":"Sat May 09 01:20:32 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On #VEDay  we remember the leadership of General Eisenhower, who helped turn the tide of the war to victory. While we're not able to gather to dedicate his Memorial as planned today, let’s honor his legacy. Follow @IStillLikeIKE #VEDay75 https://t.co/1WcQjgRyC0","date":"Fri May 08 17:50:27 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is the 75th anniversary of victory in Europe. Nazi German was defeated and freedom rings today because of the heroes sacrifice. \n\n#VEDay75 https://t.co/eGT3KefWw2","date":"Fri May 08 16:01:58 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to all the nurses throughout Idaho, you've been heroes during this crisis. \n\n#NursesAppreciationWeek https://t.co/0PA957FUe8","date":"Wed May 06 18:47:44 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This #bipartisan sentiment is certainly worth sharing. Thank you @ButchOtter, @whmanny, and Walt\n for this well timed piece.\n\nhttps://t.co/aotuCBqg7S","date":"Wed May 06 00:06:49 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am thankful to @SecretarySonny  for today’s announcement on food purchases, especially for dairy and potatoes. There's still more work needed to help our Idaho farmers and ranchers but this announcement is welcome news. \n\nhttps://t.co/i5SxWXQzgH","date":"Tue May 05 17:20:11 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The future is in great hands because our students are in great hands. To the profession that creates all other professions, thank you! #TeacherAppreciationDay https://t.co/vNqLAM2WGm","date":"Tue May 05 16:20:35 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I are deeply saddened to hear the news of John’s passing.\nHe will forever be remembered as a man who cared deeply about Idaho’s natural resources and wildlands and bringing people together to discuss these issues. \n\nRead more here: https://t.co/mKGEfs8sEc","date":"Mon May 04 15:15:04 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Join me in wishing a Happy Birthday to our former Governor and my friend @SenatorRisch. Idaho wouldn’t be the same without your leadership. https://t.co/IjB5nQUt2H","date":"Sun May 03 16:20:17 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"President @realDonaldTrump and @SecBernhardt  are working to reopen our National Parks in a safe and responsible way. I applaud this effort, access to public land is a wise way to social distance.\n\nhttps://t.co/foylxy1tpE","date":"Wed Apr 29 18:45:00 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#RecreateResponsibly","date":"Wed Apr 29 16:01:54 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Small businesses are the lifeblood of rural communities, and this grant funding for a Revolving Loan Fund could not have come at a better time. \n\nhttps://t.co/v2NbBnFrpF","date":"Wed Apr 29 14:20:08 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The @INL is getting involved to help mitigate the impacts of #COVID19","date":"Tue Apr 28 18:18:37 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ICYMI https://t.co/0AvXzo7LLe","date":"Mon Apr 27 16:08:58 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"When flying isn’t an option and votes need to be cast, you load up the car and drive.","date":"Sun Apr 26 15:52:24 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Cranney Farms putting Idaho generosity and @IdahoPotato on the map  @LiveKellyRyan \n#familyfarms\n\nhttps://t.co/a4Rycgor24","date":"Fri Apr 24 19:09:08 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today kicks off #supportlocalgems, we’ll look for opportunities today to lend a hand of support to small businesses in our community. #supportsmallbusiness https://t.co/GvELjhMqBR","date":"Fri Apr 24 15:00:41 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I want to applaud Idaho based @Albertsons for committing $50 million to fight hunger across the country. This hunger relief effort will feed families during this crisis and will bless the lives of many.","date":"Thu Apr 23 14:04:20 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The #PPP has been a lifesaver for millions of American workers. I am disappointed @SpeakerPelosi  &amp; House Dems took so long to replenish it. I will be voting YES for additional funding for this program because American jobs and small business depend on it. https://t.co/TEdZ6DWSOz","date":"Wed Apr 22 21:30:36 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"If you are waiting for your Economic Impact Payment, don't panic. The IRS is delivering them as fast as possible to millions of eligible Americans. \nIf you have questions see: https://t.co/Bg4yzii4yE https://t.co/y2VCPI5jWz","date":"Wed Apr 22 20:26:38 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"From floating the South Fork to hiking the White Clouds, this Earth deserves to be discovered and appreciated.\nHappy #EarthDay  Idaho🌎\n\n#EarthDay50 https://t.co/1BOyLZCpEr","date":"Wed Apr 22 17:22:07 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is about keeping people safe while we get the country up and running again. Timing is essential!","date":"Tue Apr 21 19:24:11 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Here’s an Idaho business benefiting from the #PaycheckProtectionProgram. This program needs more funding for small business.","date":"Sat Apr 18 15:26:16 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The  #PaycheckProtectionProgram is officially out of funds. Small businesses throughout Idaho are counting on Congress to step up. I’m calling on @SpeakerPelosi to stop playing politics and let this money get to the people who actually need it. https://t.co/V3uB7gcnrI","date":"Thu Apr 16 16:49:24 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I appreciate @GovernorLittle &amp; @realDonaldTrump's leadership-  both are working w/ health care experts to ensure Idahoans are safe &amp; have necessary resources. \nWe all have the same goal in mind, let's get the economy working again all while keeping the public healthy and safe. https://t.co/rnKaZG3yIq","date":"Wed Apr 15 19:33:48 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Check in with your favorite parks","date":"Wed Apr 15 16:56:26 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks to @realDonaldTrump leadership and role in getting this deal done, American energy producers will have a more stabilized market. \n\nhttps://t.co/Iy9IRGvaNJ","date":"Mon Apr 13 22:00:51 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This a great read for all the baseball fans out there ⚾️\n@ifchukars \n \nhttps://t.co/ajDH8m8WAK","date":"Mon Apr 13 17:43:34 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I want to wish each of you a Happy Easter. Today we celebrate the empty tomb, we celebrate the risen Christ and we celebrate the fact that dark days do end! On this Easter Sunday let’s remember this message of Hope. #HappyEaster https://t.co/O9AytK2r6Y","date":"Sun Apr 12 14:46:35 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I had the opportunity to speak with County Commissioners throughout Idaho today. We discussed federal funds for their counties coming from the CARE Act as well as PILT and SRS. We have great county leadership in Idaho. #idpol","date":"Fri Apr 10 22:56:26 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ICYMI - https://t.co/44EXsLiYLj","date":"Fri Apr 10 16:21:16 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On this #GoodFriday people of all different beliefs and from all parts of the world are joining together in fasting and prayer to seek relief from the COVID-19 pandemic. I welcome this outpouring of faith and hope as we enter into #EasterWeekend https://t.co/KNSRVBZDe3","date":"Fri Apr 10 14:27:55 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In challenging times our nation shows its true colors #AmericaWorksTogether","date":"Thu Apr 09 21:19:07 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Farmers and ranchers are continuing to encounter hardships during these unprecedented times. I've been in close contact with farmers, food processors, &amp; others in Idaho to mitigate these challenges so our nation can continue to have a steady food supply. \nhttps://t.co/09cTDHi6jU","date":"Thu Apr 09 17:09:03 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great art projects for the kids 🎨 🐄","date":"Wed Apr 08 21:52:15 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today I’m wishing the Jewish community a joyous and meaningful #Passover . Though this year’s celebration will look different, the Passover message of hope and perseverance in the face of difficulty rings especially true. Chag Sameach! https://t.co/ViuwltrHsm","date":"Wed Apr 08 16:26:25 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s #WorldHealthDay and we have great healthcare professionals throughout Idaho who want to keep us healthy and safe. Join me in thanking them https://t.co/8jfdvO0XDb","date":"Tue Apr 07 19:23:17 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ICYMI- The @USTreasury has just released this updated FAQ about the Payment Protection Plan. \n\nhttps://t.co/FX0uC3XSkk","date":"Tue Apr 07 14:35:22 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As my staff and I are teleworking to help limit the spread of #Covid_19, more than even it’s important we hear your questions and concerns via my website https://t.co/0b8vJQcy3g","date":"Mon Apr 06 12:29:15 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is an important program and a great opportunity. The deadline quickly approaching","date":"Fri Apr 03 17:50:26 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Important news for Social Security recipients.\n \nFor more information https://t.co/PIROONyS1V https://t.co/2bxF38KPjl","date":"Thu Apr 02 18:24:38 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The #coronavirus is unlike anything we’ve dealt with, which is why @TomColeOK04 and I asked the Coronavirus Task Force to explore innovative technologies that show promise in creating vaccines and treatments for COVID-19.  \n\nRead the full letter below \n\nhttps://t.co/S4JjbjoU6g","date":"Thu Apr 02 15:56:53 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The American farmer and rancher is needed now more than ever. I proudly joined with over 140 of my colleagues in sending a bipartisan letter to @SecretarySonny at @USDA encouraging swift relief for those working in Ag.\n\nRead the full letter below\n\nhttps://t.co/8Z5w70BdxS","date":"Wed Apr 01 23:56:32 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today is #NationalDoctorsDay 🩺\n \nTo our heroes in healthcare putting their patients first, today and every day, Thank You!  \nWe need you now more than ever. \n\nJoin me and #ThankADoctor today! https://t.co/TDMHTeT3y3","date":"Mon Mar 30 14:12:45 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This legislation is a necessary step towards stabilizing our economy, providing resources for health providers on the front lines, and furthers access to patients who have been stricken by #COVID19 https://t.co/a6LwloClR6","date":"Fri Mar 27 18:53:16 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The House has passed critical relief package following intense negotiations by @POTUS and Senate passage with Idaho Senators’ support.\n\nThese are truly unprecedented times that calls for extraordinary measures.\n\n #InItTogether \n\nhttps://t.co/UG8ZLCMDsf","date":"Fri Mar 27 17:59:39 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In challenging times humanity shows it’s true colors. There’s so much good in the world, don’t forget to look for it.","date":"Fri Mar 27 15:16:38 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great to see @StateDept recognizing how important farmers &amp; their labor force are to our country. Food security is of critical importance during this time and State, @USDA, @USDOL &amp; @DHSgov should be applauded for their work to prioritize agriculture.\nhttps://t.co/Dd6izYtSvd","date":"Thu Mar 26 23:19:50 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Let’s be wise about our purchase of food and supplies. The last thing we want to do is leave our vulnerable population without access to resources. https://t.co/kMXG84xNl5","date":"Thu Mar 26 17:23:44 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Help get the word out","date":"Wed Mar 25 20:17:39 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The spread of #COVIDー19 isn't a Republican problem or a Democrat problem, it's an American problem. \nStay Calm, Stay Informed, and Stay Home! \nWe're in this together. \n#TogetherApart https://t.co/Qj71iuV0pi","date":"Mon Mar 23 17:13:10 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Heartwarming story out of Idaho Falls","date":"Mon Mar 23 00:58:43 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Let’s end the spread of rumors about COVID-19 only share information from trusted sites and sources.","date":"Sun Mar 22 21:17:00 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I joined @RepRussFulcher @RepDelBene @cathymcmorris and @repblumenauer in reaching out for additional ventilators for our states, as we are in dire need for more devices.  #Covid_19 \n\nhttps://t.co/y4uHjAwxWC","date":"Fri Mar 20 22:43:51 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m mindful of our friends in @BlaineCountyID and ask that they stay home to slow the spread of #COVID19","date":"Thu Mar 19 23:52:42 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"COVID-19 Coronavirus Updates from Saint Alphonsus https://t.co/IID7EDSwEl","date":"Thu Mar 19 19:06:23 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great work Senator to ensure our farmers and their labor needs will be prioritized during this difficult time.","date":"Thu Mar 19 14:08:17 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is what @GovernorLittle meant when he said “History will remember our reaction to coronavirus, so let’s be there for each other”\n\nhttps://t.co/nKjV0f0r1d","date":"Wed Mar 18 20:23:32 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Join me in thanking all those on the front lines keeping America safe and healthy https://t.co/kzvkRBkgV9","date":"Wed Mar 18 19:25:15 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you @SenatorRisch for your leadership on this. We are working with farmers throughout #Idaho to ensure we have a safe and reliable Ag workforce so our nation and world can stay fed.","date":"Wed Mar 18 19:07:43 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Important information for our Veterans to know","date":"Wed Mar 18 17:35:36 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to all these great high school artists. Our students are fortunate to have such phenomenal art teachers throughout Idaho. @conginst \n\nhttps://t.co/RfqjqBMRCX","date":"Wed Mar 18 17:11:45 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#DontBeASpreader","date":"Wed Mar 18 14:02:41 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"\"St. Luke's announced they will begin conducting drive-up coronavirus testing and putting up tents to hold supplies. \nAdditional testing sites will come to Boise on Wednesday.\"\n\nhttps://t.co/aIbuSD9HDj","date":"Tue Mar 17 20:35:23 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"📚","date":"Tue Mar 17 18:06:21 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"At 9:05 MST this morning I will be talking about the government response to #COVID2019 \nwith Neal Larson and Julie on @kidnewsradio \n\nTune in here https://t.co/64AoyRt4Ng","date":"Tue Mar 17 14:55:35 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho will receive $4.5 million  to assist in our efforts to combat #COVID2019 \nThis is good news for #Idaho \nhttps://t.co/XSvNErdH5o","date":"Mon Mar 16 21:33:54 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The bipartisan \"Families First #coronavirus  Response Act\" passed by the House is crucial assistance for #Idaho and families throughout America. https://t.co/tYMXzcxWHZ","date":"Mon Mar 16 19:19:26 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I fully support the President's call to pass the 2nd emergency supplemental package in response to #COVID2019 &amp; stand ready to continue to work w/ my colleagues in Congress &amp; the President to help the American people through these challenging times.\n\nhttps://t.co/xwzGuhdJnO","date":"Mon Mar 16 18:28:50 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#NationalDayOfPrayer https://t.co/eIf16cgM1U","date":"Sun Mar 15 16:04:37 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We are fortunate there are no confirmed cases of the novel coronavirus (COVID-19) in the state, it is important we all remain calm, yet vigilant.\nThe web page below will be updated frequently to provide each of you with information as it becomes available.\nhttps://t.co/s1dU2IpWzP","date":"Fri Mar 13 20:15:05 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"FDA’s hotline (1-888-INFO-FDA) is available 24 hours a day for labs to call regarding difficulties obtaining supplies for collecting patient samples for COVID-19 testing, including swabs, media needed for transport, and  conservation of the samples.","date":"Fri Mar 13 16:47:34 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday to my 2nd favorite Congressman from Idaho @RepRussFulcher 🎂 - We are lucky to have you Russ! https://t.co/FconSdU0i6","date":"Tue Mar 10 00:38:01 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho high school art students have submitted fantastic pieces for the Congressional Art Contest. You can see them displayed starting tomorrow at  @TAMeasternidaho 👩‍🎨🎨 https://t.co/oUJgwZx1VC","date":"Fri Mar 06 18:58:48 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I applaud committee passage of H.R. 6020 and am pleased Congress continues to stand up for rural and small town America. #SaveTheMinorLeague Task Force fellow Co-Chairs @RepLoriTrahan @RepMcKinley @RepMaxRose have been great teammates on this issue ⚾️\nhttps://t.co/xlpeVzZGL1","date":"Thu Mar 05 19:42:57 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My wife and I have a great appreciation for the humanities and will continue to support it in our communities.","date":"Thu Mar 05 16:06:06 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy #IdahoDay https://t.co/XfUZclSHWl","date":"Wed Mar 04 14:37:03 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The A-10 has proven itself to be a reliable workhorse of American airpower, and I am pleased that Congress continues to recognize the A-10’s critical mission and the Airmen who support it. ✈️\n\nhttps://t.co/GpSugwW90p","date":"Mon Mar 02 20:03:46 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Please join Idaho's Congressional delegation for Service Academy Days. https://t.co/oHtNdw788v","date":"Fri Feb 28 21:51:25 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Proud to join @ThisSpudsForYou at the steps of the Capitol with @RepZoeLofgren @RepNewhouse @RepJimmyPanetta \n@RepLaMalfa asking the US Senate to take up agriculture labor reform. https://t.co/yj3cHeiY7G","date":"Wed Feb 26 21:53:49 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Cancer impacts too many of our family and friends. \nWishing @Jeopardy's Alex Trebek well wishes in his battle w/ pancreatic cancer. \nI'm proud to support @NIH funding to prevent and fight this disease. Thank you @OfficialPCA for your advocacy &amp; support to those fighting cancer.","date":"Tue Feb 25 21:21:12 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"US potatoes for processing will have immediate access to China markets. \nThis is a big deal for Idaho, well done to the Trump administration on implementation of U.S. China Phase One. \n\n@USDA @USTradeRep @realDonaldTrump \n\nhttps://t.co/mI1m7niuTm","date":"Tue Feb 25 16:55:09 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Pleased to be with friends and colleagues  @GovernorLittle @SenatorRisch @lawrencewasden @Dr_Mark_Peters to celebrate  a successful negotiation to the 1995 Idaho Settlement Agreement. This is a great thing for Idaho,  @INL @ENERGY and our whole nation. https://t.co/dccSCw0FFG","date":"Sat Feb 22 00:17:37 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Let's take a moment and appreciate \"Drive Your Tractor to School Day\" at Rigby High School🚜#Idaho \n\n@NationalFFA","date":"Fri Feb 21 21:27:27 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s never too late \n\nhttps://t.co/e4qekJe3QS","date":"Fri Feb 21 20:07:25 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#USMCA is a very important agreement for Idaho agriculture and Idaho in general. I was pleased to support @realDonaldTrump when this agreement was voted on in the House and I look forward to future agreements with the EU and China.\n @GovernorLittle @MikeCrapo \n@SenatorRisch https://t.co/G4QZSp1mSg","date":"Thu Feb 20 21:00:31 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"You should have made it a true Daily Double. \n\n#YoureOnJ! #Dentists @Jeopardy https://t.co/m4eIhjeFXt","date":"Tue Dec 11 17:17:16 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"If you've ever wondered what goes on at @INL you can take a virtual field trip below. \nhttps://t.co/2yItITUkvj\n\n#EngineersWeek","date":"Tue Feb 18 20:02:50 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy #PresidentsDay 🇺🇸 https://t.co/ucFu8y2QFc","date":"Mon Feb 17 18:06:55 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am pleased to be able to support the Trump administration's new Navigable Water Protection Rules. This is particularly important to our friends in Ag. #wotus https://t.co/B9S0wsZnmD","date":"Fri Feb 07 23:13:00 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s the only way to stay warm when I’m in #Idaho 🥶","date":"Fri Feb 07 20:12:38 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s an honor to be named the Idaho Head Start Association Legislator of the Year. Unfortunately I couldn’t be there in person due to votes in the House of Representatives but my lovely wife Kathy was there to accept the award on my behalf. https://t.co/2pReehtSRr","date":"Wed Feb 05 22:30:32 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to @GovernorLittle @lawrencewasden and @SecBrouillette on this historic agreement.","date":"Wed Feb 05 22:03:57 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Read my statement following #SOTU2020 below https://t.co/lVZrT8OOAR","date":"Wed Feb 05 03:44:13 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It was a great morning with the National Council of Ag Employers discussing the Farm Workforce Modernization Act. \nThanks for keeping our world fed! https://t.co/yjJfPZKu0b","date":"Tue Feb 04 23:25:39 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On #CancerDay2020 we remain committed to a cure. During my time on @HouseAppropsGOP  I’ve fought for robust @NIH funding so that we won’t continue to lose our loved ones to that horrible disease.","date":"Tue Feb 04 16:54:14 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ICYMI - \nhttps://t.co/tlZs6V6hR3","date":"Thu Jan 30 17:17:59 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I'm pleased to see the  \"DAIRY PRIDE Act\"  received a hearing in the @HouseCommerce committee today. This bill is very important to dairy farmers in Idaho and throughout the country 🐄🥛\n\nhttps://t.co/eawzUxcvV9","date":"Wed Jan 29 19:39:58 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The #USMCA is a win, it's a win for Idaho, it's a win for our nation, and I applaud @POTUS  for getting this across the finish line. https://t.co/lTUaXgCaui","date":"Wed Jan 29 17:29:43 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It was great to chat with @AgInfoNet about the administration's announcement regarding #WOTUS \n\nhttps://t.co/VpsYQHHg3z","date":"Mon Jan 27 19:14:08 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On  #HolocaustRemembranceDay and the 75th anniversary of the liberation of Auschwitz #WeRemember  and pledge to learn from the dark days of the past. https://t.co/Ud57QloBhZ","date":"Mon Jan 27 17:07:32 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I applaud this Administration for hearing the concerns of rural Idaho and rewriting the Waters of the United States Rule. It was an honor to stand alongside EPA and the US Army Corps to announce this important action which gives clarity to farmers and businesses around the state. https://t.co/2V3YFi3nTs","date":"Thu Jan 23 23:52:44 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On #MLKDay we remember the champion of civil rights and honor the legacy left by Dr Martin Luther King Jr. https://t.co/pWLEiayng4","date":"Mon Jan 20 15:26:06 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Our hearts go out to the Duvall family @ZippyDuvall, Kathy and I send our thoughts and prayers your way as you mourn the passing of Bonnie.","date":"Sun Jan 19 18:22:46 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It was great to have @IdahoGrain in the office, we discussed #USMCA and the Farm Workforce Modernization Act.","date":"Thu Jan 16 16:32:24 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"https://t.co/KAJdFJ1KXM","date":"Tue Jan 14 16:34:05 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This video of US firefighters being welcomed in Australia, including Idaho’s Juston Fenton, is certainly worth watching.\n\nhttps://t.co/nAoOGyQoUy","date":"Sun Jan 12 15:59:15 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Knee replacement recovery is going well and I look forward to returning to  Washington next week. \nSee my statement on the War Powers Resolution below https://t.co/pO6sa9sR36","date":"Thu Jan 09 23:07:23 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"NEPA reform is long overdue and Idaho’s infrastructure will benefit from desperately needed projects that are waiting for approval. Not to be overlooked is the health of our forests and the reduced risk of wildfires.","date":"Thu Jan 09 18:51:36 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today, we honor and applaud the brave men and women of our federal, state, and local law enforcement for their daily commitment to keeping our streets safe 🚓\n#LawenforcementDay https://t.co/U5ezarS2Uc","date":"Thu Jan 09 16:27:59 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It's a special thing to see Idaho send some of our heroes to help our neighbors in Australia. We'll be praying for their safe return.","date":"Mon Jan 06 22:00:52 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today, because of decisive action taken by @realDonaldTrump and the US military, an avowed terrorist and enemy of the US has been brought to justice.  See my full statement below. https://t.co/xeSvBFK4aZ","date":"Fri Jan 03 19:28:37 +0000 2020","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am pleased to see #USMCA  pass the House with strong bipartisan support.\n Idaho farmers and ranchers need fair, free trade to compete and this deal provides a level playing field.\n\nhttps://t.co/8ylZpbchJT","date":"Thu Dec 19 22:46:14 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"After careful consideration of the evidence I voted no on #impeachment and here’s why \n\nhttps://t.co/TV6Vh3yB6P","date":"Thu Dec 19 03:42:21 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Our troops work tirelessly each and every day to promote global security and protect the American way of life, and I am proud to support a bill that supports them. #NDAA \n\nhttps://t.co/legTxEAy9r","date":"Fri Dec 13 16:28:46 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho farmers and ranchers feed the world and their greatest needs are a legal workforce and free trade, and this week we made tremendous progress on both issues.\n\nhttps://t.co/JXK8IsjHBw","date":"Wed Dec 11 23:27:18 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We have real work to do and this madness should come to an end.\n\nSee my full statement regarding impeachment below:\nhttps://t.co/BX7MGFnIQK","date":"Tue Dec 10 22:26:13 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you @britter for your support of the Farm Workforce Modernization Act. \nThis bill, much like #USMCA, matters to Idaho farmers &amp; it's important that we deliver.","date":"Tue Dec 10 18:01:53 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"While most of the world was watching the theatrical impeachment hearing in the House, Republicans were at work. On Monday, I joined 159 Republicans sending Speaker Nancy Pelosi a letter urging her to immediately consider and pass the U.S.-Mexico-Canada Agreement (#USMCA).","date":"Tue Dec 10 15:30:19 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is phenomenal, well done to the employees of the @INL.","date":"Thu Dec 05 20:30:35 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Baseball is America’s pastime and that pastime should not be exclusive to a select number of cities. \nI am proud to join my colleagues in starting this task force to ensure baseball stays vibrant in communities like Idaho Falls and Boise ⚾️","date":"Wed Dec 04 22:17:44 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks to @GovernorLittle and the Idaho legislature, Idahoans will enjoy the benefits of #RedTapeReduction","date":"Wed Dec 04 21:37:15 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I want to congratulate Dan Brouillette on his confirmation as the new Secreterary of @ENERGY. This is important work for the state of Idaho and our nation and you have my full support.","date":"Tue Dec 03 15:12:48 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I want to wish each of you a Happy Thanksgiving, we have so much to be thankful for🍁🦃 https://t.co/e1o6Gm3FOv","date":"Thu Nov 28 18:49:31 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am thrilled to see the Farm Workforce Modernization Act pass the House Judiciary Committee and thank Chairwoman @RepZoeLofgren for her leadership advancing the legislation\n\nhttps://t.co/r5XlHgJJoH","date":"Fri Nov 22 16:53:00 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Idaho Falls Chukars are a great asset to Eastern Idaho. My love for America's Pastime runs deep and I can see the positive impact that this ball club has on our community so I will continue to support its presence ⚾️","date":"Wed Nov 20 18:18:29 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you Commissioner Reed for your support of the Farm Modernization Act. Those who are closest to this issue understand best that something must be done.\n#agworkforce\n\nhttps://t.co/E8oaapDFSg","date":"Tue Nov 19 16:37:20 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I couldn’t agree more @GovernorLittle #USMCAnow","date":"Wed Nov 13 19:41:27 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks for your kind words Mark, @INL is lucky to have you.","date":"Wed Nov 13 18:28:06 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s an honor to be named as one of this year’s #ChampionsofScience.","date":"Wed Nov 13 18:23:09 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations @FarmBureau on a century of service to America's agriculture community.  Here's to a 100 more. #AFBF100 👨‍🌾🚜","date":"Tue Nov 12 21:02:16 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ICYMI - My article 'Why Idaho Farmers Need Immigration Reform'👨‍🌾\nhttps://t.co/DHTc8wgJSd","date":"Tue Nov 12 17:32:40 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Our nation owes no greater debt than to Americans who have served in our nation’s armed services and in defense of freedom, both here at home and across the globe. On behalf of a grateful nation, thank you for your service.\n#VeteransDay 🇺🇸 https://t.co/D5IUT4vo72","date":"Mon Nov 11 14:30:17 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m thrilled by today’s news and want to congratulate Governor Little, Attorney General Wasden, and the Department of Energy for successfully negotiating an update to the 1995 Idaho Settlement Agreement.\n\nhttps://t.co/W77A20l1CG","date":"Thu Nov 07 16:09:50 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"\"....an agreement few thought was possible.”\n\nhttps://t.co/5AsGoJhf8U","date":"Mon Nov 04 19:50:19 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I'm live with Neal Larson @kidnewsradio to talk about the impeachment and the Workforce Modernization Act\n\nListen Here https://t.co/64AoyRbtVI","date":"Fri Nov 01 15:36:25 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"No worries Russ","date":"Fri Nov 01 00:55:55 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"House Democrats have proven that they are more committed to appeasing their base than to due process and transparency, and I cannot support an inquiry that has been misguided from very beginning.  \n #ImpeachmentVote","date":"Thu Oct 31 16:47:45 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Democrats have engaged in a relentless and ultimately tainted effort to undermine the 2016 Presidential election, searching for enough evidence to impeach President Trump.  As I have repeatedly stated, I have yet to see sufficient evidence to initiate the impeachment process.","date":"Thu Oct 31 16:47:22 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"@mikeboydprice Yea","date":"Thu Oct 31 15:44:22 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We need to live up to our ideals and values, enforce our laws, and find a path forward that keeps Idaho agriculture, and the families who make Idaho agriculture the best in the world, as the driving force of our economy.","date":"Thu Oct 31 15:06:36 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am proud to co-sponsor the Farm Workforce Modernization Act: a bipartisan bill to provide stability, predictability &amp; fairness for America’s farms.","date":"Wed Oct 30 18:39:21 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to Shelley, Idaho native Dakota Roberson on his appointment to the 2019-2020 class of @WhiteHouse Fellows. As a @uidaho Professor and an Associate of the @CAESEnergy, he will be a great asset to the @DeptofDefense \n\nhttps://t.co/6PHHcyyvGB","date":"Wed Oct 30 16:43:14 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I'm excited for the America the Beautiful Quarters Program coin honoring the Frank Church River of No Return Wilderness.\n\n @usmint @salmonchallisnf","date":"Fri Oct 25 15:34:01 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A well-deserved experience for these hardworking kids. \n\nGo @Ifbandits⚾️! \n\nhttps://t.co/B3LhPCYSDN","date":"Fri Oct 25 14:49:33 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m proud to join with @Chobani in ending the disgraceful practice of school lunch shaming.","date":"Mon Oct 21 19:29:51 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ICYMI - My op-ed on #USMCA \n\nhttps://t.co/g3aGgSw1k4","date":"Mon Oct 21 16:36:44 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I want to congratulate @SecretaryPerry on a job well done during his tenure as our nation’s 14th Sec. of Energy. Kathy and I wish him nothing but the best in his life after @ENERGY. \nSee my full statement below https://t.co/tMQKG2Ew2b","date":"Fri Oct 18 20:09:54 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s time to be adults and put good trade policy over political bickering. #USMCA https://t.co/oo8Uk0Jcuj","date":"Tue Oct 15 20:31:43 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations @Dr_Mark_Peters and @INL on the completion of these two incredible buildings. These will attract and retain an incredible workforce in our community.\n\nhttps://t.co/QYCpr1ArfE","date":"Tue Oct 15 16:00:31 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My statement regarding #impeachment https://t.co/Jfx66S7zwc","date":"Wed Sep 25 13:28:26 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"With over 80,000 unaccounted American heroes since WWII, today we say to them and their families,  “You are not forgotten”\n#POWMIARecognitionDay https://t.co/enoX2sTb3P","date":"Fri Sep 20 15:04:13 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I had a great meeting with @ClifBar last week.\nThey are doing wonderful things in #Idaho. https://t.co/SJWoSRjF2F","date":"Thu Sep 19 14:35:35 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday @usairforce, 72 years of defending our skies. We wish you success in all that you do\n\n(except the football game this weekend, @BroncoSportsFB )\n\n #HBDUSAF  ✈️","date":"Wed Sep 18 16:05:34 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On this day 232 years ago delegates put their names to the final draft of the U.S. Constitution. Our lives are blessed each day by the governance of those divine words. \nHappy #ConstitutionDay🇺🇸 https://t.co/u8loCjYQwE","date":"Tue Sep 17 14:15:19 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Where were you 18 years ago when you heard the horrible news?\n\nAs we commemorate the tragedy of 9/11, we also honor the lives lost, the heroic acts rendered and the way we came together as an undivided nation. \nMay we #neverforget and may God bless America 🇺🇸 https://t.co/gelaVhII2r","date":"Wed Sep 11 12:20:07 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On average we lose one Idahoan every 22 hours to suicide. This #SuicidePreventionDay we are reminded that there are those in our community who are struggling. Learn the signs and find resources to help by visiting -\nhttps://t.co/fOIplbh2Cg https://t.co/OfMe3hJjc9","date":"Tue Sep 10 17:31:30 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As I speak with the ag community in Idaho, it has become more evident that it’s time for Congress to pass #USMCAnow and deliver a win for America’s farmers, ranchers, and workers! https://t.co/JRcOytuxDG","date":"Tue Sep 10 15:06:50 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I were honored to have @NEAArtsChair in #Idaho.  She is doing great work for @POTUS to make the arts and agency more accessible to the public, especially rural communities. \n\nYou are always welcome in the Gem State","date":"Tue Aug 27 15:38:50 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"You can catch my interview with Neal and Julie @kidnewsradio at 9am MST today. We talked everything from red flag laws and the squad to Area 51. \nListen here https://t.co/64AoyRt4Ng https://t.co/UmUI0HKHG5","date":"Mon Aug 26 14:36:02 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Home run @GovernorLittle","date":"Thu Aug 22 16:49:11 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My staff and I toured the facilities at Gowen Field and the Orchard Combat Training Center, home to the \n@IDNationalGuard. I have the utmost respect for the work that these brave men and women are doing, Major General Garshak has my full support. https://t.co/XD9YOKvvY4","date":"Thu Aug 22 16:03:32 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s a big day in the Simpson home, those who know Kathy and I know that we love our little poodle Charley. Today he turns 3 🎉\nJoin us in wishing our furry friend a happy birthday🐶 https://t.co/E8qTDNEVFq","date":"Wed Aug 21 22:07:30 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Way to go @Ifbandits!\n\nhttps://t.co/LgLnPCTJci","date":"Wed Aug 21 19:05:22 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The @Ifbandits are putting #Idaho on the map. Your home state is cheering loud! #GoBandits #ALWS19 @AmericanLegion  ⚾️\n\nhttps://t.co/VGdvhBOTAY","date":"Tue Aug 20 15:57:06 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Helping save lives","date":"Fri Aug 16 21:40:39 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Pleased to see the completed expansion of Premier’s facility that was enabled by the New Market Tax Credit. This is exactly the kind of project that this program was intended to benefit, and it will allow Premier to continue their great work. \n\nhttps://t.co/6J1XcGzvvx","date":"Fri Aug 16 18:23:47 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho native and @boisestatelive grad has become the 1st ever female Marine to fly F-35 Fighter Jets✈️ \n\n#ThisDayinHistory #Idaho \n\nhttps://t.co/H3vDu8O5gi","date":"Thu Aug 15 21:08:59 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It was an honor to join with @Dr_Mark_Peters @GovernorLittle Rita Baranwal and others in celebrating 70yrs of @INL. As I said last night, the INL’s success can be attributed to the employees, from the researchers to the janitors, everyone has a played a key role in #70yearsofINL","date":"Thu Aug 15 19:52:45 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I had the opportunity to tour @Chobani’s cutting-edge Innovation &amp; Community Center in Twin Falls, and present @hamdiulukaya with a congressional record for the incredible leadership and compassion that he has brought to #Idaho https://t.co/n8xykAbxFd","date":"Wed Aug 14 15:37:39 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Stanley to Redfish trail will provide incredible economic and recreational benefits to those communities. It has been a privilege to be part of this project. https://t.co/eGMlJMjaWv","date":"Mon Aug 12 22:05:12 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to these college students from Arco and Mackay that are working on deferred maintenance at Craters of the Moon #FixOurParks https://t.co/VEiWpt3Xdn","date":"Fri Aug 09 17:45:49 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A great afternoon discussing immigration and taking questions from the Idaho Falls Rotary Club ⚙️ https://t.co/8zoloFLJ6m","date":"Wed Jul 31 21:30:41 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Pleased to participate with @BerkeleyLab -  See the video below to find out #myfavoriteelement.\n\nhttps://t.co/GYxN7y2qt3","date":"Fri Jul 26 21:58:14 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Our Idaho farmers need the security and trade relief that will come from #USMCA","date":"Fri Jul 26 16:58:59 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy #NationalInternDay. A huge thanks to interns past, present, and future. It’s never a dull moment in DC https://t.co/epNG2u40tt","date":"Thu Jul 25 23:59:30 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thrilled to see the announcement of this important milestone.  Looking forward to seeing this project become a reality and realizing the full potential of SMRs and advanced nuclear energy technology.","date":"Thu Jul 18 17:35:46 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Pleased to see this bipartisan bill I introduced with @RepRoybalAllard pass committee. Looking forward to a house vote","date":"Wed Jul 17 21:35:03 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My thoughts on #HR489 https://t.co/LxS8MY3UkL","date":"Tue Jul 16 23:08:13 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I agree with @VP Pence, Congress needs to pass the #USMCA as soon as possible. Our farmers and ranchers need to know that we haven’t forgotten who feeds the world.\n\nhttps://t.co/4OBrHlROd0","date":"Mon Jul 15 19:48:38 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great to see the Energy and Commerce Subcommittee on Health pass the Newborn Screening Saves Lives Reauthorization Act. I applaud my friend &amp; colleague @RepRoybalAllard for her work on this issue and I look forward to advancing this legislation through the House.","date":"Thu Jul 11 17:55:58 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today Boise, Idaho hosted the unveiling of the newest @USPS Forever Stamp 🐸. \nJump outside to enjoy a beautiful Idaho summer and keep your eyes open for the new stamp. #frogstamps https://t.co/1zgabEAJhI","date":"Tue Jul 09 19:22:19 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I want to wish each of you a safe and happy 4th of July. \nMay God continue to bless America 🇺🇸 \n#4thofjuly2019 https://t.co/R7R2ofvhjk","date":"Thu Jul 04 13:54:29 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idahoans! Did you know that The Library of Congress has a collection of songs pertaining to Idaho? Show some state pride by discovering more songs about the Gem State: https://t.co/v208GvXdzH \n#Idaho #songs #LibraryofCongress","date":"Wed Jul 03 14:44:25 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I applaud @Interior for getting PILT payments out. This funding that I have advocated for and secured through the Interior Appropriations bill provides vital funding to Idaho counties with large percentages of federal lands.\n\nhttps://t.co/ZRdMQvb6UQ","date":"Fri Jun 21 15:52:16 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“Let us never forget that in honoring our flag, we honor the American men and women who have courageously fought and died for it over the last 200 years. Our flag flies free today because of their sacrifice.”\n\n- Ronald Reagan\n\nHappy Flag Day 🇺🇸\n#FlagDay2019 https://t.co/NwM6oUOHAr","date":"Fri Jun 14 14:56:37 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great to see #Idaho attracting more business that will ultimately benefit our dairy farmers and strengthen our robust agriculture economy","date":"Thu Jun 13 18:08:13 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great to have @VP Pence advocating for fixing the maintenance backlog in our National Parks, and doing it right in our backyard @YellowstoneNPS \n#RestoreOurParks","date":"Tue Jun 11 21:43:05 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“The freemen of the world are marching together to victory.”\n#DDay75Anniversary","date":"Thu Jun 06 13:06:21 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Below I offer my tribute, and a way we can better honor the heroes of D-Day\n#DDay75Anniversary \n\nhttps://t.co/bbDRDulzw4 https://t.co/TX6BvZfwPs","date":"Thu Jun 06 12:58:56 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Where were you 43 years ago when the Teton Dam burst? \nMany of you remember this tragic day, hopefully you also recall the thousands of volunteers that rushed to lend a helping hand. \nThat seems to be the way that Idahoans handle disaster.","date":"Wed Jun 05 18:43:37 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Safe Kids Worldwide &amp; Union Pacific have teamed up to help educate about the dangers that train crossings can pose to children. They kindly sent a copy of “Clifford and the Railroad Crossing” to my Boise office for visiting parents and children to read.\n  #Railroad #Safety https://t.co/Yz8kW1cvjg","date":"Wed Jun 05 16:40:31 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m disappointed that Democrats turned a bipartisan goal--legal status for Dreamers--into a bill that only had Democratic input. Offering a partisan bill that will not be considered by the Senate is not an honest attempt at solving the problem #HR6","date":"Tue Jun 04 23:42:11 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Must-Read story on a local hero. Thank you for your service Verlan!\n\nhttps://t.co/Txes7SzgMX","date":"Mon Jun 03 19:40:00 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Excited to see an #Idaho company included on the @USDA ’s largest-ever international trade mission. Congratulations Mountain States Oilseeds, make the Gem State proud\nhttps://t.co/w8a1cnQp3y","date":"Mon Jun 03 16:48:45 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Love having @GrandTetonNPS right in our backyard","date":"Fri May 31 14:25:31 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Definitely worth a visit, congratulations!","date":"Thu May 30 19:00:15 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Looking forward to receiving the \n@USGAO report on how to make PILT payments more fair and predictable\n\nhttps://t.co/wGG7c8U3yg","date":"Thu May 30 17:10:40 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On #MemorialDay we honor the brave men and women who answered the call and gave the ultimate sacrifice. Kathy and I want to wish each of you a safe and happy Memorial Day. \nGod Bless America 🇺🇸 https://t.co/V8UIqNZO27","date":"Mon May 27 16:47:03 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to the Rexburg Children’s Choir for reminding us what #MemorialDayWeekend is truly about. \n\nhttps://t.co/OikkwgHQDW","date":"Fri May 24 18:22:17 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We've got a great governor in Idaho, who isn't afraid to have a bit of fun.","date":"Wed May 22 22:19:51 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I felt compelled to stand up for #Idaho and their work on managing sage grouse. We should be applauding their work to create an Idaho solution that uses the best available science. \nSee below my amendment to remove the misleading language.\nhttps://t.co/9FIeYLYFiG","date":"Wed May 22 21:31:31 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I have talked to farmers throughout Idaho and I understand the hardships they are facing on trade.  That is why I support the @WhiteHouse &amp; @USDA including #Idaho products in any trade mitigation assistance that have seen significant losses due to market uncertainty.","date":"Tue May 21 20:52:14 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#OnThisDay - 100 years ago the 19th amendment passed the US House of Representatives, guaranteeing women the right to vote. \nToday we celebrate a historic centennial and honor those who fought for this monumental expansion of democracy #WomensVote100 https://t.co/p1KGF5ak4q","date":"Tue May 21 17:46:50 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This week we honor the bravery &amp; sacrifice of our nation’s law enforcement officers &amp; their families. Our streets aren't safe by accident, join me in thanking our brothers and sisters in blue #NationalPoliceWeek https://t.co/7vwt5YWlzn","date":"Wed May 15 15:58:01 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Abe Lincoln’s thoughts on his mother perfectly describe how so many of us feel on this Mother’s Day - \n“All that I am or hope to be I owe to my angel mother”\nTo all the angels mothers out there #HappyMothersDay2019 💐 https://t.co/ONNc44AO8K","date":"Sun May 12 15:53:24 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Greg's leadership has certainly been felt throughout the area, and while he will be missed in @IdahoFallsGov I look forward to continuing to work with him in advocating for #LWCF throughout our communities.","date":"Fri May 10 20:12:08 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A much needed addition to this community.","date":"Wed May 08 18:49:14 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As we celebrate #TeacherAppreciationWeek I'm reminded of many selfless (and incredibly patient) educators who taught me that we can solve big problems.\nTo the educators shaping the leaders of tomorrow, we thank you. https://t.co/5lz8AceT4r","date":"Wed May 08 16:14:48 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"And here I am thinking I look like Brad Pitt 🤦‍♂️","date":"Mon May 06 18:10:53 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Please join me in wishing Idaho’s @SenatorRisch a happy birthday! https://t.co/5EDu765dE4","date":"Fri May 03 15:25:03 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to Idaho Teacher of the Year and Mayor of American Falls Marc Beitia! https://t.co/9GbO7d8lXC","date":"Thu May 02 19:55:36 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A great meeting indeed, thanks for coming in.","date":"Tue Apr 30 21:10:31 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks for stopping by","date":"Tue Apr 30 19:57:02 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Tomorrow is National Prescription Drug #TakeBackDay. This is an important day in the fight against the opioid crisis.  Check your home for unused or expired prescription drugs &amp; find your disposal site here: https://t.co/Y6TGu25Et0","date":"Fri Apr 26 19:37:23 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Tune in now to hear my conversation with @byuidahoradio \n\nhttps://t.co/K8Cr60lzLT","date":"Fri Apr 26 18:43:40 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy &amp; I are deeply humbled that @INL and @IdahoFallsGov would come together to dedicate this street to us. Our vision for the INL has been  incredibly rewarding and we aren’t done yet! https://t.co/1JEN9sTJ6k","date":"Fri Apr 26 16:14:52 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Join me in celebrating our amazing @NatlParkService sites during National Park Week. Get inspired with details from @GoParks: https://t.co/j18nphma4p. \n\nHow will you #FindYourPark?","date":"Tue Apr 23 20:12:31 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My statement on the #MuellerReport https://t.co/a2Er7Q90z0","date":"Thu Apr 18 17:08:56 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you for coming by and discussing how we can help keep the hearts of Idaho healthy   💓","date":"Thu Apr 18 16:55:42 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ICYMI - Had a great time on @kevinmillershow yesterday.  We discussed everything from immigration and the Mueller Report to the 2nd amendment and working with @RepRussFulcher.\n\nCatch our conversation here - https://t.co/OKVVHnouZx","date":"Thu Apr 18 16:22:44 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It was a privilege to address the @BoiseChamber today regarding a broad range of issues our nation is facing and how we can better come together to solve them. https://t.co/PN3MgC49ut","date":"Tue Apr 16 20:10:10 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The @nytimes tells the truth about #TaxReform ➡️Most Americans got a tax cut. \nhttps://t.co/6bt33tcRMQ","date":"Tue Apr 16 15:11:47 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It's #TaxCutDay in America, and thankfully our #economy is thriving.","date":"Mon Apr 15 20:51:01 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Notre Dame represents one of the most consequential religious and architectural symbols in the world. Kathy and I pray that there are no injuries or loss of life, and send our hopes for a quick containment of the fire and recovery of this iconic Cathedral","date":"Mon Apr 15 19:07:41 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to @DOIDepSec on being confirmed Secretary of @Interior.\nDavid Bernhardt has the knowledge and experience to steward our public lands and natural resources. I look forward to working with him on issues important to #Idaho and our nation.","date":"Fri Apr 12 16:50:01 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congrats Elli, this is a well deserved award!","date":"Thu Apr 11 19:22:36 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This evening local veterans will receive the sheds built by our area students. \nEvents like this deserve all the credit we can give them!","date":"Thu Apr 11 18:50:16 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s wonderful to see the Shoshone-Bannock Tribes and Idaho State University working together with a goal to help more students graduate from college.","date":"Wed Apr 10 17:24:21 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We have a commitment and responsibility to look after those who protect our freedoms. Thanks for taking the time to come by.","date":"Wed Apr 10 16:26:27 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks for coming by","date":"Tue Apr 09 22:04:59 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am proud to to fight for American jobs at a time of record low unemployment and rising wages.","date":"Tue Apr 09 21:06:51 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"March #JobsReport  \n\n➡️ Nearly 200k new jobs added\n\n➡️Wages are up\n\n➡️Record low unemployment continues \n\nNot too bad for a so-called 'tax scam'","date":"Fri Apr 05 16:41:52 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It was a pleasure to tour the progress on the Eisenhower Memorial.  This memorial will honor one of our great leaders, and a true American hero. \nI look forward to the dedication in May of 2020. https://t.co/unLp3sPZfR","date":"Thu Apr 04 16:01:45 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"If you can't tell, I'm not a big fan of shutdowns.","date":"Wed Apr 03 16:35:22 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you for joining us @Dr_Mark_Peters","date":"Wed Mar 27 21:07:17 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My statement on Mueller’s report https://t.co/x2V50zhzwa","date":"Tue Mar 26 02:15:37 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks for stopping by, we appreciate the great work that you are doing.","date":"Wed Mar 20 17:30:35 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Charles Franklin Hoop of Twin Falls, #Idaho named #CarnegieHero for saving a man from falling from a bridge, 486 ft. above the Snake River. Hoop bear-hugged the man, and pulled him over the railing to safety.  https://t.co/oXqHKfdL4s via @carnegie_hero","date":"Tue Mar 19 16:09:19 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On this  #StPatricksDay I explain why my support for the Green New Deal is about as likely as seeing a leprechaun\nhttps://t.co/RqnTEfAkSz","date":"Sun Mar 17 15:43:07 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"ICYMI \nhttps://t.co/ZiFL5YBRGC","date":"Sun Mar 17 14:55:50 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"When federal and local agencies work together to fight fire, we all win\nhttps://t.co/UqVNty6N6e","date":"Fri Mar 15 15:00:58 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Growing up there were always calves to be delivered, hay to be hauled and water to be moved. It doesn’t get much better than being raised in #Idaho farm country 👨‍🌾\n#NationalAgDay #ThrowbackThursday #AgDay19 https://t.co/Wxufy799sf","date":"Thu Mar 14 16:32:42 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"When it comes to both crops and farmers in #Idaho, we know how to grow them \n#NationalAgWeek","date":"Wed Mar 13 17:32:59 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I appreciated the opportunity to join @POTUS as he signed this significant public lands package. Two Idaho bills I authored were included in addition to the reauthorization of #LWCF. This legislation will be a benefit to Idahoans for years to come. https://t.co/U8IoxBLn60","date":"Tue Mar 12 21:21:03 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I applaud @DOIDepSec announcement that @USFWS  will propose a rule to delist the gray wolf. No doubt this decision recognizes the State of #Idaho and its effective management of the species.","date":"Mon Mar 11 21:16:32 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Navigating the grant process can be challenging, I want to help state and local leaders learn about and better utilize grants available from federal and state agencies. Registration is now open for the 2019 Funder’s Fair - details below.\nhttps://t.co/dDXH34Y1ln","date":"Mon Mar 11 17:35:57 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I appreciate you stopping by. You will be hard-pressed to find a more worthy use of taxpayer dollars than research that is directly attributed to savings lives, and that is exactly what @NIH funding does. Keep up the great work.","date":"Fri Mar 08 15:52:59 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"If you've ever met my dog Charley then you understand🐶","date":"Thu Mar 07 20:17:33 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you @RepRobinKelly, the Action for Dental Health Act is something we can all be proud of","date":"Thu Mar 07 19:56:52 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thanks for stopping by Cassidy, keep up the great work!","date":"Wed Mar 06 22:56:46 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"More Washington bureaucratic control is not what our election system needs #NOTforthePeopleAct https://t.co/FpXUXxBYsp","date":"Wed Mar 06 18:15:46 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Is #HR1 #ForThePeople? Let’s look at the facts, it dispenses taxpayer $ directly to politicians’ campaigns &amp; forces DC to run elections instead of trusting #Idaho to make the best decisions on how we elect our reps. That is why I won’t be supporting it #NOTforthePeopleAct","date":"Wed Mar 06 18:10:57 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday 🥳 Kathy and I love walking the Boise River Greenbelt \nIt wouldn't be what it is today without #LWCF \n#BoiseGreenbelt50","date":"Tue Mar 05 22:47:02 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho is the only state in the US that has never been part of a foreign country, unless you count that both the US and Britain jointly claimed Oregon Country (which Idaho was part of) until 1846.\n#IdahoDay","date":"Mon Mar 04 23:27:18 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"If all of Idaho’s mountains, hills, and gorges were ironed out flat, it would be the largest state in the Lower 48 -  yes, that includes you Texas 🏔️\n#IdahoDay","date":"Mon Mar 04 21:58:20 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congress passed legislation in 1887 to give northern Idaho back to Washington, and another proposal in the Senate would have given southern Idaho to Nevada. However, President Grover Cleveland pocket-vetoed the bill, thanks Grover!\n#IdahoDay","date":"Mon Mar 04 20:58:22 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"For all our snow loving friends - the world’s 1st ski chairlifts were created for America’s 1st destination ski resort here in Sun Valley Idaho ⛷🏂\n#IdahoDay","date":"Mon Mar 04 19:12:57 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho hosts the US’s only gold-tier Dark Sky Reserve, meaning the lack of light pollution makes it possible to see the Milky Way, several planets, and more with the naked eye.\n#IdahoDay","date":"Mon Mar 04 18:05:00 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"When President Abraham Lincoln signed the Idaho Territory into existence on March 4, 1863 it contained all of present-day Montana and almost all of present-day Wyoming as well.\n#IdahoDay","date":"Mon Mar 04 17:05:16 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Idaho Day, keep an eye on my Twitter as I share some fun facts and unique history about the state that we call home #IdahoDay https://t.co/Kg3Q1L5nGC","date":"Mon Mar 04 16:50:10 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A record number of submissions for the #CongressionalArtCompetition, with over 20 #Idaho high schools represented, this is an exhibit you'll want to see. \nThis year's theme is - My Heritage. My Future. My Idaho.\nThe exhibit start today and runs until March 23rd @ArtMuseumEIdaho https://t.co/3vWm9D0cce","date":"Sat Mar 02 19:53:19 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I always appreciate an opportunity to talk spuds 🥔","date":"Thu Feb 28 21:58:24 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"And we love the great work that you do","date":"Thu Feb 28 18:15:29 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thrilled to see so many pieces of local legislation honored in the public lands package, including two bills I authored and the ever important #LWCF reauthorization. \nNext stop @POTUS desk \n\nhttps://t.co/q6rvYcu0aY","date":"Wed Feb 27 15:20:37 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy 90th birthday to @GrandTetonNPS &amp; 100th birthday to @GrandCanyonNPS. I look forward to addressing the maintenance backlog in our national parks so they can be enjoyed for centuries to come #100YearsofGrand #FindYourPark #FixOurParks https://t.co/Z4xotkxk3L","date":"Wed Feb 27 05:10:28 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great to meet with the Idaho Sugarbeet Growers Association to discuss the US Sugar Program &amp; pleased to hear that Idaho beets had a fantastic 2018. https://t.co/eSRkB10yc1","date":"Tue Feb 26 21:15:21 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Always a pleasure to have the @AmericanLegion representatives from #Idaho in our nation’s capital. Thank you for your visit and your service 🇺🇸 https://t.co/dNwfzdzzz9","date":"Tue Feb 26 18:53:31 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Enjoyed meeting w/ one of my younger constituents. She wants to work in the @WhiteHouse but I’ve got a feeling Hailey will be running the show someday https://t.co/MBxc1apTDP","date":"Sun Feb 24 16:26:28 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to these Idahoans on their nomination to our nation's service academies. After spending time with these phenomenal young leaders, I have the utmost confidence in our nation's future. https://t.co/DXgeyea3nH","date":"Fri Feb 22 17:38:12 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I appreciate @GovernorLittle recognizing the extensive and fruitful efforts we’ve made towards protecting the Greater Sage-Grouse in Idaho and in the West https://t.co/g3PJFDyns7","date":"Thu Feb 21 22:00:35 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Enjoyed visiting w/ the great employees at MWI this morning. Headquartered in Boise #Idaho MWI supplies products &amp; services to U.S. animal health providers including veterinarians and food producers throughout the US https://t.co/bgmjhAZv6s","date":"Thu Feb 21 17:25:59 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great op-ed from @ChuckGrassley &amp; @RepKevinBrady. The case is clear, transforming our broken tax code was the right move. \nhttps://t.co/ADpgPlETY1","date":"Thu Feb 21 15:35:37 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A great meeting with these local vets, they are key to not only keeping our pets happy, but our communities strong.","date":"Wed Feb 20 20:50:51 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great day at the IF Zoo discussing #LWCF, deferred maintance on our public lands &amp; how to get more of #Idaho’s youth into the great outdoors https://t.co/ZGUjFmk0R5","date":"Wed Feb 20 16:01:28 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Over 2,000 athletes from 19 different states and multiple countries, let's make sure they feel welcome in #Idaho","date":"Thu Feb 14 17:18:20 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Join me in wishing a happy birthday to our 16th President. Thanks to President Lincoln’s leadership the #Idaho territory was formed.  As we remember him let’s also remember his message of unity especially in divisive times. https://t.co/YBwFJydvix","date":"Tue Feb 12 18:49:48 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Anti-Semitic remarks about U.S. support for Israel were rightly met with swift &amp; forceful condemnation.\nLet's reaffirm that anti-Semitism has no place here or anywhere! I will continue to support Israel &amp; look forward to working with them to promote global stability &amp; peace.","date":"Tue Feb 12 16:59:25 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Just introduced the LAND act with @RepDerekKilmer . This bipartisan bill would permanently reauthorize #LWCF &amp; address maintenance backlog at National Parks &amp; other public lands. Investing in our public lands will benefit our local communities and future generations. https://t.co/dJ7oBysrRw","date":"Wed Feb 06 20:27:51 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"108 yrs ago today President Ronald Reagan was born. A great president and an even better man. Join me in wishing happy birthday to the Gipper! https://t.co/KNpCCSIC8t","date":"Wed Feb 06 16:46:00 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"President Trump showed us tonight in the #SOTU that the things that unite us are much greater than that which divides us. \nSee below https://t.co/M8TcxEhWe7 https://t.co/DwFJVBOIQq","date":"Wed Feb 06 04:00:34 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Too many of our friends and neighbors have been affected by heart disease. As we begin American Heart Month visit @nih_nhlbi to learn more about how we can better protect #OurHearts https://t.co/ZhEDPyW1xH","date":"Fri Feb 01 17:35:29 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I'm consistently on record opposing shutdowns. D's offered this partisan resolution blaming @realDonaldTrump during the three weeks that Congress is supposed to be working out a deal to avert another shutdown. That is not productive.","date":"Wed Jan 30 23:19:48 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We love our national parks &amp; there is a dire need to address the maintenance backlog so that generations to come can continue to make memories there.","date":"Wed Jan 30 19:36:45 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"\"The future doesn't belong to the fainthearted; it belongs to the brave. The Challenger crew was pulling us into the future, and we'll continue to follow them.\" #Challenger","date":"Mon Jan 28 14:43:18 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today marks 74yrs since the liberation of Auschwitz. On this #HolocaustMemorialDay let’s remember the victims, celebrate the survivors and commit to never letting such evil enter our world again. \n#WeRemember https://t.co/ZS96dngPrj","date":"Sun Jan 27 17:23:15 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I remain committed to finding a long term solution for funding for the rest of the fiscal year including appropriate border security measures.","date":"Fri Jan 25 19:41:07 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I applaud the decision to end the temporary government shutdown. My message has remained consistent- when we come together and put partisan disputes aside, we can begin to govern in a way that will make the American people proud.","date":"Fri Jan 25 19:39:36 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"\"You touched my soul and reminded me about what this country is all about and why it is so great. Let's stop screaming at each other. Let's just take care of each other.\"","date":"Fri Jan 25 17:49:27 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Joining the Neal Larson Show now. We will talk #GovernmentShutdown. Be sure to tune in -https://t.co/64AoyRbtVI","date":"Fri Jan 25 15:04:54 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho will be fortunate to have such a strong voice on such an impactful committee @NatResources. I applaud @HouseGOP  on such a perceptive assignment","date":"Tue Jan 22 18:31:52 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"With the #MarchForLife2019 \nRally happening right now, I applaud those who have come from all corners of our nation to peacefully and proudly fight for the rights of the unborn.","date":"Fri Jan 18 18:49:57 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I appreciate @RepRussFulcher bringing his staff over to get acquainted with my team. As the only Idahoans in the House, we’re committed to working together to ensure Idaho’s voice is heard. https://t.co/ugbimess0l","date":"Mon Jan 14 20:50:05 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy #NationalMilkDay - Idaho is the 3rd largest milk producing state in the nation. 🥛 https://t.co/ZI8zkjetkP","date":"Fri Jan 11 21:37:39 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We need the government open &amp; we need strong border security. I went to the House floor to make it clear to my colleagues that I'm sick of the finger pointing &amp; political games. We were elected to lead and we owe that to our constituents. \n#idpol\nSee Below\nhttps://t.co/RGdpwUT4zt","date":"Fri Jan 11 19:47:28 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My statement on President Trump’s Oval Office address on Border Security https://t.co/F7lnSctxB1","date":"Wed Jan 09 15:28:59 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A little piece of heaven that we get to call home.","date":"Tue Jan 08 17:51:17 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to Governor Brad Little, the 33rd governor of our state. \nWe look forward to your leadership.","date":"Fri Jan 04 19:36:06 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Our 'robust job market' smashed expectation in December added 312k new jobs.\n'Wage gains accelerated and labor-force participation jumped'\n#HappyNewYear \n\nhttps://t.co/Q7ulxc8Muj","date":"Fri Jan 04 18:37:54 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Join me in welcoming Congressman Russ Fulcher to the US #HouseofRepresentatives. I look forward to working alongside @RussFulcher to ensure that the problems facing #Idaho are addressed in the #116thCongress. https://t.co/KuLTPNpvS8","date":"Thu Jan 03 20:01:41 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"1st and 2nd graders in Twin Falls will have a big reason to smile thanks to the ‘Grins-on-the-Go' program\n\nhttps://t.co/8M2VO0hjm9","date":"Wed Jan 02 19:19:42 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"From historic fire borrowing &amp; forestry reforms to providing key funding for the INL, &amp; getting our military a well deserved pay raise, Idaho saw a number of legislative successes in 2018. I'm committed to building on those in 2019. \nMay each of you have a happy and safe new year","date":"Tue Jan 01 18:34:48 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"As we ring in a new year I am anxious to get back to work and address some of the urgent issues our nation is facing. While I recognize there is much to be done, I am mindful of the great accomplishments that we had in 2018.","date":"Tue Jan 01 18:34:28 +0000 2019","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I want to wish each of you a happy and safe Christmas. https://t.co/Nl0EyLBOzW","date":"Tue Dec 25 19:28:09 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":". . . Secretary Zinke addressed these issues with a balanced perspective that led to positive results. I wish him well in the next chapter of his honorable career in public service and I thank him for his friendship - both as Secretary and in Congress.","date":"Thu Dec 20 15:53:14 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I thank @SecretaryZinke for his service to this country, most recently as Secretary of @Interior. Whether it was working with local Idahoans on Gateway West and sage grouse conservation, or national issues like the need to fix our national parks . . .","date":"Thu Dec 20 15:52:56 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great to see @forestservice  partnering with Idaho to improve the management of our forests. This agreement has the potential to reduce catastrophic #Wildfires in Idaho.\n\nhttps://t.co/MnyXuNrfZ6","date":"Wed Dec 19 20:36:22 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Paul has been an exceptional Speaker. We both came to Congress in 1999 and I have enjoyed a great working relationship with him since we first met. @SpeakerRyan will be truly missed.","date":"Wed Dec 19 19:05:51 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Honored to be recognized by The National Milk Producers, along with a group of bipartisan lawmakers, for our efforts to ensure the passage of the Farm Bill\n\nhttps://t.co/ypv6qapSgf","date":"Mon Dec 17 16:04:17 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Just in time for Christmas, @Chobani Foundation will award $100,000 to local programs in the Magic Valley. \n\nhttps://t.co/HG2QNypIVY","date":"Fri Dec 14 19:14:24 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am pleased to see @POTUS signed the Action for Dental Health Act of 2018.  This #bipartisan legislation is evidence that Congress can work together and accomplish things that will help improve our communities.  \n\nhttps://t.co/GjfgqWshoN","date":"Thu Dec 13 16:31:59 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The Farm Bill represents one of the most vital pieces of legislation for #Idaho. I was pleased to vote in favor of legislation that provides the certainty farmers and ranchers need to succeed.\nhttps://t.co/eJEwA8o9xz","date":"Wed Dec 12 22:05:37 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am pleased to see the collaborative work by @ButchOtter and @Interior on #Idaho based solutions to protect sage-grouse from their primary threats in our region. \nhttps://t.co/V0ihjMgBRC","date":"Tue Dec 11 19:17:31 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"You should have made it a true Daily Double. \n\n#YoureOnJ! #Dentists @Jeopardy https://t.co/m4eIhjeFXt","date":"Tue Dec 11 17:17:16 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The holiday season may seem like the worst time to have an illness in the family. If you or someone close to you has cancer or another serious illness this holiday season, use these tips and resources: https://t.co/paphhtILRZ  \n#FightCancer","date":"Mon Dec 10 17:24:05 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Pleased to a resolution to winter steelhead season. This will benefit  Idaho’s anglers and our communities. \nhttps://t.co/n0aythoRsq","date":"Sun Dec 09 17:07:56 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Unemployment is down ⤵️ ( lowest levels since December 1969). \nWages are up⤴️ ( second time since 2009 that growth has topped 3%) . \nThe #economy is booming  ( over 150,000 jobs added in November).\n#BetterOffNow\n\nhttps://t.co/5M5sxtZ8jM","date":"Fri Dec 07 20:30:22 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"\"A date which will live in infamy\" On this #PearlHarborDay we honor the 2,403 lives that were lost 77 yrs ago. This is a day to commemorate heroism. To those who served, to those who sacrificed #WeRemember. https://t.co/VkPmAoXoS2","date":"Fri Dec 07 15:44:54 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Honored to receive the Bernald L. Orell Award. My number 1 legislative priority for nearly a decade had been the #FireFundingFix . This is the most significant policy change for the @forestservice in over 50 yrs and I look forward to this relief reducing catastrophic #wildfires","date":"Thu Dec 06 17:05:07 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#Remebering41 https://t.co/2HH9zv7ydO","date":"Mon Dec 03 22:26:28 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m committed to ensuring that our national parks remain the crown jewels of our nation. That is why I have joined with others to introduce bipartisan, bicameral legislation to address the maintenance backlog in our #NationalParks.\n#FixOurParks\nhttps://t.co/KW2xp4f7Ei","date":"Mon Dec 03 16:05:59 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Statement on the passing of President George H.W. Bush https://t.co/pRfhgCXtoc","date":"Sat Dec 01 14:40:03 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations to @RepKayGranger on her election to Ranking Member of the House Appropriations Committee . I know her as a hardworking and effective leader. I look forward to her leadership and will continue to support her. @HouseAppropsGOP","date":"Thu Nov 29 22:17:57 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I'm excited to see the Action for Dental Health Act forwarded to @POTUS desk for signing. I introduced this bipartisan legislation along with @RepRobinKelly and this Congress showed that #dentalhealth is a priority. \n\nhttps://t.co/bc6VX87v5U","date":"Thu Nov 29 17:07:43 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am thankful for many things; family friends and freedom top the list, along with the privilege to representative the great people of #Idaho. \n#HappyThankgiving https://t.co/1FWtndRmqr","date":"Thu Nov 22 16:09:45 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#SmallBusiness plays a vital role here in Idaho. I applaud @INL for their commitment to small business.","date":"Fri Nov 16 17:31:50 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"#FamousPotatoes 🥔","date":"Thu Nov 15 21:57:46 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On #RuralHealthDay we recognize the unique challenges that our rural communities face in #Idaho and throughout the nation. Access to quality care and the jobs that come with are essential for these areas to succeed #PowerofRural","date":"Thu Nov 15 19:26:03 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Idaho firefighters will miss #Thanksgiving with their families as they battle #CaliforniaWildfires - We can all learn something from these heroes. \n\nhttps://t.co/DPen53WKre","date":"Thu Nov 15 17:02:42 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Every 21 seconds someone in the US is diagnosed with #diabetes. Today is #WorldDiabetesDay - learn more below about the programs we have here in #Idaho to support those with diabetes. \nhttps://t.co/YTOvDax9KU","date":"Wed Nov 14 17:49:55 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m looking forward to working with Dr. Marianne Walck on issues related to @INL. She is joining an exceptional leadership team.","date":"Tue Nov 13 14:59:48 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s heartwarming to see companies like @Chobani giving back to our #Veterans","date":"Mon Nov 12 22:48:11 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today We Remember. We remember Flanders Field to Fallujah, Gettysburg to the Gulf, the Beaches of Normandy and the Battle of Hamburger Hill. We remember those who wrote a blank check to our nation. May we strive to remember our Veterans every day. #VeteransDay\n#ThankAVeteran https://t.co/fNSbdKlo9b","date":"Sun Nov 11 16:46:07 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On November 10 1775 @USMC was formed. Happy Birthday to the Marines past present and future our nation owes you a debt of gratitude\n#MarineCorpsBirthday https://t.co/ygXcQKJPtB","date":"Sat Nov 10 15:31:14 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Wise words from Capt. Robert Skinner @USNavy (Ret) \n#ThankAVeteran #VeteransDay2018 https://t.co/Qm3zGly3ai","date":"Fri Nov 09 20:26:42 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great @IdahoLabor event happening today in Idaho Falls, especially for #Veterans \nhttps://t.co/1UM51HIaCM","date":"Thu Nov 08 16:35:08 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This new clinic ahead of #VeteransDay will be a great asset to help us better take care of the men and women who have served our nation.","date":"Tue Nov 06 16:05:41 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"For the first time in the history of the @LOrealParisUSA #WomenofWorth Program an honoree from #Idaho has been selected. Well done Genevieve, and thank you for your service","date":"Fri Nov 02 16:42:33 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The #economy is far from scary this #Halloween2018  → Wages and salaries highest level in a decade &amp; unemployment rate is the lowest since 1969 @CNBC #BetterOffNow \nhttps://t.co/6sByjhD1fs","date":"Wed Oct 31 16:08:53 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you for having me. This is an important project, and I'm glad to be a part of it.","date":"Tue Oct 30 23:06:15 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Republicans are leading a return to regular order and achieving the most progress in regards to annual appropriations in over a decade","date":"Tue Oct 30 17:21:43 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congressman Hurd has long been an advocate for the San Antonio River Authority.I’m pleased to be here at his request to see 1st hand the SA Mission Reach Improvement Project @HurdOnTheHill leadership is evident in the success of the project SA is lucky to have such representation https://t.co/fFBzAdAvba","date":"Mon Oct 29 20:40:36 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Mark your calendar's for Monday's Hire a #Veteran Campaign @boisestatelive","date":"Fri Oct 26 15:12:18 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Tomorrow is  #TakeBackDay - All your unused and expired prescription drugs can be safely and properly disposed of. Find a collection site near you here &gt;&gt;https://t.co/VottbmnDmY https://t.co/9rwKUOoMjf","date":"Fri Oct 26 14:32:28 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Today @POTUS signed the SUPPORT for Patients and Communities Act. This #bipartisan #bicameral legislation will empower our communities to fight the #opioidcrisis \n\nhttps://t.co/eibyfCbGwv","date":"Wed Oct 24 21:09:39 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Did you know 1 in 8 women in the U.S. will develop breast cancer during their lifetime- Today is #NationalMammograhyDay. \nFor information on risk factors and low cost screening, see the link below #BreastCancerAwareness \n\nhttps://t.co/sWdkyYcTgR” https://t.co/GDJYKHmsbz","date":"Fri Oct 19 13:17:46 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s an honor to once again be named a #friendoffarmbureau\n by the @IDFarmBureau . I’m committed to ensure that #Idaho’s agriculture sector can continue to thrive in the future. @FarmBureau https://t.co/OwrrHgcI5L","date":"Thu Oct 18 15:18:33 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Had a great visit at @futurepublics school  yesterday learning about their partnership with the Boys &amp; Girls Club. The time I get to spend with #Idaho students and teachers is time well spent. https://t.co/YwOFmZU3sq","date":"Wed Oct 17 17:04:00 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We depend on agriculture to feed and clothe our nation and to help meet the needs of many around the world.  On #NationalFarmersDay, we proudly celebrate our farmers. For generations farming in Idaho has been more than just a job, it's a way of life. \n#ThankAFarmer https://t.co/fOyLYnJQdQ","date":"Fri Oct 12 16:41:22 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On #WorldMentalHealthDay it's important to recognize that we're all in this together. Congress continues to increase funding for research &amp; mental health services. Yet, there is still more we should and can do. I look forward to advocating for solutions to improve mental health. https://t.co/avHPdHMJjS","date":"Wed Oct 10 17:52:04 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you @SecretaryZinke for your time in @GrandTetonNPS &amp; @YellowstoneNPS over the weekend. We are working on legislation to address the maintenance backlog in all our beloved National Parks. #FixOurParks \n\nhttps://t.co/3F4VbyiWJm","date":"Tue Oct 09 15:32:42 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I applaud the confirmation of Judge Brett Kavanaugh to the Supreme Court. Throughout his career, Judge Kavanaugh has demonstrated a stalwart commitment to the U.S. Constitution, and I am confident he will approach his work on the nation’s highest bench with the same   commitment.","date":"Sat Oct 06 20:23:37 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy #WorldTeachersDay. We are fortunate in Idaho to have such great educators. Retweet to thank a teacher in your life. https://t.co/v7gSGsdgAC","date":"Fri Oct 05 13:57:37 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Exciting news for the Magic Valley as economic opportunities expand thanks to the @Chobani foundation.  Application are being accepted now until the Oct 28th \n\nhttps://t.co/4TBUCG5CRC","date":"Wed Oct 03 18:25:21 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"U.S. Secretary of Education recognized 349 schools as National Blue Ribbon Schools for 2018. Our very own Lincoln Elementary School in Rexburg #Idaho was recognized as one of these schools. A well earned accomplishment for our dedicated educators. \n\nhttps://t.co/uuLOgYIHdj","date":"Mon Oct 01 18:04:42 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"When American voters chose Republicans to control the House, Senate, and White House, we made a promise to our constituents that we would deliver historic tax reforms.The Tax Cuts and Jobs Act of 2017 fulfilled that promise, and Tax Reform 2.0 only doubles down on that success. https://t.co/4vh6QintRB","date":"Fri Sep 28 18:12:33 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"While Congress certainly does not deserve trophies for doing our job, I am pleased that Republicans are leading a return to regular order and achieving the most progress in regards to annual #appropriations in over a decade.\n\nhttps://t.co/TJgIzPa8LV","date":"Wed Sep 26 22:15:30 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to these Idahoans representing the @ACSCAN_Idaho we had a engaging discussion yesterday on legislation that can best facilitate our fight against cancer. https://t.co/4I5YJ4ATKs","date":"Wed Sep 26 20:54:46 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“A Parent’s Guide to STEM” from @INL is now available on their website. The guide includes steps and suggestions for parents to help their students with #STEM topics \n\nhttps://t.co/FVYC6EbSPM","date":"Wed Sep 26 17:39:06 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“Boeing’s investment is part of the company’s pledge last year to invest $300 million in “employees, infrastructure and local communities” as a result of the passage of U.S. tax reform.”\n#TaxReform \n\nhttps://t.co/9QZyNq8tXc","date":"Tue Sep 25 13:28:55 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy #NationalPublicLandsDay - Idaho is a great place to enjoy public lands. To celebrate there will be free entrance to public land sites all day throughout the country. #FindYourPark https://t.co/kOnZnzPHip","date":"Sat Sep 22 09:35:42 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"71 years giving us safety through the skies Happy Birthday @usairforce #AFBday https://t.co/9fAGexBVOH","date":"Tue Sep 18 13:15:12 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"231 years ago our founders signed a document that continues to shape history. \nHappy #ConstitutionDay2018 https://t.co/UAgZbX6Dlo","date":"Mon Sep 17 22:23:55 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"2018 Walk to End Alzheimer's - Eastern Idaho is happening today at Snake River Landing. Go support a great cause.   @alzassociation","date":"Sat Sep 15 13:21:19 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I am encouraged to see movement on both these important public lands issues. Looking forward to working with Chairman @RepRobBishop and Ranking Member @RepRaulGrijalva to make these critical bills become law. @NatResources \n#FixOurParks #LWCF \nhttps://t.co/uwrgALIzjT","date":"Thu Sep 13 21:38:38 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you for the visit.","date":"Thu Sep 13 21:27:51 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Congratulations Nina way to make #Idaho proud. \n\nhttps://t.co/mWSUx6oxSK","date":"Thu Sep 13 16:20:55 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Tune in now to see as I preside in the Speaker's chair on the House floor with legislation being considered. \nhttps://t.co/WwCreP9Ylo","date":"Wed Sep 12 20:28:20 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you for the visit, we appreciate the work you do in Idaho.","date":"Wed Sep 12 16:24:23 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"More good news for the booming #economy to go along with increasing wages and low unemployment. \n\nhttps://t.co/VhHvV2Lb7p","date":"Wed Sep 12 14:49:05 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"A great turnout and a moving tribute to our fallen heroes at the Bannock County Courthouse in honor of #Sept11 https://t.co/fPqDz9GJWZ","date":"Tue Sep 11 17:52:14 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Watching the video below is a beautiful reminder of the unity that such a terrible act brought. #GodBlessAmerica","date":"Tue Sep 11 16:14:10 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s hard to believe that it has been 17yrs. Our school children won’t remember that dreadful day, yet we remain committed to honoring the lives lost &amp; celebrating the many heroes who arose. It is in times of affliction that the American Spirit prospers\n #NeverForget #Sept11 https://t.co/W8pFXaxDy4","date":"Tue Sep 11 13:41:19 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"@cathymcmorris Thank you !","date":"Mon Sep 10 16:47:37 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Had a wonderful chat with Neal and Julie, tune in to https://t.co/HNe0Ywq1Bd to catch my interview with The Neal Larson Show.","date":"Fri Sep 07 15:00:52 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Tune in to hear me discuss the @HouseAppropsGOP Energy and Water Bill \n\nhttps://t.co/T0QRKyJAn5","date":"Wed Sep 05 18:46:06 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Pleased to see the confirmation process for Judge Kavanaugh move forward. If you missed @MikeCrapo significant remarks, watch them below. \n#ConfirmKavanaugh \nhttps://t.co/dNAeMlURnn","date":"Tue Sep 04 21:22:01 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It was an honor for me to present Master Sergeant Philip Vaught these well deserved military awards in Shoshone, Idaho. https://t.co/yuTcsYlZXy","date":"Thu Aug 30 18:20:33 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"The US #economy continues to grow\n \nhttps://t.co/jGMHucmYDS","date":"Wed Aug 29 19:52:45 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"No one can deny that Senator John McCain was a force to be recognized. We lost a hero this weekend and a man who dedicated his life to serving America. \nKathy and I send our prayers to Cindy and the rest of the McCain family.","date":"Mon Aug 27 16:45:17 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Kathy and I had a wonderful day on the South Fork seeing all the great LWCF projects. This is a special part of the world that we get to call home. https://t.co/hkf9j0nAiL","date":"Fri Aug 24 13:57:51 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This was a great experience. Thank you for having me.","date":"Thu Aug 23 00:04:28 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We appreciate the great work that you do.","date":"Wed Aug 22 17:29:17 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"I’m appalled at what @MSNBC Contributor Christina Greer said today on @TheBeatWithAri \n“. . .but Fox News is talking about a girl in Iowa and not this...” \nChristina, the girl has a name - it’s Mollie Tibbetts. She was murdered, her life was left short and her family is hurting.","date":"Wed Aug 22 03:12:32 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It’s always a great day in the #idaho outdoors, thank you for having me. 🌲","date":"Mon Aug 20 15:51:25 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We’ve got the best potatoes in Idaho because this is where the best farmers come from \n🥔 #NationalPotatoDay #harvest","date":"Sun Aug 19 18:26:03 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We have a beautiful new playground in Freeman Park thanks to the partnership between the City and the Civitan Club. The Civitan Club not only helped raise funds for the ADA compliant playground but also partnered in the actual building. The youth from our community say thanks! https://t.co/AkYImyI1dg","date":"Fri Aug 17 20:36:59 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Pocatello native Nina Forest is using her influence as Miss Idaho to fight childhood hunger within our state as well as many other noteworthy causes. I appreciate her visiting the office and applaud the great work she’s doing. https://t.co/wzLOB4x8Xq","date":"Wed Aug 15 16:42:31 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you for making the time, it was a great discussion.","date":"Tue Aug 14 21:58:10 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Happy Birthday to @smokey_bear, while he has changed a lot in the last 74 years his message remains the same. Let's give him the gift of wildfire prevention. \n#TBThursday https://t.co/mHFsQRk5HD","date":"Thu Aug 09 19:27:18 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"On this date in 1782, Gen. Washington awarded the nation's first military award. Thank you to the 1.8 million brave men and women who have earned the award in defense of this great nation. \" All Gave Some; Some Gave All\" #PurpleHeartDay https://t.co/mGVkAUS6or","date":"Tue Aug 07 15:47:29 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Americans are #BetterOffNow  with our service members having the necessary tools and support they need to keep up safe at home and abroad\n#MilitaryMonday https://t.co/E2izsupqk6","date":"Mon Aug 06 16:16:41 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Never a dull moment in Boise \n\nhttps://t.co/vbx2ZWGwfg","date":"Fri Aug 03 21:16:49 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We love our #NationalParks  so much it  has led to a backlog of maintenance needs. Congress is coming together to address this and #RebuildOurParks","date":"Fri Aug 03 20:59:14 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"It's a special thing to see @BLMIdahoFire &amp; @forestservice work hand in hand with local #farmers and #ranchers to fight the Grassy Ridge Fire &amp; ultimately save the city. \nIt’s times like this that make you proud to be from #Idaho https://t.co/4TMWbBcxzI","date":"Wed Aug 01 16:15:18 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"“Compensation for workers rose to a nearly 10-year high in the second quarter as inflation pressures continued to percolate in the U.S. economy.”\n\n Americans are #BetterOffNow thanks to #TaxReform \n\nhttps://t.co/Jedk9DWzI3","date":"Tue Jul 31 22:41:07 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Our thoughts are with the people of Dubois, as well as those brave men and women fighting that fire. Be safe, you’re in our prayers. \n\nhttps://t.co/OofsSZKzOx","date":"Sun Jul 29 04:33:53 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"In honor of yesterday's #NationalInternDay  I want to spotlight our summer interns. These interns find themselves with a significant amount of trust and responsibility and I want to thank them for the great work that they do for the people of #Idaho. https://t.co/R49mVoslkN","date":"Fri Jul 27 15:57:54 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"We’ve got surging growth in the #economy and the American people can see it.\n\nhttps://t.co/IzDur6Ktur","date":"Fri Jul 27 14:40:58 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Excited to see #FY19NDAA one step closer to @POTUS's desk. We are giving our military the resources they need to be successful. I'm proud to stand in support of the men and women who keep us free. https://t.co/OXWwlpLSgW","date":"Thu Jul 26 17:33:28 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Great to meet with Idaho’s FFA state officers this week. FFA does a great job preparing the next generation of leaders. #SpeakAg https://t.co/lChTGAnrUO","date":"Thu Jul 26 16:28:39 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"This is an exciting day for public lands and national park advocates. Growing up in Yellowstone’s backyard I had the opportunity to enjoy our nation’s first national park. That's why I feel it's important to pay it forward to future visitors. #FixOurParks\nhttps://t.co/xgIV3QNLls","date":"Wed Jul 25 21:58:01 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"Thank you to @SecretaryPerry for joining us. He is a great friend to @INL and to #Idaho. https://t.co/0VLhdFILBj","date":"Wed Jul 25 17:15:27 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"My staff had some company in Salmon Idaho today. https://t.co/vrNHMQi6Xt","date":"Tue Jul 24 20:12:25 +0000 2018","user_id":"76132891"},{"handle":"CongMikeSimpson","text":"House Passes Interior Bill with #Idaho Priorities - Read more below \n@Interior  @HouseAppropsGOP \n\nhttps://t.co/ytVNtsvqGJ","date":"Thu Jul 19 21:35:03 +0000 2018","user_id":"76132891"}]