[{"handle":"CongressmanRaja","text":"John Eastman asked for a presidential pardon. He would not have done this unless he knew what he was doing to keep Trump in office was illegal. Yet he did it anyway, and now must be held accountable.  \nhttps://t.co/KlZGkg4XGu","date":"Fri Jun 17 14:03:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Protecting our democracy from outside influence is essential. Foreign meddling should have no place in our electoral processes. \nhttps://t.co/LpAqTrh1RB","date":"Thu Jun 16 22:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The plot to keep Trump in power keeps getting thicker and thicker. The January 6th Committee must continue to follow their leads wherever it takes them. \nhttps://t.co/lRKJH7gPAD","date":"Thu Jun 16 19:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, I was proud to help decrease costs by casting my vote in favor of the Lower Food and Fuel Costs Act, which will lower prices for American families in the grocery isle and the gas pump by providing American farmers the support they need. https://t.co/Yi4AHDL4PZ","date":"Thu Jun 16 18:45:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia is continuing its brutal advance in eastern Ukraine. We must stand with our allies and provide more support against Putin’s unjust and unprovoked war. \nhttps://t.co/vAA4bDUmRj","date":"Thu Jun 16 15:01:37 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Retired Americans, many of whom live on fixed incomes, donated tens of millions of dollars to Trump because of “election fraud.” Then he swindled them and pocketed their money, using it for personal expenses. That is beyond shameful. \nhttps://t.co/Q1dw04Lzlq","date":"Thu Jun 16 14:03:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m glad to see former Trump advisors are finally telling the truth, but where was that in the runup to the insurrection? Had these officials said publicly what they said privately, the carnage of January 6th could have been avoided. \nhttps://t.co/KLjRzXr9KD","date":"Wed Jun 15 23:00:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, I was proud to cast my vote for the Financial Services Racial Equity, Inclusion and Economic Justice Act to invest in underserved communities, promote access to fair housing and lending, and promote diversity and inclusion in data collection.","date":"Wed Jun 15 22:30:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"From my hearing earlier today","date":"Wed Jun 15 21:19:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Pets are beloved members of millions of American families and the EPA must take the necessary steps to protect our pets, and that’s what my investigation into Seresto collars is all about.\nhttps://t.co/du2XkkWDIH","date":"Wed Jun 15 21:00:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Roe v. Wade remains the law of the land, yet in a handful of states, abortion is all but illegal already. We have no choice but to stand up for a woman’s right to choose and pass federal reproductive rights to combat these extremist state laws. \nhttps://t.co/q68oiffpr7","date":"Wed Jun 15 20:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was a pleasure to address the University of Illinois's President's Executive Leadership Program about the importance of higher education and what my office in Washington  is doing to advance better education policies. https://t.co/AzLUiiG88P","date":"Wed Jun 15 19:30:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"10 years ago today, we decided those who have been here since childhood deserve the right to stay in the only country many of them have ever known. As we celebrate this anniversary of DACA, we must take more action to strengthen protections for Dreamers. \nhttps://t.co/FJiJJ3PGbH","date":"Wed Jun 15 17:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Adding more guns to schools is a dangerous idea. We need real comprehensive gun control to address the epidemic of gun violence.\nhttps://t.co/LfVcQVzDtw","date":"Wed Jun 15 14:03:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Pride Month is a celebration of the right to be yourself. Anti-LGBTQ hate has no place in this country.\nhttps://t.co/PUXiTb41Qh","date":"Tue Jun 14 23:00:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Yesterday’s hearings revealed much of how Trump’s Big Lie came to be. Here’s a recap of everything that was discovered. \nhttps://t.co/IgqMdjJ0Xk","date":"Tue Jun 14 22:01:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As our subcommittee's report shows, the Trump Administration failed to safeguard vital pandemic relief programs and disbursed $86 billion in taxpayer disaster loans to potentially fraudulent applications when American businesses desperately needed help during the height of Covid. https://t.co/HFpW3Vy1YF","date":"Tue Jun 14 21:00:17 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am proud to have cast my vote for bipartisan legislation to begin cracking down on the shipping industry’s skyrocketing prices. While it is a great first step, my investigation into potential price gouging by the industry will continue. \nhttps://t.co/HHsiQHydXW","date":"Tue Jun 14 19:30:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Dangerous heatwaves are getting worse and more frequent due to climate change. We must act now to combat rising temperatures and extreme weather events.\nhttps://t.co/M44os0eNYi","date":"Tue Jun 14 18:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"These extreme heat waves are dangerous and unmitigated climate change will only increase the danger they pose. \nhttps://t.co/5FddF9tiok","date":"Tue Jun 14 14:02:53 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Over the weekend, right-wing extremists were arrested for threatening a peaceful Pride event in Idaho.\nhttps://t.co/gXSEHbM31k","date":"Mon Jun 13 23:00:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Former Trump Administration Attorney General Bill Barr told the January 6th Committee today that Donald Trump became “detached from reality” while pushing bogus claims of election fraud. \nhttps://t.co/Loxym7wi1S","date":"Mon Jun 13 22:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Major news from the FDA: vaccines for children under 6 are safe and effective. I encourage everyone to get their kids vaccinated to protect them and your family from the ongoing Covid-19 pandemic. \nhttps://t.co/dDxRo5aZS0","date":"Mon Jun 13 21:00:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am proud to sign onto this bipartisan resolution calling on the administration to end our unauthorized military involvement in the war in Yemen. We must not be complicit in this humanitarian crisis. \nhttps://t.co/I6rsuz396M","date":"Mon Jun 13 20:30:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It sounds like a dark comedy but became a national tragedy.\nhttps://t.co/WHyBQsIpIm","date":"Mon Jun 13 20:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Trump used the Big Lie to mislead millions of supporters to donate to the “Official Election Defense Fund.” No such fund existed, and the money went Trump’s PAC and other allies instead. The former president lied to his own supporters and ripped them off.\nhttps://t.co/zMcwh1uWsn","date":"Mon Jun 13 19:30:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Despite the reality of the situation on election night, Trump declared victory anyway. It was all part of the plan to cast doubt on the 2020 election and fuel the Big Lie.","date":"Mon Jun 13 18:44:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is disturbing behavior for anyone, let alone a sitting Supreme Court Justice’s spouse. \nhttps://t.co/uyGOF7I0qW","date":"Mon Jun 13 15:01:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The second January 6th Committee hearing is about to begin.","date":"Mon Jun 13 14:01:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Republicans will continue to try and downplay the findings of the Jan. 6 hearings, but the American people will know the truth. \nhttps://t.co/IQzpVfR02h","date":"Sun Jun 12 23:00:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The end of Roe will affect all women, but particularly those of color. We must act and codify a woman’s right to choose into law. \nhttps://t.co/rk7ppu6nA2","date":"Sun Jun 12 21:00:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is a major victory in the fight against those who seek to demonize and belittle people for being who they are. \nhttps://t.co/cY1lrYdqdD","date":"Sun Jun 12 18:00:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While Americans continue to struggle to keep up with prices at the pump, Big Oil continues to report record profits. \nhttps://t.co/0BSSnebI3p","date":"Sun Jun 12 15:00:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Even Pence’s team couldn’t find any evidence of fraud. They knew it was a lie but didn’t publicly say so. \nhttps://t.co/LtctmNgOUj","date":"Sat Jun 11 23:00:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The war in Ukraine continues to produce horrific stories like this. We must continue our support for Ukraine. \n https://t.co/66h0v0J6kg","date":"Sat Jun 11 21:00:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was an honor to join the Summit of the Americas to discuss the importance of stronger economic and environmental cooperation across our hemisphere. https://t.co/AAIcI8sBHc","date":"Sat Jun 11 19:54:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The House passed several gun reform law this past week. I urge the Senate to include them in their negotiations. \nhttps://t.co/sltxFJoYDh","date":"Sat Jun 11 17:00:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Last month, I called on more inter-agency corporation when it comes to studying UAP. I’m glad to see NASA is now stepping in. \nhttps://t.co/MZYvfl0QX3","date":"Sat Jun 11 15:01:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Proud Boys began moving on the Capitol at 10:30am. The former president began speaking at noon. This was not a spontaneous riot that got out of hand. This was a long-planned, long-coordinated attack that began that was set in motion before Trump spoke.\nhttps://t.co/2Urd7NI54U","date":"Fri Jun 10 23:00:29 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The 2020 election was not stolen and President Trump’s inner circle knew it. Former AG Bill Barr told the Committee just that. Yet they kept up the big lie.","date":"Fri Jun 10 21:14:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I wish Mayor Daley a smooth and speedy recovery. \nhttps://t.co/Dgv7xz2kgP","date":"Fri Jun 10 20:45:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Capitol Police Officer Caroline Edwards told the committee she was engaged in “hours” of hand-to-hand combat. She described the Capitol as a “war-zone” that was “like a movie.” We owe her and all other Capitol Officers an unpayable debt of gratitude. \nhttps://t.co/ZMKI23kejM","date":"Fri Jun 10 19:05:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This wasn’t spontaneous. This wasn’t a spur of the moment protest. This was a vanguard of well-armed, people who were there with the intention of preventing the peaceful transfer of power.","date":"Fri Jun 10 18:03:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For years we heard how President Trump’s allies were terrified to speak out against him. Last night we heard what they actually thought under threat of perjury.\nhttps://t.co/vIsUrKnRph","date":"Fri Jun 10 16:03:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Last night’s hearing made a few things painfully clear: Donald Trump was at the center of it all, and he was willing to prevent the peaceful transfer of power. \nhttps://t.co/hWbYGt3uqt","date":"Fri Jun 10 15:01:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"When President Trump took office, he promised to end “American carnage.” Last night we saw again how he just brought it to the Capitol.\nhttps://t.co/fY7eUDKpY2","date":"Fri Jun 10 14:02:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The campaign to whitewash Jan. 6th has been long and complicated, but also disturbingly successful. The hearings tonight will start to chip away at these false narratives and provide the truth about the insurrection. \nhttps://t.co/oFHWCyI8TG","date":"Thu Jun 09 22:00:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Soon, parents will be able to vaccinate their young children against COVID-19. I encourage everyone to take advantage of this opportunity to keep their families safe and healthy. \nhttps://t.co/qPreTjh6UE","date":"Thu Jun 09 21:01:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Mike Pence was a main target in the Jan. 6th insurrection. His testimony would be valuable in the push to discover the truth from that day, \nhttps://t.co/7yermvxQKr","date":"Thu Jun 09 20:01:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to vote in favor of federal red flag legislation today in the House. Red flag laws will save lives. The Senate must act upon this. \nhttps://t.co/Vhhujwkpa3","date":"Thu Jun 09 19:30:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to cast my vote in favor of the Protecting Our Kids Act last night, which will finally begin to address problems related to mass shootings. As I told Anna Cabrera on CNN yesterday, when gun manufacturers flourish, “people don’t flourish, they die.” https://t.co/fQtTt8YA9I","date":"Thu Jun 09 18:00:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, the January 6th Committee holds its first set of public hearings. It is critical all information related to the insurrection is made available and that everyone involved in held accountable. \nhttps://t.co/I553uQMPuC","date":"Thu Jun 09 16:02:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s fitting that right before the opening public Jan. 6 hearings, the former president may finally face some accountability in a different investigation. \nhttps://t.co/0N9Wn6olUc","date":"Thu Jun 09 15:01:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to cast my vote for the Protecting Our Kids Act, which includes common-sense gun safety measures that will protect our communities and save lives. \nhttps://t.co/aD37h0u5Kv","date":"Thu Jun 09 14:03:58 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The cruelty seems to be the point. We need to defeat the new waves of anti-trans legislation and laws in legislatures and courts across the country. #ProtectTransKids","date":"Wed Jun 08 23:05:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Zeneta Everhart nearly lost her son to the mass shooting in Buffalo. I want to thank her for the courage to sit before our committee today and tell her story. Gun control measures are needed to prevent the next tragedy.","date":"Wed Jun 08 22:14:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Guns kill far more kids than cigarettes, but we don't let companies market to children. Yet gun companies can. We need stronger regulation. https://t.co/eR1XHW6xIP","date":"Wed Jun 08 20:00:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Thank you to Felix Rubio and Kimberly Mata-Rubio for their bravery in sharing their heartbreaking story today to help prevent future tragedies. https://t.co/qstSdVRQqY","date":"Wed Jun 08 18:28:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Tune in","date":"Wed Jun 08 15:38:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must provide more funding for research, and the best way to avoid any complications from the disease is to get vaccinated.\nhttps://t.co/cstbZACc8u","date":"Tue Jun 07 23:00:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Despite the warnings on climate change for years, 2021 saw us pump more gases into the atmosphere than at any point in human history. It’s time to start taking this seriously and firmly commit to green climate policies.\nhttps://t.co/hgWaObSP1K","date":"Tue Jun 07 21:00:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Supreme Court could strike down Roe v. Wade any day now. We must act to protect a woman’s right to choose. \nhttps://t.co/EOsOYNA1BO","date":"Tue Jun 07 19:01:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is a disservice to the tens of millions of Americans who watch Fox News. Every American deserves the opportunity to watch the hearings and learn the truth about January 6th. \nhttps://t.co/DXSEuvD5qu","date":"Tue Jun 07 18:01:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is a humanitarian crisis. Not only are innocent civilians dying in Putin’s war, they now also face unlivable conditions and dangerous diseases. \nhttps://t.co/gYtVKrtGIi","date":"Tue Jun 07 17:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Everyone who took part in the January 6th Capitol attack must be held accountable, especially those who planned it. \nhttps://t.co/eGK5a6qEE3","date":"Tue Jun 07 16:35:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"If we are to make real progress on containing climate change, then we need to address forms and sources of pollution, not just the ones we see in our every day lives. \nhttps://t.co/NvCVtOAUT2","date":"Tue Jun 07 14:02:58 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am heartbroken by the tragic passing of Elk Grove Village resident Supraja Alaparthi last week while in the Florida Keys. I urge the police there to investigate quickly and for regulatory authorities to address any safety concerns around parasailing.\nhttps://t.co/Dl0yHgwrzg","date":"Mon Jun 06 23:00:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, in response to the ongoing baby formula shortage, I am calling upon the USDA to provide more opportunities for WIC participants to purchase formula, whether that be online or in brick-and-mortar stores. \nhttps://t.co/1IENZ2y1JW","date":"Mon Jun 06 22:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Beginning on Thursday, the U.S. and the world will be shown the full extent of the Jan. 6 insurrection when the House’s public hearings start. \nhttps://t.co/Qrb3KCdH0S","date":"Mon Jun 06 21:00:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For years I’ve been sounding the alarm on Jared Kushner being a “walking, talking conflict of interest.” We must discover the truth of whether or not American foreign policy was improperly influenced by Kushner’s personal business dealings. https://t.co/hLwqJqdtFG","date":"Mon Jun 06 20:00:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"78 years ago today, Allied Forces pulled off an incredible operation in Normandy which eventually lead to the end of Nazi control in Europe. After all these years, we are still grateful for the bravery and courage showed by those on France's northern shores. https://t.co/LXOTYd71rs","date":"Mon Jun 06 19:01:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"“Having these children as well as the families of victims testify really brings it home as to what happens when we do nothing about gun violence.” https://t.co/4VQhLmmiPG","date":"Mon Jun 06 18:00:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, @RepScottPeters and I expressed our appreciation to President Biden for delaying new tariffs on the American solar industry. Not only does this delay create American solar jobs, it also keeps the U.S. on its climate goals track. https://t.co/nsW2Kwxoql","date":"Mon Jun 06 17:40:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The longer we wait to act on gun control, the more Americans will lose their lives. Congress has the opportunity to make change this week. We must fight to end the carnage. \nhttps://t.co/4TQaCeE5Zd","date":"Mon Jun 06 16:45:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Watching footage of President Zelensky and remembering the contrast to Vladimir Putin reminds me of Benjamin Disraeli's remark that, \"Courage is fire, and bullying is smoke.\"","date":"Mon Jun 06 14:24:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Oil refinery bottlenecks are contributing to sky-high gas prices. Last week, I wrote to President Biden urging him to eliminate these backlogs through whatever means necessary, including invoking the Defense Production Act. https://t.co/PIE3HErLXf","date":"Mon Jun 06 14:02:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m grateful for these brave survivors coming forward to address Congress and I hope their sharing their experiences may convince some of my colleagues to support gun reform.\nhttps://t.co/CKbsOo65f6","date":"Sun Jun 05 22:00:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must meaningfully take on climate change.\nhttps://t.co/1xKBwtoH3l","date":"Sun Jun 05 19:00:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Our support for Ukraine is unwavering. We must continue helping Ukrainians fend off Putin’s invasion.\nhttps://t.co/BHnTTWhqa3","date":"Sun Jun 05 16:01:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Mike Pence’s aides  feared for his life even before the insurrection began. \nhttps://t.co/JmZ9HimJNr","date":"Sat Jun 04 22:00:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I had a wonderful time celebrating our progress toward greater LGBTQ+ equality and planning our work ahead at the Equality Illinois Pride Month Kickoff Brunch with @GovPritzker, our First Lady, and @repgregharris. https://t.co/7yz5mvAVBk","date":"Sat Jun 04 21:31:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A promising jobs report from May, but we must continue to fight inflation. \nhttps://t.co/VLZlr5miGi","date":"Sat Jun 04 21:00:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As Putin’s war in Ukraine passes its 100th day, tens of thousands of people are trapped in the eastern part of the country while Russian forces wipe their homes out \nhttps://t.co/N0EjLtXAj0","date":"Sat Jun 04 19:00:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Those who stonewall or dodge investigations must face the consequences.\nhttps://t.co/Ft5XLuEp3Q","date":"Sat Jun 04 16:01:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Hurricane season started two days ago. Already millions of Americans face tropical storm. Climate change is causing more extreme weather already.\nhttps://t.co/9kvpWCZBvw","date":"Sat Jun 04 14:02:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"What kind of person threatens the Special Olympics?\nhttps://t.co/RyMDYsNdi6","date":"Fri Jun 03 23:00:23 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A near record-high percentage of Americans support a woman’s right to choose. We must act to codify Roe into law. \nhttps://t.co/upktstnOEe","date":"Fri Jun 03 22:00:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"\"Receiving an award from you about service to Illinois is perhaps the highest compliment that I have ever received.\"\nhttps://t.co/mHddrKghB6","date":"Fri Jun 03 21:00:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The year is not even half over, and already there have been over 200 mass shootings in America. We must take action to prevent even more bloodshed through reforming our gun laws. https://t.co/rU71Jn8za2","date":"Fri Jun 03 20:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The White House says we are headed for “a lot of unnecessary loss of life” if Congress does not act upon more pandemic funding for vaccines, testing, and treatment. We must prepare ourselves for the next wave. \nhttps://t.co/asYCDrBKvy","date":"Fri Jun 03 18:02:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Many gun advocates are already preparing to oppose any gun control legislation – without even knowing the full details of the plan. They refuse any action at all, so we cannot bow to their demands. \nhttps://t.co/pamAZcxEFN","date":"Fri Jun 03 14:02:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The E.U. and U.S. has taken a strong stance against Putin. We must not be dependent on Russia for energy and we must continue pushing for accountability for their actions in Ukraine.\nhttps://t.co/fPDhjQ7EPw","date":"Thu Jun 02 22:01:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today is day 153 of 2022. There have now been 233 mass shootings in America. The carnage must stop. \nhttps://t.co/WthYj531pm","date":"Thu Jun 02 21:01:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy to speak on the banks of the Fox River in Elgin yesterday with Sen. Durbin as we celebrated $250,000 in federal funding the Senator secured that will go towards cleaning up the river and restoring it to its former beauty. https://t.co/Rk7ur9tBkc","date":"Thu Jun 02 20:30:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I applaud President Biden for forgiving the debt of students who were defrauded by Corinthian Colleges. We must have greater accountability in high education to ensure bad actors cannot do this again. \nhttps://t.co/4skbWot9eY","date":"Thu Jun 02 20:01:20 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A school and now a hospital in just over a week. Two places we view as always safe are not anymore. We must act on gun control. \nhttps://t.co/LKvMpfp2sA","date":"Thu Jun 02 17:35:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"School shootings cause irreparable harm to children and young adults, often in ways others cannot see. Legislative action on gun violence is needed to prevent future trauma, and increased mental health care in needed to help survivors now.  \nhttps://t.co/xt0PtNxGLo","date":"Wed Jun 01 23:00:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The COVID-19 pandemic is still with us. The only way to end it completely is vaccinate everyone\nhttps://t.co/hftBnAFDxW","date":"Wed Jun 01 21:00:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A well-funded EPA is needed to fight climate change. We must ensure the agency has all the tools it requires. \nhttps://t.co/KG9lgdpVqV","date":"Wed Jun 01 20:01:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Pride! During this Pride Month, let’s come together to celebrate all the achievements and contributions of the LGBTQ+ community while showing our support. https://t.co/482lRYy55w","date":"Wed Jun 01 19:01:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In order to prevent future tragedies we must understand what failures occurred to decide how best to address them.\nhttps://t.co/y4xOdV7yR8","date":"Wed Jun 01 18:02:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Mass shootings are ripping families and communities apart. It is time Congress takes action to stop the bloodshed and heartache. \nhttps://t.co/DEOj5e718x","date":"Wed Jun 01 17:01:29 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s unjust war has negative impacts far beyond the borders of Ukraine. \nhttps://t.co/nSfMDxoSia","date":"Wed Jun 01 16:03:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Supreme Court has already shown it's ready to throw out 50 years of protections for women’s health care. Now it seems poised to loosen gun restrictions at a time national grieving. We must take legislative action to combat potential upcoming decisions.\nhttps://t.co/FFFAhknMOp","date":"Wed Jun 01 14:03:20 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was wonderful to meet with so many of our local veterans and first responders on Memorial Day. https://t.co/xZuxyurCAH","date":"Tue May 31 22:40:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Other nations see the damage military-style weapons can unleash and act upon it. Why don’t Republicans do the same? \nhttps://t.co/mKqKnWTbra https://t.co/PUu8OxrCIn","date":"Tue May 31 22:01:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Those who have information on the Jan. 6 insurrection must turn over all related documents to help paint a clearer picture of what happened that day.\nhttps://t.co/xHz0Nx8VSG","date":"Tue May 31 21:00:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Grateful for the chance to join @Austan_Goolsbee @BetseyStevenson and @harrylitman on the @talkingfedspod for an in-depth discussion on the state of the U.S. economy and addressing the horrific shooting in Uvalde, Texas. \nhttps://t.co/6N0VJWIYFM https://t.co/5ALGVusO23","date":"Tue May 31 19:02:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s been just a week since 19 children and two teachers were killed in Uvalde. Since then, 15 more mass shootings have left 11 dead and 67 injured. We must take action to prevent more slaughter. \nhttps://t.co/PUu8OxsaxV","date":"Tue May 31 17:01:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Banning Russian oil throughout much of the EU is a critical step towards cutting off available funds for Putin’s war. \nhttps://t.co/u71lJ4Wjac","date":"Tue May 31 16:30:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"An often mistreated, often forgotten group of veterans who must be appreciated and honored.\nhttps://t.co/qgIz04igEv","date":"Tue May 31 14:02:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Congress declared Memorial Day a national holiday in 1971 to honor all soldiers who died in service to our nation. Please take time today to remember our fallen servicemembers and all they did in defense of our freedom. https://t.co/rz7SvYgamc","date":"Mon May 30 17:01:23 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was grateful for the opportunity to join the Hoffman Estates community as we honored our veterans, our military families, and paid our respects to those who gave what Lincoln rightly called, “the last full measure of devotion.” https://t.co/JqH0jFjdS5","date":"Mon May 30 15:56:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, we honor all those who made the ultimate sacrifice in defense of America. We will always remember those who gave their lives to make our freedom and security possible. https://t.co/7qahD1UfjG","date":"Mon May 30 12:03:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The road to prevent the next tragedy is difficult, but we must succeed. \nhttps://t.co/XeBPAIbcus","date":"Sun May 29 14:01:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"An essential read 👇🏾","date":"Sat May 28 22:39:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A heartbreaking look at the impact of the tragedy on Uvalde. https://t.co/oJNwtZFGen","date":"Sat May 28 22:00:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must change this brutal, tragic irony. Lives are on the line.\nhttps://t.co/aCKEvnvw5R","date":"Sat May 28 20:00:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Russian people are suffering because of Putin’s unjust war.\nhttps://t.co/BJgkVmmYzA","date":"Sat May 28 18:01:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The former president cannot duck accountability. This is a win for the rule of law. \nhttps://t.co/SD9hZ49BFb","date":"Sat May 28 15:00:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This shameful stance is costing lives. \nhttps://t.co/12v4cA9WyV","date":"Fri May 27 23:00:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"There’s no defense for the indefensible. These shootings do only happen in America, and Sen. Cruz knows he has the power to stop the, but doesn’t. \nhttps://t.co/dWj0ovuAOh","date":"Fri May 27 21:00:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I wrote to the Biden Administration yesterday to urge it to embrace all necessary means of ensuring the EU ban on Russian oil goes into effect, including potentially sanctioning Hungary which has threatened to veto the plan to block funding for Putin's war. https://t.co/RAVlyx8uIK","date":"Fri May 27 20:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Oklahoma’s ban on virtually all abortions was just signed into law. This is what awaits other states if Roe v. Wade is overturned. We must act to protect a woman’s right to choose. \nhttps://t.co/z0dzDaKpLW","date":"Fri May 27 16:03:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Eva Mireles and Irma Garcia were teachers at Robb Elementary School in Uvalde, Texas. They died while trying to keep their students safe. Remember them. https://t.co/3CB0mEOfLj","date":"Fri May 27 14:03:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Remember them.\nhttps://t.co/ffzCe9j4FX","date":"Thu May 26 23:00:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was an honor to receive this distinguished leadership award today from Illinois Secretary of State Jesse White. Secretary White's a true leader, so it felt like the equivalent of receiving an acting award  from Denzel Washington. https://t.co/8k2fvmWbR6","date":"Thu May 26 22:01:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While parents will be laying their children to rest on Saturday in Uvalde, less than 300 miles away, the NRA will be meeting in Houston with Texas’s top Republican officials in attendance. \nhttps://t.co/l7cAmRrzx9","date":"Thu May 26 21:00:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Less than two weeks after a white nationalist killed 10 people in Buffalo, Senate GOP block the bill that would help prevent future attacks because it was “unnecessary.” There is nothing “unnecessary” about combating the rise in violent domestic extremism. https://t.co/ZTcezJHVF6","date":"Thu May 26 19:00:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Regardless of minor disagreements along the way, we should all be able to agree that doing nothing is simply unacceptable. We need meaningful gun reform and it’s disgraceful it didn’t come long before this.\nhttps://t.co/k6d6Aq6C88","date":"Thu May 26 18:01:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I want to thank President Biden for taking action on police reform but Congress must overcome the opposition of Senate Republicans to take further action. \nhttps://t.co/UNTVSnmgq2","date":"Thu May 26 17:01:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"88% of Americans support requiring background checks on all gun sales. 84% support preventing gun sales to those reported as dangerous to police. Senate Republicans should start listening to their constituents and work with us to pass common-sense reform. https://t.co/p4d8l9H8kB","date":"Thu May 26 16:02:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As the President said last night, “It’s time to turn this pain into action.”\nhttps://t.co/GBMqJAcDBi","date":"Wed May 25 22:01:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"An essential look at some of the dangerous misinformation circulating around the Uvalde tragedy from one of the best reporters on that very difficult beat 👇🏾","date":"Wed May 25 21:29:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My heart is with the families of the victims of the Robb Elementary School shooting. We can prevent this from occurring again, but we need to work as a nation. This goes beyond party; we are all Americans and must protect our children. https://t.co/aNDVZVtPhE","date":"Wed May 25 21:00:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"“Why? Why are we willing to live with this carnage? Why do we keep letting this happen?”\nhttps://t.co/mw6OtcrCRe","date":"Wed May 25 19:01:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"4 of the 5 deadliest school shootings have come in the last decade. I urge my Republican colleagues in the Senate to embrace the gun reform legislation we passed last year in the House. We can only end this together.\nhttps://t.co/1Dzp96fHUK","date":"Wed May 25 18:01:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This isn’t about the Second Amendment. This is about mustering the courage to enact common sense reforms that keep all of us, especially our children, safe. \nhttps://t.co/zzoioLadyj","date":"Wed May 25 17:30:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As I told Chicago Tonight yesterday, we've seen these school shootings too often to think that our inaction does anything but recklessly lead us into the next tragedy. We need gun reform now. https://t.co/C2QsiCqujY","date":"Wed May 25 15:36:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Everyone should watch this.","date":"Tue May 24 22:11:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am heartbroken over the news of the shooting in Uvalde, Texas this evening. The victim's families and the entire community are in my thoughts tonight. As the details emerge we must work to prevent future tragedies. \nhttps://t.co/maZEQGFkJf","date":"Tue May 24 21:53:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Transparency is the first step to discovering how these shortages came about. @RepMaloney and I launched an investigation into infant formula manufacturers in order to find out the truth. \nhttps://t.co/BKk77NMK3y","date":"Tue May 24 20:01:29 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For 50 years, a woman’s right to choose has been protected. Now a new generation of Americans are being forced to fight harder than ever to defend it.\nhttps://t.co/x99JXvRXUF","date":"Tue May 24 18:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s war is so unpopular and immoral that former Russian diplomats are taking unprecedented actions to call out their own government’s actions in Ukraine.\nhttps://t.co/g9pamjS9vR","date":"Tue May 24 16:02:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"After everything we’ve learned over the years, President Trump’s omission appears predictable. https://t.co/aUTmEzChen","date":"Tue May 24 14:02:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Important reminders for all of us as we work to end this pandemic for good. \nhttps://t.co/n9y7wDghfe","date":"Mon May 23 23:00:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As a parent myself, I strongly encourage everyone to get their children vaccinated. COVID-19 cases are on the rise again, and vaccines are vital to protecting our kids. \nhttps://t.co/8TXpqpRv95","date":"Mon May 23 21:00:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Getting infant formula to our parents is essential. I’m thankful the Biden Administration is using the full powers of the government to address the shortage. \nhttps://t.co/oIBmgdRqLc","date":"Mon May 23 20:01:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Proud to join my colleagues in passing this legislation to crack down on price gouging and help lower prices at the pump. https://t.co/7xWp9g4cWx","date":"Mon May 23 18:01:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The actions of Russian troops in the war in Ukraine have been appalling and its fitting that accountability is coming so swiftly. \nhttps://t.co/rqlgJe1RNr","date":"Mon May 23 17:01:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I take being included on Vladimir Putin’s enemies list as a mark of honor and will continue to stand by people of Ukraine as they defend their democracy. https://t.co/E6y4wEgUAa","date":"Mon May 23 15:30:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Access to Baby Formula Act I voted for this week is a big step in getting families the formula they need for their children. But larger questions remain why this happened in the first place, and my investigation continues\nhttps://t.co/TPSLgs71VX","date":"Sun May 22 16:01:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"“John Eastman, the architect of a strategy to overturn the 2020 election, dealt directly with President Donald J. Trump and received handwritten notes from him as the men sought to keep Mr. Trump in power.” \nhttps://t.co/LGdwvkHsjL","date":"Sun May 22 14:01:17 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Overturning Roe v. Wade is just the beginning. Republicans are set on rolling back even more basic rights, and they will unless we vote for pro-choice candidates. \nhttps://t.co/rzviWmzNcj","date":"Sat May 21 23:00:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s unprovoked war is costing the lives of innocent civilians. All potential war crimes must be investigated. \nhttps://t.co/p6qDgQ6tsJ","date":"Sat May 21 21:00:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"No one is above the law. \nhttps://t.co/kaqftbCbkr","date":"Sat May 21 19:00:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Learning Asian American history is a major step forward in combatting the ignorance that so often begets racism. \nhttps://t.co/pTyVURMXPc","date":"Sat May 21 17:00:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"“In sending the emails, Thomas played a role in the extraordinary scheme to keep Trump in office by substituting the will of legislatures for the will of voters.”\nhttps://t.co/a9QNvKiG60","date":"Sat May 21 14:01:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must codify Roe v. Wade before other states follow suit with these draconian laws. \nhttps://t.co/FJjknpgc9n","date":"Fri May 20 22:01:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Everyone involved in the planning and coordination of the January 6th insurrection must be held accountable. \nhttps://t.co/RFffsB6o6p","date":"Fri May 20 21:00:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The CDC is now recommending children 5 to 11 get a Covid booster shot. Staying up to date on vaccinations is the only way to continue to move past this pandemic. \nhttps://t.co/beRMBa98Dy","date":"Fri May 20 20:01:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Poll workers are essential to running a smooth, free and fair election. It’s a great way to be a cog in your community’s democratic process\nhttps://t.co/6av4rQ6j7i","date":"Fri May 20 18:02:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Now more than ever, the U.S. needs an ambassador in Ukraine. I’m glad to see the Senate confirmed career Foreign Service officer Bridget Brink to be that person. \nhttps://t.co/48yeOuAfMz","date":"Fri May 20 17:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Back in November, the vast majority of Americans, including Republicans, say decisions on abortions should be left between the woman and her doctor. We must codify Roe. \nhttps://t.co/2k1dPPgI0j","date":"Fri May 20 14:03:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"https://t.co/sdXdsBAJVD","date":"Fri May 20 03:17:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We have made great progress on the pandemic, but we must remain vigilant and provide more funding for vaccination programs around the world before the next variant emerges.\nhttps://t.co/XcE8BWwbG1","date":"Fri May 20 00:01:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Domestic violent extremists continue to target minority communities. The bipartisan Domestic Terrorism Prevention Act I voted for yesterday will address this by providing more resources to law enforcement to prevent future attacks from happening. \nhttps://t.co/n6c1jSXCYr","date":"Thu May 19 22:01:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I want to thank President Biden for invoking the Defense Production Act to ensure manufacturers can start speeding up supply of much needed baby formula for American families. \nhttps://t.co/DudNWRchGr","date":"Thu May 19 21:00:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m glad to see the Senate has passed the much needed assistance package for the Ukrainian people. They need our full support to defeat Putin and defend their democracy. https://t.co/vRmUMYCAUe","date":"Thu May 19 19:01:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Big oil companies are pulling in tremendous profits while Americans are getting burned at the pump. Today, I was proud to vote to stop price gouging and end anti-consumer practices. \nhttps://t.co/LkZzX0RACw","date":"Thu May 19 18:02:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was a privilege to welcome Greek Prime Minister Kyriakos Mitsotakis to the Capitol on Tuesday and hear him speak on the importance of safeguarding our shared democratic values across the world. https://t.co/e0CglDRJqh","date":"Thu May 19 14:15:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Finland and Sweden joining NATO means a stronger and safer Europe. I fully support their applications to join the alliance. \nhttps://t.co/UB5QU7vz1D","date":"Thu May 19 14:03:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Funding for more vaccines is the only way to completely end the pandemic. Other nations are acting on it, now we need to as well. \nhttps://t.co/7JOhSDJnaw","date":"Wed May 18 23:00:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While Americans are paying through the roof at the pump, big oil continues to make record profits. I wrote to ExxonMobil and Chevron asking for answers. \nhttps://t.co/LR7Fv4qWO7","date":"Wed May 18 21:00:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The economic sanctions on Putin’s unjust invasion of Ukraine are working. We must keep the pressure on. \nhttps://t.co/vbW9wUbD9u","date":"Wed May 18 20:01:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My bipartisan legislation would invoke the Defense Production Act to ensure the federal government can step in and help create a greater supply of baby formula for our nation's parents. https://t.co/j3E12ttMdp","date":"Wed May 18 19:00:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Thank you to the Indian American Impact Project for inviting me to take part in their panel discussion on the importance of representation and public service, as well as the pressing issues that our country faces today. https://t.co/lvm9AzYlwv","date":"Wed May 18 18:01:55 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Our country must hold all those involved in the January 6 insurrection accountable.\nhttps://t.co/rICP3VIFkE","date":"Wed May 18 17:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Glad to see this step forward for pay equity.\nhttps://t.co/E42fQOY17x","date":"Wed May 18 15:01:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s a terrible sign when a club owned by a former President seems like it would be the most likely location for an “Alex Jones International [Conspiracy] Film Festival” Let me know if that reads alright to you.\nhttps://t.co/if3rNXvmZl","date":"Tue May 17 23:00:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today we learned there have been at least 11 near misses between U.S. assets and unidentified aerial phenomena. We must expand inter-agency cooperation to safeguard our national security. https://t.co/SldSMU0SOx","date":"Tue May 17 22:35:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Ukrainian fighters evacuated from the Azovstal plant are heroes who bravely defended Mariupol to the end. I am hopeful that they will be released home safely from Russian hands.\nhttps://t.co/Dvon2O3zzZ","date":"Tue May 17 21:00:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Yes, and despite Ed Harris' performance, I still have major reservations about that third act...","date":"Tue May 17 19:53:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was grateful for the opportunity to welcome Prime Minister Mitsotakis of Greece to our Capitol today as he addressed our Congress on the importance of further strengthening the alliance between our nations as we face down Russian aggression and global threats to democracy. https://t.co/WzP7w5jCVy","date":"Tue May 17 19:38:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was an honor to join the Midwest Asian Health Association over the weekend to celebrate Asian Heritage Month in Chinatown https://t.co/PfvYO7pvvP","date":"Tue May 17 18:01:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Since it apparently still needs to be said: Replacement theory is not only a racist conspiracy theory, it’s factually nonsense. Regardless of party, public officials must reject this hateful ideology before more violent atrocities are committed. \nhttps://t.co/XIR7OxERdX","date":"Tue May 17 16:02:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Women across the country fear for their health and are determined to protect the future of reproductive rights for their daughters and granddaughters. I applaud their strength and call on lawmakers to support their fight for bodily autonomy.\nhttps://t.co/9XeY84GbPY","date":"Tue May 17 14:02:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Climate change is causing the map for future wildfires to grow. We must act now if we are to prevent tens of millions more Americans from being at an increased wildfire risk in just a few decades. \nhttps://t.co/bk4NEwJHjj","date":"Mon May 16 22:01:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The vast majority of deaths and injuries on our roadways are preventable. Thank you to @SecretaryPete and the Department of Transportations safe Streets &amp; Roads for All program for addressing this growing crisis. \nhttps://t.co/dcMOPUmCbs","date":"Mon May 16 21:00:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Women should not have to rely on special tactics in order to have control of their own bodies. We must codify reproductive rights.\nhttps://t.co/TMJXWUeuQC","date":"Mon May 16 20:01:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Parliamentarian has guidelines against this sort of thing","date":"Mon May 16 19:54:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to speak at the Equality Illinois Rally for Abortion Justice over the weekend. We must stand up and speak up for a woman’s right to choose. https://t.co/TpE9JDHUNv","date":"Mon May 16 19:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My heart goes out to the victims and families of those affected by the shooting at a California church yesterday. Everyone deserves to be able to worship without fear of violence and we must act to make that a reality.\nhttps://t.co/InjwsQUIVQ","date":"Mon May 16 17:35:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I'm heartbroken for the victims and families of the hate-driven mass-shooting in Buffalo. As their community and our nation work to heal, we must use every tool at our disposal to defeat white supremacism and domestic terrorism to prevent the next tragedy. https://t.co/5YytMrYUYu","date":"Mon May 16 14:35:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s war is strengthening the Western alliance. A stronger NATO means a stronger and safer world.\nhttps://t.co/j7AOJg66Ui","date":"Sun May 15 23:00:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Parents of trans children should not be investigated for allowing their kids to be who they are. The Texas Supreme Court even such an inquiry would cause “irreparable harm.”\nhttps://t.co/kGN7ezpjO3","date":"Sun May 15 20:00:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The far-right knows its extreme positions on abortions are not popular with the American public. Softening their stances slightly is not going to fool anyone.\nhttps://t.co/CmBKKlmmGf","date":"Sun May 15 17:00:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"About three in four parents use formula to feed their infants. It is critical we act to increase formula production and supplies immediately.\nhttps://t.co/EJhcT1E3fu","date":"Sun May 15 14:01:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Supreme Court seems set on defying the American public by ending Roe v. Wade. We must take action to protect a woman’s right to choose.\nhttps://t.co/tGBSMeaItH","date":"Sat May 14 23:00:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must act quickly fight climate change.\nhttps://t.co/61UwKtcvni","date":"Sat May 14 21:00:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Russian military must be held responsible for their horrifying actions during their unjust invasion of Ukraine.\nhttps://t.co/3PEeB9JfA8","date":"Sat May 14 19:00:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must stay ahead of Covid. We must give more funding for Covid vaccines to do that.\nhttps://t.co/n6VzZYF8Z7","date":"Sat May 14 16:01:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, tens of thousands of people will rally in support of a woman’s right to choose. We must back them up and codify reproductive rights.\nhttps://t.co/f3vtrrcyjd","date":"Sat May 14 14:01:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Ukrainians continue to bravely resist the Russian invasion. But the horrendous crimes Putin’s forces are leaving in their wake must be investigated and prosecuted. \nhttps://t.co/e0gcusRGcs","date":"Fri May 13 23:00:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Meat company executives were saying there wasn’t enough meat for domestic consumption, all while preparing to export it. These two statements can’t be reconciled. Meat companies endangered their workers to make an extra profit. https://t.co/mZULTLot64","date":"Fri May 13 20:50:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Adm. Linda Fagan’s appointment to lead the Coast Guard is not only well deserved, it is a monumental moment in American history. \nhttps://t.co/dkvVH2suZA","date":"Fri May 13 19:00:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Defeating the Covid pandemic is a global effort. If we are to stop even more Americans from dying, we must stop new variants from emerging around the world. \nhttps://t.co/0OvFB4p6Zb","date":"Fri May 13 17:01:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"If we are to successfully fight climate change we should embrace green technology instead of postal trucks that get just 8.6 miles to the gallon, barely edging out a a semi-truck which averages 6.5 MPG.\nhttps://t.co/OegBzmDgsS","date":"Fri May 13 16:01:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We need to get families the infant formula they need, and we need to do it now.","date":"Fri May 13 15:00:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This time, the motivational speaker is trying to sell you the van down by the river.","date":"Fri May 13 14:53:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Illinois will continue to be a safe heaven for women and their right to choose. But we must keep pushing for nationwide legislation so that women have control of their bodies everywhere. \nhttps://t.co/GWc88Bcyvq","date":"Fri May 13 14:10:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The powerful story of one of the great public health achievements in human history https://t.co/68ljwmSMvG","date":"Fri May 13 00:15:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This headline seems custom made to identify fans of at least a certain age or with an ESPN Classic subscription…but it worked on me https://t.co/wKCcDsB3MN","date":"Thu May 12 23:00:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The courage of the Ukrainian people has been incredible and inspiring. \nhttps://t.co/oxJtQRZaia","date":"Thu May 12 21:00:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The former President’s deranged idea wouldn’t have just left the U.S. isolated, it would have made us a global punchline. https://t.co/KKIgYo9CyI","date":"Thu May 12 18:02:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"All of us need to continue fighting for reproductive rights and we’re fortunate to have outspoken leaders like Governor Whitmer.\nhttps://t.co/mY3flShXju","date":"Thu May 12 17:01:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Evictions are back on the rise. This program will help the people who need it most stay in their homes. \nhttps://t.co/PbcOYdQ4l9","date":"Thu May 12 16:03:17 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A horrific reflection on how Putin’s military is treating even its own servicemembers. \nhttps://t.co/bJGV06eE6X","date":"Thu May 12 14:03:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, I was honored that the House passed my bill to rename a Schaumburg Post Office as the “Veterans of Iraq and Afghanistan Memorial Post Office Building.” I would like to thank &amp; honor our veterans for their bravery, their courage, their sacrifice, and their patriotism. https://t.co/yuVtaUerAt","date":"Thu May 12 00:00:11 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Since 2001, between 2-3 million service members have served in post-9/11 war operations in Afghanistan and Iraq. Today, the House passed my bill to rename the Schaumburg Post Office in their honor as a constant reminder for our community of these veterans. https://t.co/1PRqjxc6n9","date":"Wed May 11 23:30:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We need to pass a supplemental bill to provide additional COVID funding or we will live with the consequences by fall. https://t.co/e6tsxuoiQs","date":"Wed May 11 23:00:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I'm incredibly disappointed to see all Republican senators voted against codifying a woman's right to choose into law. We must not be deterred and embrace every every legislative avenue to protect the right to choose\nhttps://t.co/zB944W9Ug5","date":"Wed May 11 22:01:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Sanctions have played a critical role in holding Putin accountable and putting pressure on his regime.\nhttps://t.co/33hOKxyd3b","date":"Wed May 11 20:01:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A vital impact of the right to choose and reproductive health more broadly. \nhttps://t.co/9GmHEycUMa","date":"Wed May 11 18:02:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Thank you to our great intern Kassim for his work this spring semester! https://t.co/0wYeh2hsYZ","date":"Wed May 11 17:01:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to join my colleagues in voting for this crucial aid to support the Ukrainian people as they continue to fend of Putin’s invasion to defend their freedom and independence. https://t.co/SQUJ96hCUC","date":"Wed May 11 16:02:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must make the most of all paths to safeguarding the right to choose in the short and long term. https://t.co/weUdXdmaer","date":"Wed May 11 15:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I'm reminded of the otherworldly grace, strength, and courage of Mamie Till as she looked from the pulpit to her son's open casket, showing the world what his killers had done, and said to the mourners, \"I don't have a minute to hate, I'll pursue justice for the rest of my life.\"","date":"Wed May 11 14:08:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A helpful reminder of the paths for us while we try and invent our way out of the climate crisis as we adapt and conserve.\nhttps://t.co/6E04lt3oWy","date":"Wed May 11 13:01:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Just as our nation once served as the arsenal of democracy against dictatorial aggression, so too we do today https://t.co/Bbf8l4ilxA","date":"Tue May 10 23:00:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Access to the internet is a necessity to succeed in today’s world. I’m glad to see the Biden Administration is making it a priority to those who may not be able to afford it. \nhttps://t.co/E7PjwuLQhW","date":"Tue May 10 21:00:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m proud to receive an A rating on the @StopBigMoney scorecard. Big money and special interests have no place in politics, and I will continue to fight corruption and protect our liberties in Congress. https://t.co/MtvzP7KgsJ","date":"Tue May 10 20:01:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was an honor to join the APPI community and @ChicagoMayor Lightfoot yesterday to celebrate APPI Heritage Month. https://t.co/CDSsQ3mQWp","date":"Tue May 10 19:01:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"“We have to get people on the record if we’re going to hold them accountable in the fall and beyond.\" A woman’s right to choose is on the brink. We must codify Roe v. Wade. https://t.co/nmdIgGiUdv","date":"Tue May 10 18:01:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must provide Ukraine with more resources to defend itself, before it’s too late. \nhttps://t.co/HJVn0sDL14","date":"Tue May 10 17:01:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The sky-high costs of child care prevent many Americans from joining the workforce. We must make it more affordable if all Americans are to succeed. \nhttps://t.co/vEdZ0Tf2Rd","date":"Tue May 10 16:02:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Last week, in response to @hbottemiller's story exposing serious delay and dysfunction at the FDA, I wrote to the agency to request a briefing on the state of its oversight of dangerous heavy metals in baby food, a danger I brought to light through my investigation last year. https://t.co/JQhoJcGlX8","date":"Tue May 10 15:30:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Roe v. Wade is only the first target of this Supreme Court. We must take action to codify not just a woman’s right to choose, but other crucial rights as well. \nhttps://t.co/uOTMdYidxq","date":"Tue May 10 14:03:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This must be a global effort if we as a people are to move on from Covid without suffering from new variants and deadly outbreaks.\nhttps://t.co/vGQyUlXLRk","date":"Mon May 09 22:00:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin says invading Ukraine was “inevitable.” Nothing could be further from the truth. Putin choose this suffering for his own gain. \nhttps://t.co/tLpXaeuRJE","date":"Mon May 09 21:00:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Giuliani pulling a stunt? I’m shocked. But no matter what, Giuliani must share what he knows about the insurrection https://t.co/NOXktTlrpD","date":"Mon May 09 20:00:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s beyond disturbing when we’re learning more details from the Trump Administration that sound straight out of a Doctor Strangelove reboot\nhttps://t.co/kW0Wn0mWIv","date":"Mon May 09 18:01:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We have the Court’s attention. Let’s keep pushing and codify Roe before the decision becomes final.\nhttps://t.co/KfnScmDpmr","date":"Mon May 09 16:02:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Congratulations to Karine Jean-Pierre on your new position. You will continue to be an inspiration to young people everywhere!\nhttps://t.co/996ROkknSK","date":"Mon May 09 14:03:11 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"With Roe on the brink, we have to do everything we can to codify the right to choose into law.\nhttps://t.co/59DzbRoy1c","date":"Mon May 09 00:00:37 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is what happens when a government fears you’ll learn the truth.\nhttps://t.co/r3FXUrEy5s","date":"Sun May 08 21:00:20 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please stay on guard with public health guidance – there’s still an enormous amount of misinformation circulating.\nhttps://t.co/AXTk34cy3j","date":"Sun May 08 19:00:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It is with great sadness that our nation passes this grim milestone. They were not simply statistics, they were integral members of our communities. Please get vaccinated to keep yourself and those around you protected.\nhttps://t.co/EcRhIXBXKb","date":"Sun May 08 18:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"If they truly wanted to reduce unplanned pregnancies, they would embrace comprehensive sex education and easily accessible contraceptives. Instead, they have endangered the lives of women across the country while robbing them of their bodily autonomy.\nhttps://t.co/wMyfzVCCp1","date":"Sun May 08 16:01:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Mother’s Day! Today, we honor all mothers and mother figures who extend their unconditional love and support. Today, I thank my beautiful wife and my mother for being amazing moms. Thank you all for the hard work you do for your families! https://t.co/JFX4k8Kkbm","date":"Sun May 08 13:01:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The contempt for women by some on the right extends beyond just their Supreme Court Justices.\nhttps://t.co/QBUuZxCXaW","date":"Sat May 07 23:00:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My thoughts are with the victims of the Kansas tornado who suffered such devastation.\nhttps://t.co/91uUXcwln7","date":"Sat May 07 21:00:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Their finding inclusive material “disturbing” says everything about them and virtually nothing about the material they probably haven’t even seen.\nhttps://t.co/TNNHKl95o5","date":"Sat May 07 19:44:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Vaccinating the whole planet is an all-hands-on-deck endeavor. We have seen how quickly a variant can arise from another country and we cannot risk economic and human suffering from our own shortsightedness.\nhttps://t.co/Grc17ovoyy","date":"Sat May 07 18:30:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The country is already bracing for the next area of law on which the extreme conservative majority on the Supreme Court will turn back the clock.\nhttps://t.co/m8P3xOE4bM","date":"Sat May 07 16:01:37 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We cannot let this window for comprehensive climate legislation close. We will not get a second chance to avoid an environmental catastrophe. \nhttps://t.co/I7z02bLJIa","date":"Sat May 07 14:01:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While the will of the American people is to continue the progress being made around the world, the Supreme Court’s conservative majority seeks to turn back the clock on human rights.\nhttps://t.co/8bIHbz9OvG","date":"Fri May 06 23:00:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I don’t care if he’s wearing his costume from The Masked Singer or inexplicably standing in front a landscaping business in Philadelphia, Rudy Giuliani must testify to his role in and leading up to the January 6th insurrection.\nhttps://t.co/RVmlZbgVsH","date":"Fri May 06 21:00:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s war in Ukraine has consisted of heinous and unceasing war crimes. The international community must continue to impose serious consequences to end this war.\nhttps://t.co/AunZv2gpl0","date":"Fri May 06 20:01:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The effort to overthrow American democracy was comprehensive, concerted, and catastrophic.\nhttps://t.co/Cu4IUCrmQ5","date":"Fri May 06 18:01:58 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While Republicans in Congress often stay muted, many of their counterparts at the state level are seemingly overjoyed by SCOTUS’ attack on women’s reproductive freedom, continuing to pass bills robbing them of their bodily autonomy.\nhttps://t.co/deEVeS6Val","date":"Fri May 06 17:01:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I commend the Biden Administration for its planned conference on hunger, nutrition, and health. We must commit serious efforts to achieve the goals of ending hunger, improving nutrition, and reducing diseases.\nhttps://t.co/EwG82qO3uh","date":"Fri May 06 16:03:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Congratulations to Hamor García for winning first place in this year’s Congressional Art Competition! I’m proud to represent so many incredible artists in our district! https://t.co/UlAwnPMvzb","date":"Fri May 06 14:03:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must protect the right to choose on every front.\nhttps://t.co/zwFClSMj14","date":"Thu May 05 23:00:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Unsurprising to see that Trump’s DHS downplayed any prospect of Russian meddling in the 2020 election for political reasons.\nhttps://t.co/pmOBgi0fzX","date":"Thu May 05 21:00:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Can you really call yourself a democracy if you kick your citizens out at the whiff of criticism? [That’s a rhetorical question for anyone reading whose response to American dissent is “if you don’t like it, leave”]\nhttps://t.co/RGdjnFPwPw","date":"Thu May 05 20:01:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to join WINGS as we celebrated the construction its new counseling center for victims of domestic violence and the $250,000 in federal funding I secured toward its completion https://t.co/ZvSNXp6aL8","date":"Thu May 05 19:01:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Really makes you wish the January 6th, 2021 version of Leader Kevin McCarthy stuck around.\nhttps://t.co/fNEGHZcA4N","date":"Thu May 05 18:01:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"When you hear Republicans talk about legislating from the bench, this is what they meant.\nhttps://t.co/BR3fphe7cP","date":"Thu May 05 17:01:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We have to remain vigilant and committed to vaccinating the world. COVID won’t stop to wait until we’re ready.\nhttps://t.co/F4VnoBXzuj","date":"Thu May 05 16:02:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Let’s be frank - the assault on women’s rights is a far more heinous act than the leak of the draft opinion. \nhttps://t.co/gkt7k9wYF6","date":"Thu May 05 14:15:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Glad to see that more vaccines will hopefully be ready for young children. We can’t leave anyone behind in the fight against COVID-19. \nhttps://t.co/Qd5USExCNh","date":"Thu May 05 00:01:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Anyone confident the Supreme Court will stop at Roe, I wish I shared your optimism. Precedent and settled law appear to mean nothing to the majority of this court and we can afford to take nothing for granted.\nhttps://t.co/aAMURkB9R8","date":"Wed May 04 23:00:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Proud to join my colleagues and @chicagosmayor in standing with Planned Parenthood for women’s reproductive rights! #DefendAbortionAccessIL #BansOffOurBodies https://t.co/FauIJhjmyu","date":"Wed May 04 22:00:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The former President incited Americans from across the country to attack the peaceful transfer of power itself. We will be dealing with the fallout for a long time.\nhttps://t.co/XeK8PYD8UI","date":"Wed May 04 21:00:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Every dollar seized as punishment in response to Putin’s invasion of an innocent neighbor should be sent to aid the Ukrainian people in their fight and recovery.\nhttps://t.co/cQc4GdZGo7","date":"Wed May 04 20:01:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The right to choose is under attack everywhere. We must do everything we can to preserve reproductive rights, fighting in our legislatures as well as the courts.\nhttps://t.co/l9IgG9XdNE","date":"Wed May 04 18:02:11 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Booster seat use reduces the risk for serious injury by 45% for children age 4–8. As the author of the Booster Seat Safety Act, I was happy to help provide booster seats to families and discuss the proper pediatrician recommendations for using them. https://t.co/YbaN7z4PQe","date":"Wed May 04 17:01:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Every person that kept information about the insurrection on January 6th private should be ready to testify, regardless of their title.\nhttps://t.co/xyEk6hf7ZG","date":"Wed May 04 16:03:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"“Will this institution survive the stench that this creates in the public perception that the Constitution and its reading are just political acts?” - Justice Sonia Sotomayor in 2021\nhttps://t.co/Gac67VSho6","date":"Wed May 04 15:01:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Our nation moruns the life of Secretary Norman Mineta while honoring his legacy. The first Asian American to hold to Presidential cabinet position, his dedication and service to our country will never be forgotten.\nhttps://t.co/wZQmYd6U5u","date":"Wed May 04 14:30:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"May is Asian American and Pacific Islander Heritage Month. I'm proud to be one of four Indian-Americans serving in Congress with our other AAPI colleagues. Our diverse backgrounds reflect the diversity of our nation and make us stronger. There's no room for hate. https://t.co/VxIQs7wZAg","date":"Wed May 04 14:03:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Very sadly, we can't and we'll need to prepare for that possibility at the state level in case such a challenge emerges","date":"Tue May 03 23:11:55 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The time for talk has ended. We must codify Roe.\nhttps://t.co/roqeisBBfh","date":"Tue May 03 23:00:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me on May 4th to announce the winners of this year's Congressional Art Competition. All are welcome! Please bring friends and family. We are looking forward to seeing you there!\nRegister at https://t.co/Ma0PsYdnXj","date":"Tue May 03 21:00:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Members of Congress should make decisions based on what’s best for their constituents - not their own bank accounts. The Ban Conflicted Trading Act that I introduced in the House will help increase public trust in the people’s representatives. \nhttps://t.co/CgXEoRkKom","date":"Tue May 03 20:01:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was great to join Safe Kids Worldwide &amp; Lurie Children’s Hospital at Firman Community Services for their booster seat giveaway to families. As author of the Booster Seat Safety Act, I was happy to review car safety recommendations with parents. https://t.co/ZHVpNJ5DGb","date":"Tue May 03 19:45:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Speaker Pelosi is right - we need to work to approve additional aid to Ukraine to support them in their fight against Putin.\nhttps://t.co/oQUdjeHG46","date":"Tue May 03 19:01:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please tune in live TODAY at 1pm CT as I headline the Safe Kids Worldwide free booster seat giveaway event and discuss my Booster Seat Safety Act legislation.\nhttps://t.co/wYqHA15Bil","date":"Tue May 03 17:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy National Travel and Tourism Week! Safe transportation will help us rebuild our economy and facilitate a strong recovery for all of us. https://t.co/E3nP9n82yP","date":"Tue May 03 17:01:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A disturbing look at our likely future and the work that must be done to protect and expand reproductive rights at the state level if the Supreme Court proceeds with its plan to overturn Roe v. Wade. https://t.co/lctsQcE734","date":"Tue May 03 16:02:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Americans should be able to get at-home treatments from their local pharmacies. I commend the Biden Administration for taking this step to keep our country safe and healthy.\nhttps://t.co/RzgLxohGks","date":"Tue May 03 15:01:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As I said in my statement, a woman’s right to reproductive health care is a basic fundamental right. \nhttps://t.co/8f0WqS5fXC","date":"Tue May 03 14:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Even if there hadn't been leaked Supreme Court opinions before, such as Roe v. Wade in 1973, I'd be a hell of a lot more concerned with the harm of millions of women losing their right to make their own reproductive health care decisions than I am with the harm of the leak itself","date":"Tue May 03 03:27:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The leaked draft of the Supreme Court's majority opinion reveals they plan overturn Roe v. Wade. The right to make reproductive decisions should fall to individual women, not legislators, nor presidents, nor judges who'll never walk a day in their shoes. https://t.co/es7h4wFXge https://t.co/PXobS2RoGo","date":"Tue May 03 02:42:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, I wrote to the CEOs of ExxonMobil and Chevron asking how much their companies receive in tax subsidies. The U.S. govt is paying $12 to $19B per year to subsidize oil profits, while taxpayers are shelling out $4/gallon for gas and ExxonMobil and Chevron profits are soaring https://t.co/IloVhlqvca","date":"Mon May 02 22:11:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me on May 4th to announce the winners of this year's Congressional Art Competition. All are welcome! Please bring friends and family. We are looking forward to seeing you there!\nRegister at https://t.co/Ma0PsYdnXj","date":"Mon May 02 21:00:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The world is united to make Putin’s decision to invade a costly one. Consequences will continue until Russia’s forces leave Ukraine for good.\nhttps://t.co/I0JxhRk7DK","date":"Mon May 02 19:00:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I would like to wish the Muslim community a joyous Eid al-Fitr, which marks the end of Ramadan. Eid Mubarak! https://t.co/neuqAOI0ms","date":"Mon May 02 17:01:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"America will continue to show the world that we will stand with Ukraine for as long as it takes. I’m grateful for Speaker Pelosi’s leadership and reaffirmation of our national commitment.\nhttps://t.co/E34N3dFf48","date":"Mon May 02 16:02:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall TODAY at 6:00pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you.\nRegister here: \nhttps://t.co/2d7pGjIaMT","date":"Mon May 02 14:02:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Monday, May 2nd at 6:00pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you.\nRegister here: \nhttps://t.co/2d7pGjIaMT","date":"Mon May 02 00:00:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me on May 4th to announce the winners of this year's Congressional Art Competition. All are welcome! Please bring friends and family. We are looking forward to seeing you there!\nRegister at https://t.co/Ma0PsYdnXj","date":"Sun May 01 21:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"She was asked a hypothetical question about a 13-year-old girl being raped and responded by saying “there’s an opportunity for that woman.”\nhttps://t.co/dZ953WfWHC","date":"Sun May 01 19:00:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Glad to see they lost this game of Grand Theft Tractor\nhttps://t.co/ToLrMOiqtw","date":"Sun May 01 17:57:53 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We had enough reasons to fight climate change to ensure the wellbeing of humanity and our planet before this, but here’s yet another reason we need to drastically reduce our carbon emissions.\nhttps://t.co/5mKQya3Bjm","date":"Sun May 01 17:00:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The predictions of the planet's future continue to get more dire. We must pass comprehensive climate legislation or risk a catastrophic future.\nhttps://t.co/5TnOmM886r","date":"Sun May 01 15:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Sounds like he thought he was hosting a meeting of the Five Families\nhttps://t.co/gN27fln9Mq","date":"Sun May 01 14:01:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Instead of putting forth policies to cut prices and help hard-working Americans, one man’s bruised ego has led to a party devoting enormous energy to waging a war against a non-existent problem. \nhttps://t.co/7r7Bmpjd6B","date":"Sun May 01 13:00:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Monday, May 2nd at 6:00pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you.\nRegister here: \nhttps://t.co/2d7pGjIaMT","date":"Sun May 01 00:00:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I never encountered the MAGA schwag room when I went in for an Oval Office meeting, but I’m not at all surprised it existed.\nhttps://t.co/ptnXmNVcFH","date":"Sat Apr 30 22:00:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m glad the committee is holding public hearings. Soon, we will all learn the extent of the insurrection on January 6th.\nhttps://t.co/buhkdCXqtx","date":"Sat Apr 30 21:00:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia will continue to use every method possible to harm the Ukrainian people. The United States and our allies must help prepare Ukraine for any form Putin’s aggression may take.\nhttps://t.co/xLE9pi8sNa","date":"Sat Apr 30 20:00:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Americans nationwide are paying more for their meals, while meat processing companies are earning record profits. Congress will fight through any obstruction to uncover predatory business practices and protect consumers.\nhttps://t.co/UOBu2We2eC","date":"Sat Apr 30 18:01:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me on May 4th to announce the winners of this year's Congressional Art Competition. All are welcome! Please bring friends and family. We are looking forward to seeing you there!\nRegister at https://t.co/Ma0PsYdnXj","date":"Sat Apr 30 17:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The right to choose is enshrined in our Constitution and protected by decades of Supreme Court precedent but Oklahoma is disregarding that and copying one of the most brutally anti-choice bills in decades.\nhttps://t.co/7wpH5ocguS","date":"Sat Apr 30 16:01:37 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Although it looks like the worst is firmly behind us, there is never a bad time to get vaccinated and boosted to prevent a serious case of COVID-19.\nhttps://t.co/LIUx22xeog","date":"Sat Apr 30 15:01:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Trump Administration officials were committed to using pandemic relief loans to help their friends for the long haul.\nhttps://t.co/ru4eQnnTbO","date":"Sat Apr 30 13:01:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Monday, May 2nd at 6:00pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you.\nRegister here: \nhttps://t.co/2d7pGjIaMT","date":"Sat Apr 30 00:00:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We want an electric vehicle fleet for the Postal Service in the future. However, we won't fully protect the future of the USPS until Postmaster General DeJoy is removed and we have repaired the extensive damage that he’s inflicted. #FireDeJoy\nhttps://t.co/h6rVAoWtJN","date":"Fri Apr 29 23:00:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s forces must be held to account for their actions.\nhttps://t.co/k0siMDtEdA","date":"Fri Apr 29 22:30:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In America, our diversity is our strength. Greater civic engagement by people of all backgrounds only makes our democracy healthier and more representative. \nhttps://t.co/6z4rS34HYT","date":"Fri Apr 29 21:00:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A diplomatic presence signals to the world that the United States has full confidence in the people of Ukraine and their democratic future.\nhttps://t.co/bxeVLMmVaw","date":"Fri Apr 29 20:01:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s always painful to see trends of hate. Our country must be committed to standing against anti-Semitism wherever it rears its ugly head.\nhttps://t.co/i4cscnfRne","date":"Fri Apr 29 19:01:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Thank you to our great intern Allison for her work this spring semester! https://t.co/fpjzJWZmGI","date":"Fri Apr 29 18:02:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This reaffirms the importance of getting to the bottom line of whether fossil fuel subsidies actually do anything to help consumers or if they just feed oil company profits. https://t.co/YemtvGx1W4","date":"Fri Apr 29 18:02:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Glad to see President Biden commuting sentences for 75 people currently serving time for nonviolent drug offenses. America is a nation of second chances and rehabilitation. \nhttps://t.co/06ZZo4Pnuz","date":"Fri Apr 29 17:01:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The United States will stand with the democratic aspirations of freedom for all people, regardless of the forces seeking to take it from them.\nhttps://t.co/iosJ9JtEBT","date":"Fri Apr 29 16:30:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me on May 4th to announce the winners of this year's Congressional Art Competition. All are welcome! Please bring friends and family. We are looking forward to seeing you there!\nRegister at https://t.co/Ma0PsYdnXj","date":"Fri Apr 29 16:02:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Worsening student loan debt has been a weight holding down the next generation of workers, entrepreneurs, and small business owners. Student debt relief will help millions of families while expanding the opportunities before them.\nhttps://t.co/BbGfDwVA32","date":"Fri Apr 29 15:01:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Attacking Ukraine’s capital with the United Nations Secretary-General present speaks to Putin’s regard for the international community.\nhttps://t.co/houwoTkVId","date":"Fri Apr 29 14:30:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We will never eradicate COVID without funding global vaccine efforts. Shortsightedness will only lead to variants emerging abroad that will damage our economic recovery.\nhttps://t.co/gpSn7geNwD","date":"Fri Apr 29 14:03:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is the violent use of pineapple Trump feared","date":"Fri Apr 29 13:35:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must ensure Putin knows we are ready to defend every inch of NATO soil and will oppose any further aggression just as we have thus far.\nhttps://t.co/Gxr485D70U","date":"Fri Apr 29 13:01:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"But the problem is that when companies don’t do that, when all they care is about the bottom line and not what goes into it, ignoring costs that aren’t on their balance sheet, people get hurt. Sometimes their lives are ruined. Sometimes they get sick. Sometimes they get killed.","date":"Fri Apr 29 02:56:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Those are stakes we can’t lose track of. We need to embrace approaches that can make regulation, compliance, and safety measures more efficient and more streamlined but we need to remember why we have those protections in the first place - because when we don’t, people suffer.","date":"Fri Apr 29 02:56:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"There are countless companies that try to do the right thing, ensuring their products are safe, fixing them when they’re not (instead of just selling them abroad), and making restitution to those they’ve harmed. That’s the moral choice and often the right business choice too.","date":"Fri Apr 29 02:56:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’ve been continuing in this thread long enough but fundamentally, the news from Johnson &amp; Johnson, both on selling potentially carcinogenic talcum powder as well as the additional reality of its using a bankruptcy loophole to avoid accountability is a reminder…","date":"Fri Apr 29 02:56:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Even if we read reviews and research products, government watchdogs who know what to look for are in a much better position to ensure the products we buy for our families are safe. Americans trust their government to do that and we must ensure agencies are worthy of that trust.","date":"Fri Apr 29 02:56:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We need meaningful consumer protection and corporate accountability to keep people safe and extract a real cost from those who harm them. Americans try hard to keep their families safe but our government has a duty to help protect them from the dangers they can’t see coming.","date":"Fri Apr 29 02:56:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, I wrote to the U.S. Energy Information Administration, in the wake of record oil company profits, to call for an official analysis of whether fossil fuel subsidies actually reduce prices for consumers or just increase profit margins for the companies that receive them. https://t.co/MQWBtx3LGF","date":"Mon Apr 25 19:34:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"And Johnson &amp; Johnson isn’t alone: the Sackler family, owners of Purdue Pharma which knowingly fueled and profited from the opioid epidemic used the same tactic to drastically reduce their liability for the human and financial destruction Purdue caused. https://t.co/Z5gk1cIeTE","date":"Fri Apr 29 02:56:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"But how is Johnson &amp; Johnson, a $400 billion company, accepting accountability for the harm that courts have found it’s knowingly caused to so many women? It’s not - it’s using a loophole in bankruptcy law to avoid paying its victims https://t.co/pAbLz9DCvu","date":"Fri Apr 29 02:56:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s a shame that Johnson &amp; Johnson is choosing to still sell a product abroad that it was forced to pull from the shelves in North America because of the number of women it harmed, and the combination of public image and financial costs that resulted.\nhttps://t.co/URIkn6H7CU","date":"Fri Apr 29 02:56:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"That’s why I’m proud to have cosponsored the Nondebtor Release Prohibition Act to close the loophole. This important bill was introduced by @SenWarren @SenatorDurbin @RepJerryNadler @RepMaloney @SenBlumenthal and will bring accountability to misconduct.\nhttps://t.co/9h4pRzA2DU","date":"Fri Apr 29 02:56:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This decision and the apparent dismissal of so much research is incredibly disappointing given the dangers of asbestos &amp; how many it’s harmed: The FDA, WHO, and numerous other public health organizations don’t accept any level of asbestos in talc as safe. https://t.co/MTnlWt5pWQ","date":"Fri Apr 29 02:56:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"“Two years later, another executive raised a red flag, saying the company should no longer assume that its talc mines were asbestos-free. The powder, he said, sometimes contained materials that ‘might be classified as asbestos fiber.’” https://t.co/q9vDFIRKSb","date":"Fri Apr 29 02:56:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I say abroad because two years ago, in response to my investigation and litigation on behalf of thousands of brave families exposing its dangers and the deception, Johnson &amp; Johnson discontinued North American sales of their talcum powder https://t.co/jBnXINi3eI","date":"Fri Apr 29 02:56:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Johnson and Johnson rightly recalled 33k bottles of the asbestos-contaminated lot of its product BUT then it impugned the quality of FDA testing even though J&amp;J memos showed its own employees pressing for higher testing standards https://t.co/sgE8ERw41H","date":"Fri Apr 29 02:56:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In fact, a Johnson &amp; Johnson memo from 1971 reveals the company knew its talc-based baby powder was potentially contaminated with asbestos.  The senior staffer who authored the memo recommended Johnson &amp; Johnson “upgrade” its scrutiny of talc safety.  https://t.co/q9vDFIRKSb","date":"Fri Apr 29 02:56:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This also followed  the FDA’s 2019 announcement that it had detected asbestos in one lot of Johnson &amp; Johnson’s baby powder, driving the company to voluntarily recall the product as the FDA warned consumers to not to use bottles from the tested lot.\nhttps://t.co/nkyXT3tflu","date":"Fri Apr 29 02:56:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s unbelievable that Johnson &amp; Johnson will continue selling potentially carcinogenic, asbestos-tainted baby powder abroad after my Subcommittee’s investigation revealed it knew the risks and fought to keep using a faulty testing method that would not have detected the asbestos","date":"Fri Apr 29 02:56:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Monday, May 2nd at 6:00pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you.\nRegister here: \nhttps://t.co/2d7pGjIaMT","date":"Fri Apr 29 00:01:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"America must not have a two-tiered justice system. No one is above the law.\nhttps://t.co/ZnCqWMZxdW","date":"Thu Apr 28 23:00:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As an original cosponsor of the Green Postal Service Fleet Act, I commend this effort to stop the USPS from replacing its delivery fleet with polluting mail trucks.\nhttps://t.co/klIbMqv1Ph","date":"Thu Apr 28 22:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We can’t back down from fighting to keep COVID-19 cases low across the world. We need to authorize equitable, global vaccine funding to make sure no one is left behind.\nhttps://t.co/gpSn7gefH5","date":"Thu Apr 28 21:00:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"America’s criminal justice system must be rehabilitative and not simply retributive. I commend the Biden Administration for taking this overdue step to reintroduce formerly incarcerated Americans back into society with the tools they need to succeed.\nhttps://t.co/94Q1Th3lf4","date":"Thu Apr 28 19:01:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is good news, but we must still remain committed to ending the pandemic internationally so it can fully end everywhere.\nhttps://t.co/MVwUg2HkjU","date":"Thu Apr 28 18:01:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m disappointed my Republican colleagues seem so committed to demonizing the trans community. To quote Utah Governor Spencer Cox, a Republican who vetoed a similar bill, “Rarely has so much fear and anger been directed at so few.” Trans lives matter.\nhttps://t.co/1vVx2iOXyy","date":"Thu Apr 28 17:01:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin has punished or poisoned anyone he perceives as a threat. Thankfully, there are still brave Russians who believe in a democratic future for their country.\nhttps://t.co/4rnqAGiXxE","date":"Thu Apr 28 16:03:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me on May 4th to announce the winners of this year's Congressional Art Competition. All are welcome! Please bring friends and family. We are looking forward to seeing you there!\nRegister at https://t.co/Ma0PsYdnXj https://t.co/Fv4GUaVtbe","date":"Thu Apr 28 15:05:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Congress must move forward quickly on COVID aid. The lack of adequate global vaccine supply means another outbreak could be on the horizon. We must have treatments funded in preparation.\nhttps://t.co/RJTQXxT0uV","date":"Thu Apr 28 14:03:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A valuable wake up call for many people out there","date":"Thu Apr 28 04:32:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The world won't be bullied by a petulant tyrant.\nhttps://t.co/3pyRD3Sucp","date":"Wed Apr 27 23:00:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Really unfair of Mick and Keith to omit all the refugee resettlement work from \"Sympathy for the Devil\"","date":"Wed Apr 27 21:54:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Sign up for my newsletter to receive updates on my work in Congress!\nhttps://t.co/HN9ObSoAJe","date":"Wed Apr 27 21:00:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Hypocrisy of this level is simply shameless. They confided their fears privately yet embraced the big lie in front of the cameras.\nhttps://t.co/yWVbIgymUQ","date":"Wed Apr 27 19:01:11 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"#FinancialLiteracyMonth 💵 📖 is a great reminder to reassess your finances. Knowing where you stand financially can help reduce stress and make planning for the future easier for you and your family. https://t.co/zBOx4eMf2w","date":"Wed Apr 27 18:01:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"No one is above the law.\nhttps://t.co/ubLt8DQhjb","date":"Wed Apr 27 17:01:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"McKinsey &amp; Company was hired by JUUL to investigate teens’ favorite flavors of e-cigarettes. Their survey’s conclusion was that kids liked mint e-cigarettes and would switch to those if other flavors were banned. So what did JUUL do? They marketed mint e-cigarettes to KIDS. https://t.co/4DUgvMPysa","date":"Wed Apr 27 16:50:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"You might think that even the Trump Administration wouldn't interfere in national security loans, or allow politicized disruptions to overrule Pentagon experts...\nBut you'd be wrong.","date":"Wed Apr 27 16:40:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to join the ceremony today commemorating Holocaust Memorial Day (“Yom Hashoah”) to remember the six million Jews and millions of others murdered during the Holocaust. https://t.co/1y3N4It2Vj","date":"Wed Apr 27 15:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The United States and our European allies must ensure Russia’s invasion of Ukraine ends in a strategic defeat.\nhttps://t.co/o6WMTuTMZw","date":"Wed Apr 27 14:02:58 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We can’t grow complacent. COVID anywhere is a threat to us everywhere.\nhttps://t.co/BQOOTvgAeG","date":"Wed Apr 27 13:01:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The federal government plans to give nearly $85 billion in tax incentives to fossil fuel companies over the next 10 years. We need to make sure that those savings make it to working families’ wallets, and if they don’t, we need to make major changes.\nhttps://t.co/8OHV7VUI7a","date":"Tue Apr 26 23:00:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I commend President Biden for his selection of Bridget Brink, a veteran diplomat with experience in other former Soviet republics, as the U.S. ambassador to Ukraine. I urge the Senate to quickly confirm her to the post.\nhttps://t.co/30mAySr8pj","date":"Tue Apr 26 22:01:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s disastrous decision to invade Ukraine has left him making empty threats and blaming the rest of the world.\nhttps://t.co/pxOSoc7IDr","date":"Tue Apr 26 21:01:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to meet with Nobel Peace Laureate and child rights activist Kailash Satyarthi today to discuss the issue of child labor and how we can ensure the safety of children across the globe. https://t.co/F4BkYKs8e7","date":"Tue Apr 26 20:30:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We are committed to standing with our Ukrainian allies for as long as it takes to help them win their freedom.\nhttps://t.co/93gQF3lIvu","date":"Tue Apr 26 19:01:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m glad to see that Secretaries Austin and Blinken were able to meet with President Zelenskyy. We will continue to stand with the people of Ukraine.\nhttps://t.co/Vdexmq904w","date":"Tue Apr 26 17:01:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Signed into law earlier this year, I introduced the GRAY ZONE Act to combat cyber threats from hostile countries abroad. Unfortunately, these efforts will only become more common in the 21st century. \nhttps://t.co/GJ4ig9I3LB","date":"Tue Apr 26 16:02:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Sadly, election denialism is apparently quite an attractive trait in Republican candidates for state-level election posts.\nhttps://t.co/5J86s9arNk","date":"Tue Apr 26 15:01:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to help secure funding for the people and businesses of Illinois' 8th Congressional District in this year's appropriations package. This is federal funding directly helping our communities! https://t.co/QOJ8VZvZZP","date":"Tue Apr 26 13:32:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Attention 8th District of Illinois high school artists! My office is now accepting submissions for the Congressional Art Competition. The deadline to submit your art is quickly approaching on April 28! \nAll information needed to apply can be found here: https://t.co/m0Fmzif44U","date":"Tue Apr 26 12:02:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Always great to speak with students! At our Wood Dale Library event, we discussed how federal funding for their early childhood learning room will impact children and their families. https://t.co/LB7jdcNsq9","date":"Mon Apr 25 23:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A sobering stat on #WorldMalariaDay: After nearly 20 years in decline, global malaria deaths are on the rise. The need for additional international aid is clear.","date":"Mon Apr 25 22:55:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Sign up for my newsletter to receive updates on my work in Congress!\nhttps://t.co/HN9ObSoAJe","date":"Mon Apr 25 21:00:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Oil companies have taken advantage of supply chain issues and raised their prices to increase their profits.\nhttps://t.co/rpPaVXvoh2","date":"Mon Apr 25 20:01:23 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, I wrote to the U.S. Energy Information Administration, in the wake of record oil company profits, to call for an official analysis of whether fossil fuel subsidies actually reduce prices for consumers or just increase profit margins for the companies that receive them. https://t.co/MQWBtx3LGF","date":"Mon Apr 25 19:34:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The effects of climate change and Putin’s war in Ukraine have destabilized global food markets. That’s why I introduced the SECURE Food Act, to prioritize research into food policy and its impact on our national security.\nhttps://t.co/4Ag0F9NKsE","date":"Mon Apr 25 17:01:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"April 24th through April 30th marks World Immunization Week, a time where we reflect on the need to help vaccinate the world. We know that vaccines save lives and that we have the resources to provide them across the globe, so what are we waiting for? https://t.co/0bKy81NZjd","date":"Mon Apr 25 14:02:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Attention 8th District of Illinois high school artists! My office is now accepting submissions for the Congressional Art Competition. The deadline to submit your art is quickly approaching on April 28! \nAll information needed to apply can be found here: https://t.co/m0Fmzif44U","date":"Mon Apr 25 12:01:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In case anyone actually wondered what was in the math textbooks that Florida rejected…SPOILER: it was math.\nhttps://t.co/ahHIjpwTZ1","date":"Sun Apr 24 21:00:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I think I had too much fun during Wood Dale Library’s story time with puppets! https://t.co/IyEHKx0NFi","date":"Sun Apr 24 20:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Worsening wildfires have claimed large swaths of our nation. I commend the Biden Administration for prioritizing the protection of these lands in our fight against climate change.\nhttps://t.co/03IccCxA2a","date":"Sun Apr 24 19:00:37 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today we remember the countless lives lost to the brutal Armenian Genocide. I was proud to be an original co-sponsor of the Armenian Genocide Education Act to ensure that we never forget this tragedy and never let anything like this happen again.","date":"Sun Apr 24 17:00:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Easter to all Orthodox Christians! I wish you all great joy and peace during this celebration. https://t.co/tEgJUGGIYT","date":"Sun Apr 24 13:00:55 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Attention 8th District of Illinois high school artists! My office is now accepting submissions for the Congressional Art Competition. The deadline to submit your art is quickly approaching on April 28! \nAll information needed to apply can be found here: https://t.co/m0Fmzif44U","date":"Sun Apr 24 11:00:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Even with Putin’s most deranged disinformation campaigns, it’s pretty tough to cover up a huge sunken warship.\nhttps://t.co/Rkq5EQJfH7","date":"Sat Apr 23 21:00:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must do everything we can to support the Ukrainian people as they face off bravely against tyranny.\nhttps://t.co/gGHFChRX3N","date":"Sat Apr 23 19:00:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Is he talking about a different Barack Obama? https://t.co/5l0W0kRkdG","date":"Sat Apr 23 18:08:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"You vs. the viking she told you not to worry about...\n(But seriously, thank you to Salt Creek School District 48 and your formidable mascot for letting me join you as we commemorated the federal funding I secured for the creation of your exciting new afterschool program) https://t.co/Zoai7GQdgv","date":"Sat Apr 23 18:01:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The committee must leave no stone unturned in America’s quest for the truth.\nhttps://t.co/g88MQ6nwu8","date":"Sat Apr 23 17:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s lies are out in the open. His war was never to help the people of Ukraine, but rather to conquer a sovereign state.\nhttps://t.co/StpCRfz8KQ","date":"Sat Apr 23 16:01:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin believes he can redraw the territorial boundaries of other nations. Ukraine, with the support of the entire democratic world, will prove him wrong.\nhttps://t.co/UmHyIaO7hK","date":"Sat Apr 23 15:01:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Attention 8th District of Illinois high school artists! My office is now accepting submissions for the Congressional Art Competition. The deadline to submit your art is quickly approaching on April 28! \nAll information needed to apply can be found here: https://t.co/m0Fmzif44U","date":"Sat Apr 23 14:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Financial abuse in the COVID aid is a serious problem. That’s why I was proud to vote for aid for small businesses and restaurants to get back on their feet, while strengthening oversight to prevent the misuse of relief funds in the future.\nhttps://t.co/472zyF1CeV","date":"Fri Apr 22 23:00:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to join Wood Dale Library for our ribbon cutting ceremony on their new early childhood learning center, made possible by $225,000 in federal funding that I secured in Congress. I look forward to seeing the great programs this library will provide children. https://t.co/8Jc3QoyEPc","date":"Fri Apr 22 22:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"From the tape: \"I'm seriously thinking of having that conversation with him tonight. From what I know of him — I mean, you guys know him too — do you think he would ever back away?\"\nhttps://t.co/pLPusuI9d6","date":"Fri Apr 22 21:00:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As we celebrate #EarthDay today, I will continue to fight for a clean planet through my work on the Oversight Subcommittee on the Environment.","date":"Fri Apr 22 20:35:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Sign up for my newsletter to receive updates on my work in Congress!\nhttps://t.co/HN9ObSoAJe","date":"Fri Apr 22 20:01:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to join Cook County Health &amp; Cook County Board President Preckwinkle to celebrate the passage of the Dr. Lorna Breen Health Care Provider Protection Act. My bill will expand mental health support for those on the front lines of our healthcare system. https://t.co/gCC4qqdgUH","date":"Fri Apr 22 19:45:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to cosponsor the Day of Silence Resolution supporting LGBTQ+ youth. https://t.co/160hJikOce","date":"Fri Apr 22 18:02:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The longer Putin’s war in Ukraine continues, the harsher the consequences will be. \nhttps://t.co/4aNk7sGOo2","date":"Fri Apr 22 17:02:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Earth Day! This day reminds us all of the importance of conservation and sustainability. https://t.co/r535YpyLWq","date":"Fri Apr 22 15:03:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I wish all Orthodox Christians around the world a Good Friday filled with faith and family. https://t.co/vmrnXadLtF","date":"Fri Apr 22 11:01:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Wow.","date":"Fri Apr 22 01:41:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Like the deluded “strongmen” that came before him, Putin’s continued efforts at intimidation only show his true weakness.\nhttps://t.co/n5x1mHtG65","date":"Thu Apr 21 23:00:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It's telling when something is a new low for reality TV but not Rudy Giuliani\nhttps://t.co/bBfg684FnA","date":"Thu Apr 21 21:00:53 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The world will not lend the veneer of legitimacy to Russia’s lies.\nhttps://t.co/DQSBlUSytb","date":"Thu Apr 21 20:01:20 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Attention 8th District of Illinois high school artists! My office is now accepting submissions for the Congressional Art Competition. The deadline to submit your art is quickly approaching on April 28! \nAll information needed to apply can be found here: https://t.co/m0Fmzif44U","date":"Thu Apr 21 16:02:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I would like to wish the Baha’i community around the world a happy start to Ridvan. May this be a time of prayer, reflection, and celebration for all who observe. https://t.co/fdgVqTSQqy","date":"Thu Apr 21 14:03:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Glad I had the chance to join the Salt Creek School District 48 community earlier today as we celebrated the creation of their new after-school program through funding I secured. Highlights of the program include STEAM activities, a chess club, math support and a homework center. https://t.co/L9loyJKNxC","date":"Wed Apr 20 22:00:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s disgraceful aggression has jeopardized global economic stability. \nhttps://t.co/uA9Fvf40Eq","date":"Wed Apr 20 21:00:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Seems like a good day to say again that I was  proud vote for the Marijuana Opportunity Reinvestment and Expungement Act (MORE) Act earlier this month to decriminalize cannabis. Now let’s get it through the Senate.","date":"Wed Apr 20 20:31:17 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"First, we need to do far more to address global climate change by reducing our carbon footprint while shifting to greener technology and clean energy.\nSecondly, I wonder if my colleagues who deny climate change are now going to dodge questions by bringing up Timothée Chalamet...","date":"Wed Apr 20 19:24:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Whether you’re J.D. Vance or anyone else, it should probably always raise red flags when you’re favorably quoting Andrew Jackson’s opposition to a Supreme Court ruling affirming the rights of Native Americans… https://t.co/tXsfhmHFk4","date":"Wed Apr 20 18:19:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"America will continue to stand with Ukraine for as long as it takes to ensure its freedom.\nhttps://t.co/EL5qgUdvQS","date":"Wed Apr 20 18:01:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Over a month later, and Putin’s forces continue to brutalize eastern Ukraine.\nhttps://t.co/R9n5G5pjzl","date":"Wed Apr 20 17:01:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Excited to be joining members of the Salt Creek School District 48 community at Albright Middle School in a few minutes to discuss a new after-school program they're launching this year with federal funding I was proud to secure. https://t.co/GLTbZGpYMD","date":"Wed Apr 20 14:30:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Grateful for the chance earlier this week to join @GovPritzker, Chicago Federation of Labor and other leaders from our community as we announced new funding for the Hire360 Job Training Center, including $1 million in fenderal funding I secured. https://t.co/ft8dyxII9w","date":"Wed Apr 20 14:02:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The horror Putin has inflicted on the innocent people of Ukraine is appalling. The world must continue to respond with severe consequences to prevent further violence.\nhttps://t.co/ERn3sQYwC7","date":"Wed Apr 20 00:01:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"To prevent another serious wave of cases from derailing our economic recovery, make sure you and your loved ones are vaccinated and boosted against a serious case of COVID-19.\nhttps://t.co/xa9n3ey9Rt","date":"Tue Apr 19 20:01:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We need to fast track this deal and other measures necessary to combat the rising prices we're seeing across the country.\nhttps://t.co/VsLXMZaN8h","date":"Tue Apr 19 19:01:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Vladmir Putin is exactly who we thought he was.\nhttps://t.co/T2wEniNjWW","date":"Tue Apr 19 18:01:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Efforts to cover up the truth from the American people will be futile. Congress will get to the bottom of January 6th. \nhttps://t.co/7Yfndfv9Sq","date":"Tue Apr 19 17:01:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must pass legislation that reduces our emissions and ensures the next generation has a sustainable future.\nhttps://t.co/4jYG6xaSOS","date":"Tue Apr 19 16:02:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s war has cost countless civilians their lives. We must continue to stand with the people of Ukraine as we continue to call for peace.\nhttps://t.co/OtRcYijv2e","date":"Tue Apr 19 11:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The United States has made it clear that evading international sanctions will have serious consequences. A country committing horrific war crimes must be held accountable.\nhttps://t.co/kIDA4QbGLp","date":"Mon Apr 18 23:00:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am glad that the legislation I fought hard to pass has taken effect. Young Americans will no longer be exploited by companies pushing synthetic nicotine without proper regulation.\nhttps://t.co/w5AjQ8qHxM","date":"Mon Apr 18 22:00:53 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The war on women’s reproductive freedom will only end when we codify Roe v Wade into law once and for all.\nhttps://t.co/Dep6T75Wmo","date":"Mon Apr 18 20:01:29 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We are experiencing a historical moment that requires more international cooperation within existing institutions, not less.\nhttps://t.co/EMnfdE72NZ","date":"Mon Apr 18 19:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today is #TaxDay, make sure to pay and file your individual income tax returns! If you need help or a 6 month extension to file, the IRS has resources to help you do so!\nhttps://t.co/UzWnPTs35P","date":"Mon Apr 18 19:01:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We did it, thank you @GovPritzker for partnering with me to secure $3 million for the @HIRE360Chicago Training &amp; Business Development Center- $2 million from the state and $1 million in federal funding. Investing in our workers will create good-paying jobs and grow our economy. https://t.co/8oUSEHSZJo","date":"Mon Apr 18 18:25:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Incredible to see medical innovations like this. The more we support developments, the stronger we are in the fight against COVID-19.\nhttps://t.co/x6S6616BkR","date":"Mon Apr 18 16:02:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Attention 8th District of Illinois high school artists! My office is now accepting submissions for the Congressional Art Competition. The deadline to submit your art is quickly approaching on April 28! \nAll information needed to apply can be found here: https://t.co/m0Fmzif44U https://t.co/emtOAD0X9h","date":"Mon Apr 18 12:01:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Vaccines work!\nhttps://t.co/DbzbTEKdVG","date":"Sun Apr 17 23:00:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"If we don’t want to worry about a new variant every other week, we have to ensure that global vaccine funding is a priority so we can end the pandemic for good.\nhttps://t.co/PaZgEt4zUA","date":"Sun Apr 17 22:00:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"They sat by as the President plotted to overturn a lawful election. The American people must learn what they know.\nhttps://t.co/CvuaQVniCK","date":"Sun Apr 17 20:00:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"With COVID cases once again rising, make sure you are protected against a serious case. Please get boosted.\nhttps://t.co/OhS4yjjjBC","date":"Sun Apr 17 17:01:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Easter to everyone celebrating today! Enjoy your time with your family and loved ones. https://t.co/f88z3v8fsh","date":"Sun Apr 17 14:40:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Everyone who upheld the big lie and supported the insurrection should be held accountable. \nhttps://t.co/EqcJIS4UTB","date":"Sat Apr 16 21:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As Putin continues his atrocities, we must continue to stand with the Ukrainian people by supplying them the weapons they need.\nhttps://t.co/bWBKV3Ecve","date":"Sat Apr 16 19:00:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia has targeted Ukraine’s most vulnerable populations and bombed the hospitals they used for shelter in a direct violation of the Geneva Convention.\nhttps://t.co/rpNbDcIk1e","date":"Sat Apr 16 17:01:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"No. So long as Russia keeps attacking Ukraine, we will help the Ukrainians defend themselves.\nhttps://t.co/cyGQ7WJ5Vr","date":"Sat Apr 16 16:01:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Countries that seek to aid Russia in its quest to evade accountability for its war in Ukraine will suffer the consequences.\nhttps://t.co/BqYCLqwYoS","date":"Sat Apr 16 14:01:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Attention 8th District of Illinois high school artists! My office is now accepting submissions for the Congressional Art Competition. The deadline to submit your art is quickly approaching on April 28! \nAll information needed to apply can be found here: https://t.co/m0Fmzif44U","date":"Sat Apr 16 12:01:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Our country lives up to its ideals when Americans of every background have a seat at the table. Diversity of perspectives in decision-making is the only way to solve our nation's pressing issues effectively and equitably.\nhttps://t.co/gfERZT2goF","date":"Sat Apr 16 11:00:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia will do anything to deflect accountability for its blatant human rights violations and rampant atrocities. The democratic world will must reject Putin’s unsubstantiated lies.\nhttps://t.co/u7Coqavb0i","date":"Fri Apr 15 22:01:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Chag Sameach to all who are celebrating the beginning of Passover tonight! I am wishing great peace, safety, and tranquility for you all during this holy time. https://t.co/inWEsPcaKX","date":"Fri Apr 15 19:01:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"No one is above the law. Everyone who illegally tried to overturn a lawful election and helped facilitate the insurrection attempt should be held accountable.\nhttps://t.co/aviisdR2YE","date":"Fri Apr 15 17:01:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As COVID cases continue to increase across the country it’s more important than ever to prevent a serious case and hospitalization. Now is a perfect time to get vaccinated and boosted if you haven’t already.\nhttps://t.co/GiSciByqMB","date":"Fri Apr 15 15:02:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I want to extend my well wishes to all those who observe Good Friday! May you all have a blessed holiday during this sacred time of renewal. https://t.co/TVmj38GmQu","date":"Fri Apr 15 13:02:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As Russia continues to increase its brutality on Ukraine, we must continue to provide Ukraine with the weapons to defend themselves and the aid to recover.\nhttps://t.co/ru6PnF93G7","date":"Thu Apr 14 23:00:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy New Year to all those celebrating Puthandu today! May this new year bring with it health and prosperity. https://t.co/pD4AYNuMoK","date":"Thu Apr 14 21:00:55 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Vladimir Putin's bloodthirsty quest in Ukraine has driven other democracies toward NATO.\nhttps://t.co/IwHh5RUcvH","date":"Thu Apr 14 20:05:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"President Putin started this war in Ukraine, and we will not let this autocrat win. https://t.co/qRXFxk2p1X","date":"Thu Apr 14 19:01:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Comments like these are borne of hatred and fear, and they lead to real harm for my constituents and our minority communities. They fuel hate crimes against minorities, and they make it much harder to accomplish common-sense immigration reform. #StopHate  #StopAsianHate","date":"Thu Apr 14 18:59:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"After President Trump left office, I thought the days of calling others “shithole” countries were over.\nhttps://t.co/HV8le7LyyG","date":"Thu Apr 14 18:59:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As an Indian-American immigrant, I’m disgusted to hear this UPenn Professor define Indian-American immigrants, and all non-white Americans, in such insulting terms. @TuckerCarlson should be ashamed. @Penn, what say you?","date":"Thu Apr 14 18:59:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I'm proud to have introduced the Ban Conflicted Trading Act with my colleagues @RepAOC and @RepJoeNeguse. We must ensure that our government works for the people, not for profits.","date":"Thu Apr 14 18:01:58 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Efforts at normalizing the dark events of January 6th will not work on the American people. We saw with our own eyes the violent efforts to overturn a free and fair election.\nhttps://t.co/8ObpYlivek","date":"Thu Apr 14 17:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s common sense that we crack down on untraceable ghost guns.\nhttps://t.co/hZyny0vKI6","date":"Thu Apr 14 16:03:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"To our Sikh neighbors and friends who are celebrating today, may blessings fill the coming season for you all. Happy Vaisakhi! https://t.co/gXsA0hWt8z","date":"Thu Apr 14 14:03:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Outrageous that the Washington Commanders apparently were ripping off their fans and the NFL. This is wholly unacceptable.\nhttps://t.co/Sydboat9Hz","date":"Thu Apr 14 11:01:17 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Washington Commanders kept multiple sets of books and engaged in blatant acts of financial impropriety. These actions clearly warrant further investigation.\nhttps://t.co/EjBHwc2Q7k","date":"Thu Apr 14 00:01:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must continue to stand with the people of Ukraine by supplying them with the weapons they need to defend themselves from Putin’s forces.\nhttps://t.co/nkOLNR8YDg","date":"Wed Apr 13 23:00:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As I told Crain’s, as the Washington Commanders maintained a culture of sexual harassment and retribution for their employees, they were also apparently cooking their books at the expense of the league and fans.\nhttps://t.co/TKrVvwazDm","date":"Wed Apr 13 22:01:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s bloodthirsty invasion of Ukraine has destabilized global energy markets and left Americans paying more at the pump. We must continue to consider additional measures to cut costs for commuting Americans across the country. \nhttps://t.co/lMyo0XDIn1","date":"Wed Apr 13 21:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m deeply concerned about the conduct of the Washington Commanders. Reading through the allegations against them sounds like “The Godfather,” not an NFL football team.\nhttps://t.co/LNTxzgdNph","date":"Wed Apr 13 21:00:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s brutality has unleashed a humanitarian crisis across Europe as he continues to target the most vulnerable people in Ukraine.\nhttps://t.co/EHzyWHTOpA","date":"Wed Apr 13 19:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My thoughts are with kids and parents in Alabama who are scared. What the Alabama state government is doing is cruel, and I will continue to fight in Congress every day for trans rights.\nhttps://t.co/LMUz65upyR","date":"Wed Apr 13 18:02:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Our Oversight Committee investigation found that Washington Commanders owner Dan Snyder was misleading the NFL and his own fans through cooking the books on ticket sales. While our focus is the toxic workplace, the list of improprieties in this organization seems limitless. https://t.co/ojnaHZ4d7J","date":"Wed Apr 13 17:50:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin must be held accountable for his war crimes, plain and simple.\nhttps://t.co/JeB8CYBoku","date":"Wed Apr 13 16:03:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"They never had any intention of following through on a peaceful transition of power. We must never let it happen again.\nhttps://t.co/7XAQnJR6NB","date":"Wed Apr 13 15:02:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Small businesses are the heart &amp; soul of communities, and they have suffered from the pandemic. I voted for the Relief for Restaurants and Other Hard Hit Small Businesses Act to provide the vital support to keep their doors open, and I’m proud that it passed last week. https://t.co/QTdh6tbyxO","date":"Wed Apr 13 13:02:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For state &amp; local govts and non-profit organizations in my district: my office is now accepting Community Project Funding requests for FY23 Appropriations. Submit applications for funding projects that will improve our community. Deadline is April 15. \nhttps://t.co/HXwmhkVCOI","date":"Wed Apr 13 12:01:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Major corporations have sold baby foods tainted with heavy metals for far too long. I’m going to keep fighting to hold them accountable and to ensure that this never happens again.\nhttps://t.co/76ngozByd6","date":"Tue Apr 12 23:00:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The democratic world must continue to use every method available to punish Putin for his war on the people of Ukraine.\nhttps://t.co/h9Yjjp92aK","date":"Tue Apr 12 21:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The former President tried relentlessly to overturn the results, inciting an angry mob to attack a branch of government. Should the facts warrant it, the committee must follow through with a referral to the Department of Justice.\nhttps://t.co/as3gkiR9Ev","date":"Tue Apr 12 19:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Heartbroken to see what happened in New York City this morning. While the details of this tragedy are still emerging, we must continue to work to combat gun violence through meaningful gun reform.\nhttps://t.co/UyC72rHET2","date":"Tue Apr 12 17:01:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Proud to continue my work with @RepMaloney as our investigation into sexual harassment and workplace misconduct by Washington @Commanders executives has uncovered potentially illegal business activities conducted at the expense of NFL fans, the league, and other teams.","date":"Tue Apr 12 16:32:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Along with his crimes, through blunder after blunder, Putin’s actions have led to an isolated Russia, a demoralized, humiliated military, and a devastated economy. https://t.co/eWPZkcc9cL","date":"Tue Apr 12 16:02:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Postal Service Reform Act has officially been signed into law. This bill provides the financial security necessary to ensure the Postal Service can continue to provide its vital services to Americans nationwide. https://t.co/Yq5kSbxbtK","date":"Tue Apr 12 15:02:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Seeking to restore Russia to the Soviet Union’s geography, Putin has instead reimposed the deprivation of the Soviet economy on his country.\nhttps://t.co/Ce8Olyg00j","date":"Tue Apr 12 14:02:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For state &amp; local govts and non-profit organizations in my district: my office is now accepting Community Project Funding requests for FY23 Appropriations. Submit applications for funding projects that will improve our community. Deadline is April 15. \nhttps://t.co/HXwmhkVCOI","date":"Tue Apr 12 12:01:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"America is united with broad bipartisan support for Ukraine and our European allies. Should Putin make the mistake of expanding his war, America is prepared to defend every inch of NATO territory.\nhttps://t.co/vxB6XHSZxo","date":"Mon Apr 11 23:00:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin began the bloodshed and it will only end when he’s been brought, or forced, to the table.\nhttps://t.co/Jnrm7eYNjP","date":"Mon Apr 11 22:00:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I submitted a Congressional Record statement in honor of Distracted Driving Awareness Month. I led the SAFE TO DRIVE Act, which was enacted last year, to decrease the number of tragic deaths from distracted driving across the country. A life is more valuable than a text.","date":"Mon Apr 11 18:47:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Since becoming the leader of Russia, Putin has erased all the democratic and economic progress the country made since the fall of the Soviet Union\n https://t.co/huKWwhCXtG","date":"Mon Apr 11 14:02:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For state &amp; local govts and non-profit organizations in my district: my office is now accepting Community Project Funding requests for FY23 Appropriations. Submit applications for funding projects that will improve our community. Deadline is April 15. \nhttps://t.co/HXwmhkVCOI","date":"Mon Apr 11 12:01:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Wonderful to have my whole staff in town early last week for our office retreat as we planned out our strategy and schedule through the end of the year. https://t.co/amGSix3WQD","date":"Mon Apr 11 11:25:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must ensure Ukraine has every tool necessary to defend itself for the duration of Putin's war.\nhttps://t.co/nDQlmKO9jK","date":"Sun Apr 10 22:00:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"America must once again make it clear to China and others who seek to aid Russia. There will be consequences for softening the blow of international sanctions.\nhttps://t.co/0QIV9cbR4Z","date":"Sun Apr 10 19:00:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"New clean-energy breakthroughs continue to happen by the day. We must continue to fund research and development that will lead the world into a carbon-neutral future.\nhttps://t.co/iMoPM20UmN","date":"Sun Apr 10 14:01:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The FBI must investigate the facts surrounding the classified documents the former President took with him after leaving office. \nhttps://t.co/Dh9plW9PKb","date":"Sat Apr 09 22:00:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia’s acts of brutality are sadly not just committed by outliers in their ranks. It is their deliberate, criminal approach.\nhttps://t.co/5E0ZgWW9mq","date":"Sat Apr 09 19:00:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The January 6th Committee must leave no stone unturned in their quest for the truth. The American people deserve nothing less.\nhttps://t.co/UxVldbHhEd","date":"Sat Apr 09 17:01:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"If we want our government to work for the people, we have to ensure Congress deserves their trust. It’s beyond time that we ban Members of Congress from trading individual stocks.\nhttps://t.co/F6T73L42Kv","date":"Sat Apr 09 11:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Thank you to Slovakia for continuing to help the Ukrainian people defend themselves against Russia’s barbaric war.\nhttps://t.co/0OQ9p4o1cl","date":"Sat Apr 09 00:35:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I'm tired of seeing politicians across the country vilify transgender people for being who they are to score cheap, vicious political points. We need to stand with the trans community.\nhttps://t.co/B5h1uWw6E7","date":"Fri Apr 08 22:00:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s barbarity knows no limits. The sanctions introduced this week by America and its allies are just the latest step in our efforts to hold Putin accountable.\nhttps://t.co/TXqsw7VClN","date":"Fri Apr 08 20:01:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s forces attacked a train station full of civilians trying to escape the war. It’s beyond words.\nhttps://t.co/4SUheoxDpH","date":"Fri Apr 08 19:57:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin uses every method possible to harass nations around the world. That’s why I introduced the GREY ZONE Act passed into law earlier this year, which requires additional efforts to counter disinformation and cyber-attacks from countries like Russia.\nhttps://t.co/2C2uo6nGSb","date":"Fri Apr 08 13:23:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For state &amp; local govts and non-profit organizations in my district: my office is now accepting Community Project Funding requests for FY23 Appropriations. Submit applications for funding projects that will improve our community. Deadline is April 15. \nhttps://t.co/HXwmhkVCOI","date":"Fri Apr 08 12:18:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Despite testing negative earlier this week, I have unfortunately tested positive for COVID-19. I feel fine, and I’m grateful I was able to get vaccinated &amp; boosted to protect me from a severe case. I will be isolating &amp; following CDC guidelines. Please, get vaccinated &amp; boosted!","date":"Fri Apr 08 11:16:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m glad the Biden Administration extended the moratorium on federal student loan payments through August 31st. This extension will help Americans facing the aftermath of the pandemic.\nhttps://t.co/TI7fdP7nRr","date":"Thu Apr 07 21:00:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Glad to see the Biden administration stepping in to ensure more families have access to affordable plans under Obamacare.\nhttps://t.co/91zqZ175nI","date":"Thu Apr 07 20:01:20 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to cosponsor this vital legislation and help pass it through the House. I urge my colleagues in the Senate to take it up and help bring this needed relief to restaurants and other businesses.\nhttps://t.co/S28BsuMk1w","date":"Thu Apr 07 19:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Justice Ketanji Brown Jackson of the United States Supreme Court https://t.co/j5uT9JJqiX","date":"Thu Apr 07 18:21:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"No amount of obstruction will prevent Congress from getting the truth to the American people.\nhttps://t.co/6Adgmn9369","date":"Thu Apr 07 18:01:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"You can’t have ‘business as usual’ with war criminals.\nhttps://t.co/O840BxNCyi","date":"Thu Apr 07 17:26:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today is World Health Day! As we look to finally end the pandemic, we must vaccinate the world. It’s the only way to protect ourselves from future variants emerging abroad. https://t.co/ysNS3p58SC","date":"Thu Apr 07 16:52:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The world stands together in opposition to Putin’s thirst for blood.\nhttps://t.co/cKqYYPAhfO","date":"Thu Apr 07 15:02:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Justice Ruth Bader Ginsburg was a trailblazer and American hero. Her legacy of service serves as a reminder to all of us what we can and should do with the opportunities before us. https://t.co/ahrUYv70hh","date":"Thu Apr 07 14:05:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Should we return to Vietnam as well?\nhttps://t.co/yA4R3RpRnH","date":"Thu Apr 07 13:02:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For state &amp; local govts and non-profit organizations in my district: my office is now accepting Community Project Funding requests for FY23 Appropriations. Submit applications for funding projects that will improve our community. Deadline is April 15. \nhttps://t.co/HXwmhkVCOI","date":"Thu Apr 07 11:01:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to join President Biden at the White House today as he signed the Postal Service Reform Act into law to ensure the USPS's financial stability  for decades to come. https://t.co/avkfeDfRBA","date":"Wed Apr 06 22:03:55 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Failure to make a sizable investment in clean energy now will cost us drastically more down the line. Inaction on climate cannot be an option.\nhttps://t.co/bBUEogFpz1","date":"Wed Apr 06 22:00:55 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The United States and our allies in Europe must continue to provide the weapons and aid necessary for the Ukrainians to continue their progress in liberating their country from Russian aggressors.\nhttps://t.co/M6TvKq3XAT","date":"Wed Apr 06 19:01:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s heinous war has backfired. His crimes against humanity against the people of Ukraine have strengthened NATO and united democracies around the globe.\nhttps://t.co/P7ickGNuwJ","date":"Wed Apr 06 18:01:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Attorney General must follow through on his pledge to follow where the facts lead. No person is above the law, and it must be made clear by the prosecution of those who desecrated our Capitol building in the effort to overturn a free and fair election.\nhttps://t.co/dQ5jh1n0dB","date":"Wed Apr 06 17:02:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I wonder if @RepCheri tweeted this partially to make a bunch of staffers explain the reference to Representatives... (thanks to mine for their patience)","date":"Wed Apr 06 14:12:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"April is Distracted Driving Awareness Month. Sadly, tens of thousands of fatal car accidents occur every year. That's why I introduced the SAFE TO DRIVE Act to help save lives and reduce reckless vehicular engagements all across the country. https://t.co/UcibrjMzza","date":"Wed Apr 06 14:02:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must do everything we can to end Putin’s war.\nhttps://t.co/AJy2H0ClY7","date":"Wed Apr 06 13:02:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Judge Jackson is quite possibly the most qualified person to ever be nominated for the Supreme Court. I’m glad that Senators Romney and Murkowski can see that too.\nhttps://t.co/pLzuYquucT","date":"Tue Apr 05 22:00:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"431,000 jobs. We’re coming back stronger than ever.\nhttps://t.co/iUUuS29mB0","date":"Tue Apr 05 20:01:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Amid the slaughtering of Ukrainian civilians by Russian troops, former President Trump asked President Putin if he can assist him in releasing information on President Biden’s family. Former President Trump always had a soft spot for dictators. https://t.co/yOGMfF3UNA","date":"Tue Apr 05 19:00:28 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am glad the Senate has passed their version of the bill to fix our supply chain issues. The House must move with urgency to send it to President Biden’s desk to help cut costs for hardworking Americans.\nhttps://t.co/gVMazCWqWz","date":"Tue Apr 05 18:01:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Library Workers Day! Providing a safe place for the love of learning, library workers are a vital part of every community. That's why I was proud to get $225,000 of federal funding for a new early education center at the Wood Dale Public Library. https://t.co/HMEABHuMcU","date":"Tue Apr 05 16:02:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"There will never be a justification for the atrocious actions of the Russian troops in Ukraine. Putin has purposely targeted civilians and committed unspeakable crimes against humanity. It seems like a game to him. \nhttps://t.co/Y2o2a82GPG","date":"Tue Apr 05 14:02:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For state &amp; local govts and non-profit organizations in my district: my office is now accepting Community Project Funding requests for FY23 Appropriations. Submit applications for funding projects that will improve our community. Deadline is April 15. \nhttps://t.co/HXwmhkVCOI","date":"Tue Apr 05 12:01:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my virtual panel discussion on “Opioid Addiction And Mental Health Issues During COVID-19” TODAY at 12pm CT. We will explore how the pandemic has given rise to mental health and addiction issues.\nRSVP here: https://t.co/hHiiJbRMVH","date":"Tue Apr 05 11:01:23 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My position has not changed: if the Senate cuts global vaccine funding from the COVID supplemental bill, we will have a big problem in the House.","date":"Mon Apr 04 19:09:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Crucial investments from the American Rescue Plan continue to pay dividends for our economic recovery. We must continue this strong progress as we emerge from the pandemic.\nhttps://t.co/MRmniYCxSe","date":"Mon Apr 04 19:01:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my virtual panel discussion on “Opioid Addiction And Mental Health Issues During COVID-19” on April 5th at 12pm CT. We will explore how the pandemic has given rise to mental health and addiction issues.\nRSVP here: https://t.co/hHiiJbRMVH https://t.co/u6SPu3jyrr","date":"Mon Apr 04 17:02:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Proud to have received a 100% on my Conservation Report Card from the Defenders of Wildlife. As a member of the Oversight Subcommittee on the Environment, I’m always going to fight for our planet’s future.\nhttps://t.co/CD4D6EHicd","date":"Mon Apr 04 15:02:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While Russia seeks to artificially prop up its currency, more consequences for Putin’s war of choice must be imposed. The Russian people must be made to see through the economic facade he has attempted to construct. \nhttps://t.co/toJyqlHUWc","date":"Mon Apr 04 14:02:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As the committee prepares to vote on Judge Jackson’s nomination, I have full confidence that they will agree with the American people. She is extremely qualified to be on the Supreme Court and will make a tremendous justice.\nhttps://t.co/ocfud7cWS1","date":"Mon Apr 04 12:02:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my virtual panel discussion on “Opioid Addiction And Mental Health Issues During COVID-19” on April 5th at 12pm CT. We will explore how the pandemic has given rise to mental health and addiction issues.\nRSVP here: https://t.co/hHiiJbRMVH","date":"Sun Apr 03 21:00:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"...but it's not even the second https://t.co/kyGyG2d4g0","date":"Sun Apr 03 19:18:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"With a more contagious strain becoming dominant, now is an excellent time to get vaccinated to prevent a serious case of COVID-19.\nhttps://t.co/aElIqFf5fE","date":"Sun Apr 03 19:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s actions have had the opposite effect than he intended. Democracies around the world are rallying against autocratic aggression and seeking additional protection for their own people.\nhttps://t.co/eubQYxccF9","date":"Sun Apr 03 18:00:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Companies are earning record profits as everyday Americans feel the squeeze of inflation. We must continue to conduct oversight to prevent more exploitation of consumers. \nhttps://t.co/8iITSqbAdg","date":"Sun Apr 03 16:30:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The American people should not have to decide between the life-saving insulin they need and other vital expenses. I was proud to vote for the Affordable Insulin Now Act which caps prices at $35 a month.\nhttps://t.co/H9uG43l5sd","date":"Sun Apr 03 14:01:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s unforgivable war on the people of Ukraine has destroyed the lives and homes of millions, spawning a humanitarian crisis in eastern Europe. He must continue to face consequences or else dictators everywhere will feel encouraged.\nhttps://t.co/W9maYlII01","date":"Sun Apr 03 13:01:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While a temporary release is an effective strategy to lower gas prices for Americans across the country, only the transition to clean energy and electric vehicles can permanently solve global energy issues. \nhttps://t.co/04KmPTR0kH","date":"Sat Apr 02 23:00:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A country that has committed mass war crimes against innocent civilians, including children, and cannot be trusted to honor its pledges without meaningful demonstrations of commitment.\nhttps://t.co/g5Mnq1bJ64","date":"Sat Apr 02 20:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For state &amp; local govts and non-profit organizations in my district: my office is now accepting Community Project Funding requests for FY23 Appropriations. Submit applications for funding projects that will improve our community. Deadline is April 15. \nhttps://t.co/HXwmhkVCOI","date":"Sat Apr 02 19:00:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today begins the holy season of Ramadan. I wish the Muslim community a peaceful period of renewal and reflection! https://t.co/af0F1BLmr3","date":"Sat Apr 02 18:00:55 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin aims to silence all criticism, but we all know that his brutality is deeply unpopular.\nhttps://t.co/fxyyHqQlus","date":"Sat Apr 02 17:01:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my virtual panel discussion on “Opioid Addiction And Mental Health Issues During COVID-19” on Tuesday at 12pm CT. We will explore how the pandemic has given rise to mental health and addiction issues.\nRSVP here: https://t.co/hHiiJbRMVH","date":"Sat Apr 02 16:01:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Eight years ago today, SCOTUS ruled in McCutcheon v. FEC that limits on the money that individuals can give political candidates were unconstitutional. Since then, dark money has flooded our politics and further poisoned our discourse.","date":"Sat Apr 02 14:01:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The former president once again tries to normalize seeking help from corrupt and autocratic regimes – by publicly doing it.\nhttps://t.co/VTZoY7yiRW","date":"Fri Apr 01 21:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"For state &amp; local govts and non-profit organizations in my district: my office is now accepting Community Project Funding requests for FY23 Appropriations. Submit applications for funding projects that will improve our community. Deadline is April 15. \nhttps://t.co/HXwmhkVCOI","date":"Fri Apr 01 20:01:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Every step Russia has taken since its invasion of Ukraine began has been in direct violation of international law. Putin’s word in itself can never be trusted. \nhttps://t.co/nH9UMFETFe","date":"Fri Apr 01 19:01:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to co-sponsor the resolution that's being introduced today in the House of Representatives recognizing the commencement of Ramadan. America is the land of religious freedom, and I am happy to mark the beginning of this holy period for the Islamic faith.","date":"Fri Apr 01 17:32:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Friday, April 1 at 4:30pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you. \nRegister here: https://t.co/wqNppnIEyZ","date":"Fri Apr 01 17:02:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The LGBTQ+ community and their rights have been under attack for a long time. Now Florida has gone after their very identity and existence portraying them as an “other” not to be spoken of.\nhttps://t.co/NH0B0jRc1x","date":"Fri Apr 01 16:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my virtual panel discussion on “Opioid Addiction And Mental Health Issues During COVID-19” on April 5th at 12pm CT. We will explore how the pandemic has given rise to mental health and addiction issues.\nRSVP here: https://t.co/hHiiJbRMVH","date":"Fri Apr 01 15:03:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Trump’s obstruction will not prevent the people’s representatives from getting to the bottom of that dark day. The American people must know the extent of his efforts to overturn a free and fair election.\nhttps://t.co/VYuviDvSmo","date":"Fri Apr 01 13:02:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Friday at 4:30pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. \nRegister here: https://t.co/wqNppnIEyZ https://t.co/FgKfnBbnnE","date":"Fri Apr 01 12:01:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Each day brings headlines more dire than the day before. We must act boldly on climate before the window to save our planet closes. \nhttps://t.co/5LlIILxibp","date":"Thu Mar 31 22:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Our country will extend its arms to those fleeing the atrocities Putin has inflicted on them. America has long been home to the persecuted, and we will once again be a safe haven for them.\nhttps://t.co/NRA1kdvTZy","date":"Thu Mar 31 20:01:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"President Biden’s budget proposal provides vital aid to Ukraine, reduces the deficit, and forces billionaires to pay their fair share of taxes. We must act quickly to pass these investments in our nation’s fiscal responsibility and global stability. \nhttps://t.co/WMgr9dVfi2","date":"Thu Mar 31 19:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today is Transgender Day of Visibility. To all trans and non-binary people, I see you, I support you, and I’m going to keep fighting for you.","date":"Thu Mar 31 17:40:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Great to meet with the National Association of Postal Supervisors to discuss the success of the Postal Service Reform Act &amp; what challenges the USPS is facing. To all the USPS employees in my district &amp; across the country, I want to express my sincerest thanks for your work. https://t.co/bytbEhgDCw","date":"Thu Mar 31 16:02:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my virtual panel discussion on “Opioid Addiction And Mental Health Issues During COVID-19” on April 5th at 12pm CT. We will explore how the pandemic has given rise to mental health and addiction issues.\nRSVP here: https://t.co/hHiiJbRMVH","date":"Thu Mar 31 15:02:58 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Hearing that critical global vax funding may be taken out of the COVID bill in the Senate. If the Senate does this, I am concerned many others and I may not be able to support the bill.  We can’t end the pandemic without global vax funding -- period.","date":"Thu Mar 31 13:14:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As the co-founder of the COVID-19 Global Vaccination Caucus, I am focused on getting shots in arms across the globe. And we need more funding to do that. https://t.co/jSxEFxhAl2","date":"Thu Mar 31 12:00:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Friday, April 1 at 4:30pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you. \nRegister here: https://t.co/wqNppnIEyZ","date":"Thu Mar 31 11:01:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Uh-oh. I guess that which does not kill us makes us endure more misapplications of continental philosophy. https://t.co/xWp9x85LpX","date":"Thu Mar 31 01:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The House of Representatives passed the Senate companion to my legislation to honor Justice Ruth Bader Ginsburg. Justice Ginsburg was a fierce advocate for equality and fairness under the law and inspired countless young women. https://t.co/pWhZ3zbdW3","date":"Wed Mar 30 23:45:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Every second we delay gives COVID-19 another chance to mutate and come back worse. Let’s vaccinate the world.\nhttps://t.co/iQpoyAcGbY","date":"Wed Mar 30 22:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Here’s the real story on the GOP report as they attempt to misleadingly politicize the pandemic.\nhttps://t.co/or1kYGw2pf","date":"Wed Mar 30 22:11:23 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Health Resources and Services Administration’s uninsured program is crucial, and it has now run out of money. This is deeply concerning for providers who rely on this program’s reimbursements and for the uninsured patients who rely on their doctors. https://t.co/r8mBg5vl2d","date":"Wed Mar 30 21:45:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Judge Jackson has the qualifications and temperament not only to serve the United States on the Supreme Court, but to do our nation and the generations to come proud.\nhttps://t.co/7PqVLT2Q8X","date":"Wed Mar 30 21:01:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As Spencer Cox, Utah’s Republican Governor, wrote when he announced his veto of similar legislation, “Rarely has so much fear and anger been directed at so few.” The trans community must be protected.\nhttps://t.co/8NTHa683Mu","date":"Wed Mar 30 20:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Yesterday, I met with Ukrainian Parliamentarians who voiced their need for fighter planes from NATO countries to protect their civilians from the Russian invasion. The U.S. needs to provide Ukraine with military and humanitarian aid while still protecting our national security. https://t.co/eAaQWptjCE","date":"Wed Mar 30 19:00:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Shameful. LGBTQ+ youth needs support and protection, not to be treated as the political punching bags of those who demonize them.\nhttps://t.co/utFHXL67lE","date":"Wed Mar 30 18:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Ginni Thomas must sit before the January 6th Committee and answer vital questions about her actions in the lead-up to the insurrection. \nhttps://t.co/dHDhvA8vZO","date":"Wed Mar 30 17:02:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to be the co-lead of legislation that just passed the House to add a statue of Ruth Bader Ginsburg beside other icons in the Capitol. Having shattered glass ceilings for women everywhere, it’s a fitting tribute to memorialize her legacy.\nhttps://t.co/gEINGJEJAw","date":"Wed Mar 30 16:02:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my virtual panel discussion on “Opioid Addiction And Mental Health Issues During COVID-19” on April 5th at 12pm CT. We will explore how the pandemic has given rise to mental health and addiction issues.\nRSVP here: https://t.co/hHiiJbRMVH","date":"Wed Mar 30 15:02:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Shocking but tragically unsurprising.","date":"Wed Mar 30 14:35:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today is National Doctors Day! Healthcare workers have been on the front lines of this pandemic. My Dr. Lorna Breen Health Care Provider Protection Act – which was signed into law this month –  will provide mental health and wellness support to health care workers. https://t.co/zXA765FF1l","date":"Wed Mar 30 14:02:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"https://t.co/FsD2Fb95GC","date":"Wed Mar 30 13:58:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Ted Cruz is apparently turning not being able to take a hint into… baselessly questioning the state of the executive branch? Maybe he thinks a lot of store managers he demanded to speak to weren’t really running their stores either?","date":"Wed Mar 30 13:55:17 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Everyone deserves an education.\nhttps://t.co/58QKqLVc24","date":"Wed Mar 30 13:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Friday, April 1 at 4:30pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you. \nRegister here: https://t.co/wqNppnIEyZ","date":"Wed Mar 30 11:01:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Brings back memories of when he tried to extort President Zelenskyy into manufacturing dirt on President Biden by withholding military aid. Now he’s hoping to get dirt from Putin because President Biden is leading the effort to help Ukraine fight off the Russians. Disgraceful.","date":"Wed Mar 30 02:41:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am so proud of the work that my team was able to do to reunite this wonderful family. Anna’s son was staying with his grandmother and aunt in Ukraine when Russia invaded. I’m so glad my office was able to help Anna navigate this crisis and safely reunite a mother with her son. https://t.co/xSolO9SXsM","date":"Tue Mar 29 22:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Justice Thomas must recuse himself from any cases related to the January 6th insurrection and the 2020 election that his wife tried to overturn.\nhttps://t.co/9mSef3LwKY","date":"Tue Mar 29 19:01:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"And the sun “likely” rose this morning\nhttps://t.co/FMockm7hm6","date":"Tue Mar 29 18:20:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m proud to have led this effort in the House to commemorate the incredible life and legacy of Justice Ruth Bader Ginsburg.\nhttps://t.co/dW7nt89oAK","date":"Tue Mar 29 17:30:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I signed a letter alongside all the members of the House Intelligence Committee to request that the Intelligence Community declassify information on war crimes committed by President Putin in Ukraine. These atrocities cannot go unpunished. https://t.co/t93U4ePkSE","date":"Tue Mar 29 16:20:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my virtual panel discussion on “Opioid Addiction And Mental Health Issues During COVID-19” on April 5th at 12pm CT. We will explore how the pandemic has given rise to mental health and addiction issues.\nRSVP here: https://t.co/hHiiJbRMVH","date":"Tue Mar 29 15:02:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin has committed egregious crimes against humanity in Ukraine.\nhttps://t.co/axrvEIawP2","date":"Tue Mar 29 13:03:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I'm glad that they limited the ruling to allowing only tobacco-flavored e-cigarette products. But, this is another baby step ruling by the FDA on a small player in the industry. We need action on a larger scale.\nhttps://t.co/yQItuFwLs4","date":"Tue Mar 29 12:01:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Friday, April 1 at 4:30pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you. \nRegister here: https://t.co/wqNppnIEyZ","date":"Tue Mar 29 11:01:29 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Friday, April 1 at 4:30pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you. \nRegister here: https://t.co/wqNppnIEyZ","date":"Mon Mar 28 23:01:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s egregious actions have emboldened dictators around the world. \nhttps://t.co/DGoOOBX9sG","date":"Mon Mar 28 20:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The American people must learn the truth. Those who wish to keep it under wraps must be compelled to talk. \nhttps://t.co/SCpgn1HL79","date":"Mon Mar 28 18:01:29 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Autocratic regimes everywhere will seek to benefit from Putin’s destabilizing actions in Ukraine. President Biden’s speech in Warsaw was a historic reminder of the importance of democratic values around the world.\nhttps://t.co/lA3iPe51Oz","date":"Mon Mar 28 16:02:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my virtual panel discussion on “Opioid Addiction And Mental Health Issues During COVID-19” on April 5th at 12pm CT. We will explore how the pandemic has given rise to mental health and addiction issues.\nRSVP here: https://t.co/hHiiJbRMVH https://t.co/cm8iMsQOKJ","date":"Mon Mar 28 15:02:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In order to continue the country’s transition to clean energy, we must pass legislation to incentivize the purchase of electric vehicles. \nhttps://t.co/Z9asv0lnVA","date":"Mon Mar 28 13:02:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Friday, April 1 at 4:30pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress. I look forward to speaking with you. \nRegister here:\nhttps://t.co/wqNppnIEyZ","date":"Mon Mar 28 00:00:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Every round of updated data only confirms the efficacy and safety of vaccines. If you haven’t already, get vaccinated and boosted. \nhttps://t.co/4G9tP9aXWs","date":"Sun Mar 27 19:00:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia has lost the legitimacy to remain in the G20. It was a body formed to solve global issues, not cause them.\nhttps://t.co/029UC1NEoL","date":"Sun Mar 27 16:01:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must end our reliance on fossil fuels by investing in clean energy and reducing our emissions. If we act now, we can lead the world economy in energy production and avert a climate catastrophe.\nhttps://t.co/PdiC9WpgVt","date":"Sun Mar 27 14:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must make the consequences of violating international law with the use of chemical weapons extremely clear. Such escalation in Putin’s war on the Ukrainian people cannot be tolerated. \nhttps://t.co/9EkbVvlT6X","date":"Sun Mar 27 13:01:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The backup of asylum cases has caused our immigration system to become dysfunctional. This move will help alleviate the backlog and make the path to starting a life in America more efficient. \nhttps://t.co/w70SH497ZZ","date":"Sat Mar 26 22:00:29 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The international community must hold Putin accountable for his atrocities.\nhttps://t.co/WIcqd9yMV2","date":"Sat Mar 26 20:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The brave people of Ukraine have inspired the world. We must continue to provide our support in the fight for freedom.\nhttps://t.co/EBuzJuSdNr","date":"Sat Mar 26 18:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We cannot have a two-tier justice system in America. No person is above the law. If crimes were committed, there must be repercussions.\nhttps://t.co/3ABt9fBpFB","date":"Sat Mar 26 17:01:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m glad to hear that Senator Manchin will vote to confirm Judge Jackson to the Supreme Court. This is an historic moment for our country.\nhttps://t.co/4PdQzSqTGV","date":"Sat Mar 26 16:01:11 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The longer this war continues, the stronger the determination of the Ukrainian people becomes. As they continue their fight for their sovereignty, we must provide them with all the resources necessary to repel Russia’s invasion.\nhttps://t.co/eiWvlmCYWz","date":"Sat Mar 26 14:01:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As we continue to provide support for Ukraine abroad, we must also be prepared to welcome those fleeing the war here at home. Providing this vital lifeline is truly an opportunity to live up to the ideals of America.\nhttps://t.co/Z8w4b7VWOJ","date":"Fri Mar 25 23:00:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"An amazing photo by Sarahbeth Maney of NY Times that should remind us of the importance of the Senate confirming Judge Ketanji Brown Jackson to the Supreme Court, not only to address the challenges of our time, but also because of what her legacy will mean to future generations. https://t.co/pbPzllH6WE","date":"Fri Mar 25 21:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"From more powerful storms to record droughts, the climate crisis is devastating communities across the country. I commend President Biden for addressing it with the attention it deserves. \nhttps://t.co/3Mg6ZgdW56","date":"Fri Mar 25 20:01:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Judge Jackson has proved herself over and over against baseless, partisan attacks. A brilliant legal mind and exceptional person, she will make a fine addition to the Supreme Court.\nhttps://t.co/hgDioJ6PWR","date":"Fri Mar 25 19:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The BA.2 subvariant of omicron now accounts for close to 70% of new infections in areas across the country. Be safe and please get vaccinated if you haven’t already.\nhttps://t.co/jdLyiipYzG","date":"Fri Mar 25 16:10:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I have full confidence in the United States and our European allies as they address the global consequences that stem from Russia’s war against Ukraine. Putin’s egregious actions will not shake the resolve of democracies around the world.\nhttps://t.co/BSKw6vnu8c","date":"Fri Mar 25 15:02:41 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Taliban has continued their ban on education for girls in Afghanistan. Education must truly be a right for all, despite the efforts of those who would deny it to half the world.\nhttps://t.co/svkwgwoBkM","date":"Fri Mar 25 13:02:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Oklahoma’s bill banning abortions in the state is a blatant and inhumane attack on women’s reproductive freedom. We must enshrine reproductive rights in federal law.\nhttps://t.co/i5cUjrOAv9","date":"Thu Mar 24 23:25:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"👀👀👀","date":"Thu Mar 24 21:38:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is a tragic reminder of the danger of speaking out against Putin in Russia and the importance of stopping his brtual international ambitions.\nhttps://t.co/9rvtAmdVHm","date":"Thu Mar 24 21:01:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I joined my colleagues in urging the intelligence community to actively track the egregious war crimes being committed by the Russian military. There must be consequences for the blatant disregard for international law and basic humanity.\nhttps://t.co/y1aCFvIFzb","date":"Thu Mar 24 18:01:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Like I’ve said before, COVID anywhere is a threat to everyone everywhere. We have to get shots in arms all across the globe to prevent future variants from popping up.\nhttps://t.co/xDWsPgmgzW","date":"Thu Mar 24 14:02:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Last Friday, President Biden signed the bipartisan Dr. Lorna Breen Health Care Provider Protection Act that I helped lead into law. We’re going to make sure that none of our health care heroes are left behind.\nhttps://t.co/yPOcPNPpMY","date":"Wed Mar 23 23:00:55 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"👇🏾","date":"Wed Mar 23 22:35:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am deeply saddened by the passing of Madeleine Albright. As a trailblazer for women everywhere and our first female Secretary of State, she committed her life to service to America. She will be deeply missed.\nhttps://t.co/jxaFKulask","date":"Wed Mar 23 19:30:11 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin continues to commit atrocity after atrocity. This senseless violence must end now.\nhttps://t.co/O2Wy97ClSc","date":"Wed Mar 23 19:01:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Thank you to Dr. Breen’s family and my colleagues in Congress for helping lead us to the momentous day of the Dr. Lorna Breen Health Care Provider Protection Act being signed into law. Proud to support our healthcare heroes. https://t.co/YpqqqoCghp","date":"Wed Mar 23 18:02:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A conviction as devoid of credibility or legitimate basis as Putin’s reasons for invading Ukraine.\nhttps://t.co/tqzzxgmcye","date":"Wed Mar 23 17:02:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Yesterday’s questioning session only confirmed the high opinion of Judge Brown Jackson that I had previously held. With her qualifications and temperament, she will make a tremendous addition to the Supreme Court.\nhttps://t.co/viQcrRXb1x","date":"Wed Mar 23 16:55:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Yet another reason why we need to monitor gray zone activity that puts us all at risk.\nhttps://t.co/MXTVwXU0Gj","date":"Wed Mar 23 15:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Ukrainian people continue to stand up against the tyranny of Putin’s forces. In the face of destruction and terror, they refuse to surrender in Mariupol.\nhttps://t.co/7ShjZycNqg","date":"Wed Mar 23 13:02:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Ukrainian people continue to stand strong in the face of Putin’s war. https://t.co/Oz4sQtWcxm","date":"Tue Mar 22 23:00:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Guess who's not coming to dinner...","date":"Tue Mar 22 21:08:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must ensure Taiwan is supplied with the necessary resources to defend itself in case the People’s Republic of China feels emboldened by watching Putin’s war on the Ukrainian people.\nhttps://t.co/wiLmyEK27A","date":"Tue Mar 22 20:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Judge Jackson is the first Black woman nominated to the Supreme Court, but she certainly won’t be the last.\nhttps://t.co/3hWCWurwj6","date":"Tue Mar 22 18:01:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Ukrainian people have made it clear that they will never surrender to the Russian soldiers cruelly taking the lives of their family and friends. The only way to end this war is with the full withdrawal of Putin’s forces\nhttps://t.co/FNuL4gogOq","date":"Tue Mar 22 17:05:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I wish I was surprised…","date":"Tue Mar 22 16:31:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I wish to offer my condolences to the families of marines Matthew Tomkiewicz, Ross Reynolds, James Speedy, and Jacob Moore who lost their lives during a training mission. These men devoted their lives to service and our thoughts are with their loved ones.\nhttps://t.co/RKNqHVPnD8","date":"Tue Mar 22 13:02:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"There is simply no bottom in the efforts of many to end women’s medical control over their own bodies. The Senate must pass the Women’s Health Protection Act and protect women’s right to reproductive freedom.\nhttps://t.co/GWnNoOIOMV","date":"Mon Mar 21 19:01:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Last Friday, President Biden signed our Dr. Lorna Breen Healthcare Provider Protection Act into law. This legislation will help provide our health care heroes with more mental wellness support. https://t.co/sHWVUKqcpw","date":"Mon Mar 21 18:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As the Senate begins its constitutional duty to advise and consent on Judge Brown Jackson, I have full confidence that she will be rightly confirmed to the Supreme Court of the United States for the benefit of our nation.\nhttps://t.co/qEQdUgkHXd","date":"Mon Mar 21 17:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was deeply saddened to hear of the passing of Congressman Don Young. A public servant who devoted his life to serving the people of Alaska in Congress, he will be deeply missed by his colleagues and constituents.\nhttps://t.co/vcmFCZc55L","date":"Mon Mar 21 16:02:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s invasion has stalled and he now seeks to demoralize the brave Ukrainian people by bombing shelters for innocent children. The world must hold him accountable or risk the chance of more horrific war crimes.\nhttps://t.co/HZmZ7k4uwj","date":"Mon Mar 21 11:01:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Voter suppression bills were passed all across the country last year. As a result, we are seeing the direct disenfranchisement of thousands of American voters.\nhttps://t.co/n958QUZV2M","date":"Sun Mar 20 23:00:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Ukraine has done a fantastic job of combatting Russian disinformation in real-time. Unfortunately, we are constantly reminded of how far Putin will go to lie to the world.\nhttps://t.co/HnpLfBJpcf","date":"Sun Mar 20 19:00:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia will stop at nothing to distract and blame others for Putin’s war.\nhttps://t.co/f1z3uzqXJi","date":"Sun Mar 20 16:01:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While cases may be declining across the country, additional funding for therapeutics and global vaccine efforts are the only way to truly put the pandemic behind us once and for all.\nhttps://t.co/OOLWPTdPQ7","date":"Sun Mar 20 13:01:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I commend the Ukrainian people for standing up to tyranny. Putin must stop his war now.\nhttps://t.co/Pulkvx1nck","date":"Sat Mar 19 22:00:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to join President Biden at the White House as he signed the Dr. Lorna Breen Healthcare Provider Protection Act, which I co-led, into law to expand mental wellness resources for healthcare professionals. https://t.co/Nwv5C84ACZ","date":"Sat Mar 19 19:27:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Judge Ketanji Brown Jackson is exceptionally qualified and will be confirmed regardless of the baseless opposition to her nomination. I look forward to seeing her take her place on the Supreme Court and help shape the future of this country.\nhttps://t.co/AUtNLtSP5B","date":"Sat Mar 19 18:00:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"COVID anywhere is a threat to everyone everywhere.\nhttps://t.co/WX7y0aKPRx","date":"Sat Mar 19 16:30:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We have the resources and the reasons, so let’s ensure that the whole globe gets vaccinated.\nhttps://t.co/rAF6kNWNQx","date":"Sat Mar 19 14:01:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Let’s go Illinois! The Krishnamoorthi house is cheering you on tonight!","date":"Fri Mar 18 22:50:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Everyone should read this powerful, important piece by @minjinlee11 on the fear Asian Americans live with https://t.co/FSOvxIqeze","date":"Fri Mar 18 22:36:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Great to welcome our new Legislative Correspondent in our DC office this week. Welcome to the team Ashley! https://t.co/LctVaDwRLX","date":"Fri Mar 18 22:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This week, the COVID-19 Global Vaccination Caucus sent a letter to Congressional leadership calling for the inclusion of $5 billion for global COVID response funding in any supplemental bill. We need to end this pandemic now. https://t.co/NLhcIHDxgY","date":"Fri Mar 18 20:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was great to join the American Coalition for Syria today to commemorate the 11th anniversary of the Syrian revolution. Assad’s crimes against humanity must never be forgotten, just as the memory of his victims and the dream of a free Syria must live on. https://t.co/duIIhtNgWU","date":"Fri Mar 18 19:01:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The United States will use every tool available to punish Russia for its actions. Any nation that seeks to aid Putin in his war or with sanctions relief will also suffer the consequences.\nhttps://t.co/Kt0E1dFHwq","date":"Fri Mar 18 18:01:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is the kind of disinformation we’re facing. There’s a digital battlefield, too.\nhttps://t.co/eNpp6w0k0i","date":"Fri Mar 18 17:02:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Let’s go Loyola! My wife is a Rambler for life, so our house is all fans. Let’s make our hero Sister Jean proud today! https://t.co/vvNs1XlsHD","date":"Fri Mar 18 16:15:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Glad to see international cooperation to hold Russian oligarchs and Putin accountable.\nhttps://t.co/XWClpWJdNl","date":"Fri Mar 18 16:05:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"After President Zelenskyy’s speech to Congress, he received a bipartisan standing ovation. He is a hero to his country, and America will continue to support his government and the citizens of Ukraine as they repel this barbaric Russian invasion. https://t.co/Je1Z9iDVQt","date":"Fri Mar 18 15:00:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I have full confidence that President Biden will make it clear to President Xi that any effort to help Russia in their war or to evade the consequences that stem from it will lead to serious repercussions for China.\nhttps://t.co/pB11scm6Ja","date":"Fri Mar 18 14:45:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Holi! Today marks the beginning of the festival of love. I cannot wait to see all of the colors. https://t.co/ZyKJ85oZs2","date":"Fri Mar 18 13:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was great that my Tapestry of staff and I were able to meet Carole King this week! https://t.co/KUCkO1xe4o","date":"Thu Mar 17 23:40:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This sort of language is unacceptable. We need to #StopAsianHate wherever it rears its ugly head.\nhttps://t.co/a47DdCnXt7","date":"Thu Mar 17 22:00:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In case anyone still needs this cleared up:\nAdmiral Rachel L. Levine, MD is a woman.\nKen Paxton is a transphobic bigot and bully. https://t.co/YtIgSq9osT","date":"Thu Mar 17 21:04:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We take today to celebrate the resilience of the Jewish people over persecution. Happy Purim to all who celebrate! https://t.co/aoF3uuGclx","date":"Thu Mar 17 18:01:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Here we go, best of luck to our Illinois teams and all these schools throughout the country! https://t.co/jzDyVLpJW9","date":"Thu Mar 17 16:50:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The U.S. must continue to provide Ukraine with the vital resources it requires. That's why I've introduced the bipartisan SUPPORT Act, making it United States policy to support Ukrainian insurgents opposing the Russian invasion. Read my op-ed here:\nhttps://t.co/cGegaV1JvR","date":"Thu Mar 17 16:10:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As the co-author of the bipartisan Strengthening Career and Technical Education for the 21st Century Act -- the largest reform of skills-based education in more than 12 years -- I spoke on the House floor alongside @RepPfluger to commend Dr. Gregory Williams at Odessa College. https://t.co/U5bIXXMO7U","date":"Thu Mar 17 15:00:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Saint Patrick's Day! I would like to wish you all a safe and happy celebration! https://t.co/JLYbiyZsFG","date":"Thu Mar 17 14:25:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While I support negotiations as the only path to peace, a peace that allows Russia to determine Ukraine’s allies and agreements is dangerous to the free and independent Ukrainian people.\nhttps://t.co/9EiQQpYK9H","date":"Thu Mar 17 13:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While cases are continuing to decrease in America, countries abroad are seeing spikes. To defend against any future waves of COVID-19, get vaccinated and protect yourself from a serious illness.\nhttps://t.co/2dsOsytHbI","date":"Wed Mar 16 22:01:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to hear President Zelenskyy’s address this morning. We are committed to getting Ukraine the support they need to defend themselves from Russian invaders.\nhttps://t.co/fT5OSb40PN","date":"Wed Mar 16 21:01:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As Carole King said during our Oversight Committee hearing, “politics matters.” When it comes to climate change and the issue of catastrophic wildfires, I hope people are educating themselves and actively engaging in their communities. https://t.co/KhQMoxyAvj","date":"Wed Mar 16 20:15:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Unlike the previous Administration, I don’t think those Putin has targeted with these sanctions are concerned about their future business ventures in Russia.\nhttps://t.co/eDOAUQOybz","date":"Wed Mar 16 19:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A year ago today, a shooter targeted Asian American women, opening fire on three spas in Atlanta and tragically killing eight innocent people. In their memory, we must all continue to combat Asian hate wherever we encounter it. https://t.co/G4sszUIpYN","date":"Wed Mar 16 18:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I would like to commend all the brave Russian people like Marina Ovsyannikova who are fighting against Putin’s propaganda and lies. A war criminal is seeking to pull the wool over the eyes of his people, but many refuse to allow him to succeed.\nhttps://t.co/EkvZZYebHK","date":"Wed Mar 16 17:02:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Face of Freedom https://t.co/OsnuRV94cO","date":"Wed Mar 16 14:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It takes an incredible amount of bravery to stand up against tyranny like Marina Ovsyannikova did. Thank you for your courage.\nhttps://t.co/DCN8KsFi72","date":"Wed Mar 16 14:02:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Let’s ensure that Ukraine’s forces have every tool at their disposal to continue to defend themselves from Putin’s invasion. \nhttps://t.co/2rP9wL4Wnb","date":"Tue Mar 15 23:15:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"You’ve likely already seen the misinformation and disinformation campaigns surrounding Russia’s war in Ukraine. Here’s a handy guide for spotting this fake information for yourself.\nhttps://t.co/d557UrUcrw","date":"Tue Mar 15 20:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy birthday to the late champion for equality, Justice Ruth Bader Ginsburg! In honor of her life, here’s one of my favorite quotes: “Real change, enduring change, happens one step at a time.”","date":"Tue Mar 15 19:01:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today is #EqualPayDay when we reflect on and continue to work to bridge the gap between men and women. Equal work deserves equal pay.","date":"Tue Mar 15 18:30:11 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to meet Carole King, one of our greatest songwriters and a leading American activist. We discussed the dangers of climate change and how we can combat wildfires &amp; protect our environment. I'm proud to work on these issues, and I thank Carole King for her advocacy. https://t.co/OYWDCkEQe8","date":"Tue Mar 15 17:02:12 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I wish this were remotely surprising…\nhttps://t.co/ouAtjNXGz1","date":"Tue Mar 15 16:02:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In the FY22 spending package, I was proud to have several of my bills and legislative priorities included to help families, our national security, and our economy. https://t.co/LnKATsO6SN","date":"Tue Mar 15 13:02:37 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am outraged by the indiscriminate Russian aggression that claimed the life of U.S. reporter Brent Renaud. My thoughts are with his family during this difficult time. We must find an end to this violence before more innocent lives are taken.\nhttps://t.co/qSQL8AwYs0","date":"Mon Mar 14 23:00:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am wishing the former President a speedy recovery. If you haven’t already, please get vaccinated and boosted, like President Obama, to protect yourself against a serious case of COVID-19.\nhttps://t.co/bMudWiTdwg","date":"Mon Mar 14 19:15:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s my pleasure to congratulate Bernie Bluestein, a constituent of mine, on receiving the Congressional Gold Medal! I'm happy to see veterans like Bernie receive recognition for the sacrifices they made to keep America safe. Congratulations Bernie!\nhttps://t.co/NXsGe6PnC9","date":"Mon Mar 14 18:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Make no mistake, the United States will defend every single inch of NATO territory should Russia make the mistake of escalating its aggression across Europe.\nhttps://t.co/OaQ9vd8Jm7","date":"Mon Mar 14 17:02:20 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to speak to the Northwest Suburban Teachers Union to discuss the funding that the FY22 spending bill provided schools as well as my other work to support educators. To all the teachers sacrificing and working everyday on behalf of their students, we say thank you. https://t.co/GyubLKELHu","date":"Mon Mar 14 14:30:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Let’s hold these criminals responsible for stealing COVID-19 aid that could have been used to help out struggling families and businesses.\nhttps://t.co/WEgsMM64EZ","date":"Sun Mar 13 19:00:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to vote in favor of the bipartisan government funding package -- preventing a government shutdown, helping the Ukrainian people, and supporting American families.\nhttps://t.co/k5gbqZblGs","date":"Sun Mar 13 15:01:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This week, the House passed my GRAY ZONE Act through the FY22 Appropriations Package to combat tactics including the disinformation campaigns that autocrats like Putin use regularly.\nhttps://t.co/4VHpbZoFxR","date":"Sat Mar 12 23:20:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Now is the time to push for renewable energy sources.\nhttps://t.co/siNCg82eWr","date":"Sat Mar 12 22:00:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Next, he’ll be asking supporters to buy a bridge he’s selling.\nhttps://t.co/nJBQkcQomO","date":"Sat Mar 12 19:00:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Every continent is experiencing the devastating effects of climate change. When it comes to tackling rising temperatures and tides, inaction is not an option.\nhttps://t.co/34u6MculQn","date":"Sat Mar 12 15:01:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I stand with the brave Russian people taking to the streets to protest against Putin and his war of choice. Their bravery against a vile dictator is crucial in the world’s collective effort to achieve peace.\nhttps://t.co/PUBJL7tbcg","date":"Fri Mar 11 21:05:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Day by day, more companies are leaving Russia and freezing them out of the global economy. Putin has brought this economic collapse upon himself and his people. He must seek a diplomatic off-ramp to his war in Ukraine.\nhttps://t.co/b6RQiGWDRS","date":"Fri Mar 11 18:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Always great to chat with our interns and see them working hard in our DC office! https://t.co/fIObNDr25o","date":"Fri Mar 11 15:01:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"President Zelenskyy is leading the Ukrainian people in a struggle for the life of their nation. He is risking his life each day, sharing the sacrifices of his people, fighting instead of fleeing. Volodymyr Zelenskyy is no thug: he is a hero and a patriot.\nhttps://t.co/fRd9SL9Dha","date":"Fri Mar 11 00:34:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Nothing is below Vladimir Putin.\nhttps://t.co/bNG0jdBDtu","date":"Thu Mar 10 23:00:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We stand with Ukraine and with democracy. https://t.co/OGAO8EDcSz","date":"Thu Mar 10 22:01:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This long-overdue passage of the Emmett Till Anti-Lynching Act is a reminder of how far we come in our fight for equality. While we can appreciate this achievement, we can’t lose sight of how far we still have to go.\nhttps://t.co/eVKFIps8PU","date":"Thu Mar 10 21:00:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The truth is not malleable. Putin will continue to lie about his malicious actions in Ukraine, but the world will see through it. The taking of innocent lives cannot be swept under the rug.\nhttps://t.co/rSrLHvyuVJ","date":"Thu Mar 10 20:01:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Ukrainian people are doing an incredible job standing up to Putin's tyranny, but it's up to us to ensure that they have every tool they need to do so. https://t.co/FHRbvtTq1J","date":"Thu Mar 10 19:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to vote for the reauthorization of the bipartisan Violence Against Women Act as part of the government funding bill. Left expired for too many years, women will finally have these critical protections restored.\nhttps://t.co/diUFQIYM6g","date":"Thu Mar 10 18:30:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We’re going to make sure that big tobacco and vaping companies can’t continue to get our children hooked on e-cigarettes. I’m proud that my provision to close the synthetic nicotine loophole  was included in the omnibus.\nhttps://t.co/wSGW5veki6","date":"Thu Mar 10 17:01:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"1 million of the 2 million Ukrainian refugees are children. This is the humanitarian crisis Putin has created, and the world is coming together to help address.\nhttps://t.co/DnPHvYoYGc","date":"Thu Mar 10 16:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am overjoyed to see this long-overdue bill head to the President’s desk. The American people rely on the Postal Service to vote, receive medication, and pay bills. Increasing its efficiency and financial stability will benefit the whole country.\nhttps://t.co/lfuuw3QSXR","date":"Thu Mar 10 13:01:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to lead a bipartisan letter in support of increasing global vaccine funding. We have seen the damage that variants can inflict. We cannot fully end the pandemic while billions remain unvaccinated around the world.\nhttps://t.co/TzJs41kbG0","date":"Wed Mar 09 23:00:37 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Earlier this week, I joined with my colleagues in urging President Biden to continue working with NATO to quickly supply usable military aircraft to Ukraine. While the deal is still in progress, we need to get them those jets.\nhttps://t.co/lBskyLh15z","date":"Wed Mar 09 22:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Bombing a children’s hospital during a ceasefire – another reminder of what the Ukrainians are up against and why we must help them.\nhttps://t.co/KpzwgrRfR0","date":"Wed Mar 09 20:05:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Great to meet with the Illinois School Nutrition Association to discuss the importance of nutritional school lunches for children and federal reimbursements for school meals to ensure that no child goes hungry. https://t.co/9X5ucMqgEp","date":"Wed Mar 09 18:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Now that the specifics have been finalized, we must move with urgency to prevent a government shutdown and provide vital aid for the Ukrainian people.\nhttps://t.co/aeFFpsOljR","date":"Wed Mar 09 17:55:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In the Intelligence Committee hearing, we learned that Ukraine is exceeding expectations of military response, but Kyiv needs more help from NATO. I’m working to pass my SUPPORT Act and to ensure we provide the Ukrainians the aid they need. https://t.co/t5MK3442zl","date":"Wed Mar 09 16:45:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This week is National Consumer Protection Week. As Chairman of the Oversight Subcommittee on Economic and Consumer Policy, I fight every single day to protect families and provide a check on corporations. https://t.co/GxYhw7l8El","date":"Tue Mar 08 22:01:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Ukrainian civilians deserve the chance to evacuate.\nhttps://t.co/TUqdbPuW1s","date":"Tue Mar 08 21:01:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Legislative inaction continues to rob Americans of the lives of their family, friends, and neighbors. Congress must step up and pass comprehensive legislation to combat the epidemic of gun violence. \nhttps://t.co/PW6AxsKCzv","date":"Tue Mar 08 19:30:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In today’s Intelligence Committee hearing, I questioned Intelligence Community leaders on the situation in Ukraine including President Putin’s popular support at home, my SUPPORT Act’s outline of a possible Ukraine insurgency effort, and increasing U.S. aid to the people of Kyiv. https://t.co/Wnut94pzav","date":"Tue Mar 08 18:45:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"From Harriet Tubman to Susan B. Anthony, today we celebrate mothers, daughters, sisters, and friends around the world. Their long fight for true equality remains ongoing, but we are committed to making it a reality. Happy International Women's Day! https://t.co/PVwcFfQtNw","date":"Tue Mar 08 16:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s so crazy this still needs to be said, but it does…\nhttps://t.co/MECUlttrRp","date":"Tue Mar 08 15:15:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I fully support Congressional efforts to send more aid to Ukraine. Putin needs to see that the world’s democracies stand together against his brutal actions. https://t.co/MZ3zFCP3Kl","date":"Tue Mar 08 14:00:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I commend our allies in Europe who join us in continuing to supply Ukraine with military equipment as we work to transfer it as quickly as possible.\nhttps://t.co/djTS4s57Jh","date":"Tue Mar 08 13:01:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Great to meet with the International Association of Firefighters today. These first responders are true heroes who risk their lives everyday to protect their communities. https://t.co/YelH95YL8W","date":"Tue Mar 08 00:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While any increased funding is a step in the right direction, we are still short of the funding to finally end the COVID-19 pandemic across the world. To protect ourselves, we must step up and help protect everyone.\nhttps://t.co/HpPuABhkFR","date":"Mon Mar 07 23:00:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Even as the heartbreaking damage and suffering rapidly continues, the world must not allow a chance at peace to escape. I applaud our allies from Israel to France in their efforts to convince Putin his war of choice must end.\nhttps://t.co/hdEBgt2PN6","date":"Mon Mar 07 22:01:13 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As our economy continues to rebound, I am very encouraged by this month's job numbers. However, we must continue to confront rising prices and protect hard-working Americans.\nhttps://t.co/chkKysoPv4","date":"Mon Mar 07 20:01:53 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This statement is reckless beyond belief, but somehow so unsurprising, given the source.\nhttps://t.co/22hIyhspjq","date":"Mon Mar 07 19:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"President Zelenskyy addressed lawmakers this weekend to request that Congress provide additional aid to Ukraine. Ukrainians are defending their country from an unwarranted Russian attack, and I stand behind them. https://t.co/rDlYhHDq0s","date":"Mon Mar 07 18:00:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Everyone who has been enabling Putin’s delusions must be punished. \nhttps://t.co/8idaOkrYvD","date":"Mon Mar 07 17:01:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"57 years ago today, civil rights activist John Lewis crossed the Edmund Pettus Bridge in Selma. We must work tirelessly to guarantee the right to vote. Anything less would be an insult to the legacy of one the most honorable men to ever serve in Congress. https://t.co/YJoDWGGAlW","date":"Mon Mar 07 15:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"With the revelations from the January 6th Committee confirming my fears, I urge Attorney General Garland to consult the facts of the case and move forward with appropriate steps.\nhttps://t.co/vRNtQZCHdd","date":"Mon Mar 07 00:05:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The world is watching the results of Putin’s aggression, and they will not stand for it.\nhttps://t.co/biObJgHPhy","date":"Sun Mar 06 22:00:36 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Trans youth and their families have been forced to endure so much. This cruel and demeaning investigation is nothing but an attack by the Texas Department of Family and Protective Services on parents supporting their children.\nhttps://t.co/CAwwU3Fo49","date":"Sun Mar 06 20:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"China’s knowledge of Russia’s plan to invade Ukraine and lack of condemnation is unacceptable but all too predictable.\nhttps://t.co/2Naf52fuYn","date":"Sun Mar 06 18:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin has isolated himself and his country from the rest of the world. Companies are severing ties, and it will contribute to the increasing economic collapse in Russia.\nhttps://t.co/7Fi2CWDbgQ","date":"Sun Mar 06 16:01:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must support ALL refugees fleeing Ukraine, regardless of race. \nhttps://t.co/VB88thdz3X","date":"Sun Mar 06 15:00:47 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Everyone who believes in upholding human rights condemns the brutal, unprovoked and unjustified Russian occupation of Ukraine.\nhttps://t.co/vvt0anhcRf","date":"Sat Mar 05 23:15:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In 2020, the number of fatal car crashes increased by 6.8% -- the highest fatality rate since 2007. We need to pass my Booster Seat Safety Act to protect our children and my SAFE TO DRIVE Act to protect all drivers from distracted driving.\nhttps://t.co/hzwyuTusZa","date":"Sat Mar 05 21:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Following through with our crippling sanctions against Russia is essential to supporting our allies in the Ukraine and holding Putin accountable. We do not make empty threats.\nhttps://t.co/R1JyUL8GCR","date":"Sat Mar 05 20:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Belarus was used as a staging ground for Putin’s invasion and missile launches before the country entered the war. These sanctions are a serious reminder that whoever sides with Russia and its unprovoked aggression will face serious consequences.\nhttps://t.co/JUYdVP0DFP","date":"Sat Mar 05 19:00:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The international community must continue to provide Ukraine and its courageous president with military resources to defend themselves and protect their government officials as they repel Russia’s invasion.\nhttps://t.co/XAZ5tZSBOX","date":"Sat Mar 05 15:00:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As we prepare for possible escalation in Ukraine, we must be ready to expand our support for the brave people of Ukraine. \nhttps://t.co/aPDXiA3arp","date":"Sat Mar 05 13:00:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The international community is speaking with a clear voice. Russia’s unprovoked invasion of a sovereign neighbor must come to an end with the removal of Russian troops and military vehicles.\nhttps://t.co/mQa8fUFE44","date":"Sat Mar 05 00:01:23 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s invasion was an attack on democracy itself. As a result, millions of people who believe in freedom around the world have rallied together behind our ideals to support the Ukrainian people’s defense of their country.\nhttps://t.co/gjLT4MHVMf","date":"Fri Mar 04 22:01:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must be prepared to continue to support our allies in Ukraine, and that is why I introduced the bipartisan SUPPORT Act to ensure we’re prepared to support a Ukrainian insurgency if it becomes necessary to drive back Putin’s forces.\nhttps://t.co/pDzp1H0s0A","date":"Fri Mar 04 21:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s violations of human rights will be punished on the world stage.\nhttps://t.co/5sBZutjTli","date":"Fri Mar 04 20:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"👇🏾","date":"Fri Mar 04 20:12:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must uphold our commitment to serve those who risked their lives for America’s security. The Honoring Our Pact Act will provide millions of veterans exposed to toxins with expedited healthcare. This is long overdue and will provide much-needed relief.\nhttps://t.co/n4M68xBZPf","date":"Fri Mar 04 19:01:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While I am relieved to hear the fire has been extinguished, the dangerous shelling of civilian and energy infrastructure by Russia needs to end. We must continue to make Putin pay for every escalatory step he takes.\nhttps://t.co/eyfuPgUsvZ","date":"Fri Mar 04 18:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Thank god Ukrainian forces intercepted the assassins in time. This is a disturbing reminder of how precarious everything in Ukraine is right now and how important it is for us to continue sending aid to the Ukrainian people.\nhttps://t.co/VKBGCOAfVm","date":"Fri Mar 04 17:55:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Mass displacement is devastating, and we must all do our part to assist Ukrainian refugees. \nhttps://t.co/DsP2sMww5h","date":"Fri Mar 04 16:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Congress must act on the events occurring in Ukraine. We must supply them with weapons, supplies, and intelligence. These brave people are fighting for their freedom, and they need our support.\nhttps://t.co/qVlL75hhgx","date":"Fri Mar 04 15:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"When Swiss neutrality decides it needs to make an exception for you…\nhttps://t.co/6gbZH4RmLO","date":"Fri Mar 04 14:03:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Great to meet with the American Council of Engineering Companies to discuss the amazing benefits and opportunities that the Infrastructure Investment and Jobs Act will bring to every state. https://t.co/oHOfPNKecu","date":"Fri Mar 04 13:01:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Further escalation of violence in Ukraine will accomplish nothing for Russia except leaving more people dead.\nhttps://t.co/2VhBASXAiI","date":"Thu Mar 03 22:01:26 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia’s targeting of civilians in Ukraine is inexcusable and must be punished. \nhttps://t.co/7WZf65t8S9","date":"Thu Mar 03 21:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As Russia continues to resort to increasingly barbaric tactics in the invasion of Ukraine, we will continue to hit its leadership with increasingly crippling sanctions.\nhttps://t.co/oyEcaDzv7S","date":"Thu Mar 03 20:02:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Access to quality affordable childcare should be a basic right. We should be making it easier for mothers to raise children and re-enter the workforce, not hitting them with unjust financial burdens. \nhttps://t.co/JalTxTMFGv","date":"Thu Mar 03 19:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall today at 6pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress.\nRegister here: https://t.co/k6ukeB3ZVH","date":"Thu Mar 03 18:02:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must ease supply chain bottlenecks through desperately-needed upgrades and expansions. This crucial investment of $450 million is the most funding to upgrade our ports in American history.\nhttps://t.co/LF1cekuBHM","date":"Thu Mar 03 17:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Bipartisan Infrastructure Investment and Jobs Act will help Illinois build an electric vehicle future that protects our community and gives us the tools to combat a changing climate. https://t.co/jraGK0nejq","date":"Thu Mar 03 16:10:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s decision to unjustifiably declare war has had devastating repercussions for Ukraine, Europe, and the rest of the world. Democracies have stepped up and will continue to hold him accountable for the results of that choice.\nhttps://t.co/DsP2sMeUGH","date":"Thu Mar 03 15:01:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The passage of the Emmett Till Antilynching Act is an historic achievement in the ongoing fight against racism. \nhttps://t.co/y5Ao2WaxGn","date":"Thu Mar 03 14:02:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Somehow, this is as shocking as it is unsurprising. https://t.co/HsXvF3TKwL","date":"Thu Mar 03 02:05:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"During our Select Subcommittee on COVID Crisis hearing today, we discussed the importance of child care not just to assist working parents but also as an investment in our economy. https://t.co/3usryuhkjv","date":"Thu Mar 03 01:10:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Courage takes many forms and all of them will be needed to end this war.","date":"Thu Mar 03 00:38:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"To quote Ukraine’s ambassador to the UN, “there is no purgatory for war criminals.”\nhttps://t.co/NFe4UG097f","date":"Thu Mar 03 00:01:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, I sent letters to the top ocean freight carriers requesting information about their price increases and exorbitant fees in excess of their costs. We must learn how these actions contributed to inflation, hurting American consumers and businesses.\nhttps://t.co/2395Yd5dWN","date":"Wed Mar 02 23:20:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As democracies supply Ukraine with essential assistance and aid to repel the Russian attack, Americans are proudly showing solidarity with the brave people of Ukraine. I was proud to wear this blue &amp; yellow pin to the State of the Union.\nhttps://t.co/70TnwPUpfE","date":"Wed Mar 02 22:01:22 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"From bombing civilian areas to the alleged use of cluster munitions, Russia's actions are heinous and reprehensible. These acts must be investigated by the International Criminal Court. \nhttps://t.co/j9pU8gZJ1g","date":"Wed Mar 02 21:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Glad to see Senator Romney speaking out against Americans sympathizing with Putin while advocating for forceful, bipartisan support for the people of Ukraine.\nhttps://t.co/urMsplMtVd","date":"Wed Mar 02 20:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Another stirring reminder of the situation on the ground and the contrast between President Zelenskyy and Vladimir Putin.","date":"Wed Mar 02 19:09:21 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As they should have already.\nhttps://t.co/oHCgAAMoke","date":"Wed Mar 02 19:01:11 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This Women’s History Month, I was proud to witness Speaker Pelosi and Vice President Harris make history. \nhttps://t.co/oGeveTfc35","date":"Wed Mar 02 18:05:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"During Tuesday's Oversight Committee hearing, I questioned Governor Pritzker on the American Rescue Plan's contributions to his success in leading Illinois' successful pandemic recovery.\nhttps://t.co/IseUWhX6xU","date":"Wed Mar 02 17:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"President Biden’s State of the Union address was a unifying moment. From our response to the Russian invasion of Ukraine to lowering prescription drug prices, the President has shown his leadership and his commitment to protecting democracy and helping Americans. https://t.co/Y5QgrKNEx2","date":"Wed Mar 02 16:15:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My statement calling on UN Member States to vote in favor of resolution condemning Russian invasion of Ukraine. https://t.co/2IP0ggGvIj","date":"Wed Mar 02 15:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Thursday, March 3 at 6pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress.\nRegister here: https://t.co/k6ukeB3ZVH","date":"Wed Mar 02 12:01:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"At the State of the Union tonight, I will be wearing a blue and yellow pin to honor Ukraine and the bravery of the Ukrainian citizens, military, and government as they fight off a brutal dictator. https://t.co/fkDtSneZSC","date":"Wed Mar 02 01:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m looking forward to attending President Biden’s State of the Union address tonight &amp; hearing him discuss the situation in Ukraine, the economy, and pandemic recovery. Tonight, we'll hear his vision for the future of America &amp; his efforts to improve the lives of every citizen. https://t.co/k1CB4kmDae","date":"Wed Mar 02 00:35:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Dr. Ngozi Ezike has already gone down in history as a medical hero in directing Illinois' pandemic response. I am grateful for her service and leadership.\nhttps://t.co/cJm3rII9Za","date":"Wed Mar 02 00:01:29 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am extremely disappointed with the Postmaster General Louis DeJoy’s decision to move forward with a near-fully gas-powered fleet of vehicles instead of more energy efficient and effective vehicles that won’t contribute to our carbon burden.\nhttps://t.co/y6F34cT2mT","date":"Tue Mar 01 23:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was an honor to host @GovPritzker at our Oversight Committee hearing to discuss the benefits the American Rescue Plan has brought to our state. Governor Pritzker has done a tremendous job balancing Illinois’ budget and implementing programs such as Connect Illinois. https://t.co/00udO4IP98","date":"Tue Mar 01 21:10:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today I joined @OversightDems and @GovPritzker in examining the American Rescue Plan’s success on the local and state levels. The ARP is setting the American economy on a path of recovery from the COVID-19 pandemic and supporting unprecedented growth.  \nhttps://t.co/RFr5KzfTtr","date":"Tue Mar 01 20:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to speak in steadfast support of Ukraine and its people this weekend. Beyond simply showing solidarity, we must do everything in our power to make sure Ukraine has the resources necessary to repel this Russian invasion.\nhttps://t.co/JG1TrEHxvF","date":"Tue Mar 01 19:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We have made great strides in our effort to vaccinate the world, but it’s not enough. The window is closing to expand the resources necessary to prevent future variants from arising abroad and threatening us here at home.\nhttps://t.co/wueW4A00s3","date":"Tue Mar 01 16:03:17 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Our unprecedented sanctions against Russia have already inflicted pain on Putin and his oligarchs. \nhttps://t.co/B1A8UYz9jt","date":"Tue Mar 01 15:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Ukrainian President Zelenskyy has earned all our respect, admiration, and support for his strength against the tyranny of Putin. https://t.co/Hr6QVU2leb","date":"Tue Mar 01 14:02:39 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Thursday, March 3 at 6pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress.\nRegister here: https://t.co/k6ukeB3ZVH","date":"Tue Mar 01 12:01:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am confident the Biden Administration will use all necessary diplomatic force to hold Putin accountable without allowing the situation to spiral into such a disturbing state.\nhttps://t.co/LID8ZiFxiF","date":"Mon Feb 28 22:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Photos of Vladimir Putin and President Zelenskyy with their respective defense department heads. https://t.co/h7M9pGTdIO","date":"Mon Feb 28 20:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I stand with our Ukrainian brothers and sisters in their fight against authoritarianism, and so does our country. Slava Ukraini! https://t.co/llTvBJZRaD","date":"Mon Feb 28 18:00:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join me for my Zoom Town Hall on Thursday, March 3 at 6pm CT. I always appreciate hearing from constituents and answering questions on the work happening in Congress.\nRegister here: https://t.co/k6ukeB3ZVH","date":"Mon Feb 28 17:01:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to join UCCA in Chicago in support of the Ukrainian people in their fight against Vladimir Putin’s unjustifiable invasion. I commend the bravery of Ukrainian forces and President Zelenskyy as they fight off this dictator. The U.S. will continue to support them. https://t.co/M7xCwyWghW","date":"Mon Feb 28 15:40:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must ensure that Vladimir Putin pays the price for the destruction and loss of life he has caused.\nhttps://t.co/XG0TweiIt4","date":"Mon Feb 28 00:05:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The bravery of the Ukrainian people and their leader in the face of Russian militarism is on full display for all the world. We must continue to provide Ukraine with the supplies it needs.\nhttps://t.co/WJPjcuokYI","date":"Sun Feb 27 20:05:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The sanctions introduced by President Biden were a necessary and appropriate response to Russia’s invasion of Ukraine, and the world’s democracies agree.\nhttps://t.co/UNY9mjppCy","date":"Sun Feb 27 16:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"“The enduring failure of Ukrainian democracy has been the gap between the code of behavior that applies to the elite and the one that the rest of the country must follow... By staying put, Zelensky has erased this gap.”","date":"Sun Feb 27 01:22:45 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The world’s democracies stand with the people of Ukraine.","date":"Sat Feb 26 23:53:38 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin’s oligarchs must face the consequences of his brutal, unnecessary war, and now they will.","date":"Sat Feb 26 23:46:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A disturbing reminder that many of the white nationalists and their allies so closely connected to the attack of January 6th are now literally cheering on Putin’s invasion of Ukraine.","date":"Sat Feb 26 23:27:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Putin is baselessly and disgracefully invoking the Holocaust to justify an illegal, baseless war and its bloody human cost.\nhttps://t.co/WTe0hvzxuV","date":"Sat Feb 26 23:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The data trend is undeniable. The cost of inaction far outweighs the price of significant climate legislation.\nhttps://t.co/cdDgI6kwK6","date":"Sat Feb 26 19:35:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must send additional aid to Ukraine and we must do it quickly.","date":"Sat Feb 26 17:21:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The United States stands firmly behind President Zelenskyy and the Ukrainian people in their fight against Russian aggression.\nhttps://t.co/GdQzsPHfnq","date":"Sat Feb 26 16:01:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Many Americans are in limbo between trust in government and extremist opposition, with the latter leading to events like January 6th. We must show those disaffected Americans that our government is working on behalf of the people. Read more in my op-ed.\nhttps://t.co/hNu8O233Gc","date":"Sat Feb 26 14:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We need to get President Zelenskyy and the Ukrainian people all the ammunition they need. So long as they stand and fight, we must stand firmly behind them.","date":"Sat Feb 26 05:35:14 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As Russia’s aggression grows more reckless, the rest of Europe must be on high alert. The security of our NATO allies in the region must be assured.\nhttps://t.co/cdU2khPfNx","date":"Fri Feb 25 19:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As Russian missiles land across Ukraine, the Russian public is speaking out. A tyrant has invaded their neighbor and robbed them of economic security and democratic freedom.\nhttps://t.co/P5PzK5vGOg","date":"Fri Feb 25 17:50:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am pleased to learn of President Biden’s nomination of the eminently qualified Judge Ketanji Brown Jackson. I look forward to her becoming the first Black woman to serve on the Supreme Court.\nhttps://t.co/p7mCSNa1xe","date":"Fri Feb 25 15:05:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As we approach the end of #BlackHistoryMonth, we will continue to honor the contributions to our country from the African-American community. Black history is American history, and it’s filled with the resilience of those who refused to give up on the promise of our nation. https://t.co/ai2LFpCuG1","date":"Fri Feb 25 14:03:37 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My statement warning Russia against targeted killings and war crimes in Ukraine and urging the Biden Administration to help ensure the safety of President Zelenskyy, other officials, and Ukrainian civilians: https://t.co/PRciH3yEUh","date":"Thu Feb 24 22:55:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"President Biden has brought together all our allies to punish Russia for its acts of aggression through sanctions. This united front has made it clear to Putin how widespread the world's response will be if he continues on this path.\nhttps://t.co/lriGwgqn3T","date":"Thu Feb 24 18:10:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My statement on Russia’s unjustified and unprovoked invasion of Ukraine: https://t.co/3JdaZ98h1w","date":"Thu Feb 24 15:35:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Long after former President Trump has left office, his impact will still be felt through the judiciary. We must pass comprehensive climate legislation to protect our planet for generations to come.\nhttps://t.co/xrQDO9Pew6","date":"Thu Feb 24 14:02:40 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My prayers are with the people of Ukraine. The United States must continue to stand with them while joining with our allies and democracies across the world to hold Russia to account.","date":"Thu Feb 24 05:05:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The COVID-19 pandemic has led to greater economic disparities and inequality, which is why it’s as important as ever that we work to strengthen and expand the middle class. \nhttps://t.co/vKo30TVDaA","date":"Wed Feb 23 22:45:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Ahmaud Arbery lost his life because of the color of his skin. Although this hate crime conviction was a step in the right direction, nothing can bring him back. We must continue to work toward a country where no one is threatened because of who they are.\nhttps://t.co/UoCMzlMtyl","date":"Wed Feb 23 20:02:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The U.S. is leading harsh sanctions against Russia because this is a dangerous precedent to set – the invasion of a sovereign country by an authoritarian government. Putin will pay. https://t.co/hZuG5wnu0R","date":"Wed Feb 23 19:00:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I look forward to learning which of the highly qualified candidates the President will choose. The Senate must advise and consent in a timely manner.\nhttps://t.co/LPaX8UsTDe","date":"Wed Feb 23 17:35:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The examples of former President Trump doing what he wants, regardless of the truth or legality, seem to never end. The allegations of his using fraudulent financial documents to lease federal property and his violations of the Presidential Records Act must be investigated. https://t.co/uUAFHfqdhQ","date":"Wed Feb 23 16:00:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As so many nations make progress in expanding reproductive rights, it's tragic that many American state governments seek to curtail or wholly eliminate them. That’s why I’m fighting to enshrine the right to choose in law. \nhttps://t.co/n5xJVVsF4h","date":"Wed Feb 23 15:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia must face real consequences for its increasing aggression.\nhttps://t.co/zMbwFmTLeq","date":"Wed Feb 23 13:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Very proud of Megan Bozek for bringing an Olympic silver medal home to our district! Such an incredible accomplishment for Team USA. https://t.co/2uC2I1ilOY","date":"Wed Feb 23 12:01:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"America and our allies are united and will respond with unprecedented sanctions.\nhttps://t.co/ELMc93nWZq","date":"Tue Feb 22 22:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Former President Trump just described Vladimir Putin's decision to violate Ukrainian sovereignty while beginning to further invade the country by moving Russian forces into eastern Ukraine as \"wonderful\" and \"genius\" before saying the United States should do the same to Mexico.","date":"Tue Feb 22 21:18:19 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am proud to co-lead the Gateway to Careers Act, which would create a much-needed career pathway grant to help connect community college &amp; technical education students with careers. An investment in higher education is an investment in our workforce. \nhttps://t.co/93cz2L1dIp","date":"Tue Feb 22 21:00:52 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is the beginning of National Eating Disorder Week. We must ensure that every American in need of mental health and eating disorder treatment has access, especially due to increased challenges throughout the COVID-19 pandemic.","date":"Tue Feb 22 19:20:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The United States will provide support to Ukraine and will implement harsh economic sanctions on Russia for this invasion. As a member of the Intelligence Committee, I am committed to protecting U.S. national security. https://t.co/03MyMSeeFu","date":"Tue Feb 22 18:30:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to vote for the #NoSurprisesAct to eliminate surprise medical billing. https://t.co/mtBauJkN5r","date":"Tue Feb 22 14:02:42 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy President’s Day! Today we celebrate our presidents, honoring them for leading our nation through times of difficulty, change, and triumph. https://t.co/hwzvh2EmpE","date":"Mon Feb 21 16:03:44 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was planned and calculated. It must never happen again.\nhttps://t.co/uTPEEnhcxX","date":"Sun Feb 20 15:30:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was happy to lend my support to schools like Harper College by cosponsoring the Tax-Free Pell Grant Act. Reforming and expanding Pell Grants is vital to the fight to make higher education more affordable and accessible.\nhttps://t.co/HutJGI7orE","date":"Sat Feb 19 23:30:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"No public servant, including the former president, is exempt from standards of accountability and transparency. \nhttps://t.co/YRIzF3nMbs","date":"Sat Feb 19 21:35:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Unnecessary restrictions continue to reduce access to the ballot box. The Supreme Court must act swiftly to restore polling places accessible to marginalized communities.\nhttps://t.co/4F6rel8Dx1","date":"Sat Feb 19 19:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While the country works to pivot to a carbon-neutral future, it is essential that we verify oil and natural gas companies are living up to their pledges in the meantime.\nhttps://t.co/X622wQTcAC","date":"Sat Feb 19 15:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Honored to have the American Medical Association support my Dr. Lorna Breen Health Care Provider Protection Act which will help meet the mental wellness needs of health care workers. Now that it has passed the Senate, it heads to President Biden’s desk!\nhttps://t.co/QtZjW3n7Qd","date":"Fri Feb 18 23:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My investigation revealed dangerous levels of neurotoxins in baby food, and it’s unfortunate that Consumer Reports has shown that little has changed. We need to pass my Baby Food Safety Act to prevent babies from being exposed to neurotoxins. \nhttps://t.co/8NGMYeDU3W","date":"Fri Feb 18 22:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was great to speak at Waukegan City Hall today about the $1 billion from the bipartisan Infrastructure Investment and Jobs Act to clean up the Great Lakes. This will help clean up nearly a century of pollution which threatens the safety of drinking water in our region. https://t.co/VdVnxvMg3B","date":"Fri Feb 18 21:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"No-fly lists of unruly passengers were created to keep passengers and crew safe from violence.\nhttps://t.co/oUG9AJQck6","date":"Fri Feb 18 20:25:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I signed a letter along with 65 of my colleagues to urge @SecretaryPete and @USDOT to protect female drivers and require up-to-date female crash test dummies in all vehicle safety tests. #ProtectWomenDrivers\nhttps://t.co/0UfOjSdxN9","date":"Fri Feb 18 18:02:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While this settlement is an important step toward holding gun manufacturers accountable, no amount of money can ever make up for the 26 lives taken at the Sandy Hook Elementary shooting. https://t.co/uf8UkTDK9v","date":"Fri Feb 18 17:01:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I'm proud that the Dr. Lorna Breen Healthcare Provider Protection Act, legislation I sponsored with @RepSusanWild passed the Senate. It will help doctors &amp; nurses struggling with mental health issues. I look forward to President Biden signing it into law. \nhttps://t.co/0vXduA0C6P","date":"Fri Feb 18 16:50:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We cannot afford inaction on climate change.\nhttps://t.co/NwgbKT3hKh","date":"Fri Feb 18 14:35:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Yesterday, I sent a letter to USPS Board of Governors Chairman Roman Martinez IV, urging him to review Postmaster General DeJoy’s 10-year plan, which has led to mail delays and increased postage prices. USPS services must meet higher standards.\nhttps://t.co/7iK99Uq8JD","date":"Thu Feb 17 21:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The notion of withholding these records from the Committee would be absurd, and President Biden made the right decision.\nhttps://t.co/OrWl8BnblW","date":"Thu Feb 17 20:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This pandemic has served as a sad reminder of the need to expand our mental health care system.\nhttps://t.co/kR7Hr1qTKs","date":"Thu Feb 17 17:40:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Seems like this applies to most of his statements.\nhttps://t.co/8oaseoxbhE","date":"Thu Feb 17 16:30:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my Zoom Town Hall today at 6pm CT. I'm looking forward to hearing from constituents and answering questions!\nRSVP for Zoom link here: https://t.co/uXlgHWFdaK","date":"Thu Feb 17 15:02:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We have made it very clear that any invasion by Russia into Ukraine will be met with swift, severe economic sanctions and diplomatic consequences. https://t.co/b71Qsjod0t","date":"Thu Feb 17 14:00:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"There is no reason to ever take the word of Vladimir Putin at face value, most of all it when it contradicts everything we can see.\nhttps://t.co/LCuvEuZ2j3","date":"Thu Feb 17 13:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This week, we commemorate the 4th anniversary of the tragic day that the lives of seventeen Stoneman Douglass High School students were cut short by gun violence. We must continue to work to keep schools safe in their honor. \nhttps://t.co/VQyNca019K","date":"Thu Feb 17 12:01:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"These reprehensible actions have no place in our political system. All Americans must condemn the increasing violence against elected officials.\nhttps://t.co/DZ0cyxbSFs","date":"Wed Feb 16 22:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is very good news!\nhttps://t.co/YGGowzDwwL","date":"Wed Feb 16 21:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The American people must see the extent of efforts to overturn a free and fair election. It’s essential to protecting against future efforts to undermine our democracy.\nhttps://t.co/OXYojXDJgt","date":"Wed Feb 16 20:01:58 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Great to speak with Crain’s Chicago Business about my bipartisan Ban Conflicted Trading Act and the need to bring transparency and trust back into government by barring Members of Congress from trading stocks. \nhttps://t.co/TU3RGHBqkS","date":"Wed Feb 16 19:15:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"In times of conflict, it is essential that Presidential national security appointments of qualified officials receive prompt votes.\nhttps://t.co/DkPcfRW7GG","date":"Wed Feb 16 18:02:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"While some defend the deadly insurrection at the Capitol as “legitimate political discourse,” I am optimistic that the majority of Americans refuse to whitewash the dark events of that day.\nhttps://t.co/Ae4nCbksGx","date":"Wed Feb 16 17:15:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to vote for the #GlobalRespectAct. Hate has no place in America. As a Vice Chair of the LGBTQ+ Equality Caucus, I will continue my pledge to defend human rights and protect the LGBTQ+ community across the globe. https://t.co/TA87NGS9LK","date":"Wed Feb 16 13:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my Zoom Town Hall tomorrow at 6pm CT. I'm looking forward to hearing from constituents and answering questions!\nRSVP for Zoom link here: https://t.co/uXlgHWWOzk","date":"Wed Feb 16 12:01:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"American diplomacy, backed by our strength, must be at the heart of our efforts to safeguard Ukrainian sovereignty and make clear the scale of the consequences if Russia violates it.\nhttps://t.co/sj6Q8diLxe","date":"Wed Feb 16 00:01:30 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am relieved that the disruption to vital US-Canada trade has been cleared.\nhttps://t.co/ljb14MZw33","date":"Tue Feb 15 21:40:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"President Biden, as well as our allies, have all made it abundantly clear to Russia. Any incursion into Ukraine will be met by a unified front of economic sanctions and other serious consequences. \nhttps://t.co/S2vaKLMbGV","date":"Tue Feb 15 16:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It was great to deliver Valentine’s Day cards to our veterans at Hines VA Hospital yesterday. I hope our veterans felt how deeply our students, and all of us, appreciate their sacrifices on behalf of our nation. https://t.co/x1r2kn7OKz","date":"Tue Feb 15 14:32:25 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my Zoom Town Hall on Thursday at 6pm CT. I'm looking forward to hearing from constituents and answering questions!\nRSVP for Zoom link here: https://t.co/uXlgHWWOzk","date":"Tue Feb 15 14:02:37 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I stand with the members of the January 6th Committee from both parties and their commitment to fully investigating the insurrection that took place at the Capitol on January 6th, 2021.\nhttps://t.co/OBdTK6tMIA","date":"Mon Feb 14 22:01:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was so happy to drop off these Valentine’s Day cards from local students for the Veterans at Edward Hines, Jr. VA Hospital to show our community’s appreciation for them. Happy Valentine’s Day! https://t.co/Os8yPU87zO","date":"Mon Feb 14 21:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Four years ago, 17 innocent lives were taken by gun violence at Marjory Stoneman Douglas High in Parkland, Florida. The epidemic of gun violence has taken the lives of far too many children, friends, and family across America.\nhttps://t.co/6nbxgBEgwA","date":"Mon Feb 14 20:35:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"More extreme weather will continue to plague the world unless we take comprehensive action to combat climate change.\nhttps://t.co/vFMOJVn11a","date":"Mon Feb 14 20:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please join my Zoom Town Hall on Thursday at 6pm CT. I'm looking forward to hearing from constituents and answering questions!\nRSVP for Zoom link here: https://t.co/uXlgHWWOzk","date":"Mon Feb 14 19:01:16 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Valentine’s Day! I hope that you are able to spend today with your loved ones. I’m grateful for my family on a love-filled holiday like today. https://t.co/EPQY2zPTMQ","date":"Mon Feb 14 15:40:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Investing in American semiconductors is key to fixing our supply chain and protecting Americans jobs. The America COMPETES Act does exactly that.\nhttps://t.co/7qpnyMF72R","date":"Mon Feb 14 14:03:49 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This investment is another major step in our efforts to combat a changing climate.\nhttps://t.co/0GFO6pawgC","date":"Sun Feb 13 22:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The right of women to their bodily autonomy is under assault across the country. We must codify Roe v Wade into law.\nhttps://t.co/kvTDP1fovH","date":"Sun Feb 13 21:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The parade of bizarre, illegal attempts that members of the Trump team made to overturn the results of the 2020 election seemingly never ends…\nhttps://t.co/B4o3ADILl3","date":"Sun Feb 13 19:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Congress must know what records and documents were taken from the White House. That information belongs to the National Archives and, through them, the American people.\nhttps://t.co/Z0DJDei2JG","date":"Sun Feb 13 15:00:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It should go without saying that Reps Cheney and Kinzinger shouldn’t be punished for having the courage to call the events of January 6th, 2021 what they were: a violent insurrection. \nhttps://t.co/1iRq9BQMDs","date":"Sun Feb 13 14:01:34 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"After the previous administration allowed it to expire, America is once again committed to reauthorizing the #VAWA. America must prioritize the protection of women from domestic violence and other abuse. \nhttps://t.co/2PYEVkTPO1","date":"Sat Feb 12 23:00:24 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Florida’s new “Don’t Say Gay” bill would contribute to the stigmatization and bullying of students who are simply trying to feel safe being themselves. \nhttps://t.co/7jLHGugf5x","date":"Sat Feb 12 21:20:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I introduced this legislation because Congress should focus on our constituent’s pressing needs, not those of our stock portfolios, especially when we are positioned to affect the value of those stocks.\nhttps://t.co/ZNjJR46hXV","date":"Sat Feb 12 20:00:59 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"These continued threats of violence must stop. Heinous acts like this have no place in our political process.\nhttps://t.co/5ybMC9L3D1","date":"Sat Feb 12 16:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am honored to receive a score of 100+ on the Humane Society’s 2021 Humane Scorecard. I am committed to protecting animals through legislation, such as the Puppy Protection Act and the Humane Cosmetics Act, and ensuring they are treated well. \nhttps://t.co/jo2zC2zWcB","date":"Sat Feb 12 13:40:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s past time to increase the efficiency and financial security of the United States Postal Service. The House has taken action, and I look forward to its passage in the Senate.\nhttps://t.co/D707eW7OUV","date":"Fri Feb 11 21:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Heart disease is the #1 cause of death in the U.S. However, it is often preventable. Smoking cessation, regular blood pressure checks, and monitoring blood sugar and cholesterol can all reduce the risk of heart disease. https://t.co/4qQvWLeo4t","date":"Fri Feb 11 16:03:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’ve led Congressional efforts to end the youth vaping epidemic since the toll of its damage first became public, and we still need to continue that work to protect our kids from the companies that are preying on them.\nhttps://t.co/jzWnnE2quW","date":"Fri Feb 11 15:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The task force on organized labor’s recommendations to halt anti-union activities and implement easier paths to unionization for federal workers would be a huge victory for workers’ rights.\nhttps://t.co/B5THDKMsqG","date":"Fri Feb 11 14:15:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As the tension between Russia and Ukraine potentially escalates, we must commit to keeping Americans safe while taking strong diplomatic action to support Ukraine.\nhttps://t.co/e5J5TvQKkg","date":"Fri Feb 11 13:40:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to vote for the bipartisan Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act bill. All victims of sexual assault should have the right to bring their case to court rather than be forced into silence by arbitration.\nhttps://t.co/LOFedBtumf","date":"Fri Feb 11 12:50:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Until rising costs of childcare are addressed, women across America will continue to be disproportionately and frequently denied the opportunity to be full participants in the economy \nhttps://t.co/77I80qMg45","date":"Fri Feb 11 00:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Wilkinson report, along with the findings of any future report, must be made public. The NFL must commit to transparency in any investigation into the toxic workplace under Dan Snyder.\nhttps://t.co/9JDxhRtn8z","date":"Thu Feb 10 22:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I wonder if she’s also concerned with the stew stasi\nhttps://t.co/IR8VSCXGub","date":"Thu Feb 10 21:30:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Electric vehicles are an important tool in our fight against climate change. Further investment and innovation can help us achieve a carbon-neutral future.\nhttps://t.co/HT37hrKgDL","date":"Thu Feb 10 20:02:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"\"While President Trump was in office, staff in the White House residence periodically discovered wads of printed paper clogging a toilet — and believed the president had flushed pieces of paper\"\nhttps://t.co/FhSgFicesW","date":"Thu Feb 10 18:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Evicted by Matthew Desmond (@just_shelter). It's a heartbreaking and revealing look at housing, eviction, and poverty in America. It tells so many invididual stories as Desmond also shows, “Eviction is a cause, not just a condition, of poverty.”\nhttps://t.co/rdreQl6Xtm","date":"Thu Feb 10 17:48:31 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was honored to join One Fair Wage at their rally this week. We need to continue to stand behind the restaurants and workers that help our communities thrive through more congressional support the and raising the minimum wage. https://t.co/qEdM15qM7i","date":"Thu Feb 10 16:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The National Archives and Records Administration continues to clean up President Trump’s mess.\nhttps://t.co/1ajBszhJQu","date":"Thu Feb 10 15:01:51 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Nearly a decade ago, the Supreme Court gutted the Voting Rights Act. Now we are living through that decision’s legacy.\nhttps://t.co/M1tqW8YyH8","date":"Thu Feb 10 14:02:57 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The NFL must release the written report of the Wilkinson investigation into sexual harassment in the Washington Commanders workplace. I stand with Tiffani Johnston and all the courageous women who have come forward to tell their shocking stories to my Subcommittee. https://t.co/KcedvYoYKS","date":"Thu Feb 10 13:10:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am proud that the Postal Service Reform Act, which I cosponsored, has passed the House this week. The provisions in this legislation will finally guarantee the financial security of the Postal Service and increase the efficiency of its services in the future. https://t.co/FsWPMKZLvi","date":"Thu Feb 10 00:01:53 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Vaccines are highly effective in protecting against COVID-19 and for those who are immunocompromised, an additional booster shot can be lifesaving. \nhttps://t.co/jks8M23mrx","date":"Wed Feb 09 21:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must support our healthcare workers in the face of burnout and the enormous stress they face. That’s why I was proud the House passed my Dr. Lorna Breen Healthcare Provider Protection Act, and I hope the Senate soon takes it up. \nhttps://t.co/ZJkLryEmnX","date":"Wed Feb 09 18:03:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Police brutality against people of color continues to be a devastating issue that must be stopped. My thoughts and prayers are with Amir Locke’s family and community.\nhttps://t.co/WudAkgilAT","date":"Wed Feb 09 14:15:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Despite the pageantry demonstrated by the 2022 Winter Olympics in Beijing, mass genocide and human rights violations ensue throughout the People’s Republic of China. Read more in my Op-Ed:\nhttps://t.co/v65c15DItv","date":"Wed Feb 09 12:01:56 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to cosponsor the Postal Service Reform Act -- a commonsense, bipartisan solution to the financial solvency and reliability of the USPS. https://t.co/wWZD7UtVHz","date":"Wed Feb 09 00:40:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am quite glad to hear this example of moral courage…13 months after it was needed.\nhttps://t.co/XaOQ1Nq6DY","date":"Tue Feb 08 22:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As I noted during this Oversight Committee hearing on big oil and climate change, we need to listen to the scientists. The stakes are too high to do otherwise. https://t.co/cxFnVpRfko","date":"Tue Feb 08 21:00:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As we pass another grim milestone of the pandemic, it’s as important as ever to get vaccinated because it’s the best way to protect yourself against serious illness and death.\nhttps://t.co/DN2kJPSRwQ","date":"Tue Feb 08 20:40:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Passage of the #PostalServiceReformAct will ensure the survival of the USPS while paving the path for improved service.\nhttps://t.co/5xXqdXIQFM","date":"Tue Feb 08 18:02:33 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The things that should surprise us… \nhttps://t.co/PZbfcm4rXW","date":"Tue Feb 08 17:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I will continue to push the NFL to release the Wilkinson report of the toxic workplace culture at the Washington Commanders. https://t.co/hgwAJg3Dt5","date":"Tue Feb 08 14:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"These laws are absolutely unacceptable. The right to vote is a right, not a luxury that state governments can take away from the marginalized. \nhttps://t.co/9epWCKxpGN","date":"Mon Feb 07 23:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"To anyone who still doubts the efficacy of COVID-19 vaccines: research shows that unvaccinated people are 23 times more likely to be hospitalized due to COVID-19 and 53 times more likely to die.\nhttps://t.co/9bnkwuUdoG","date":"Mon Feb 07 21:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It is absolutely necessary for all Americans to be able to access COVID-19 testing. That is why it’s so important that Medicare now covers at-home COVID-19 tests.\nhttps://t.co/OSpveJyfyt","date":"Mon Feb 07 16:15:06 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Thank you to the brave women who came before the Oversight Committee to share their stories of workplace harassment at the Washington Commanders. No sexual harassment of any kind should be tolerated in any workplace. https://t.co/oez1F4I3G1","date":"Mon Feb 07 15:01:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"These brave former members of the Washington Football organization came to testify about their experiences and their call for change and accountability was clear.\nhttps://t.co/MMcIzILdoB","date":"Mon Feb 07 12:05:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The rise in antisemitic crime in Chicago and throughout the entire nation has been especially devastating this past month. No American being should ever fear for their safety in their place of worship.\nhttps://t.co/HlSZ2tw89m","date":"Sun Feb 06 23:15:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Congress routinely receives nonpublic information through its work and routinely casts votes that impact stock values. My bill, the Banned Conflict Trading Act, would eliminate this conflict of interest by Congress from trading individual stocks.\nhttps://t.co/h4p0DKXYOi","date":"Sun Feb 06 20:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am so thankful for the hardworking essential workers who keep our district running despite trying conditions during the Pandemic.\nhttps://t.co/dsug9mvb8E","date":"Sun Feb 06 15:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My thoughts and prayers are with HBCU students, faculty, and surrounding communities. The rise in violent threats against historically black institutions this month is alarming and must be swiftly addressed. https://t.co/AiEPaOET8d","date":"Sat Feb 05 23:10:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This Black History Month, let’s honor and celebrate the courageous, hardworking Black Americans who shaped our city of Chicago and our nation. https://t.co/WOFFYWM2xw","date":"Sat Feb 05 21:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Russia continues to search for an excuse to increase hostility toward Ukraine. The international community must hold Putin accountable if he takes aggressive action.\nhttps://t.co/aCZGeqpe9h","date":"Sat Feb 05 20:00:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is dangerous rhetoric, and threats of violence against opponents must not be accepted as part of our political discourse.\nhttps://t.co/nPXyShyr3V","date":"Sat Feb 05 19:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must uphold our commitment to support the people of Ukraine and their democracy in the face of Russian aggression. Here’s my OpEd on the subject in the Chicago Tribune.\nhttps://t.co/T4mPVKHi55","date":"Sat Feb 05 16:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"A reminder that even though COVID case numbers are falling in Illinois, we must continue taking precautions to protect ourselves and our loved ones. Vaccines and masks are both effective in protecting against the new mutation of omicron, BA.2.\nhttps://t.co/sImGVV7jZy","date":"Sat Feb 05 15:01:00 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The passage of the America COMPETES Act marks a major step forward towards economic prosperity. More pathways to STEM jobs, investment in research infrastructure, and creating well-paying jobs while combating inflation are all critical to help workers.","date":"Sat Feb 05 14:15:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Daniel Snyder must not be allowed to block the Wilkinson report.\nhttps://t.co/DvGQLqjSfg","date":"Sat Feb 05 13:15:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"After hearing the harrowing testimony of the brave victims, I and @RepMaloney sent a letter to NFL Commissioner Roger Goodell demanding the League release the findings of an internal investigation into the Washington Commanders’ toxic workplace culture.\nhttps://t.co/5iu4vmfGjB","date":"Sat Feb 05 00:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The NFL benefits from federal government exemptions to antitrust laws. We expect to hold their workplace to the highest standard of professionalism and safety. At our Oversight Committee roundtable, we learned how they did not do so directly from victims of sexual harassment. https://t.co/SaZzPPavTx","date":"Fri Feb 04 23:40:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m proud that my College Transparency Act was passed as an amendment to the COMPETES Act. This will allow families to see data on majors and career paths at different colleges in order to make an informed financial decision about their futures. https://t.co/DOzU9RhatY","date":"Fri Feb 04 22:50:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"There is no place in our political discourse for violence, insurrection, and the rejection of the peaceful transfer of power. Legitimizing those attacks on our democracy is a betrayal of all those who marched, fought, and died to build and preserve them.\nhttps://t.co/kyxpDP5wSp","date":"Fri Feb 04 21:05:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today is Rosa Parks’ birthday. We take today to honor a fearless fighter for equality. The only way to truly honor her legacy is to continue her fight against discrimination wherever it appears. https://t.co/V93rbgp5Ux","date":"Fri Feb 04 19:05:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The January 6th Committee and the Department of Justice must make it clear that no person is above the law.\nhttps://t.co/1Pewptv7PN","date":"Fri Feb 04 18:10:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s notable that after the news of a culture of widespread sexual harassment at his team came to light, everyone seemed to have been fired except its owner.\nhttps://t.co/0RVUDlxFul","date":"Fri Feb 04 15:35:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I was proud to introduce legislation banning Members of Congress from trading stocks. We must remove any doubt that the people’s representatives are putting their constituents’ interests ahead of their portfolios.\nhttps://t.co/2BCfDSzYkt","date":"Fri Feb 04 14:03:32 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today is #WorldCancerDay. We join others around the globe, spreading awareness and continuing the fight to end cancer as we honor the memory of those lost to it. https://t.co/sPUmkkp6Rq","date":"Fri Feb 04 12:01:50 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Washington Commanders Owner Dan Snyder claimed he had “been too hands-off as an owner.” The opposite was true.\nhttps://t.co/R9cBlIjHHN","date":"Fri Feb 04 01:50:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I am happy to see the Art Institute of Chicago and the School of the Art Institute win their fight for fairer representation. I look forward to a contract agreement that addresses their concerns and creates a more equitable workplace.\nhttps://t.co/GEdhZnfFaz","date":"Fri Feb 04 00:50:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It’s unsurprising that a U.S. President who abused his power in so many ways would do so again. \nhttps://t.co/9EJBgxYBvX","date":"Thu Feb 03 22:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I want to thank our brave witnesses who participated in our Oversight Committee hearing today on the sexual harassment they experienced and witnessed in the Washington Football Team workplace as well as the lack of accountability and action from the NFL. https://t.co/OgZs2HSQ2t","date":"Thu Feb 03 21:30:09 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We must reject this sad and dangerous notion. Americans settle their differences at the ballot box. \nhttps://t.co/2io1k03585","date":"Thu Feb 03 19:25:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"These racist threats against HBCUs must be condemned. Everyone should be able to study and learn without the threat of violence.\nhttps://t.co/nmrWTQ7Q5r","date":"Thu Feb 03 14:15:07 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As World Cancer Day approaches, I am glad to see President Biden lay out such an ambitious goal. Earlier detection and expanded treatment options can save countless lives.\nhttps://t.co/B7hfVyMmXJ","date":"Thu Feb 03 12:01:35 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Proud that my bill to rename the Schaumburg Post Office in honor of Veterans of the Iraq and Afghanistan Wars passed through the Oversight Committee today. They deserve this recognition for their sacrifice for our nation.\nhttps://t.co/GlqnEke1Ur","date":"Thu Feb 03 00:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As China increases military flyovers of Taiwan, it’s essential that we continue to show that we stand with our security partners in the face of such aggression\nhttps://t.co/5Xxe6m81fC","date":"Wed Feb 02 23:00:46 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Now seems as good a time as any to thank the staff of the National Archives for their work preserving and cataloguing our nation’s essential documents, as well as taping some back together…\nhttps://t.co/iyEADST0hS","date":"Wed Feb 02 21:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"This is unfortunate and can’t bode well for an early spring. I blame Phil Connors.\nhttps://t.co/YhE3nviQhm","date":"Wed Feb 02 20:05:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"As the COVID-19 Pandemic continues to put pressure on our economy and healthcare systems, it’s easy to lose sight of those who are especially vulnerable -- including the unhoused and the organizations that assist them.\nhttps://t.co/teDffdxGmV","date":"Wed Feb 02 19:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today, I led a letter alongside @RepCasten and Illinois Democratic Members of the House to Leader Schumer and Chairman Peters requesting that they immediately consider President Biden's nominees for the USPS Board of Governors. #SaveUSPS\nhttps://t.co/YJplhCDiGS","date":"Wed Feb 02 19:01:08 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Claims of sexual harassment within the Washington Football Team organization have warranted a serious examination of their workplace. I am determined to uncover the facts to ensure others will be safe in their workplaces.\nhttps://t.co/9DHIemSM8d","date":"Wed Feb 02 18:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My thoughts are with Mayor Nick Helmer’s family and the entire Prospect Heights community. We are mourning the loss of a local leader and community builder. https://t.co/1VdU2kRwB3","date":"Wed Feb 02 17:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Too many lives have been taken as a result of the gun violence epidemic that has gripped our nation. We must support survivors and work to end gun violence. #GVSurvivorsWeek https://t.co/VyXGTLzQc0","date":"Wed Feb 02 12:01:48 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Education and employment equity should never exclude adults and disabled people. Thank you to the After 22 Project and @chicagosmayor for leading the effort to close this gap.\nhttps://t.co/5ZZWeEk35J","date":"Tue Feb 01 23:20:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I commend the Defense Department for taking these steps. We must be able to protect civilian populations while pursuing threats to our country.\nhttps://t.co/vIe7YcZcKq","date":"Tue Feb 01 20:40:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I urge all Senators to weigh the nominee’s temperament and legal experience fairly. I have full confidence that President Biden will nominate an exceptional candidate who will bring experience and diversity to the Supreme Court.\nhttps://t.co/dryTOJtQCc","date":"Tue Feb 01 18:40:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Happy Lunar New Year! I hope this year is filled with good fortune. https://t.co/466vwloPun","date":"Tue Feb 01 17:30:18 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Department of Justice must follow the facts.\nhttps://t.co/3Z8Wj8sX1s\\","date":"Tue Feb 01 14:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Variants will continue. That is why it is essential to get yourself vaccinated and boosted. Together we can protect our country against future risks.\nhttps://t.co/3nuMMdMZA9","date":"Mon Jan 31 21:15:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"157 years ago today, America finally ended slavery by adopting the 13th Amendment to the United States Constitution. As we celebrate this anniversary of that overdue but momentous step forward, our quest to form a more just, more equal, more perfect union lives on. https://t.co/U7T8vAKysM","date":"Mon Jan 31 19:20:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"COVID-19 doesn’t respect borders. We must ensure every nation has the supply necessary to protect its population. Any decision to the contrary undermines public health and our nation's values.\nhttps://t.co/QHyLp08pvl","date":"Mon Jan 31 18:10:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"My thoughts are with the victims of the collapsed bridge in Pittsburgh. While I’m relieved to hear that there were no fatalities, this near-tragedy underscores the importance of rebuilding our nation’s crumbling infrastructure. \nhttps://t.co/pDszt6yJj4","date":"Mon Jan 31 16:40:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The Biden Administration is distributing free N95 respirator masks, which have begun to arrive at pharmacies and grocery stores! Let's stay protected as we continue to battle the pandemic.\nhttps://t.co/jaJS2iDWzd","date":"Mon Jan 31 14:15:05 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Stories like this are all too common. That’s why I cosponsored the John Lewis Every Child Deserves a Family Act. No potential parent should be turned away from starting their family because of their faith or whom they love.\nhttps://t.co/vmNSJYhpUN","date":"Sun Jan 30 16:01:23 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Congratulations to Alexa Knierim and Megan Bozek from my district on their selection for the 2022 U.S. Olympic Team and good luck representing our country!\nhttps://t.co/dK4I9hA8zY","date":"Sat Jan 29 22:15:01 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"It would still be crazy even if the idea wasn’t inspired by a discredited conspiracy theory.\nhttps://t.co/GfLQUZyOlK","date":"Sat Jan 29 18:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"“From January through November, just under 5 million new businesses were launched, a jump of 55 percent over the same period in 2019.”\nhttps://t.co/EH1HXx1h7g","date":"Sat Jan 29 15:40:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today’s incident in Pennsylvania shows the importance of repairing our deteriorating bridges. The Infrastructure Investment and Jobs Act has allocated $1.4 billion to Illinois for just that purpose. https://t.co/wjgRLu0MiH","date":"Fri Jan 28 21:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I’m proud to be a cosponsor of this resolution to formally recognize the Equal Rights Amendment as the 28th amendment to the Constitution.\nhttps://t.co/I11ysyummE","date":"Fri Jan 28 19:01:10 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Each day that we don’t act, the catastrophic consequences of the climate crisis grow nearer. That is why I am proud to co-chair @SEEC’s new Power Sector Task Force, focusing on additional steps we can take to decarbonize our economy.\nhttps://t.co/gRKRmh00Rg","date":"Fri Jan 28 17:01:43 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"I believe I’m seeing a trend here.\nhttps://t.co/Qujkw0ovCL","date":"Fri Jan 28 14:02:58 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Compelling piece by Dr. Muhammad Bakr Ghbeis and Eliot Engel on the need to prevent the normalization of the atrocities committed by Syrian President Bashar al-Assad’s regime.\nhttps://t.co/KF9Og3mtXi","date":"Fri Jan 28 00:01:27 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Good thing we still have humpback whales, just in case. https://t.co/Otytjelvmz","date":"Thu Jan 27 23:27:17 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Meat processing companies are hiking prices under the guise of market pressures while their profits soar. I will continue my efforts to get to the bottom of any practices that take advantage of American consumers.\nhttps://t.co/sHwkMOUpgk","date":"Thu Jan 27 23:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"The ridiculousness is self-explanatory: “Florida Gov. Ron DeSantis pushed Tuesday for coronavirus patients to continue receiving antibody treatments deemed ineffective against the omicron variant.”\nhttps://t.co/BFYpzohjTO","date":"Thu Jan 27 22:15:03 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"We expand our efforts to vaccinate the world or risk the next wave of COVID-19 wreaking havoc. That’s why I am calling for additional funding to reduce the chance of future variants.\nhttps://t.co/jpVJT24FaV","date":"Thu Jan 27 21:20:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Jailing dissidents, threatening neighbors sovereignty, and increasing cyberwarfare…the contrast between autocracy and democracy is clear.\nhttps://t.co/IGZnebrN7O","date":"Thu Jan 27 20:15:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Make sure you are using #N95 masks to get an extra layer of protection. Get them today for free at your nearest local pharmacies and health centers. Learn more here: https://t.co/ba8k3MmLBd https://t.co/fSEEtAgA6n","date":"Thu Jan 27 18:10:04 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Today’s International Holocaust Remembrance Day marks 77 years since the liberation of Auschwitz. We must never abandon the memory of the six million Jewish victims of the Holocaust and millions of other victims of Nazism. #NeverAgain","date":"Thu Jan 27 15:01:54 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Americans across the country are paying more for food while meat processing companies are earning bigger profits. I’m determined to uncover the truth about these predatory business practices and protect consumers. \nhttps://t.co/i5IlL96QuD","date":"Wed Jan 26 23:25:02 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Ending this pandemic means ending it everywhere through vaccinating the world. We have seen how quickly a variant can arise from another country. The best way to prevent the next variant is vaccinating everyone to reduce the virus’ opportunities to mutate.\nhttps://t.co/jpVJT24FaV","date":"Wed Jan 26 22:01:15 +0000 2022","user_id":"814179031956488192"},{"handle":"CongressmanRaja","text":"Please listen to doctors, not antivaxxers, and get vaccinated! https://t.co/5vdPavR1li","date":"Wed Jan 26 20:01:51 +0000 2022","user_id":"814179031956488192"}]