[{"handle":"EleanorNorton","text":"Today, the House’s FY 23 DC Appropriations bill, which contains numerous triumphs, was passed by the Subcommittee on Financial Services and General Government.\n\nStatement: https://t.co/rkOzQWtlI1","date":"Thu Jun 16 20:26:53 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"During yesterday's Oversight markup, ⁦⁦@Rep_Clyde⁩ reprehensibly argued for abolishing DC's limited home rule and having Congress govern DC’s nearly 700,000 residents.\n \nWatch Rep. Clyde's zeal for injustice.\n\n#DCStatehood #HandsOffDC https://t.co/oDUVrEFqa7","date":"Thu Jun 16 20:21:20 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'll speak at a press conference this morning with @RepChuyGarcia on the bill we are co-leading to ensure fair wages and benefits for airport workers.\n \nWatch at 9:45: https://t.co/aa9FcBe4dO","date":"Thu Jun 16 13:04:06 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, @AppropsDems released the FY 23 DC appropriations bill, which has several victories for DC, including $40m for DCTAG, an increase in the annual and lifetime DCTAG awards, and no anti-home-rule riders.\n\nMore: https://t.co/MUAsbX2EnY","date":"Wed Jun 15 19:01:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, @Rep_Clyde used his debate time in the Oversight Committee to, once again, call for repeal of the DC Home Rule Act, which would abolish even the limited self-government DC now has and return DC to full colony status. #DCStatehood\n\nMy rebuttal: https://t.co/wLKxWmrvwY https://t.co/0Ahbqu6xDh","date":"Wed Jun 15 16:03:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, the @OversightDems Committee passed my bill allowing DC to transmit legislation to Congress for the review period electronically.\n\nIt's time to bring this process into the electronic age.\n\nStatement: https://t.co/Qdmfta3J6n https://t.co/zFk4VAmDcF","date":"Wed Jun 15 15:23:32 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, the @TransportDems Committee passed my bill to revoke the independent real estate leasing authority of the Securities and Exchange Commission.\n\nThe General Services Administration would handle the SEC’s real estate procurements.\n\nRelease: https://t.co/2TLM2tl7TL","date":"Wed Jun 15 15:11:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"During #PrideMonth, we’re reminded Republicans have used Congress’ power over DC to discriminate against DC’s LGBTQ residents.\n\nBased on the flood of anti-LGBTQ legislation in states, a Republican Congress would likely try again. #DCStatehood.\n\nStatement: https://t.co/klu4iAdkj2","date":"Tue Jun 14 15:59:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on #FlagDay, we celebrate the DC flag and continue our work to make the US a more perfect Union by adding DC as the 51st star on the US flag.\n\nWe are closer to #DCStatehood than ever.","date":"Tue Jun 14 15:39:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, @TransportDems will vote on my bill to revoke the real estate leasing authority of the Securities and Exchange Commission.\n\nIt's wasteful and redundant for the SEC to be involved in real estate when GSA exists for that very reason.\n\nStatement: https://t.co/sDDSnWCTuv","date":"Tue Jun 14 15:13:36 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill to provide fed. funds to create local task forces to bring police, the community and public officials together to identify best policing practices and other ways to strengthen relations between the community and police.\n\nRelease: https://t.co/CdNbT0YHg4","date":"Mon Jun 13 19:13:19 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, @OversightDems will mark up my bill allowing DC to transmit legislation to Congress for the review period electronically. Currently, DC must physically transmit it.\n\nThere should be no review period, but so long as there is, Congress should enter the electronic age.","date":"Mon Jun 13 17:53:25 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"After being contacted by several federal employees and retirees who have had difficulty accessing the new TSP online system and reaching employees for help, I wrote seeking answers on the causes and the fixes.\n\nRelease: https://t.co/8WuGNh93BT","date":"Mon Jun 13 16:38:21 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The Jan 6th hearings remind us that the DC police department, which is paid for by DC residents, voluntarily saved the Capitol and democracy that day, even though Congress denies DC residents voting representation in Congress and full local self-government.\n\n#DCStatehood https://t.co/eK5FrAiByD","date":"Mon Jun 13 15:24:34 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Currently, their authority is interpreted to be limited to USPS property. \n\nDetails: https://t.co/jZcTm5y4zt","date":"Mon Jun 13 14:55:43 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will introduce a bill to combat mail theft by clarifying that US Postal Service police officers have authority to protect mail and USPS employees both on and off USPS property.","date":"Mon Jun 13 14:55:42 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I didn’t ask for a pardon either, but I have asked for the DC mayor to be given control over the DC National Guard.\n\nThe DCNG is currently controlled by the President, who was MIA on #January6th.","date":"Fri Jun 10 18:48:22 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As the Jan 6th committee hearings begin, we're reminded the Trump administration delayed deploying the DC National Guard.\n \nIt's past time for Congress to pass my bill giving the DC mayor control over the DCNG, like the governors of states and territories have over their Guards.","date":"Fri Jun 10 13:27:32 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"On Tuesday, @OversightDems will mark up my bill allowing DC to transmit legislation to Congress for the review period electronically.\n\nCurrently, Congress requires the legislation to be physically transmitted.\n\nDetails: https://t.co/uDF5K5Uok1","date":"Fri Jun 10 13:15:28 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, the Navy brought by a model of the USS District of Columbia, a ballistic submarine currently being built. https://t.co/dJr1PSEnqI","date":"Thu Jun 09 21:44:56 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/MguQHAw5T8","date":"Thu Jun 09 16:36:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House passed my provisions authorizing the Army Corps of Engineers to study a secondary drinking water source and additional drinking water storage capability for DC, swimming in the Potomac and Anacostia rivers, and flooding in the Federal Triangle.","date":"Thu Jun 09 16:36:23 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"During last year's #PrideMonth, I introduced a bill to clarify that DC residents may not be excluded from a jury in Superior Court based on sexual orientation or gender identity.\n\nI've long fought and will continue to fight to prevent discrimination against the LGBTQ community.","date":"Wed Jun 08 20:05:30 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced a bill to provide funding to law school clinical programs that provide pro bono legal services to veterans.\n\nRelease: https://t.co/dAt9MpUTdo","date":"Wed Jun 08 17:37:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In tomorrow's @OversightDems gun violence hearing, I will highlight Republican efforts to overturn DC's gun violence prevention laws. #DCStatehood #HandsOffDC\n\nStatement: https://t.co/VPww6no4xc","date":"Tue Jun 07 20:02:58 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":".@USPS responded to my recent letter on the increase in mail theft, especially of checks, saying it's making security modifications and infrastructure upgrades to reduce such theft.\n\nI'll watch closely to see if these measures reduce mail theft.\n\nRelease: https://t.co/hUXMx5g4hG","date":"Mon Jun 06 20:32:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As chair of the Subcommittee on Highways and Transit, I will hold a hearing on Wednesday at 10:00 am on road safety for all users.\n\nDetails: https://t.co/rFaCa2y4Zp https://t.co/JYhXFhArpC","date":"Mon Jun 06 18:40:53 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/S7TfkbS7MG","date":"Mon Jun 06 17:48:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, the House will debate my provisions authorizing the Army Corps of Engineers to conduct studies on an urgently needed secondary drinking water source for DC, swimming in the Potomac and Anacostia rivers, and flooding in the Federal Triangle.","date":"Mon Jun 06 17:48:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I announced I'll introduce a bill to require DOT and EPA to jointly submit recommendations to Congress on how to reduce train noise and vibration near homes.\n\nRelease: https://t.co/sD3FJyMH9N","date":"Mon Jun 06 15:59:39 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"For #BlackMusicMonth, I'm highlighting the song Bustin' Loose by Godfather of Go-Go and #DCStatehood supporter Chuck Brown.\n\nI introduce a resolution each year to designate his birthday as Chuck Brown Day.\n\nAfter all, I’m always working to bust DC loose from Congress' control. https://t.co/PJ3H8SzTem","date":"Mon Jun 06 15:05:04 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Honored to be joined by Maria Betance-Pizzaro, who welded my initials, and Jennifer Boykin, President, Newport News Shipping https://t.co/jqBvfP2zKa","date":"Sat Jun 04 16:01:35 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My initials that will be placed aboard the USS District of Columbia! https://t.co/bOIqNs6Xbu","date":"Sat Jun 04 15:49:36 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Excited to be at Electric Boat - Quonset Point this morning for the USS District of Columbia Keel Laying Ceremony.","date":"Sat Jun 04 13:41:27 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I have defeated every such previous attempt. #HandsOffDC\n\nStatement: https://t.co/SVRd6b6Ib4","date":"Fri Jun 03 18:28:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"With the recent tragedy in Ulvade and the start of Gun Violence Awareness Month, we are reminded that, without #DCStatehood, a future Republican Congress could overturn DC's gun violence prevention laws.","date":"Fri Jun 03 18:28:48 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As we begin #PrideMonth, I'm highlighting Ana Reyes, whom President Biden, upon my recommendation, nominated to the US District Court for DC.\n\nOnce confirmed, she'll be the first openly LGBTQ person to serve on that court.","date":"Fri Jun 03 18:22:38 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I released my remarks for the keel-laying ceremony for the USS District of Columbia, the first ship named after DC.\n\nAs the largest, most capable sub produced by the US, it's fitting that it is named after what will be the #51stState.\n\nRelease: https://t.co/5LLsH857P4","date":"Fri Jun 03 17:43:07 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill to require all health insurers to directly reimburse a divorced parent who pays for reimbursable out-of-pocket medical expenses, regardless of which parent is the source of insurance.\n\nRelease: https://t.co/n8OC4BQekT","date":"Tue May 31 18:00:39 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"200,000 DC residents have served in the military since WWI. This Memorial Day, I honored DC servicemembers for giving life and limb for a country that denies them voting representation in Congress and full local self-government. #DCStatehood","date":"Tue May 31 13:57:23 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I applaud the executive order requiring federal police officers to use body cameras. However, Congress must also pass my bill, with @RepDonBeyer, that requires the use of body and dashboard cameras, so that a future administration cannot undo the camera requirement.","date":"Thu May 26 21:13:28 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/8Ux4rVFEsB","date":"Thu May 26 21:12:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Republicans in Congress have been trying for years to repeal DC’s gun violence prevention laws, including its ban on assault weapons and high-capacity magazines, but I’ve defeated each attempt. They are likely to try again if they are in the majority. #HandsOffDC #DCStatehood","date":"Thu May 26 21:07:18 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Ahead of #MemorialDay2022, I introduced a resolution honoring DC servicemembers and veterans, who have fought in every American war since the Revolutionary War but still don't have voting representation in Congress. \nThe remedy is #DCStatehood.\nRelease: https://t.co/yxZvMnc6wd","date":"Thu May 26 18:24:34 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Russia has permanently barred me, among others, from entering Russia because of my opposition to its unprovoked and brutal war in Ukraine. I’ll continue to support Ukraine and to hold Russia accountable for its war.","date":"Thu May 26 17:34:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In 2012, I defeated legislation that would have nationalized the DC War Memorial, preserving it for DC servicemembers only. The memorial commemorates the 499 DC residents who died in WWI, more than the number from three states. #MemorialDay2022","date":"Thu May 26 16:56:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Gun violence is the leading cause of death among children and teenagers. We have legislation ready to go to stop gun violence and save lives in every community across the country. It’s time for Republicans to get out of the way of stopping gun violence. #gunviolenceprevention","date":"Wed May 25 20:01:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@POTUS nominated Judge Florence Pan of the U.S. District Court for DC, whom I recommended for the district court, to the U.S. Circuit Court for DC. Pan has the professional experience and academic credentials to be an outstanding circuit judge.\nDetails: https://t.co/48HPr85CnJ","date":"Wed May 25 17:41:05 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"However, I’m still waiting for a response to the rest of my questions, and I will continue to push for greater transparency from NPS regarding the crash and their investigations more broadly.\nDetails: https://t.co/I5D1olZALx","date":"Wed May 25 17:10:29 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"After my letter, NPS finally provided the name of the driver to the victims’ families, without which they could not file life insurance claims.","date":"Wed May 25 17:10:29 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@NatlParkService provided an interim response to my letter demanding answers on the investigation into a car crash that killed two pedestrians at Hains Point last year.","date":"Wed May 25 17:10:28 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Doing right by these servicemembers and veterans is one more reason for #DCStatehood. \n\nRelease: https://t.co/yEbQ7dws8p","date":"Tue May 24 17:03:39 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Ahead of Memorial Day, our country owes a special debt of gratitude to DC servicemembers and veterans, who serve or have served their country without voting representation in Congress or full local self-government.","date":"Tue May 24 17:03:38 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill to designate the post office at 400 Southern Avenue SE Southeast in DC as the “District of Columbia Servicemembers and Veterans Post Office.”","date":"Tue May 24 17:03:38 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Four bills have been introduced this Congress to move federal agency headquarters out of the National Capital Region. These bills are nothing more than cheap talking points attacking federal employees and their work. I will defeat these bills. \nDetails: https://t.co/QhNuZPnOcN","date":"Tue May 24 15:31:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/mZcI6IDqQM","date":"Mon May 23 17:08:43 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I wrote the Postal Service about an increase in the theft of universal keys, allowing thieves to break into blue mail collection boxes, steal checks, and change the payees and dollar amounts. I requested a response detailing the steps USPS is taking to remedy the problem by 5/30.","date":"Mon May 23 17:08:42 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@RepMTG has joined @Rep_Clyde in calling for repeal of the DC Home Rule Act, abolishing the DC government, so the federal government can run DC as a colony again. I will defeat their efforts, which only strengthen our case for #DCStatehood. #HandsOffDC","date":"Mon May 23 15:05:25 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/ZTAJUgtNwO","date":"Mon May 23 15:05:25 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC’s lack of a secondary drinking water source or drinking water reserves makes my provision authorizing the Army Corps to study this matter very critical for DC. Glad to see @TransportDems pass the provision this week as part of the Water Resources Development Act.","date":"Fri May 20 20:34:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased to celebrate #BiketoWorkDay today.\n\nAs the chair of the Subcommittee on Highways and Transit, I will soon be holding a hearing on road safety.\n\nWe need to improve the safety of our roads for all users. Lives depend on it.","date":"Fri May 20 11:37:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#ClassroomCensorship laws that prohibit free speech in schools are not only wrong—they may also violate First Amendment rights.\n \nThis is unacceptable and could have disastrous consequences for DC.\n \nWatch the @OversightDems hearing: https://t.co/F5Jj467zQJ https://t.co/z2WTY07Yba","date":"Thu May 19 14:15:20 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":".@TransportDems today passed my provisions authorizing the Army Corps to study a secondary drinking water source for DC, swimming in the Potomac &amp; Anacostia rivers, and flooding in the Federal Triangle.\n\nRelease: https://t.co/DGczQR1nSZ https://t.co/ocPQmwu9RW","date":"Wed May 18 21:06:15 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, during @OversightDems hearing on classroom censorship, I will warn that a Republican House could abuse Congress’ undemocratic power over DC to try to ban books and regulate curriculum in DC public schools. \n\nRelease: https://t.co/rT2jzEbrtt\n\n#DCStatehood #HandsOffDC https://t.co/p4K1pdgPll","date":"Wed May 18 19:15:57 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Over the past 57 years, Head Start has grown from an eight-week summer session to a comprehensive program in all states and territories and DC.\n\nJoin us today in celebrating Head Start's 57th birthday! #HappyBDayHeadStart https://t.co/YnsPjuh5SU","date":"Wed May 18 17:27:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Transportation Chair @RepPeterDeFazio and I released a joint statement addressing the staggering increase in traffic fatalities nationally.\n\nAs chair of the Subcommittee on Highways &amp; Transit, I'll be announcing a hearing on road safety soon.\n\nStatement: https://t.co/BdZAaS9qnk","date":"Tue May 17 20:50:18 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill to prohibit questions about citizenship, nationality, and immigration status on the decennial census.\n\nRelease: https://t.co/Yygskx3pg6","date":"Tue May 17 20:14:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I remember my grandfather Richard Holmes, one of the first African American firefighters in DC, as we celebrate the 150th anniversary of #DCsBravest.","date":"Tue May 17 15:24:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I criticized @RepBillJohnson's bill that is designed to move federal agencies out of the National Capital Region.\n\nThis is the third such bill introduced this Congress.\n\nStatement: https://t.co/7OvvZh9Hd4","date":"Tue May 17 15:05:05 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/qHIdrMSVqq","date":"Tue May 17 14:22:36 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"At my request, the House’s Water Resources Development Act authorizes the Army Corps of Engineers to conduct studies on an urgently needed secondary drinking water source for DC, swimming in the Potomac &amp; Anacostia rivers, and flooding in Federal Triangle.","date":"Tue May 17 14:22:36 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I announced the DC community project funding requests I submitted for the FY 23 appropriations bills.\n\nThough I received many worthy requests, members were only allowed to submit 15.\n\nDetails: https://t.co/eyvNw9jgSc https://t.co/D3W2cgUmWD","date":"Mon May 16 18:12:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased the Postal Service replied to my 4/28 letter about my office's difficulty resolving cases of undelivered and delayed mail.\n\nSince my letter, we've resolved and closed nearly 75% of open USPS cases.\n\nStatement: https://t.co/1qQ69oGcAY","date":"Fri May 13 13:56:09 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/vrL6foTcUl","date":"Fri May 13 13:45:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I announced I will introduce my third bill this Congress to combat helicopter noise in DC.\n\nThis bill would require the FAA to make recommendations to Congress on how to reduce helicopter noise in DC.\n\nHelicopter noise harms health and quality of life in DC.","date":"Fri May 13 13:45:25 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, @OversightDems passed my bill to require the Federal Bureau of Prisons to provide information to DC on people in BOP custody convicted of DC Code felonies.\n\nThank you to Chair Maloney for prioritizing passage, which will improve reentry.\n\nStatement: https://t.co/wZRtI6ayOx","date":"Wed May 11 17:37:05 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill to establish a national effort to promote healthy lifestyles through nutrition and exercise.\n\nRelease: https://t.co/kpG834rAUi","date":"Tue May 10 19:31:31 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I announced @OversightDems will mark up my bill to require the Federal Bureau of Prisons to provide information to DC on individuals convicted of DC Code felonies in BOP custody on Wednesday. This bill would improve reentry and reduce recidivism.\n\nDetails: https://t.co/dnewKy2sO6","date":"Mon May 09 20:55:04 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"After receiving no response to our September 2021 letter, @RepDonBeyer and I wrote the Capitol Police Board again to request they require Capitol Police officers to use body and dashboard cameras.\n\nLetter: https://t.co/3e6BIsi99g","date":"Mon May 09 17:02:50 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Federal agencies should have no authority to approve or review the development of DC-owned land or private land in DC.\n\nI’ve introduced bills to strip all federal agencies of this authority.\n\n#HandsOffDC #DCStatehood\n\nArticle: https://t.co/gQ0b72zAFD","date":"Mon May 09 14:17:58 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood Fact of the Week: DC residents are like Americans in all the states.\n\nThey’re teachers, health care professionals, retail workers, chefs. All are denied voting representation in Congress and full home rule simply because they live on one side of a border. https://t.co/uh89lVPWny","date":"Fri May 06 13:34:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"A future Republican Congress may try to ban abortion in DC. We will never allow that to happen.\n\nStatement: https://t.co/WX8HkaDMTH","date":"Wed May 04 18:10:06 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m horrified by the Supreme Court’s draft order. Congress must immediately codify the right to abortion in federal law.\n\nThe draft order is also a reminder to the country that the lack of #DCStatehood means DC residents are uniquely subject to the whims of Congress.","date":"Wed May 04 18:10:06 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This week, Public Service Recognition Week, we recognize the essential role public servants play in maintaining our infrastructure, responding to disasters, managing our parks, and more. DC is home to many public servants, and we thank them for all that they do. #PSRW","date":"Tue May 03 20:53:41 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today @Call_Me_Dutch and I introduced the RECOVER Act to provide free lifetime identity protection to federal employees + contractors whose personal information was compromised by OPM in 2015.\n\nRelease: https://t.co/qt382Xdq9M","date":"Tue May 03 16:08:21 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Having previously succeeded in preventing the closure of the Department of Veterans Affairs health care clinic in Southeast DC, I am disappointed the VA has again proposed closing this clinic. I will continue to fight to prevent its closure.\n\nStatement: https://t.co/w165jVo0Kb","date":"Tue May 03 15:00:22 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The horrifying draft SCOTUS opinion would not only end the constitutional right to abortion but threaten other constitutional rights.\n\nIt’s also a unique threat to DC women. A Republican Congress could ban abortion in DC.\n\n#HandsOffDC #DCStatehood","date":"Tue May 03 13:46:43 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased the Army Corps today officially withdrew its proposed rule restricting public access to the Washington Channel. However, I’m continuing to work to pass my bill to prohibit any such rule in the future.\n\nRelease: https://t.co/owRPC7mJRC","date":"Mon May 02 18:55:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"After learning that the families of two pedestrians killed in a car crash at Hains Point in DC last year still have not received the information required for them to file a life insurance claim, I wrote NPS demanding answers.\n\nStatement: https://t.co/GYDej5D9CU","date":"Mon May 02 15:20:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"NJ reported $2 million in sales on the first day of commercialization of recreational marijuana.\n\nCongress, with POTUS’s support, prohibits DC from commercializing rec. marijuana, depriving DC millions of dollars in tax revenue. #HandsOffDC #DCStatehood.\n\nhttps://t.co/tthr3jzzB6","date":"Fri Apr 29 20:56:57 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, I wrote Postmaster General DeJoy about the increase in delayed and undelivered mail throughout DC and USPS's unresponsiveness to my office's inquiries.\n\nRelease: https://t.co/fe47vYV9AI","date":"Fri Apr 29 13:49:12 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood fact of the week: 5,000 DC residents were casualties of World War I, World War II, the Korean War and the Vietnam War, giving their lives and bodies for a country that denied them voting representation in Congress. https://t.co/vmTsu9nUWS","date":"Fri Apr 29 13:00:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Now:","date":"Wed Apr 27 18:22:32 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, President Biden, on my recommendation, nominated Ana Reyes to the US District Court for DC. If confirmed, she will be the first Hispanic woman and the first openly LGBTQ person to ever serve on that court.\n\nStatement: https://t.co/tYnFKM9SDq","date":"Wed Apr 27 16:32:18 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As chair of the Subcommittee on Highways and Transit, I'll hold a hearing this afternoon on how the Bipartisan Infrastructure Law will enable local hiring and provide good-paying union jobs.\n\nWatch at 2:00: https://t.co/gfgnWjFdNs https://t.co/aaAvibcEuA","date":"Wed Apr 27 16:04:53 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced a bill to clarify due process rights for federal employees serving in sensitive positions that would restore the right to appeal agency decisions for at least 200,000 federal workers.\n\nStatement: https://t.co/4VcbEiDa6P","date":"Wed Apr 27 14:53:46 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This week, I introduced my 100th bill this Congress. Today, I highlighted the legislative progress on the bills.\n\nStatement: https://t.co/QwsaSgP7Tc","date":"Wed Apr 27 14:31:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"We heard from DC resident Mike Salamon, who filed his 2020 tax return but never heard from the IRS about his refund, despite multiple attempts at contact.\n \nMike's in between jobs and has three children.\n\nhttps://t.co/AQjYC2frSW","date":"Tue Apr 26 18:32:46 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week, @OversightDems held a hearing on the enormous IRS backlog.","date":"Tue Apr 26 18:32:45 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This week is National Infertility Awareness Week. #WeCanAll uncover the facts, educate others, and change their perceptions about infertility. #NIAW2022 https://t.co/AT2tCXiVT7","date":"Tue Apr 26 17:08:12 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/sXWFgZleD0","date":"Tue Apr 26 16:41:35 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"On Saturday, I spoke at the National Cannabis Festival about the rider prohibiting DC from using local funds to commercialize recreational marijuana, my bill to allow marijuana in federally assisted housing in jurisdictions where it is legal, and progress on #DCStatehood.","date":"Tue Apr 26 16:41:35 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week, the Quiet Skies Caucus, which I co-chair, wrote to @SecretaryPete requesting five community representatives be added to the NextGen Advisory Committee, which provides advice and recommendations to the FAA.\n\nRelease: https://t.co/ZnJBdxyhlx","date":"Tue Apr 26 15:03:53 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Sadly, there are few if any congressional Republicans who agree with him on D.C. voting rights today or who nurture his instinct for bipartisanship.\n\nStatement: https://t.co/w37G791uAX","date":"Mon Apr 25 19:06:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I was saddened to hear of the passing of former Senator Orrin Hatch. He was a friend and supporter of giving DC House voting representation and recognized taxation without representation is un-American.","date":"Mon Apr 25 19:06:02 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As chair of the Subcommittee on Highways &amp; Transit, I will hold a hearing titled \"Examining Workforce Development and Job Creation in Surface Transportation Construction” on Wednesday at 2:00 pm.\n\nDetails: https://t.co/bwOVWWwnLi","date":"Mon Apr 25 18:43:04 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This Congress is our best chance to act on climate change! \nRead it here: https://t.co/OqkGPpE3mJ","date":"Fri Apr 22 21:43:31 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"To celebrate #EarthDay, I wrote an op-ed for @TheHill calling for bold climate action in 2022. \nI am proud to have advocated for the environmental issues that affect D.C. residents most and will continue to champion these issues so our city can have a more livable future. https://t.co/jJmMgWkSpP","date":"Fri Apr 22 21:43:30 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood Fact of the Week: 200,000 DC residents have served in the military since World War I.\n\nDC residents have given their blood and treasure to support the United States with no voting representation in Congress. https://t.co/SOSg3cLVDO","date":"Fri Apr 22 13:15:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"One year ago today, the House passed the #DCStatehod bill.\n\nThat was the second year in a row the House passed it and only the second time in history either chamber had passed it.\n\nIt’s long past time for the Senate to pass it and send it to President Biden, who will sign it.","date":"Fri Apr 22 04:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill to allow breastfeeding mothers, upon their request, to be excused from jury duty in federal court and in the federally controlled DC Superior Court.\n\nDetails: https://t.co/joUtbuO2iz","date":"Thu Apr 21 14:04:56 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, recreational marijuana sales began in New Jersey, allowing the state to tax and regulate recreational marijuana.\n\nCongress prohibits DC from doing so, but #DCStatehood would free DC from congressional interference.","date":"Thu Apr 21 11:07:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 1:45 today, #420, I’ll talk to @ChuckTodd about the rider prohibiting DC from spending its local funds to commercialize recreational marijuana and how it’s connected to #DCStatehood.\n \nWatch on MSNBC.","date":"Wed Apr 20 16:40:50 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"It’s one thing for #DCStatehood opponents to leverage the filibuster to maintain DC's marijuana rider, but the Biden admin has never adequately explained how the president can support #DCStatehood while simultaneously supporting a rider dictating how DC can spend local funds.","date":"Wed Apr 20 13:04:43 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on 4/20, I again express my deep disappointment that President Biden’s FY 23 budget proposes continuing to prohibit DC from spending its local funds on commercializing recreational marijuana.","date":"Wed Apr 20 13:04:43 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":".@OversightDems recently held a hearing on greening Postal Service vehicles.\n\nAs chair of the Subcommittee on Highways &amp; Transit, I'm leading the efforts to green the surface transportation sector, including our Postal Service vehicles.","date":"Tue Apr 19 20:08:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As DC residents, who pay more federal taxes than the residents of 23 states, rushed to mail checks to the IRS yesterday, I called on the Senate to end #TaxationWithoutRepresentation by passing the House-passed #DCStatehood bill.\n\nStatement: https://t.co/ssbeV7kiss","date":"Tue Apr 19 19:14:04 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This year, the holiday fell two days before the deadline for filing federal taxes, highlighting how DC residents were the first to be freed from slavery but the last to continue facing taxation without representation.\n\nStatement: https://t.co/nkevRu9Wix","date":"Tue Apr 19 19:06:28 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week, I introduced a resolution for Emancipation Day, the DC holiday that commemorates the signing of the DC Compensated Emancipation Act, which freed 3,100 enslaved people in DC, nine months ahead of the Emancipation Proclamation.","date":"Tue Apr 19 19:06:28 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Federal taxes are due today.\n\nI hope residents of states take a moment to reflect on the fact that the 690,000 DC residents pay the same federal taxes as they do but are denied the same voting representation in Congress.\n\n#DCStatehood is the just solution. https://t.co/3qLtKEe6Ze","date":"Mon Apr 18 04:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"On the anniversary of the start of the Civil War, I introduced a bill to recognize and preserve the Civil War Defenses of Washington by redesignating them as a national historic park.\n\nStatement: https://t.co/hMZWTmJcoT","date":"Fri Apr 15 15:55:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood Fact of the Week: Until DC has statehood, Congress will retain complete legislative authority over DC, and now House Republicans are threatening to abolish the local DC government if they take the majority next Congress. https://t.co/TkEXMwlNes","date":"Fri Apr 15 13:02:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tax Day is April 18.\n\nWe are reminded that Congress prohibits DC from spending the local tax dollars DC raises for abortions for low-income women and commercializing recreational marijuana, even though states are able to spend their own tax dollars for both purposes.\n#DCStatehood https://t.co/OH77gR1TMI","date":"Fri Apr 15 12:51:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @TomRoussey7News about the buses of asylum-seekers Texas Governor Abbott has sent to DC.\n\nWatch today at 4:00 on @7NewsDC.","date":"Thu Apr 14 19:22:23 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As the chair of the Subcommittee on Highways and Transit, I spoke to @MacFarlaneNews for CBS about the security vulnerabilities in our transit systems in the wake of the tragic subway shooting in NYC.","date":"Thu Apr 14 18:15:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m proud to be one of the House members that Russia imposed sanctions on for our opposition to its barbaric war in Ukraine and for our support of Ukraine. \n\nI will continue to support Ukraine and its people. \n\nI’m feeling no pain!\n\nhttps://t.co/YjDVLCacpk","date":"Thu Apr 14 17:35:40 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Federal and DC taxes are due on April 18.\n\nDC residents have no say on how their federal taxes are spent and Congress has the final say on how their local taxes are spent. #DCStatehood https://t.co/tp5d4W7bPp","date":"Thu Apr 14 11:50:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@NotoriousRBF @Acyn @MayorBowser @theHillisHome","date":"Wed Apr 13 22:37:32 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"April 18 is Tax Day. A primary grievance listed in the Declaration of Independence was #TaxationWithoutRepresentation.\n\nNearly 250 years later, the 690,000 DC residents continue to be taxed without voting representation in Congress.\n\n#DCStatehood is the solution. https://t.co/bXJtQoRVuc","date":"Wed Apr 13 13:02:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I announced I’m extending the deadline to apply for FY23 Community Project Funding, formerly known as earmarks, to 5:00 pm on Monday, April 18th. \n\nDetails: https://t.co/5TN0LhM1gH","date":"Tue Apr 12 16:45:33 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I sent a letter with @ChrisVanHollen, @SenatorCarper, @RepMaloney, + @RepAnthonyBrown to the House &amp; Senate Armed Services Committees requesting our bill to give DC's mayor control of DC's National Guard be included in the fiscal year 2023 NDAA.\n\nRelease: https://t.co/T5f4JX1lUU","date":"Tue Apr 12 13:38:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Federal taxes are due April 18. DC pays more in federal taxes than: AL, AK, DE, HI, ID, IA, KS, ME, MS, MT, NE, NV, NH, NM, ND, RI, SD, UT, VT, WV, and WY.\n\n#DCStatehood would end taxation without representation.","date":"Tue Apr 12 13:02:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Federal taxes are due in one week. DC pays more federal taxes per capita than any state and more federal taxes than 21 states, yet DC residents have no voting representation in Congress.\n\nIt is long past time for the Senate to pass the House-passed #DCStatehood bill. https://t.co/qdMpfyediW","date":"Mon Apr 11 19:05:53 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood Fact of the Week: It is plainly constitutional.\n\nAll 37 new states were admitted by Congress.\n\nCongress has reduced the size of the fed district.\n\nSee letter from leading constitutional scholars, including @TribeLaw, on the constitutionality: https://t.co/BwalvJze4c https://t.co/BQEyH463aG","date":"Fri Apr 08 13:21:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"https://t.co/yGnS3qrh8c","date":"Thu Apr 07 20:58:23 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased the Army is no longer pursuing its proposed rule to restrict public access to the Washington Channel. However, I’m continuing to work to ensure the Army formally withdraws its proposal and to pass my bill to prohibit the Army from proposing such a rule in the future.","date":"Thu Apr 07 20:58:22 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m very pleased the Senate confirmed Ketanji Brown Jackson for SCOTUS. I’m proud to have recommended her to Obama for the US District Court for DC. However, the vote on confirmation was a stark reminder that DC has no vote on judicial or executive branch nominees. #DCStatehood","date":"Thu Apr 07 18:34:35 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Despite the lingering #Zebragate rumors, I was hard at work for the people of DC when the alleged aggressive encounter with the fox occurred.","date":"Tue Apr 05 20:13:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today's shenanigans involving @TheCapitolFox, a wild creature Capitol Police captured after it invaded Capitol Hill and Twitter, are exactly why my bill allowing commercial filming on Capitol Hill should be passed.\n\nReal life is better than fiction. https://t.co/CEkdOP92gy","date":"Tue Apr 05 20:13:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/u1eo3jmYns","date":"Tue Apr 05 17:13:39 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This week’s debate and vote on the historic confirmation of Judge Jackson, who will be the first Black woman on the Supreme Court, is tempered by the fact that DC residents have no senators and, therefore, will not have a say in this victory. #DCStatehood.","date":"Tue Apr 05 17:13:39 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/X8xRkVgVRN","date":"Tue Apr 05 16:16:57 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Following a recent court ruling that the DC Human Rights Act doesn’t apply to employees of the local DC courts, I’m introducing a bill to make it applicable.\n\nAs the first woman to chair the EEOC, I’m continuing my efforts to protect workers from discrimination.","date":"Tue Apr 05 16:16:57 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on National Library Workers Day, we must express our gratitude for library workers in the District of Columbia and across the country! DC’s 26 public libraries could not function without the amazing dedication of our community’s library workers. #LoveLibraryWorkers https://t.co/28QawRZTKb","date":"Tue Apr 05 15:45:02 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As the Capitol reopens, I introduced a bill yesterday to allow commercial filming on Capitol grounds when Congress is out of session.\n\nIn our open and free democracy, it should be unthinkable to deny access to film one of our nation’s most iconic democratic symbols.","date":"Tue Apr 05 15:33:06 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/O3ax9cxj3z","date":"Tue Apr 05 15:33:06 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Bruce Johnson, the fabled DC journalist with whom I worked from when I was first elected to Congress, in 1990, until he retired, in 2020, passed away. He became a friend to me over the years, and my sincere condolences go out to his family and friends as they mourn his loss.","date":"Mon Apr 04 18:37:06 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/Ra81TQAgQo","date":"Mon Apr 04 18:37:06 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Judge Ketanji Brown Jackson’s nomination for the Supreme Court is historic, except in one respect.\n\nDC, as with every other SCOTUS nominee in history, will have no vote on confirmation, even though DC and its residents are bound by the court’s rulings. #DCStatehood","date":"Mon Apr 04 17:19:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m deeply disappointed the president’s proposed FY23 budget prohibits DC from using its local funds to commercialize recreational marijuana.\n\nIt’s difficult to reconcile the budget with his support for #DCStatehood, which would end congressional interference in DC local affairs.","date":"Mon Apr 04 13:53:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/qJ6Xn0Bd3x","date":"Fri Apr 01 20:56:59 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today I announced I will introduce a bill designed to give DC the same number of appointments to our nation's prestigious military service academies as the states. Our residents, who have fought and died in every American war, deserve this equality.","date":"Fri Apr 01 20:56:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood Fact of the Week: DC’s population (690,000) is larger than the populations of Wyoming and Vermont.\n\nSix states have fewer than one million residents. https://t.co/uHiHWqmIoU","date":"Fri Apr 01 13:04:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Are you a D.C. Veteran? Do you live in Ward 7? \n\nI am working with @dc_ova to hold focus groups for veterans in Ward 7 on April 5th, 2022.\n\nIf you are a veteran living in Ward 7 and want to participate, please fill out the interest form: https://t.co/eUIt9ga3De https://t.co/D8jLhRaYdo","date":"Wed Mar 30 13:02:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I announced the process for FY23 Community Project Funding requests, which are due to my office by noon on April 13th.\n\nDetails: https://t.co/oFEYYuKfk1","date":"Tue Mar 29 18:10:19 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As a member of the Ukraine Caucus, I was pleased to join visiting members of Ukraine's parliament today to discuss Russia's war and hear directly from them what the US can do to help. https://t.co/fREcZ5Ga48","date":"Tue Mar 29 17:34:09 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I highlighted the legislative progress on my bills this Congress. I've introduced *91* so far, with more to come. \n\nI was ranked as the most effective House Democrat in the 115th Congress by @TheLawmakers and continue to be ranked highly.\n\nDetails: https://t.co/tIt8Qb3LKE","date":"Tue Mar 29 17:01:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In addition, the budget released today also includes a $127m increase to GSA's portion of the St. Elizabeths DHS HQ consolidation.\n\nStatement: https://t.co/na4ZPIMis9","date":"Mon Mar 28 20:44:02 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The budget released today includes many victories for DC, including an increase in the max annual and lifetime awards through DCTAG; additional $50m for Howard U Hospital; $30m for DC emergency planning; and exemption for DC from federal shutdowns.","date":"Mon Mar 28 20:44:02 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I received a Navy Crest in my office today in recognition of my sponsorship of the USS Columbia, the first of a new class of nuclear-powered submarine named after the #51stState. https://t.co/UAtbZmAugz","date":"Mon Mar 28 17:52:27 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today I reintroduced my bill to require federal agencies to include the amount they spent on ad contracts with businesses owned by women and minorities in the previous fiscal year in their annual budget justifications.\n\nStatement: https://t.co/asm6dIe18N","date":"Mon Mar 28 16:44:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In a 2016 referendum, 86 percent of DC residents voted for statehood, and DC residents have been fighting for voting representation in Congress and full local self-government for more than 200 years.","date":"Fri Mar 25 12:47:13 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC has a larger population than 2 states, pays more federal taxes than 21 states, pays more federal taxes per capita than any state, has a larger budget than 12 states, has a larger gross domestic product than 17 states, has a triple-A bond rating.","date":"Fri Mar 25 12:47:13 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood fact of the week: There are no prerequisites in the Constitution for admission, but Congress has generally considered three factors: population and resources, support for statehood, + commitment to democracy.\n\nI’ll explain in future tweets how DC complies with each. https://t.co/52mCiFRC4Y","date":"Fri Mar 25 12:47:12 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Parole and Supervised Release Act would give DC the authority to make parole and supervised release determinations for individuals convicted of felonies under the DC Code.\n\n#FreeAndEqualDC","date":"Thu Mar 24 13:36:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Despite the Army's announcement that it will pause a proposed rule restricting public access to the Washington Channel, I will continue working to get the proposed rule formally withdrawn and to pass my bill prohibiting such restrictions in the future.","date":"Wed Mar 23 19:31:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/A4I1FWD1Mv","date":"Wed Mar 23 19:31:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While I’m pleased the Capitol will reopen for a limited number of tours, given the effectiveness of COVID-19 vaccines and the importance of America's symbols of democracy being open to the public, the reopening should occur more quickly than currently planned.","date":"Wed Mar 23 19:11:22 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/J58UZimlRV","date":"Wed Mar 23 19:11:22 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC CFO Salary Home Rule Act would give DC the authority to set the maximum salary for the DC CFO.\n\n#FreeAndEqualDC","date":"Wed Mar 23 13:35:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Are you a DC veteran?\n\nI’m working with @dc_ova to hold focus groups for DC veterans in each of DC’s 8 wards.\n\nIf you're a veteran in DC and want to participate, please fill out the interest form: https://t.co/DcoLwmhmF6 https://t.co/TgwunzsKBD","date":"Wed Mar 23 13:00:02 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As co-chair of the Quiet Skies Caucus, I will be introducing a bill to require helicopters in DC airspace to fly at the maximum altitude allowed by the FAA.\n\nRelease: https://t.co/50AMITDgT4","date":"Wed Mar 23 12:44:31 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week, I participated in an @OversightDems hearing on federal support for HBCUs.\n\nIn the FY 22 omnibus appropriations bill, I got $100 million for a new Howard University Hospital.  \n\nI also succeeded in a years-long fight to get equal HBCU funding for the University of DC.","date":"Tue Mar 22 20:03:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"State and local governments provide fire and emergency services to these properties, and my bill would allow them to recoup some of the cost for those services.\n\nRelease: https://t.co/Ony9Lmr8zS","date":"Tue Mar 22 19:11:05 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, I introduced a bill to allow state and local governments, including DC, to impose sales tax on purchases at gift shops on federal property.","date":"Tue Mar 22 19:11:05 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on the 50th anniversary of the @DemWomenCaucus, the woman I'm highlighting is Judge Ketanji Brown Jackson – one of the most qualified SCOTUS nominees ever. https://t.co/r6FMqqrLt5","date":"Tue Mar 22 18:39:22 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My Pittman-Robertson Wildlife Restoration Act and Dingell-Johnson Sport Fish Restoration Act DC Equality Act would make DC eligible for funding under these programs in the same manner as states.\n\n#FreeAndEqualDC","date":"Tue Mar 22 13:35:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Aircraft noise is of particular concern to the many DC residents who face near-constant helicopter and airplane noise over their homes, causing sleep disruptions and even structural damage. I’m working to combat it.","date":"Mon Mar 21 19:53:58 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As a member of the Aviation Subcommittee and as co-chair of the Quiet Skies Caucus, I chaired part of last week's @TransportDems subcommittee hearing on aircraft noise.","date":"Mon Mar 21 19:53:58 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Ketanji is another word for justice. https://t.co/s2NFyRN4S5","date":"Mon Mar 21 16:32:18 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While our goal is #DCStatehood, I’ve been busy introducing bills to expand home rule and equality for DC until we achieve statehood.\n\nI call this my #FreeAndEqualDC series of bills. https://t.co/wq4OuBzGnS","date":"Thu Feb 24 21:46:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Without #DCStatehood, DC has no senators and, therefore, will play no role in her confirmation, although Judge Jackson lives in DC, served in DC and was born in DC.\n\nStatement: https://t.co/ICu562ioDg","date":"Mon Mar 21 16:00:16 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, the Senate Judiciary Committee began its hearing on Judge Ketanji Brown Jackson, my recommendation to Obama for the US District Court for DC, for the Supreme Court. https://t.co/HHAcTD1OqB","date":"Mon Mar 21 16:00:15 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Federal Officials Residency Equality Act would require US circuit and district court judges, US Attorney and US Marshals for DC to reside in DC.\n\n#FreeAndEqualDC","date":"Mon Mar 21 13:34:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Read about the outrageous unequal treatment of DC for FY 22 earmarks: https://t.co/jgKwr3NGbz","date":"Fri Mar 18 19:27:56 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Another reason for #DCStatehood:\n\nDC was shortchanged $100s of millions in FY 22 earmarks because DC doesn’t have any senators to request earmarks, even though DC residents pay the same federal taxes as state residents — in fact, the highest per capita in the US.","date":"Fri Mar 18 19:27:56 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Pleased to see the DC Clemency Board accepting applications for clemency recommendations to the president, but those convicted of DC Code offenses should not be reliant on presidential mercy.\n\nMy DC Clemency Home Rule Act would give DC clemency authority for DC Code offenses.","date":"Fri Mar 18 16:52:51 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Non-Discrimination Home Rule Act would eliminate the applicability of the Religious Freedom Restoration Act of 1993 to DC.\n\n#FreeAndEqualDC","date":"Fri Mar 18 13:34:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced a bill to permit the US flag to be flown at half-staff in the event of the death of DC’s Mayor.\n\n#FreeAndEqualDC","date":"Thu Mar 17 13:33:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I participated in a @TransportDems hearing on proposals for the Water Resources Development Act of 2022.\n\nAmong other items, I have requested studies on a secondary drinking water source for DC and flood mitigation in Federal Triangle.\n\nRelease: https://t.co/PZD7nJffnI","date":"Wed Mar 16 18:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Are you a DC Veteran?\n\nI’m working with @dc_ova to hold focus groups for DC Veterans in each of DC’s 8 wards.\n\nIf you're a veteran in DC and want to participate, please fill out the interest form: https://t.co/DcoLwmyY3G https://t.co/2raDDRGzMb","date":"Wed Mar 16 15:41:17 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Zoning Commission Home Rule Act would give DC the authority to appoint all members of the Commission.\n\n#FreeAndEqualDC","date":"Wed Mar 16 13:32:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow at 6:00 pm, I will host a virtual community meeting to discuss freight rail noise and vibration in the Deanwood neighborhood.\n\nTo attend, RSVP by emailing NortonEvents@mail.house.gov by 3:00 pm tomorrow.\n\nDetails: https://t.co/tqQE93jkpe","date":"Tue Mar 15 18:17:34 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased the federal government will stop asking for a job applicant’s salary history.\n\nMy bill prohibiting employers from asking for an applicant’s salary history passed the House. The salary history question perpetuates the gender + racial wage gap.\n\nhttps://t.co/yJ11N28dNv","date":"Tue Mar 15 18:04:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Just as providing K-12 education is essential, universal prekindergarten is an investment that we must make as a nation to ensure every child has the opportunity to succeed.\n\nRelease: https://t.co/Zc7x1b697Y","date":"Tue Mar 15 14:06:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my bill to provide universal prekindergarten to every child in the country, regardless of income.","date":"Tue Mar 15 14:06:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on #EqualPayDay, I highlighted the three bills I have introduced this Congress to help close the pay gap for women and minorities.\n\nAs the first woman to chair the US EEOC, I've fought my entire career to ensure fairer workplaces.\n\nRelease: https://t.co/5pzysiBC8H https://t.co/bp6ofgKqlp","date":"Tue Mar 15 13:35:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My National Capital Planning Commission DC Home Rule Act would remove the Commission’s authority over DC-owned property. \n\n#FreeAndEqualDC","date":"Tue Mar 15 13:31:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I announced the process for DC entities to apply for fiscal year 2023 National Defense Authorization Act community project funding, formerly known as earmarks.\n\nDetails on how to be considered: https://t.co/MJccc79Lv6","date":"Mon Mar 14 17:16:25 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This unequal treatment is particularly egregious because DC pays more federal taxes per capita than any state and more federal taxes than 21 states.\n\nStatement: https://t.co/eGD6PDfGT5","date":"Mon Mar 14 16:43:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Here’s the latest example of the lack of #DCStatehood costing the District: DC was shortchanged an estimated $90-200 million in earmarks in the omnibus appropriations bill the president will sign this week because we have no senators and therefore received no Senate earmarks.","date":"Mon Mar 14 16:43:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While our goal is #DCStatehood, I’ve been busy introducing bills to expand home rule and equality for DC until we achieve statehood.\n\nI call this my #FreeAndEqualDC series of bills. https://t.co/wq4OuBzGnS","date":"Thu Feb 24 21:46:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I sent a letter to the Federal Bureau of Prisons asking questions about its release planning for returning citizens after the alarming disappearance of DC resident Kevin Flythe.\n\nRead the article: https://t.co/RhlVwQKbnv https://t.co/dZz47Ylj7K","date":"Mon Mar 14 16:30:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My Commission of Fine Arts DC Home Rule Act would remove the Commission’s authority over DC-owned land and private property in DC.\n\n#FreeAndEqualDC","date":"Mon Mar 14 13:30:01 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Board of Zoning Adjustment Home Rule Act would give DC the authority to appoint all members of the Board. \n\n#FreeAndEqualDC","date":"Fri Mar 11 14:20:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My bill to allow local DC court nominees to be seated after a 30-day congressional review period, which is the same process used for legislation passed by the DC Council, must be passed by Congress and signed into law as soon as possible.\n\nDetails: https://t.co/l1m2owqWCE","date":"Thu Mar 10 14:58:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"By the end of March, there will be at least 13 judicial vacancies on the local D.C. courts, despite seven recent Senate confirmations.","date":"Thu Mar 10 14:58:48 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The deficiencies of the appointment system, which requires DC to wait for Senate action to staff its own local courts, have long been apparent and are contributing to a decline in public safety.","date":"Thu Mar 10 14:58:48 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Government Accountability Office Home Rule Act would repeal GAO’s authority over DC.\n\n#FreeAndEqualDC","date":"Thu Mar 10 14:27:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The appropriations bill released today contains many of my priorities for DC, including $40m for DCTAG and $100m for a new Howard University Hospital, but I’m deeply disappointed it maintains the DC abortion and marijuana riders.\n\nDetails: https://t.co/83HkdbKfSU\n\n#HandsOffDC https://t.co/WUJhGXzpyE","date":"Wed Mar 09 21:41:16 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Transportation Funding Equality Act would make DC eligible for funding under two federal transportation programs in the same manner as states.\n\n#FreeAndEqualDC","date":"Wed Mar 09 14:26:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke on the House floor today in support of a resolution condemning the recent bomb threats against Historically Black Colleges and Universities, including the two in DC, and reaffirming support for #HBCUs and their students.\n\nStatement: https://t.co/JH2NWYBNoH https://t.co/nsiGUfsN77","date":"Tue Mar 08 17:40:32 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"It’s time for the Capitol to reopen to visitors. DC relies heavily on its tourist economy. Vaccines have made tourism in DC safe, and Capitol security has improved since J6th.\n\nReopen the Capitol and let people enjoy its many offerings.\n\nSee my release: https://t.co/sB9KrG41zO https://t.co/qZr9QNgoWL","date":"Tue Mar 08 15:50:21 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Courts Home Rule Act would give DC the authority over the operations of the local DC courts.\n\n#FreeAndEqualDC","date":"Tue Mar 08 14:25:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"We must end road fatalities. That’s why I, as Chair of the Subcommittee on Highways and Transit, secured substantial new funding to protect the safety of all road users in the Bipartisan Infrastructure Law. \nhttps://t.co/EVXgggJa6b","date":"Mon Mar 07 21:22:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"It’s outrageous and, as we’ve seen, dangerous that the DC mayor doesn’t control the DC National Guard.\n\nGovernors of states and territories control their Guards. The House has passed my bill to give the mayor control, and the Senate must pass it now.\n\n#DCStatehood","date":"Mon Mar 07 18:36:15 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/lY5L5o7b92","date":"Mon Mar 07 17:59:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to Capitol Police Chief Manger for promptly and thoroughly briefing me today on the security situation regarding the two trucker convoys in the National Capital Region.\n\nI will continue monitoring the situation closely to ensure DC residents are kept safe.","date":"Mon Mar 07 17:59:13 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill to require the Federal Bureau of Prisons to provide information to the DC government on individuals convicted of DC Code felonies to help ensure DC has services for them ready when they return home from BOP.\n\nRelease: https://t.co/AlVZZCmQtz","date":"Mon Mar 07 17:27:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"After a trucker convoy reached the DC region and the Capitol Police Board issued an emergency declaration, I requested a briefing today from USCP Chief Manger to discuss the latest information and preparations so that DC residents remain safe.\n\nStatement: https://t.co/V4fQtnHMVg","date":"Mon Mar 07 16:12:13 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My McIntire-Stennis DC Equality Act would make DC eligible for forestry research funding in the same manner as states.\n\n#FreeAndEqualDC","date":"Mon Mar 07 14:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I participated in a call this morning with Ukrainian President @ZelenskyyUa. As a member of the Congressional Ukrainian Caucus, I applaud his courage and the courage of the Ukrainian people. Russia must immediately end its unprovoked and barbaric invasion.","date":"Sat Mar 05 21:24:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While our goal is #DCStatehood, I’ve been busy introducing bills to expand home rule and equality for DC until we achieve statehood.\n\nI call this my #FreeAndEqualDC series of bills. https://t.co/wq4OuBzGnS","date":"Thu Feb 24 21:46:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to the 50+ national and DC groups, led by @DrugPolicyOrg, that sent a letter today calling on Congress to remove the rider that prohibits DC from using its local funds to commercialize recreational marijuana. #HandsOffDC\n\nFull letter: https://t.co/09UzgGgrDH","date":"Fri Mar 04 20:39:18 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I retroactively secured the $755 million in the American Rescue Plan and got DC treated as a state, county and city for new fiscal relief in the ARP, since DC provides each level of service.\n\nRelease: https://t.co/c11mrGWCW0","date":"Fri Mar 04 17:17:37 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"They did this even though DC pays more federal taxes per capita than any state and more in federal taxes than 21 states.","date":"Fri Mar 04 17:17:37 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The Republican-led Senate intentionally treated DC as a territory instead of a state for fiscal relief in the CARES Act, depriving DC of $755 million during the most critical time of the pandemic.","date":"Fri Mar 04 17:17:37 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"At Tuesday’s @OversightDems hearing, I highlighted how DC has used the fiscal relief provided by the American Rescue Plan and how the CARES Act was one of the starkest examples in recent years of why Congress should grant #DCStatehood.","date":"Fri Mar 04 17:17:36 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Government Title Equality Act would redesignate the DC Mayor as Governor, @CouncilOfDC as Legislative Assembly, DC Councilmembers as Representatives, and Council Chair as Speaker.\n\n#FreeAndEqualDC","date":"Fri Mar 04 13:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I reintroduced my bill that would allow federal employees to purchase short-term disability insurance at group rates.\n\nThis bill is more important than ever with the emergence of long COVID.\n\nDetails: https://t.co/gjWQhpwJhT","date":"Thu Mar 03 19:46:07 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As Republicans threaten to abolish the DC government, this WaPo opinion piece is a good reminder that #DCStatehood, DC voting rights and DC home rule have always been racial justice issues.","date":"Thu Mar 03 19:26:20 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC is not going back to being a full colony. We are closer than ever to statehood.\n\nhttps://t.co/yirrZKQZaR","date":"Thu Mar 03 19:26:20 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I met with the National Park Service, Army Corps of Engineers, and Metro to discuss the unexploded ordnance found on Fort Totten Trail, and was reassured a thorough search of the area had been conducted without turning up additional issues.\n\nStatement: https://t.co/VDMFrjDAOv","date":"Thu Mar 03 19:22:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC will be the 51st state.\n\n#DCStatehood #HandsOffDC\n\nhttps://t.co/xlQwNoNJ0J","date":"Thu Mar 03 19:05:04 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"House Republicans continue to say that further limiting the autonomy of, or even abolishing, the DC government will be a top priority if they are in the majority next year.\n\nWe will not allow DC to be a full colony again.","date":"Thu Mar 03 19:05:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m very pleased POTUS nominated Judge Jackson, whom I recommended to Obama for the US District Court for DC, for the Supreme Court.\n\nHowever, it is outrageous that the nearly 700,000 DC residents will not have a vote on her confirmation. #DCStatehood https://t.co/LK9Of9mKjZ","date":"Thu Mar 03 17:25:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased the temporary fencing around the Capitol was taken down only days after being reinstalled, as I requested and as Members of Congress desired.\n\nI will continue to push for passage of my bill to prohibit the installation of permanent fencing at the Capitol Complex. https://t.co/wEje7OvS9Y","date":"Thu Mar 03 15:08:16 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Special Elections Home Rule Act would give DC complete authority over the dates of special elections for local DC offices.\n\n#FreeAndEqualDC","date":"Thu Mar 03 14:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I spoke on the House floor about the fastest job creation in US history. The US has had a faster recovery than every other economy in the G7. @POTUS’s American Rescue Plan was at the center of this achievement. \nSee my remarks below: https://t.co/aE2xk9nsfL","date":"Thu Mar 03 00:56:10 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you @LCVoters for selecting the #DCStatehood bill as one of the 22 most important environmental bills voted on in the House last year in your annual National Environmental Scorecard.\n\nDC statehood is supported by environmental, civil rights and labor groups, among others.","date":"Wed Mar 02 23:57:43 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/49RArtAjin","date":"Wed Mar 02 17:52:48 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m disappointed President Biden did not mention #DCStatehood in his State of the Union address last night, despite my conversations with the White House, his longtime support for DC statehood, and his discussion of other voting rights bills last night.","date":"Wed Mar 02 17:52:48 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Clemency Home Rule Act would give DC the authority to grant clemency to individuals convicted under DC law. \n\n#FreeAndEqualDC","date":"Wed Mar 02 14:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While our goal is #DCStatehood, I’ve been busy introducing bills to expand home rule and equality for DC until we achieve statehood.\n\nI call this my #FreeAndEqualDC series of bills. https://t.co/wq4OuBzGnS","date":"Thu Feb 24 21:46:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@NJDC07 Cheers.","date":"Wed Mar 02 03:02:55 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood.","date":"Wed Mar 02 02:48:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood.","date":"Wed Mar 02 02:33:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood.","date":"Wed Mar 02 02:30:27 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood.","date":"Wed Mar 02 02:24:35 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood.","date":"Wed Mar 02 02:16:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@chatelaineri @JBurchDC @BoShuff @raviperry @StudentsforDC @HUforDC @NJDC07 Thank you. #DCStatehood.","date":"Wed Mar 02 02:16:12 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@JBurchDC @51stDC You're welcome. I'm glad you could join!","date":"Wed Mar 02 02:08:55 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@JBurchDC @BoShuff @raviperry @StudentsforDC @HUforDC @NJDC07 #DCStatehood","date":"Wed Mar 02 02:06:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@BoShuff @JBurchDC @raviperry @StudentsforDC @HUforDC @NJDC07 Looks delicious. Can you bring me one?","date":"Wed Mar 02 02:05:55 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@NJDC07 @BoShuff @JBurchDC @raviperry @StudentsforDC @HUforDC @BaileysOfficial Love it.","date":"Wed Mar 02 02:05:33 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I announced my guests for tonight's State of the Union address will include several compelling activists for #DCStatehood:\n\n-@JBurchDC\n-@BoShuff\n-@RaviPerry\n-@StudentsforDC\n-@HUforDC\n-@NJDC07\n\nDetails: https://t.co/xw1Q9QzDK0","date":"Tue Mar 01 16:43:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Police Home Rule Act would eliminate the President’s authority to federalize the DC police department. \n\n#FreeAndEqualDC","date":"Tue Mar 01 14:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/ip8Wa2IbqG","date":"Mon Feb 28 23:59:06 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I called on @POTUS Biden to advocate for #DCStatehood in tomorrow's State of the Union address. \n\nHe's a longtime DC statehood supporter, but has never discussed it publicly as president, even though I have spoken to the White House about the importance of him doing so.","date":"Mon Feb 28 23:59:05 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"ICYMI: Here is the video of this morning’s historic ceremony unveiling DC’s second statue in the Capitol. DC, like each of the 50 states, now has two statues in the Capitol.\n\n#DCStatehood\n\nhttps://t.co/tJvbwGASgN https://t.co/vMS34SsteG","date":"Mon Feb 28 18:19:27 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This afternoon at 4, I will manage bills on the House floor on behalf of @HouseDemocrats.\n\nWatch: https://t.co/UGyJT0oRKq.","date":"Mon Feb 28 17:34:15 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"“The unveiling of this statue is a milestone in our ongoing march to make D.C. the 51st state.  D.C. residents have more than earned it.”","date":"Mon Feb 28 15:22:56 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"\"In 2020, the House passed the D.C. statehood bill.   Last year, the House passed the bill again, and the Senate held its second-ever hearing on the bill. Today, 54 percent of Americans support statehood for the residents of our nation’s capital.”","date":"Mon Feb 28 15:22:22 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"“D.C. has a larger population than two states.  D.C. pays more federal taxes per capita than any state and more in federal taxes than 21 states.  D.C. residents have served in every American war since the Revolutionary War.  Thirty-thousand current D.C. residents are veterans.”","date":"Mon Feb 28 15:21:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While our goal is #DCStatehood, I’ve been busy introducing bills to expand home rule and equality for DC until we achieve statehood.\n\nI call this my #FreeAndEqualDC series of bills. https://t.co/wq4OuBzGnS","date":"Thu Feb 24 21:46:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"“Yet, the nearly 700,000 D.C. residents are taxed without voting representation in Congress and Congress has complete authority over D.C.’s local affairs. Statehood is the remedy to this denial of democracy.”","date":"Mon Feb 28 15:20:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"“Pierre L'Enfant fought in the Revolutionary War, which was launched to end taxation without representation and to give consent to the governed.”","date":"Mon Feb 28 15:20:04 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"“Today, nine years later, D.C. takes its rightful place among the states in the Capitol with the unveiling of the Pierre L'Enfant statue.”","date":"Mon Feb 28 15:19:34 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"“However, Republicans fought my bill, calling it tantamount to granting D.C. statehood.  It took us 11 years to get D.C.’s first statue in the Capitol, of Frederick Douglass, which is displayed in Emancipation Hall.”","date":"Mon Feb 28 15:18:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"“Today’s unveiling was 20 years in the making.  In 2002, I first introduced a bill to give D.C. two statues in the Capitol, as states are entitled to have.”","date":"Mon Feb 28 15:18:10 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As @SpeakerPelosi, @WhipClyburn, @MayorBowser, @ChmnMendelson, and I unveil DC's second statue in the Capitol this morning, I released my remarks. #DCStatehood\n\nRelease: https://t.co/OMk0MuQB2m","date":"Mon Feb 28 15:16:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@DCStatehood_ But we got a second statue in the Capitol today.","date":"Mon Feb 28 15:11:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC National Guard Home Rule Act would give DC control over the DC National Guard. \n\n#FreeAndEqualDC","date":"Mon Feb 28 14:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today DC's second statue in the US Capitol will be unveiled in a ceremony hosted by @SpeakerPelosi. \n\nEach state is entitled to two statues in the Capitol, so DC’s second statue will be a symbolic step toward #DCStatehood.\n\nWatch at 10:00: https://t.co/6TqfFCaxSy","date":"Mon Feb 28 05:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While I understand the security concerns related to the trucker convoy and the State of the Union address that led to the reinstallation of temporary fencing around the Capitol today, I will work to ensure it comes down as soon as possible.\n\nStatement: https://t.co/WLax6S63kM","date":"Sun Feb 27 21:05:55 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow DC's second statue in the US Capitol will be unveiled in a ceremony hosted by @SpeakerPelosi. \n\nEach state is entitled to two statues in the Capitol, so DC’s second statue will be a symbolic step toward #DCStatehood.\n\nMore: https://t.co/tWIV0VyxLR","date":"Sun Feb 27 06:25:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In 2 days, DC's second statue in the US Capitol will be unveiled in a ceremony hosted by @SpeakerPelosi. \n\nEach state is entitled to two statues in the Capitol, so DC’s second statue will be a symbolic step toward #DCStatehood.\n\nMore: https://t.co/tWIV0VyxLR","date":"Sat Feb 26 06:25:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Legislative Autonomy Act would eliminate the congressional review period for DC bills.","date":"Fri Feb 25 19:06:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@JasonTVxoxo @AOC @Grace4NY Your wish is my command.","date":"Fri Feb 25 18:02:32 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, President Biden nominated Judge Ketanji Brown Jackson, whom I recommended to President Obama for the US District Court for DC.\n\nAppropriately, the nomination of the first Black woman to SCOTUS comes during #BlackHistoryMonth.\n\nStatement: https://t.co/ONLseUSDhF","date":"Fri Feb 25 17:59:41 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"On Monday at 10 a.m., DC's second statue in the Capitol will be unveiled in a ceremony hosted by Speaker Pelosi.\n\nEach state is entitled to two statues in the Capitol. #DCStatehood\n\nStatement: https://t.co/QYhHHyyRuB\n\nLive stream: https://t.co/jKrK8E7Xmv","date":"Fri Feb 25 15:03:10 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In 3 days, DC's second statue in the US Capitol will be unveiled in a ceremony hosted by @SpeakerPelosi. \n\nEach state is entitled to two statues in the Capitol, so DC’s second statue will be a symbolic step toward #DCStatehood.\n\nMore: https://t.co/tWIV0VyxLR","date":"Fri Feb 25 06:24:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC Prosecutor Home Rule Act would give DC the authority to prosecute all DC crimes.\n\n#FreeAndEqualDC","date":"Thu Feb 24 21:47:30 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While our goal is #DCStatehood, I’ve been busy introducing bills to expand home rule and equality for DC until we achieve statehood.\n\nI call this my #FreeAndEqualDC series of bills. https://t.co/wq4OuBzGnS","date":"Thu Feb 24 21:46:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My thanks to US Capitol Police Chief Manger for his comprehensive security briefing yesterday on the trucker convoy and next week’s State of the Union address. \n\nMore: https://t.co/c5phNfolYK","date":"Thu Feb 24 18:59:18 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"More: https://t.co/3CMAsCbXCi","date":"Thu Feb 24 15:07:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased to announce that @NatlParkService, at my request, will remove the name of Melvin Hazen from the area of Rock Creek Park in DC named for Hazen.\n\nHazen, a racist, helped demolish the African-American community in the DC neighborhood known as Reno City.","date":"Thu Feb 24 15:07:53 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced a bill to prohibit the Federal Bureau of Prisons from charging inmates copayments for health care visits.\n\nInmates should be encouraged to seek medical care, a critical component of their successful reentry into the community.\n\nDetails: https://t.co/qOTvAijaax","date":"Thu Feb 24 14:28:38 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @NicholasWu12 about the preparations being made in advance of the State of the Union address and the possibility of the trucker convoy reaching DC.\n \nRead the article here: https://t.co/AtW56otsf4","date":"Thu Feb 24 14:04:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In 4 days, DC's second statue in the US Capitol will be unveiled in a ceremony hosted by @SpeakerPelosi. \n\nEach state is entitled to two statues in the Capitol, so DC’s second statue will be a symbolic step toward #DCStatehood.\n\nMore: https://t.co/tWIV0VQ9ar","date":"Thu Feb 24 05:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In 5 days, DC's second statue in the US Capitol will be unveiled in a ceremony hosted by @SpeakerPelosi. \n\nEach state is entitled to two statues in the Capitol, so DC’s second statue will be a symbolic step toward #DCStatehood.\n\nMore: https://t.co/tWIV0VQ9ar","date":"Wed Feb 23 06:21:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I requested a meeting with Capitol Police Chief Manger to discuss security preparations for the trucker convoy and State of the Union address.\n\nThe meeting is scheduled for tomorrow afternoon.\n\nMore: https://t.co/RihwJrKQtx","date":"Tue Feb 22 22:10:33 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @RamirezReports about the possible reinstallation of temporary fencing at the Capitol ahead of the trucker convoy reaching DC and next week's State of the Union.\n\nWatch this evening at 5:00 and 6:00 on @Fox5DC.","date":"Tue Feb 22 21:45:31 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The trucker convoy is only the latest reminder that DC's mayor doesn’t have the authority to deploy the DC National Guard, unlike governors of states and territories for their Guards.\n\nMy DC National Guard Home Rule Act would give DC this authority, as would my #DCStatehood bill.","date":"Tue Feb 22 21:35:23 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In 6 days, DC's second statue in the US Capitol will be unveiled in a ceremony hosted by @SpeakerPelosi. \n\nEach state is entitled to two statues in the Capitol, so DC’s second statue will be a symbolic step toward #DCStatehood.\n\nMore: https://t.co/tWIV0VQ9ar","date":"Tue Feb 22 05:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In 7 days, DC's second statue in the US Capitol will be unveiled in a ceremony hosted by @SpeakerPelosi. \n\nEach state is entitled to two statues in the Capitol, so DC’s second statue will be a symbolic step toward #DCStatehood.\n\nMore: https://t.co/tWIV0VQ9ar","date":"Mon Feb 21 05:01:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Statement: https://t.co/Jk1WvY0HOY","date":"Fri Feb 18 17:42:32 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":".@Rep_Clyde wants to return DC to a full colony by abolishing the DC government and having Congress run DC.\n\nThis is a profoundly undemocratic throwback and deeply offensive to the nearly 700,000 residents of DC.\n\nWe will defeat his efforts + prevail on #DCStatehood. https://t.co/6T5j1dAXQt","date":"Fri Feb 18 17:42:31 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to Senate Democrats for defeating yesterday @TedCruz's amendment that would have prohibited DC from providing local funds to its schools because it has a COVID-19 vaccine mandate for students.\n\n#DCStatehood #HandsOffDC\n\nFull statement: https://t.co/QrnKbwI5vh","date":"Fri Feb 18 17:24:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Soon.","date":"Thu Feb 17 22:22:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congress owes DC veterans and servicemembers more than a debt of gratitude.\n \nThey’ve served and died for a country that denies them voting representation in Congress and full local self-government.\n \nThey deserve #DCStatehood.","date":"Thu Feb 17 15:07:56 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Leading up to this Valentine's Day, my office collected 501 Valentines from elementary schools across DC to be delivered to the Armed Forces Retirement Home.\n \nThanks to all the talented young people across DC for drawing such beautiful cards. https://t.co/Hy79KFxmZW","date":"Thu Feb 17 15:07:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow at 6:00 p.m., I will hold a virtual town hall meeting on infrastructure investments in Union Station. \n\nTo attend, RSVP by emailing NortonEvents@mail.house.gov by noon tomorrow, 2/17.\n\nMore: https://t.co/oSnLDbOGdh","date":"Wed Feb 16 19:56:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The Senate must confirm Dr. Lisa Cook to serve on the Federal Reserve Board of Governors. \n \nShe must be confirmed; further delay is not an option.","date":"Wed Feb 16 17:42:01 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced the DC Courts Improvement Act to make several changes to the local DC courts to help them run more efficiently to address the needs of DC.\n\nUnder the DC Home Rule Act, only Congress can make these changes.\n\nDetails: https://t.co/Hpk2ezpeuD","date":"Tue Feb 15 20:18:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week, I requested a meeting with the National Park Service, Army Corps of Engineers, and Metro to discuss the recent discovery of an unexploded ordnance on the Fort Totten Trail in DC.\n\nMore information: https://t.co/oTpWaUNyBK","date":"Tue Feb 15 18:33:57 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In 13 days, DC's second statue in the US Capitol will be unveiled in a ceremony hosted by @SpeakerPelosi. \n\nEach state is entitled to two statues in the Capitol, so DC’s second statue will be a symbolic step toward #DCStatehood.\n\nMore: https://t.co/tWIV0VQ9ar","date":"Tue Feb 15 18:10:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, I talked to @Meagan_Flynn about the recent radical Republican attacks on DC home rule.\n\nRead the article here: https://t.co/LQgZ8diXjO","date":"Tue Feb 15 17:20:45 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My love language is #DCStatehood.\n\nHow about you?","date":"Mon Feb 14 20:54:09 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This great American statesman holds a special place in our country and in the hearts of DC residents, who chose his statue to represent the District in the Capitol.\n\nDetails: https://t.co/vuUtSa3ToX","date":"Mon Feb 14 20:49:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, we celebrate the 204th birthday of Frederick Douglass, a longtime DC resident avid proponent of equal rights for DC residents.","date":"Mon Feb 14 20:49:52 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"https://t.co/JCbQ8CfhW7","date":"Mon Feb 14 20:42:37 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I encourage you to read this article to see the utter contempt House Republicans have for all DC residents, a plurality of whom are Black. \n\nRepublicans want to abolish the DC government and have Congress manage DC.\n\nI will defeat their undemocratic efforts. #DCStatehood","date":"Mon Feb 14 20:42:37 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I highlighted the 22 bills in my #FreeAndEqualDC Series I've introduced this Congress.\n\nThough #DCStatehood is my first priority, at the same time, I'm working to ensure DC is treated equally to the states in smaller ways.\n\nDetails: https://t.co/G2bhWZJz2J","date":"Mon Feb 14 18:33:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@OversightDems DC residents have been contacting my office in record numbers about delayed and undelivered mail.\n\nThe situation is untenable. We need answers. Changes need to be made to the Postal Service, and quickly.","date":"Mon Feb 14 16:47:48 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While today's @OversightDems hearing is focused on the delivery issues in the Baltimore area, I would be remiss if I did not mention that DC is facing problems with delivery as well.","date":"Mon Feb 14 16:47:32 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week, I participated in an @OversightDems hearing on climate change. \n\nAs chair of the Subcommittee on Highways &amp; Transit, I'm leading the efforts in the House to combat climate change caused by the transportation sector.","date":"Mon Feb 14 16:12:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Republicans told the press they plan to try to limit DC's authority to govern itself if they take the House next Congress, including by repealing the Home Rule Act.\n\nSuch anti-democratic rhetoric shows they fear #DCStatehood is closer than ever.\n\nMore: https://t.co/oM98uAyrwi","date":"Mon Feb 14 13:48:31 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Mon Feb 14 13:24:05 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As Republican-led states try to stop the teaching of the role of race in American history, I introduced a bill to create a $30m grant program for schools to train teachers, principals and other personnel on implicit bias.\n\nDetails: https://t.co/ilBzvJqa0m","date":"Thu Feb 10 16:02:46 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC’s lack of autonomy has life-and-death consequences.\n\nCongress used to prohibit DC from using local funds on needle exchange.\n\nSince I got the prohibition removed, new HIV cases attributable to injection drug use have decreased by 99%, from 150 per year to 1. \n\n#DCStatehood","date":"Thu Feb 10 15:27:36 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 9:15 I'll be on @7NewsDC to recap yesterday's hearing on Metro.\n\nWatch: https://t.co/phsLLQYz0X","date":"Thu Feb 10 14:07:35 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The safety of our children at school is our number one priority and these threats must be investigated and prosecuted to the full extent of the law.","date":"Wed Feb 09 21:00:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The increasing number of bomb threats made against DC schools, including @DunbarHSDC, @RBHSMonarchs, and now @RooseveltHSDC, is deeply concerning and disruptive for our city.","date":"Wed Feb 09 21:00:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I warned in my remarks that these mail delivery problems in DC and throughout the country need immediate action. https://t.co/rcCbNZn3qp","date":"Wed Feb 09 17:45:43 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, I spoke on the House floor in support of the Postal Service Reform Act, which the House passed last night.\n\nI have repeatedly written to @USPS to raise my concerns about delayed and undelivered mail in DC.","date":"Wed Feb 09 17:43:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@TheOtherMandela Hello.","date":"Tue Feb 08 23:03:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @Meagan_Flynn about the bill Senator Booker and I are introducing to award the Congressional Gold Medal to the 200,000 African Americans who fought for the Union in the Civil War.\n \nhttps://t.co/YxiO6XGCQn","date":"Tue Feb 08 22:17:29 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Tue Feb 08 16:15:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Twenty years ago, I first introduced a bill to give DC two statues in the Capitol, like the states. Republicans fought the bill because they said it was tantamount to #DCStatehood.","date":"Tue Feb 08 14:49:21 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"It took 11 years to get DC’s first statue in the Capitol, and nine years later, DC is about to get its second. \n\nDC prevailed on the two statues, and DC will prevail on #DCStatehood.","date":"Tue Feb 08 14:49:21 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC’s statue of Pierre L'Enfant with join DC’s statue of Frederick Douglass, which I got moved to the Capitol in 2013.\n\nStatement: https://t.co/oajyOOmX2U https://t.co/DDnEArovAQ","date":"Mon Feb 07 17:32:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, @SpeakerPelosi and I announced that DC will score a major victory toward #DCStatehood on 2/28, when DC's second statue in the Capitol is unveiled in a ceremony. Under federal law, each state is entitled to two statues in the Capitol.","date":"Mon Feb 07 17:32:07 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As a member of Congress, I have a bill to create a national commission to combat sexual harassment.\n\nNo one should be subjected to sexual harassment or assault at their workplace.","date":"Mon Feb 07 16:43:16 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week, I was pleased to participate in the @OversightDems roundtable on workplace misconduct at the Wash Commanders.\n\nAs the first woman to chair the @USEEOC, I issued the first guidelines, later upheld by SCOTUS, holding sexual harassment as a form of gender discrimination.","date":"Mon Feb 07 16:43:15 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My statement: https://t.co/FVRwuM34qH","date":"Mon Feb 07 16:34:48 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In the 7th attack on local DC vaccine mandates this Congress, 49 Republicans vowed to vote against the FY22 appropriations bills unless they defund both federal and DC COVID-19 vaccine mandates.\n\nThe current FY22 continuing resolution expires on Feb. 18.","date":"Mon Feb 07 16:34:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The bomb threats made against HBCUs, including @HowardU and @UDC_EDU, and horrifyingly timed as #BlackHistoryMonth begins, are unacceptable and must be investigated and prosecuted to the fullest extent possible.\n\nhttps://t.co/w5NOC5IrvU","date":"Mon Feb 07 14:30:20 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@DCStatehood_ Boooo.","date":"Sun Feb 06 15:26:21 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"In my first term in Congress, in 1992, I had a bill signed into law authorizing a memorial on federal land in DC to honor the African Americans who fought for the Union in the Civil War. \n \nAs #BlackHistoryMonth begins, it is critical to remember these brave Americans.","date":"Fri Feb 04 20:54:59 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, in the first week of #BlackHistoryMonth, Senator @CoryBooker and I announced that we'll introduce a bill to award the Congressional Gold Medal to the 200,000 African American soldiers who fought for the Union in the Civil War.\n\nMore: https://t.co/9JJHHaHRKE https://t.co/3cDX8scNtq","date":"Fri Feb 04 15:14:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, the @OversightDems Committee passed my bill to require the Commanding General of the DC National Guard, the top official in the DCNG, to live in DC. \n\nThe Commanding General is appointed by the president and is a federal official.\n\nMore: https://t.co/kBotpRyBai","date":"Thu Feb 03 15:59:40 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This bill would prevent future presidents from moving federal agency headquarters away from the NCR to score political points, as Trump did.\n\nDetails: https://t.co/I97p4q6PRN","date":"Thu Feb 03 15:46:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my bill to prohibit the relocation of federal agency headquarters out of the National Capital Region without congressional approval.","date":"Thu Feb 03 15:46:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today at 10:00 I'll be participating in an @OversightDems roundtable on the workplace culture at the Washington Commanders.\n\nWatch: https://t.co/tHgTogrmzO","date":"Thu Feb 03 14:46:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Oh, just chairing a @TransportDems hearing on automated vehicles. So many witnesses, one gets thirsty!\n\nWatch here: https://t.co/j8kMke5pL7 https://t.co/0IKZXPnehO","date":"Wed Feb 02 19:28:48 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Full statement: https://t.co/aJrpZw5prE","date":"Wed Feb 02 17:01:12 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"After the Senate today confirmed the first local DC judge this Congress, I called for passage of my bill to eliminate the Senate confirmation requirement for these judges and to instead allow appointment after a review period, which is the same process used for DC bills.","date":"Wed Feb 02 17:01:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on the first day of #BlackHistoryMonth, I am reminded of Carter G. Woodson, the father of Black History Month. \n\nI had a bill signed into law that made his home in DC a unit of the National Park System.","date":"Tue Feb 01 18:38:40 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow at 11:00 am I will chair a @TransportDems hearing of the Highways &amp; Transit Subcommittee on automated vehicles. \n\nDetails: https://t.co/YgaITytlAV","date":"Tue Feb 01 13:09:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m very pleased DC Circuit Judge Ketanji Brown Jackson is widely considered a leading contender for the next Supreme Court justice. She is a #DC resident, was appointed to the US district court in DC by President Obama on my recommendation and would make an outstanding justice.","date":"Mon Jan 31 21:35:09 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The @OversightDems Committee will mark up my bill to require the Commanding Gen. of the DC Natl Guard, a federal official, to reside in DC. \n\nThe markup will be on Wednesday, 2/2 at 10:00 am and will be live streamed on the committee’s website.\n\nDetails: https://t.co/ez20uaCsip","date":"Mon Jan 31 17:26:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Fight climate change. Build high-speed rail. Pass it on. #CleanGreenHSR","date":"Mon Jan 31 16:55:45 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"One of my Twitter followers dreams of completing a list of each member of Congress's favorite Taylor Swift song, so I'm filling in one more entry.\n\nMy favorite @taylorswift13 song is:\n\nWe Are Never Ever Getting Back Together (with Maryland) (#DCStatehood) https://t.co/ckDkbU2Mkn","date":"Mon Jan 31 16:51:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I highlighted the legislative progress on my bills this Congress. I have introduced *80* so far, with more to come.\n\nI was ranked as the most effective House Democrat in the 115th Congress by the Center for Effective Lawmaking.\n\nDetails: https://t.co/OMVHxQ2Xr7 https://t.co/NU67mCiR5s","date":"Mon Jan 31 15:24:34 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@theHillisHome Let’s make it happen.","date":"Fri Jan 28 18:42:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As I have consistently done in the past, I will defeat these attacks on DC home rule. #HandsOffDC #DCStatehood\n\nDetails: https://t.co/Mx42BiDbyV","date":"Thu Jan 27 15:32:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"1) Education: Four attacks on DC education policy.\n\n2) Guns: One attack on DC gun policy.\n\n3) Health Care: 11 attacks on DC vaccine and abortion policies.\n\n4) Law Enforcement: Three attacks on DC law enforcement policy.\n\n5) Transportation: two attacks on DC traffic laws.","date":"Thu Jan 27 15:31:41 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"While I am accustomed to Republicans from far-away places introducing legislation to overturn local DC policies, this Congress they have been particularly active + intrusive.\n\nI'm treating this list as my official \"To Do\" list of legislation to defeat.\n\nLet's review.","date":"Thu Jan 27 15:06:53 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Updated link to live stream: https://t.co/ZJmnEWzM1W","date":"Thu Jan 27 14:26:59 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Later this morning, I’ll speak at a press event with @SecretaryPete and @SecondGentleman Emhoff to support an important DOT announcement regarding roadway safety.\n \nWatch starting at 9:30 am: https://t.co/cW7kRW83Zq","date":"Thu Jan 27 10:10:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@barbarageffen I’m working on it. #DCStatehood.","date":"Wed Jan 26 16:33:58 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":".@USPS responded to my recent letter, saying that the terminations amid the current DC-wide mail delivery crisis were of temporary employees, and it is taking other measures to increase delivery speed.","date":"Tue Jan 25 22:43:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will watch for results from the increased overtime, Sunday delivery, and ability to loan carriers to offices facing staffing challenges.\n\nDetails: https://t.co/vR5ecsifnE","date":"Tue Jan 25 22:43:47 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my bill to give DC complete authority to set the date of special elections for local offices, as other jurisdictions have.\n\nThis bill will strengthen DC's home-rule authority and does not require #DCStatehood.\n\nDetails: https://t.co/z6QUD70wKB https://t.co/JkvUL5koPk","date":"Tue Jan 25 14:30:15 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As federal tax filing season kicks off today, I remind the American people DC pays:\n\n✅More in federal taxes per capita than any state\n✅More federal taxes overall than 21 states\n\nYet DC residents still don’t have voting representation in Congress. The remedy is #DCStatehood.","date":"Mon Jan 24 20:19:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will hold a virtual town hall via Zoom on road safety for all users on Thursday, 1/27 at 6:00 pm. \n\nTo attend, RSVP by 5:00 on 1/26 by emailing NortonEvents@mail.house.gov.\n\nDetails: https://t.co/lCvMNdkB29","date":"Mon Jan 24 14:14:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#HandsOffDC","date":"Sat Jan 22 14:25:10 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#RoeVWade not only guarantees the legal right to abortion, but protects DC in particular.\n\nIf overturned, a future Republican Congress could ban abortions in DC completely.\n\nToday, on the 49th anniversary of Roe, we must recognize its significance while pushing to codify it. https://t.co/aYRUL6mn9m","date":"Sat Jan 22 14:17:34 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"My thanks to @SenSchumer for recognizing the vacancy crisis on the local DC courts and for putting an end to obstruction by @SenateGOP on the nominees to these courts by filing cloture today on 7 of these nominees.\n\nDetails: https://t.co/ML0N4B39F8 https://t.co/r2eeeZ3gCb","date":"Thu Jan 20 22:40:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/VRmZsxLIuI","date":"Thu Jan 20 20:40:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reiterated my pledge to defeat the 20+ bills and amendments filed this Congress to overturn local DC policies on issues ranging from vaccines and education to police and speed limits.\n\nThese attacks show the critical importance of #DCStatehood. https://t.co/syGlURAnjx","date":"Thu Jan 20 20:40:23 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@TriSalvagni @SharonsSpeaking #DCStatehood!","date":"Thu Jan 20 20:35:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"More #GoodTrouble. I thank @RepBowman for his sacrifice for the worthy cause of voting rights – at a time when focused attention is most necessary.","date":"Thu Jan 20 20:16:19 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@councilofdc Details: https://t.co/Bpa4ZaXrKj","date":"Thu Jan 20 16:07:22 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced a bill to redesignate the DC Mayor as Governor and @CouncilOfDC as Legislative Assembly.\n\nThe bill highlights that there would be a seamless transition to #DCStatehood since DC already operates like a state despite being denied equal rights. https://t.co/Deu4ocIQOh","date":"Thu Jan 20 16:06:13 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The @NRDems Committee passed my bill today to create a memorial on federal land in DC for enslaved persons.\n\nWe must honor the personhood of these individuals, who were repeatedly assumed to have none, so that they will never be forgotten.\n\nRelease: https://t.co/VT7EYIERl8","date":"Wed Jan 19 22:03:36 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I announced I will file legislation to direct @USACEHQ to conduct two studies: \n\nOne on alternative drinking water sources for DC in case the Potomac River becomes unusable, and the second on flood mitigation in the Federal Triangle area.\n\nDetails: https://t.co/wV6eGzwJlD","date":"Wed Jan 19 21:23:02 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to @ChrisVanHollen and @SenatorCardin for introducing the Senate companion to my bill with @RepRaskin to remove the name of segregationist Francis Newlands from Chevy Chase Circle, which is federal property.\n\nRead the @DCist piece for more: https://t.co/zEMDXGgAhS","date":"Wed Jan 19 20:16:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @ReporterCioffi of @RollCall about how food facilities in the Capitol complex are not subject to DC's common-sense COVID-19 vaccination documentation requirement, and why that's particularly dangerous. \n\nRead the article here: https://t.co/hxlqIGpGYI","date":"Wed Jan 19 18:38:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/QvefwRs81Z","date":"Wed Jan 19 18:24:59 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":".@SenRandPaul of KY introduced a bill to overturn two DC COVID-19 vaccine policies.\n\nHe is the 6th member this Congress to introduce a bill to overturn a DC vaccine policy. The others are from TX, UT + FL. \n\nI will defeat all of these undemocratic bills.\n\n#DCStatehood #HandsOffDC","date":"Wed Jan 19 18:24:59 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @SegravesNBC4 about the future of the #FreedomToVoteAct, voting rights in general, and #DCStatehood.\n\nWatch on @NBCWashington tonight at 5:00 and 6:15. https://t.co/Q0LTKcz8Ur","date":"Wed Jan 19 18:01:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":".@WashingtonPost columnist @byTheresaVargas wrote an excellent piece about @SenTedCruz's interference in DC vaccine policy and how the remedy is #DCStatehood.\n\nRead it here: https://t.co/uS2hynV5jC","date":"Tue Jan 18 20:44:00 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"More: https://t.co/ear4GcHHS9","date":"Tue Jan 18 18:36:16 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As the first woman to chair @USEEOC, which enforces pay equity laws, I will introduce a bill to require employers to provide salary range for jobs in ads &amp; interviews &amp; to existing employees.\n\nSalary transparency is an important tool to combat the gender &amp; race wage gap.","date":"Tue Jan 18 18:36:15 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"End the filibuster. Protect the right to vote. It's time. \n\n#PassItOn","date":"Tue Jan 18 15:52:29 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@DCStatehood_ Booo.","date":"Mon Jan 17 14:27:07 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@Lammie911 @RepThomasMassie Thank you!","date":"Mon Jan 17 03:43:30 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@TGradualness @RepThomasMassie Onward!","date":"Mon Jan 17 03:42:35 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@FalconLanaya @peggyhill755 @RepThomasMassie Wait till you see me surf.","date":"Mon Jan 17 03:42:17 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@Eric_Gilliland @RepThomasMassie Love is what justice looks like in public.","date":"Mon Jan 17 03:41:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@lmastand @RepThomasMassie Thank you!","date":"Mon Jan 17 03:41:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@CitizenWonk @RepThomasMassie You're welcome.","date":"Mon Jan 17 03:40:57 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@SharonsSpeaking @AnneMuntean @RepThomasMassie It is.","date":"Mon Jan 17 03:40:41 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@TheaterMichelle @RepThomasMassie You're welcome.","date":"Mon Jan 17 03:40:30 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@grace44america @RepThomasMassie I'm touched.","date":"Mon Jan 17 03:40:17 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@chrisncakes1 @RepThomasMassie Bless you.","date":"Mon Jan 17 03:39:58 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@Wunderchris @RepThomasMassie #DCStatehood","date":"Mon Jan 17 03:39:46 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@maraleia No, you're awesome.","date":"Mon Jan 17 03:37:17 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Would you like a sandwich too, @RepThomasMassie?\n\nYou'll feel better after you eat. There's even a word for feeling grumpy when you're hungry: Hangry.\n\nThere, there. It's going to be okay.","date":"Mon Jan 17 02:17:58 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@uhh_merica @mehdirhasan @RepThomasMassie Thank you.","date":"Sun Jan 16 05:06:05 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@RepThomasMassie Touché, sir.","date":"Sun Jan 16 04:56:53 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood Wordle","date":"Sat Jan 15 20:44:20 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@GPatrick Thanks!","date":"Sat Jan 15 20:24:29 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@lexjuareztv @RepThomasMassie DC won’t let them go hungry.","date":"Sat Jan 15 15:41:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@AbbyKorb Welcome!","date":"Sat Jan 15 11:23:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@RepSwalwell https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:54:12 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@atrupar https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:54:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@davejorgenson https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:53:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@JoJoFromJerz https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:53:36 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@OhDangitEvie https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:53:27 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@StaceyCKs1 https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:53:18 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@pamelafessler https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:53:09 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@JennaEllisEsq @RepThomasMassie https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:52:59 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@davidlitt https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:52:51 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@RepJohnYarmuth https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:52:38 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@ZaleskiLuke https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:52:29 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@AIWashburn https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:52:22 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@KeithOlbermann https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:52:12 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@PhilArballo https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:52:03 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@georgehahn https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:51:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@briantylercohen https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:51:41 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@PhantomShitlord https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:51:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@DaveBonazola https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:51:17 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will provide sandwiches this weekend to members of @RepThomasMassie's staff who're vaxxed + boosted but afraid they'll get fired if they order in.\n\nIf that description fits you and you're hungry, DM me and my staff will be in touch.\n\nDC has your back.","date":"Sat Jan 15 02:20:13 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@meemsings https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:51:10 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@JimCramptonWPG https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:50:56 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@TheMartiScott https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:50:45 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@islivingston https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:50:32 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@rlviser https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:50:23 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@itsmebcd https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:50:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@___z__________ https://t.co/1XZxGGXA5S","date":"Sat Jan 15 03:49:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@SharonsSpeaking It is. Objectively.","date":"Sat Jan 15 03:05:27 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@AnneMuntean @RepThomasMassie Amen.","date":"Sat Jan 15 02:40:05 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will provide sandwiches this weekend to members of @RepThomasMassie's staff who're vaxxed + boosted but afraid they'll get fired if they order in.\n\nIf that description fits you and you're hungry, DM me and my staff will be in touch.\n\nDC has your back.","date":"Sat Jan 15 02:20:13 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@RepThomasMassie Ok then.","date":"Fri Jan 14 22:16:57 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Ahead of #MLKDay, I’m calling on the Senate to complete the nation’s work on civil rights by passing comprehensive voting rights legislation and the #DCStatehood bill.\n\nMore: https://t.co/lwnDAmm2OZ https://t.co/bUC5DFw0eb","date":"Fri Jan 14 22:10:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@repmarkpocan Depends on how many Republicans have Twitter accounts.","date":"Fri Jan 14 21:08:37 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"As the chair of the Highways and Transit Subcommittee and as a member of the Government Operations Subcommittee, I’ve been working closely with Chairman @GerryConnolly on this Metro hearing. \n\nWe need answers and accountability.","date":"Fri Jan 14 20:23:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Passing the #BuildBackBetter Act is critical to making our economy work for families across DC. 65 million kids count on the monthly #ChildTaxCredit checks. \n\nWe cannot let the progress DC families made thanks to the American Rescue Plan end here. https://t.co/roWVPM9Dtu","date":"Fri Jan 14 19:44:57 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"More: https://t.co/Xt7OYQwznL","date":"Thu Jan 13 19:23:54 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":".@RepMattGaetz of FL yesterday became the 5th Republican to try to block a D.C. vaccine policy this Congress, joining members from TX and UT in these futile efforts.\n\nI will defeat his undemocratic bill, just like I will defeat the four others. #HandsOffDC #DCStatehood","date":"Thu Jan 13 19:23:53 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@mex_dc @POTUS @MayorBowser #DCStatehood","date":"Wed Jan 12 17:49:44 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"After learning of recent layoffs @USPS in the face of DC-wide complaints of delayed and undelivered mail, I sent Postmaster General DeJoy a letter asking for answers.\n\nMore: https://t.co/BkGFtvBzcv","date":"Wed Jan 12 16:06:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Senator Harry Reid, who is lying in state at the Capitol today, gave new momentum to our #DCStatehood bill when, as Majority Leader in 2013, he announced at the unveiling of DC’s first statue in the Capitol he would cosponsor the bill and forcefully called for its passage.","date":"Wed Jan 12 15:46:25 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m disappointed that @DeptofDefense didn’t call on Congress to give the DC mayor control of the DC National Guard when it recently streamlined the approval process for deploying the DCNG.","date":"Wed Jan 12 15:02:28 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"The #Jan6 attack reminds us how crucial it is to give DC control of its National Guard, just as states and territories control theirs.\n\nRelease: https://t.co/pcywXxztCG","date":"Wed Jan 12 15:02:28 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/8RKpUrNOr7","date":"Tue Jan 11 18:42:26 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, I will hold a virtual community meeting on the Supreme Court's new vehicle barrier on a residential street.\n\nThis meeting will allow residents to share their concerns about the barrier and to find a solution that works for them and the Court.","date":"Tue Jan 11 18:42:25 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Read: https://t.co/ZTzVc6mLg5","date":"Tue Jan 11 16:52:59 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This weekend, the @WashingtonPost Editorial Board called on the Senate to confirm local DC judges.\n\nThe extraordinary number of judicial vacancies on the local DC courts has become a crisis, standing in the way of cases residents need resolved, public safety + access to justice.","date":"Tue Jan 11 16:52:59 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"There is no constitutional requirement that such judges be subject to Senate confirmation.","date":"Tue Jan 11 16:50:08 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"One seat has been vacant since… 2013.\n\nThe Senate must immediately confirm the pending nominees, and Congress must pass my bill to get rid of the confirmation requirement for DC judges, who are Article I judges.","date":"Tue Jan 11 16:50:07 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Longstanding Senate inaction has created a judicial vacancy crisis on the local DC courts that is harming public safety and access to justice.\n\nThere are 16 vacancies out of 62 seats on the trial court, and 3 vacancies out of 9 seats on the appeals court.","date":"Tue Jan 11 16:50:07 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@DCStatehood_ Booo.","date":"Tue Jan 11 01:34:56 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @JulieMason on Sirius XM this morning about interference by @SenTedCruz in DC's student vaccine policy, voting rights, and #DCStatehood. \n\nListen here: https://t.co/Ku6zWVrtVM","date":"Mon Jan 10 19:45:56 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today I introduced a bill to allow DC to transmit legislation for the congressional review period electronically.\n\nCurrently, DC must physically transmit legislation. \n\nAs Omicron surges, email is the safest + fastest way to send legislation to Congress.\n\nhttps://t.co/oX2i8LdmnS","date":"Mon Jan 10 18:40:16 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@jc_s1 Good morning!","date":"Mon Jan 10 13:48:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Now: Ahead of MLK Day, I'll speak to @JulieMason on Sirius XM about MLK's legacy of support for voting rights, including #DCStatehood.","date":"Mon Jan 10 13:46:45 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@VictoriaBonney @51stDC @51for51 @DCstatehood51 #DCStatehood","date":"Mon Jan 10 02:13:51 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@Ward3Statehood @DCStatehood_ Boooo.","date":"Mon Jan 10 01:45:49 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Control is not only about DC’s right to self-government. It’s also a matter of life and death.","date":"Fri Jan 07 19:40:25 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"During the #Jan6 attack, the nation learned the president controls the DC National Guard. \n\nAs governors deploy their NGs to respond to the COVID surge, I again call on Congress to pass my bill to give the DC mayor control of the DC Guard.","date":"Fri Jan 07 19:40:23 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This Congress, 4 Republicans have announced bills to overturn DC vaccine policies. 3 from TX, 1 from UT. \n\nAll profess to support local control of local affairs yet are trying to use fed power to overturn local policies. \n\nI'll defeat their undemocratic bills. \n\n#HandsOffDC","date":"Fri Jan 07 19:11:23 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, @SenTedCruz announced his intention to introduce a bill blocking DC's vaccine mandate for students. \n\nI assure you, I will defeat this anti-science, anti-student, anti-home-rule bill from a senator from Texas. \n\n#HandsOffDC\n\nDetails: https://t.co/YYKI6mIKDC","date":"Thu Jan 06 17:36:07 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This afternoon, I’ll be speaking at a vigil remembering the #January6thInsurrection on the National Mall. It is important we remember this assault on our democracy, but also recognize the sacrifice of @DCPoliceDept officers.","date":"Thu Jan 06 15:09:35 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"These officers and the nearly 700,000 DC residents continue to lack the voting representation in Congress and local self-government other Americans have long enjoyed. #DCStatehood","date":"Thu Jan 06 15:09:35 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"See my release: https://t.co/2tJRT5pGEp","date":"Thu Jan 06 14:02:24 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC residents pay the highest per capita federal taxes in the country yet are denied voting representation in Congress, including members of MPD who helped save the Capitol and democracy itself that day, and full self-government. It’s long past time for #DCStatehood.","date":"Thu Jan 06 14:01:36 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"One year after the insurrection at the Capitol, we are reminded that this was not just an attack on the Capitol, but on #DC itself. DC has no control over its National Guard, and its police force can be federalized.","date":"Thu Jan 06 14:01:21 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"See my release:\nhttps://t.co/Rg2gdR1K6a","date":"Wed Jan 05 23:15:19 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"This week, I will introduce a bill to make DC eligible for forestry education funding. States and territories are already eligible. This is the 21st bill in my Free and Equal D.C. Series of bills to ensure that, pending #DCStatehood, DC is treated the same as states.","date":"Wed Jan 05 23:15:09 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"With DC’s COVID-19 vaccination mandate for entering many facilities going into effect January 15, defeating @RepPatFallon’s anti-home-rule bill that would prohibit #DC from imposing such a mandate is more important than ever. #HandsOffDC\n\nRelease: https://t.co/bFyeNbBd16","date":"Tue Jan 04 21:46:07 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Until then, the Senate needs to immediately confirm the pending DC nominees, and Congress needs to pass my bill to allow DC judges to be appointed after a congressional review period, which is the same process for DC legislation.","date":"Tue Jan 04 19:33:11 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood is the solution to the local DC judicial vacancy crisis.\nhttps://t.co/XWQHa3B50P","date":"Tue Jan 04 19:32:57 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@ChelseaCirruzzo 🛷🌨️","date":"Mon Jan 03 18:21:14 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"Sledding is a simple childhood thrill, and allowing children to sled on Capitol Hill is the least we can give them after a challenging year.\n\nRelease: https://t.co/3hwMEdbXqz","date":"Mon Jan 03 18:13:43 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"I released a statement today reminding DC residents that sledding is allowed on Capitol Hill because of a provision I get added to the Legislative Branch Appropriations bill, but the Hill is temporarily closed due to falling branches.  I hope it will reopen later today.","date":"Mon Jan 03 18:13:42 +0000 2022","user_id":"23600262"},{"handle":"EleanorNorton","text":"@TalkNats @instagram #DCStatehood","date":"Mon Dec 27 20:27:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@theHillisHome Yes, I can.","date":"Sun Dec 26 01:41:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@SharonsSpeaking Wasn't me.","date":"Wed Dec 22 17:59:09 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Mon Dec 20 16:18:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House passed our #DCStatehood bill again in April. In the new year, we will face the remaining challenges by redoubling our efforts to pass our statehood bill in the Senate.","date":"Mon Dec 20 13:36:03 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The nearly 700,000 Americans who live in DC and pay federal taxes deserve voting representation in the House and Senate and control over their local affairs.","date":"Mon Dec 20 13:36:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"All I want for Christmas is… #DCStatehood. \n\nCongress has the constitutional authority to grant that wish by simple legislation. https://t.co/AmRaXZKCnr","date":"Mon Dec 20 13:36:01 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to my excellent District Office team for another wonderful year helping my constituents! https://t.co/95WJizbNie","date":"Fri Dec 17 18:44:24 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to my interns for a successful semester! https://t.co/3PPBEFk5YY","date":"Thu Dec 16 21:58:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my bill to add DC to the national empowerment zone program to provide federal tax incentives for businesses to invest in low-income areas of the District.\n\nDetails: https://t.co/gUHkzw2vLr","date":"Thu Dec 16 19:29:47 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Reminder: Applications for the upcoming vacancy on the US District Court for DC are due by 5:00 pm on Tuesday, Dec. 21.","date":"Thu Dec 16 18:42:53 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congress denies #DCStatehood, and, adding insult to injury, now DC residents are the only full federal taxpaying Americans denied access to the Capitol, with only Senate-led tours restarting.\n\nhttps://t.co/945yeuRbEY","date":"Wed Dec 15 19:24:40 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced a resolution calling on Congress to condemn voter suppression laws enacted by the states.\n\nDenying DC residents voting representation in the House and Senate is a form of voter suppression. The remedy is #DCStatehood.\n\nMore: https://t.co/xMjbfi3vIQ","date":"Wed Dec 15 15:28:06 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@hahmad1996 https://t.co/eia13caiSk","date":"Wed Dec 15 00:14:32 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The pro-#DCStatehood dazzle had a good run. \n\nMay they run free in our hearts forever.","date":"Tue Dec 14 23:36:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@DCist Wasn't me.","date":"Tue Dec 14 21:26:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@wusa9 Wasn't me.","date":"Tue Dec 14 21:18:23 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced a bill to give DC authority over the jurisdiction and organization of the local DC courts.\n\nCongress can give DC this authority even before we achieve #DCStatehood.\n\nDetails: https://t.co/jC47GPuaGb","date":"Tue Dec 14 20:41:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I released my remarks from today’s press conference announcing DC’s lawsuit to hold the Proud Boys, Oath Keepers and others financially responsible for damages DC incurred during the January 6th insurrection.\n\nFull remarks: https://t.co/oEP9AB9NZE https://t.co/ptHGtnZwxu","date":"Tue Dec 14 17:52:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Soon. Live stream here: https://t.co/14wGM0ibmS","date":"Tue Dec 14 16:47:29 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today at noon I'll participate in a press conference with DC's @AGKarlRacine to make an announcement regarding the Jan. 6 insurrection.\n\nDetails: https://t.co/YG9UOYhcx1","date":"Tue Dec 14 13:28:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Reminder that my Federal Law Enforcement Nominating Commission is accepting applications for an upcoming vacancy on the US District Court for DC. \n\nApplications must be submitted by 5:00 pm on Tuesday, Dec. 21.\n\nInstructions here: https://t.co/FsJQFUx8wL","date":"Mon Dec 13 19:55:07 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"\"That is the Republican platform… I am particularly proud of my party for adopting this plank because the conventional wisdom is that, for the near future, Democrats would be favored to win these new seats.”\nWhere are the principled Bob Dole Republicans today?","date":"Mon Dec 13 18:04:08 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Bob Dole, who is mourned by both sides, spoke on the Senate floor in 1978 for voting representation in the Senate and House for D.C. residents:\n“We support giving the District of Columbia voting representation in the U.S. Senate and House of Representatives.\"","date":"Mon Dec 13 18:03:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Read the @washingtonpost editorial expressing our shared disappointment that my House-passed bill giving the mayor control was removed from the final National Defense Authorization Act.\nhttps://t.co/B94fqCJYde","date":"Mon Dec 13 16:28:04 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The attack on the Capitol and the events at Lafayette Square are prime examples of why giving DC’s mayor control of the DC National Guard is vital.","date":"Mon Dec 13 16:27:50 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#ConstituentSuccessStory https://t.co/fHgPXGT3Yo","date":"Fri Dec 10 17:14:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I spoke on the House floor about good news for Americans: Unemployment is down, 6 million jobs have been created, and #BuildBackBetter, the biggest cost-cutting bill in American history, has passed the House.\n\nSee my remarks: https://t.co/zaOkNyReQR","date":"Thu Dec 09 21:10:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I led members of the DC region in sending a letter urging @SecretaryPete and the @Amtrak CEO to prioritize funding for the Washington Union Station Expansion Project as they implement the new bipartisan #infrastructure law.\n\nDetails: https://t.co/9GkFtvKYuW","date":"Thu Dec 09 17:49:44 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Ahead of the Summit for Democracy, the @WhiteHouse released a fact sheet with @POTUS's work to pass democracy reform legislation at home –– including #DCStatehood.\n \nFact sheet here: https://t.co/oP518Wnix1","date":"Thu Dec 09 17:20:47 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to my colleagues in the House for supporting this important bill and to my constituent, Raya Kenney, who as a young student came up with the idea.\n\nRelease: https://t.co/V1J1HsHXBp","date":"Thu Dec 09 14:15:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My bill with @SenDuckworth to build a memorial on federal land in DC to honor women who worked on the home front in WW2 passed the House.\n\nEighteen million American women did important work in WW2 and are overdue for this great honor.","date":"Thu Dec 09 14:15:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#ConstituentSuccessStory https://t.co/zBhJ4DpHVQ","date":"Wed Dec 08 16:05:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"As a local jurisdiction, DC is a bystander to the federal issues involved in shutdowns and should not be caught up in congressional shutdown fights.\n\nRelease: https://t.co/GLU6YX8TCk https://t.co/A0UbR5MViX","date":"Wed Dec 08 15:30:52 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill exempting   federal and exclusively federally funded entities that only serve DC from federal government shutdowns, just like I get the the DC government exempted.","date":"Wed Dec 08 15:30:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/e65sp9t9zf","date":"Tue Dec 07 22:31:06 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, @ChrisVanHollen, @SenatorCarper, @RepMaloney, @RepAnthonyBrown and I released a statement expressing disappointment the final NDAA doesn't give DC's mayor control of the DC National Guard + vowing to continue fighting to get a bill signed into law giving the mayor control.","date":"Tue Dec 07 22:31:06 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced a bill today to make D.C. eligible for two federal transportation programs in the same manner that states are eligible.\n\nMore information: https://t.co/hE4k2WjWGs","date":"Tue Dec 07 17:36:44 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The US will host a Summit for Democracy starting Thursday, but the US is the only democratic country that denies the residents of its capital voting representation in the national legislature.\n\nThe remedy is #DCStatehood.","date":"Tue Dec 07 16:04:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"https://t.co/hV9LpnyMyt","date":"Mon Dec 06 20:41:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I was saddened to hear of the death of Fred Hiatt today, whose 20-year editorship of the @WashingtonPost editorial page helped make our hometown paper the best in the nation.\n\n@HiattF will be missed. https://t.co/6BKirZWyya","date":"Mon Dec 06 19:01:31 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'll hold my quarterly community meeting with NPS via Zoom on Thursday, Dec. 9 at 7:00 pm. \n\nTo attend, email NortonEvents@mail.house.gov for the Zoom link. The event will be open to the public and to the media.\n\nMore: https://t.co/2Jm6awexSe https://t.co/tH7T9rSIcd","date":"Mon Dec 06 17:28:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My Federal Law Enforcement Nominating Commission is accepting applications for an upcoming vacancy on the US District Court for DC. \n\nApplications must be submitted by 5:00 pm on Dec. 21.\n\nInstructions here: https://t.co/FsJQFUx8wL","date":"Mon Dec 06 15:05:35 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I wrote an op-ed for @TheHill calling for removal of the existing rider prohibiting DC from spending local funds on commercializing recreational marijuana.\n\nI got the rider removed from pending House + Senate FY 22 DC Appropriations bills.\n\nRead it here: https://t.co/FSybt6B4Ib","date":"Fri Dec 03 18:45:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today @ChrisVanHollen, @SenatorCarper, @RepMaloney, @RepAnthonyBrown and I sent a letter urging the chairs and RMs of the House and Senate Armed Services Committees to give DC's mayor control over the DC National Guard in the final FY22 NDAA. \n\nDetails: https://t.co/Bm9pH2OHiI","date":"Thu Dec 02 21:50:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The @OversightDems Committee passed my bill to allow judicial appointments to local DC courts to take effect after a 30-day congressional review period, which would help address the vacancy crisis in the DC courts.\n\nCurrently, the appointments are subject to Senate confirmation.","date":"Thu Dec 02 20:40:14 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/bUn4OJJ6bN","date":"Thu Dec 02 20:40:14 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I outlined my qualifications, which include being the most senior member of the committee, current chair of its largest subcommittee, and ranked most effective House Democrat in the 115th Congress.\n\nDetails: https://t.co/LJPN0JixnW","date":"Thu Dec 02 19:21:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I sent a letter to House Democrats asking for their support in my run for chair of @TransportDems in the 118th Congress.","date":"Thu Dec 02 19:21:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today I spoke with @LexJuareztv about my DC Courts Vacancy Reduction Act, which @OversightDems will mark up tomorrow. \n\nMy bill will get judges onto our local courts quickly to address the local issues of our residents. \n\nWatch at 5:00 on @WDVMTV. \n\nMore: https://t.co/r0IPhRhgTs","date":"Wed Dec 01 21:52:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"After learning @RepPeterDeFazio has decided not to run for re-election, I announced my run for chair of @TransportDems in the 118th Congress.\n\nChair DeFazio, thank you for your devoted service.","date":"Wed Dec 01 19:13:23 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"You've been a strong supporter of #DCStatehood, for which I will always be grateful. \n\nI wish you many years of health and happiness in your next chapter.\n\nDetails: https://t.co/eCeH8bB2cE","date":"Wed Dec 01 19:13:23 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"With #DCStatehood, Congress will no longer be able to tell DC how it can spend its own money. https://t.co/W2D5FNHcaN","date":"Wed Dec 01 15:36:49 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on #WorldAIDSDay, we remember the lives lost when Congress prohibited DC from using its local funds for needle-exchange programs.\n\nSince I got that prohibition removed, new HIV cases in DC attributable to injection drug use have decreased by 99 percent.","date":"Wed Dec 01 15:34:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased to announce Roshan Natarajan’s app “IndiGenius” as the winner of the 2021 Congressional App Challenge for DC.\n\nThe app seeks to preserve Indigenous language through tutorials and games.\n\nI applaud Roshan Natarajan’s work. Congratulations!","date":"Wed Dec 01 14:02:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"SCOTUS will hear the historic Mississippi abortion case today. If Roe were overturned, a future Republican Congress could ban all abortions in DC.\n\nUntil, that is, we achieve #DCStatehood.","date":"Wed Dec 01 06:16:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Currently, the appointments are subject to Senate confirmation.\n\nMore: https://t.co/UQmKqVGVMz","date":"Tue Nov 30 20:50:06 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"On Thursday, @OversightDems will mark up my bill to allow appointments to the local DC courts to take effect after a 30-day congressional review period, an important step to get judges appointed more quickly to reduce the backlog of cases.","date":"Tue Nov 30 20:50:06 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Even if the federal government shuts down on Friday, I’ve gotten a provision in the DC Appropriations bill making DC exempt from such shutdowns every year since 2015.\n\nDetails: https://t.co/HEETHA2XSU","date":"Tue Nov 30 20:38:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'll introduce a resolution congratulating the @WashSpirit on their @NWSL championship.\n\nDetails: https://t.co/TBhomWNCXk","date":"Mon Nov 29 17:33:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This week, I will introduce legislation to repeal the @USGAO's authority over DC. \n\nThe District is not a federal agency, and we have a locally appointed auditor and inspector general.\n\nDetails: https://t.co/ekBbtqZOYY","date":"Mon Nov 29 15:57:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@TheUpliftCo https://t.co/LML0OoZurR","date":"Fri Nov 26 13:38:49 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The unemployment rate fell to 4.6% in October, a new pandemic low and better than expectations. \n\nPlus, wages rose 0.4% for the month and were up 4.9% from a year ago, according to the Labor Department. \n \nDetails: https://t.co/OXLzOO5bVa","date":"Tue Nov 23 19:01:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congratulations to the @WashSpirit, who have won 11 games this season and are headed to the National Women's Soccer League Championship. \n \nDC is rooting for you. https://t.co/dLcOSVKLIo","date":"Sat Nov 20 16:29:44 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"In addition, the bill will provide a tax cut for the middle class and the single largest investment in affordable housing in history.\n\nDetails: https://t.co/xm5XVBKptx","date":"Fri Nov 19 21:51:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House today passed @POTUS’s #BuildBackBetter Act, which contains many victories for DC, including on prescription drugs, child care, and climate.","date":"Fri Nov 19 21:51:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Fri Nov 19 03:49:07 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"It’s World Pancreatic Cancer Day! I’m joining @PanCAN in spreading the word 💜 For Americans, #pancreaticcancer is the 3rd leading cause of cancer death. #PanCANawareness","date":"Thu Nov 18 22:07:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @HeatherMCurtis1 about tomorrow's @CouncilOfDC hearing on commercializing recreational marijuana –– and how I'm closer than ever to getting the DC marijuana rider removed in Congress this session.\n \nListen tomorrow morning on @WMALDC.","date":"Thu Nov 18 20:40:46 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday I spoke on the House floor about @POTUS’s #BuildBackBetter plan and how it is fully paid for by making the rich and corporations pay their fair share. \n\nWe must work together to pass this historic legislation. https://t.co/QTQyYm0UoC","date":"Thu Nov 18 19:28:20 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The timing of @CouncilOfDC's hearing tomorrow on legislation to commercialize recreational marijuana couldn't be better, as I am closer than ever to getting the anti-home-rule rider preventing commercialization removed from the DC Appropriations bill.","date":"Thu Nov 18 16:18:45 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I've gotten the rider removed from the pending House and Senate versions of the FY22 DC Appropriations bill. DC should have full control over how it chooses to spend local funds, including on marijuana commercialization.\n\nDetails: https://t.co/R4S1v7dDOD","date":"Thu Nov 18 16:18:45 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"18 million American women did important work in WW2 &amp; are overdue for this great honor. \n\nRelease: https://t.co/76Y9fIc9bl","date":"Wed Nov 17 18:23:49 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My bill with @SenDuckworth to build a memorial on federal land in DC to honor women who worked on the home front in WW2 passed today in the @NRDems Committee.\n\nThank you @RepRaulGrijalva for marking up this important bill.","date":"Wed Nov 17 18:23:48 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I'll visit a @ChildrensNatl COVID-19 vaccination clinic in Southeast DC with @FLOTUS, @Surgeon_General Vivek Murthy, Mystics player @Alysha_Clark and Wizards player Thomas Bryant to urge parents + guardians to vaccinate children ages 5-11.\n\nDetails: https://t.co/3GnO3ad1Ap","date":"Wed Nov 17 18:02:46 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@buddy_xrp @MurielBowser @TeenVogue Ha.","date":"Tue Nov 16 22:05:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I released a statement today upon learning that @SenatorLeahy will not seek reelection.\n\nOver the years Sen. Leahy has been a strong supporter of #DCStatehood and of issues affecting the District. \n\nDetails: https://t.co/WWup6pIl5L","date":"Tue Nov 16 17:52:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"President Biden signed my bill banning smoking on @Amtrak into law today.\n\nThe idea for the bill came from an 11-year-old DC resident who expressed concern about seeing someone smoking an e-cigarette on Amtrak.","date":"Mon Nov 15 21:31:24 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"It's the second bill I've gotten enacted banning smoking on a form of transportation. The first clarified that the ban on smoking on airplanes includes e-cigarettes. \n\nDetails: https://t.co/VpQvbqEEjp","date":"Mon Nov 15 21:31:24 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"There is no federal law that prohibits a person in Virginia from obstructing such a bridge or a person in any state from obstructing a bridge connecting two states.\n\nDetails: https://t.co/ltGMlc8xYZ","date":"Mon Nov 15 19:30:44 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my bill to repeal a redundant federal law making it a crime for a person in DC to obstruct any bridge connecting DC and Virginia.","date":"Mon Nov 15 19:30:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@POTUS Details: https://t.co/85ENlHOBfw","date":"Mon Nov 15 18:51:07 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will attend the ceremony today where @POTUS will sign into law his historic #infrastructure bill, which includes my priorities for DC.\n\nIt is an honor to be invited to see such historic legislation signed into law.","date":"Mon Nov 15 18:21:58 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Five reasons for #DCStatehood: Read the @TeenVogue op-ed arguing in support of my bill to make DC the #51st state.\n\nhttps://t.co/NvEHxFLFex","date":"Mon Nov 15 16:32:09 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"On #VeteransDay today, I am reminded that DC residents have given their blood and treasure, fighting and dying in every war since the American Revolution, to defend a nation that denies them equal rights and voting representation in Congress.\n\nThe remedy is #DCStatehood. https://t.co/SEQr9QqDD1","date":"Thu Nov 11 22:54:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I met with @POTUS and @SecretaryPete when they were writing the historic #infrastructure legislation, which is now on the president’s desk, and I'm pleased they included my priorities for DC.\n\nToday, I highlighted benefits in the bill for DC.\n\nDetails: https://t.co/yMivLCKjXS","date":"Wed Nov 10 21:33:20 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The #BuildBackBetter Act and #ChildTaxCredit are powerful investments in our country’s future, but there are only five days left to sign up for these monthly checks in 2021.\n\nSee if your family qualifies: https://t.co/J9cWRQiQv9 https://t.co/cNcCg8lmsf","date":"Wed Nov 10 06:57:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/LyApTL7NWN","date":"Tue Nov 09 18:49:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my bill to direct the Treasury to mint coins in recognition of Paul Laurence Dunbar, one of the most influential African-American poets in American literature and the namesake of my high school in DC, the first public high school for African Americans.","date":"Tue Nov 09 18:49:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduce a resolution each Veterans Day honoring their sacrifices and giving the most important reason for our work on our #DCStatehood bill, which has passed the House twice since 2020 and is fully supported by @POTUS.\n\nDetails: https://t.co/SNtREiSDsh https://t.co/K1i5pnoAyw","date":"Tue Nov 09 18:36:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC residents have fought for their country in every war since the American Revolution, yet are still denied voting representation in Congress and full local self-government.","date":"Tue Nov 09 18:36:27 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@HUDgov denied my request to allow marijuana use in federally assisted housing in jurisdictions where it is legal. \n\nI'm disappointed in their denial, though it shows why it's so vital that Congress pass my bill permitting such use.\n\nDetails: https://t.co/OMQp2WiKbf","date":"Tue Nov 09 16:16:32 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"When will @HouseGOP learn not to bet against @SpeakerPelosi?\n\nShe did, indeed, have the votes.","date":"Tue Nov 09 15:03:57 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Interesting that Cancun @SenTedCruz is talking about leaving the country. Again.\n \nWhen DC faces injustice – like being denied #DCStatehood – I stay and fight for the people who elected me.","date":"Tue Nov 09 14:29:20 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I pledged to defeat two Republican bills recently introduced by @WarrenDavidson and @RepLouieGohmert to undermine DC’s economy.\n\nDetails: https://t.co/s1EYaBITdg","date":"Mon Nov 08 17:31:01 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Amtrak deserves credit for implementing its own smoking ban, but this bill will codify that policy into federal law and will guarantee protection for public health.\n \nDetails: https://t.co/FTB6P9mHhy","date":"Sat Nov 06 16:56:58 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Late last night the House passed my bill with @SenatorCarper that bans smoking, including of e-cigarettes, on @Amtrak, and it is now headed to @POTUS's desk.","date":"Sat Nov 06 16:56:58 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"If DC had a vote in Congress, I'd be in.\n\nAre you with us?\n\n[#DCStatehood]","date":"Fri Nov 05 16:51:58 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm chairing a @TransportDems hearing on the evolving cybersecurity landscape and how to secure the nation's infrastructure.\n\nWatch: https://t.co/Vl3zMlUmqk https://t.co/pZV7i8pfbi","date":"Thu Nov 04 15:29:54 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased to see that DC has selected development teams for Hill East Phase II, which was made possible by my legislation that transferred this then-federal land to DC.\n\nThe development will bring much-needed housing and amenities to the neighborhood. https://t.co/MbsjpssvJC","date":"Tue Nov 02 20:02:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I spoke on the House floor about @POTUS’s #BuildBackBetter plan and how it will contain the most comprehensive social provisions ever passed. https://t.co/DqHJqJIjns","date":"Tue Nov 02 19:15:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my bill to give DC the authority to appoint all members of the DC Board of Zoning Adjustment.\n\nThe Board has no authority over federal property, so it follows that its members should be appointed by the District itself.\n\nDetails: https://t.co/bsUduLysDg","date":"Tue Nov 02 16:13:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@jaketapper @TheLeadCNN Wasn't me.","date":"Tue Nov 02 15:52:44 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@ClaudiaAHndz Wasn't me.","date":"Tue Nov 02 15:52:26 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Shortly after noon today, I'll speak on the House floor in support of @POTUS's #BuildBackBetter agenda.\n\nWatch: https://t.co/UGyJT0oRKq","date":"Tue Nov 02 15:38:04 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you, @RepMaloney, for your leadership and for including my bill in this week's markup. \n\nDetails: https://t.co/1Ux7bx0XP4","date":"Tue Nov 02 14:36:48 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The bill would allow judicial appointments to the local DC courts to take effect after 30-day congressional review period, helping to end the longstanding vacancy crisis on the DC courts. Currently, nominees require Senate confirmation.","date":"Tue Nov 02 14:36:48 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The @OversightDems Committee will mark up my DC Courts Vacancy Reduction Act this Thursday at 2:00 pm.","date":"Tue Nov 02 14:36:48 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"If the law is upheld, a Republican Congress could then impose an abortion bounty in DC. If Roe is overturned later this term, Congress could ban abortions in DC. \n\nI’ll fight back fiercely while pressing for the ultimate solution, now within reach: #DCStatehood. https://t.co/V4ViSsd8Hq","date":"Mon Nov 01 20:03:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, #SCOTUS heard oral arguments on #SB8, the Texas law banning abortions after six weeks and instituting a bounty system where unrelated parties can sue residents who help a woman, in any way, obtain an abortion.","date":"Mon Nov 01 20:03:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@laurel_kremer @MarylandZebra @WashProbs Wasn’t me.","date":"Sun Oct 31 12:47:14 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@numbakrunch @skenigsberg Wasn’t me.","date":"Sun Oct 31 00:37:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@Agent_Kibi True!","date":"Sat Oct 30 04:03:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I have full confidence Graves will serve DC exceptionally well.\nRelease: https://t.co/OvKcmE6dJz","date":"Fri Oct 29 16:05:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The Senate yesterday confirmed my recommendation to @POTUS Biden of Matthew Graves for the US Attorney for DC.\nLike Presidents Obama and Clinton, Biden has given me senatorial courtesy to recommend candidates for certain federal positions.","date":"Fri Oct 29 15:59:50 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today I spoke on the House floor about @POTUS’s #BuildBackBetter plan and its investments in teachers and schools. \n\nI highlighted how Build Back Better will upgrade school infrastructure. https://t.co/CTAjbPuSRD","date":"Thu Oct 28 21:21:45 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today I reintroduced my bill to make DC eligible for federal flood mitigation funding, correcting the District's omission from a 1972 bill, as climate change makes this bill more urgent than ever.\n\nRelease: https://t.co/WLmehZY1Ru","date":"Thu Oct 28 20:07:38 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Applicants must email a resume and a letter of interest to DC00.nortonresume@mail.house.gov by 6:00 pm on 11/11.\n \nDetails: https://t.co/KuiayoNodt","date":"Thu Oct 28 15:06:14 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I appreciate that, as DC’s only member of Congress, @POTUS Biden has granted me the opportunity to recommend candidates for US Parole Commission commissioners, a Senate-confirmed position.","date":"Thu Oct 28 15:06:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"After the Jan 6th Capitol attack, I asked US Capitol Police to share information with DC residents about police activity and threats at the Capitol.\n\nToday I announced that residents can receive that information through AlertDC. \n\nDetails: https://t.co/l8XpRKZQP5","date":"Thu Oct 28 13:22:53 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I got $57m included in the @SenateApprops LHHS subcommittee bill for a new Howard University Hospital. \n\nI wrote an op-ed for @TheHill arguing for the funding in July: https://t.co/NrK21Mg32n\n\nDetails: https://t.co/Ci5wl8vE92","date":"Wed Oct 27 14:52:27 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @Elise_Kline_ about Postal Service delays in DC and how I'm working to make mail delivery more timely and reliable. Story below.","date":"Wed Oct 27 14:20:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The Senate confirmed my recommendation to @POTUS Biden of Jia Cobb for the US District Court for DC.\n\nLike Presidents Obama and Clinton, Biden has given me senatorial courtesy to recommend candidates for certain positions.","date":"Wed Oct 27 13:46:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I have full confidence Cobb will serve DC exceptionally well.\n\nRelease: https://t.co/LPzccQans5","date":"Wed Oct 27 13:46:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I released my remarks on the House floor in support of @POTUS’s #BuildBackBetter plan.\n\nDetails: https://t.co/CPWBVWb13A","date":"Mon Oct 25 19:21:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Check out the zebra who found asylum at the tree box in my yard.\n \nCome one, come all. As long as they support freedom and #DCStatehood, the dazzle is welcome at my House. https://t.co/9ek1vnR9ut","date":"Sun Oct 24 16:24:58 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Clarification: The episode will post at 7:00 this evening.","date":"Fri Oct 22 20:02:52 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm joining @AymanM today to talk about the status of voting rights legislation in Congress -- including voting representation in Congress for DC residents, which would be achieved by #DCStatehood.\n\nWatch at 4:00: https://t.co/nr8fb5fLp6","date":"Fri Oct 22 11:56:54 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @AdamLongoTV about the @OversightDems investigation into the Washington Football Team's allegedly hostile work environment.\n\nWatch today at 5:00 and 6:00 on @WUSA9.","date":"Fri Oct 22 19:27:54 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm joining @AymanM today to talk about the status of voting rights legislation in Congress -- including voting representation in Congress for DC residents, which would be achieved by #DCStatehood.\n\nWatch at 4:00: https://t.co/nr8fb5fLp6","date":"Fri Oct 22 11:56:54 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/HS0xa2QCFS","date":"Thu Oct 21 20:35:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I secured $463 million for consolidation of the Department of Homeland Security at St. Elizabeths in Ward 8 in the Senate’s Appropriations bills, released earlier this week.\n\nMaking full use of this federal land will help DC's economy as DHS employees spend money in DC.","date":"Thu Oct 21 20:35:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"After my meeting with Metro's General Manager Wiedefeld today, I spoke to @TomRoussey7News. \n\nSee the latest developments today at 5:00 on @7NewsDC.","date":"Wed Oct 20 20:23:52 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Twenty years later, when USPS workers face the risk of COVID-19 to deliver necessities to DC residents and people throughout the nation, their loss is still felt.\n\nRelease: https://t.co/Sb1fKccJ40","date":"Wed Oct 20 18:48:15 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my resolution honoring Joseph Curseen, Jr. and Thomas Morris, Jr., @USPS workers who died due to anthrax exposure in 2001.","date":"Wed Oct 20 18:48:15 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I sent a letter to the Supreme Court expressing concern about its expanding security, which is imposing burdens and possible safety risks on residents of the surrounding neighborhood.\n \nRelease: https://t.co/fZONhRXMS7","date":"Wed Oct 20 16:17:41 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@Madeyewthink_ @MikevWUSA @RealTimeNews10 @scottbroom @wusa9 😢","date":"Wed Oct 20 15:46:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @KCTomDempsey about the ongoing WMATA investigation and Metro delays following last week's derailment and my discussions, as chair of the Subcommittee on Highways and Transit, about a possible hearing by the @TransportDems committee.\n\nWatch tonight at 11:00 on @WUSA9.","date":"Tue Oct 19 21:00:48 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @KatieLeeBarlow about the ongoing WMATA investigation and Metro delays following last week's derailment and my discussions, as chair of the Subcommittee on Highways and Transit, about a possible hearing by the @TransportDems committee.\n\nWatch on @Fox5DC at 5:00.","date":"Tue Oct 19 18:34:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@NCVates @JoyceWhiteVance @lrozen https://t.co/glcDsvUYJX","date":"Tue Oct 19 18:08:14 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to @ChrisVanHollen, a champion of #DCStatehood and DC autonomy, for removing the enacted FY21 riders from the Senate’s FY22 DC spending bill: prohibitions on DC spending local funds on abortions for low-income women and on recreational marijuana commercialization.","date":"Tue Oct 19 18:06:23 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/ttqDayVSGg","date":"Tue Oct 19 17:38:29 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I secured many victories in the Senate's FY22 DC appropriations bill, including $40m for @DCTAG, increases in the annual and lifetime DCTAG awards, and removal of the riders prohibiting DC from spending local funds on abortions and recreational marijuana commercialization.","date":"Tue Oct 19 17:38:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Press release: https://t.co/48517kSgkH","date":"Tue Oct 19 17:12:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"As chair of the Subcommittee on Highways &amp; Transit, I'm consulting with @TransportDems Chair @RepPeterDeFazio about the possibility of a hearing on last week's Metro derailment + the continuing service disruptions to uncover what happened + how to avoid in the future.","date":"Tue Oct 19 17:12:01 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Watch live: https://t.co/5Na2IMt9Ef","date":"Tue Oct 19 15:01:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"With its recent House passage, record Senate support and Biden's support, we've never been closer to statehood for DC.\n\nRelease: https://t.co/0BKhsC9CZU","date":"Mon Oct 18 20:42:57 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, at 11:00 am, @SenatorCarper and I will speak at a @LWVDC event at Union Square to deliver a petition signed by 12,500 people from all 50 states in support of the #DCStatehood bill.","date":"Mon Oct 18 20:42:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My alibi is solid, but given my career of fighting for statehood for the District, explaining the importance of having consent of the governed, and my recent opposition to fences, I can understand why the charge was made.","date":"Fri Sep 10 15:22:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My heart is with his family today as they grieve his passing.\n\nhttps://t.co/riWZSKhg0Y","date":"Mon Oct 18 19:04:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"As the first Black Secretary of State and Chairman of the Joint Chiefs of Staff, General Colin Powell served our country throughout his career and represented the possibility of similar achievements for millions of young African Americans.","date":"Mon Oct 18 19:04:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@MarylandZebra Hello zebras, who I have never ever interacted with before now.","date":"Sun Oct 17 20:00:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@JessArnoldTV @wusa9 Hi.","date":"Sat Oct 16 22:25:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@SpencerSays Wasn’t me.","date":"Fri Oct 15 00:20:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@DAWNmenaorg briefed me on the continued detention of Prince Salman al-Saud and his father, who have been imprisoned in Saudi Arabia without charges since January 2018.\n\nI will be monitoring this situation and hope my colleagues do the same.\n \nhttps://t.co/rrUzcj9ITg","date":"Thu Oct 14 19:04:06 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Watch the hearing: https://t.co/aMdKKxcW4o","date":"Thu Oct 14 14:34:58 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I released my testimony from today's @NRDems hearing on my bills to authorize memorials on federal land in DC to women who worked on the home front during WWII and the enslaved people who disembarked at DC's Georgetown waterfront.\n\nRelease: https://t.co/DstVxUh26o","date":"Thu Oct 14 14:34:57 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"President Biden signed the Consider Teachers Act yesterday, my bill with @RepSpartz, @SenatorBraun and @SenatorSinema. \n\nThe bill will correct problems with the TEACH Grant program that are unfairly converting thousands of grants to loans that must be paid back with interest.","date":"Thu Oct 14 13:04:15 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/eM5rskE3Go","date":"Thu Oct 14 13:04:15 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, I’ll testify at a @NRDems subcommittee hearing on my bills to authorize memorials on federal land in DC to honor women who worked on the home front during WWII and the enslaved people who disembarked at DC’s Georgetown waterfront.\n\nDetails: https://t.co/wOfeHoC8wg","date":"Wed Oct 13 17:46:46 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Watch tomorrow at 10:00 here: https://t.co/aMdKKxuxsY","date":"Wed Oct 13 17:46:46 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Ahead of tomorrow’s @NRDems hearing on my WWII Women on the Home Front Memorial Act, @GBrockell of the @WashingtonPost notes a troubling fact: \n\nThere are more *mermaids* represented in our monuments than congresswomen.\n\nRead her article here: https://t.co/vkEjhlsKXK","date":"Wed Oct 13 17:23:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Land-use policies are among the most important for state and local jurisdictions and the federal government has no place in these decisions.\n\nDetails: https://t.co/bLttYdayzb","date":"Wed Oct 13 13:34:04 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, as part of my Free and Equal D.C. Series of bills, I introduced a bill to remove the authority of the @CFA_GOV over DC-owned property and private property in DC.","date":"Wed Oct 13 13:34:03 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Instead, the decision on whether to require a gender designation would be left to the states. If a state requires a gender designation, a person could change the designation by self-attestation.\n\nRelease: https://t.co/63vM1UxFDS","date":"Tue Oct 12 15:24:32 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, during #LGBTQHistory Month, I introduced a bill to remove the gender designation requirement from licenses under the REAL ID Act.","date":"Tue Oct 12 15:24:32 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@tiffortiffany Wasn’t me.","date":"Fri Oct 08 00:05:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Wasn't me.","date":"Thu Oct 07 19:01:47 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@RosemaryEWilson @realTyStark @LaurenUnderwood @RepUnderwood As am I.","date":"Thu Oct 07 17:33:31 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Ahead of #IndigenousPeoples’ Day, Oct. 11, I will introduce a resolution to recognize that the US was originally inhabited by indigenous peoples and to call on state and local governments to encourage formal land acknowledgment ceremonies.\n\nRelease: https://t.co/Hk7vhJ3N5p","date":"Thu Oct 07 15:01:18 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/kse5OPf8jj","date":"Tue Oct 05 15:33:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I released my testimony before today's #NCMAC hearing on my bill to establish a memorial on federal land in DC commemorating the enslaved individuals who are believed to have disembarked at the Georgetown waterfront after forced migration to the US.","date":"Tue Oct 05 15:33:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"As the arbiters of the most controversial and weighty issues our country faces, the justices should – at minimum – abide by the same ethical standards as other federal judges.\n\nRelease: https://t.co/Va7JNv6c8k","date":"Tue Oct 05 15:20:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my resolution calling on SCOTUS to subject itself to the ethics code that applies to all other federal judges.","date":"Tue Oct 05 15:20:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congratulations to @BASISDC, @EatonSchool and @lafayetteDC for their recognition as National Blue Ribbon Schools. I submitted a congressional record statement honoring them.\n\nRelease: https://t.co/7j4X8sdGw4","date":"Tue Oct 05 13:39:06 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"We’ve never been closer to statehood.\n\nRelease: https://t.co/nc5KJQ8PpZ","date":"Mon Oct 04 21:07:09 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"While I’m disappointed by today’s SCOTUS decision summarily affirming a lower court decision that DC residents don’t have a constitutional right to House voting representation, it has no bearing on my #DCStatehood bill, passed twice in the House twice with record Senate support.","date":"Mon Oct 04 21:07:08 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Mon Oct 04 18:35:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The Senate @JudiciaryDems Committee has approved my recommendation to @POTUS Biden for US attorney for DC, Matthew Graves.","date":"Mon Oct 04 14:53:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Graves served with distinction as an Assistant US Attorney in DC, demonstrating that he has the experience and judgment to serve as an excellent US Attorney for the District.\n\nRelease: https://t.co/ZZItp9XJjS","date":"Mon Oct 04 14:53:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Sat Oct 02 01:53:03 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Happy 97th birthday to @JimmyCarter, who appointed me as the first woman to chair the @USEEOC, where we issued the first federal guidelines classifying sexual harassment as a violation of equal employment laws.\n\nOnly one of the major issues for which you are appreciated.","date":"Fri Oct 01 19:37:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Saturday and Sunday I’ll appear on @ToTheContrary. We’ll be discussing issues women face in the workplace in 2021 and when seeking high elective office. \n\nSee local listings: https://t.co/I8ckinxK8W","date":"Thu Sep 30 20:44:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The remedy is #DCStatehood.\n\nRelease: https://t.co/f57r1QuDBM","date":"Thu Sep 30 16:10:26 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congress controls DC's local affairs and prohibits DC from spending its local funds on abortion services for low-income women. Moreover, a Republican Congress could create a Texas-style abortion bounty law in DC, or, if Roe were overturned, ban abortion in DC.","date":"Thu Sep 30 16:10:26 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At an @OversightDems hearing today, I highlighted the uniquely vulnerable position DC women are in regarding their reproductive rights.","date":"Thu Sep 30 16:10:25 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The ultimate remedy is getting full control over our local affairs with #DCStatehood.\n\nRelease: https://t.co/PuVuikdbJ9","date":"Thu Sep 30 14:10:18 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The @GOP party professes to support local control over local affairs, but somehow that principle stops at the District’s border, including for the salary the District chooses to pay its own employees with its own funds.","date":"Thu Sep 30 14:10:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I am outraged Republicans defeated on the House floor yesterday my bill to help DC’s financial operations by allowing it to raise the pay of its own CFO, who is paid with local funds.","date":"Thu Sep 30 14:10:16 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At approximately 5:30 today, I’ll speak on the House floor in support of the #BuildBackBetter Act.\n \nWatch: https://t.co/UGyJT0oRKq","date":"Wed Sep 29 20:40:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'll be cheering for all the @HouseDemocrats and @SenateDems playing at tonight's #CongressionalBaseball Game. \n\nGo team Dems! https://t.co/RgfyvMvJi3","date":"Wed Sep 29 18:58:16 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yet, with the Build Back Better Act, we could serve 13,003 more young children in D.C., according to a study from the Century Foundation.  In a district where child care is the most expensive in the country, #BuildBackBetter is more important than ever for children and families.","date":"Tue Sep 28 21:39:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"In D.C., 27% of people live in a child care desert. If they do find child care, it takes 28.6% of a typical family’s income to pay for child care for one child. Currently, only 3.9% of eligible children are being served by existing programs.","date":"Tue Sep 28 21:38:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last time I checked, #DC was full of great restaurants, including many Michelin-starred. \n \nhttps://t.co/lsIEQnEHmH","date":"Tue Sep 28 18:43:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Tue Sep 28 15:19:30 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@councilofdc #ZebraGate","date":"Tue Sep 28 14:53:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm chairing a @TransportDems Highways &amp; Transit Subcommittee hearing on the role of ferries in improving mobility and reducing congestion and pollution.\n\nWatch here: https://t.co/BsbjZyfaIW","date":"Tue Sep 28 14:39:26 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The COVID-19 pandemic has made recovery even more difficult for those who are struggling. Last year, more than 93,000 lives were lost due to overdoses. \n\nThis #RecoveryMonth, I’m wearing purple to show that recovery is for everyone. https://t.co/7oV7JBpLUS","date":"Mon Sep 27 19:07:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to @ChrisVanHollen, @SenatorCarper, @RepMaloney, and @RepAnthonyBrown for working with me to get our bill giving DC's mayor control of the DC National Guard passed in the House last week, which was the first time in history either chamber had ever passed the bill.","date":"Mon Sep 27 19:04:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Our DC National Guard Home Rule Act passed as part of the FY 22 National Defense Authorization Act.\n\nThe NDAA has been enacted each year for the last 60 years and is considered a must-pass bill.","date":"Mon Sep 27 19:04:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on the 131st anniversary of @RockCreekNPS Park, I reintroduced my bill to rename it 'Rock Creek National Park' to help recognize its national status and assist us in getting Congress to revitalize this remarkable resource in the nation’s capital.","date":"Mon Sep 27 16:34:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/lBDGW5ROxw","date":"Mon Sep 27 16:34:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Our bill to require the same has passed the House twice as part of the #GeorgeFloyd Justice in Policing Act.","date":"Mon Sep 27 16:24:14 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"In light of the end of bipartisan, bicameral police reform legislation negotiations, @RepDonBeyer and I wrote @POTUS, @USSupremeCourt, + the @CapitolPolice Board asking them to require use of body and dashboard cameras for all uniformed police officers under their jurisdiction.","date":"Mon Sep 27 16:24:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My DC government shutdown exemption provision will allow the DC government to remain open even if the federal government shuts down Friday.\n\nI’ve gotten DC exempted from federal shutdowns for the last 8 years.\n\nRelease: https://t.co/YDlbPnz4oT","date":"Mon Sep 27 13:34:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'll be visiting the Brentwood post office this afternoon at 1:00, where they're having a hiring event because of the shortage of workers. \n\nI have written @USPS about mail delivery problems in all 8 wards.","date":"Sat Sep 25 15:24:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Details: https://t.co/N79znZJfrk","date":"Fri Sep 24 14:45:52 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today I'll celebrate the reopening of Franklin Park with @MayorBowser. This beautiful park was restored thanks to cooperation between @NatlParkService, DC, and @DowntownDCBID after my bill clarified that DC and NPS can enter into management agreements for NPS parks.","date":"Fri Sep 24 14:45:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced this bill for years before the January 6th insurrection, but it takes on new significance, knowing that it would have saved lives that day had it been in effect.\n\nRelease: https://t.co/cb01T7O1PP","date":"Fri Sep 24 13:26:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House passed my bill to give DC’s mayor control of the DC National Guard as part of the National Defense Authorization Act. It’s the first time either chamber has passed a bill to give DC control of our own National Guard.","date":"Fri Sep 24 13:26:38 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@woewoeisme Me neither! Wasn’t me.","date":"Fri Sep 24 03:36:41 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This morning, I'll speak at a @TransportDems Aviation Subcommittee hearing examining the increase in air rage incidents and its effects on workers, passengers, airlines, and airports. \n\nWatch: https://t.co/lmDOHHcel2","date":"Thu Sep 23 15:26:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, the Senate confirmed Florence Pan to the US District Court for DC.\n\nI recommended Pan to Biden for the position, and because Biden has granted me senatorial courtesy, he nominated her.\n\nI look forward to seeing her serve capably in this highly important position.","date":"Thu Sep 23 15:13:40 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/WgB2lRQP70","date":"Thu Sep 23 15:13:40 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Not my zebras, but if you see the dazzle tell them dinner’s at 6:00.","date":"Thu Sep 23 15:04:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@ajhoward121 @JeffAckermann @wusa9 Yes?","date":"Thu Sep 23 14:58:53 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@ajrayfeh @JeffAckermann @wusa9 Wasn't me.","date":"Thu Sep 23 14:54:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@uppitymermaid @aguilarja Wasn’t me.","date":"Thu Sep 23 13:18:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@moldyfigs @SylvesterTurner @RepStricklandWA @OurMayors @usmayors @oneaugusta @WhenWeAllVote @LChapmanEsq @DeliverMyVote @MayorBroome @JamalSimmons Ok.","date":"Wed Sep 22 22:41:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@aguilarja Word.","date":"Wed Sep 22 22:41:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on International Day of Peace, I reintroduced my resolution designating September as National Peace Month. \n\nThe resolution is particularly important this year, after a mob staged a violent attempted coup at the Capitol on January 6th.","date":"Tue Sep 21 20:12:44 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The original idea was inspired by a group of DC 2nd graders at @Mann_Elementary.\n\nDetails: https://t.co/PODVG0Chw8","date":"Tue Sep 21 20:12:44 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 8:45 this morning I'll speak to @ElliotCWilliams on Sirius XM to talk voting rights and #DCStatehood. \n\nListen on @SXMPOTUS, channel 124.","date":"Mon Sep 20 12:30:45 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@SharonsSpeaking #DCStatehood","date":"Mon Sep 20 12:03:31 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@rural_united Happy birthday!","date":"Mon Sep 20 11:01:32 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Soon:","date":"Sun Sep 19 20:48:25 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'll talk to @TheRevAl Sharpton tonight about yesterday's failed \"Justice for J6\" rally and #DCStatehood.\n \nWatch on @MSNBC at 5:00.","date":"Sun Sep 19 16:50:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @GarrettHaake today about Capitol security ahead of tomorrow's pro-insurrectionist rally in DC.\n\nWatch on @NBCNightlyNews tonight at 7:00 on @NBCWashington.","date":"Fri Sep 17 21:15:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on #ConstitutionDay, I remind the American people that Congress has the clear constitutional authority to make DC a state. \n \nThe House has already passed the #DCStatehood bill. It’s time for the Senate to act.","date":"Fri Sep 17 14:56:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@maiaesque @SeeMiaRoll Wasn't me.","date":"Thu Sep 16 18:08:08 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will not tolerate any Member seeking to abuse congressional power over DC.","date":"Thu Sep 16 17:40:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@RepScottPerry introduced a bill to create a special federal crime in DC for violence connected to labor disputes. \n\nAs always, Republicans not from #DC are trying to pass bills that affect only DC residents, and as usual, I will defeat this bill.","date":"Thu Sep 16 17:40:12 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"As soon as next week, the House is expected to pass my bill to give DC's mayor control over the DC National Guard, which could have made a big difference on 1/6.\n \nCurrently, the President controls the DC National Guard while governors control theirs.\n \nhttps://t.co/IGmXtumSZL","date":"Thu Sep 16 14:53:11 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@NBCWashington's @PatCollins4 and his butterfly net may be our best hope to catch these zebras.","date":"Wed Sep 15 19:51:12 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@AJ59861509 Wasn’t me.","date":"Wed Sep 15 18:14:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This Thursday, Sept. 16 at 6:00 p.m. I’ll hold a virtual discussion via Zoom about the most pressing issues facing the Latinx community in DC. \n\nTo attend, RSVP by noon on Thursday by emailing NortonEvents@mail.house.gov.\n\nDetails: https://t.co/xdjR09Ca1F","date":"Tue Sep 14 17:57:57 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced my resolution designating Saturday, 9/18, as National Dance Day. I'm pleased to join @DanceWithADM + @KenCen again this year to celebrate and to enjoy &amp; embrace our nation’s rich artistic, regional, ethnic &amp; racial diversity.\n\nRelease: https://t.co/wJ1FUkxtAO","date":"Tue Sep 14 16:47:01 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I talked to @JustinHintonTV about the prospect of the fence going back up at the Capitol in advance of this weekend's rally supporting the insurrectionists in jail for attacking the Capitol on Jan. 6.\n\nWatch tonight at 11:00 on @7NewsDC.","date":"Mon Sep 13 21:07:23 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@jbendery @kabarkoff @JFKucinich Zebras? What zebras?","date":"Mon Sep 13 20:13:35 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I received a response to my September 1 letter to @USPS regarding delayed and undelivered mail in all eight DC wards.\n\nRelease: https://t.co/8CcRJVJ5qF","date":"Mon Sep 13 20:12:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @FitzFox5DC about the fencing at the Capitol ahead of Saturday's planned pro-Trump rally.\n\nWatch tonight at 5:00 and 6:00 on @Fox5DC.","date":"Mon Sep 13 17:54:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@mattgaetz Thanks Matt.","date":"Sat Sep 11 23:31:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @Meagan_Flynn of the @WashingtonPost about my opposition to permanent fencing at the Capitol shortly before the news broke on #ZebraGate, a scandal I had absolutely nothing to do with.\n\nRead the article here: https://t.co/qpnET0fEFe https://t.co/HbwPouvS1i","date":"Sat Sep 11 22:51:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@mkramer Wasn’t me.","date":"Sat Sep 11 14:59:38 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"We will never forget the DC public school students, Rodney Dickens, Asia Cottom, + Bernard Brown; teachers James Debeuneure, Sarah Clark, + Hilda Taylor; and the two National Geographic chaperones, Ann Judge + Joe Ferguson, who were on the plane that struck the Pentagon on 9/11.","date":"Fri Sep 10 19:46:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/7nA8ubqydM","date":"Fri Sep 10 19:46:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow will mark 20 years since our nation and city incurred a tragedy that shook us to our core.","date":"Fri Sep 10 19:46:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@newtnewtriot @girlsreallyrule Wasn’t me.","date":"Fri Sep 10 16:30:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@DC_Vote I am innocent.","date":"Fri Sep 10 15:33:53 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I hope the owners find the zebras safely and that all involved live long, full lives.\n\nStatement: https://t.co/JZRD4K9a5T","date":"Fri Sep 10 15:22:40 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My alibi is solid, but given my career of fighting for statehood for the District, explaining the importance of having consent of the governed, and my recent opposition to fences, I can understand why the charge was made.","date":"Fri Sep 10 15:22:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’ve been following the news of the zebras on the run in DC suburbs. Local news has reported that the zebras were let loose on Saturday or Sunday of last weekend, a period of time during which I was enjoying quiet time at home with family.","date":"Fri Sep 10 15:22:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @LisaMascaro of the @AP about plans regarding fencing at the Capitol for the upcoming September 18 rally.\n \nRead the article here: https://t.co/wyvWUHMBSI","date":"Fri Sep 10 15:01:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"As many schools now return to in-person classes, I introduced my resolution to designate September as \"National Campus Sexual Assault Awareness Month.\"\n\nDetails: https://t.co/eXcXgVDBhR","date":"Fri Sep 10 14:27:03 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, I had the honor of speaking at the ribbon cutting for the new Frederick Douglass Memorial Bridge in DC, for which I and @LeaderHoyer got most of the funding.\n\nRelease: https://t.co/Zgw423jIEp","date":"Wed Sep 08 15:29:52 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Could a Republican Congress pass a Texas-style abortion bounty law for DC, or, if SCOTUS overturns Roe, ban abortions in DC? Until #DCStatehood, Congress has authority over DC.\n\nI've previously defeated a Republican effort to ban abortions after 20 weeks in DC.","date":"Tue Sep 07 20:43:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @Meagan_Flynn of @WashingtonPost about my bill to give DC's mayor control of the DC National Guard, which the @HASCDemocrats committee passed last week.\n \nRead the article here: https://t.co/CJEhbd8euT","date":"Tue Sep 07 17:47:04 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This week I reintroduced my bill to extend federal antidiscrimination protections to independent contractors, who often do the same work as employees but without the same protections.\n\nMore information: https://t.co/2eee5CMSsa","date":"Fri Sep 03 15:13:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @MikeVWUSA about new developments with the fencing at the Capitol in preparation for the protests on Sept. 18.\n\nWatch tonight at 11:00 on @WUSA9.","date":"Thu Sep 02 21:22:46 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @CoryNBC about the expected protests in DC on September 18 and my expectations on what could happen with the fencing at the Capitol.\n\nWatch at 4:30 and 6:30 on @NBCWashington.","date":"Thu Sep 02 18:51:41 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This morning’s committee passage of the NDAA is the first time in history a committee in either chamber has passed a bill giving the DC mayor such authority.","date":"Thu Sep 02 14:22:24 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to @HASCDemocrats Chair @RepAdamSmith, a strong supporter of #DCStatehood, for giving the DC mayor control over the DC National Guard as part of the FY22 NDAA. The governors of the states and territories control their National Guards.","date":"Thu Sep 02 14:22:24 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This is the first time in history a committee has passed a bill to give the DC mayor this authority.\n \nThe governors of the states and territories control their National Guards. The DC mayor should have the same.\n \nDetails: https://t.co/s8cFBbSBF2","date":"Thu Sep 02 14:07:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#Breaking: Early this morning, the @HASCDemocrats passed my bill with @ChrisVanHollen, @RepMaloney, @SenatorCarper, + @RepAnthonyBrown to give the DC mayor control over the DC National Guard.","date":"Thu Sep 02 14:07:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"It is time for the Senate to pass my bill with @RepDonBeyer to require all fed law enforcement officers to wear body cameras. We first introduced the bill after US Park Police officers killed Bijan Ghaisar in 2017.","date":"Wed Sep 01 17:47:25 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"It’s a good start to see @TheJusticeDept beginning to deploy body cameras today, though its program is too narrow.","date":"Wed Sep 01 17:47:24 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @AdamLongoTV about tomorrow’s markup of my bill to give the DC mayor control over DC's National Guard, which would have saved lives on January 6th.\n\nWatch tonight at 7:00 on @WUSA9.","date":"Tue Aug 31 21:06:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Not only is the federal government’s authority over DC property anti-democratic, it delays and increases the cost of development in the District.\n\nDetails: https://t.co/gpgK1cUaqI","date":"Tue Aug 31 15:37:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today I reintroduced my bill to remove the National Capital Planning Commission’s authority over DC property.\n\nThe federal government has no business in local land-use policies and decisions.","date":"Tue Aug 31 15:37:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to the thousands who marched this past weekend in support of the #ForThePeople Act, the John Lewis #VotingRightsAct, and particularly for #DCStatehood.","date":"Tue Aug 31 13:26:50 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My bill w/ @ChrisVanHollen, @RepMaloney, @SenatorCarper, + @RepAnthonyBrown to give DC's mayor control over @DCGuard1802, as governors of states + territories have over their National Guards, has been included in the FY 22 National Defense Authorization Act.","date":"Mon Aug 30 20:29:09 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The NDAA will be marked up by @HASCDemocrats Wednesday.\n\nSee our joint release: https://t.co/fyYC2Opeq5","date":"Mon Aug 30 20:29:09 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I introduced a bill with @RepMondaire and @RepRitchie this week to create a commemorative stamp in honor of Bayard Rustin, one of the civil rights leaders behind the 1963 March on Washington. \n\nRelease: https://t.co/W8ZOD98UMn","date":"Tue Aug 24 17:30:44 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The Senate @JudiciaryDems Committee approved Jia Cobb + Florence Pan for the US District Court for DC, both of whom I recommended to President Biden. \n\nWhile DC doesn’t have senators, Biden gave me senatorial courtesy for nominations, as did Pres. @BarackObama + @BillClinton.","date":"Mon Aug 23 19:46:32 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a resolution to make Chuck Brown’s birthday, Aug. 22, 2021, “Chuck Brown Day.” This day would celebrate DC's very own #ChuckBrown for his contributions to music, DC culture, and #DCStatehood.\n\nhttps://t.co/W1LRSMrb4j","date":"Fri Aug 20 19:28:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I look forward to defeating @RepPatFallon’s anti-home-rule that would prohibit #DC from requiring proof of COVID-19 vaccination as a condition of entering any building or facility in DC. #HandsOffDC\n\nRelease: https://t.co/NJQoEZoh36","date":"Wed Aug 18 18:38:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Unlike the high-profile cases of Governor Cuomo and even Congress itself, this commission would focus on the average worker in the private and public sectors.\n\nRelease: https://t.co/5li9GI9MtR","date":"Wed Aug 18 15:44:23 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I reintroduced my bill today to create a national commission on combating sexual harassment in the nation’s industries and workplaces after watching Gov. Cuomo’s shameful fall and resignation.","date":"Wed Aug 18 15:44:23 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week the second monthly payments from the #ChildTaxCredit were deposited in the bank accounts of DC residents and Americans across the country. \n\nSee if you're eligible: https://t.co/GyhgGvDpTb https://t.co/myLUpFOGPE","date":"Mon Aug 16 16:39:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tonight:","date":"Thu Aug 12 20:58:23 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Soon:","date":"Thu Aug 12 14:44:46 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"In the 6:00 pm hour tomorrow, I'll speak to @ZerlinaMaxwell about the petition I'm delivering to the White House calling on @POTUS to eliminate the filibuster.\n\nWatch on @PeacockTV.","date":"Wed Aug 11 19:37:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow at 11:00 I'll speak at a @StandUpAmerica rally by the @WhiteHouse to deliver a petition calling on @POTUS to end the filibuster. \n\nAs we strive for #DCStatehood, DC has the most to gain by the elimination of the filibuster.\n\nWatch here: https://t.co/SDlhuzQOdJ","date":"Wed Aug 11 17:55:50 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"While I continue to press for #DCStatehood, I will also fight proposals like Senator Marshall’s that seek to legitimize a proposal that neither D.C. nor Maryland want.\n\nRelease: https://t.co/Sl5vSzCeBJ","date":"Tue Aug 10 20:55:15 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Senator @RogerMarshallMD's amendment to the Senate budget resolution providing funding for retrocession has no support from either DC or MD.","date":"Tue Aug 10 20:55:15 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@WHands80 You are welcome.","date":"Tue Aug 10 19:41:18 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Happy 175th birthday today to the @Smithsonian. \n\nHere's to 175 more years of enriching the American public.","date":"Tue Aug 10 18:58:12 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today I reintroduced my bill to remove the Architect of the Capitol and NPS director from #DC’s Zoning Commission. \n\nLand use is a basic local matter. The fed govt loses nothing because its interests in land use are protected by federal law.\n\nRelease: https://t.co/KvKCaTmoI6","date":"Tue Aug 10 14:19:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thursday at 11:00 I’ll speak at a press conference outside the @WhiteHouse and deliver a petition signed by hundreds of thousands calling on @POTUS to use the full weight of his office to eliminate the filibuster.\n\n#DCStatehood has much to gain.\n\nDetails: https://t.co/LWbstP4hIj","date":"Mon Aug 09 19:37:15 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"“By restoring full self-determination and representation to a jurisdiction that is predominantly Black and majority women, #DCStatehood would both rectify systemic discrimination and… powerfully advance gender and racial justice.” - @TheGepi\n\nRead: https://t.co/qKlCvkBPvk","date":"Mon Aug 09 19:18:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @E_N_McMorris about Thursday's @StandUpAmerica rally where I'll speak at calling on @POTUS to use the full weight of his office to eliminate the filibuster.\n\nListen at 2:30 today on @WHURfm.","date":"Mon Aug 09 18:30:50 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congratulations to DC's own Kevin Durant and #TeamUSA who won a gold medal in men’s basketball at the #TokyoOlympics! #DCStrong https://t.co/gXkByOJ7P4","date":"Mon Aug 09 16:51:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week I spoke to @PDeRienzo of @WBAI about my bill requiring the US to sign + ratify an international agreement to dismantle America's nuclear weapons.\n\nListen here: https://t.co/ZEXQkih2Is","date":"Mon Aug 09 14:14:32 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on the 76th anniversary of the day the #Hiroshima nuclear bomb was dropped, I spoke to @PDeRienzo of @WBAI about my bill requiring the US to sign + ratify an int. agreement to disable + dismantle America's nuclear weapons once the other nuclear powers embark on the same.","date":"Fri Aug 06 21:42:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Listen at 6:00: https://t.co/2B8i91yoQY","date":"Fri Aug 06 21:42:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Soon:","date":"Thu Aug 05 20:36:53 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 4:30 today I will attend the @WhiteHouse ceremony for @POTUS to sign the bill awarding congressional gold medals to USCP and @DCPoliceDept officers who fought to protect the Capitol on Jan. 6.\n\nWatch here: https://t.co/GjJSfuVEEL","date":"Thu Aug 05 15:47:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you, @SpeakerPelosi, for inviting me to participate in yesterday's signing ceremony for the bill awarding congressional gold medals to USCP and @DCPoliceDept officers who fought to protect the Capitol from insurrectionists on 1/6. https://t.co/YMpSR0pJvP","date":"Thu Aug 05 15:30:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Starting now, and updated watch link: https://t.co/8b3j8bEBQ0","date":"Wed Aug 04 19:33:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"It does not escape me or DC residents that @DCPoliceDept bailed out Congress that day, even though they do not have full voting representation in Congress without #DCStatehood.\n\nWatch here: https://t.co/lfByJcthkz","date":"Wed Aug 04 17:01:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 3:30 today I'll join @SpeakerPelosi for a bill enrollment ceremony to award Congressional Gold Medals to USCP and MPD officers who protected the Capitol, members and staff during the Jan. 6 insurrection.","date":"Wed Aug 04 17:01:09 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today Treasury Secretary Janet Yellen briefed @HouseDemocrats on steps jurisdictions can still take to avoid hardship to tenants. Many jurisdictions have been slow in getting to tenants rent relief that is already available.\n\nMore information: https://t.co/bYZpD3KaAK","date":"Tue Aug 03 20:28:16 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC tenants concerned about eviction can learn more about the off-ramp DC has created, including a new set of rules that will make it harder to evict through Jan. 1.","date":"Tue Aug 03 20:28:16 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today is Black Women's Equal Pay Day, the day in 2021 that marks how much longer Black women have to work with a pay gap of $0.63 to catch up to what white non-Hispanic men made last year.\n\n#EqualPay for equal work. It's overdue. https://t.co/b5vMDAUtRr","date":"Tue Aug 03 18:41:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congratulations to @TaylorKnibb who did DC proud by joining her team to win a silver medal in the triathlon at the #TokyoOlympics.\n\n#DCStrong https://t.co/YRBff4wz6N","date":"Tue Aug 03 14:49:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @Meagan_Flynn of @WashingtonPost about my bill to have DC take control of its parole system. We can get this important function even before we achieve #DCStatehood.\n\nRead: https://t.co/rtLLvBPJgl","date":"Tue Aug 03 14:25:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congratulations to Capitol City Little League, who'll represent DC in the @LittleLeague World Series this week on @ESPN. \n\nDC and your congresswoman are cheering you on!","date":"Mon Aug 02 16:21:18 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"For their work on behalf of DC residents, we should make sure that these public servants receive all that they have earned when they retire.\n\nRelease: https://t.co/TEAcDpHxRK","date":"Fri Jul 30 16:52:42 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I reintroduced my bill to allow certain employees transferred under the DC Revitalization Act to make retroactive deposits toward annuities under the Federal Employees Retirement System.","date":"Fri Jul 30 16:52:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House also passed my amendment blocking SEC from leasing a headquarters on its own instead of through GSA, as other agencies do. https://t.co/wECjqsfHP8","date":"Thu Jul 29 22:04:01 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"As co-chair of the Quiet Skies Caucus, I’m pleased the House today passed my amendment directing FAA to prioritize combating aircraft noise.","date":"Thu Jul 29 22:03:54 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m very pleased to have secured nearly $12 million in Community Project Funding, formerly known as earmarks, for DC organizations in the appropriations bill the House just passed. This is important funding requested by DC organizations. See my release: https://t.co/PTErqdzeeJ","date":"Thu Jul 29 21:10:14 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Consolidating DHS will improve national security coordination and cooperation, while reducing the federal government’s footprint and saving taxpayer money.\n\nRelease: https://t.co/zjcBn2SmMk","date":"Thu Jul 29 20:27:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I secured $254 million for the Department of Homeland Security consolidation project at St. Elizabeths in Ward 8 in a bill the House passed today.","date":"Thu Jul 29 20:27:49 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I secured many victories for DC in the FY22 DC Appropriations bill passed by the House today, including $40m for @DC_TAG, an increase in the annual and lifetime DCTAG awards, no anti-home-rule riders, $8m for @DCWater, and $5m to fight HIV/AIDS. \n\nRelease: https://t.co/rK108UzkWd","date":"Thu Jul 29 19:53:20 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Meanwhile, a lack of statehood for #DC residents is one of the biggest forms of voter suppression still around. It’s time for the Senate to pass the #DCStatehood bill.","date":"Thu Jul 29 18:25:20 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm presiding at an @OversightDems hearing on the troubling Texas anti-voter bill, which you can watch here: https://t.co/PfqRJ6k2bp \nIt is important Congress keep looking into these issues and also pass the #ForThePeopleAct.","date":"Thu Jul 29 18:25:04 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/raA6MAOPVu","date":"Thu Jul 29 13:48:38 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm pleased that the House yesterday passed my provisions permitting scooters and sledding at the Capitol complex as part of the legislative branch spending bill. A salute to DC residents, who should have full use of the complex, one of the best parks in the District.","date":"Thu Jul 29 13:48:20 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill to seat local DC judges after a 30-day congressional review period, applying the same process to DC judges that is applied to DC legislation. \n\nCurrently, the Senate must confirm DC judges.\n\nMy bill would help expedite DC cases.\n\nhttps://t.co/7oN5zJqPjW","date":"Wed Jul 28 20:45:18 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"In a few minutes I’ll join @mitchellreports to talk about the Jan. 6 hearings.\n\nWatch at 12:15 on @MSNBC.","date":"Wed Jul 28 15:57:01 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, once again, I defeated the anti-home-rule amendments filed by @HouseGOP to DC’s appropriations bill in the Rules Committee.\n\nRelease: https://t.co/VzywWP1oVB","date":"Tue Jul 27 17:22:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Best of luck to @FTiafoe, @KDTrey5, and @TaylorKnibb, who are from DC and competing in the Tokyo Olympics.\n\nDC is cheering you on!","date":"Mon Jul 26 21:57:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I talked to @ChadPergram about gun violence in DC and around the country.\n\nWatch tonight on @FoxNews at 6:00.","date":"Mon Jul 26 19:50:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, @POTUS nominated Matthew Graves, whom I recommended, to serve as U.S. Attorney for DC. President Biden, like Clinton and Obama, has granted me senatorial courtesy for the U.S. Attorney for #DC.\n\nRelease: https://t.co/AtzRwWjphF","date":"Mon Jul 26 19:37:47 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"In a few minutes, I'll speak on the House floor about #DCStatehood.\n\nWatch on https://t.co/UGyJT0oRKq.","date":"Mon Jul 26 18:03:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, at 4:00, I’ll be managing several @OversightDems bills on the House floor, including my bill to allow DC to raise the pay of its Chief Financial Officer.\n\nWatch: https://t.co/HeX32fHtW3.","date":"Mon Jul 26 16:08:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, at 2:00, I'll speak on the House floor during debate on my Consider Teachers Act. After passage, the bill heads to the president for his signature.\n\nWatch: https://t.co/HeX32fHtW3.","date":"Mon Jul 26 15:05:29 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I look forward to defeating the 6 anti-home-rule amendments filed to the House’s FY 22 DC Appropriations bill when the Rules Committee considers them on Monday. #HandsOffDC\n\nhttps://t.co/9dRacK32Nm","date":"Fri Jul 23 21:11:07 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My fourth amendment would prohibit @OfficialFBOP from collecting health care co-pays from inmates needing medical care. These fees can cause inmates to delay  treatment, leading to worse health outcomes and higher costs for the government in the long run.","date":"Thu Jul 22 21:37:19 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My third amendment would prohibit @OfficialFBOP from collecting subsistence fees for returning citizens in halfway houses. DC Code inmates are housed by @OfficialFBOP. These fees are counterproductive to reentry.","date":"Thu Jul 22 21:37:19 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The Capitol complex belongs to the American people and must be accessible to them.\n\nThe second would prohibit @CapitolPolice from enforcing the prohibition on the use of scooters at the Capitol complex. Scooters are a green, cost-efficient way to travel.","date":"Thu Jul 22 21:37:18 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, I filed four amendments to the fiscal year 2022 appropriations bills:\n\nThe first would prohibit Legislative Branch agencies from using funds to install permanent, above-ground fencing at the Capitol complex.","date":"Thu Jul 22 21:37:18 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DidYouKnow: the #ChildTaxCredit has expanded to $3,000 per child ages 6-17 and $3,600 per child under the age of 6, and the @IRSnews launched an online tool for non-filer families to automatically receive the #ChildTaxCredit? \n\nLearn more at https://t.co/2Ltk4U70AG.","date":"Wed Jul 21 18:10:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"And direct the @FAANews to prioritize combating aircraft noise.  \nSee my press release for more details: https://t.co/JD6N5wrmxC","date":"Wed Jul 21 18:05:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I filed amendments to appropriations bills to block @HUDgov from enforcing the ban on marijuana in public housing in states where it’s legal, block @SECGov from leasing a headquarters itself,","date":"Wed Jul 21 18:04:48 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@NRDems passed my DC Flood Prevention Act, which will make DC eligible for federal coastal zone management funding. This will help DC, which sits on 2 rivers, prepare for climate change. See my press release: https://t.co/mrtEEveUeN","date":"Tue Jul 20 21:04:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@NRDems passed my DC Flood Prevention Act, which will make DC eligible for federal coastal zone management funding. This will help DC, which sits on 2 rivers, prepare for climate change. See my press release: https://t.co/mrtEEveUeN","date":"Tue Jul 20 20:57:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, @OversightDems passed my bill to require the heads of @DC_CSOSA and the Pretrial Services Agency for DC to be DC residents. This bill would ensure these federal officials have knowledge of and are connected with DC. See my release here: https://t.co/ZqIRxemMGn","date":"Tue Jul 20 18:36:42 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, the @OversightDems Committee will mark up my bill to require the Directors of @DC_CSOSA and the Pretrial Services Agency for DC, both federal agencies, to reside in DC during their tenure.\n\nRelease: https://t.co/xDVxDs3jVj","date":"Mon Jul 19 19:36:11 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Democrats are working with @POTUS to make permanent the expanded #ChildTaxCredit to help families make ends meet. \n\nFind out more about this major tax relief for working families at https://t.co/2Ltk4U70AG.","date":"Mon Jul 19 18:10:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 2:00 pm today, I'll speak on the House floor about the significant progress we're making on the #DCStatehood bill.\n \nWatch: https://t.co/HeX32fHtW3","date":"Mon Jul 19 17:40:32 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/kIRop2Zr66","date":"Mon Jul 19 16:11:12 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Ten of 12 @AppropsDems Committee reports direct federal agencies to report on advertising contracts with small disadvantaged businesses + those owned by minorities + women. \n\nI requested this language because the fed govt is the largest advertiser.","date":"Mon Jul 19 16:11:12 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today:","date":"Sat Jul 17 16:55:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on the anniversary of the death of my friend John Lewis, I remember fondly his fiery speech on the House floor in 1993 supporting the #DCStatehood bill right before the first-ever vote on the bill.","date":"Sat Jul 17 12:20:08 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'll speak about him at tonight's Good Trouble Vigil for Democracy at 8:00 at #BlackLivesMatter Plaza.\n \nWatch his 1993 speech: https://t.co/LaGLuTQ3lN","date":"Sat Jul 17 12:20:08 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @KolbieReports about the funding shortfall for Capitol Police and the National Guard, which will affect Guard training and operations around the country if Congress doesn't replenish funding by the August recess.\n\nWatch tonight at 7:00 on @WUSA9.","date":"Fri Jul 16 21:42:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I secured several victories for DC in the @AppropsDems bills + reports released this week, including $184m for a new Howard U Hospital, $150m in special capital funding for Metro, and improved access to the National Arboretum – all three vital to DC.\n\nhttps://t.co/GBU4mRSkNQ","date":"Fri Jul 16 20:14:31 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m speaking at the DC Candlelight Vigil for Democracy for #DCStatehood for our residents at 8:00 pm on Saturday, 7/17, at #BlackLivesMatter Plaza.\n\nMore information: https://t.co/rJoanW9sb7 https://t.co/w6IadUCWqK","date":"Thu Jul 15 16:19:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Now:","date":"Fri Jul 16 16:47:08 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to all the talented DC students who submitted pieces for consideration.","date":"Fri Jul 16 16:03:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Third place goes Key’Mari Thompson of @PrincipalBBAHS. https://t.co/CoAL5VXuBm","date":"Fri Jul 16 16:03:58 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Second place goes to Annaliese Honey of @WashingtonLatin. https://t.co/mRlMwfYXRj","date":"Fri Jul 16 16:03:58 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congratulations to the winners of my office's annual congressional art competition! First place goes to freshman Devan Tatlow of @SWWHS. \n\nDevan's work, titled \"What We've Lost: Saying Farewell to My Grandparents,\" will be displayed in the Capitol. https://t.co/6hvjXBHShe","date":"Fri Jul 16 16:03:57 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 12:40 today, I'll speak to @AnnMarie and @LisaAbramowicz1 about #infrastructure and voting rights.\n\nWatch on @BloombergTV.","date":"Fri Jul 16 15:52:54 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Starting today, you should receive your #ChildTaxCredit money on the 15th of each month through the end of the year.\n\nIf you don't receive it and believe you qualify, reach out to my District Office: 202-408-9041. https://t.co/0hlfHkAYNW","date":"Thu Jul 15 19:21:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Are you currently experiencing homelessness? You still qualify for the expanded #ChildTaxCredit.\n\nNo need to file an income tax return.\n\nJust head here: https://t.co/V6rA3SOlQy https://t.co/OQb6YlPVl4","date":"Thu Jul 15 18:38:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m speaking at the DC Candlelight Vigil for Democracy for #DCStatehood for our residents at 8:00 pm on Saturday, 7/17, at #BlackLivesMatter Plaza.\n\nMore information: https://t.co/rJoanW9sb7 https://t.co/w6IadUCWqK","date":"Thu Jul 15 16:19:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@HBCUCaucus RT. 😂","date":"Thu Jul 15 16:15:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I wrote an op-ed in @TheHill calling for Congress to fund a new Howard University Hospital, @HowardMedical.\n \nRead it here: https://t.co/NrK21Mg32n","date":"Thu Jul 15 14:38:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I had fun on @ColbertLateShow last night. I particularly enjoyed talking #DCStatehood and showing the flag with 51 stars.\n\nIn case anyone missed it, here's the full show: https://t.co/4mxUrFfoKw","date":"Wed Jul 14 21:48:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@JLCool3 Aye.","date":"Wed Jul 14 20:39:07 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My message to those legislators across the country introducing voter-suppression bills: \n\nBe careful. You can't stop us from voting. You're just going to make us mad and *really* get us to go vote.\n\nhttps://t.co/YLZO8JrFr0","date":"Wed Jul 14 19:18:35 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Cut child poverty in half -- file for the expanded #ChildTaxCredit to put money in your pocket on the 15th of every month. \n\nHere: https://t.co/V6rA3T5Xf8 https://t.co/fGQmqgYJ41","date":"Wed Jul 14 18:36:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Well good for you. You look happy and healthy.","date":"Wed Jul 14 18:03:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Wed Jul 14 15:08:52 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today the Senate @JudiciaryDems will hold a confirmation hearing on Jia Cobb + DC Superior Court Judge Florence Pan for DC's US District Court.\n\nI recommended Cobb + Pan to @POTUS, who gave me senatorial courtesy for judges on the District Court for DC.\n\nhttps://t.co/RtS6XPZ27e","date":"Wed Jul 14 14:19:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today @ChelliePingree, @PeterWelch and I introduced a bill to require the @OfficialFBOP to provide inmates from jurisdictions that allow inmates to vote, like DC, ME and VT, information on how to register and request absentee ballots.\n\nRelease: https://t.co/Bkg5WnhJNu","date":"Tue Jul 13 20:41:14 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tonight on @CBS","date":"Tue Jul 13 20:02:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Have you taken advantage of the most important tax relief to keep children out of poverty? File for the expanded child tax credit -- actual dollars that come the 15th of each month.\n\nHead to: https://t.co/V6rA3T5Xf8","date":"Tue Jul 13 18:52:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@DCnoCaliyes @colbertlateshow I would.","date":"Tue Jul 13 17:27:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm taking questions about #DCStatehood in advance of being reunited with my old frenemy Stephen Colbert on @ColbertLateShow. Ask your questions about statehood here and we'll pick some to answer on the show.","date":"Tue Jul 13 15:57:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Well, as long as you're on your way to DC to talk about voting rights, I’d be happy to give you a primer on #DCStatehood.","date":"Tue Jul 13 12:26:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@1st_Julianna Oh, I know.","date":"Tue Jul 13 12:21:27 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@Advisor2Royalty They do.","date":"Mon Jul 12 21:15:47 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Well, since you’ll be in DC to talk about voting rights, I’d be happy to give you a primer on #DCStatehood.","date":"Mon Jul 12 20:56:53 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My bicameral, bipartisan bill would prohibit the installation of permanent fencing at the Capitol complex. #DontFenceTheCapitol\n\nhttps://t.co/I25yZm9YwU","date":"Mon Jul 12 20:55:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I went to the Capitol to see with my own eyes that the fencing had finally come down and that our Capitol had been restored to the people but especially DC residents, for whom the Capitol grounds are also a park.","date":"Mon Jul 12 20:55:39 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"A great frustration of DC residents has been that most Americans assume we have the same rights as other Americans, and @StephenAtHome helped elevate #DCStatehood in the national consciousness.","date":"Mon Jul 12 16:11:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Now that the House has passed the #DCStatehood bill twice and we have a @POTUS who supports the bill, what will Colbert make fun of? We’ll see tomorrow evening. Watch tomorrow on @CBS at 11:30 p.m.\n\nRelease: https://t.co/0Ya2aePhsP","date":"Mon Jul 12 16:11:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@EHollyNorman @HillRagDC @uscapitol @visitthecapitol @DontFenceTheCap Don’t know. Where are they?","date":"Sat Jul 10 18:39:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Yesterday, NPS opened the initial public comment period on the closure of Beach Drive. The comment period is open through August 22nd. \n\nShare your opinion with NPS by submitting a comment: https://t.co/MF32VxJcY4\n\nRelease: https://t.co/dLI0oLPDNR","date":"Fri Jul 09 21:17:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@SachsSabine @PalmerReport @electroboyusa Coolest? @PalmerReport and @SachsSabine.","date":"Fri Jul 09 20:24:50 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The residency requirement will help ensure these officials have in-depth knowledge of the issues and challenges that DC residents face.\n\nRelease: https://t.co/CjfI1NlztE","date":"Fri Jul 09 19:05:06 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I introduced a bill to require the Directors of @DC_CSOSA and the Pretrial Services Agency for DC, both federal entities, to reside in DC.","date":"Fri Jul 09 19:05:06 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I shared with @ChadPergram my reaction to the fencing around the Capitol finally coming down today.\n\nWatch on @FoxNews at 2:45.","date":"Fri Jul 09 16:56:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today at 6:00, NPS is having a public meeting on whether to keep portions of Beach Drive closed to vehicles.\n\nMore information: https://t.co/MF32VxJcY4","date":"Thu Jul 08 20:09:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Is @StephenAtHome Colbert ready for our rematch on Tuesday, now that our #DCStatehood bill has passed the House not once, but twice?\n\nI’m ready. https://t.co/gg8fYj1MDj","date":"Thu Jul 08 18:39:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will not allow the Capitol Hill neighborhood to be turned into a military zone any more than the Capitol itself.\n\nRelease: https://t.co/m9Mxh6Axd3","date":"Thu Jul 08 16:09:38 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I welcome the announcement I have long sought that the fencing at the Capitol will begin to come down as soon as tomorrow. \n\nIn the year 2021, we must not use a 19th-century approach to security when 21st-century approaches are available and more effective.","date":"Thu Jul 08 16:09:38 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I talked to @DerrickWard4 about the fencing finally coming down at the Capitol.\n\nWatch on @NBCWashington tonight at 11:00.","date":"Wed Jul 07 22:56:49 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Pending #DCStatehood, I've introduced several bills to bring DC closer to the autonomy its residents deserve and respond to the attack on the Capitol, such as the DC National Guard Home Rule Act, which would give the mayor control over the DC National Guard.","date":"Wed Jul 07 18:56:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Six months ago, insurrectionists attacked our Capitol.\n\nThis somber milestone reminds us that the @DCPoliceDept, paid for by DC residents who have no voting representation in Congress, voluntarily helped save the lives of members of Congress and democracy itself.","date":"Wed Jul 07 18:56:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/5nlkahBF81","date":"Wed Jul 07 18:56:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Slight change of plans: I'll be on the @ColbertLateShow for another round with my best frenemy @StephenAtHome on Tuesday, 7/13.","date":"Wed Jul 07 17:58:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@AppropsDems also removed the riders prohibiting DC from spending its local funds on abortions and recreational marijuana commercialization.\n\nRelease: https://t.co/gTKZzWPipO","date":"Tue Jul 06 20:16:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I got several priorities for DC passed in committee last week, including $254m for the DHS consolidation project at St. Elizabeths and $40m for DCTAG.","date":"Tue Jul 06 20:16:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/h3GcS6Qnai","date":"Tue Jul 06 16:06:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, I reintroduced my bill to require the President to fly the nation's flag at half-staff on the death of the DC mayor, like @POTUS does for the death of governors of the states and territories.\n\nThis bill does not require #DCStatehood, only equal respect for DC.","date":"Tue Jul 06 16:06:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This July 4th, I noted that the continuation of #TaxationWithoutRepresentation not only violates a main pillar of the revolution on which our country was founded.","date":"Tue Jul 06 15:45:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Allowing the nearly 700,000 residents of the nation’s capital to continue to live as second-class citizens betrays the spirit of July 4th itself. #DCStatehood\n\nRelease: https://t.co/Rl3qhk5ELD","date":"Tue Jul 06 15:45:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House passed the #INVESTAct last week, including my DC priorities. I helped draft the bill as chair of the @TransportDems Subcommittee on Highways and Transit.\n\nRelease: https://t.co/nR0QzefddT","date":"Tue Jul 06 15:32:07 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Sun Jul 04 15:49:29 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The bill combats climate change by focusing on transportation options other than gas cars, including electric cars, mass transit, walking and bicycling.  See my press release for my statement on this achievement: https://t.co/KinGiSwCJc","date":"Thu Jul 01 23:01:40 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House today passed a landmark surface transportation infrastructure bill, which I helped write as Chair of the Subcommittee on Highways and Transit.","date":"Thu Jul 01 23:01:19 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I spoke to @MikeVWUSA about my bill to ban disqualification of DC jurors based on sexual orientation and gender identity. Neither is appropriate in considering jurors.\n\nWatch tonight at 11:00 on @WUSA9.","date":"Thu Jul 01 00:28:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Now:","date":"Wed Jun 30 21:15:33 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Mark your calendars: I'll be going to NYC to join my old nemesis Stephen Colbert on @ColbertLateShow on Monday, July 12.\n\nHere's our original interview, way back in 2006: https://t.co/fDfNzASJdd","date":"Wed Jun 30 19:47:42 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’ll speak on the House floor soon during consideration of the #INVESTAct, the historic surface transport. bill I helped write as chair of @TransportDems' Subcommittee on Highways &amp; Transit. The bill has wins for DC, mass transit + the environment.\n\nWatch: https://t.co/HeX32fHtW3","date":"Wed Jun 30 18:06:49 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to @DC_Vote for leading dozens of national and local groups in a letter to Congress opposing any anti-home-rule riders on the FY22 DC Appropriations bill.\n\nCongress must respect DC’s right to spend its local funds as it sees fit.\n\nRelease: https://t.co/xdSGhdQi6z","date":"Wed Jun 30 18:04:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you, @RepMaloney, for yesterday’s @OversightDems markup and passage of my bill prohibiting discrimination against DC jurors based on sexual orientation and gender identity.","date":"Wed Jun 30 16:46:26 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House @AppropsDems just defeated @RepAshleyHinson's amendment that would have prohibited DC—and only DC—from using local funds on abortions for low-income women.\n\nThank you to those who defeated this effort by Republicans to interfere in DC’s local affairs.","date":"Tue Jun 29 22:25:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow morning, I will visit Martha's Table, a Head Start facility, with @SecBecerra and @DrFutrell to announce distribution of funding from the #AmericanRescuePlan.\n\nDetails: https://t.co/gBcypk8gMl","date":"Tue Jun 29 18:03:40 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will keep pressing for bills like these until our #DCStatehood bill, which is on the horizon, becomes law.\n\nRelease: https://t.co/RK7FmIf9XK","date":"Tue Jun 29 17:30:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My bill to allow DC to raise the pay of our CFO and my bill to ban discrimination against DC jurors based on sexual orientation and gender identity passed out of the @OversightDems committee today.","date":"Tue Jun 29 17:30:42 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/m3aoswgMxB","date":"Tue Jun 29 13:24:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The DC and Legislative Branch spending bill reports by @AppropsDems include priorities I’ve worked on getting for DC, including finishing the Louisiana Avenue bike lane, winding down the voucher program imposed on DC without its consent, + allowing sledding on Capitol grounds.","date":"Tue Jun 29 13:24:54 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This morning, I'll be on @Fox5DC to talk about my Beach Drive community meeting tonight and the latest on #DCStatehood.\n\nWatch at 7:30 on Fox 5.","date":"Tue Jun 29 10:57:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 7:00 pm tomorrow, I will hold a virtual roundtable on whether to permanently close the portion of Beach Drive closed to vehicle traffic during the pandemic.\n\nTo participate, RSVP by emailing NortonEvents@mail.house.gov by noon tomorrow.","date":"Mon Jun 28 19:22:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow morning, I'll be on @Fox5DC to discuss my upcoming virtual roundtable on the closure of Beach Drive and to give an update on the fight for #DCStatehood.\n \nWatch at 7:30 am on Fox 5.","date":"Mon Jun 28 19:02:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I reintroduced my DC Clemency Home Rule Act today to give the District exclusive authority, like the states and territories have, to grant clemency to offenders convicted under local law.","date":"Mon Jun 28 17:52:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Pending #DCStatehood, I am getting DC as much home-rule authority as possible using the processes available.\n\nRelease: https://t.co/jqcihK3o2E","date":"Mon Jun 28 17:52:55 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The DC Council does not have the authority to enact these laws.\n\nRelease: https://t.co/XhjoXwvBDt","date":"Mon Jun 28 15:04:07 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, the @OversightDems will mark up two of my bills: One to prohibit disqualifying DC jurors from serving based on their sexual orientation or gender identity, and one to give DC the authority to raise the pay of its CFO, who is paid exclusively with local funds.","date":"Mon Jun 28 15:04:07 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The bill also removes the two enacted FY 21 riders, which prohibit DC from spending its local funds on abortion services for low-income women and recreational marijuana commercialization.\n\nRelease: https://t.co/EytA5dpQsg","date":"Fri Jun 25 20:30:49 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House’s FY22 DC spending bill, passed in subcommittee yesterday, contains sweeping victories for DC, including $40m for @DC_TAG and an increase in the annual DCTAG award from $10,000 to $15,000.","date":"Fri Jun 25 20:30:49 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/KwgT7onLE1","date":"Fri Jun 25 18:48:57 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The $254 million for GSA for the @DHS_gov consolidation project at St Elizabeths in Ward 8 included in a spending bill passed by an @AppropsDems subcommittee yesterday will improve DHS operations, encourage spending in DC’s economy, and ultimately improve our country’s security.","date":"Fri Jun 25 18:48:57 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The @WashingtonPost @PostOpinions published an excellent editorial yesterday cataloging the preposterous arguments Republicans continue to use against #DCStatehood, including at this week's Senate @HSGAC hearing on the DC statehood bill.\n\nRead: https://t.co/36e9tQjtSp","date":"Fri Jun 25 18:38:08 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m cosponsoring the Justice for Exonerees Act, introduced by @RepMaxineWaters today, because it ensures those who served time in the federal system for crimes they didn’t commit are more fairly compensated. \n\nIt’s the least we can do.\n\nMore information: https://t.co/i6FhsdJkmQ https://t.co/WgCahfOtV4","date":"Fri Jun 25 18:27:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Update: Listen at 1:15 on 99.1 FM.","date":"Fri Jun 25 16:58:51 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 1:00 pm I'll be on @BloombergRadio to discuss #infrastructure and voting rights.\n\nListen on 99.1 FM.","date":"Fri Jun 25 16:46:22 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Hey, I'm champion of electric scooters here. They're a safe, innovative mode of transportation that allow people to travel quickly without the congestion or air pollution associated with cars.\n\nGlad to see you're putting them to good use, @SenatorTimScott!","date":"Thu Jun 24 17:42:32 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Soon: I'll speak in this morning's @OversightDems hearing on the need for comprehensive paid leave.\n\nWatch: https://t.co/zJEMFMpEkz","date":"Thu Jun 24 14:30:46 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"While Amtrak deserves our thanks and praise for implementing its own policy banning smoking on trains, our bill to codify that ban will ensure the policy cannot be reversed.\n\nRelease: https://t.co/d8jmTJU7cI","date":"Wed Jun 23 22:21:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My bill with @SenatorCarper to ban smoking, including electronic cigarettes, on Amtrak has passed out of the Senate @CommerceDems committee and the House @TransportDems committee.","date":"Wed Jun 23 22:21:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/TfL71lBtkY","date":"Wed Jun 23 21:50:24 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House FY22 GSA spending bill, released today, includes $254 million for the St. Elizabeths @DHSgov consolidation project.\n\nThe funding will go a long way to complete the project, improve operations, make our country safer, + promote greater spending by fed. employees in DC.","date":"Wed Jun 23 21:50:24 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"But he has given us another reason for Senate passage of #DCStatehood, freeing DC from such interference.\n\nhttps://t.co/beay2nkl9i","date":"Wed Jun 23 15:45:36 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The @GOP Congressman who introduced a bill to keep DC from teaching critical race theory (about laws and policies that perpetuated systemic racism) is wasting his time on a bill I will see dies.","date":"Wed Jun 23 15:45:35 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"In the @WashingtonPost, @BerkeleyLaw dean and constitutional law scholar Erwin Chemerinsky explains why the #DCStatehood bill is clearly constitutional.\n\nRead his op-ed here: https://t.co/4xr5h3DG7U","date":"Wed Jun 23 13:28:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"During #Pride month, I reintroduced my bill to protect LGBTQ and reproductive rights in DC by eliminating the applicability of the Religious Freedom Restoration Act to DC.\n\nRFRA doesn’t apply to states.\n\nSee my release for details: https://t.co/zMlRHMwFEt","date":"Tue Jun 22 21:44:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Your hearing helped to continue the momentum that has been building. \n\nI look forward to working with you to ensure Senate passage of the bill.","date":"Tue Jun 22 20:49:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to @HSGAC Chairman @SenGaryPeters and @SenatorCarper for today's excellent Senate hearing on the #DCStatehood bill, only the second Senate hearing on the bill in the nation’s history.","date":"Tue Jun 22 20:49:59 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"After today's Senate @HSGAC hearing on the #DCStatehood bill, I spoke to @NickMinock about the hearing and the path forward.\n\nWatch on @7NewsDC at 4:00, 5:00 and 6:00.","date":"Tue Jun 22 20:03:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today's @HSGAC hearing made the definitive case for the #DCStatehood bill.","date":"Tue Jun 22 19:57:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Despite questions from Republicans seeking to challenge the constitutionality of the bill and DC’s own ‘readiness,' the testimony presented leaves no doubt that the #DCStatehood bill is constitutional and the state would meet all of its obligations.","date":"Tue Jun 22 19:57:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/4K34NsyMI9","date":"Tue Jun 22 19:57:37 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I delivered opening remarks in today's @HSGAC hearing on the #DCStatehood bill.\n\nFull remarks here: https://t.co/prEBGCw69H","date":"Tue Jun 22 14:23:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Or it can live up to our nation’s founding principles and pass the #DCStatehood bill.","date":"Tue Jun 22 14:21:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Congress has a choice. \n\nIt can continue to exclude DC residents from the democratic process, forcing them to watch from the sidelines as Congress votes on federal and DC laws, and to treat them, in the words of Frederick Douglass, as “aliens, not citizens, but subjects.”","date":"Tue Jun 22 14:21:42 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC’s population is larger than two states. \n\nDC pays *more* federal taxes per capita than any state and pays more federal taxes than 21 states. DC’s gross domestic product is larger than 17 states. \n\nIn 2016, 86 percent of DC residents voted for #DCStatehood.","date":"Tue Jun 22 14:20:40 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Our country was founded on the principles of no #taxationwithoutrepresentation and consent of the governed, but DC residents are taxed without representation and cannot consent to the laws under which they, as American citizens, must live.","date":"Tue Jun 22 14:16:47 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@POTUS Joe Biden strongly supports the #DCStatehood bill and is the first president to put the full weight of the presidency behind the bill in the nation’s history.\n\nCongress has both the moral obligation and the constitutional authority to pass the #DCStatehood bill.","date":"Tue Jun 22 14:16:26 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Following in the footsteps of Senator @JoeLieberman, under @SenatorCarper's leadership, the #DCStatehood bill has 45 Senate cosponsors, which is the greatest number of Senate cosponsors of the bill in the nation’s history.","date":"Tue Jun 22 14:15:26 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@SenatorCarper, I particularly thank you for sponsoring #DCStatehood and for being a champion for DC in the Senate.","date":"Tue Jun 22 14:15:03 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This hearing is of historic significance as only the second Senate hearing on our D.C. statehood bill in the nation’s history.","date":"Tue Jun 22 14:14:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@SenGaryPeters, on behalf of the nearly 700,000 District of Columbia residents, including 30,000 veterans, I thank you for holding today’s hearing and for being an original cosponsor of the #DCStatehood bill.","date":"Tue Jun 22 14:13:49 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today: Historic Senate @HSGAC hearing on the #DCStatehood bill. I will deliver opening remarks at 10:00 am.\n\nWatch: https://t.co/MQHZLgl2lG","date":"Tue Jun 22 13:42:58 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow morning I’ll be on @WUSA9’s @GetUpDC to talk about the historic Senate hearing on #DCStatehood, only the second in history. \n\nWatch between 5-7:00 am on WUSA9.","date":"Mon Jun 21 21:09:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Tomorrow, I will speak at a historic Senate @HSGAC hearing on the #DCStatehood bill, only the second Senate hearing on the bill in history.\n \nDetails: https://t.co/H6oQxcPd6w","date":"Mon Jun 21 20:02:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Release: https://t.co/HBeAyjEYbq","date":"Mon Jun 21 18:58:03 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"MPD, paid for by DC residents, helped save the Capitol, members of Congress, and democracy itself that day even though DC residents are denied the benefits of that democracy themselves.\n\nDC residents deserve all the benefits of democracy, which would be achieved by #DCStatehood.","date":"Mon Jun 21 18:58:03 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Last week, the House passed a bill to award Congressional Gold Medals to law enforcement agencies, including @DCPoliceDept, that responded to the 1/6 attack on the Capitol.","date":"Mon Jun 21 18:58:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I gave NPS until August 31 to make a final decision.  If it doesn’t by then, I will consider introducing legislation to change the name. \n\nDetails: https://t.co/SoY5CwVZp7","date":"Mon Jun 21 17:59:10 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"In Feb. I asked NPS to change the name of Melvin Hazen Park because Hazen helped demolish an African-American neighborhood in DC. \n\nNPS said it needed more time to study whether it had the authority to change the name, and if it does, whether it should change the name.","date":"Mon Jun 21 17:59:09 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Soon:","date":"Mon Jun 21 15:29:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This morning, ahead of tomorrow's historic @HSGAC hearing on #DCStatehood, I'll join @KateBolduan of @CNN to talk about voting rights and voting representation in Congress for the residents of our nation's capital.\n\nWatch: 11:30 on @CNN.","date":"Mon Jun 21 12:28:11 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"More here: https://t.co/beay2nkl9i","date":"Mon Jun 21 12:18:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The @GOP Congressman who introduced a bill to keep DC from teaching CRT (about laws + policies perpetuating systemic racism) wasted his time on a bill I will see dies. \n\nBut he has given us all one more reason for Senate passage #DCStatehood, freeing DC from such interference.","date":"Mon Jun 21 12:18:21 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"1 day until the historic Senate @HSGAC hearing on the #DCStatehood bill. https://t.co/g8eCSHRnjb","date":"Mon Jun 21 04:01:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"2 days until the historic Senate @HSGAC hearing on the #DCStatehood bill. https://t.co/86WgKorXYz","date":"Sun Jun 20 04:01:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"3 days until the historic Senate @HSGAC hearing on the #DCStatehood bill. https://t.co/MpAYle4x4z","date":"Sat Jun 19 04:01:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"4 days until the historic Senate @HSGAC hearing on the #DCStatehood bill. https://t.co/ICNrZyf3qS","date":"Fri Jun 18 04:01:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm at the @WhiteHouse today to see @POTUS sign the historic bill designating #Juneteenth as a federal holiday.\n\nWatch: https://t.co/e8CFSnu1qu","date":"Thu Jun 17 19:33:40 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"My bill to ban smoking on Amtrak trains, including electronic cigarettes, was included in the #INVESTAct which @TransportDems passed out of committee last week.\n\nDetails: https://t.co/xcECnOfUXG","date":"Thu Jun 17 18:30:08 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"So does the Senate, with its @HSGAC hearing on DC statehood scheduled for Tuesday, June 22.\n\nFull statement: https://t.co/CEglqHwpin","date":"Thu Jun 17 18:24:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Juneteenth should remind Congress that it’s time for the first to be freed to finally become equal to other Americans. \n\nThe House understands that with its passage of both the #Juneteenth and #DCStatehood bills.","date":"Thu Jun 17 18:24:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC residents: @NatlParkService is developing a vision and goals for a future portion of Anacostia Park and would like your input.\n\nDetails: https://t.co/pYYaqueNXw","date":"Thu Jun 17 18:02:02 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"5 days until the historic Senate @HSGAC hearing on the #DCStatehood bill. https://t.co/PTlQtYr6Ck","date":"Thu Jun 17 04:01:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you to DoD for responding to my letter on helicopter noise in DC by reiterating your commitment to \"fly neighborly\" with regard for the safety and comfort of those on the ground.\n\nSee my press release for details: https://t.co/oMcRHpq7tf","date":"Wed Jun 16 18:46:11 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House yesterday passed my bill w/ @ChrisVanHollen, @SenCapito + @RodneyDavis to provide the congressionally designated @NatChildrens, the nation's 1st combination children's museum + science center, rent-free space in a DC federal building. \n\nDetails: https://t.co/r3mgxGiXMG","date":"Wed Jun 16 18:02:04 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Make #Juneteenth a federal holiday. \n\nPass it on.","date":"Wed Jun 16 17:01:01 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm looking forward to my visit this afternoon to @AnacostiaHigh with @SecBecerra and @SecCardona to talk about the importance of getting vaccinated and the effectiveness of the vaccine. https://t.co/cjfHWIL8EU","date":"Wed Jun 16 16:55:13 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"6 days until the historic Senate @HSGAC hearing on the #DCStatehood bill. https://t.co/OKcUmqu4L6","date":"Wed Jun 16 04:01:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, @POTUS nominated Jia Cobb, whom I recommended, to the federal district court for DC.\n\nPresident Biden, like Clinton and Obama, has granted me senatorial courtesy for judges on the federal district court for #DC.\n\nSee my press release for details: https://t.co/ecx6R8Uodm","date":"Tue Jun 15 21:51:50 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"7 days until the historic Senate @HSGAC hearing on the #DCStatehood bill. https://t.co/hNXbxwRWBh","date":"Tue Jun 15 20:10:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Soon: I'll speak at an @OversightDems hearing about the delays in the response to the insurrection at the Capitol because DC doesn’t have control of its own National Guard, as my bill would provide.  \n\nWatch: https://t.co/4Sj0Qk5V75","date":"Tue Jun 15 18:12:52 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I look forward to giving opening remarks at the #DCStatehood hearing, which will be only the second Senate hearing on the bill in history.\n\nSee my release for details: https://t.co/Zap6M11N97","date":"Tue Jun 15 17:51:30 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, @HSGAC announced it will hold a hearing on our #DCStatehood bill on June 22.\n\nThank you to Chairman @SenGaryPeters for scheduling this hearing and to @SenatorCarper for being our champion and sponsor of the bill in the Senate.","date":"Tue Jun 15 17:51:29 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Before managing the floor this afternoon, I will make a one-minute speech on #DCStatehood.\n\nWatch at 12:15 on @CSPAN or at https://t.co/UGyJT0oRKq.","date":"Tue Jun 15 16:06:25 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"At 12:15 p.m. today, I will manage debate on the House floor for about a dozen bills on behalf of the Committee on Transportation and Infrastructure, including my National Children's Museum Act.\n\nWatch on @CSPAN or at https://t.co/UGyJT0oRKq.","date":"Tue Jun 15 15:59:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The Senate has confirmed Judge Kentaji Brown Jackson of the US District Court for DC, whom I recommended to President Obama for the district court, to the DC Circuit, which many consider to be the second highest court in the land.\n\nSee release for details: https://t.co/V4tzEGoZw2","date":"Mon Jun 14 23:34:17 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"#DCStatehood","date":"Mon Jun 14 21:27:54 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"@bigbluejb Oh.","date":"Mon Jun 14 21:19:52 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"It's more critical than ever that Congress remove the rider that prohibits #DC — and only DC — from spending its local funds on abortions for low-income women. \n\nI got it removed in the House last Congress. It's time for the Senate to step up.\n\nRead: https://t.co/yLUWeLMeOg","date":"Mon Jun 14 20:03:00 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you, @RepMaloney. The country's flag has changed many times over the course of our history. \n\nLet's celebrate #DCFlagDay by calling on the Senate to pass the #DCStatehood bill – and add a 51st star to our nation's flag. https://t.co/4Pdr7T7G7X","date":"Mon Jun 14 19:59:45 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The #INVESTAct, passed by the Committee on Transportation and Infrastructure last week, scores many victories for DC.\n\nRead my release for details: https://t.co/95m9HKq1jh","date":"Mon Jun 14 19:36:24 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I will hold a virtual community meeting on whether the portion of Beach Drive that's been closed to vehicle traffic during the pandemic should remain closed or be reopened.\n\nThe meeting will be on Tuesday, June 29th at 7:00 pm.\n\nTo RSVP, email NortonEvents@mail.house.gov.","date":"Mon Jun 14 18:02:57 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, on #DCFlagDay, we note the considerable progress we've made in getting the DC flag equal treatment to other state flags.\n\nMoreover, since the last Flag Day, #DCStatehood has passed in the House not once, but twice.","date":"Mon Jun 14 16:02:16 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"DC residents demand equal treatment of our flag, and it's now clear the majority of Americans do too.\n\nSee my release for details: https://t.co/ipl0w5hxQL","date":"Mon Jun 14 16:02:16 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This single question often disadvantages women and minorities.\n\nSee my release for details: https://t.co/FyN9A1Jtwi","date":"Wed Jun 09 22:09:20 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Republicans, who filibustered the Paycheck Fairness Act yesterday, delayed justice for American workers who receive unfair pay. \n\nThe Paycheck Fairness Act includes my Pay Equity for All Act, which would bar employers from asking job applicants their salary history.","date":"Wed Jun 09 22:09:20 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I’m pleased @TheJusticeDept will require its police officers to wear body cameras in certain circumstances. \n\nHowever, the circumstances are too narrow, and most federal police officers don’t work for DOJ.","date":"Wed Jun 09 21:03:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"The House has already twice passed my bill with @RepDonBeyer requiring all federal police officers to wear body cameras.\n\nIt’s time for the Senate to pass it, too.\n\nhttps://t.co/b6W26yjsRI","date":"Wed Jun 09 21:03:05 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"I'm chairing the Committee on Transportation and Infrastructure marathon markup of the #INVESTinAmerica Act for the next few hours.\n\nWatch: https://t.co/9wb3M6UarH","date":"Wed Jun 09 20:48:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Soon: I'll be speaking in a @TransportDems markup of the #INVESTAct. \n\nWatch: https://t.co/9wb3M6UarH\n\n#InfrastructureIsCalling","date":"Wed Jun 09 16:22:14 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Thank you, @DrugPolicyOrg, for leading a letter urging Congress to remove the rider prohibiting DC from spending local funds on commercializing recreational marijuana.\n\nThe letter was signed by 44 local, state + national justice reform, liberty + public health organizations.","date":"Tue Jun 08 22:27:46 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Read the letter: https://t.co/Ti9nWpE05Y","date":"Tue Jun 08 22:27:46 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"After today's Senate report on the Capitol attack, I again call on Congress to pass my DC National Guard Home Rule Act to give DC's mayor control over the DC National Guard.","date":"Tue Jun 08 19:09:04 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This could have saved lives on January 6th and would have allowed us to end the insurrection at the Capitol hours earlier.\n\nSee my release for details: https://t.co/V3xMLxM7Gk","date":"Tue Jun 08 19:09:04 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Today, during #Pride, I reintroduced the DC Local Juror Non-Discrimination Act to clarify #DC residents may not be excluded or disqualified from jury service in DC Superior Court based on sexual orientation or gender identity.\n\nSee my release for details: https://t.co/DszMGagBwT","date":"Tue Jun 08 17:31:50 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":".@PurduePharma and the Sackler family clearly preyed on vulnerable populations to line their pockets.  \n\nWe must pass the SACKLER Act immediately to ensure that the Sacklers are held accountable for their actions.","date":"Tue Jun 08 17:24:56 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Attorney General Wasden, why is it so offensive that Purdue Pharma targeted our nation’s servicemembers?\n\nAttorney General Healey, thousands of copies of deceptive publications like Exit Wounds were distributed in Massachusetts alone.","date":"Tue Jun 08 17:24:34 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"This guide included the false statement that, quote, “people who are not predisposed to addiction are unlikely to become addicted to opioid pain medications.”","date":"Tue Jun 08 17:24:31 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"As part of its marketing efforts toward veterans, Purdue funded and distributed a 2009 book titled, quote, “Exit Wounds:  A survival guide to pain management for returning veterans and their families.”","date":"Tue Jun 08 17:24:28 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Purdue deliberately marketed opioids to another vulnerable group: military servicemembers.","date":"Tue Jun 08 17:21:43 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Should the Sackler family be held accountable for the way @PurduePharma targeted elderly patients using misleading marketing, and simply lied to doctors about OxyContin’s risks?","date":"Tue Jun 08 17:21:41 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Attorney General Healey, in your home state of Massachusetts, sales reps allegedly told one doctor that putting elderly patients on OxyContin would improve safety from potential falls—when in reality elderly patients on OxyContin have increased risk of falling and breaking bones.","date":"Tue Jun 08 17:21:38 +0000 2021","user_id":"23600262"},{"handle":"EleanorNorton","text":"Mr. Keefe, can tell us what you know about the “geriatric strategy” and Purdue’s efforts to target seniors?","date":"Tue Jun 08 17:18:44 +0000 2021","user_id":"23600262"}]