[{"handle":"GerryConnolly","text":"#ReleaseTheReport, @NFL.","date":"Thu Jun 16 22:21:02 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Mike Pence refused to follow through on Donald Trump's illegal scheme to overturn the election on January 6. \n\nSo Donald Trump unleashed an angry, violent mob to hunt him down in the Capitol.\n\nThis is the kind of depraved criminality Republicans are actively trying to cover up. https://t.co/kJWPhlygFV","date":"Thu Jun 16 20:10:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The third @January6thCmte hearing is about to get started. Today, they'll focus on President Trump's attempts to pressure VP Pence into abusing his power and singlehandedly overturning the 2020 election.\n\nTune in at 1pm here ⬇\n\nhttps://t.co/83M241v6UK","date":"Thu Jun 16 16:50:22 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The time for action is right now. Because #ClimateCantWait. https://t.co/lgNWGWbbUn","date":"Thu Jun 16 15:37:26 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"House Democrats are working day and night to address gun violence, and we're thinking outside the box.\n\nI'm proud to cosponsor my friend @RepDonBeyer's bill to impose a 1,000% excise tax on manufacturers, importers, &amp; producers of assault weapons and high capacity magazines.","date":"Wed Jun 15 21:00:22 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans are tripping over themselves to rant and rave about baby formula and gas prices. Surely, they must have a plan. Let's rewind the tape:\n\nFunding to fix the formula shortage and prevent the next one? They voted no.\n\nCracking down on price gouging at the pump? No, again.","date":"Wed Jun 15 15:02:35 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"For four years, we had a mob boss for a president.","date":"Mon Jun 13 17:02:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"You awake, @HouseGOP? https://t.co/lV9dS6et42","date":"Fri Jun 10 12:49:56 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I’ll get this ball rolling on the House side. I didn’t ask for a pardon.","date":"Fri Jun 10 03:29:40 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you, @CapitolPolice. Thank you, thank you, thank you.","date":"Fri Jun 10 01:53:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“January 6th was the culmination of an attempted coup.” \n\n- Chairman @BennieGThompson","date":"Fri Jun 10 00:14:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I wish he could get this upset by the slaughter of innocent schoolchildren.","date":"Thu Jun 09 22:40:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Tonight, the @January6thCmte will begin to present the findings of their investigation into the insurrection at the Capitol.\n\nIn honor of those who sacrificed their safety or lost their lives, and for the sake of our democracy, I ask you to tune in:\n\nhttps://t.co/CmZREhNqIH","date":"Thu Jun 09 22:04:06 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"We don’t have to live like this. It’s up to the Senate to decide if we want to.","date":"Thu Jun 09 21:32:30 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"GOP: Guns Over People.","date":"Wed Jun 08 23:03:51 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I was Chairman of Fairfax County during the Virginia Tech massacre. We buried six of our best and brightest young people in the wake of that horrific day. \n\nWith them and their families in my heart, I'm headed over to the Floor to vote for gun control and #ProtectOurKids.","date":"Wed Jun 08 22:03:09 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"There is an emptiness in the hearts and souls of parents who have lost children to gun violence, and it cannot be filled. The tragedy lives with them forever. https://t.co/o89vsyfJK8","date":"Wed Jun 08 17:45:17 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I'm at our @OversightDems hearing, where we just heard from 11 year old Miah Cerrillo. \n\nMiah survived the shooting in Uvalde by covering herself in the blood of her friend who had been shot next to her.\n\nHow dare we tell her there is nothing we can do.","date":"Wed Jun 08 14:52:10 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"In case you’re wondering what kind of obstructionist nonsense we’re up against, this is entirely true.","date":"Wed Jun 08 01:48:35 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"If you can’t buy a beer, you can’t buy an assault rifle.\n\nTomorrow, I’m voting to raise the purchasing age for these weapons of war from 18 to 21.","date":"Wed Jun 08 01:21:22 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It was great to be back in person at the #Cappies Gala last night where I had the honor of presenting the Cappie for Best Play to @mcleanhigh! From one thespian to another, congrats to all the winners and nominees! Your love of the arts and theater will take you far. https://t.co/2hAHKXo9jp","date":"Wed Jun 08 00:00:33 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Devastated to hear this. My heart is with the families of these students, and with the entire Oakton community, during this unimaginably difficult time.","date":"Tue Jun 07 22:56:28 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"A lot going on this week. It boils down to this:\n\nRepublicans won’t pass laws to keep guns away from criminals, but they’ll pass laws to lock you up for an abortion.\n\nThey won’t pass laws to hold insurrectionists accountable, but they’ll pass laws to criminalize your miscarriage.","date":"Mon Jun 06 17:00:37 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Great news! @POTUS has invoked the Defense Production Act to accelerate domestic production of clean energy technologies, which will:\n\n✅  Increase our energy independence\n✅  Lower prices for Americans\n✅  Help us reach net zero by 2050","date":"Mon Jun 06 15:29:52 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“We urge you to listen to the American public and to the law enforcement community and support a ban on the further manufacture of these weapons.”\n\nRonald Reagan and Gerald Ford said that. https://t.co/eJMsu1m7ZW","date":"Mon Jun 06 12:22:12 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Texans: We want universal background checks!\n\n@GovAbbott: Universal door checks it is!","date":"Sat Jun 04 19:48:20 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I’ve said it before, but it bears repeating:\n\nThese kids give me hope, but it’s unconscionable that this responsibility has been shifted on to them. No child should have to protest for the right to survive the school day.","date":"Sat Jun 04 01:30:50 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"These are commonsense proposals that the vast majority of Americans support and are pleading with us to implement.\n\nWe should listen to them.","date":"Fri Jun 03 15:51:11 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"4. Enact safe storage laws and red flag laws.\n\n5. Repeal the immunity that protects gun manufactures from liability.\n\n6. Address the mental health crisis deepened by the trauma of gun violence.","date":"Fri Jun 03 15:51:10 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"1. Ban assault weapons — or at least raise the age to purchase them from 18 to 21.\n\n2. Ban high-capacity magazines.\n\n3. Strengthen background checks.","date":"Fri Jun 03 15:51:10 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Last night, @POTUS laid out his vision to #EndGunViolence in America:","date":"Fri Jun 03 15:51:10 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Our economy added 390,000 jobs last month -- on top of the over eight million jobs already created on @POTUS's watch.  \n\nUnemployment held near historic lows, following the fastest single-year drop on record.\n\nMore to be done to bring down prices, but our recovery is strong.","date":"Fri Jun 03 14:47:39 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"For every 1,000 people in this country there are about 2.5 hospital beds.\n\nFor every 1,000 people there are about 2.6 physicians.\n\nAnd for every 1,000 people there are about 1,200 guns.\n\nYou cool with that, @HouseGOP? How about you, @SenateGOP?","date":"Thu Jun 02 23:31:45 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is fantastic news. \n\nCongress should follow @POTUS's lead and pass my #NextGenFeds Act, which would reinvigorate the federal government's internship program and ensure that federal interns can finally be paid for their service.\n\nhttps://t.co/x0uyANOd2C","date":"Thu Jun 02 12:34:57 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"If it feels like you hear about another mass shooting every day, it’s because you do.\n\nThere have been 233 mass shootings in 2022. We’re 152 days into the year.","date":"Thu Jun 02 11:20:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"End this madness, @SenateGOP.","date":"Wed Jun 01 23:28:16 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy #Pride2022! This month, as we celebrate the LGBTQ+ community, let's honor those who fought and struggled for progress and recommit ourselves to protecting their legacy — now and always. https://t.co/Aknx9Pfl2J","date":"Wed Jun 01 17:16:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"We’re having issues with the phones in our DC office today — if you need assistance, please call us in Annandale at (703) 256-3071.","date":"Wed Jun 01 16:04:12 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Soon, the House will vote on several gun control measures that the vast majority of Americans support.\n\nWe will pass them—again.\n\nThe Senate must do the same. Our children’s lives depend on it.","date":"Tue May 31 23:09:58 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today, we honor the bravest among us who gave their lives in service to their country. Happy #MemorialDay, everyone.","date":"Mon May 30 10:47:56 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨The @NRA donated $10,000 to VA Republicans *on the day of the massacre in Uvalde* according to @vpapupdates.\n\nThey will bankroll their campaigns with blood money.\n\nhttps://t.co/4KEFAHwHyG https://t.co/PKjVr4iTaz","date":"Sat May 28 00:16:02 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The AR-15 is designed to kill quickly and brutally. If you’re picturing a small, round bullet hole like you might see in a movie, you are wrong.\n\nIn Uvalde, parents had to provide DNA to identify the otherwise unrecognizable bodies of their own children.","date":"Fri May 27 12:46:50 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"There is efficacy in action. \n\nThere is continued madness in inaction. https://t.co/IYo4UsE8Kw","date":"Thu May 26 19:30:23 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Students across the country are staging school walkouts to demand action on guns. \n\nThey give me hope, but it is unconscionable that this responsibility has been shifted on to them.\n\nNo child should have to protest for the right to survive the school day.","date":"Thu May 26 18:46:58 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The @NRA is headquartered in my district, but I will never be their Representative.\n\nI’m at their front door tonight to remind them. https://t.co/Vm3em7kp5h","date":"Thu May 26 00:38:08 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Too young to buy cigarettes or a beer, but old enough to buy two assault rifles and hundreds of rounds of ammunition.\n\nThere’s just no way to justify that.","date":"Wed May 25 20:25:58 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Gun violence is now the NUMBER ONE cause of death among American kids.\n\nNot cancer. Not car crashes.\n\nGuns.","date":"Wed May 25 17:15:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Mental health issues are NOT unique to the United States.\n\nRecurring massacres in schools, churches, and grocery stores ARE unique to the United States.\n\nWe are not powerless to stop this madness, and our children pay with their lives when we pretend we are.","date":"Wed May 25 16:03:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I have voted for gun control legislation more times than I can count. The House has passed these bills, only for them to die at the altar of the Republican filibuster in the Senate.\n\nOur children are dying, @LeaderMcConnell. Help us save them, or get out of the way.","date":"Wed May 25 13:30:39 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"If leaders in your community are more concerned about kids getting their hands on books than guns, they are failing you and your family.","date":"Wed May 25 12:18:58 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":".@POTUS: \"What in God's name do you need an assault weapon for except to kill someone?\"","date":"Wed May 25 00:47:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“When in God’s name are we going to stand up to the gun lobby?” -@POTUS","date":"Wed May 25 00:46:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Every time we mourn and move on, we are making a conscious choice to let the next tragedy happen.\n\nWe do not have to be a nation in constant mourning. I implore my colleagues to realize that.","date":"Tue May 24 22:59:57 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Is this the price we are willing to pay for the @NRA’s greed? \n\nAre we really willing to send our kids to die at their desks because the @GOP is too pathetic and scared to act?\n\nThis is madness.","date":"Tue May 24 21:00:02 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I am heartbroken. Again, we must grieve for children killed and wounded in the place they should feel most safe. This madness must end.","date":"Tue May 24 20:31:51 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This from the man who gave us Pol Pot, Pinochet, and a phony peace agreement after prolonging the Vietnam war by five years.\n https://t.co/HSDcYUQLf7","date":"Tue May 24 18:09:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans who voted no on capping insulin at $35/month: 1️⃣9️⃣3️⃣\n\nRepublicans who voted no on legislation to fix the formula shortage: 1️⃣9️⃣2️⃣\n\nRepublicans who voted no on stimulus checks and CTC payments: 2️⃣1️⃣0️⃣\n\nRepublicans who actually want to help your family get ahead: 0️⃣","date":"Tue May 24 17:47:36 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"If you don’t like abortion, don’t have an abortion. \n\nIf you don’t like gay marriage, don’t have a gay wedding.\n\nThe world will not stop turning because people live their lives differently than you do.","date":"Mon May 23 22:46:06 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"On behalf of the US Delegation to NATO PA, I convened an emergency meeting this morning with our Ukrainian colleague, Yehor Cherniev, to discuss urgent requests for assistance to help defend Ukrainian territory and ship agricultural products. #StandWithUkraine️","date":"Mon May 23 16:14:32 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It turns out “Lock Her Up” was just their plan for women who have miscarriages.","date":"Mon May 23 14:19:24 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you to all the students who participated in my 14th annual Congressional Art Competition! It is great to see so much artistic talent from the district on display, and congratulations to all the winners! https://t.co/NxHLDNmMpg","date":"Sun May 22 20:23:03 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“We urge the Administration and United States Senate to work together and with our NATO Allies to advance immediately the accession protocols authorizing @NATO membership for #Finland and #Sweden.”\n\nRead the letter I sent with nearly 200 of my colleagues:\n\nhttps://t.co/w90s1DIIBn","date":"Sun May 22 16:14:24 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Well, I’ve been banned from Russia. And I was so looking forward to my skiing trip in Siberia.\n\n#SlavaUkraini https://t.co/J2TJFzy2al","date":"Sat May 21 20:58:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy to have joined in celebration for the Korean Bell Garden’s 10th anniversary! The Bell of “Peace and Harmony” commemorates equality, opportunity, and freedom. Let this serve as a reminder of the peace and harmony that exists between all of us in our multicultural community. https://t.co/hIT9uPTYjq","date":"Sat May 21 16:49:14 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you @FACETSCares for having me this evening! My experience with FACETS while serving in local government has helped shape who I am as a public servant. I’m honored to be a partner in Congress for FACETS and support their strong community services. https://t.co/8bDeWPzLqw","date":"Fri May 20 23:53:35 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Delighted to be with @VP Harris, @EPAMichaelRegan, and so many friends at Meridian High School in Falls Church today to announce $500 million in new funding for electric school buses from the Bipartisan Infrastructure Law! https://t.co/TmhF5boPNx","date":"Fri May 20 20:11:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Many times, these cases are not willful crimes. These penalties are a cheap, easy way of getting enforcement up. Its unconscionable to pile fines on these people. \n\nhttps://t.co/xP1eZffRV5","date":"Fri May 20 15:44:10 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":".@POTUS just announced the first flight as part of Operation Fly Formula! The equivalent of 1.5 million bottles of Nestle baby formula will soon be en route to the US from Switzerland — with millions more to come.","date":"Thu May 19 23:33:01 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"@AOC Congratulations! Wishing you both all the best 🎉","date":"Thu May 19 22:56:37 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans spent a week ranting and raving about the formula shortage, but they don’t care about your kids. They just need a distraction from coverage of their support for extreme white nationalist ideologies.\n\nOnly 12 of them voted to actually fix the shortage. https://t.co/m6mQbOmsrQ","date":"Thu May 19 11:51:55 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Leadership.\n\nThis, paired with the legislation @HouseDemocrats will pass tonight, will be a huge relief for families across the country.\n\nThank you, @POTUS.","date":"Wed May 18 22:29:21 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Col. Yevgeny Vindman is a true public servant. He has more patriotism in his pinky finger than Donald Trump will ever have. \n\nAs the Pentagon IG has now confirmed, he deserved none of the retaliatory vitriol thrown at him by the former president and his team.","date":"Wed May 18 19:22:41 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans want to force our daughters to live with fewer rights than their mothers and grandmothers had.\n\nIt's reprehensible and un-American, and we will not stand for it.\n\n#ProtectRoe","date":"Wed May 18 18:43:06 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Amidst infant formula shortages across the country, families are going to bed wondering how they will get their babies the food they need.\n\nToday, @HouseDemocrats will pass a bill to help #FeedOurInfants by providing the FDA with the resources it needs to address this shortage. https://t.co/2vauq3bpQE","date":"Wed May 18 17:25:25 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"#HeadStart has provided critical support to families and children across the nation. Thank you for going the extra mile to continue our mission of preparing America’s young children to succeed in school and in life. #HappyBdayHeadStart https://t.co/QxmGoiv3RP","date":"Wed May 18 17:16:20 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today, on International Day Against Homophobia, Biphobia and Transphobia, we recommit ourselves to supporting the LGBTQ+ community and to rooting out bigotry and hatred wherever they appear. #IDAHOBIT","date":"Tue May 17 19:23:39 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This week, @HouseDemocrats will take action on legislation to prevent domestic terrorism, crack down on price gouging at the pump, and address baby formula shortages.\n\nHouse Republicans will spend the week defending their hateful ideology and doubling down on white nationalism.","date":"Tue May 17 15:44:10 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Training lapses are deadly serious. This is yet another preventable service and safety setback for Metro, caused by letting a safety issue languish. The Safety Commission is again demonstrating why Congress helped establish this critical oversight body.\n\nhttps://t.co/1YTfeQeRpW","date":"Mon May 16 18:56:23 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congratulations to all of the awardees at this year’s Northern Virginia District PTA ceremony. The dedicated work you all do is why our schools are so strong, keep up the great work! https://t.co/LvPre7puQU","date":"Sun May 15 20:26:32 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Heartbroken and horrified by yesterday’s shooting in Buffalo. This hate crime must be called out and these weapons have no place in our communities. Too often this pain is unleashed, this time at a grocery store. Enough. The Senate must act.","date":"Sun May 15 11:26:58 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I am deeply saddened by the tragic killing of American journalist Shireen Abu Akleh. Accountability for those responsible must be immediate, impartial, and transparent. I stand with my colleagues in Congress in defense of press freedom and the protection of journalists worldwide.","date":"Fri May 13 19:26:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I’m seeing lots of talk about how unprecedented it is to subpoena GOP congressmen for their role in Jan 6.\n\nI can tell you what’s more unprecedented: taking away a right from the American people for the first time in our history, as the GOP-appointed Supreme Court is about to do.","date":"Fri May 13 18:39:33 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Missing a putt to the left is a “mistake we can learn from.” Murdering and dismembering a respected journalist, my constituent, is a deliberate, heinous crime.\n\nIt should be met with consequences, not an invite to play 18.\n\nhttps://t.co/P7aIeeUpAj","date":"Fri May 13 16:01:31 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Mark my words — the Trump Hotel saga will go down as one of the most corrupt episodes in American political history. An utterly shameful ordeal.\n\nhttps://t.co/nj5EU1MSUj","date":"Fri May 13 13:32:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I was honored to celebrate with my dear friend and former colleague, @SharonBulova at the Merrifield Center renaming and dedication. The Sharon Bulova Community Health Center perfectly captures her legacy and commitment to service on the Board. Thank you and congrats, Sharon!! https://t.co/vTLDU2SBqQ","date":"Fri May 13 00:24:36 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Unsatisfied by attacking American democracy, Republicans take their fight against freedom abroad.","date":"Thu May 12 22:39:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"NEW: @POTUS announces additional steps to address formula shortage 👇\n\nhttps://t.co/qYcC17tHOW","date":"Thu May 12 20:14:00 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Last night, the House voted to approve $40 billion in vital aid to the people and defenders of Ukraine.\n\nThanks to President Biden, America has led the free world in responding with unity and resolve to Russia’s brutality.\n\n We will always #StandWithUkraine️ 🇺🇸🇺🇦","date":"Wed May 11 12:32:12 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Gun violence is a public health crisis.","date":"Tue May 10 17:47:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Enjoyed meeting with my friend NATO Deputy Secretary General @Mircea_Geoana, a dedicated public servant who is doing great work at NATO on innovation, democratic resilience, and NATO’s security priorities. https://t.co/odSQc8ldsd","date":"Tue May 10 14:55:54 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans care so much about the sanctity of your child's life that they actively fought us on extending free school lunches for hungry kids during the pandemic.","date":"Mon May 09 15:38:09 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy Mother’s Day!","date":"Sun May 08 11:12:02 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Hosting my 14th annual Service Academy reception. Congratulations to those who have accepted their appointments and thank you to my service academy boards for another record-setting class with 33 appointees! https://t.co/UHOR2ZhjnC","date":"Sat May 07 17:11:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congratulations @SupervisorLusk for the opening of Lee District’s new community center. This center will provide equitable resources  and educate, train, and employ people directly in our community. https://t.co/nPbv7t62Iv","date":"Sat May 07 15:27:51 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joined @ForestParkHSVA students this morning for their annual Suicide Awareness Walk. These students continue to show strength &amp; resilience by making mental health awareness a priority for Northern Virginia. Thank you for all that you do &amp; never hesitate to reach out to someone. https://t.co/Ss0JxM2f21","date":"Sat May 07 13:46:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Some political advice: speak softly and carry big glasses and a mustache. https://t.co/OngKZKlYfW","date":"Sat May 07 00:30:59 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"If you’re not sure why the fight for abortion rights is so important, ask the women who lived in a pre-Roe America.\n\nWe will not go back.","date":"Fri May 06 20:53:19 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Wrapped up our Infrastructure Week with a roundtable discussion on Metro and VRE! Brought together partners from across the region to talk about how rail transit can help expand our economy, and make life easier for our commuters with faster, safer, and cleaner options! 🚊🛤🚆 https://t.co/zUyhtlJOcG","date":"Thu May 05 23:56:53 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Also, I’d suggest a new OB/GYN.","date":"Thu May 05 15:40:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Unless Justice Alito is moonlighting as your OB/GYN, he has no business getting involved in your medical decisions.","date":"Thu May 05 15:34:59 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s what you’ve all been waiting for! For #InfrastructureWeek Day 3, we’re talking trains and Metro 🚂🚃🚋\n\nhttps://t.co/hVNLeMD4G4","date":"Thu May 05 15:17:14 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Day 2 of our Infrastructure Week featured a tour and roundtable with \n@PWCSA at their Water Facility. Ensuring that everyone in our communities have clean and safe water is a priority, and thanks to the Infrastructure Law we will be able to deliver!💧♻️ https://t.co/lKeUxhhWAf","date":"Wed May 04 20:40:47 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"In honor of Asian American and Pacific Islander Heritage Month, let's celebrate the life and legacy of former Secretary Norman Mineta — barrier-breaker and the longest-serving Transportation Secretary in the department's history. \n\nhttps://t.co/pZ50QLRYlk","date":"Wed May 04 19:46:57 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Day 2 of #InfrastructureWeek in VA-11! Watch today’s Water Reclamation event live now ♻️💧⬇️\n\nhttps://t.co/fXIVLdFs6Q","date":"Wed May 04 16:33:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Justice Alito argues the constitution is silent on a right to abortion. Well, it’s also silent on the right of SCOTUS to review and overturn acts of Congress or to assert or rescind the rights of Americans. He nullifies his own argument.","date":"Wed May 04 12:47:29 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today I joined @fairfaxcounty to announce plans to build 500 affordable housing units in Tysons Corner which will be partially financed by nearly $11M in ARPA funds. This project will help hundreds of families and individuals live and work in the economic hub of our county. https://t.co/DJmVqKybHM","date":"Tue May 03 23:42:28 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This morning we kicked off our Infrastructure Week with a Roads &amp; Bridges Roundtable. The Bipartisan Infrastructure Bill will bring millions of dollars to our state to help repair and rebuild roads &amp; bridges while focusing on climate change, resilience, equity, &amp; safety 🚗🚙🚌 https://t.co/8WuupGsBwJ","date":"Tue May 03 22:00:20 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I’m #ProRoe and proud of it.","date":"Tue May 03 20:10:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Just weeks ago, a Republican senator said that the Supreme Court was wrong to legalize interracial marriage in Loving v. Virginia. \n\nThey will not stop at Roe v. Wade.","date":"Tue May 03 18:19:53 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Women will die needlessly without proper access to reproductive care. What’s “pro-life” about that?","date":"Tue May 03 16:29:12 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s #InfrastructureWeek in VA-11! Tune in to watch today’s Roads and Bridges Roundtable 🚗 🌉 🚙 \n\nhttps://t.co/stiRecZOEx","date":"Tue May 03 15:11:18 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Samuel Alito wrote this unyielding opinion that the original 1973 decision was always wrong. \n\nBy taking away a right for the first time in constitutional history, these zealots have utterly discredited the third branch of government &amp; unleashed forces that will fracture America.","date":"Tue May 03 01:42:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The House has already voted to codify Roe v. Wade, and @POTUS is ready to sign it into law.\n\nThe Senate needs to act — now. https://t.co/hM4vGV08ez","date":"Tue May 03 01:16:47 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Abortion is a right, and I’m ready to fight for it.","date":"Tue May 03 00:59:47 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"#EidMubarak to all celebrating in #VA11 and around the world!","date":"Sun May 01 22:17:55 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Looking forward to joining @FitzFox5DC #OnTheHill at 8:30. @fox5dc","date":"Sun May 01 12:03:21 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"As President of the NATO Parliamentary Assembly, I’ve met and worked alongside many members of the @ua_parliament — including some who have taken up arms in defense of their country.\n\nTheir bravery and patriotism are unmatched. I am proud to call them allies and friends. \n\n🇺🇸🇺🇦","date":"Sat Apr 30 01:44:15 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Speaking at the 12th annual Hylton Center Gala this evening. The arts in Prince William County have helped build our community and bridge gaps. Let us continue this work together. https://t.co/IVk8sZA8ab","date":"Sat Apr 30 00:36:22 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Oil companies are emptying your pockets so they can fill theirs. The Republican refusal to help us move on from fossil fuels is a huge strain on American family budgets.","date":"Fri Apr 29 20:23:32 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"We don't need lectures on free speech from the people who are banning history classes and calling for book burnings.","date":"Fri Apr 29 17:03:11 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Federal workers have been the backbone of our response to COVID-19. Despite the risks, they served the people and kept their government up and running throughout an unprecedented crisis.\n\nThe vey least we can do is provide them with fair compensation.\n\nhttps://t.co/2Ysnzh0AGM","date":"Fri Apr 29 14:49:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Yesterday the House passed the Georgia Support Act, which I wrote with my friend and colleague @RepKinzinger. In light of Russia's illegal invasion of Ukraine, our support for nations that are vulnerable to Russian aggression is paramount.\n\nhttps://t.co/BTLSHRgsOB","date":"Thu Apr 28 17:08:35 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"A few weeks ago, @POTUS signed the Postal Service Reform Act into law!\n\nWe said we’d #SaveThePostOffice, and we delivered. https://t.co/BBh435ahaE","date":"Thu Apr 28 15:31:04 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Such incredible news. Welcome home, Trevor!","date":"Wed Apr 27 13:50:03 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"All kids deserve to feel safe, welcome, and respected in the classroom. To every LGBTQ+ student across the country — we see you, and we have your back.","date":"Tue Apr 26 13:49:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thanks to @Tjada and @FP4America for such a thoughtful dialogue on Ukraine tonight at @busboysandpoets. https://t.co/DpV9TqoUWa","date":"Tue Apr 26 01:09:54 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Had a great site visit with @foodbankmetrodc. The pandemic has increased food insecurity by 25%, and CAFB has been able to provide 27 million meals in just one year. And thanks to the American Rescue Plan CAFB will have the ability to expand their facility &amp; serve more people. https://t.co/Iy9bOQ7QVi","date":"Mon Apr 25 16:06:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"You’re not protecting kids when you’re fighting harder to rid classrooms of books than guns.","date":"Mon Apr 25 14:37:59 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Always a great time at @LortonAction’s Spring into Action Gala! Thank you for all the hard work you do to make our community better for all. https://t.co/QKbOMGUqon","date":"Sat Apr 23 23:51:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Guns were the #1 killer of kids and teens in 2020. Our children are paying for @GOP cowardice and @NRA greed with their lives.\n\nhttps://t.co/fEj1wgBnIe","date":"Sat Apr 23 21:35:19 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy Earth Day from @SEEC! We've been hard at work advancing clean energy and climate priorities, and we're not stopping now.\n\nhttps://t.co/E5UzjQdPQ3 https://t.co/DqpIzKIX9Y","date":"Fri Apr 22 17:18:57 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"On this #EarthDay, I’m fighting for climate action to lower energy costs, create American jobs, and ensure a better future for our kids.\n \nWe've already passed over 400 #SolvingTheClimateCrisis solutions in the House — and we’re pushing for more.\n \nhttps://t.co/PGqo13dBMl","date":"Fri Apr 22 16:23:46 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"I've had it with this guy. What he did is unacceptable. Nobody can defend that, and nobody should defend it.\" - Kevin McCarthy, 1/10/2021\n\nWhat changed, @GOPLeader?","date":"Fri Apr 22 14:45:39 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This morning I participated in @nvar’s town hall with my colleagues @RepWexton and @RepDonBeyer. Investing in our communities through transportation, climate, education, housing, and much more, will always be a top priority. https://t.co/tOcfQO3qjl","date":"Fri Apr 22 14:21:24 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is exactly why Kevin McCarthy and his ilk are so desperate for a coverup. The more that comes to light, the clearer their moral bankruptcy becomes.\n\nShameless, spineless, and thoroughly unsurprising.","date":"Fri Apr 22 02:09:10 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you to the American Turkish Friendship Association for having me as your guest tonight for Iftar. Breaking today’s fast together as brothers and sisters. https://t.co/RXHChLxSCA","date":"Fri Apr 22 00:45:46 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"President Biden again makes clear — to Putin and to the world — that the United States will answer the call in defense of democracy. \n\nWe will #StandWithUkraine.","date":"Thu Apr 21 19:41:07 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The backlog of 8 million unprocessed tax returns from 2021 means 8 million households are missing out on money that can be used for food, childcare, medication, &amp; other necessities.\n\nTune in at 10am as I hold a hearing to get the IRS back on track. ⬇️\n\nhttps://t.co/aNsRU5E6uY","date":"Thu Apr 21 13:35:25 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today I got to take a look at some of @ElectrifyAm’s Electric Vehicle chargers in my district. Expanding the EV network &amp; standardizing the chargers are two ways we can make EVs accessible &amp; reliable for the average American. With the Infrastructure Bill this will be possible. https://t.co/XlQZQGPYIk","date":"Wed Apr 20 18:37:30 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Enjoyed today’s town hall with @lumentechco @LumenGov on the importance of investing in IT Modernization at all levels of government to ensure we are responding to the needs of the American people. https://t.co/ye9gEc8uXZ","date":"Tue Apr 19 16:31:14 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Enjoyed meeting with @UVABatten students about practical legislation and how to get involved. A great conversation with the next generation of policymakers! https://t.co/ny4mycEXDL","date":"Mon Apr 18 21:47:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“The IRS is currently limping along without enough staff or funding. Congress, especially Republicans, needs to face up to reality.”\n\nThis Thursday, I’ll hold a hearing on exactly this issue to make that reality impossible for my GOP colleagues to ignore.\n\nhttps://t.co/DRzCJs3Nm3","date":"Mon Apr 18 16:50:55 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Our Annandale Office is currently without power. If you have an immediate concern, please call 202-225-1492. - staff.","date":"Mon Apr 18 15:51:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy Easter!","date":"Sun Apr 17 11:43:51 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s been 15 years since 32 innocent lives were taken in the Virginia Tech Massacre. Mary Read was one of those lives. Today, we rededicated Mary’s memorial in Annandale to never forget her spirit. Now, for Mary &amp; countless other victims, it’s time for commonsense gun reform. https://t.co/b71wo6kPvw","date":"Sat Apr 16 21:49:22 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you @VLLUpdates for having me take part in this year’s Opening Ceremony. It’s been a great 70 years of baseball in Vienna! I see many more championship teams in your future. https://t.co/rdh24hqrj5","date":"Sat Apr 16 21:33:37 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Wishing all who celebrate a peaceful and joyous Passover. Chag Sameach!","date":"Fri Apr 15 14:12:53 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Was great to hear from some of the wonderful nonprofits in my district about their successes &amp; challenges these past 2 years. The difference they’ve made in our community is immeasurable &amp; I’m grateful for their dedication. I look forward to our continued community partnerships! https://t.co/wFcHk8Uysn","date":"Thu Apr 14 22:47:56 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Things that kill kids in the classroom: guns.\n\nThings that do not kill kids in the classroom: books.\n\nIf we’re talking about protecting students, let’s at least get our priorities straight.","date":"Thu Apr 14 14:43:12 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joined the McLean Islamic Center’s Iftar tonight. Breaking bread together for reflection and rededication, and building stronger bonds of community during Ramadan. https://t.co/b13SkdXzJn","date":"Thu Apr 14 00:22:24 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Leadership. 🇺🇸🇺🇦","date":"Wed Apr 13 21:58:01 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“A recalibration of the U.S.-Saudi partnership is long overdue.”\n\nOur full letter to Secretary Blinken ⬇️ \n\nhttps://t.co/dRwVRf4uxH https://t.co/zo7KX63HFB","date":"Wed Apr 13 19:45:06 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Louis DeJoy is purchasing a new fleet of thousands of gas-guzzling delivery vehicles — despite @POTUS’s clear and stated goal of electrifying the federal fleet.\n\nWe need to put an end to this contract, and I’ve got the bill to do it.\n\n#GreenFleetAct https://t.co/qJ1FyElpZZ","date":"Tue Apr 12 19:20:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Two days ago, 63 Republicans voted against my resolution affirming NATO’s founding democratic principles.\n\nYesterday, 6 voted against requiring State to document evidence of Russian war crimes.\n\nToday, 3 voted against revoking normal trade relations with Russia.\n\n#PutinsPuppets","date":"Fri Apr 08 01:17:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Justice Ketanji Brown Jackson.","date":"Thu Apr 07 18:03:18 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s #JusticeJackson day, folks.","date":"Thu Apr 07 13:11:37 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Pass Postal Reform ✅","date":"Thu Apr 07 12:24:29 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Outside USPS headquarters this morning to keep up the fight for a new fleet of delivery vehicles that's at least 75% electric. Postmaster DeJoy's contract for thousands of gas-guzzling vehicles cannot go forward. https://t.co/IaDwmpTyTk","date":"Wed Apr 06 14:10:23 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"My resolution is simple – it reaffirms that democratic principles are at the heart of NATO and calls for a new NATO center dedicated to the protection of democracy worldwide.\n\n63 of Putin's Puppets voted against it. https://t.co/jTOm9307OR","date":"Tue Apr 05 22:05:51 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"NEW: The House just passed a resolution I introduced with @RepMikeTurner in support of my efforts to establish a Center for Democratic Resilience within NATO. This has never been more important, as we fight to preserve democracy across the globe.\n\nhttps://t.co/hhohyVk472","date":"Tue Apr 05 20:25:12 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Here's your occasional reminder that 193 House Republicans voted against capping the cost of insulin at $35/month.","date":"Tue Apr 05 17:56:21 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Still true 👇","date":"Mon Apr 04 20:34:08 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Biden’s campaign pledge to create “millions” of jobs has hit a challenge: he created millions of jobs.","date":"Sun Apr 03 23:31:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The new fleet of Postal Service delivery vehicles needs to be at least 75% electric.","date":"Sun Apr 03 22:48:51 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Ramadan Mubarak to all those who observe the holy month! May you and your family have a wonderful #Ramadan filled with peace and many blessings.","date":"Fri Apr 01 18:46:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Here in America, someone is arrested for a minor marijuana crime every 90 seconds.\n \nI just voted for the #MOREAct to finally end the federal criminalization of marijuana and to begin repairing the harm of decades of failed drug policy.","date":"Fri Apr 01 16:40:29 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Not an April Fools’ joke, folks.\n\nThe #BidenBoom is real, sustained, and record-breaking.","date":"Fri Apr 01 13:34:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Stay safe, #VA11.","date":"Fri Apr 01 00:39:20 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"A reminder on this #TransDayofVisibility: trans people exist, and they deserve the same protections as any American. \n\nToday and every day, we honor the trans community by celebrating their joy and fighting back against discrimination. https://t.co/WiXuR8MGjK","date":"Thu Mar 31 15:47:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Tune in at 9:30!","date":"Thu Mar 31 12:24:21 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"For millions of Americans, access to insulin is a matter of life or death.\n\nNo one should pay more than $35 a month for it.","date":"Wed Mar 30 18:03:46 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Proud to stand in solidarity with SEIU Local 32BJ today at DCA. Airport workers have been on the front lines during this pandemic and we must ensure they are properly protected and cared for. https://t.co/1owa4mXirf","date":"Wed Mar 30 16:07:16 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Great to join AFGE’s District 4 &amp; 14 Congressional Breakfast. We must continue to champion federal employees, honor their public service, and uphold the promises to them as they serve the people of this country. https://t.co/t6vR7qXG1U","date":"Wed Mar 30 13:30:09 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thousands dead, maimed, and homeless. 10 million refugees. And Trump is focused on what? Getting political dirt from his friend Vlad the destroyer. \n\nAn all time new low.\n\nhttps://t.co/hlI19rpNNE","date":"Wed Mar 30 00:03:06 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Cruelty for cruelty’s sake.","date":"Mon Mar 28 18:56:51 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"5,000 dead. 160,000 trapped with no heat/power, running out of food and water. No humanitarian aid since 2/24. 90% of the city is damaged as 50-100 bombs continue to rain down per day. No safe corridors out.\n\nOf all the stains on Putin’s soul, #Mariupol is the blackest.","date":"Mon Mar 28 18:01:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":".@POTUS again makes clear that his commitment to the federal workforce is ironclad. This would be the largest pay increase for federal workers in decades, and it would be critical to our efforts to attract and retain the next generation of feds. \n\nhttps://t.co/JHhgNJxRL2","date":"Mon Mar 28 15:39:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"👀 https://t.co/2MF5th9LrP","date":"Sun Mar 27 00:55:06 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today I held a Women’s Health Roundtable discussing the barriers that women, especially women of color, face when it comes to accessing reliable care. It’s imperative that we work for equitable policy and resources to dismantle these disparities. https://t.co/gBikeseFGZ","date":"Fri Mar 25 23:35:55 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"GSA's original sin was allowing Trump to hold and benefit from his DC hotel lease. Their decision today doubles down, again abetting the Trumps' continued profiteering off of the presidency. It's a stain on federal procurement that will not wash away.\n\nhttps://t.co/8rJYqgwLKn","date":"Fri Mar 25 20:42:04 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Ketanji Brown Jackson belongs on the Supreme Court.","date":"Wed Mar 23 13:01:36 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Justice Ketanji Brown Jackson has got a pretty nice ring to it if you ask me.","date":"Fri Mar 25 13:53:22 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Though not surprising, the Taliban’s decision to backtrack on their commitment to allow girls to attend school beyond sixth grade is despicable and appalling.\n\nAccess to education is a human right. The girls and women of Afghanistan deserve so much better.","date":"Fri Mar 25 00:03:58 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I have to say it again — I’ve worked in foreign policy since the Cold War. The unity @POTUS has forged among our partners and @NATO allies in response to Russia’s monstrous invasion of Ukraine is something we’ve not seen in a very, very long time.\n\n#StandWithUkraine 🇺🇸🇺🇦","date":"Thu Mar 24 14:28:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you @NOVAcommcollege for inviting me to join your Career and Technical Education event. It is vital that we continue to invest in our community colleges as they are essential for the creation of a diverse and robust workforce. https://t.co/N7FLZfEH4K","date":"Wed Mar 23 18:05:14 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Each of these projects represents an exciting opportunity to strengthen our community and change lives in Northern Virginia for the better.\n\nI was proud to fight for them, and I can't wait to see them get going.\n\nhttps://t.co/ncqvsSrNYu","date":"Wed Mar 23 15:32:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"$2,100,000 to rehab and upgrade Old Town Hall, the premier public facility in the City of Fairfax and the cultural and social center of the community for 121 years.","date":"Wed Mar 23 15:32:47 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"$950,000 for a Community Climate Change Impact Analysis in Prince William County to prepare the county and its residents for the future impacts of climate change.","date":"Wed Mar 23 15:32:47 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"$1,500,000 for a community center at the Residences at Government Center II in Fairfax County, which will provide community services, such as childcare, a teaching kitchen, and more that benefit Virginians of low or moderate incomes.","date":"Wed Mar 23 15:32:45 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"$800,000 for the Prince William Health District Transition Initiative to help train staff of the new PWC health department on the systems, competencies, frameworks, relationships, and resources that enable public health agencies to perform core functions and essential services.","date":"Wed Mar 23 15:32:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"$1,979,000 for the Virginia Climate Center at George Mason University to save tax dollars and improve the livelihoods of Virginians by increasing resilience to severe weather, air pollution, drought and floods.","date":"Wed Mar 23 15:32:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"$1,000,000 for a Stable Families, Thriving Futures program in Fairfax County, which will focus on improving the educational, employment, and health outcomes of pregnant and parenting teens, and non-parenting young adults ages 15 to 25, in underserved communities.","date":"Wed Mar 23 15:32:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"$1,150,000 for a Learning Laboratory for Social &amp; Population Health at George Mason University, which will focus on building students' capacity to address social health and ensure access to care for marginalized communities in Fairfax County.","date":"Wed Mar 23 15:32:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"$2,000,000 for the Merrifield Crisis Response Center, a vital community-based behavioral health treatment center that provides 24/7/365 access to services.","date":"Wed Mar 23 15:32:40 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"$400,000 for an Apprenticeship Readiness Training Program in Fairfax County, which is a huge step toward ensuring good careers for local workers and sustainable economic development for the county as a whole.","date":"Wed Mar 23 15:32:39 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨 Last week, President Biden signed the FY22 government funding package into law, including $12 million in funding that I secured for some pretty amazing projects across #VA11.\n\nThread:","date":"Wed Mar 23 15:32:37 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"They fought Obergefell v. Hodges with all their might.\n\nThey’re still coming after Roe v. Wade\n\nAnd now, apparently, Republicans have a new target in Loving v. Virginia.\n\nIf they gain power, there’s no telling which constitutional right will be on the chopping block next.","date":"Wed Mar 23 14:27:01 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Ketanji Brown Jackson belongs on the Supreme Court.","date":"Wed Mar 23 13:01:36 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Incredible to hear that Fairfax County will be receiving $10M from HUD to fund projects to provide services to individuals and families experiencing homelessness. Collaboration between federal and local partners is critical to addressing this crisis.\nhttps://t.co/76x8YEgIiR","date":"Tue Mar 22 21:25:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you to the students of @WTWoodsonHS for your insightful questions about my work on Capitol Hill and how current legislation will impact our district. Our future is in good hands! https://t.co/UwgX6TmPVb","date":"Tue Mar 22 20:52:53 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Spent some time with Mayor Meyer at Old Town Hall in the City of Fairfax today! I fought for $2.1 million to rehab and upgrade Old Town Hall in the recent government funding package that @POTUS signed into law. Can’t wait to see this project get going. https://t.co/QbvTvxOOuL","date":"Tue Mar 22 18:42:19 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The horror of Mariupol is today’s Guernica.","date":"Sun Mar 20 13:20:54 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s the holiest day of the year — happy St. Patrick’s Day all! ☘️","date":"Thu Mar 17 15:22:33 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"There have been at least 11,000 incidents of anti-Asian hate since the pandemic began.\n\nIt’s as senseless as it is devastating. No more. #StopAsianHate","date":"Wed Mar 16 14:14:30 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Ukraine President Zelenskyy’s moving address to Congress will ensure more aid to Ukrainian freedom fighters. We must help them defend their country and their choice to be a free people.","date":"Wed Mar 16 13:30:08 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congratulations, Shalanda! No one is more qualified or more deserving.","date":"Tue Mar 15 20:52:20 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"On average, American women earn 83 cents for ever dollar earned by their male counterparts — and the gap is even larger for women of color.\n\nToday, on #EqualPayDay, we recommit ourselves to closing that gap for good.","date":"Tue Mar 15 15:16:58 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I joined the overwhelming majority of the House of Representatives tonight to approve $13.6 billion in security and humanitarian aid for Ukraine.\n\nThe United States Congress will always #StandWithUkraine.\n\n🇺🇸🇺🇦","date":"Thu Mar 10 04:10:52 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The health impacts of climate change are already being felt, and they are devastating.\n\nI’m proud to support smart climate actions to reduce pollution now and prepare communities for climate change-related health harms. #ClimateIsHealth","date":"Wed Mar 09 17:14:57 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Now, the work continues. I'm dropping a bill tomorrow with 68 cosponsors to put an end to DeJoy's contract for gas-guzzling delivery vehicles.\n\nhttps://t.co/FbNwM5lJzA","date":"Tue Mar 08 23:39:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"After more than a decade of hard work and negotiation, the Postal Service Reform Act is finally on its way to the president's desk.\n\nThis will #SaveThePostOffice from financial ruin, and ensure your mail is delivered for decades to come.","date":"Tue Mar 08 23:31:17 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Not even a deadly pandemic could rein in the Republican compulsion to rip health care away from tens of millions of Americans.","date":"Tue Mar 08 15:37:11 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"While we’re at it, under President Trump, the unemployment rate was about 15% in 2020.","date":"Tue Mar 08 14:05:14 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I just got back from the Poland-Ukraine border. I left feeling grateful for the $1 billion in assistance @POTUS has already provided to Ukraine, but fiercely determined to do more.\n\nThe Ukrainian people have shown the willingness to fight back. They just need the means to do so. https://t.co/ZoReJxFJbc","date":"Mon Mar 07 21:37:57 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Looking for ways to help the people of Ukraine? Learn more: https://t.co/02m7IQbq6y","date":"Sat Mar 05 19:57:22 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I'm headed to the Poland-Ukraine border with @RepGregoryMeeks and my colleagues on the @HouseForeign Affairs Committee. We'll meet with @SecBlinken, be briefed by US military officials, and assess the needs of refugees at the border. #StandWithUkraine\n\nhttps://t.co/EEMVmfeegy","date":"Sat Mar 05 00:20:15 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"https://t.co/6GCzUYgVV6","date":"Fri Mar 04 21:04:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Notorious for serving as a nexus to the money laundering operations of kleptocrats, the UAE is now set to be added to the Financial Action Task Force’s \"grey list.\"\n\nLast month @RepMalinowski and I sent a letter to @Treasury on this issue. Now, kleptocrats are being put on alert. https://t.co/T8AOPx7ykz","date":"Fri Mar 04 21:04:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I met this morning with Ukrainian MPs Yehor Cherniev &amp; Oleksandr Komiyenko, who have taken up arms in defense of their people. We all must search our souls and do all we can to protect cities &amp; civilians, increase military assistance, broaden sanctions, and #StandWithUkraine. https://t.co/6QbHkfHRRp","date":"Fri Mar 04 20:35:41 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“Job openings are near a record high. Layoffs are at an all-time low. And hiring has remained strong in the ebb and flow of…the pandemic — employers have added at least 400k jobs every month since May, the longest such streak on record.”\n\n#BidenBoom\n\nhttps://t.co/NDeSyNQoFH","date":"Fri Mar 04 13:38:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"To every LGBTQ+ kid in Texas and Florida — your President and the Democratic Congress have your back. Proudly.","date":"Fri Mar 04 01:55:18 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"A bit of good news in a dark time — @POTUS will extend Temporary Protected Status to Ukrainians living in the United States, allowing them to stay here without fear of deportation. This is absolutely the right call.\n\n#StandWithUkraine️","date":"Thu Mar 03 22:49:52 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"60 million Americans have signed forced arbitration clauses at work -- and far too many are unaware.\n \nToday, @POTUS Biden will sign into law @RepCheri’s bill to #EndForcedArbitration, voiding these agreements so survivors can have their day in court. https://t.co/vmXgSLRa4p","date":"Thu Mar 03 21:13:08 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"And here we go again. \n\nLast night, three House Republicans voted AGAINST condemning Russia’s unprovoked brutality in Ukraine and AGAINST declaring our full support for the Ukrainian people.","date":"Thu Mar 03 13:24:59 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“The Jan. 6 select committee says its evidence has shown that then-President Donald Trump and his campaign tried to illegally obstruct Congress’ counting of electoral votes and ‘engaged in a criminal conspiracy to defraud the United States.’”\n\nhttps://t.co/s77ElT4XMu","date":"Thu Mar 03 02:55:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"All of us today must be Ukrainians. All of us today must join their fight for the very freedoms and ideals upon which our own country was founded. \n\nAll of us today must #StandWithUkraine. https://t.co/x71kcjh9bj","date":"Wed Mar 02 20:11:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"President Biden has sent $1 billion in defense assistance to Ukraine and has rallied the world behind their cause.\n\nPresident Trump withheld defense assistance from Ukraine to extort them into doing him a political favor.","date":"Wed Mar 02 19:06:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"So proud to have earned a 100% from @LCVoters on their 2021 #LCVScorecard! \n\nThese are just some of the issues I'm fighting for:\n\n✅ Climate action\n✅ Environmental justice\n✅ Clean air &amp; water\n✅ A clean energy future\n✅ Public &amp; sacred lands protections https://t.co/WLdOVD16us","date":"Wed Mar 02 17:25:31 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Facts are stubborn things 🤷‍♂️","date":"Wed Mar 02 16:53:36 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"President Biden is laying out his Unity Agenda:\n\n1. Beat the opioid epidemic\n2. Take on mental health in America\n3. Support our veterans\n4. End cancer as we know it\n\nBold, badly-needed efforts we can ALL get behind. #SOTU","date":"Wed Mar 02 03:03:08 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"Tonight. I call on the Senate to: Pass the Freedom to Vote Act. Pass the John Lewis Voting Rights Act. And while you’re at it, pass the Disclose Act so Americans can know who is funding our elections.\" -@POTUS \n\nYES!","date":"Wed Mar 02 02:55:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"Our schools are open. Let’s keep it that way. Our kids need to be in school.\" #SOTU","date":"Wed Mar 02 02:50:25 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"And let’s pass the PRO Act when a majority of workers want to form a union—they shouldn’t be stopped.\"\n\n#UnionStrong","date":"Wed Mar 02 02:47:24 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"Capitalism without competition is not capitalism. \n\nCapitalism without competition is exploitation.\"\n\n- @POTUS","date":"Wed Mar 02 02:43:12 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Here's the plan @POTUS is laying out for us:\n\n1. Cut the costs of prescription drugs\n2. Cut energy costs for the average family by $500/year\n3. Cut the cost of child care\n\nLower costs, and higher standards of living. That's what it's all about. #SOTU","date":"Wed Mar 02 02:39:21 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"One way to fight inflation is to drive down wages and make Americans poorer. I have a better plan to fight inflation: \n  \nLower your costs, not your wages.\"","date":"Wed Mar 02 02:32:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"And tonight, I’m announcing that this year we will start fixing over 65,000 miles of highway and 1,500 bridges in disrepair.\"\n\nThis is HUGE, folks.","date":"Wed Mar 02 02:29:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"We’ll build a national network of 500,000 electric vehicle charging stations, begin to replace poisonous lead pipes so every child has clean water to drink at home and at school, provide affordable high-speed internet for every American.\" -@POTUS \n\n👏👏👏","date":"Wed Mar 02 02:27:33 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"President Biden oversaw the creation of 6.5 million jobs last year -- the most American jobs EVER created in a single year.","date":"Wed Mar 02 02:24:21 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"Putin may circle Kyiv with tanks, but he will never gain the hearts and souls of the Ukrainian people. He will never extinguish their love of freedom. He will never weaken the resolve of the free world.\"","date":"Wed Mar 02 02:21:09 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"I spent countless hours unifying our European allies. We shared with the world in advance what we knew Putin was planning and precisely how he would try to falsely justify his aggression.  \n \nWe countered Russia’s lies with truth.\"\n\nAmen, @POTUS.","date":"Wed Mar 02 02:14:08 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Last night – in the year 2022 – three House Republicans voted against a bill to make lynching a federal crime.","date":"Tue Mar 01 16:58:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"The Ukrainian Ambassador to the United States is here tonight. Let each of us here tonight in this Chamber send an unmistakable signal to Ukraine and to the world.\" - @POTUS \n\n#StandWithUkraine","date":"Wed Mar 02 02:12:14 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"Six days ago, Russia’s Vladimir Putin sought to shake the foundations of the free world thinking he could make it bend to his menacing ways. But he badly miscalculated.\" - @POTUS","date":"Wed Mar 02 02:10:18 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s #SOTU time! https://t.co/8lv1jiZLzg","date":"Wed Mar 02 01:05:53 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Last night – in the year 2022 – three House Republicans voted against a bill to make lynching a federal crime.","date":"Tue Mar 01 16:58:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Biden Administration is putting on a masterclass in coalition building.\n\nI have worked in foreign policy since the Cold War. The unity and resolve of NATO states, and other democracies around the world, in the face of Russian aggression is truly unlike anything I’ve seen.","date":"Mon Feb 28 13:19:10 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"President Biden has provided Ukraine with over $1 billion in defense assistance so far. \n\nHe has rallied the free world in a way we haven’t seen in many years — crippling Russia’s economy, and Putin’s own assets, with devastating and unprecedented sanctions.\n\nThank you, @POTUS.","date":"Sun Feb 27 01:56:24 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you @NOVA_Parks for hosting today’s interpretive sign unveiling of a 19th century burial site of enslaved persons. Virginia has a rich history, and though that history can be ugly at times, it is important that we learn from it to be better. Remembering all history. https://t.co/YmWJxrGE5H","date":"Sat Feb 26 20:23:45 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The American delegation, led by myself and @RepMikeTurner, is not wasting time.\n\nOur letter to @POTUS: https://t.co/4YLq3fDEHN","date":"Sat Feb 26 18:32:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Ukrainian people have already demonstrated the willingness to resist. They just require the means to do so.\n\nAs President of the NATO Parliamentary Assembly, I call on all delegations to push their governments to expand and expedite military and humanitarian aid to Ukraine. https://t.co/wcVF0WeLMR","date":"Sat Feb 26 18:19:56 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Just spoke with leadership of Ukraine’s delegation to the NATO Parliamentary Assembly, Yehor Cherniev and Solomiia Bobrovska, who have remained in Ukraine to take up arms and fight for their people.\n\nThe US Congress, and parliamentarians around the globe, #StandWithUkraine. https://t.co/W9jiuWw9wb","date":"Sat Feb 26 16:30:21 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The fundamental rightness of democracy. #StandWithUkraine https://t.co/2kEv2vhvoi","date":"Sat Feb 26 04:11:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Great to join @politicshour this afternoon to talk Ukraine, SCOTUS, and much more. \n\nListen here: \n\nhttps://t.co/Hbh8v6X5cd","date":"Fri Feb 25 22:08:02 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"#StandWithUkraine 🇺🇸🇺🇦","date":"Fri Feb 25 18:04:36 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Again, President Biden displays his commitment to an American government that looks like the American people it serves. Judge Ketanji Brown Jackson is eminently qualified — both professionally and personally — and I look forward to her history-making tenure on the Court.","date":"Fri Feb 25 15:47:01 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"With his cruelty on full display for the world to see, Vladimir Putin has solidified Russia’s status as a pariah state for years to come. \n\nHis economy will be crippled, his people will suffer needlessly, and the transatlantic alliance will only grow stronger.\n\n#StandWithUkraine","date":"Thu Feb 24 17:00:36 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I fully support the decisions the Alliance has taken to further strengthen NATO’s deterrence, defence and reassurance posture, and Allies must now prepare to reinforce this posture as the situation dictates. \n\nOur nations are ready to defend every corner of NATO territory.","date":"Thu Feb 24 12:47:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The war it has started contravenes the most basic principles underlying the international order since the end of World War II – principles which Moscow has freely signed on to. It threatens Euro-Atlantic security.","date":"Thu Feb 24 12:47:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"There is no justification for Russia’s aggression other than a desire to gain control over Ukraine and crush Ukraine’s democracy and European and Euro-Atlantic aspirations.","date":"Thu Feb 24 12:47:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Russia must immediately cease all combat and hybrid operations against Ukraine.\n \nThe world must stand united. Allies and all responsible nations and institutions must now implement the comprehensive package of massive, crippling and sustained sanctions and consequences.","date":"Thu Feb 24 12:47:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"We stand by Ukraine and the Ukrainian people in the face of this naked aggression. We will hold the Russian regime accountable for the death, suffering and crimes it commits.","date":"Thu Feb 24 12:47:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"President Vladimir Putin has decided to jump off the precipice and start a war of choice. I condemn his actions and those of his regime in the strongest terms, and reaffirm our unwavering support for Ukraine, its sovereignty, and its right to self-defense and self-determination.","date":"Thu Feb 24 12:47:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The United States, and all who believe in the fundamental rightness of democracy around the globe, are proud to #StandWithUkraine.","date":"Thu Feb 24 03:34:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is yet another willfully shortsighted decision by Postmaster General DeJoy. He has tethered USPS to a technology that is well on its way to obsolescence. I echo with renewed fervor my call for his immediate removal by the Postal Board of Governors.","date":"Thu Feb 24 00:50:34 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"@JeffWTheo Hi Jeff. Please give our District Office a call at 703-256-3071 and we’d be happy to look into this for you. -staff","date":"Wed Feb 23 18:16:46 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Russia cannot expect to launch an assault on modern democracy and still be allowed to function in the modern economy. \n\nOur sanctions must be crippling, and they must be sustained.","date":"Tue Feb 22 16:55:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Challenges at the IRS are right out of the GOP anti-government playbook: cripple an agency with budget cuts, then crucify it for the underperformance that follows.\n\nThe IRS needs fixing. That means real investments in its infrastructure and its people. \n\nhttps://t.co/YXBp3H10tK","date":"Tue Feb 22 16:03:18 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Russia occupies about a third of Donetsk and Luhansk. Putin wants to expand that occupation to the other two-thirds.\n\nThat is an invasion by any stretch of the imagination.\nhttps://t.co/VjiV0aopuE","date":"Tue Feb 22 14:50:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"We should impose some of the most consequential sanctions ever contemplated. It should be near impossible for Russia to function in the modern economy.","date":"Tue Feb 22 00:36:35 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is an invasion. It's time to react. It's time to show Putin there are severe consequences for his reckless behavior.","date":"Tue Feb 22 00:33:51 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Let’s get one thing perfectly straight — there are no “peacekeepers” in Donetsk or Luhansk. These are battle-ready Russian military units, and they are not there for peace.","date":"Mon Feb 21 23:00:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"#StandWithUkraine","date":"Mon Feb 21 20:31:58 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I met with @NATO Secretary General Stoltenberg in Brussels today to discuss the Alliance’s ongoing response to Russia’s unprovoked military buildup near Ukraine. \n\nThe transatlantic bond has never been more essential, and its strength only grows in the face of Russian aggression. https://t.co/gSU42jzgHG","date":"Mon Feb 21 15:52:40 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Putin is a tyrant and a thug. His only ally is a fellow dictator from Belarus. That's already a pretty lonely place to be. But if he starts war in Europe, he will make himself, and his beloved Russia, international pariahs for years to come.\n\n#StandWithUkraine https://t.co/S62mQVL4ca","date":"Sun Feb 20 18:29:19 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The crowd that was ok with Trump putting kids in cages wants to provide asylum for anti-vax truckers. It’s absolutely shameful and an indictment of the GOP’s values.","date":"Sat Feb 19 21:36:51 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Northern Virginia women led the charge against Donald Trump. They’ve faced much tougher opponents than our new Attorney General. \n\nThey will not take kindly to this — and nor do I. #ERANow \n\nhttps://t.co/fav5jrll6l","date":"Fri Feb 18 22:39:53 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you to @SupervisorLusk &amp; @AndreaBaileyVA for joining our Community Conversation to talk about important issues impacting the Black community. Our partnership is critical to our fight to dismantle the systemic injustice and inequity in this country. https://t.co/ymIo7WcieF","date":"Fri Feb 18 21:09:09 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The National Archives has now confirmed to our Committee that some of the documents withheld by Donald Trump contained classified information. \n\nInexcusable.","date":"Fri Feb 18 20:10:29 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨 NEW: I just introduced my bill creating a Special Inspector General for Law Enforcement to  investigate law enforcement abuse/misconduct, and to enhance protections for whistleblowers — whether they're officers or private citizens.\n\nMore: https://t.co/ORo05Ex3aw https://t.co/gYA1EJKqvh","date":"Fri Feb 18 17:52:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The financial documents Donald Trump submitted to GSA for his lease of the Old Post Office, now the Trump International Hotel in DC, were compiled by Mazars and contain similar issues to the docs Mazars now admits are totally unreliable.\n\nTerminate the lease.","date":"Thu Feb 17 17:19:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Zinke refused requests to be interviewed by the OIG despite the clear evidence.\n\nThis is a perfect example of the need for Inspectors General to have testimonial subpoena authority, as they would under our IG Independence and Empowerment Act.","date":"Wed Feb 16 18:09:56 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Donald Trump withheld or destroyed documents he was required by law to hand over to the archivists. That is a criminal act and it ought to be prosecuted as such. \nhttps://t.co/dxzZ7yGPy8","date":"Wed Feb 16 15:07:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"NEW: The Interior Department IG found that Trump’s Interior Secretary, Ryan Zinke, misused his official position, violated ethics standards, and provided officials with false information to cover it up.\n\nDrain the swamp, am I right? https://t.co/gACZr9YvaY","date":"Wed Feb 16 18:09:56 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Donald Trump withheld or destroyed documents he was required by law to hand over to the archivists. That is a criminal act and it ought to be prosecuted as such. \nhttps://t.co/dxzZ7yGPy8","date":"Wed Feb 16 15:07:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you Supervisor @DanStorck for having me at the 35th Annual Mt. Vernon Town Hall this morning. The federal funding we’ve provided the past few years is continuing to pay off locally in our backyards. Lets continue to come together to invest in the future of our communities. https://t.co/0pVZSBFjFE","date":"Sat Feb 12 16:07:22 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Together with its massive and unjustified military build-up, the reckless exercises Russia begins today can only be seen as an attempt to intimidate Ukraine and, by extension, all of @NATO. \n\nIf Russia is serious about diplomacy, it must deescalate.\n\n#StandWithUkraine","date":"Thu Feb 10 17:54:33 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Equal Rights Amendment has met every constitutional criteria for ratification. \n\nNo more excuses. No more delay. American women have waited long enough for true constitutional equality. #ERAnow","date":"Thu Feb 10 17:42:11 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Had a great meeting with the Superintendents, School Board Chairs, &amp; administrative staff from both Fairfax &amp; Prince William County. Discussed the long term investments &amp; safety procedures they made in schools from federal dollars. We trust local government to run our schools. https://t.co/NIDUJWzSIr","date":"Thu Feb 10 16:57:12 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The #AmericaCOMPETES Act ensures critical tech is produced here in the US, making us less reliant on Chinese products and easing inflation caused by clogged up international supply chains.\n\nDespite their tough talk on China and inflation, only one Republican voted for it.","date":"Thu Feb 10 15:48:46 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you for joining us today, @LeaderHoyer. You're absolutely right -- safety and reliability are paramount to restoring a culture of excellence at Metro.","date":"Wed Feb 09 17:50:40 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"As of today, all Afghan refugees who were housed on military bases in Virginia have been safely &amp; successfully resettled across our county. We are happy to have you all here apart of our society. And thank you to the tireless efforts of our resettlement partners such as @LSS_NCA!","date":"Tue Feb 08 23:51:08 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today, after years of hard work and negotiation, the House will vote on the Postal Reform Act.\n\nToday, we'll vote to return USPS to solvency and to remove undue burdens that have mired it in 16 years of financial distress. \n\nToday, we'll vote to #SaveThePostOffice.","date":"Tue Feb 08 16:42:05 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Survivors of sexual abuse shouldn't be silenced by some fine print buried in a lengthy contract.\n\nIt's time to put the power in the hands of the survivor. Tonight, I'm voting to #EndForcedArbitration. https://t.co/qjy4U4mk63","date":"Mon Feb 07 23:43:00 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I won’t hold my breath waiting for FBI press conferences and nonstop coverage of the national security implications of this. \n\nI mean it’s not like he used the wrong email address.","date":"Mon Feb 07 15:14:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Release the report, @NFL. https://t.co/hWoS9FbsLB","date":"Sun Feb 06 01:05:21 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Always great addressing the annual @fairfaxcounty Model Judiciary program &amp; having students actively learn about our justice system. The justice system is a work in progress, but I’m confident that many of the students today will be part of shaping a true &amp; fair system for all. https://t.co/bW1xE0aIQR","date":"Sat Feb 05 15:46:04 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“Legitimate political discourse.” https://t.co/G1b7HQuNeN","date":"Sat Feb 05 01:20:11 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I was going to explain this in a thread, but you know what they say — a picture is worth 6.6 million new jobs: https://t.co/DLgfNy0x34","date":"Fri Feb 04 20:03:18 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"If Dan Snyder's culture of harassment and exploitation is swept under the rug, the new team name is nothing more than lipstick on a pig.\n\nCheck out @SportsCenter's coverage of yesterday's @OversightDems roundtable with victim's of Mr. Snyder's impunity: https://t.co/ef8nWxsYyp","date":"Fri Feb 04 15:01:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Say it with me — #BidenBoom!","date":"Fri Feb 04 13:36:04 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you, Melanie, for the incredible courage you all showed us today. You deserve justice, and we’re not stopping until you get it. #ReleaseTheReport","date":"Thu Feb 03 23:42:50 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"There are real victims of Dan Snyder's culture of harassment and exploitation. Today we heard their stories.\n\nYesterday's name change is just lipstick on a pig if Mr. Snyder continues to evade accountability. #ReleaseTheReport https://t.co/uPZ9BjQYm2","date":"Thu Feb 03 18:06:53 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"#ReleaseTheReport!","date":"Thu Feb 03 17:05:46 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Louis DeJoy plans to spend billions on gas-powered vehicles despite clear goals set by @POTUS and Congress to electrify the federal fleet.\n\nI want a full examination of this contract, and I am pursuing a legislative remedy. But DeJoy has to go right now.\n\nhttps://t.co/86QgDucqwZ https://t.co/1KgknfLdyz","date":"Thu Feb 03 01:11:23 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"@SenatorLujan Wishing you a full and speedy recovery, my friend.","date":"Tue Feb 01 22:41:21 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"One year after the military coup in #Burma, I stand by the courageous protestors, journalists, and activists in their pursuit of peace and democracy. We must work with our allies to support will of the people and promote accountability for violations of human rights.","date":"Tue Feb 01 22:01:31 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Since the Columbine school shooting, over 292,000 students have been affected by gun violence at their schools.\n\nRT if you’re ready to save lives and end gun violence. \n\n#GVSurvivorsWeek","date":"Tue Feb 01 21:10:39 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Black history is American history, and it belongs in American classrooms. Full stop.\n\n#BlackHistoryMonth","date":"Tue Feb 01 20:53:07 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy #LunarNewYear! I wish everyone a prosperous and healthy Year of the Tiger! https://t.co/FdJJN5W5tG","date":"Tue Feb 01 18:51:23 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"In 2021, we had the fastest economic growth in nearly four decades and the greatest year of job growth in American history. Layoffs are near record lows and unemployment is down to 3.9%.\n\nNone of that happened by accident. It happened by action. #BidenBoom","date":"Tue Feb 01 15:26:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans requested this report because they thought it would back up their inflation hysteria. Instead, it blows up their talking points entirely. \n\nPaychecks are increasing *faster* than prices, which means more bang for the American buck.\n\n#BidenBoom","date":"Tue Feb 01 15:15:18 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thousands of Americans are sitting in jail for low-level, non-violent drug offenses, and who does Donald Trump want to pardon? Insurrectionists who launched a violent attack against the United States government, of course.","date":"Mon Jan 31 15:03:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This isn’t just about pardoning those involved with January 6. This is about pardoning those involved with his next insurrection. \n\nIt’s a thinly veiled signal to his supporters: we’re going again, and this time I’ll have your back when it’s over.","date":"Sun Jan 30 19:44:52 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The list is long, I know, but this is one of the most insane things Donald Trump has said in a while. And it will be met with silence *at best* from Republicans in Congress. The worst of them will endorse it loudly and enthusiastically.\n\nOur democracy is on very thin ice.","date":"Sun Jan 30 19:39:01 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The new cat is adorable, @POTUS, but I’m worried everyone has forgotten the true star of the political pet world:\n\nEveryone say hi to Abigail (Abby) Adams, the most patriotic pup in politics. https://t.co/rFSphGJqs8","date":"Sat Jan 29 00:26:20 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Finding the right talent to make government work demands cooperation and sharing of knowledge across the public and private sectors.  This recent watchdog report shows government must do better at tracking how it incorporates the service of experts.\n\nhttps://t.co/qoVfV6nmt2","date":"Fri Jan 28 15:10:01 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Reminder that every single Republican voted against sending you that final stimulus check.","date":"Fri Jan 28 00:42:55 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Glad to attend today’s groundbreaking for an historic new affordable housing community in Fairfax County. Affordable housing is vital in the pursuit of economic success and opportunity. This will continue being a priority for me as it was during my days in local government. https://t.co/65nSUPqKYQ","date":"Thu Jan 27 21:34:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Dan Snyder has overseen a toxic culture driven by a maximum profit mentality above all else. \n\n@OversightDems will not relent in our push for justice and accountability.","date":"Thu Jan 27 17:26:28 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Our nation is at an inflection point, and the federal government must meet the moment. Government must work to shift the Great Resignation into a bold recruitment and retention effort.\n\nRead my new @CNN OpEd ⤵️\n\nhttps://t.co/UncQOd3LGv","date":"Thu Jan 27 17:03:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"77 years ago today, the Allies liberated the Nazi death camp Auschwitz, where 1.5 million were killed. \n\nI visited Auschwitz several years ago. The horror always lingers. We must never forget. #HolocaustMemorialDay","date":"Thu Jan 27 15:20:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The fastest rate since Reagan.","date":"Thu Jan 27 13:41:23 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today in #BidenBoom news:\n\nU.S. economy grew 5.7 percent in 2021, the fastest full-year clip since 1984. https://t.co/GtiTfWdB19","date":"Thu Jan 27 13:36:11 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you, President Biden for continuing to demonstrate that IT is the pith of delivering on policy. #ITModCaucus #FISMA #FedRAMP","date":"Wed Jan 26 21:19:39 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Ensuring that families and businesses get the services they need and that their sensitive information is protected requires modern federal IT infrastructure that is accessible, nimble, and secure. Today’s OMB guidance on zero trust architecture is a catalyst toward these goals.","date":"Wed Jan 26 21:19:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Government must take pro-active cybersecurity measures to drive progress on secure, federal IT modernization. FISMA reform, FITARA oversight, and cloud adoption are critical to these efforts. #FISMA #FedRAMP #ITModCaucus","date":"Tue Jan 25 18:24:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you to @GeorgeMasonU for having me join your Small and Minority-Owned Business Town Hall today! The Biden Infrastructure Law is a major investment in Northern Virginia and is critical to helping our small businesses with direct and equitable resources. https://t.co/UwA43MsGX1","date":"Mon Jan 24 19:47:14 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joined First Baptist Church of Vienna this morning for their Martin Luther King celebration service. Honoring his work and remembering the moral clarity he fought for. His work is more important now than ever, let us continue to carry on his legacy. https://t.co/rQXxmWuqJv","date":"Sun Jan 23 17:42:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Apparently a Republican colleague of mine tweeted and deleted today how proud he was to help secure infrastructure funding for the Port of Virginia.\n\nGlad he did the right thing by taking it down. Voting no but taking the dough would have been a pretty bad look if you ask me.","date":"Fri Jan 21 19:12:12 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This opinion is laughable on its face. It’s as devoid of common sense as it is legal standing, and it will not be upheld. \n\nWhy on earth would the federal government not be able to set standards for its own employees?","date":"Fri Jan 21 18:01:41 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The pandemic has demonstrated that to generate the necessary resilience against future crises effectively, governments at all levels must fully embrace cutting-edge technology. Proud to launch the #ITModernization Caucus with @DarrellIssa\n\nhttps://t.co/Iez8HkpXpr","date":"Thu Jan 20 19:44:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"When @POTUS took office one year ago, almost no one had been vaccinated. Now, 210 million Americans have been.\n\nUnemployment was at 6.4%. Now, it’s at 3.9%.\n\nMore then half the schools in America were closed. Now 96% are open.","date":"Thu Jan 20 18:55:50 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Tune in at 9!","date":"Thu Jan 20 13:35:16 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"On Monday, Republican Senators gushed over the legacy of Martin Luther King, Jr.\n\nOn Wednesday, they all voted to rip it to shreds.","date":"Thu Jan 20 12:19:14 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"If you're unvaccinated, you are 17x more likely to be hospitalized and 20x more likely to die from COVID than someone who's been vaxxed and boosted.\n\nThis isn't a game. If you've been hesitant, please don't wait any longer.\n\nhttps://t.co/azyWiw1eV9","date":"Wed Jan 19 17:44:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨😷 @POTUS is sending 400 million N95 masks from the Strategic National Stockpile to tens of thousands of locations for you to pick up for FREE.\n\nThis is the single largest deployment of personal protective equipment in U.S. history.\n\nhttps://t.co/fKKgx7Nolz","date":"Wed Jan 19 15:09:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The situation in Ukraine is fraught enough without right-wing agitators spewing Russian propaganda into millions of American homes. This is reprehensible, even for Fox “News.”","date":"Wed Jan 19 14:50:08 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨 @POTUS is moving quick, folks! Free at-home COVID tests are available to order NOW at https://t.co/GnMPeIrVjn.","date":"Tue Jan 18 17:41:11 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The last Voting Rights Act reauthorization was passed by a Republican House, then 98-0 by a Republican Senate, and then signed into law by a Republican president.\n\nThat was 2006.\n\n15 years later, the GOP’s abandonment of our bedrock democratic principles is just about complete.","date":"Tue Jan 18 17:14:35 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“The tragedy is that we have a Congress with a Senate that has a minority of misguided senators who will use the filibuster to keep the majority of people from even voting.”\n\n— Martin Luther King, Jr. 1963.","date":"Tue Jan 18 00:27:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Dear Governor Youngkin, \n \nThat record $16 billion surplus you inherited and the “state” funding for schools is, in large part, because Democrats in Congress passed the American Rescue Plan. NoVa students shouldn’t be held hostage for your culture war.","date":"Mon Jan 17 21:26:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“Change does not roll in on the wheels of inevitability, but comes through continuous struggle.”\n\nThere have been enough empty words. Today, we dedicate ourselves to honoring Dr. King’s legacy with action. https://t.co/bYQB8TaVEz","date":"Mon Jan 17 16:07:32 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨At-home COVID tests will be available to order on January 19! They’re 100% free and USPS will ship them to your home at no cost — you don’t even have to enter a credit card number.\n\nBookmark https://t.co/GnMPeIrVjn to place an order on Wednesday!","date":"Fri Jan 14 20:34:06 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Don’t forget tomorrow when House Republicans quote Dr. King that every single one of them voted against the John Lewis Voting Rights Act on Thursday. Actions matter and they are the Party of George Wallace and Bull Connor.","date":"Mon Jan 17 00:19:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"My heart is with Congregation Beth Israel and first responders in Colleyville, TX. Praying for peace to prevail.","date":"Sat Jan 15 23:13:50 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joining the Prince William County Human Rights Commission for their annual human rights ceremony this morning. Congratulations to the honorees of this year’s award and their commitment to justice and equality. https://t.co/JD8Vvm2Zca","date":"Sat Jan 15 15:09:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨At-home COVID tests will be available to order on January 19! They’re 100% free and USPS will ship them to your home at no cost — you don’t even have to enter a credit card number.\n\nBookmark https://t.co/GnMPeIrVjn to place an order on Wednesday!","date":"Fri Jan 14 20:34:06 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The IRS has got to get these backlogs cleared before tax season ramps up this year. @RepKatiePorter and I are fighting hard to make it happen. \n\nhttps://t.co/oOgI6enNUn","date":"Fri Jan 14 17:48:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Right now, Virginia is home to 577 bridges in desperate need of repair. \n\nThanks to @POTUS and the Bipartisan Infrastructure Law, we’ll now have over $100 million to fix them this year — with hundreds of millions more to come.\n\nhttps://t.co/jatsi9E7Jg","date":"Fri Jan 14 17:30:23 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Our voting rights legislation sets basic regulations for elections in America. Republicans are calling it a “federal takeover of elections.”  \n\nThe federal government also regulates toothpaste. I don’t think there’s ever been a federal takeover of toothpaste.","date":"Fri Jan 14 01:56:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"A carveout to the filibuster implemented unilaterally by...wait for it...Senate Republicans.","date":"Thu Jan 13 19:57:49 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"se·​di·​tion (si-ˈdi-shən) 𝘯𝘰𝘶𝘯\n1. Incitement of resistance to or insurrection against lawful authority.","date":"Thu Jan 13 19:31:52 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I'll say it again: \n\nThe filibuster cannot foster unity or bipartisanship when it's used to cheat Americans out of their right to participate freely in our democratic system.","date":"Thu Jan 13 17:40:57 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Not a single Republican in favor of protecting your right to vote. \n\nThe party of Lincoln is no more. This is the party of George Wallace and Bull Connor. https://t.co/rsIErJjy0x","date":"Thu Jan 13 16:42:36 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"We have no higher duty than protecting the right of every American to participate in free and fair elections. https://t.co/UwLmpc3jSg","date":"Thu Jan 13 16:05:33 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"No Senate tradition is more important, or more worth protecting, than your right to vote.","date":"Thu Jan 13 14:08:48 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congratulations to my friend (and former staffer!), @BrianaSewellVA, on her swearing in to the House of Delegates today! I can't wait to see all you accomplish.","date":"Thu Jan 13 00:27:17 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Wordle 207 4/6\n\n⬜️⬜️🟨🟩⬜️\n⬜️🟩⬜️🟩🟩\n🅴🅽🅳 🆃🅷🅴 🅵🅸🅻🅸🅱🆄🆂🆃🅴🆁\n⬜️🟩⬜️🟩🟩\n🟩🟩🟩🟩🟩","date":"Wed Jan 12 15:41:45 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Yes, the filibuster has historically been used to block civil rights legislation.\n\nYes, Republicans have created their own carve-outs to the filibuster — and it wasn’t even that long ago.\n\nYes, it’s time to #EndTheFilibuster.","date":"Wed Jan 12 15:14:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Just so we’re all on the same page:\n\nNo, the filibuster is not in the Constitution.\n\nNo, the filibuster has not existed since the creation of the Senate.\n\nNo, the filibuster does not foster bipartisanship when it’s abused to cheat our democratic system.","date":"Wed Jan 12 15:09:24 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I worked for Joe Biden when he chaired the Senate Foreign Relations Committee. Believe me when I say this:\n\nHis love for the Senate and his commitment to its founding purpose are unparalleled in DC. \n\nHe supports changes to the filibuster not in spite of this — but because of it.","date":"Tue Jan 11 21:44:58 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is tremendous news. In, VA-11 we know the danger that coal ash poses to communities. \n\nThe Biden administration's actions today will undo the damage done by Andrew Wheeler and put public health and clean water before the profits of polluters.\n \nhttps://t.co/x3TrxHlCsn","date":"Tue Jan 11 17:33:33 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The House has chosen #VotingRights. @POTUS has chosen #VotingRights.\n\nThe Senate has a choice to make:\n\nEnsure lasting American democracy, or sacrifice the right to vote at the altar of the filibuster.","date":"Tue Jan 11 14:01:29 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I know we’re all tired, but now is not the time to give up. \n\nDoctors and nurses are fighting day and night to save our lives. Step up and do your part. Get vaccinated and boosted if you haven’t, and make sure your eligible loved ones have done the same.","date":"Mon Jan 10 18:28:17 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I just checked and the weather this week is just PERFECT for ending the filibuster and protecting the right to vote.","date":"Mon Jan 10 14:28:52 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Caught up with @adamlongoTV this week to talk my experience on January 6th and how we, as a country, can begin to heal. Take a look: \n\nhttps://t.co/XUIdq7IqZ9","date":"Fri Jan 07 20:44:04 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It's not just the Biden recovery. It's the #BidenBoom. https://t.co/l0ve8ezBzT","date":"Fri Jan 07 20:04:32 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Great meeting with @Cornerstonesva this afternoon on legislative priorities and the need for investment in our communities. The Biden Infrastructure law will do just that with strong investments in broadband, childcare, climate change, and much more. https://t.co/NQ4oZDm3Op","date":"Fri Jan 07 19:52:29 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"The U.S. created more jobs during Joe Biden's first year in office than during the last four Republican administrations *combined.*\n\n#BidenBoom","date":"Fri Jan 07 17:36:43 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"January 6, 2021. 2:39 pm.","date":"Thu Jan 06 19:39:00 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Future generations are dependent on us all meeting this moment. We must not fail or flinch.","date":"Thu Jan 06 18:40:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"One year ago democracy prevailed over a violent attempted overthrow of an American election. The meaning of todays remembrance is that we must sustain that victory by refreshing our fidelity to that democracy and ferreting out all extremist threats to it.","date":"Thu Jan 06 18:40:27 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I want to share the message I sent to my constituents in the days following the insurrection at the Capitol. One year later, I fear it has lost no relevance. https://t.co/8RP5RN4U7y","date":"Thu Jan 06 15:56:54 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Remember my Republican colleague who called the insurrection a “normal tourist visit?”\n\nHere he is on the left — in the House chamber on January 6. \n\nThey know the truth. https://t.co/CxFVVusMTO","date":"Thu Jan 06 13:38:15 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Three big developments for Democrats: redistricting is a wash, the GOP generic congressional vote advantage evaporated, and the economic news keeps getting better. \n\nBe forewarned, pundits. Nothing is inevitable — especially the House majority.","date":"Wed Jan 05 21:34:36 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"When Andrew Wheeler rolled back federal coal ash standards, he forced thousands of Virginians to live under the threat of toxic spills from nearby coal ash ponds.\n\nGlenn Youngkin could not have made a worse choice for VA’s Secretary of Natural Resources.\n\nhttps://t.co/x3TrxHmahV","date":"Wed Jan 05 20:15:53 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Companies like @Maxar in Herndon are vital to our national security and our local economy. I had a great town hall meeting with their team today, and got the chance to discuss the countless ways the Bipartisan Infrastructure Law will benefit American businesses and workers. https://t.co/OkLXXyhFw8","date":"Wed Jan 05 19:42:42 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Say it with me: #BidenBoom","date":"Wed Jan 05 15:10:13 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Make no mistake — the Jan. 6 insurrection and the Republican crusade against voting rights are inextricably linked.\n\nThe rot of authoritarianism has already consumed every corner of the Republican Party. If they are in power, it threatens to swallow the country whole.","date":"Wed Jan 05 14:54:46 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"I still feel the emotions of January 6 like it was yesterday. Anger, yes — but determination most of all.\n\nDonald Trump, Congressional Republicans, and the mob they incited did not succeed in their insurrection that day. \n\nAnd they never will.","date":"Wed Jan 05 14:02:06 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“Gerry Connolly was defiant, waiting on the House floor as a mob pounded on the door outside the chamber. The Democratic congressman from Virginia’s 11th District would be among the last to evacuate.”\n\nhttps://t.co/jPfnvalcCC","date":"Wed Jan 05 13:51:08 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"My office is closely monitoring the situation on I-95. If you need assistance on the road, you can call @VaDOT at 1-800-FOR-ROAD. As always, call 911 in an emergency. \n\nStay off the roads as much as possible today!","date":"Tue Jan 04 17:21:47 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Fairfax mourns the loss of Rufus Phillips III. A distinguished former County Board member and Vietnam operative, Phillips spoke truth to power—always striving to make things better. I knew Rufus and his late beloved wife, Barbara, and will miss their company and insights.","date":"Tue Jan 04 16:47:32 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"We’ve been given gas masks on the House floor. Tear gas has been used in the Rotunda.","date":"Wed Jan 06 19:39:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Jobs created during Donald Trump’s first year in office: 2.1 million.\n\nJobs created during Joe Biden’s first year in office: 6 million.\n\n#BidenBoom","date":"Tue Jan 04 15:23:44 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"@CBSNewsPress @MacFarlaneNews Congratulations, Scott!","date":"Tue Jan 04 15:18:18 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Good.","date":"Mon Jan 03 15:51:17 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"January 6 was, by definition, an insurrection. House Republicans took the side of its participants — by definition, insurrectionists.\n\nWith blood still on the floors, they voted as the mob demanded. And they’ve given every indication they‘ll jump at the chance to do it again.","date":"Mon Jan 03 14:08:18 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Wow, Christmas really came early this year.","date":"Sun Jan 02 18:59:28 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Heads up, #VA11! ☃️","date":"Sun Jan 02 18:54:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"“U.S. employers added a record number of jobs in 2021, as a gauge of layoffs fell to a half-century low.”\n\n#BidenBoom \n\nhttps://t.co/BuhC3t9zjf","date":"Sat Jan 01 14:29:38 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy New Year! 🎉","date":"Sat Jan 01 05:00:02 +0000 2022","user_id":"78445977"},{"handle":"GerryConnolly","text":"It's been a busy year in #VA11! Check out my 2021 Year-End Report for more on what my team and I have been up to over the last year:\n\nhttps://t.co/x0hY3mvqyJ https://t.co/8B18padWqY","date":"Fri Dec 31 17:54:01 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"GDP growth during Donald Trump’s final year in office: -3.5%.\n\nGDP growth during Joe Biden’s first year in office: +5.5%\n\n#BidenBoom","date":"Fri Dec 31 13:55:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is welcome news, and I applaud @POTUS and his Administration for making this move. But the mayor of DC should have this authority.\n\nCongress could have made this change in the recent NDAA. We should have done it then. I’ll keep pushing until we do.","date":"Thu Dec 30 22:38:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Reminder that since we passed the #AmericanRescuePlan, 6 million jobs have been created and unemployment has dropped to 4.2% — years ahead of schedule.","date":"Tue Dec 28 18:13:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Wishing a happy first day of #Kwanzaa to all who celebrate!","date":"Sun Dec 26 14:58:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Wishing a very Merry Christmas to all celebrating in #VA11 and around the world! https://t.co/wlqPkW1fBN","date":"Sat Dec 25 12:57:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"For a decade, we’ve fought off one Republican attack on the Affordable Care Act after another. \n\nThis is why.\n\nToday, the ACA is covering more Americans than ever before—including 4.6 million new enrollees just this year.","date":"Wed Dec 22 19:05:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Let’s go forward confident and full of hope. Let’s make hope and history rhyme.","date":"Tue Dec 21 20:43:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We are holding insurrectionists accountable, we have vaccinated two thirds of Americans, and we have returned civility to the White House.","date":"Tue Dec 21 20:43:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"More to be done for sure. \n\nBut our agenda stands in sharp contrast to the conspiracy-enabling, anti-vax, Democracy-suppressing, vigilante anti-choice zealots and economic reactionaries who’ve turned the party of Lincoln into a death cult.","date":"Tue Dec 21 20:43:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We passed a huge Covid-relief bill in March and a transformative infrastructure bill this fall. \n\nUnemployment has plummeted to 4.2% years ahead of schedule and GDP is growing at a very high rate.","date":"Tue Dec 21 20:43:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I’m so tired of the dark and gloomy prognostications for Democrats. \n\nThread:","date":"Tue Dec 21 20:43:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is why I've been pushing so hard for investments in federal IT. These free at-home tests are a great move by President Biden, but it won't matter if our constituents can't get their hands on them.\n\nWe've got to get the IT right👇\n\nhttps://t.co/CaoUXibg1o","date":"Tue Dec 21 19:54:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"There is no world in which the filibuster should be guarded more fiercely than the right to vote.","date":"Tue Dec 21 15:20:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"My Capitol Hill and District offices are closed today for our annual staff retreat. If you need assistance, please leave us a voicemail or send us an email through my website and a member of my staff will be in touch soon.\n\nhttps://t.co/QcYnGMcn1O","date":"Mon Dec 20 14:36:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This winter will be difficult for all of us, but it will be deadly for the unvaccinated. \n\nIf you haven’t yet, go get your vaccine or booster. Please don’t wait.\n\nhttps://t.co/azyWiw1eV9","date":"Sat Dec 18 22:03:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨🚨🚨 Huge upgrades are coming to DC area airports thanks to the Bipartisan Infrastructure Law. \n\nNext year, Dulles will have $22,844,908 and National will have $22,144,350 to modernize and improve your travel experiences.\n\n(Thanks, @POTUS!)","date":"Fri Dec 17 15:33:41 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"You won’t want to miss this one, #WashingtonFootball fans. Tune in at 6:30!","date":"Wed Dec 15 22:33:40 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Our Child Tax Credit expansion was implemented this year, and already child poverty has plummeted by 40%.\n\nIt works, it’s popular, and it should be permanent.","date":"Wed Dec 15 20:29:04 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Parents, check your bank accounts! Thanks to Democrats and @POTUS, your monthly Child Tax Credit payment will hit today — just in time for the holidays.","date":"Wed Dec 15 17:16:40 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Chase Kowalski, 7\nJesse Lewis, 6\nJames Mattioli, 6\nGrace McDonnell, 7\nEmilie Parker, 6\nJack Pinto, 6\nNoah Pozner, 6\nCaroline Previdi, 6\nJessica Rekos, 6\nAvielle Richman, 6\nBenjamin Wheeler, 6\nAllison Wyatt, 6\n\nNine years later, we remember #SandyHook.","date":"Tue Dec 14 14:41:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Mary Sherlach, 56\nVictoria Soto, 27\nAnne Marie Murphy, 52\nLauren Rousseau, 30\nDawn Hochsprung, 47\nRachel Davino, 29\nCharlotte Bacon, 6\nOlivia Engel, 6\nJosephine Gay, 7\nAna Marquez-Greene, 6\nDylan Hockley, 6\nMadeleine Hsu, 6\nDaniel Barden, 6\nCatherine Hubbard, 6","date":"Tue Dec 14 14:41:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"My 37th Telephone Town Hall starts in 15 minutes! Join us by calling 855-710-6225. https://t.co/UFYHGRHckd","date":"Tue Dec 14 00:45:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Text \"VA11\" to 833-898-5483 to register for my Telephone Town Hall TOMORROW at 8:00pm!\n\nYou can ask your questions live, or submit them here in advance: \n\nhttps://t.co/SXALFvpUcT","date":"Sun Dec 12 19:51:08 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"If we make violence a normal part of the political environment, as a certain former President would have us do, it will end democracy as we know it. \n https://t.co/t1wUWF66Em","date":"Sat Dec 11 23:45:51 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As President Trump packed the Supreme Court with one ideological zealot after another, we warned of their intention to overturn Roe v. Wade. People called us hysterical — no Court would ever overturn 50 years of precedent.\n\nI wonder if they’d say the same today. #SB8 #Texas","date":"Fri Dec 10 21:59:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joining @WRAP_org for their 24th annual Law Enforcement Excellence awards and kicking off their holiday #SoberRide campaign. Thank you for all the work you do every day to prevent drunk driving and save lives. https://t.co/ndnlUV9xXw","date":"Fri Dec 10 14:17:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Pass the #ProtectingOurDemocracy Act: ✅","date":"Thu Dec 09 21:12:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thanks @kristin__wilson. Advice to my good friend @RepAnthonyBrown  - stay true to yourself and don't let the haters get you down.","date":"Thu Dec 09 21:03:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Voter suppression is rampant in Republican-controlled states all over America. They want to make it harder for you to vote because that's how they win elections, apparently. \n\nThe #ProtectingOurDemocracy Act will help to shield your sacred vote from their subterfuge. https://t.co/Z0SG9sj66t","date":"Thu Dec 09 18:47:37 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The #ProtectingOurDemocracy Act will:\n\n✔️ Root out corruption.\n✔️ Rein in presidential abuses of power.\n✔️ Strengthen our system of checks and balances.\n\nBecause democracy is worth fighting for.","date":"Thu Dec 09 17:53:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"“Based on the data, President Biden and the Democratic Congress are set to preside over the strongest two-year performance on growth, jobs, and income in decades.”\n\n#BidenBoom\n\nhttps://t.co/7hLXNXsEj6","date":"Thu Dec 09 17:35:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Soon, the House will vote on the Protecting Our Democracy Act, legislation that @RepAdamSchiff and I wrote with several of our colleagues.\n\nDonald Trump took a sledgehammer to the very foundations of our democracy. Today, we clean up the rubble and repair the damage.","date":"Thu Dec 09 16:46:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Text \"VA11\" to 833-898-5483 to register for my Telephone Town Hall on December 13 at 8:00pm!\n\nYou can ask your questions live, or submit them here in advance: https://t.co/caY04Oszqm https://t.co/wgQQqtqICr","date":"Thu Dec 09 16:41:41 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joined the Dulles Area Transportation Association this afternoon and discussed the importance of the Infrastructure Bill which Congress passed, and the overdue long term investments we need in our region. https://t.co/8a4nU3br7S","date":"Wed Dec 08 21:42:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The NDAA before us today falls far short of the House-passed version that I was proud to support. \n\nWe are a co-equal branch of government. It’s time we act like it. I will vote against the NDAA tonight. \n\nMy full statement: https://t.co/m9hAMtaG3i","date":"Wed Dec 08 01:20:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Appreciated the chance to meet with Governor-elect Youngkin this afternoon for a discussion on ways we can try to work together to better our Commonwealth. https://t.co/zEjqJij34U","date":"Tue Dec 07 23:19:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"There’s a lot going on in Congress right now, and I want to keep you up to date. Join me for a telephone town hall on December 13 at 8pm!\n\nText “VA11” to  833-898-5483 to register. https://t.co/8TF3IeBzP0","date":"Tue Dec 07 19:00:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🎶 All I want for Christmas is reinstatement of the 1994 assault weapons ban 🎶🎄","date":"Tue Dec 07 16:42:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Keep it up, Virginia!","date":"Tue Dec 07 15:07:20 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"You read that correctly — $35 a month.","date":"Tue Dec 07 02:36:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The nation lost a lion today with the unexpected death of @WashingtonPost editor Fred Hiatt. All who cherish the fulsome advocacy of truth and freedom join with his WaPo family in mourning his untimely loss.","date":"Mon Dec 06 19:18:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"And just hours after this bomb was planted, most House Republicans sided with the insurrectionists and voted to overturn the election.","date":"Mon Dec 06 18:43:19 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"American students are not traumatized by accurate, fact-based history classes. They are not traumatized by masks and a single additional vaccine requirement. \n\nThey are traumatized by the looming threat of massacre in their schools. \n\nWe have got to get our priorities straight.","date":"Sat Dec 04 17:47:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"When @POTUS took office, more than half of the schools in America were closed. \n\nToday, more than 99% of them are open.","date":"Fri Dec 03 22:09:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Dan Snyder and the NFL allowed a toxic, misogynistic culture to fester within the Washington Football Team for years, and Mr. Snyder’s punishment was a slap on the wrist. \n\nThese victims deserve justice, and @OversightDems will pursue it.\n\nhttps://t.co/Yf4bnHifSk","date":"Fri Dec 03 16:14:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I can find a live stream from the International Space Station online, but American women can’t see their reproductive freedoms argued before #SCOTUS. \n\nIt’s long past time for cameras in the Court.\n\nhttps://t.co/HNdWz9Wupp","date":"Fri Dec 03 04:01:56 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"If only Republicans loved helping working parents like they love shutting down the government.","date":"Thu Dec 02 21:59:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Grateful for your support, @RepMaloney. Let's get it done!","date":"Thu Dec 02 15:36:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As Chairman of @FairfaxCounty, I led the push to extend the Silver Line to Dulles. Now, we're another big step closer to realizing that goal.\n\nThis, plus funding we'll receive from the Bipartisan  Infrastructure Law, will bolster NoVa transit for decades.\n\nhttps://t.co/ITNrTQL5Ek","date":"Thu Dec 02 15:15:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The House has passed the Women’s Health Protection Act, which does just that. \n\nThe Senate must now follow suit. Quickly.","date":"Thu Dec 02 13:35:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"If it wasn’t clear already, yesterday’s arguments before the Supreme Court removed all doubt.\n\nWe need to codify Roe v. Wade into federal law.\n\n#AbortionIsEssential","date":"Thu Dec 02 13:27:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The US has been a leader in the global fight against HIV/AIDS, but AIDS remains a global crisis.\n\nThis #WorldAIDSDay we should celebrate the successes we have made, and remember there is still work to be done. We must commit to ending AIDS for good. https://t.co/Xg48PvoAwi","date":"Thu Dec 02 01:29:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As @POTUS said, the Omicron variant is cause for concern but not for panic.\n\nFor the best protection available, please get your booster shot as soon as you're eligible.\n\nhttps://t.co/azyWiw1eV9","date":"Wed Dec 01 19:19:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Incredibly proud of my District Director, Marlon, for speaking out about his experience on Capitol Hill on January 6.\n\nOur staff are the best we can hope for in public servants. They deserve a safe workplace, and we have a responsibility to guarantee it.\n\nhttps://t.co/fqoItGAba3","date":"Wed Dec 01 15:19:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"More here: https://t.co/25jIgctLdl","date":"Wed Dec 01 14:46:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨 New report finds the #BuildBackBetter Act would cut costs *drastically* for working families:\n\n- a two-parent family of four would save $7,400 in tax cuts and lower costs. \n- a single mother with two kids would save $15,000 in tax cuts and savings.\n\nThat's lifechanging.","date":"Wed Dec 01 14:46:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"#AbortionIsEssential, but the threat to Roe v. Wade is about more than your right to legal abortion. It's about your rights -- period.\n\nOverturning nearly 50 years of established precedent undermines the fundamental rights of Americans across the board.\n\nWe cannot stand for it.","date":"Wed Dec 01 14:24:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Tune in at 10:15! 👇","date":"Wed Dec 01 14:08:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Another hissy fit in the making, as Republicans plan again to take their ball and go home after not getting their way. \n\nLike every other #GOPShutdown, this would greatly harm federal employees, contractors, and the American people who need and deserve a functioning government. https://t.co/lvVYiOkOij","date":"Wed Dec 01 12:39:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you @lssnca for having me on for your town hall this evening. Our community partnership will continue to help welcome refugees in Northern Virginia! https://t.co/wRnoyK2EaO","date":"Wed Dec 01 00:48:51 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I am heartbroken by the shooting and tragic loss of life at #Oxford High School in Michigan. \n\nAnd I am livid at the @NRA and their @GOP enablers who watch in complicit silence as children suffer and die in the one place they should feel most safe.\n\nENOUGH.","date":"Tue Nov 30 22:43:23 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Proud to join this effort with you, @RepDeborahRoss. \n\nDocumented Dreamers grew up here and know no other home. They are Americans -- through and through.","date":"Tue Nov 30 18:56:01 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joined Annandale Boy Scout Troop 150 tonight and spoke about the importance of civic engagement and community service. Bloom where you are planted! https://t.co/iusWT2wFwA","date":"Tue Nov 30 01:14:39 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy Hanukkah.","date":"Sun Nov 28 23:00:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"A quick #BlackFriday reminder to be kind to retail workers, who are working hard and often not earning enough. Just a little kindness can go a long way.","date":"Fri Nov 26 17:32:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This #Thanksgiving, let’s pause and reflect on how we can give back to others and contribute to national healing. Replace anger with positive purpose. \n\nLet this one be a turning point to renew and rebuild the ties that bind us together. As one indivisible nation.","date":"Thu Nov 25 14:11:19 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"#HappyThanksgiving, VA-11! May this year’s gathering be filled with many blessings. https://t.co/Mf3YduZpVP","date":"Thu Nov 25 13:09:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Marjorie Taylor Greene voted twice against awarding a  Congressional Gold Medal to the police officers who defended us from insurrectionists on January 6.\n\nCan't say I'm exactly sure when \"back the blue\" became \"back the murderous gun-toting teenage vigilante,\" but here we are.","date":"Wed Nov 24 19:34:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Being Black and outdoors should not be a death sentence in America.","date":"Wed Nov 24 19:01:24 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Justice.","date":"Wed Nov 24 18:40:01 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As anyone who's worked with her will tell you, Shalanda Young is the best of the best. She is among the most dedicated public servants I've ever met, and her intellect is matched only by her genuine kindness.\n\n@POTUS could not have made a better choice. Congratulations, Shalanda.","date":"Wed Nov 24 15:20:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We value our environment, and are using reconciliation to make the single largest investment in the fight against climate change in history.","date":"Wed Nov 24 15:00:23 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"These are our values. \n\nThis is why we fight.\n \nThis is how we #BuildBackBetter — not only for the rich and well-connected, but for every single American.","date":"Wed Nov 24 15:00:23 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We value American children and their parents, and are using reconciliation to drastically lower child care costs and provide access to preschool for every kid.","date":"Wed Nov 24 15:00:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We value the health and wellbeing of the American people, and are using reconciliation to expand access to vital health services (particularly for seniors) and to lower the cost of care across the board.","date":"Wed Nov 24 15:00:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans have stated their values loudly and clearly. \n\nBut here are the values that @POTUS and @HouseDemocrats fighting for.","date":"Wed Nov 24 15:00:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We value working Americans, and are using reconciliation to cut their taxes—not the super-rich.","date":"Wed Nov 24 15:00:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"When Republicans last used the budget reconciliation process, it was to pass a $2 trillion tax cut for corporations and the ultra-wealthy.\n \nBefore that, they used it to rip health care away from more than 20 million Americans.","date":"Wed Nov 24 15:00:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"When I served in local government, I helped to write and pass 14 consecutive budgets.\n\nIf I learned one thing from that process, it’s that budgets truly are statements of values.\n\nThread:","date":"Wed Nov 24 15:00:20 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Are you over 18? Has it been six months since your second Pfizer or Moderna shot? Or two months since your J&amp;J shot?\n\nYour level of protection is starting to diminish — stay safe with a booster shot!\n\nhttps://t.co/azyWiw1eV9","date":"Tue Nov 23 23:02:43 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The fascists and white supremacists who stormed the Capitol on January 6th planned for violence. There is no doubt about it. \n\nThe January 6 Select Committee will leave no stone unturned in its pursuit of truth and justice. https://t.co/mXr3gSEpNE","date":"Tue Nov 23 21:47:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s time to catch up with the rest of the world. It’s time for paid leave in America. #BuildBackBetter","date":"Tue Nov 23 18:31:23 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The #BuildBackBetter Act will change lives. But it can only do so quickly if it’s implemented well — and that comes down to dependable IT.\n\nI made sure BBB included provisions to bolster federal IT — including $250m for the Technology Modernization Fund👇\n\nhttps://t.co/CaoUXibg1o","date":"Mon Nov 22 22:16:56 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Federal employees remain ready to serve—with public health at the forefront.\n\nAlready, 95% of feds are in compliance with vaccine mandates that go into effect today. Some agencies are near 100% compliance.\n\n(Thank you, @POTUS!)\n\nhttps://t.co/rBgEQfPCDO","date":"Mon Nov 22 15:06:55 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"On this Transgender Day of Remembrance, we remember the lives cut short by bigotry and violence. And we recommit ourselves to fighting for the right to live authentically—for every American.","date":"Sun Nov 21 00:46:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Hosting my 13th annual Open Season town hall for federal employees, federal retirees and veterans. This forum features a panel of experts, Walt Francis and Edward DeHarden, who have decades of experience in this area. https://t.co/BHWpFIbE0I","date":"Sat Nov 20 16:49:59 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today’s verdict is a miscarriage of justice. Vigilantism endangers everyone, and those who celebrate this decision further the threat. \n\nWe must not lose hope and choose instead to continue our push for progress.","date":"Sat Nov 20 01:21:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Let me make sure it’s sinking in. This would be a monumental achievement in and of itself for any Congress. \n\nBut we’re doing it with universal pre-k.\n\nAnd expanded health coverage.\n\nAnd paid leave.\n\nAnd the largest investment to fight climate change in history.\n\nAnd much more.","date":"Fri Nov 19 23:06:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Under the #BuildBackBetter Act, you won’t pay more than $35 per month for insulin.","date":"Fri Nov 19 22:52:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I am tickled pink that two DeJoy enablers have been replaced and thank President Biden for his leadership. This action is a good thing for the Postal Service and, most importantly, a great thing for the American people.","date":"Fri Nov 19 15:43:24 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The moment we’ve been waiting for, folks:\n\nThe Build Back Better Act: ✅","date":"Fri Nov 19 15:00:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We’re Building Back Bettah!","date":"Fri Nov 19 14:45:58 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Good morning. @HouseDemocrats are about to pass universal pre-k, lower prescription drug costs, paid family leave, expanded health coverage, middle class tax cuts, and the biggest effort to fight climate change in history. \n\nA good morning, indeed.","date":"Fri Nov 19 13:37:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"BREAKING: Early first look at tomorrow's front page.\n\ncc. @GOPLeader https://t.co/pkBXgN34wy","date":"Fri Nov 19 04:32:08 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Budgets are statements of values. \n\nGOP budgets have slashed taxes for the wealthy and ripped health care from 20m Americans. Those are their values. \n\nToday, Democrats are cutting taxes for working Americans, expanding health care, and lowering costs. Those are our values. https://t.co/K8n28vyosn","date":"Fri Nov 19 00:07:04 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Let me say it again for the people in the back:\n\n📢📢 We are the only major economy IN THE WORLD to have already exceeded our pre-COVID levels of GDP 📢📢","date":"Thu Nov 18 20:53:10 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Virginia and the Biden-Harris Administration are taking collective action to address maternal mortality head-on. \n\nThis is fantastic news.","date":"Thu Nov 18 20:34:24 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The #BuildBackBetter Act is lifechanging.\n\nExpanded Child Tax Credit.\nChild care &amp; universal pre-K. Expanded health coverage.\nLower prescription drug costs. \n\nThese investments will raise the quality of life and lower the cost of living for parents &amp; kids across the country.","date":"Thu Nov 18 18:22:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The NATO Parliamentary Assembly stands in total solidarity with Ukraine. We continue to firmly support its independence, sovereignty, and territorial integrity.  \n\nMy full statement:\n\nhttps://t.co/LU7r53nMYu @natopapress","date":"Thu Nov 18 16:11:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"A few days ago, @RepGosar posted an animated video wherein he kills @AOC and threatens President Biden.\n\nToday, @GOPLeader—and I use “leader” very lightly—couldn’t even bring himself to condemn this vile conduct.\n\nThe @HouseGOP took the hint. 99% voted against Gosar’s censure.","date":"Thu Nov 18 00:46:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Raise your hand if you’re excited for new and improved roads &amp; bridges, universal access to high-speed internet, cleaner drinking water nationwide, and huge investments in public transit\n\n🙋‍♂️🙋‍♂️🙋‍♂️","date":"Wed Nov 17 17:19:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"After a year of self-dealing and deliberate sabotage, PMG DeJoy was rewarded with a bonus! No one in Congress and no American supports this. This is a failure of leadership and yet another reason DeJoy and the Chairman of the Board must be removed.\n\nhttps://t.co/K3EALy7vPw","date":"Wed Nov 17 14:36:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚧 Road &amp; bridge repairs\n✈️ Port &amp; airport improvements\n🚉 Huge public transit investments\n🚰 100% lead pipe replacement\n🔋 Electric vehicle charging network\n💻 High speed internet for all\n💉Mass COVID testing and vaccines\n💵 Stimulus checks &amp; CTC payments\n\nDemocrats deliver.","date":"Tue Nov 16 13:49:24 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"After four years of broken promises and more “Infrastructure Weeks” than I can count, President Biden is about to sign into law the single most significant investment in American infrastructure in a generation. \n\nTrump promised, but #BidenDelivers.","date":"Mon Nov 15 20:29:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Together, @POTUS and Democrats in Congress expanded the #ChildTaxCredit and set up monthly payments to millions of American families. \n\nToday is the last day for non-filers to sign up for the monthly payments, so don't miss out!\n\nSign up here: https://t.co/FOmvozI3LY","date":"Mon Nov 15 18:04:15 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Looking forward to joining @POTUS at the White House this afternoon as he signs the historic Bipartisan Infrastructure Deal into law. \n\nFrom repairing roads and bridges to ensuring access to high-speed internet for all, this legislation is a huge win for Virginians.","date":"Mon Nov 15 17:20:41 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Excited to be back with the Fairfax County Federation of Citizens Association for their Annual Citizen of the Year Awards Banquet. Congratulations to all the honorees, &amp; a special congratulations to the 2019 and 2020 Citizen of the Year! https://t.co/K8SxDgoDLH","date":"Mon Nov 15 00:00:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"When we say the #BuildBackBetter Act will transform lives, this is what we mean 👇🏘 https://t.co/7FKScZnVnY","date":"Sun Nov 14 02:14:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Let this be a warning to others who refuse to share information and testimony demanded by congressional subpoena. \n\nAmerican rule of law will be enforced. \n\nhttps://t.co/YsfhfmB2up","date":"Fri Nov 12 22:45:51 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The #BuildBackBetter Act will expand access to free, high-quality pre-K to an additional 142,882 kids in Virginia—setting them up for lifelong success (and saving their parents thousands of dollars).\n\nLet's get it done. https://t.co/YZPhJDPiuX","date":"Fri Nov 12 17:26:36 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you VFW Post 8469 &amp; American Legion Post 177 for hosting a great Veteran’s Day Ceremony. Today we honor &amp; remember those who have defended our democracy. As a nation, we have a sacred obligation to care for both our veterans and their families. Thank you to all who served. https://t.co/xIo6M3X0K7","date":"Thu Nov 11 16:32:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"To all who have answered the call to serve — thank you. Happy #VeteransDay  🇺🇸 https://t.co/wT7T4JnqyB","date":"Thu Nov 11 14:33:38 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This #VeteransDay, we remember the brave men &amp; women who gave their lives in service to our country and pledge to honor their sacrifice—today and every day. https://t.co/OoF8icIjvq","date":"Thu Nov 11 12:11:20 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Things fall apart; the centre cannot hold;\nMere anarchy is loosed upon the world,\nThe blood-dimmed tide is loosed, and everywhere\nThe ceremony of innocence is drowned;\nThe best lack all conviction, while the worst\nAre full of passionate intensity...\n—William Butler Yeats","date":"Wed Nov 10 01:30:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"You are a disgrace to the country and the Congress, @RepGosar. I am genuinely ashamed to call you a colleague.\n\nDeal with this, @GOPLeader.\n\nhttps://t.co/baEbD2oONq","date":"Tue Nov 09 20:03:24 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Doctors and nurses were wearing trash bags, Kellyanne.","date":"Tue Nov 09 14:13:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"NARRATOR: Pelosi did, in fact, have the votes.","date":"Mon Nov 08 15:01:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We’re building back better to the tune of 700,000 new jobs a year.\n\nThank you, @POTUS. https://t.co/G4zJiTEm0P","date":"Mon Nov 08 14:32:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Extreme weather events cost Virginians up to *$10 billion* in damages over the last decade.\n\nOur infrastructure deal takes unprecedented steps to protect us from and prevent the effects of climate change. https://t.co/4w5cSypCOc","date":"Sun Nov 07 22:25:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"ICYMI, Joe Biden just secured reliable, high-speed internet for every single American. https://t.co/cCpek8EbAD","date":"Sun Nov 07 21:34:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you Supervisor @KennyBoddye. Let’s get this done for PWC!","date":"Sun Nov 07 13:58:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Last night's Infrastructure bill is a huge win for Virginia, especially for Metro. \n\nFrom @washingtonpost\n\n\"The infrastructure package includes Connolly’s legislation, the Metro Accountability and Investment Act.\"\n\nhttps://t.co/tuMnqufdRo","date":"Sat Nov 06 20:37:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"History says don’t hope\nOn this side of the grave\nBut then, once on a lifetime\nThe longed for tidal wave\nOf justice can rise up\nAnd hope and history rhyme\n— Seamus Heaney, Irish poet","date":"Sat Nov 06 20:02:08 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Tonight, we did what the previous Administration tried and failed to do for four long years.\n\nThe biggest infrastructure investment in decades will soon be law.","date":"Sat Nov 06 04:18:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Pass the Infrastructure Investment and Jobs Act: ✅","date":"Sat Nov 06 03:30:59 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Here’s the bottom line:\n\nThe #BuildBackBetter Act is about raising your quality of life and lowering your cost of living. And we will get it done.","date":"Fri Nov 05 16:39:37 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I'm in.","date":"Fri Nov 05 15:17:19 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Universal pre-k.\nPaid family and medical leave.\nLower child care costs.\nLower health care costs.\nLower prescription drug prices.\nHistoric middle class tax cuts. \nUnprecedented climate action.\n\nToday, we #BuildBackBetter.","date":"Fri Nov 05 13:21:12 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Each and every Republican in Congress will vote against the #BuildBackBetter Act.\n\nAgainst paid parental leave. \n\nAgainst the child tax credit. \n\nAgainst lower child care costs.\n\nAgainst universal pre-k.\n\nThey’re not “pro-parent.” They’re pro-poverty.","date":"Thu Nov 04 19:17:25 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Did you know federal employees can use up to four hours of administrative leave to get their kids vaccinated? Don't wait!\n\nCheck out the full guidance from @USOPM: https://t.co/cO3oVFlf3l\n\n#ThisisOurShot","date":"Thu Nov 04 19:12:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The #BuildBackBetter Act will change lives. \n\n👶 Universal pre-k &amp; cheaper child care.\n👪 Paid family leave.\n💊 Lower prescription drug prices.\n🏥 Lower health care costs.\n🔋 Electrification of govt vehicles.\n🌎 Largest climate investment in history.\n\nLet’s do it.","date":"Thu Nov 04 16:33:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Wishing a very #HappyDiwali to all celebrating the Festival of Lights in VA-11 and around the country!","date":"Thu Nov 04 16:24:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"After Tuesday night, Democrats need to be at DEFCON 2. \n\nPass the two investment bills. Communicate our accomplishments. Rinse and repeat.","date":"Thu Nov 04 15:25:40 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is my constituent, Marc Polymeropolous.\n \nHe began advocating for care for those with Havana syndrome after mysterious attacks in Moscow caused health damages that forced him to resign from the CIA. Thanks to his work, the HAVANA Act was signed into law.\n \nThank you, Marc https://t.co/Jl2kxrjmBx","date":"Wed Nov 03 19:58:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congratulations to Governor-elect Youngkin. Virginia has made tremendous progress these last four years that we can all be proud of. At the federal level, we will fight vigorously to protect and defend those gains.","date":"Wed Nov 03 13:58:55 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s Election Day, Virginia! Make your voice heard and VOTE.\n\n🗳 Find your polling place here: \n\nhttps://t.co/VnCPyejkj4","date":"Tue Nov 02 14:21:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Federal first responders are our neighbors and our friends. They live their lives in service to their communities and their country, and they deserve the retirement they were promised. \n\nIt is quite literally the least we can do.\n\nMy OpEd in @thehill ⬇\n\nhttps://t.co/Euuyp0g6aC","date":"Mon Nov 01 17:11:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"SCOTUS is hearing arguments that challenge the most restrictive abortion ban in the country --Texas’ SB8. This ban is a threat to reproductive freedom and sets a dangerous precedent with its enforcement policy. \n\nThe Court must block this cruel and unconstitutional abortion ban.","date":"Mon Nov 01 16:51:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you to @BethanyHouseNV for having me speak at your prayer breakfast for victims of domestic violence. 1 in 4 women and 1 in 7 men will be affected by DV at some point in their lives. Work by orgs. like Bethany House is vital to ending the epidemic of violence in the U.S. https://t.co/He6FN1sFRa","date":"Sat Oct 30 17:10:48 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is such good news. A huge relief for so many parents and families across the country.\n\nhttps://t.co/vtGqNOdi5l","date":"Fri Oct 29 19:57:25 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The #BuildBackBetter Framework will cover the electrification of the entire Postal Service fleet — $2.57 billion for electric vehicles and $3.41 billion for charging infrastructure.\n\nThat’s huge, folks.","date":"Fri Oct 29 19:31:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":".@POTUS's #BuildBackBetter Framework includes the largest effort to combat climate change in WORLD HISTORY.\n\nIt includes the biggest investment in affordable housing that we've ever made.\n\nIt includes the most comprehensive expansion of health care in a decade.\n\nWe can do this.","date":"Thu Oct 28 20:58:57 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today I was thrilled to welcome members of the NATO Parliamentary Assembly to the Capitol for their first visit in over a year.\n\nAs NATO PA President, I was proud to greet 33 MPs from 12 different countries and I look forward to continuing to build our collaborative relationship. https://t.co/5gkTIZ5KS9","date":"Wed Oct 27 17:13:08 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"3 years ago, a gunman stole 11 lives at the Tree of Life Synagogue in Pittsburgh. We honor and remember them today.\n\nAnd we recommit ourselves to rooting out and standing up to antisemitism--wherever and whenever it rears its head.","date":"Wed Oct 27 15:53:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Wrong answer.","date":"Wed Oct 27 00:42:12 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"In just a day in 2020, domestic violence programs were unable to meet 11,047 requests from survivors of domestic violence. \n\nThat's unacceptable and unsustainable.\n\nToday, @HouseDemocrats will #SupportSurvivors with a bill that modernizes &amp; invests in domestic violence programs. https://t.co/EnMcH0Yc18","date":"Tue Oct 26 15:13:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans used the reconciliation process to pass a massive tax cut for corporations and billionaires. \n\nDemocrats are using the reconciliation process to pass an historic investment in American families, infrastructure, and our climate.\n\nRemember that.","date":"Tue Oct 26 02:01:41 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy Monday! Perfect weather to get your COVID-19 vaccine, if you ask me.\n\nhttps://t.co/azyWiw1eV9","date":"Mon Oct 25 12:56:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Soviets called their news outlet Pravda—“truth.” Nobody believed them either.\n\nhttps://t.co/kAa0OCoE8V","date":"Sun Oct 24 19:55:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Louis DeJoy is a crony and a crook. \n\nHe answers to the Postal Board of Governors. I call on them once again to finally do the right thing and get rid of him. \n\nThe American people—their customers—deserve so much better.","date":"Fri Oct 22 13:43:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Dan Snyder has overseen a toxic culture driven by a maximum profit mentality above all else. This rampant conduct, which includes exploiting women, cannot be tolerated.\n\nThere can be no more free passes for Dan Snyder. The NFL must be transparent and cooperate with this inquiry.","date":"Fri Oct 22 00:00:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today, I will vote to hold Steve Bannon in contempt of Congress for his outright, baseless refusal to comply with a subpoena from the January 6th select committee.\n\nThere is absolutely no reason for any @HouseGOP Member to vote no—unless, of course, they have something to hide.","date":"Thu Oct 21 18:37:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Tune in now to our @OversightDems hearing on the need for a constitutional Equal Rights Amendment. I'm proud to be introducing one of our witnesses, a tireless champion for the ERA in Virginia and my friend @JennMcClellanVA! \n\n📺https://t.co/Jk1GGjLPt5","date":"Thu Oct 21 14:11:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"If our choice is between a lasting democracy and an arcane Senate procedure, democracy wins. Every time. \n\nAbolish the filibuster.","date":"Thu Oct 21 01:51:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"What does it look like to #BuildBackBetter?\n\n💰Historic middle class tax cuts\n\n👶 Universal pre-k &amp; cheaper child care\n\n🏥 Vision &amp; dental covered by Medicare \n\n🌎 Crucial investments in clean energy\n\nLet’s get it done.","date":"Tue Oct 19 18:12:37 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"@MagentaStardust @DAVISbuilds @fairfaxcounty @KenPlum1 Please email Maddy.White@mail.house.gov and we can contact Fairfax County staff about this. - staff","date":"Tue Oct 19 13:14:39 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Forever chemicals are an urgent public health threat. The EPA’s PFAS Roadmap is an important step towards cleaning up these forever chemicals and holding polluters accountable. \n\nThank you, @POTUS, for taking action to protect our health and environment.\n\nhttps://t.co/4cIsrhWC7g","date":"Mon Oct 18 22:01:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Earlier today, I had the pleasure of hearing from seniors at Forest Park High School about the issues they care about the most. Our future is in good hands, folks. https://t.co/TSt8nOImzR","date":"Mon Oct 18 20:37:25 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Following the difficult but necessary decision to remove 7000 series cars from service, I am demanding a plan of action from WMATA for how these issues will be addressed and rider confidence in system safety restored.\n\nMy full statement:\n https://t.co/BjV1TKvqA7","date":"Mon Oct 18 20:15:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"My thoughts are with Colin Powell’s loved ones as they mourn his tragic loss. General Powell was a gentleman, a trailblazer, and a patriot. May he Rest In Peace.","date":"Mon Oct 18 18:03:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Hosting a small business roundtable this morning with community leaders in #VA11. Virginia is a great place to start a small business, but there is still work we can do to Build Back Better, create more opportunities, and beat this pandemic. https://t.co/V50cwjJqwl","date":"Mon Oct 18 14:42:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Sick of the #DeJoyDelays? \n\nTune in at 12PM for our hearing on delivery delays and declining service standards at USPS under Louis DeJoy's 10-year \"plan.\" ⤵ \n\nhttps://t.co/jdpLVoqe5l","date":"Fri Oct 15 13:46:08 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"After signing the bill, President Biden spent over an hour with us for a personally guided tour of the White House. Thank you, @POTUS, for your leadership and your friendship.","date":"Wed Oct 13 17:30:58 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Just returned from the signing of my 9/11 Memorial Trail bill in the Oval Office! The bill creates a new 1,300 mile trail connecting the World Trade Center, Shanksville, PA, and the Pentagon.","date":"Wed Oct 13 17:30:58 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congress will do whatever it takes to get testimony from every key player connected to the January 6 attack on the Capitol—including, if necessary, our own colleagues.\n\nThis isn't a game. It's the future of our democracy. https://t.co/eUxIxVCeBX","date":"Wed Oct 13 16:00:04 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Tonight, every single House Republican voted to default on our debt and throw the economy into recession. \n\nThankfully, and as always, House Democrats were there to be the adults in the room. Default is avoided for now. \n\nDo better, @HouseGOP.","date":"Tue Oct 12 23:34:38 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":".@LeaderHoyer is this allowed","date":"Tue Oct 12 16:50:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"In Texas, your boss can haul you to court for getting an abortion but isn't allowed to keep you safe from COVID-19.\n\nHave I got that right, @GovAbbott?","date":"Tue Oct 12 13:52:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today, on #IndigenousPeoplesDay, we honor Indigenous Americans and celebrate Native cultures. And we rededicate ourselves to understanding their histories and preserving their futures.","date":"Mon Oct 11 13:24:37 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I applaud President Biden. This is an important positive step after Trump slammed the door on refugees. Congress must still pass the Lady Liberty Act.\n\nhttps://t.co/zROEW1WrT7","date":"Sat Oct 09 17:04:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Read the documents and our full letter to GSA here: \n\nhttps://t.co/WxqaNUSHnZ \n\n(9/9)","date":"Fri Oct 08 14:53:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"3. The Trump Hotel received over $3.7 Million from foreign governments.\n\n4. President Trump concealed debts when bidding on the Old Post Office Building lease. \n\n5. The Trump Hotel moved around millions of dollars in opaque transactions with other Trump businesses.","date":"Fri Oct 08 14:53:30 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We on @OversightDems have been relentless in our pursuit of accountability for the thinly-veiled criminal enterprise Donald Trump ran from the Oval Office.\n\nThe investigation does not stop here.","date":"Fri Oct 08 14:53:30 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"For more than five years, @OversightDems has been investigating conflicts of interest related to GSA’s management of the Trump Hotel’s lease. Under Trump, GSA failed to substantially comply with the Committee’s requests.\n\n(More on that here:) https://t.co/kTKMe8AtMR","date":"Fri Oct 08 14:53:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"These documents show:\n \n1. President Trump reported massive earnings at Trump Hotel to conceal over $70 million in losses.\n\n2. While in office, Trump received preferential treatment potentially worth millions from a foreign bank.","date":"Fri Oct 08 14:53:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"On July 9, 2021, GSA finally produced a subset of documents, including the Hotel’s audited financial statements, three-years’ worth of documents that were submitted to GSA to win the federal lease, and communications between Trump’s businesses and GSA regarding the lease.","date":"Fri Oct 08 14:53:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Despite the precedent set by every modern American president, during his term in office, President Trump retained his financial interest in his various business entities, including the Trump Hotel.","date":"Fri Oct 08 14:53:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"BREAKING: After 5 years of investigation, @RepMaloney and I have obtained evidence that Donald Trump hid debts, concealed millions in losses, and received millions more from Foreign Governments at Trump Hotel.\n\nThread (1/9):","date":"Fri Oct 08 14:53:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The hotel opened to the public in September 2016, just weeks after Mr. Trump accepted the nomination for President. Throughout his term, there were numerous reports about foreign and domestic interests patronizing the Trump Hotel as a way to curry favor with the President.","date":"Fri Oct 08 14:53:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Kicking off our annual NATO PA session with the head of the Portuguese Delegation Adao Silva. https://t.co/AkLdVWpiYX","date":"Fri Oct 08 12:58:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"https://t.co/jdOLdZqbIH","date":"Thu Oct 07 11:57:58 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Donald Trump took a sledgehammer to our democracy and left our institutions teetering on the edge.\n\nI’m working to pass the Protecting Our Democracy Act with @RepAdamSchiff to clean up the rubble and repair Trump’s damage before someone of his ilk can swing the hammer again.","date":"Thu Oct 07 11:55:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Good. Preserving your right to choose is a fight worth having, and it is far from over.","date":"Thu Oct 07 00:54:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"You will send the economy into free fall, and your constituents will pay the price. Period.","date":"Wed Oct 06 18:59:19 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Let’s keep it up, Virginia! #GetVaccinated","date":"Wed Oct 06 18:51:43 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Under the #BuildBackBetter Act, the typical Virginia family of four with an infant will save more than $12,000 per year on child care. \n\nThat's life-changing. \n\n@HouseDemocrats &amp; @POTUS will get it done. https://t.co/NSjG6ILAp3","date":"Wed Oct 06 14:49:12 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As President of the NATO Parliamentary Assembly, \nI am thrilled to share that @SpeakerPelosi will address our 67th annual session in Lisbon, Portugal.\n\nThank you, Madam Speaker, for your steadfast commitment to the transatlantic Alliance.\n\nhttps://t.co/O7dUy51AK3","date":"Wed Oct 06 14:02:01 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congress 101: Don’t trash the full faith and credit of the United States and throw the economy into a recession just because the president is a Democrat.\n\nClass dismissed.\n\ncc. @HouseGOP @SenateGOP","date":"Tue Oct 05 21:31:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Great to have you back at the Capitol, @jensstoltenberg! The transatlantic Alliance is strong.","date":"Tue Oct 05 15:35:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The debt ceiling isn’t about spending new money. \n\nIt’s about paying the bill on money that Republicans already spent. https://t.co/NuA3eZLc80","date":"Mon Oct 04 19:24:09 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans won’t raise the debt limit even though they're responsible for it. They racked up nearly $8 trillion in debt, in part to give the wealthiest Americans a tax giveaway.\n \nRaising the debt limit pays off old debts. It has nothing to do with new spending.","date":"Mon Oct 04 18:32:24 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I’ve seen several recent stories in the press that seem to point to a coordinated attempt to portray @GSAEmily as some kind of unassuming, apolitical bureaucrat. \n\nMy subcommittee oversees GSA. I know Admin Murphy. She is a Trump loyalist, through and through.\n\nThread:","date":"Sun Nov 22 20:57:21 +0000 2020","user_id":"78445977"},{"handle":"GerryConnolly","text":"Had a great fireside chat with @USOPM Director Kiran Ahuja and @RepDonBeyer speaking to the next generation of public servants! Thank you @GeorgeMasonU students and @GMUPres for the amazing hospitality! https://t.co/lDyUsLncnY","date":"Mon Oct 04 17:09:24 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joined the unveiling of the James Lee Historical Marker at the first modern school for African Americans in the county. These markers teach the true history here, ensuring African American legacies aren’t erased. And was honored to meet some of the students who went to James Lee. https://t.co/EIv7yEWjwz","date":"Sat Oct 02 16:44:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"https://t.co/HNdWz9Wupp","date":"Fri Oct 01 14:30:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"So SCOTUS has modernized enough for Justice Kavanaugh to participate remotely, but not enough to televise its own proceedings?\n\nWe need cameras in the Court.","date":"Fri Oct 01 14:02:37 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Abolish the debt ceiling.","date":"Thu Sep 30 20:06:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Just voted for the continuing resolution to prevent a shutdown and keep the federal government open and serving Americans. \n\nFortunately, the bill passed. But 174 of my Republican colleagues happily voted for a complete shutdown. Shame.","date":"Thu Sep 30 19:56:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"I can't imagine anybody ever even thinking of using the debt ceiling as a negotiating wedge.\" - Donald Trump, 2019.\n\n\"Republicans are united in opposition to raising the debt ceiling.\" - Mitch McConnell, 2021.\n\n🧐","date":"Thu Sep 30 17:43:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Extreme anti-abortion state governments and a hostile SCOTUS are bulldozing through your constitutional right to an abortion.\n \n@OversightDems is holding a hearing right now to protect this right. WATCH: https://t.co/0hiXPEn7lT","date":"Thu Sep 30 14:23:51 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"@TaimurK_pilot You can send us a message on our website any time: https://t.co/QcYnGMcn1O\n\n- staff","date":"Wed Sep 29 15:54:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Donald Trump left behind a roadmap for aspiring autocrats. With the Protecting Our Democracy Act, we have a chance to destroy it.\n\nhttps://t.co/PPA6N2mHe2","date":"Wed Sep 29 15:16:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Passed!","date":"Tue Sep 28 20:46:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"On this beautiful fall day in Prince William County, we cut the ribbon for a new trail segment of the Potomac Heritage Trail! This scenic trail segment overlooking the Occoquan River connects Belmont Bay to Veterans Memorial Park. https://t.co/3KRpW61dGT","date":"Sun Sep 26 23:09:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"A great morning to come together for another annual Reston Multicultural Festival. Reston serves as a model for us as we work to embrace diversity in this country and hold up the American values enshrined on the Statue of Liberty. https://t.co/6UUqjj6osR","date":"Sat Sep 25 17:34:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Enjoyed the opportunity to sit down w/ @Marshall_Center to discuss the imperative of strengthening democratic institutions, my presidency of the @natopapress, and our recent @house_democracy engagements. \n\nhttps://t.co/7IX6mmx0sE","date":"Fri Sep 24 16:00:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"@HSGAC It has been four and a half years since this agency had a quorum and it has a backlog of more than 3,100 cases.  Let’s get these nominees confirmed ASAP to ensure merit and expertise remain foundations of our federal workforce.","date":"Wed Sep 22 22:26:30 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congrats @HSGAC on a great confirmation hearing for three highly-qualified candidates for the Merit System Protection Board. I have held hearings, written letters, and introduced legislation to get this agency back in business.","date":"Wed Sep 22 22:26:23 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is a setback, but it’s not the end of the road. We will exhaust every possible option to ensure a pathway to citizenship is signed into law. It is our moral obligation.","date":"Tue Sep 21 15:13:38 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I’m thrilled to see @POTUS take action to increase refugee admissions from 62,500 to 125,000, the level I am pushing for with my Lady Liberty Act. I look forward to working with him to codify that level as we continue to welcome Afghan refugees.","date":"Mon Sep 20 22:34:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joined First Baptist Church of Merrifield’s 151st Anniversary celebration this morning. Over a century and a half of strong community ties and service to our neighbors through faith. Thank you for continuing to lead for change! https://t.co/vdJbsVGl6r","date":"Sun Sep 19 16:02:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"My heart goes out to Coach Fred Moore's family and our entire Woodbridge community. A teacher, coach, and public servant who gave back to the community.","date":"Sat Sep 18 11:53:40 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I am deeply sorrowed by this loss of innocent life. This warrants a full examination of intelligence used in the deployment of drones to ensure it cannot happen again.","date":"Fri Sep 17 22:11:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This #ConstitutionDay, as we celebrate the signing of our founding document, we recommit ourselves to ensuring it lives up to its promise for every American — beginning with a constitutional amendment to reverse Citizens United and return power to actual people, not corporations.","date":"Fri Sep 17 19:41:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Jamal Khashoggi lived in my district. Saudi Arabia ordered the murder and dismemberment of my constituent.\n\nI will not let this go.\n\nI’m teaming up with @AOC on an amendment to ban any funding that aids or arms the Rapid Intervention Force — the Saudi unit that killed Jamal. https://t.co/10QBgwlQNp","date":"Fri Sep 17 18:43:10 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I wholeheartedly endorse this nomination and look forward to partnering with her to rebuild OPM. \n\nhttps://t.co/qe97LYVC5K","date":"Thu Sep 16 20:39:30 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I can’t think of a more effective oversight partner to serve as the Office of Personnel Management Inspector General than Krista Boyd. In two decades of service on @OversightDems, she saved billions of dollars and fostered greater trust in government.","date":"Thu Sep 16 20:39:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It's been eight months since the January 6 insurrection. It feels more like eight hours. \n\nThat day left scars, on individuals and on institutions, that have yet to heal. There is no \"moving on\" until they do. \n\nhttps://t.co/HxsFDJ7D41","date":"Thu Sep 16 14:05:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Cannot overstate how much courage these young women have testifying today. It is our responsibility to ensure all women feel safe in society regardless of where they live, go to school, or work. This investigation needs to hold everyone responsible accountable.","date":"Wed Sep 15 21:40:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"And not a single Republican in Congress voted for it.","date":"Wed Sep 15 18:47:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"To all observing #YomKippur in VA-11 and beyond, I wish you an easy fast and a blessed holy day. Chag Sameach!","date":"Wed Sep 15 16:19:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As has been proven time and again throughout this pandemic, the contributions of Hispanic and Latino Americans are more essential than ever. This #HispanicHeritageMonth, we honor the Hispanic story as an integral part of our shared heritage and future. https://t.co/UwuS9LfEcK","date":"Wed Sep 15 15:18:51 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I am a child of the civil rights era. I did not run for office to witness a reversion to Jim Crow in America.\n\nThe Senate should abolish the filibuster altogether. If they won't, they must implement a carveout for voting rights legislation. \n\nDemocracy is at stake. https://t.co/l9B78lQ64U","date":"Tue Sep 14 14:07:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Getting ready to join @AnaCabrera on @CNN ahead of our hearing with Secretary of State Blinken. Tune in! https://t.co/AcQbzkxbzf","date":"Mon Sep 13 17:27:56 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It can’t be said enough—my deepest thanks to the @CapitolPolice for protecting the Congress and defending our democracy.","date":"Mon Sep 13 14:50:39 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Best of luck, Michael! You might need it—won’t be easy to leave paradise behind.","date":"Sun Sep 12 21:41:51 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you to Indivisible Northern Virginia for inviting me to give a Congressional update on all we’ve been doing this year. From voting rights, infrastructure, climate change, &amp; much more. Looking forward to our continued partnership &amp; thank you for your activism! @EarthRiseInd https://t.co/TMT9qCt5r7","date":"Sun Sep 12 17:09:15 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today across Fairfax County we came together to remember those we lost 20 years ago. It’s not enough to honor them today, but we must reflect every day on the renewal of our American values &amp; continue to strive for unity. The need to rededicate faith in both ourselves &amp; country. https://t.co/qDw7kvkRGc","date":"Sat Sep 11 19:02:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"And we continue to stand by those who lost loved ones, as well as the heroes who, through incredible acts of sacrifice, saved countless lives.\n\nThe shock, sorrow and loss of that tragic morning will never be forgotten.","date":"Sat Sep 11 11:55:48 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Twenty years after the horrific terrorist attacks in the United States, we remember and honor the memory of the nearly 3,000 men, women and children who were killed on 9/11.","date":"Sat Sep 11 11:55:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joining our community at the “Still Standing - Still Free” ceremony to remember those we lost 20 years ago on September 11th. We as a nation are stronger together and must continue to overcome adversity as one. https://t.co/DSXZJYDOxL","date":"Fri Sep 10 23:17:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨 President Biden is about to announce a detailed national strategy to guide us out of this pandemic and ensure our economic recovery remains strong.\n\nThis is leadership.\n\nLearn more: https://t.co/hD9k7AVm2C","date":"Thu Sep 09 19:56:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Bold, urgent action like this is our only way out of the climate crisis. Thank you, @POTUS.\n\nhttps://t.co/yvIDHvVopk","date":"Thu Sep 09 15:42:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Deborah Borza’s daughter was the youngest victim aboard Flight 93. Today, Deborah inspires our fight to designate the 9/11 National Memorial Trail. \n\nThe House has unanimously passed my bill to do so. I urge the Senate to join us.\n\nhttps://t.co/Ckh1mvMOcU","date":"Wed Sep 08 19:00:48 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"What he said.\n\nhttps://t.co/HNdWz9Wupp","date":"Wed Sep 08 14:13:37 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Finally, we say goodbye to the most undeserved participation trophy in America. Virginia doesn’t pay tribute to traitors and defenders of slavery.","date":"Wed Sep 08 13:02:58 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Someone please remind Texas that it’s 2021, not 1921.","date":"Tue Sep 07 16:39:36 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Trust science.","date":"Mon Sep 06 17:23:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"L’shana Tova to all celebrating #RoshHashanah in VA-11 and around the world! Wishing you all a new year of peace and happiness.","date":"Mon Sep 06 14:20:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy #LaborDay! Go out and enjoy the day in celebration of all that unions and the labor movement have made possible—for every American worker.","date":"Mon Sep 06 12:28:04 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"@johnizonline @RepDonBeyer @RepWexton Hi John—more info about ways to help here: https://t.co/kFKuDXv54j -staff","date":"Mon Sep 06 00:55:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This weekend, @RepDonBeyer, @RepWexton, and I visited Dulles Airport &amp; Expo Center to welcome Afghan refugees to the United States.\n\nWhat I saw there was the absolute best of America — the huddled masses, beginning to breathe free. https://t.co/59fzkBSIDw","date":"Mon Sep 06 00:49:57 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Well, here we are. Celebrating another Labor Day weekend without a $15 minimum wage.\n\nThe House has passed it. The Senate needs to get on board. #RaiseTheWage","date":"Mon Sep 06 00:37:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"@PeteButtigieg Congratulations!","date":"Sun Sep 05 02:34:06 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"You don’t get to call yourself pro-life if you’re outraged about your kids being asked to wear masks in school during a pandemic. \n\nWe’re supposed to care about the babies even after they’re born, you know. It’s kind of the whole point.","date":"Sat Sep 04 21:11:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"(Also, if you are a horse, please tell me how you can read.)","date":"Fri Sep 03 23:17:09 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"If you are not a horse, please do not ingest horse dewormer. \n\nIf you are a horse, please be mean to your human until they stop ingesting horse dewormer.","date":"Fri Sep 03 23:10:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Maintaining the death penalty.\n\nDiscouraging masks and vaccines as death counts soar.\n\nEasing gun laws and refusing to hold gun makers accountable for the deaths of children.\n\nBanning abortions and forcing desperate people to undergo deadly, black market procedures.\n\n“Pro-life.”","date":"Fri Sep 03 11:53:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It's not the cost of actions taken to fight climate change that should scare you. It's the cost of inaction.","date":"Thu Sep 02 18:43:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"If SCOTUS won’t preserve reproductive freedom, Congress must. It’s time to codify Roe v. Wade.\n\nI look forward to voting for the Women’s Health Protection Act.","date":"Thu Sep 02 16:16:04 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This decision is an affront to the Constitution and a total abdication of our morality. We will fight.","date":"Thu Sep 02 11:31:58 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Oh, but we can’t afford a Green New Deal. Right, @AOC?","date":"Thu Sep 02 03:44:20 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Millions are without access to public transportation tonight—a bad situation for all, but a nightmare for folks who rely on transit and can’t afford to miss a shift or be late to school.\n\nYou’ve heard about environmental justice? Here’s Exhibit A.","date":"Thu Sep 02 03:32:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"California shouldn’t be on fire. \n\nLouisianans shouldn’t be without power.\n\nNew Jersey and Maryland shouldn’t have devastating tornadoes.\n\nClimate change is right here and right now. We’ve got to wake up.","date":"Thu Sep 02 00:04:12 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Abortion bans don’t stop abortions. \n\nThey stop *safe* abortions.","date":"Wed Sep 01 17:18:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is a violation of rule of law, right to privacy, and reproductive choice. A deeply alarming and threatening moment.","date":"Wed Sep 01 14:45:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Yesterday, in the dark of night, the Supreme Court effectively nullified Roe v. Wade for citizens of the second largest state in the union.\n\nYou have the right to a safe, legal abortion. This is the beginning of the fight—not the end. \n\nhttps://t.co/Je0wIeIZDt","date":"Wed Sep 01 14:16:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Like Shakespeare said, the Minority Leader doth protest too much, methinks.","date":"Wed Sep 01 13:16:12 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Keep safe, #VA11:","date":"Wed Sep 01 12:03:48 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"@POTUS is right— there is nothing low cost about war.\n\nThat’s why we must help all those affected by this one, and do all we can to ensure there isn’t a next one.","date":"Tue Aug 31 23:11:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I turned 18 in the height of the Vietnam War. The tragedy and turbulence of that chapter in our history ignited my activism and shaped my worldview.","date":"Tue Aug 31 23:11:30 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Lastly, my deepest gratitude goes to our brave men and women who served so honorably over the last 20 years. Thank you.","date":"Tue Aug 31 12:22:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Over the past weeks, my office was in touch with and submitted cases for 17,000 people in need of refuge in Afghanistan. \n\nI, for one, wont stop fighting for each of them.","date":"Tue Aug 31 12:22:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Our attention must remain on saving lives. We will work with the State Department and our international partners to use all diplomatic tools to bring to safety all Americans, LPRs, SIVs, and those under threat of the Taliban.","date":"Tue Aug 31 12:22:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you @JRWalkinshaw for your bold environmental leadership.","date":"Mon Aug 30 13:54:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thinking of everyone in Hurricane #Ida’s path today. Please follow guidance and stay safe.","date":"Sun Aug 29 16:20:59 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"After years of Trump’s attacks on the federal workforce, there’s more work to do to attract and retain the next generation of public servants.","date":"Sat Aug 28 16:36:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s refreshing to work with a President who respects federal workers’ dedication and expertise, and fights to pay them accordingly. This action moves us much closer to pay equity for the public sector.  (1/2)","date":"Sat Aug 28 16:36:39 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Closely monitoring the reports of explosions outside HKIA. My thoughts are with our military service members and our partners on the ground who are doing heroic work.","date":"Thu Aug 26 16:41:07 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Across the country Republicans are making it harder for voters to participate in our democracy. Congress must pass #HR4, the John R. Lewis Voting Rights Advancement Act, and #RestoreTheVote.","date":"Tue Aug 24 17:26:48 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Proud to join this effort led by @RepSpeier. We must make this a priority.","date":"Tue Aug 24 16:00:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"@DagoAcevedo There are a lot of great organizations but right now the push has been to Lutheran Social Services. We are also connecting groups with NVCC. If you email our District Director we are happy to connect you with some non-profits: Marlon.Dubuisson@mail.house.Gov","date":"Sat Aug 21 20:37:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Lutheran Social Services is the local Resettlement Agency. Find out more here:\n\nhttps://t.co/r732NQVZCd","date":"Sat Aug 21 19:17:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Welcome to Virginia. We’re glad you’re here.","date":"Sat Aug 21 18:52:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Since Saturday, Connolly’s office has submitted the names and information of nearly 2,000 people to the State Department.  He urged the department “not to take a strict, stringent, rigid approach to documentation. A lot of these people fled with nothing.”\n\nhttps://t.co/7QVTpyhL6o","date":"Sat Aug 21 15:30:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I just wrote to @POTUS to urge him to keep the final date of our departure from Afghanistan flexible. It may not be possible to rescue every single person who asks for our help, but we shouldn’t let an arbitrary deadline stop us from making our best attempt. https://t.co/RzoUneF8uL","date":"Sat Aug 21 00:58:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Yesterday, a Trump fanatic threatened to blow up the Capitol complex for 5 hours. \n\nA “Justice for J6” rally in support of the Capitol insurrectionists has been planned for September in DC.\n\nJanuary 6th was not the end. It may well have been the beginning. End this, @GOPLeader.","date":"Fri Aug 20 22:54:51 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The situation in Afghanistan should make it clear to all that the United States can and must be a safe haven for refugees.\n\nI have a bill, the #LadyLibertyAct, which would significantly raise the number of refugees we admit each year. We have a moral obligation to pass it.","date":"Fri Aug 20 20:43:04 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We cannot let those Afghans down who have stood by us for many years. I have initiated legislation in the US Congress to help accelerate the evacuation and resettlement of our Afghan partners, and I know many of my colleagues in the NATO PA are deeply involved in similar efforts.","date":"Fri Aug 20 18:46:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As of now, my office has submitted cases to the State Department for hundreds of Americans and nearly 1,000 Afghans in need of evacuation. \n\nIf someone you know needs assistance in Afghanistan, please don't hesitate to call us at (703) 256-3071.","date":"Fri Aug 20 17:28:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you, @CapitolPolice.","date":"Thu Aug 19 18:44:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Keep it up!","date":"Thu Aug 19 16:25:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"My staff is safe, and we are continuing to closely monitor the situation. Thank you, @CapitolPolice, for your bravery.","date":"Thu Aug 19 15:58:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"📢📢 Medication abortion care is health care, and health care is a human right.\n\nProud to join @RepMaloney, @RepDianaDeGette, @RepBarbaraLee, @RepPressley in calling for equitable, science-based medication abortion care policies in the United States.\n\nhttps://t.co/LQQtL1iPNm","date":"Thu Aug 19 14:37:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"101 years ago, the 19th Amendment was ratified and women finally gained the right to vote. \n\nBut not all women. For Black women, the fight would last decades longer.\n\nToday we celebrate the sacred right to vote, and we recommit to defending it for ALL Americans.","date":"Wed Aug 18 20:55:40 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you,@RepTerriSewell. Proud to join you as a cosponsor of the John R. Lewis Voting Rights Advancement Act. \n\nThe right to vote is sacrosanct. We must be relentless in our defense of it.","date":"Wed Aug 18 19:05:36 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"Rep. Gerry Connolly said his office has opened more than 70 cases for constituents with relatives and friends stuck in Afghanistan in the SIV program trying to escape, and his aides are trying to get them into the system for processing.\"\n\nhttps://t.co/PCpNEwregC","date":"Wed Aug 18 15:11:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":".@SEEC \"has played a role in many environmental victories, such as extension of clean energy tax credits, increased funding for clean energy programs at the DoE, and the inclusion of water sustainability policy in the 2018 NDAA.\"\n\nhttps://t.co/75JBiMO4QX @citizensclimate","date":"Wed Aug 18 13:53:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you @HealthWorksNova for having me at your Herndon site today and for keeping our community safe during the pandemic. The service you provide to the medically underserved and uninsured helps improve the health and quality of life for countless individuals. https://t.co/6VfxIiJiZ9","date":"Tue Aug 17 22:24:57 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"My office is in touch with dozens of constituents worried for loved ones who are still in Afghanistan. We are all hands on deck, doing everything we can to help.\n\nIf someone you know has been affected and is in need of assistance, please don't hesitate to call at (703) 256-3071.","date":"Tue Aug 17 18:02:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"For months, @RepRaskin, @RepStephenLynch, and I have led an effort to strengthen the Afghan SIV program. \n\nMore resources. More administrative flexibility. Whole-of-government action. \n\nThose imperatives remain, and are more urgent than ever. https://t.co/Y031izpvmc","date":"Mon Aug 16 17:17:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I am devastated for the people of Haiti. Please keep them in your prayers. \n\nI’m also incredibly proud of @ffxfirerescue @VATF1 for answering the call to help. Northern Virginia, and the United States as a whole, stand ready to assist in any way we can.","date":"Sun Aug 15 23:56:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Trump &amp; Pompeo undermined the Afghan military and government by:\n\n1. Agreeing to elevate the Taliban as a legitimate entity.\n2. Agreeing to exclude Afghan government from negotiations with the Taliban. \n3. Agreeing to allied withdrawal by May 1.\n\nThis tragedy is their doing.","date":"Sun Aug 15 20:44:55 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Biden administration must use all possible means to ensure diplomatic and military personnel, as well as Afghan allies, especially our brave interpreters, are evacuated safely.","date":"Sun Aug 15 18:15:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"What we are witnessing in Afghanistan is deeply concerning. As I said in May, the situation has an eerie resemblance to the end of the Vietnam war.  (1/2)\nhttps://t.co/OfjaFIcL7k","date":"Sun Aug 15 18:15:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This report is outrageous. DeJoy and Bloom are bandits, and their conflicts of interest do nothing but harm the Postal Service and the American people. \n\nThey must be removed to restore the integrity of the USPS and #SaveThePostOffice.\n\nhttps://t.co/hIuTIv5UIq","date":"Fri Aug 13 20:36:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Climate change is not a problem for future generations to handle. It’s right here, and it’s right now. \n\nIt’s on us. \n\nhttps://t.co/Wam6EjGDpn","date":"Fri Aug 13 19:30:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today, 40 million families will wake up to a second monthly payment in their bank accounts from the expanded #ChildTaxCredit in the American Rescue Plan.\n\nElections have consequences.","date":"Fri Aug 13 14:04:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Deeply concerned for what the evacuation of our embassy in Afghanistan means for those waiting for SIV approval. We must direct all possible resources to expedite screenings and approvals to save the people who risked their lives for our troops.\n\nhttps://t.co/qBHnaQ1Kqc","date":"Fri Aug 13 13:50:10 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We'll see some of Donald Trump's tax returns, and that's a good thing. \n\nBut let's be clear: We issued this subpoena two years ago. That he was able to run out the clock and avoid accountability until he left office is not a victory for the rule of law. \n\nIt is an abject failure.","date":"Wed Aug 11 18:43:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congress is a coequal branch of government. The first branch delineated in the Constitution. \n\nWe must be able to enforce our own subpoenas.","date":"Wed Aug 11 18:43:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Bipartisan Infrastructure Deal contains $10-$13 billion for dedicated EV investments and charging infrastructure. A start, but not enough.\n\nToday, we're asking leadership to ensure the reconciliation bill fully funds the $174 billion outlined in @POTUS' American Jobs Plan. https://t.co/ChnbBV6Dj8","date":"Wed Aug 11 18:25:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We cannot combat climate change or compete in the economy of tomorrow without significant investments in electric vehicles today.","date":"Wed Aug 11 18:25:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"They had a snout all four hooves in the trough when Trump was in charge, passing a $2 trillion tax cut and overseeing a $7.8 trillion increase to the national debt in just four years. \n\nTheir newfound outrage over debt and deficits is absurd on its face.","date":"Mon Aug 09 22:03:11 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The irony in Republicans objecting to raising the debt ceiling is that most of the debt we’re being asked to account for was accumulated on Donald Trump’s watch.\n\nFor them to suddenly take a hands-off, ‘we don’t believe in debt’ posture, gives hypocrisy a bad name.","date":"Mon Aug 09 21:54:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The COVID-19 vaccines are safe, free, and they’ll keep you alive (that’s the best part). Get one.","date":"Mon Aug 09 18:49:56 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Occasional reminder that multiple stimulus checks have hit millions of your bank accounts, tax credits are hitting millions of family bank accounts each month, and not a single Republican voted to make either of those things happen.","date":"Sun Aug 08 17:01:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans are about to make a lot of noise about debt and deficits. I want you to remember two things when they start fussing:\n\n1. Their 2017 tax cuts will add $1.9 trillion in deficits by 2027. \n\n2. The national debt rose by $7.8 trillion in just four years under Donald Trump.","date":"Sat Aug 07 17:19:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"(P.S. @RepJimmyGomez has a resolution to expel her from the House. We should pass it.)","date":"Fri Aug 06 23:09:36 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"56 years ago, President Johnson signed the #VotingRightsAct into law. For 56 years, it’s been a pillar of American civil rights. But it’s under attack.\n\nThe House has passed the #ForThePeople Act. We’ll soon advance the John Lewis Voting Rights Act. \n\nThe Senate must join us.","date":"Fri Aug 06 22:17:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Louis DeJoy is a walking conflict of interest. He had no business being named Postmaster General, and he has no business continuing to serve.\n\nIt's long past time to #FireDeJoy.\n\nhttps://t.co/NznMd0UOTV","date":"Fri Aug 06 18:06:59 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Nearly a million new jobs last month. The American Rescue Plan is living up to its name.","date":"Fri Aug 06 12:45:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Don’t take medical advice from Marjorie Taylor Greene. And please don’t shoot anybody.","date":"Fri Aug 06 11:06:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Heartbroken. Please get vaccinated. \n\nhttps://t.co/hLrlb7ngx0","date":"Fri Aug 06 00:52:11 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I'll be on @DeadlineWH with @NicolleDWallace  in just a few minutes to talk 1/6 and how we're honoring the heroism of the Capitol Police. Tune in!","date":"Thu Aug 05 20:14:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It will take time to permanently close the prison at Guantanamo Bay. \n\nBut that time has come.\n\nI joined @RepAdamSchiff and 70+ of our colleagues in urging @POTUS to act immediately to achieve his goal of shutting down the Guantanamo Bay prison for good. https://t.co/FATqeIbmUa","date":"Thu Aug 05 18:10:15 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Richard Trumka rose from the ranks of mine workers to become a leader of today’s labor movement. He was a tireless advocate for social justice and a singular champion for workers. He will be missed.","date":"Thu Aug 05 16:56:24 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congratulations to Audra, Hailey, Medhnaa, and Ayonnah, #VA11's 2021 Congressional Award Gold Medalists! @theaward https://t.co/Gg0MCvl2d8","date":"Thu Aug 05 16:00:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Scott’s coverage of the January 6 insurrection will stand out in the history books. It’s been nothing less than a public service, and I want to thank him and the @nbcwashington team for it.","date":"Thu Aug 05 13:44:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Get vaccinated. Please.\n\nThis is life or death. If you won't do it to save your own life, do it to save the lives of your loved ones and neighbors — especially those who can't yet be vaccinated themselves. \n\nhttps://t.co/N1D2YzvCxf","date":"Wed Aug 04 23:19:11 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"HBD, 44! https://t.co/M3RJcmB4rW","date":"Wed Aug 04 16:56:04 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans aren't content blocking new gun safety legislation. Now, they're blocking the nomination of the guy who enforces gun laws that are *already on the books.*\n\nTheir indifference to gun violence is a privilege. And for thousands of Americans, it's a death sentence.","date":"Wed Aug 04 16:36:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thanks to the leadership of @POTUS and his team, the U.S. has shipped more than 110 million COVID-19 vaccine doses to more than 60 countries – cementing our place as the global leader in vaccine donations.\n\nWe will only get through this together. Because disease knows no borders. https://t.co/TxHULw3dQd","date":"Wed Aug 04 15:21:51 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is an important first step. \n\nI'm an original cosponsor of @RepMaxineWaters' Protecting Renters from Evictions Act. Now, Congress should pass it and protect renters through the end of the year.","date":"Tue Aug 03 22:01:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Very sad to hear about Officer Hashida. My thoughts and prayers are with his family and colleagues at MPD.","date":"Mon Aug 02 23:02:57 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"which aims at a better security against external danger and internal disorder—a better provision for national strength and individual rights than had been exemplified under any previous form.\" James Madison (2/2)","date":"Mon Aug 02 16:10:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"“We owe it to ourselves and to the world, to watch, to cherish, and as far as possible to perfect (the American political system)...(1/2)","date":"Mon Aug 02 16:10:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joining @ErinBurnett on @OutFrontCNN! https://t.co/OKWAuYQwhv","date":"Fri Jul 30 23:19:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"About to join @NicolleDWallace on MSNBC. Tune in!","date":"Fri Jul 30 20:59:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Donald Trump’s criminal enterprise can only exist in the dark. Time to turn on the lights.","date":"Fri Jul 30 17:59:36 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We must ensure the safety of the federal workforce and that of those they serve. \n\n@POTUS has led on vaccine deployment, and this action is another important step toward protecting our communities and ensuring continuity of operations across the federal workforce.","date":"Thu Jul 29 22:22:12 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"NEW: Ahead of the 20th anniversary of 9/11, the House just unanimously passed my bill to establish the September 11th  National Memorial Trail! https://t.co/tx3N6ce1Pf","date":"Thu Jul 29 21:33:37 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This Broadway-worthy performance of feigned outrage is pretty rich coming from the folks who call wearing a mask \"political theater.\"","date":"Thu Jul 29 20:01:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Just now, as we were about to vote to fund the heroes in the Capitol Police and National Guard, Republicans forced yet another vote on a motion to adjourn. \n\nThe temper tantrum continues.","date":"Thu Jul 29 19:34:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Six months into the Biden administration, poverty is cut nearly in half and the economy is back on track. \n\nLet's keep it up, @POTUS.","date":"Thu Jul 29 16:42:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans attack Dr Fauci and Dr Monahan, two leading medical experts, and instead take medical advice from the guy who told us to ingest disinfectants. Let that sink in.","date":"Thu Jul 29 02:54:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This is why we fight.","date":"Thu Jul 29 02:16:59 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans are throwing a temper tantrum on the Floor, forcing vote after vote to adjourn the whole House for the day. All because they were asked to do what the rest of the country has been asked to do: wear a mask. \n\nSnowflakes.","date":"Wed Jul 28 18:07:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Team Connolly’s pregame is underway @jmillerWFED! BYOBriefing book. https://t.co/wm9pdbWWu9","date":"Wed Jul 28 17:19:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republicans want you to distrust what you saw and heard with your own eyes and ears. \n\nDon't.","date":"Tue Jul 27 23:02:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Staying calm during committee hearings with Jim Jordan.","date":"Tue Jul 27 17:05:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"GOP leadership is once again gaslighting on the front steps of the U.S. Capitol. They are now actively aiding and abetting Trump’s big lie. Their politically convenient amnesia and failure to defend our democracy will be judged harshly by history.","date":"Tue Jul 27 14:06:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Senate Republicans, last Wednesday: We'll be ready to take up this bill on Monday.\n\nSenate Republicans, Monday:","date":"Mon Jul 26 14:56:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today, on the 31st anniversary of the Americans with Disabilities Act, we celebrate the empowerment of the 55 million Americans who live with a disability.\n\nThe ADA reminds us that no matter how hard it gets, a fairer, more equitable America is always worth fighting for.","date":"Mon Jul 26 13:56:58 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Gun violence is a public health crisis, and it’s high time we treated it like one.","date":"Fri Jul 23 22:04:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Currently hosting a roundtable discussion with stakeholders from VA-11 on how we must better treat and invest in mental health as we emerge from this pandemic. Tune in on Facebook! https://t.co/f9Dx0HS3m5","date":"Fri Jul 23 17:55:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🙋🏻‍♂️","date":"Fri Jul 23 14:13:30 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Over the past 18 months, we've worked tirelessly to ensure our community is equipped to beat and recover from COVID-19. \n\nCheck out my latest update on the federal assistance we've secured for Virginia's 11th District -- all $1.1 BILLION of it: https://t.co/cNwE7jvyUi https://t.co/iLdW0ukXrq","date":"Thu Jul 22 20:00:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Americans across the country are feeling the impact of the passport backlog at the State Department. \n\nToday, we introduced the Passport Backlog Elimination Act to reduce the backlog ASAP and ensure quick, dependable service for our constituents.\n\nhttps://t.co/5Dbcq3e1VH https://t.co/YEovJO5Ae4","date":"Thu Jul 22 14:53:10 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"When you sleep with dogs, you’re bound to wake up with fleas.\n\nhttps://t.co/ALgLY1acAQ","date":"Wed Jul 21 20:09:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"If House Republicans want to play a role in investigating the insurrection, they can start by apologizing for the role they played in inciting it.\n\nAnything else is pure gaslighting.","date":"Wed Jul 21 18:28:48 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Speaker was right to reject Jim Jordan's nomination. Believe me, he doesn't belong within a mile of any serious inquiry into the attack on the Capitol. \n\nHe and @GOPLeader can spare us the indignation. @HouseDemocrats don't take lectures from enablers of violent insurrection.","date":"Wed Jul 21 18:02:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"In America, there are more than 5.5 million military and veteran caregivers just like me, and we are drowning.\"\n\nIt's time we cared for the caregivers, like Colleen. \n\nWe can start by passing my Military and Veteran Caregiver Student Debt Relief Act.\n\nhttps://t.co/l8octESjwL","date":"Wed Jul 21 17:08:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"https://t.co/N1D2YzvCxf","date":"Wed Jul 21 12:55:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It’s deja vu from October 2020 when the Postal Service Office of Inspector General said the same thing. \n\n#FireDeJoy https://t.co/9efaILCTo9","date":"Tue Jul 20 22:05:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today’s Postal Regulatory Commission advisory opinion on Louis DeJoy’s deterioration of delivery service standards at the Postal Service once again proves that DeJoy fails to consider the consequences of his actions and cares nothing about the Postal Service or its customers. https://t.co/PKExRihvXR","date":"Tue Jul 20 22:05:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thanks to a Supreme Court decision in April, consumers have been left out in the cold. \n\nToday, I’m supporting legislation on the House floor that will restore @FTC’s power to return money to defrauded consumers.\n\n#ProtectConsumers. https://t.co/jTaxe8Vq0n","date":"Tue Jul 20 21:04:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Eid Mubarak to all celebrating #EidAlAdha in VA-11 and across the country!","date":"Tue Jul 20 18:04:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The COVID-19 vaccines are safe, they're available, and they'll keep you alive. \n\nDon't wait: https://t.co/N1D2YzvCxf. https://t.co/uVcfe89MDz","date":"Tue Jul 20 14:48:39 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thousands of Afghans risked their lives to help US troops over the last 20 years. Now, it's time for us to help them.\n\nThis announcement, along with consideration of the Allies Act in the House later this week, is a welcome step. But many more still need our help.","date":"Mon Jul 19 22:04:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Attended tonight’s Good Trouble Vigil in honor of the life of John Lewis who we lost a year ago today. We must ensure his lifelong work continues by passing both the John Lewis Voting Rights Advancement Act &amp; the For the People Act through Congress! https://t.co/Zej5TdqIBz","date":"Sun Jul 18 00:47:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"DACA is not enough, we must be proactive in ensuring we create a safe and protected environment for those in our immigrant communities. Congress must pass comprehensive immigration reform with a pathway to citizenship for Dreamers, TPS holders, and essential workers.","date":"Sat Jul 17 22:43:36 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Celebrating the life of a dedicated lifelong community activist, my friend, Albert E. Brooks Sr. Thank you for all that you did for Prince William County, you will deeply be missed. https://t.co/MjuG3zIZlV","date":"Sat Jul 17 20:40:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Across the country, our schools need rebuilding. Across the globe, our climate needs saving.\n\nWe can do both.\n\nProud to stand with @RepBowman as an original cosponsor of the Green New Deal for Public Schools.","date":"Fri Jul 16 18:27:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The American Rescue Plan's #ChildTaxCredit is one of the largest single-year tax cuts for families with children in history. \n\nTens of millions of families, covering nearly 60 million children, will see the first payment hit their bank accounts TODAY! \n\nhttps://t.co/t4paTMf14q https://t.co/boEuxVAkRf","date":"Thu Jul 15 15:48:20 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"A Democratic Governor and Democratic legislature produce the best state in the union in which to do business. My my my. \n\nhttps://t.co/pibhWcNu5G","date":"Wed Jul 14 00:55:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Great joining Mayor Woods and visiting @DumfriesTownVA this morning! Looking forward to our continued partnership between local and federal government. https://t.co/Wk8vEii4M4","date":"Tue Jul 13 16:14:25 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Raise your hand if you're ready to cut child poverty in half!🙋‍♂️🙋‍♂️🙋‍♂️ \n\nOn July 15, millions of families will start receiving monthly deposits right into their bank accounts from the expanded #ChildTaxCredit. \n\nhttps://t.co/Asb1d0fRqo","date":"Mon Jul 12 16:17:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We know that the hyper-contagious Delta variant has taken over, accounting for more than half of all new US infections. \n\nAnd we know that last month, 99.2% of COVID deaths in the US were unvaccinated people.\n\nVaccines are saving lives daily. Don’t wait: https://t.co/azyWivJDwz.","date":"Fri Jul 09 15:09:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Elections have consequences. Life or death ones.","date":"Fri Jul 09 00:09:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"A vote against the American Rescue Plan was a vote against funding for local law enforcement and first responders. No two ways about it.","date":"Thu Jul 08 14:54:01 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Record-breaking heat waves. Larger and longer wildfire seasons. Droughts, floods, and increasingly frequent hurricanes. \n\nWe can no longer hold off until tomorrow. The climate crisis is here today.","date":"Wed Jul 07 19:56:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Despicable as usual. Clean up your mess, @GOPLeader.","date":"Wed Jul 07 16:50:55 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Reminder that it’s voting rights or the filibuster, and the choice couldn’t be easier.","date":"Wed Jul 07 14:18:58 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Families, mark July 15 on your calendar! \n\nYou will receive monthly payments (via direct deposit or mail) up to $250/child between the ages of 6-17 or up to $300/child under the age of 6.\n\nFind out more at https://t.co/t4paTMf14q, and retweet to spread the word! 🔁💵","date":"Tue Jul 06 23:53:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Even after 500+ arrests and pleas for action from police officers, most congressional Republicans voted against the formation of a select committee.","date":"Tue Jul 06 22:38:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The full story of what occurred on January 6 and who exactly was involved will come to light. It will be recorded in history.\n\nMost congressional Republicans will be recorded as cowards at best, or complicit at worst.","date":"Tue Jul 06 22:38:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Even after the insurrection, most congressional Republicans voted to decertify the election.","date":"Tue Jul 06 22:38:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Even after a bipartisan commission was negotiated and agreed to, most congressional Republicans voted to block its creation — and they succeeded.","date":"Tue Jul 06 22:38:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I'm not sure \"hopefully our state doesn't receive more emergency assistance to help us recover from a global crisis\" is what people want to hear from their senator.","date":"Tue Jul 06 19:32:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I will not mince words about that nightmare. The siege of the US Capitol was an act of violent insurrection against a coequal branch of the federal government, incited by a president desperate for power and incapable of coping with perceived humiliation or defeat.","date":"Tue Jul 06 15:31:48 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"With our own eyes, we saw Trump whip a crowd of his supporters into a frenzy and urge them to march to the Capitol. With our own ears, we heard Rudy Giuliani tell them to engage in a \"trial by combat.\" \n\nThe mob was given orders, and the world watched as they carried them out.","date":"Tue Jul 06 15:31:48 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"There’s no question that Donald J. Trump lit this flame. \n\nBut, as we reflect on that wretched day six months later,  never forget that it was Republicans in Congress who handed him the match.","date":"Tue Jul 06 15:31:48 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We were evacuated from the Chamber as the mob smashed through the windows and attempted to break down the doors at the main entrance to the floor -- the same doors presidents are ushered through to deliver State of the Union addresses.","date":"Tue Jul 06 15:31:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As we left for a secure location through the Speaker's Lobby, I turned and saw another makeshift barricade had been erected. I looked up and through smashed glass saw a second faction of the mob attempting to force their way onto the floor from the front of the Chamber.","date":"Tue Jul 06 15:31:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Tragically, a rioter pushing her way through that same broken window was shot and killed several moments later.","date":"Tue Jul 06 15:31:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Speaker Pelosi and others were rushed off the floor while the Sergeant at Arms locked the chamber doors and instructed members to don the gas masks kept under our seats in case of a chemical attack. With weapons drawn, Capitol Police used furniture to barricade the doors.","date":"Tue Jul 06 15:31:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"On Wednesday, January 6 I arrived at the Capitol for the counting of the Electoral College votes. I was on the House floor when the building was breached and the House Chamber was placed into lockdown.","date":"Tue Jul 06 15:31:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Kicking off the fireworks in Fairfax city. Great to see so many friends. Happy 4th of July! https://t.co/WyJyOCXQnY","date":"Mon Jul 05 01:30:38 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy Fourth of July! 🇺🇸🇺🇸🇺🇸\n\nToday, as we celebrate America, let’s rededicate ourselves to living up to our founding ideals and becoming the free and fair country we’re meant to be.","date":"Sun Jul 04 13:11:25 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you Fairfax City and Dale City for both hosting wonderful Fourth of July parades in the 11th District! 🇺🇸 https://t.co/1t36ikcEzP","date":"Sat Jul 03 17:03:37 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"So thrilled to be back at @Wolf_Trap tonight! And so grateful for the vaccines that made it possible. Get those shots, folks! https://t.co/YwqNsLeOuo","date":"Fri Jul 02 00:19:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Virginia’s ban on the death penalty went into effect today. A good day for progress in America.","date":"Thu Jul 01 23:43:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Please take a moment to read this piece by my friend @EnesKanter. I’ve met with Enes, and he is absolutely right. \n\nThese kidnappings, including that of Orhan Inandi, are unacceptable. It must stop. \n\nhttps://t.co/AqJeeZFQXT","date":"Thu Jul 01 18:07:38 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"And you, @GOPLeader, are closer to the insurrectionist mob than patriotic Americans.","date":"Thu Jul 01 15:59:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Republican Party will not rest until the Voting Rights Act is completely decimated.\n\nOur democracy is in peril. We need the For the People Act and the John Lewis Voting Rights Act, and we need them now.","date":"Thu Jul 01 14:32:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"NEW: I just reintroduced the Cameras in the Courtroom Act to televise proceedings before the Supreme Court. \n\nOur nation’s highest court is not some mystical priesthood that can operate outside of the public view. It must be accountable and transparent.\n\nhttps://t.co/HNdWz9Wupp","date":"Wed Jun 30 17:28:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"ICYMI: Last night, the House passed the Global Health Security Act!\n\nI wrote this bill with @RepSteveChabot because disease knows no borders. The United States can begin saving lives from the next global pandemic by investing in early preparedness.\n\nhttps://t.co/hd8Hm6xDaC","date":"Tue Jun 29 20:09:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Proud to join this effort with @RepSylviaGarcia. Our civilian partners in Afghanistan stood by us when we needed them most. We owe them the same.","date":"Tue Jun 29 19:55:11 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thanks for the Green New Hat, @AOC! This is one cap that won’t be traded. https://t.co/ajd7Cm0a2g","date":"Tue Jun 29 16:46:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Article I specifically delegates war powers authority to the most direct representatives of the American people -- the US Congress. It's high time we act like it. \n\nCongress must reclaim our right to authorize any strike, ordered by any president. The Constitution demands it.","date":"Tue Jun 29 14:54:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"60 years ago Freedom Riders fought for the rights of Black Americans to vote. I’m proud to stand with @BlackVotersMtr today in D.C. for #FreedomRide2021. We will continue to protect voting rights, fight for D.C. Statehood, and ensure our democracy represents ALL. https://t.co/9psCxBkhXJ","date":"Sat Jun 26 19:04:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"GOP senators, in search of any excuse to block the entire Democratic legislative agenda, are feigning outrage over Biden pledge to do more than one thing during his presidency.\n\nThere, I fixed it.","date":"Fri Jun 25 20:39:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Passed ✅","date":"Fri Jun 25 14:54:25 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"There are currently no protections in place to limit dangerous methane pollution from the oil and gas sector. Donald Trump gutted them.\n\nThat changes today. The House is about to vote to restore the robust standards of the Obama-era 🌎","date":"Fri Jun 25 14:12:06 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Here's your occasional reminder that the American Rescue Plan has been projected to cut child poverty in half, and not a single Republican voted for it.\n\nMonthly payments begin next month for nearly all working families. Learn more: https://t.co/RDxpVmwq4d. https://t.co/mHCaF2U4Yy","date":"Fri Jun 25 13:24:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Delta variant is ~60% more transmissible than what we’re used to, and it could be twice as likely to put you in the hospital.\n\nBottom line: unvaccinated individuals are at significant risk of catching this variant and getting severely sick.\n\nPlease, folks, get your shot(s).","date":"Thu Jun 24 23:45:47 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"@daveadler10 @TravelGov Dave, please contact our District Office at 703-256-3071 and we can look into this - staff","date":"Thu Jun 24 21:36:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"My Republican colleagues can try as hard as they'd like to keep the truth hidden, but we will not be deterred. \n\nHouse Democrats will get to the bottom of what happened on January 6 and ensure it can never happen again.","date":"Thu Jun 24 18:47:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Excellent hearing this morning with @NATOPApress and the @HouseForeign Subcommittee on Europe, Energy, the Environment, and Cyber. \n\nThanks to all our witnesses for their insight and expertise, and thank you to Chairman @USRepKeating for holding this important hearing.","date":"Thu Jun 24 16:14:25 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"The U.S. economy grew at a solid 6.4% rate in the first three months of this year, setting the stage for what economists are forecasting could be the strongest year for the economy in possibly seven decades.\"\n\nhttps://t.co/zkOvRvndQP","date":"Thu Jun 24 14:31:51 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"There is currently a severe shortage of donated blood throughout the US, according to the @RedCross. My wife Smitty just stopped by @InovaHealth to donate — and you can too! \n\nHead to https://t.co/TZRnzz1o0D or https://t.co/EmEf7LUHvq to find a time to donate. https://t.co/mKxVyEPZUV","date":"Wed Jun 23 23:38:37 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Unemployment is down. \nInfections are down. \nHospitalizations are down.\nDeaths are down.\n\nVaccines are up.\nPersonal incomes are up.\nJob growth is up.\n\nIf you wonder why the GOP is so hellbent on suppressing the vote, it's because they can't win on the merits. \n\nAnd they know it.","date":"Wed Jun 23 19:33:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"With this vote against the #ForThePeople Act, Senate Republicans have made it official:\n\nVoter suppression and disenfranchisement aren't bugs in the GOP playbook. They're features.","date":"Tue Jun 22 23:01:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The #GlobalGagRule decreases health service access worldwide, impacting millions. As the world’s largest bilateral global health &amp; family planning donor, the US should build on health &amp; human rights progress—not stand in the way. We must #EndGagNow.","date":"Tue Jun 22 17:05:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joining @narfehq for their #NARFECentennial virtual celebration! Thank you for all that you have contributed and will continue to do to protect current and retired federal employees. https://t.co/K01QJdkE8E","date":"Mon Jun 21 23:26:41 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Col. Yevgeny Vindman is a true patriot who, with much personal sacrifice, has served his country honorably and honestly. I was honored to attend his promotion ceremony with @timkaine today.\n\nBoth @YVindman and @AVindman are American heroes. We owe them our gratitude. https://t.co/7sEeBiBp57","date":"Mon Jun 21 20:14:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨🚨🚨 The American Rescue Plan is STILL paying off. \n\nBeginning July 15, the expanded #ChildTaxCredit will put money in the pockets of 40 million families. Even if you didn't file taxes this year, it's not too late to qualify! \n\nLearn more at https://t.co/7dfhNXqjSc.","date":"Mon Jun 21 18:17:15 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy Father’s Day!","date":"Sun Jun 20 20:45:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Honored to join First Baptist Church in Vienna to celebrate and reflect on Juneteenth. Recognizing this federal holiday is a start, but we have so far to go. This is a moment of truth in our country, and I’m confident that we can rise to meet this moment of truth. https://t.co/uu0ttkrkqi","date":"Sat Jun 19 17:24:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This #Juneteenth, we remember those who have paid the ultimate price fighting for their freedom.\n \nAnd we honor them by continuing the fight for justice and true equality.","date":"Sat Jun 19 12:02:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thanks to @KennyBoddye @ssurovell and Sup Angry for hosting tonight's PWC Future of Transit town hall. Traffic affects all our lives in Northern Virginia. We have to create options for people, and transit must be a part that. https://t.co/ltprGsfeRq","date":"Thu Jun 17 22:42:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"After 11 years of Republican attempts to rip away your health care, the ACA is here to stay!","date":"Thu Jun 17 14:16:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I'm sickened by this. This kind of hate has absolutely no place in our community.","date":"Thu Jun 17 14:10:56 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"There is no more profound responsibility given to the Congress than to send our young men and women into combat. That power lies with us for a reason, and its high time we reclaim it. \n\nThat starts with repealing the 2002 AUMF. https://t.co/qatRGbipeu","date":"Thu Jun 17 14:00:59 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Yesterday 21 Republicans voted against giving the USCP the Congressional Gold Medal for their service during the insurrection.\n \nToday 14 Republicans voted against Juneteenth.\n \nTheir excuses are pathetic and delusional. Two very shameful days for the GOP. History wont forget","date":"Thu Jun 17 00:56:09 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Make #Juneteenth a federal holiday: ✅","date":"Wed Jun 16 23:55:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Yesterday, 21 Republicans voted against awarding the Congressional Gold Medal to the heroic police officers who may very well have saved their lives on January 6.\n\nNot very \"Back the Blue\" of you, @HouseGOP. https://t.co/QHMieZ9snX","date":"Wed Jun 16 17:52:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I'll spare everyone and leave the musical rendition to you, @RandyRainbow.","date":"Tue Jun 15 20:56:05 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"If you just listened to my Republican colleagues at today's hearing, you'd never know there was a violent insurrection at the Capitol. \n\nA certain song from the musical Chicago comes to mind...\n\n\"Give 'em the old razzle dazzle...how can they hear the truth above the roar?\"","date":"Tue Jun 15 20:55:04 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Victims of anti-LGBTQ violence are often invisible to the rest of the world because of who they are or who they love. We need quality data showing where, how, why, and to whom this violence is happening in so we can save LGBTQ lives. \n\nWe need the LGBTQ #EssentialDataAct.","date":"Tue Jun 15 20:30:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"In my view, caregivers deserve one of the highest places in heaven. They are unsung heroes, working long hours with little relief. \n\nWe can change that. \n\nLearn more about my Military and Veteran Caregiver Student Loan Relief Act from @LauraGellerTV:\n\nhttps://t.co/zxtFZHkoe3","date":"Tue Jun 15 19:26:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Dr. Fauci is a physician, a model public servant, and a world-renowned expert in infectious diseases. \n\nMarjorie Taylor Greene openly doesn't believe in evolution.\n\nI'll stick with Dr. Fauci, thanks.","date":"Tue Jun 15 18:19:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"So glad I got a chance to stop by @CASAforall’s Fast for Freedom event this evening. \n\nProud to stand with them in support of a pathway to citizenship for Dreamers and a welcoming America for ALL. https://t.co/FC46cChl8r","date":"Mon Jun 14 22:52:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Joining the @gmfus #BrusselsForum this morning. \n\nWe are in the midst of a contest of values between democracies and autocracies. As President of the NATO PA, I'm committed to efforts to rededicate NATO to its democratic foundations and make democratic resilience a top priority. https://t.co/k7BE0zGW3i","date":"Mon Jun 14 13:50:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It's been five years since Pulse. Five years since we lost 49 people in the deadliest attack on the LGBTQ+ community in American history. \n\nWe honor and remember them today. And we fight for them always.","date":"Sat Jun 12 20:38:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Elections have consequences. Thank you @VP and @SecondGentleman!","date":"Sat Jun 12 20:30:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today I joined @AlexWitt to preview President Biden's meeting with Vladimir Putin. Frankly, the words used by Putin to describe Trump could have come out of a lot of mouths of Republican enablers in the Republican Congress. @MSNBC","date":"Sat Jun 12 18:42:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Proud to join @RepJayapal on this letter urging the DOJ to to immediately implement a set of reforms that undo the Trump Administration’s cruel attacks on immigrants and restore the foundational principles of justice, fairness, and transparency to the immigration system.","date":"Fri Jun 11 14:17:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Visited Main Street Child Development Center this morning. Because of the CARES Act they were able to maintain ALL their staff. Emerging from this pandemic we must create a more equal system through childcare investments, and in the American Rescue Plan we did just that. https://t.co/DPrUpHDQK6","date":"Thu Jun 10 15:12:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Let's get something straight. \n\nThe fact that people survive off of unemployment insurance is not an argument for lower unemployment insurance. \n\nIt's an argument for a higher wages.","date":"Thu Jun 10 14:36:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We will only beat COVID-19 together, as a global community. Because viruses don’t respect borders. \n\nThis decision by @POTUS will greatly bolster worldwide vaccination efforts and reassure our allies that the United States is willing to help.","date":"Wed Jun 09 20:10:38 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Well, my staff is never going to let me live this one down. Thanks, @JimmyFallon.\n\nAlso this mean I can tell people I've been on @FallonTonight, right? https://t.co/CIRViOKsiR","date":"Wed Jun 09 16:02:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As we saw all too clearly on January 6, democracy is too precious, and too fragile, to be taken for granted. \n\nI’m leading an effort to anchor our commitment to democracy by establishing a new Center for Democratic Resilience within NATO headquarters.\n\nhttps://t.co/OjhpXbxAi7","date":"Tue Jun 08 22:03:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Great to speak with @IJasonAlexander, @missmayalynne, @caterinatweets and others from the @TheCreativeC about the importance of federal funding for the arts. \n\nArt is more than entertainment. It's fundamental to the human experience, and must be supported for generations to come. https://t.co/EyZJzPg9QE","date":"Tue Jun 08 19:27:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thanks to @POTUS' leadership, the 7-day average of U.S. COVID cases has dropped by a whopping 94% since January, hitting its lowest point since March of last year. \n\nWe can beat this, folks. But it'll take all of us doing our part &amp; getting our vaccines.\n\nhttps://t.co/MoY2jaL8il","date":"Tue Jun 08 18:15:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Why am I co-sponsoring the Women's Health Protection Act?\n\n Because 24 states could immediately prohibit abortion entirely if Roe v. Wade were to be overturned.\n\nIt’s time for Congress to intervene. We must #ActForAbortionAccess.","date":"Tue Jun 08 17:20:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"On this #WorldOceanDay, I'm committed to Ocean Climate Action. Protecting our oceans will preserve America's beauty, ensure healthier communities, and help protect Americans from the Climate Crisis. https://t.co/CrIlbGYIlN","date":"Tue Jun 08 16:21:39 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thrilled to welcome @NATO Secretary General Jens Stoltenberg to the Capitol this morning.\n\nAs President of the NATO Parliamentary Assembly, and on behalf of the US Congress, I am proud to reaffirm our unwavering commitment to the transatlantic Alliance. https://t.co/a8QbS56qtI","date":"Tue Jun 08 14:11:20 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"With millions of data points floating around online on every individual, the federal government must reconsider how it makes a fair and complete assessment of security clearance applicants. \n\nMy piece in @FCWnow: \n\nhttps://t.co/SBGV7P3JF5","date":"Mon Jun 07 17:07:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Between the crazy quilt of state and local drug laws, higher rates of social media usage, and the structural racism built into the security clearance process, it's becoming impossible to recruit and hire the next generation of our national security workforce.","date":"Mon Jun 07 17:07:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Preserving the filibuster at the expense of voting rights legislation will not facilitate bipartisanship. \n\nIt will only embolden the enemies of bipartisanship — those who would rather rig the rules in their favor than reach out in good faith across the aisle.","date":"Mon Jun 07 13:18:12 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Exploring Monticello for a late birthday present. https://t.co/kJrC8SGJ96","date":"Sat Jun 05 20:58:40 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Ethical and now legal clouds hang over Postmaster DeJoy. The investigation must proceed unimpeded, but DeJoy should be fired. This is why he should not have been hired by the Board of Governors in the first place. Where was the due diligence?","date":"Thu Jun 03 20:37:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today's announcement by the White House to distribute vaccine to our global partners is an important step towards beating the coronavirus. Like @tedlieu and I said last month, the US must provide bold leadership on this. \n\nhttps://t.co/4odF5rUmiK","date":"Thu Jun 03 15:38:11 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As we start #PrideMonth we must rededicate ourselves to full equality. \n\nYou know what would be a good step in that effort? If the Senate would pass the Equality Act.\n\nLets get it done.   \n\n#LoveIsLove","date":"Tue Jun 01 15:25:30 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Democrats in the US Senate must protect the integrity of the ballot by waiving the filibuster for any and all voting rights bills. We must reverse this election steal now!","date":"Tue Jun 01 01:42:43 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Nothing is more sacred in a democracy than the unfettered right to vote. In GOP controlled states that right is under clear and deliberate assault.","date":"Tue Jun 01 01:42:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Former US General, former NSC advisor calls for violent overthrow of US government before a cheering QAnon audience. It’s Memorial Day in which we honor fallen heroes who died for that government. Flynn is inciting violence and must be stopped. \n\nhttps://t.co/Z3yVtus1ja","date":"Mon May 31 20:05:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Glad to be back for “ViVa!Vienna!” after a long year off! Thank you to the @TownofViennaVA for hosting a great #MemorialDay event again! https://t.co/aAq2Vq8Hw8","date":"Mon May 31 17:40:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Spent the morning with VFW Post 8469 and American Legion Post 177 for their  #MemorialDay programs. Honoring the brave men and women who have sacrificed serving our country by reading their names in remembrance. Let us never forget what they gave. https://t.co/8DqFbhMh4Q","date":"Mon May 31 16:09:09 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Hypocrisy is the tribute which Vice pays to Virtue—Justice Louis Brandeis","date":"Sun May 30 18:14:43 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The commission should identify the individuals and organizations who plotted or were involved in those violent acts and make recommendations to prevent such an attack from ever recurring.","date":"Sat May 29 12:14:38 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"In light of the GOP’s cowardly filibuster of a bipartisan Jan 6th commission I urge President Biden to form and appoint a Presidential Commission to fully investigate the insurrection of January 6th at the US Capitol.","date":"Sat May 29 12:13:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Biden’s budget is great progress towards the goal of competitive compensation for feds and a clear recognition of their work during the pandemic. If we’re going to recruit the next gen of public servants and be competitive with the private sector, Congress must pass the FAIR Act.","date":"Fri May 28 22:21:28 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The recent rise in antisemitic attacks is beyond alarming and warrants immediate action. Proud to join this effort urging the President to fight such bigotry and hate with all we've got.","date":"Fri May 28 21:08:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thrilled and honored to join my friend, and former boss, @POTUS in Alexandria today! https://t.co/K15wTHejlC","date":"Fri May 28 18:47:01 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thrilled to welcome @CACIIntl to their new headquarters in Virginia’s 11th Congressional District! Their innovative approach to national security keeps us all safe and assures our nation stays a step ahead of international competition. https://t.co/XWrUMSp8y8","date":"Thu May 27 15:00:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Every single member of the @SenateGOP owes Ms. Sicknick an explanation for their refusal to investigate how and why her son was killed as he fought to save their lives.","date":"Wed May 26 16:08:52 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy Independence Day to the people of Georgia! The last 30 years have demonstrated their commitment to freedom and democracy, and I am proud to support their continued efforts towards these noble goals. @GeorgianEmbassy","date":"Wed May 26 13:53:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"He was the go-to congressional contact to get things done when I was Fairfax County Chairman during the BRAC process  and resisted extremist elements In his own party. He is missed.","date":"Wed May 26 11:56:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Saddened to learn of the passing of former Senator John Warner. He was a Gentleman who maintained civility in his politics in an era of rising intolerance.","date":"Wed May 26 11:55:36 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Marjorie Taylor Greene has left a stain on the House of Representatives that will only darken with each day she remains a member.\n\nShe should have been expelled months ago. And she should be expelled today.","date":"Tue May 25 18:14:12 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"George Floyd should be alive. It's no less true today than it was a year ago.\n\nBut while his killer has faced justice, the system that allowed for his death remains largely unchanged. \n\nThe #JusticeInPolicing Act bears George Floyd's name. The Senate should pass it in his honor.","date":"Tue May 25 16:07:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Same question, @GOPLeader.","date":"Tue May 25 15:25:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Are you planning on doing anything about @RepMTG, or should we just expect empty words from the new chair of the Republican Conference going forward?","date":"Tue May 25 15:23:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Communities across the U.S. suffered 22 separate weather/climate disasters last year, costing a total of $100 billion.\n\nToday, as part of his government-wide response to climate change, @POTUS taking action before disaster strikes with a $1 billion investment in preparedness. https://t.co/TDoSS9VTxT","date":"Mon May 24 15:52:39 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The cultural barriers to telework in the federal government have essentially collapsed with the pandemic, and future generations expect it. Covid-19 showed its a critical tool to continuity of operations. \n\n@Reinlwapo\n@washingtonpost\nhttps://t.co/mGlaFXNE76","date":"Mon May 24 12:40:40 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Pleased to have attended the inaugural ceremony of Global Leaders of Fairfax County. Speaking to the next generation about the importance of foreign policy, diplomacy, and the need to uphold democratic values. https://t.co/5y1bVq1akq","date":"Sun May 23 18:50:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Held my 13th annual reception to honor the exceptional young women and men who will be entering our nation’s service academies from Virginia’s 11th Congressional district. Congratulations to Class of 2025! We are all so proud of you and your accomplishments. https://t.co/GQEUDJG0tI","date":"Sat May 22 16:25:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"After Heather Heyer was killed, Donald Trump lauded the “very fine people on both sides” of the horror in Charlottesville that led to her death.\n\nToday, her mother looked on as @POTUS signed anti-hate crime legislation inspired by Heather’s life and named in her honor.","date":"Fri May 21 01:28:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Minority \"Leader\" Kevin McCarthy's recent behavior is among the most depraved I've ever seen from a member of leadership in the United States Congress. His subservience to Donald Trump is enough to make a jellyfish look vertebrate. https://t.co/w7D6KhTp8A","date":"Thu May 20 23:31:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It was great joining @lewisacademynow this evening for their “See it, Be it!” series! Had the chance to speak to our diverse community on how we can form a more equitable path forward. We can all follow the footsteps of the late-great John Lewis and be brave, bold, and inspiring. https://t.co/HLznFXDAWE","date":"Thu May 20 22:57:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I was proud to cosponsor the COVID-19 Hate Crimes Act, and I’m thrilled @POTUS has signed it into law.\n\nAs he said today, hate can be given no safe harbor in America. We can and must #StopAsianHate","date":"Thu May 20 20:26:40 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"In case you forgot👇","date":"Thu May 20 13:32:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The issues underlying the Israeli-Palestinian conflict demand attention. \n\nBut a ceasefire comes first. \n\nYesterday, we led 138 House Democrats in calling on @POTUS to take decisive action to immediately end the violence in Israel and Gaza.\n\nhttps://t.co/aGMZdTwtzp https://t.co/4Fqq9dj0TB","date":"Thu May 20 12:52:39 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Prince William County reported 16 new cases yesterday. In Fairfax County, there were just 11.\n\nVaccines work, folks. Let’s keep it up.","date":"Wed May 19 10:40:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Pass the COVID-19 Hate Crimes Act to help #StopAsianHate: ✅","date":"Tue May 18 20:40:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We must honor the promise made to Afghans and Iraqis who supported U.S. troops in conflict zones. We must dedicate resources and manpower to get these individuals immediately out of harm’s way and ensure no one left behind. \n\nGlad @HouseForeign raised this critical issue today.","date":"Tue May 18 17:36:23 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Reproductive rights are human rights and abortion is health care.\n\nThat’s all.","date":"Mon May 17 17:22:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Even if you don’t normally file taxes or were laid off during the pandemic, make sure to file your taxes for free TODAY to secure your new monthly #ChildTaxCredit payments from the American Rescue Plan! \n\nhttps://t.co/AQ6iwhYfDl https://t.co/n4uLMcOf64","date":"Mon May 17 16:27:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Pandemics know no borders, and international cooperation is critical to beating #COVID19. \n\nTaiwan must have a seat at the table within bodies like the World Health Organization and the United Nations.","date":"Mon May 17 15:05:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It is of the utmost necessity that an immediate ceasefire be put in place and further bloodshed averted. The alternative is an unfolding human tragedy of unimaginable dimensions.  \n\nLong-deferred issues demand attention, but a ceasefire comes first.","date":"Sun May 16 23:27:25 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"House Democrats Issue Joint Statement Calling for an Immediate Ceasefire.\n\n@RepDavidEPrice\n@PeterWelch\n@RepJohnYarmuth\n@janschakowsky\n@RepBarbaraLee\n@RepLloydDoggett\n@RepLowenthal\n\nhttps://t.co/lyM5V7ioay https://t.co/oa6N3RfDPB","date":"Sun May 16 23:24:11 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Just bumping this, @RepMattGaetz.","date":"Sat May 15 00:05:09 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The @GeorgeMasonU School of Nursing and the Mason and Partner (MAP) Clinics are doing some incredible work. They've vaccinated more than 22,305 NoVa residents this year, and they're not finished yet.\n\nThank you from a very grateful community!\n\nhttps://t.co/OxYIHFDcMx","date":"Fri May 14 16:42:29 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The continued perpetuation of President Trump’s Big Lie by @Rep_Clyde and @RepGosar is a new low for the Republican Party. \n\nCongressional staff, the press corps, and members of Congress witnessed firsthand the violence and mayhem wrought by insurrectionists -- not tourists.","date":"Fri May 14 14:25:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Republican leadership, especially @GOPLeader McCarthy, must stand up, stop the madness in their Party, and condemn this dangerous revisionist rhetoric. \n\nTheir failure to do so prior to the January 6 insurrection led to the deaths of 7 individuals. Enough.","date":"Fri May 14 14:25:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thankfully, we have new leadership driven by science and committed to public service. On Day One, the Biden administration put in place common-sense practices, like face masks, to protect returning workers.","date":"Fri May 14 13:55:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"But this report is a clarion call for Congress to act. We must pass the Chai Suthammanont Remembrance Act, my legislation to ensure federal employees are protected during this and future pandemics. \n\nhttps://t.co/VQseRbnzSt","date":"Fri May 14 13:55:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Among other findings, the OIG discovered that in a majority of cases they reviewed, they found NO evidence that employees were notified of potential COVID exposure.\n\nFurther, OPM management during the Trump administration did not require workers to wear face coverings.","date":"Fri May 14 13:55:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This OPM IG report, issued in response to a request from my office, is a stunning indictment of the Trump administration’s reckless, rushed, and ultimately dangerous plans to return federal employees to the workplace in the middle of the pandemic.\n\nhttps://t.co/dvXU2Ecf9t","date":"Fri May 14 13:55:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Eid Mubarak to all of my Muslim constituents and Muslims around the world who have been celebrating the holy month of Ramadan. I hope you enjoy this wonderful occasion surrounded by your loved ones! #EidAlFitr","date":"Thu May 13 21:02:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Get those vaccines, folks!","date":"Thu May 13 20:58:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The #IAmVanessaGuillen Act would overhaul the military’s response to reports of sexual harassment &amp; assault, and provide survivors with some long-overdue justice and support. Proud to join my friend @RepSpeier and so many of our colleagues in introducing this vital legislation.","date":"Thu May 13 19:40:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The American Rescue Plan is putting shots in arms, money in pockets, children in school, and people in jobs. \n\nAnd we're just getting started.","date":"Thu May 13 16:09:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Families will get their expanded Child Tax Credit when they file their 2021 tax return, so be sure to file your taxes *BY MAY 17.*\n\nEven if you lost your job or normally wouldn't file taxes, please be sure to file this year!","date":"Thu May 13 16:09:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"What does that mean for Northern Virginia? Well, here in #VA11:\n\n▪️ 122,400 children -- 63.4% of all kids in the district -- will gain from the expanded Child Tax Credit.\n\n▪️ 38,000 households will see an average benefit of $2,600.","date":"Thu May 13 16:09:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨 More help from the #AmericanRescuePlan is on the way 🚨 \n\nThe ARP expanded and authorized advance monthly payments of the #ChildTaxCredit, and the IRS could begin sending out monthly payments of up to $300 per child as soon as July.","date":"Thu May 13 16:09:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"▪️ Families with kids in poverty will receive $4,200 on average.\n\n▪️ 7,700 kids will be lifted out of poverty, including 2,700 kids under the age of 6.\n\n▪️ 2,200 children will be lifted out of deep poverty.","date":"Thu May 13 16:09:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We can't let standards slip at @USPS while prices increase. It's the recipe for a death spiral. \n\nRight now, @OversightDems is marking up the Postal Service Reform Act, our bill to #SaveThePostOffice and get USPS on firm financial ground. \n\nhttps://t.co/RsneTWzcB0","date":"Thu May 13 15:31:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The forced eviction of thousands of Palestinians from their homes in #SheikhJarrah is unacceptable, and the @StateDept needs to say so.\n \nProud to join this effort with @RepMarieNewman and @repmarkpocan.","date":"Wed May 12 19:47:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"End the disgrace now, @RepMattGaetz. Resign.","date":"Fri Apr 09 21:15:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Telling the truth and defending the rule of law are officially fireable offenses in the @HouseGOP conference.","date":"Wed May 12 13:18:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Donald Trump, @GOPLeader, and Republicans in Congress spent months radicalizing their supporters with lies, threats, and menacing rhetoric. Of course it ended in violence. \n\nThey called for a fight, and they got one. Don't let them rewrite history now.","date":"Mon May 10 14:42:36 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The best gift you can give your mom for #MothersDay is to get yourself vaccinated. \n\nDo it tomorrow. She’ll love it, I promise.","date":"Mon May 10 01:05:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Wishing a very happy #MothersDay to every mom, grandmother, and stepmom in #VA11 and across the country today!","date":"Sun May 09 17:09:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you all who participated in this year’s Congressional Art Competition! We’ve had the most submissions in 13 years! Congratulations to this year’s winner, Lena, for her colored pencil piece “An Affinity Between.” Her art will be displayed in the US Capitol for the next year! https://t.co/0IIfijAd0I","date":"Sat May 08 16:20:10 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Students can view their art either this weekend or next at the Workhouse Arts Center. Their hours of operation are Friday through Sunday 12pm - 5pm. Also, the Workhouse has created a page for all the submitted pieces can be viewed on their website! https://t.co/Air8WsFdA1","date":"Sat May 08 16:20:10 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Liz Cheney spoke out against Trump’s propaganda and his incitement of political violence.\n\nMarjorie Taylor Greene incited political violence herself, endorsing a call for Speaker Pelosi to “get a bullet to the head.”\n \nGuess which one the @HouseGOP is about to fire.","date":"Fri May 07 19:54:11 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"One more time for the people in the back:","date":"Fri May 07 13:38:58 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Evan R. Kwerel leveraged his career at the Federal Communications Commission @FCC to help fuel the digital revolution and net the government more than $200 billion. #PublicServiceRecognitionWeek #PSRW \n\nhttps://t.co/LsSxrH2hHr","date":"Thu May 06 23:33:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Ana Hinojosa bolstered human rights by enforcing actions against companies illegally buying clothes, toys, vitamin supplements, beauty supplies, and food made by forced labor. #PublicServiceRecognitionWeek #PSRW @CBP \n\nhttps://t.co/ZWdbF7cLrA","date":"Thu May 06 23:33:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Mary D. Gibert navigated the unprecedented by ensuring federal agencies were prepared to transfer power to the Biden Administration despite a global pandemic and President who refused to concede his loss. #PublicServiceRecognitionWeek #PSRW @USGSA \n\nhttps://t.co/Rro10idtX8","date":"Thu May 06 23:33:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"During #PublicServiceRecognitionWeek, I want to take a minute to celebrate my constituents whose incredible work in federal government garnered them nominations as finalists for the “Oscars of Federal Government” this year. #Sammies2021 #PSRW","date":"Thu May 06 23:33:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🇺🇸 #DCStatehood\n\nWashington, DC has a larger population than two states, and its 712,000+ residents pay a higher tax rate per capita than any other state in America — yet have no Federal representation.","date":"Thu May 06 22:06:55 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"💵 The Paycheck Fairness Act.\n\nOn average, Black women make 63 cents on the dollar a white man makes. For Native women, it’s 60 cents and for Latinas, it’s 55 cents. The Paycheck Fairness Act guarantees that women across the workforce are finally paid their fair share.","date":"Thu May 06 22:06:55 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The Protecting America’s Wilderness and Public Lands Act.\nThe Stronger Child Abuse Prevention and Treatment Act.\nThe NO BAN Act. \nThe Access to Counsel Act. \nThe Violence Against Women Act.\n\nThe list goes on. And it will only keep growing until we #EliminateTheFilibuster.","date":"Thu May 06 22:06:55 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚫 Gun Control.\n\nThe House has passed bills to expand background checks on all gun purchases and to close the Charleston loophole, which carelessly restricts the period of time the FBI has to conduct a background check to three days — allowing many buyers to evade them.","date":"Thu May 06 22:06:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🦋 The Dream and Promise Act.\n\nProtects Dreamers from deportation and establishes a pathway to citizenship for millions of people who came to America at an early age.","date":"Thu May 06 22:06:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🏳️‍🌈 The Equality Act.\n\nGuarantees full civil rights to LGBTQ+ individuals so no person can be discriminated against — in employment, housing, health care, education, and more — on the basis of their sexual preferences or gender identity.","date":"Thu May 06 22:06:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"👩‍🏭 The PRO Act.\n\nPuts power back into the hands of workers and restores fairness to the economy by strengthening the federal laws that protect workers’ right to join a union — allowing them to organize for better pay, benefits, and working conditions.","date":"Thu May 06 22:06:54 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"⚖️ The George Floyd Justice in Policing Act.\n\nReimagines American policing by banning chokeholds, establishing a police misconduct registry,  reforming qualified immunity, ending the militarization of law enforcement, and investing money into Black and brown communities.","date":"Thu May 06 22:06:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🗳️ H.R. 1, the For the People Act. \n\nTakes on voter suppression efforts, gets big money OUT of politics,  returns the power in our democracy to the people, protects and expands voting rights to ensure that every voice is heard and every vote is counted.","date":"Thu May 06 22:06:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Still not sure why we've got to #EliminateTheFilibuster? Let me put it this way:\n\nIf we don't, Republicans will continue to subvert the will of the people by preventing many popular and progressive proposals from ever becoming law. \n\nHere's what's at stake. Thread:","date":"Thu May 06 22:06:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Disgraceful.","date":"Thu May 06 12:51:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"#BirthingWhileBlack should not be a death sentence. \n\nOn @OversightDems, we're committed to making sure it isn't. Tune in to our hearing on the #BlackMaternalHealth crisis tomorrow at 11 AM:\n\nhttps://t.co/BbLf3cpsSQ","date":"Wed May 05 23:06:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Governor DeSantis has shown his true colors in his racist decision to deny voting representation to hundreds of thousands of African-American citizens for the balance of 2021. \n\nHe dishonors the memory of Alcee Hastings and brings disgrace on himself.\n\nhttps://t.co/dW9kaFV4yR","date":"Tue May 04 22:03:11 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"So Josh Hawley fist pumps a violent insurrectionist mob and he’s a GOP presidential hopeful. But Liz Cheney fist bumps the @POTUS and she’s toast in the GOP caucus.\n\nAnyone else see a profound and fundamental problem with GOP values here?","date":"Tue May 04 21:23:25 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"5.5 million Americans currently serve as caregivers for veterans. These Hidden Heroes should qualify for the public service loan forgiveness program.\n\n@RepMikeTurner and I wrote the Military &amp; Veteran Caregiver Student Loan Relief Act to make it happen.\n\nhttps://t.co/IYoIz46XeW","date":"Tue May 04 18:15:41 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Come on, @GOPLeader. If you're going to be a phony, at least be sincere about it. At a minimum, tell your constituents the truth: \n\nThat you and your party voted against the Restaurant Revitalization Fund, against $1,400 direct payments, and against the $3,600 child tax credit.","date":"Mon May 03 22:45:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"While today’s announcement is an improvement from the xenophobic Trump administration, America must do more for refugees. \n\nCongress must pass my Lady Liberty Act, which will set a goal of admitting no less than 125,000 refugees each year.","date":"Mon May 03 22:19:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":".@SBAgov is now accepting applications for the #RestaurantRevitalizationFund. This fund was created by the #AmericanRescuePlan and will provide relief to struggling restaurants. More info here: \n\nhttps://t.co/l52CT7M58C","date":"Mon May 03 17:51:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"It's #TeacherAppreciationWeek! This has been a challenging year for teachers, but their commitment to and passion for educating our students never wavered. Be sure to thank the teachers in your life today.","date":"Mon May 03 17:35:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Over the past year, public servants have provided critical services to all Americans. Pleased to join @RepBrianFitz in honoring them this week. \n\nhttps://t.co/ii7HfMjJx8","date":"Mon May 03 17:03:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As President of the NATO Parliamentary Assembly, I have made enshrining democratic commitment as an equal pillar to collective security for first time in NATOs 70 year history. Honored to join this distinguished panel at @McCainInstitute #SedonaForum21 \n\nhttps://t.co/awAAPQuFHs","date":"Fri Apr 30 13:50:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Isabel Ballivian is the Executive Director of the ACCA Child Development Center, a program that serves more than 200 at-risk children in Fairfax County. \n\nLast night, Isabel attended the #JointAddress as a guest of @FLOTUS! https://t.co/gLmWJRr3X8","date":"Thu Apr 29 22:37:09 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I offer my congratulations to Mr. Kakhaber Kuchava on his recent election as Speaker of the Parliament in Georgia. Under his leadership, I look forward to seeing the full implementation of the EU-mediated agreement and a brighter future for the Georgian people.","date":"Thu Apr 29 19:40:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you to Sec Granholm for joining @SEEC today to discuss the Biden administration’s plan for a clean energy economy. https://t.co/fIR9dxDAkw","date":"Thu Apr 29 17:18:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"President Biden's speech was an exhortation filled with common sense dreams. \n\nCome on. Come together. Let’s get it done. \n\nThere were echoes of FDR in the House Chamber tonight.","date":"Thu Apr 29 02:13:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"He focused on substance, not his moment in the spotlight. \n\nHe gave clear examples of how the American Rescue Plan saved real people.\n\nIt was bold, visionary, and easy for Americans to understand. Republicans have nothing to attack.","date":"Thu Apr 29 02:13:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"White supremacy is terrorism. Gun violence is an epidemic.\n\nWe will ignore neither. #JointAddress","date":"Thu Apr 29 02:06:09 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"With respect to climate change, @POTUS correctly says we’re at an inflection point. The US must lead, but partner with others. #JointAddress","date":"Thu Apr 29 01:52:19 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"“It’s time for corporate America and the wealthiest 1% of Americans to pay their fair share.” #JointAddress","date":"Thu Apr 29 01:43:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Pretty impressive report on the first 100 days: \n\n✅ COVID relief\n✅ Economic recovery\n✅ Job growth\n✅ Record increase in consumer confidence\n\nNow it’s time to invest in America.","date":"Thu Apr 29 01:38:19 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":".@POTUS reminds us that the percentage of GDP we invested in R&amp;D has decreased from 2% to 1%. We’re falling behind, and the world isn’t waiting for us to catch up. #JointAddress","date":"Thu Apr 29 01:35:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"\"Nobody working 40 hours a week should live below the poverty line.\"\n\nAmen, @POTUS. #RaiseTheWage","date":"Thu Apr 29 01:28:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"You heard that correctly, folks. Child poverty cut in HALF.","date":"Thu Apr 29 01:19:46 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"220 million vaccines.\n\n160 million stimulus checks.\n\n100 days.","date":"Thu Apr 29 01:16:41 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"“Madam Speaker, Madam Vice President...”\n\nHistory made. https://t.co/7a0MSx4KnH","date":"Thu Apr 29 01:08:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thrilled to be in the House chamber tonight for @POTUS’s first #JointAddress https://t.co/VNMy5pbdRY","date":"Thu Apr 29 00:41:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"U.S. leadership is pivotal to creating a pandemic-proof world.\n\nToday @RepBrianFitz and I led 119 of our colleagues in urging @POTUS to establish and provide $2 billion in funding for a new Fund for Global Health Security and Pandemic Preparedness.\n\nhttps://t.co/kK1cPViWpY","date":"Wed Apr 28 20:49:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Mitch McConnell worrying about unity is like an arsonist worrying about combustion. Give it a break, Mitch. \n\nhttps://t.co/A4JYMYLH3R","date":"Wed Apr 28 20:08:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Have to be honest, I'm about as proud of this CPAC grade as I am of my NRA F rating. Must be doing something right. https://t.co/5jee5zOz7T","date":"Wed Apr 28 18:55:49 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Great conversation today with my @HouseForeign colleagues and Secretaries Hillary Clinton &amp; Condoleezza Rice about how we can modernize the State Department and restore accountability. https://t.co/UJrAOtkQ3R","date":"Wed Apr 28 17:33:38 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I urge the @WHO to invite #Taiwan to the upcoming World Health Assembly. Taiwan has generously shared its medical resources and substantial health expertise with the global community, and they should not be excluded. \n\nWe must #LetTaiwanHelp. https://t.co/UJoxfT1p0I","date":"Tue Apr 27 17:37:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We must repeat time and again, for however long it takes, that we will never recognize Russia’s forcible and illegal annexation of Crimea. It is the ultimate test of our collective resolve and commitment to defending the rules-based international order.","date":"Tue Apr 27 16:17:07 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"30 million kids will avoid going hungry this summer. The American Rescue Plan continues to pay off. https://t.co/8QkkbkARMZ","date":"Mon Apr 26 13:46:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"So, Republicans can block a SCOTUS nominee for a year and stuff their own appointment on the court, but expanding from 9 to 13 for equity and balance is beyond the pale? \n\nSCOTUS is neither sacred nor immutable. Time for justice on the court. \n\nhttps://t.co/SkF3TZc8gu","date":"Mon Apr 26 13:11:33 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Since 2000, programs like @PMIgov and @globalfund have prevented 1.5 billion cases of malaria and saved over 7 million lives. With continued U.S. leadership, strong funding, and increased innovation we can #EndMalaria once and for all. #WorldMalariaDay\n\nhttps://t.co/1iZ6E1dKXx","date":"Sun Apr 25 22:43:32 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Happy to join Mayor Ernie Porta and my friends in the town of Occoquan for their new Canoe and Kayak launch ramp dedication. Setting a great example of how essential the work of local government is! https://t.co/AcAG1EMnHD","date":"Sat Apr 24 15:00:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Seriously, @RepMattGaetz.","date":"Fri Apr 23 23:54:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Attended today’s rededication ceremony for the now John R. Lewis high school. A man who gave his life to equal rights even when he faced both jail time and death. This is a man we choose to honor, and let us never forget his legacy. https://t.co/B2XHakbRhr","date":"Fri Apr 23 22:52:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"End the disgrace now, @RepMattGaetz. Resign.","date":"Fri Apr 09 21:15:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Thank you to everyone who joined our Sexual Assault Awareness Month Discussion. An emotional &amp; sensitive topic, but an important conversation to have. We have an obligation to our friends, family, and loved ones to spread awareness and take steps to end this public health crisis. https://t.co/GDVtJrnVSg","date":"Fri Apr 23 20:07:38 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Congress has the power to change the Supreme Court's size. We've done it many times before.\n\nThe court is a branch of government, neither sacred nor immutable. It must be accountable, transparent, and far more representative. \n\nI'm with you, @RepMondaire. We must #ExpandTheCourt.","date":"Fri Apr 23 16:45:00 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"As President of the NATO Parliamentary Assembly, I'm thrilled that @POTUS will attend the @NATO Summit on his first foreign trip. \n\nAfter four long years, America's steadfast commitment to the Alliance has been restored and the transatlantic bond is unshakable.","date":"Fri Apr 23 15:40:13 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Join us tomorrow for a Sexual Assault Awareness Month Discussion. It is critical to have open and honest conversations about the culture that has perpetuated the sexual violence epidemic, educate others, and provide resources.\n\nRegister for this webinar:\nhttps://t.co/WSDdVmwb1c https://t.co/M4uW1wnNZY","date":"Thu Apr 22 20:36:53 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Pass DC Statehood: ✅","date":"Thu Apr 22 16:04:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"#EarthDay is more than a symbol. It's a call to action.\n\nWith @POTUS and @VP in the White House, America has finally answered that call.","date":"Thu Apr 22 15:35:24 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"We've got a decision to make. Will we allow one Jim Crow relic to prevent us from doing away with another? Will we choose the filibuster over voting rights legislation? \n\nFor me, @RepCori, and dozens of our colleagues, the choice is crystal clear: \n\n#EndTheFilibuster. https://t.co/Xiu2OjpQlp","date":"Thu Apr 22 14:17:14 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"🚨 The Protection of Saudi Dissidents Act has PASSED the House!\n\nJamal Khashoggi's brutal murder and dismemberment will not be forgotten, and it will not go unaddressed. The House of Representatives has spoken clearly:\n\nSaudi Arabia must be held to account.","date":"Wed Apr 21 22:25:34 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Yesterday, the jury did its duty. Now, the Senate must do theirs.\n\nPass the George Floyd Justice in Policing Act.","date":"Wed Apr 21 20:44:26 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The entire country bore witness to the murder of George Floyd. The jury believed their own eyes and rendered a just verdict. \n\nBut while justice prevailed this time, far too many Black lives have been cut short with no such accountability. We owe them real, structural change.","date":"Tue Apr 20 21:34:02 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Black Lives Matter.","date":"Tue Apr 20 21:00:50 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"My district is just a few miles from DC. I commute from home to the Capitol every day.\n\nAre my constituents undeserving of representation too, @GReschenthaler?","date":"Tue Apr 20 17:26:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"47 states, including Virginia, have legalized marijuana in some form. But conflict between state and federal law has forced legal businesses to operate on a cash-only basis.\n\nTonight I'll vote for the #SAFEBanking Act to finally give these businesses access to the banking system.","date":"Mon Apr 19 21:59:45 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"America must be a haven to refugees. That’s why my Lady Liberty Act would set a minimum of 125,000 refugee admissions per year.\n\nWhile this added flexibility is welcome, the Biden administration must do better. We must reverse the damage of the Trump administration.","date":"Fri Apr 16 20:30:17 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The people of Georgia deserve a stable government unified around a commitment to democratic ideals. I am pleased the Georgian Dream party has pledged their efforts to this goal, and encourage the United National Movement to do the same.\n\nhttps://t.co/Zp8sMbcJ7Q","date":"Fri Apr 16 20:10:31 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Americans are tired of nonstop gun violence. We are tired of racism &amp; brutality in policing.\n\nWe are tired of mourning. \n\nThe House has answered the call for action. We passed universal background checks and the Justice in Policing Act this year.\n\nThe Senate must finish the job.","date":"Fri Apr 16 18:02:42 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Today, as we prepared to mourn the anniversary of the massacre at Virginia Tech, we woke to news of yet another mass shooting in America, this time in Indianapolis.\n\nI refuse to accept a status quo of endless grief. How many more American lives must we lose before we take action?","date":"Fri Apr 16 13:12:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Tune in!","date":"Fri Apr 16 12:08:01 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Residents: 712,000\nVeterans: 31,000\nStates that pay less in total federal taxes: 21\nStates with smaller populations: 2\n\nVotes in Congress: 0\n\nThat's why we fight for #DCStatehood.","date":"Wed Apr 14 21:41:30 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Foreign policy starts at home, and I’m proud to support legislation that promotes principled American engagement in the world. \n\nI'm honored to receive a perfect score on @FP4America’s scorecard for 116th Congress. https://t.co/VsVqKOJxw8","date":"Wed Apr 14 17:41:27 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"NEW: @HouseForeign has advanced my Protection of Saudi Dissidents Act. \n\nThe US must exercise its leverage to stop Saudi Arabia from acting with impunity to commit human rights atrocities like the murder of my constituent, Jamal Khashoggi.\n\nhttps://t.co/e0EbdVpGUu","date":"Thu Mar 25 20:16:21 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"The GOP has a predilection for disenfranchising voters of color. We've seen it time and again. Can't win them over with ideas? Easy – just don't let them vote.\n\nThe same goes for #DCStatehood. To them, DC is simply too brown and too Democratic to be worthy of representation. https://t.co/ef3jTVEfmD","date":"Wed Apr 14 15:52:44 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"An emotional tribute today for Officer Billy Evans. My heart breaks for his family, especially his two children. Their father is a hero and we are forever grateful for his service.","date":"Tue Apr 13 16:21:03 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"This pandemic has forced 2.3 million women out of work. When they return, they'll still be paid 82 cents on average for every dollar paid to men.\n\nWe have to act if we want any shot at a full and fair economic recovery. \n\nThe House will pass the Paycheck Fairness Act this week.","date":"Tue Apr 13 14:24:08 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Daunte Wright should be alive.","date":"Tue Apr 13 00:24:16 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Ramadan Mubarak to all celebrating! Wishing you all a month of peace and happiness.","date":"Mon Apr 12 18:04:18 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"A record-breaking 4.6 million Americans were vaccinated today. It’s amazing what a change in management can do.","date":"Sun Apr 11 02:29:08 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"I am heartbroken and sickened by this. Lt. Nazario was pulled over, harrassed, and threatened for driving his own car. He was wearing the uniform of the country he proudly serves. We need a full and independent investigation.\n\nThis is why we can't stop shouting #BlackLivesMatter.","date":"Sat Apr 10 19:50:22 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"End the disgrace now, @RepMattGaetz. Resign.","date":"Fri Apr 09 21:15:35 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Had a great meeting with the advisory committee from @USGLC  about international relations and how we can support US development, global health security, and diplomacy programs. https://t.co/LpPuFJRzD0","date":"Fri Apr 09 15:54:39 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":"Deeply saddened about the passing of my friend, James Hicks. James served our nation in uniform and served our community as the President of the Dale City Civic Association. His dedication, kindness, and heart will certainly be missed. https://t.co/vpyH1rTsRd","date":"Fri Apr 09 14:07:40 +0000 2021","user_id":"78445977"},{"handle":"GerryConnolly","text":".@POTUS is absolutely right. The House has taken decisive action to curb gun violence by closing loopholes and expanding background checks. \n\nThe Senate must follow suit without delay.","date":"Thu Apr 08 21:19:43 +0000 2021","user_id":"78445977"}]