[{"handle":"Ilhan","text":"The House just passed legislation to lower food and fuel costs!\n\nThis bill will strengthen the food supply chain, lower prices in grocery stores, reduce prices at the pump, and support farmers.","date":"Thu Jun 16 20:19:03 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"@chelliepingree We’re working to ensure no child experiences food insecurity.\n\nThat’s why we introduced the Universal School Meals Program Act to provide free breakfast, lunch, and dinner to every student and eliminate school meal debt.\n\nhttps://t.co/ynEWilZ85Z","date":"Thu Jun 16 17:43:13 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In August 2020, when the waivers were set to expire, we partnered with Rep. @chelliepingree and 119 of our colleagues to urge the Secretary of Agriculture to extend the school meal waivers. \n\nWe were able to get these critical waivers extended. \nhttps://t.co/3fyptLfOtW","date":"Thu Jun 16 17:41:49 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In March 2020, we passed the MEALS Act to let districts provide universal school meals, in the hopes of preventing a massive hunger crisis.\n\nNow these waivers are set to expire. \n\nWe’re working to extend the waivers and find a permanent solution. \nhttps://t.co/ygPnVaiy21","date":"Thu Jun 16 17:40:32 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, we hosted a special-order hour on the House floor to call attention to the domestic and global food crisis.\n\nWe know that going hungry is not a choice.\n\nNo one chooses to skip a meal.\n\nWe must end hunger here at home and work to stop the global food crisis. https://t.co/bJcaiOiaQg","date":"Thu Jun 16 17:39:47 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Abortion providers have courageously provided reproductive healthcare in the face of unrelenting threats and harassment by anti-choice extremists.\n \nOur office is proud to cosponsor the Healthcare Providers Safety Act to ensure they have the security and safety they deserve.","date":"Thu Jun 16 13:34:09 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We are in the midst of a silent crisis.\n\nWe passed the MEALS Act to provide universal school meals to millions of children.\n \nNow, those school meal waivers are set to expire soon. We have to renew the waivers &amp; ensure that our children continue to be fed.\nhttps://t.co/Iseb33tyQI","date":"Wed Jun 15 19:23:38 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we celebrated the 10 year anniversary of DACA with @UNITEDWEDREAM. \n \nAs we fight for true immigrant justice, DACA remains the floor, not the ceiling. \n \nWe need to reform our broken immigration system and provide a pathway to citizenship. https://t.co/RqYvB5AFfk","date":"Wed Jun 15 17:17:55 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We led a letter with 55 colleagues to @SecCardona requesting information on how the Department of Education will carry out President Biden's executive order to cancel student debt.\n \nIt is important that borrowers get relief quickly and aren't hampered by unnecessary roadblocks. https://t.co/bJmRKGUKZs","date":"Wed Jun 15 16:25:10 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"49 million people around the world now face famine.\n\nIn the US, more than 38 million people, including 12 million children are food insecure. \n\nWe must stop this hunger crisis.","date":"Tue Jun 14 17:36:21 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today we’re holding a press conference to call attention to the global and domestic food crisis. https://t.co/BMF43dftaK","date":"Tue Jun 14 17:05:28 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our country generates over *250 million* tons of trash every year, most of which ends up in landfills that fuels our climate crisis. \n\nWe need to end toxic landfills and help local cities invest in zero waste initiatives.","date":"Sat Jun 11 15:00:01 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"No child in the United States should be food insecure. \n\nOur office introduced and passed the MEALS Act to provide universal school meals to millions of kids at the beginning of the pandemic. \n\nWe must extend the waivers before this critical program expires at the end of June. https://t.co/4hIQDk0sw0","date":"Fri Jun 10 20:06:58 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"https://t.co/O71lWghyjk","date":"Fri Jun 10 18:41:31 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Over the last two years, one billionaire was created every 30 hours. \n\nThis year, it is estimated that ONE MILLION people will fall into extreme poverty every 33 hours. \n\nThe problem isn't scarcity; it's greed.","date":"Fri Jun 10 18:41:30 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every day more than 100 people die from gun violence in the US.\n\nThe House voted to raise the purchase age of semiautomatic weapons, ban the sale of large-capacity magazines, require safe storage &amp; put red flag laws in place.\n\nWe need to end the mass carnage—this is just a start.","date":"Thu Jun 09 20:10:43 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I was proud to introduce the first resolution impeaching Donald Trump for this insurrection. And I hope this hearing will remind everyone how fragile our democracy is, how important it is to defend it, and to hold any and all insurrectionists accountable.","date":"Thu Jun 09 17:51:09 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The January 6th Committee has pored over thousands of hours of footage and over 140,000 pages of documents during the past 11 months of investigations.","date":"Thu Jun 09 17:51:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"He did this in coordination with Republican Congressional leadership, along with far-right and militia groups, and he deliberately incited rioters on January 6th to disrupt the congressional certification of the election results. Those are the facts.","date":"Thu Jun 09 17:51:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I hope the hearing tonight will make clear to the nation what has been clear to those of us who experienced the events of January 6th: that this was the gravest threat to our democracy in generations.","date":"Thu Jun 09 17:51:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"President Donald Trump waged a deliberate monthslong campaign to discredit the outcome of the presidential election and keep himself in office. Those are the facts.","date":"Thu Jun 09 17:51:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We have to be a country that refuses to go back to the days before Roe v. Wade. \n \nWe must codify Roe and protect reproductive rights. https://t.co/YwgfKWAKZJ","date":"Thu Jun 09 16:14:53 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Water Resources Development Act passed the House last night! This legislation will help preserve our nation’s water resources infrastructure.\n \nWe were able to include language protecting the future of the Upper St. Anthony Falls Lock in Minneapolis!💪🏽","date":"Thu Jun 09 13:19:48 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The House just passed the Protecting Our Kids Act!\n \nThis legislation will address the loopholes that allow guns to get in the wrong hands and save lives. Proud to be a cosponsor of this critical legislation.","date":"Wed Jun 08 23:28:05 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today we met with students from March For Our Lives to discuss gun violence prevention. We won’t stop fighting until all students are safe at school. ✊🏽 https://t.co/pfKQKMoyZE","date":"Wed Jun 08 22:26:03 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Frontline workers have been putting their health and safety at risk throughout the pandemic.\n\nThankful for the leadership of @GovTimWalz and @CedrickFrazier to get our frontline workers in Minnesota the ‘hero pay’ they deserve.\n\nApply here: https://t.co/sYkK9HS4yI https://t.co/Ta0JVqPqB4","date":"Wed Jun 08 19:32:48 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It has been 23 years since Columbine. \nIt has been 15 years since Virginia Tech.\nIt has been 10 years since Sandy Hook. \nIt has been 4 years since Parkland.\n\nWe have offered thoughts and prayers for YEARS with no real action. Enough is enough. https://t.co/Ohh2cLVmOv","date":"Wed Jun 08 16:35:13 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Heading to the House Floor to speak on gun violence prevention, reproductive rights, and the global food shortage. Tune in! https://t.co/C9mxS4dCHO","date":"Wed Jun 08 13:42:20 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"School meals should be universal and available all year round.","date":"Wed Jun 08 13:11:22 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s gun reform or the filibuster.\nIt’s reproductive freedom or the filibuster.\nIt's voting rights or the filibuster.\nIt's climate action or the filibuster.\n\nThe choice is clear: end the filibuster.","date":"Tue Jun 07 20:34:50 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we remember Prince, on what would have been his 64th birthday.💜\n\nHe not only changed the arc of music history; he put Minneapolis on the map.\n\nLast year, we introduced legislation to award him with the Congressional Gold Medal to give him the recognition he deserves. https://t.co/M04OF0zc4r","date":"Tue Jun 07 19:24:49 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re working to ensure that infant formula is safe and available for families across the country.\n\nFor more information on locating baby formula, visit: https://t.co/2talGfPdrI https://t.co/bvqzeQSfm3","date":"Tue Jun 07 14:11:15 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Mental health is just as important as physical health. \n\nGlad to see our state take steps to improve access to mental health services across Minnesota.","date":"Mon Jun 06 22:35:24 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There were TEN mass shootings across the country over the weekend.\n\nThis week, the House will vote on a package of gun violence prevention bills to stop the carnage. \n\nLet’s get this done.","date":"Mon Jun 06 17:52:36 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"At the start of the pandemic, our office wrote and passed the MEALS Act that provided 22 million children with school meals.\n \nWe will continue fighting to make sure kids continue to get the meals they need.","date":"Fri Jun 03 21:00:15 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"No child in the wealthiest country in the world should go hungry.\n \nCongress must extend the school lunch waivers and continue providing meals to children in need.\n \nhttps://t.co/ygPnVai0ct","date":"Fri Jun 03 21:00:15 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need to ban AR-15’s and assault rifles.\n \nWe need to pass universal background checks.\n \nWe need to prevent domestic abusers from accessing guns.\n \nAnd we need “red flag laws” in place so that families can prevent family members who shouldn’t have guns from accessing them.","date":"Fri Jun 03 18:29:22 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last year, I was proud to deliver over $17 million to the Fifth District, including everything from green jobs to rebuilding Lake Street. And I hope to continue delivering for the people I represent.","date":"Fri Jun 03 16:22:47 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our community projects invest directly in the needs of the people of the 5th, particularly the most vulnerable. That’s why we proposed over $10 million in affordable housing projects throughout the district, along with food access, healthcare clinics, and youth programs.","date":"Fri Jun 03 16:22:47 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s my honor to stand with our Ukrainian community and Ukraine as they fight against Russia’s illegal war. https://t.co/UVRT9rc78h","date":"Thu Jun 02 23:55:55 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Biden Administration just canceled $5.8 billion in student debt for former Corinthian College students. \n\nThis is a great first step. Now, let’s cancel all of student debt.","date":"Thu Jun 02 20:56:54 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"88% of Americans support universal background checks on all gun sales.\n\nGet rid of the filibuster, pass the bill, and save lives.","date":"Thu Jun 02 19:19:15 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"A hunger free America is possible.\n\nYou can share your ideas and sign-up for one of the listening sessions hosted by the @WhiteHouse ahead of the Conference on Hunger, Nutrition, and Health here:\nhttps://t.co/aaXPTvbvyJ","date":"Thu Jun 02 13:25:46 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Pride Month! We won’t stop fighting until all LGBTQ+ Americans can live free from discrimination. 🏳️‍🌈","date":"Wed Jun 01 19:00:22 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"1994: 400K AR-15 style rifles in the U.S.\n2022: 20 million AR-15 style rifles in the U.S. \n\nWhen the assault weapons ban was allowed to expire in 2004, the number of mass shooting deaths tripled. We need the ban reinstated.","date":"Wed Jun 01 12:57:07 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Co-governance drives the work we do every day.\n\nLast week, we hosted our town hall and attended a candle-lit vigil to mark two years since George Floyd’s death.\n\nHere’s a look at our district work week. #FightingForThe5th\nhttps://t.co/OWaoe1t7Hm","date":"Tue May 31 21:06:50 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Guns are the leading cause of death for children in the United States. \n\nIt doesn’t have to be this way. We need universal background checks on all gun sales. Period.","date":"Tue May 31 19:41:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, on #MemorialDay, we honor and remember all those who made the ultimate sacrifice for our nation.\n\nThank you to each of our veterans and their families. \n\nWe will continue to fight to guarantee healthcare, housing, and work toward a more peaceful world without endless wars.","date":"Mon May 30 15:44:38 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thankful to represent our beautiful community in Congress. This week, we hosted a town hall, visited the @artsmia, and toured the Upper Lock project. #FightingForThe5th https://t.co/RBnnXcTAk5","date":"Fri May 27 23:52:39 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need to address the root causes of injustice by investing in schools, housing, healthcare, and jobs.","date":"Wed May 25 16:58:24 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Two years. \n\nFor two years we have been marching. For two years we have called for accountability for aggressive policing. For two years we have called for a system where everyone can live free from fear of violence.","date":"Wed May 25 16:58:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"But two years after George Floyd was murdered, there is much more work to be done. Communities of color in Minneapolis and across this country remain over-policed and under-resourced.","date":"Wed May 25 16:58:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Public safety—an essential function of our government—too often means resources without reform for police departments. The Senate has still not passed the George Floyd Justice and Policing Act, or even a more modest bipartisan criminal justice reform package.","date":"Wed May 25 16:58:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I want to thank President Biden for taking steps in addressing the demands of criminal justice advocates this week, including a national database of police misconduct, strict limits on the use of chokeholds and anti-bias training.","date":"Wed May 25 16:58:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let this anniversary, and yesterday’s horrific murder in Texas, be a reminder: everyone has the right to live free from fear of violence. We need real solutions. We need meaningful justice and accountability for police violence.","date":"Wed May 25 16:58:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Tune in for our May town hall to hear about our work for the 5th District. \nhttps://t.co/6pWO0LzoxR","date":"Wed May 25 00:11:09 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"A new billionaire has been minted every day during the pandemic. \n\nMeanwhile:\n\n38 million Americans don’t have enough food to eat\n\n30 million are uninsured\n\n64% of renters can barely afford housing\n \nThe problem is greed.","date":"Mon May 23 22:08:47 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"On Tuesday, we’re holding an in-person town hall at 7pm CT. \n \nWe will share our takeaways from a recent Congressional Delegation trip to Central America and answer any questions you have. \n \nRegister here: https://t.co/s2h424uAVb https://t.co/OQj2dzFUB5","date":"Sun May 22 17:51:25 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Four companies control 90% of the baby formula market. \n \nThe national shortage is a direct result of corporate monopolies. We led a letter calling for an investigation into the consolidation of the baby formula market.","date":"Sat May 21 15:24:52 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, the House voted to crackdown on price gouging at gas stations. \n\nProud to have voted for this legislation to finally hold big oil corporations accountable and bring the costs at the pump down.","date":"Fri May 20 20:16:33 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"And @RepHuffman, @RepBarbaraLee, @TimRyan, and @RepJoeNeguse.","date":"Fri May 20 13:50:27 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"@FTC @RepAOC @RepRashida @RepPressley @RepMarkTakano @EleanorNorton @RepBonnie @RepAndreCarson @RepCori @RepHuffman @RepBarbaraLee Thanks to our co-signers: @RepMarkTakano, @RepRaulGrijalva, @RepBonnie, @EleanorNorton, @repblumenauer, @RepPressley, @RepRashida, @RepBowman, @RepAndreCarson, @RepNikema, @RepCori, @RepAOC, @RepCindyAxne, @gracenapolitano, @repcleaver, @RepDean, @NydiaVelazquez, @RepRubenGallego","date":"Fri May 20 13:49:19 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The nationwide formula shortage is a story of corporate power and monopolies.\n\nToday we led a letter calling for a full @FTC investigation into consolidation in the U.S. formula industry. https://t.co/QfeNwHYRhI","date":"Fri May 20 13:35:56 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"More than 38 million Americans—12 million of them children—are hungry.\n\nWith your help, we can end hunger and increase healthy eating and physical activity by 2030.\n\nSign up for one of the listening sessions from the @WhiteHouse Commission on Hunger:  https://t.co/jFHVKYOwMg","date":"Thu May 19 20:37:54 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today the House honored the ten victims of a white supremacist terror attack in Buffalo.\n \nWe cannot be numb to this continued carnage. We must act to end gun violence and combat domestic terror. https://t.co/AocXMA3oer","date":"Thu May 19 18:13:40 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The U.S. provides fossil fuel corporations with over $15 billion in subsidies every year, and these same polluters turn around and gouge prices for the American public.\n\nHere’s an idea: stop giving billions of dollars in corporate welfare to the companies destroying our planet.","date":"Thu May 19 13:05:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"No one should ever be discriminated against because of the texture of their hair.\n\nYesterday, we discussed the importance of the CROWN Act and why we’re fighting to end hair discrimination once and for all. Thankful for @RepBonnie’s leadership in sponsoring this legislation. https://t.co/gVRj92uYDu","date":"Wed May 18 18:56:59 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"More Americans have been killed from gun violence than have died in all our wars combined.\n\nWhen will it be enough? \n\nWe have the power to end gun violence and must act.","date":"Wed May 18 16:39:44 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Nearly 27 million Americans lost their employer-based healthcare coverage *because of* the pandemic. This is an outrage. It is long past time we passed Medicare for All.","date":"Mon May 16 13:20:31 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Congratulations, Elliott! This is an incredible achievement. Can’t wait to see all the amazing things you accomplish!","date":"Fri May 13 21:25:46 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Hair discrimination must end. \n \nOn Tuesday, we’ll be hosting a “Coffee and Kulan” discussion on the CROWN Act with @angela_rye and @RepBonnie.\n \nTune in on https://t.co/ViPFVAZ8a5 https://t.co/easkb0sLC6","date":"Fri May 13 20:51:45 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"A women’s right to choose is about preserving our freedom and bodily autonomy. \n\nWe can’t let Senator Ted Cruz regulate our uterus. \n\nWe can’t let Senator Chuck Grassley have authority over our body.\n\nMy speech on the House floor: https://t.co/Y1vEEeK4F5","date":"Thu May 12 21:39:32 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Wage theft shouldn't exist.\n\nEmployers should never be able to steal workers’ wages with little to no consequences. \n\nThe Wage Theft Prevention and Wage Recovery Act would help workers receive the full pay they’ve earned, including overtime pay. \nhttps://t.co/8LBo5bOLHc","date":"Thu May 12 19:18:04 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, we marched to the Senate Chamber to call on the Senate to protect reproductive rights with the Women’s Health Protection Act. \n\nReproductive freedom is a right. We won’t stop fighting to protect it. https://t.co/oW4QCgtNww","date":"Thu May 12 16:46:50 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Big Oil Quarterly Profits:\n\nShell: $9.1 billion, 3X more than this time last year\n\nExxon Mobil: $5.4 billion, 3X more than last year\n\nBP: $6.2 billion, 2X more than last year\n\nChevron: $6.3 billion, 4X more than last year\n\nThe problem is greed. And we are all paying the price.","date":"Thu May 12 13:17:51 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"You can watch the full committee hearing here: https://t.co/U61pvORPju","date":"Wed May 11 21:08:31 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Always love introducing a fellow Minnesotan to a committee hearing. \n\nToday, in @EdLaborCmte we had the opportunity to hear from Daniel Swenson-Klatt, a small business owner from Minneapolis to hear about the impact of wage theft on workers. https://t.co/ys5zxNBteR","date":"Wed May 11 21:08:31 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🚨The House just voted to allow Congressional staff to unionize. \n\nThis will allow thousands of workers to organize and bargain for a better workplace without fear of retribution or retaliation in the People’s House! \n\nLet’s go!","date":"Wed May 11 00:37:35 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Protect the right to reproductive freedom. Period. https://t.co/wXnJZGW2cf","date":"Tue May 10 23:13:45 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Who’s carrying student debt?\n\n-40% of people with student debt don’t have a college degree.\n-99% of those didn't go to an Ivy League college.\n-22% of student debt is held by borrowers over the age of 50.\n\nThe student debt crisis is an economic justice issue. Cancel it.","date":"Tue May 10 19:28:21 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Congrats to Kristen Marie Denzer from Minneapolis, for her recognition as Minnesota’s Small Business Person of the Year! Small businesses are the backbone of our community. \n \nOur office remains committed to helping small businesses thrive.","date":"Tue May 10 16:03:31 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There is no greater joy than the look on a constituent’s faces when we are able to deliver much-needed resources to the 5th District. https://t.co/rJ5CXDxUik","date":"Tue May 10 13:38:02 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Sisters in service.❤️ @SenTinaSmith @LtGovFlanagan @SecDebHaaland https://t.co/ChooIkKu4B","date":"Mon May 09 20:41:46 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We are running out time in making peace in the Middle East and avoiding war.\n \nIt’s time to finalize the Iran deal!","date":"Mon May 09 18:36:16 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"From our school visit to celebrate their success at this year’s Read-a-Thon. ❤ https://t.co/zTetlGg4ot","date":"Fri May 06 21:10:25 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Grateful every day to represent our community in the People’s House!\n\nThis week, we visited students at Whittier International Elementary School, met with small businesses owners, visited two community project funding sites, and hosted our Congressional Art Competition reception. https://t.co/Ompbx6tMvX","date":"Fri May 06 21:10:18 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Solidarity with congressional staffers✊🏽. Every worker deserves a living wage and a union, including in the halls of Congress. \n \nNone of the work we do in Congress would be possible without our staff. \n \nProud to be a cosponsor of the resolution to allow staff to unionize.","date":"Fri May 06 17:55:50 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need to end the dominance of unchecked corporate money in our politics, and create a government that truly represents the people, not just the rich and the powerful. https://t.co/a5SlO6u4aT","date":"Thu May 05 16:28:19 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The U.S. has the highest maternal mortality rate of any developed country.  \n \nThis is a moral outrage. \n \nWe should be working to improve our broken healthcare system, not rolling back reproductive care.","date":"Thu May 05 13:39:06 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy National Teacher Appreciation Week! \n \nLast week, we met with Natalia Benjamin, Minnesota’s Teacher of the Year. Thank you for sharing your light and transforming the lives of our future leaders. https://t.co/yhWItci2mo","date":"Wed May 04 20:56:19 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"@POTUS You can read the full statement here: https://t.co/Tc1Z4f1mET","date":"Wed May 04 19:00:58 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thank you @POTUS for hosting this conference. We should be leading the global community in eradicating hunger and improving the health outcomes for every person in the United States. #EndHungerNow","date":"Wed May 04 18:58:21 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Expand the court. \nAbolish the filibuster. \nPass the Women's Health Protection Act to codify Roe v. Wade into law.","date":"Wed May 04 18:06:09 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Eid Mubarak! Wishing everyone celebrating in Minnesota and around the world a blessed Eid. May it be filled with peace, happiness, and love.","date":"Mon May 02 12:00:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Medicare for All is projected to save 68,000 lives per year *AND* reduce healthcare spending by billions of dollars. Let’s finally guarantee healthcare as a human right.","date":"Thu Apr 28 21:07:44 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our @USProgressives squad is big.💪🏽 https://t.co/XEJVPT8MJF","date":"Thu Apr 28 19:30:57 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Tune in for our April town hall to hear about our ongoing work for the 5th District. https://t.co/s8ATtTdEXs","date":"Wed Apr 27 22:50:58 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today on #HolocaustRemembranceDay, we remember the six million Jews murdered during the Holocaust and redouble our efforts to combat antisemitism and all forms of religious bigotry wherever we find it.","date":"Wed Apr 27 22:29:12 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Shameful. Fewer than 17 percent of Africans have received a primary Covid immunization. \n\nWe should be leading the global community in ensuring the broadest distribution of the COVID-19 vaccine.\n\nUntil all of us are safe from this virus, none of us are.\nhttps://t.co/PZq2AUjZun","date":"Wed Apr 27 21:30:51 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The time for President Biden to cancel student debt is NOW. https://t.co/spOLrTrHBd","date":"Wed Apr 27 17:26:20 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We applaud @POTUS for using his authority to commute or pardon the sentences of 78 people. We must continue to work to end mass incarceration and fix our broken criminal justice system.","date":"Wed Apr 27 14:52:06 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"TOMORROW: Our office will host a virtual town hall at 5:30pm CT. We will provide an update on our work fighting for the 5th District. \n\nYou can register here: https://t.co/r42COuAYNv","date":"Wed Apr 27 01:09:47 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s stop providing giveaways to fossil fuel companies responsible for the climate crisis.\n \nLast year, we reintroduced the End Polluter Welfare Act with @SenSanders to end the $15 billion in federal subsidies to the fossil fuel industry and hold polluters accountable. 🌎","date":"Fri Apr 22 17:55:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Next Wednesday at 5:30pm CT, our office will host a virtual town hall.\n \nWe will discuss student debt cancellation, community project funding, and answer any questions you have.\n \nJoin us! https://t.co/r42COuAYNv https://t.co/hjG3lwQqiX","date":"Thu Apr 21 19:37:46 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Decades ago, Congress voted to authorize the executive branch to cancel federal student loans.\n \nFederal student debt can be canceled with the flick of a pen.\n \n@POTUS must use his authority to cancel student debt and provide millions with badly needed relief.","date":"Wed Apr 20 16:28:58 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Medicare for All will guarantee healthcare as a human right—no questions asked.","date":"Tue Apr 19 17:42:22 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our office will host a staff-level briefing/Q&amp;A on Tuesday, April 19th at 5pm CT to answer any questions on community project funding. You can register here: https://t.co/eDu56Cf2QH","date":"Mon Apr 18 20:46:37 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Billionaires have gotten $2 TRILLION richer during the pandemic.\n \nTax the rich. #TaxDay","date":"Mon Apr 18 18:41:52 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rooted in community, always.✊🏽 https://t.co/lO09LWuTq3","date":"Mon Apr 18 16:09:11 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re the only major industrialized country that doesn't guarantee some form of paid leave. \n \nNo new parent should be forced to choose between caring for their newborn and a paycheck. \n \nWe need to guarantee paid parental leave for all workers.","date":"Mon Apr 18 13:29:53 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"https://t.co/Q1cAOrXwnw","date":"Mon Apr 18 13:29:53 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Easter to all who are celebrating! Hope your day is filled with peace, joy, and love.","date":"Sun Apr 17 12:05:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Chag Sameach and happy Passover to those who are celebrating in Minnesota and all over the world! ❤️","date":"Fri Apr 15 21:19:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Amir Locke should be alive.\n\nIt is unconscionable that no-knock warrants continue to be in effect in many states with little to no restrictions and regard for the impact on lives.\n\nWe introduced the Amir Locke End Deadly No-Knock Warrants Act to restrict no-knock warrants. https://t.co/zYPQNWvHH6","date":"Fri Apr 15 20:36:33 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"School meals should be free to every child.\n\nWe introduced the Universal School Meals Program Act to ensure children have the nutrition they need to succeed.\n\nThis legislation would eliminate all school meal debt and provide free breakfast, lunch, dinner, and a snack to students.","date":"Fri Apr 15 13:06:30 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we introduced a package calling on the United States to become a full member of the International Criminal Court, and fully support international law.\n \nYou can read more here: https://t.co/3WZip4KzfI","date":"Thu Apr 14 19:12:49 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s time for the U.S. to join the International Criminal Court.\n \nOur refusal to join the court is antithetical to our commitment to human rights, accountability, and the rule of law.\n\nNow is our opportunity to lead the fight against human rights abuses. \nhttps://t.co/yBPX9CCjPy","date":"Thu Apr 14 19:12:48 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s Black Maternal Health week. \n\nBlack women die in childbirth at a rate three to four times higher than white women.\n\nWe co-founded the Black Maternal Health Caucus to address these glaring racial disparities.","date":"Thu Apr 14 13:47:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we’re hosting a community conversation on Afghanistan refugee resettlement in Minnesota &amp; the ongoing relocation effort with @shawnjvandiver and more. Tune in! https://t.co/e7USpk3JET","date":"Wed Apr 13 23:17:56 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s go!🐺#WolvesBack","date":"Wed Apr 13 17:23:06 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Then we visited the Shafi’i Tutoring Center, which is an after-school tutoring program in Hopkins to help students succeed. \n\nGrateful to all of our educators and staff who are transforming the lives of our future leaders.🙏🏽 https://t.co/nC9wiXnc4L","date":"Tue Apr 12 22:39:35 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This afternoon, we attended a press conference to announce that Downtown Hopkins, Minnesota is being added to the National Register of Historic Places. \n\nThis will help foster local business and boost economic growth. https://t.co/XhrAFExjXW","date":"Tue Apr 12 22:38:43 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"At the end of the day, we stopped by the New Hope City Council meeting.\n \nIt was great to *finally* be attending these meetings in person after 2 years. https://t.co/pAuA0Stll5","date":"Tue Apr 12 17:50:57 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, marked one year since Daunte Wright was shot and killed. We visited his memorial and met with members of his family. https://t.co/QHtQ5388CZ","date":"Tue Apr 12 17:50:55 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Then we headed to the Hennepin Healthcare Birth Center in South Minneapolis to mark Black Maternal Health Week and deliver Black hair and body products.\n\nWe also discussed the $4.6 million we recently secured for their East Lake Clinic Rebuild. https://t.co/DC5FmuEGyJ","date":"Tue Apr 12 17:50:54 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We then had an all staff briefing where members of our team shared what was on deck for the week ahead.\n \nAfter the briefing, we met with SEWA-AIFW, which was founded in 2004 to serve and promote \"Total Family Wellness\" for Asian-Indians in Minnesota. https://t.co/azBDE2Mbca","date":"Tue Apr 12 17:50:53 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, we started the day off with the Hennepin County Board of Commissioners talking about maternal health, housing, transit, and mental health. https://t.co/Im0nwXwqhU","date":"Tue Apr 12 17:50:51 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week, Congress is in recess which means we’re back in our communities for a district work period.\n \nWe wanted to take you behind the scenes and show you what a district work period entails.\n \nHere’s what we’ve been up to: ⬇️","date":"Tue Apr 12 17:50:38 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"https://t.co/pNAu9yqbGc","date":"Tue Apr 12 16:21:06 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Black women shoulder a disproportionate share of the $1.7 trillion student loan debt burden.\n\nThe student debt crisis is a racial justice issue.\n\nCancel it.","date":"Tue Apr 12 16:21:05 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We recently secured $17 million to fund community projects throughout Minnesota’s 5th District.\n\nThese investments will be felt throughout the district and help countless Minnesotans.\n\nWe are now accepting applications for FY 2023. You can learn more here: https://t.co/adfvnBja9H https://t.co/frGFda0uUU","date":"Tue Apr 12 13:46:16 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Far too often, no-knock warrants are a death sentence for Black and Brown people across the country. \n \nThis pain and trauma must end. \n \nWe introduced the Amir Locke End Deadly No-Knock Warrants Act to restrict no-knock warrants and save lives.","date":"Mon Apr 11 20:30:22 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The House passed the MORE Act to decriminalize cannabis and expunge records for many cannabis-related offenses.\n\nNow the Senate must pass this bill and send it to President Biden's desk.","date":"Mon Apr 11 13:05:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"https://t.co/31EGta34ZA","date":"Fri Apr 08 18:58:10 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"No one in the wealthiest county in the world should be sleeping on the streets.\n \nThat’s why we reintroduced the Homes for All Act to create a new vision of what public housing looks like in the United States of America.\n \nIt’s time to treat housing as the human right that it is.","date":"Fri Apr 08 18:57:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, we met with @DrTedros to discuss global health security challenges, including the status of the global COVID response, the global hunger crisis, and ways to improve digital technology to broaden healthcare access. https://t.co/VfifvVrcSL","date":"Thu Apr 07 19:20:57 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"History was made TODAY. \n \nJudge Ketanji Brown Jackson was just confirmed to the Supreme Court. 🙌🏽","date":"Thu Apr 07 18:27:27 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"A recent AARP study found that 75 of the 100 brand name drugs that Medicare spends the most money on increased this year.\n\nUnsurprisingly, no top brand name drugs issued a price decrease.\n\nSec. Becerra testified before @EdLaborCmte to discuss drug costs and HHS priorities. https://t.co/LWt4GUFCHr","date":"Thu Apr 07 13:35:11 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Why has the Biden Administration been so reluctant to criticize Modi’s government on human rights?\n\nWhat does Modi need to do to India’s Muslim population before we will stop considering them a partner in peace? \n \nThese are the questions the Administration needs to answer. https://t.co/kwO2rSh1BL","date":"Wed Apr 06 23:03:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last week, we co-led a letter urging the Biden Administration to extend the pause on student loan payments and cancel student debt.\n \nToday, the Administration extended the pause. While the extension is welcome, @POTUS must use his legal authority and cancel student debt.","date":"Wed Apr 06 22:32:25 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We introduced a bill to improve the delivery of wraparound services to workers participating in job training and workforce development programs.\n \nIt passed in committee and now heads to the House floor! https://t.co/ni4wBiskRF","date":"Wed Apr 06 16:15:09 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every single worker should be able to join a union, without intervention or intimidation from their employer.","date":"Tue Apr 05 23:03:01 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today @HouseForeign passed the Ukraine War Crime Deterrence and Accountability Act, to collect and preserve evidence of war crimes committed by Russian forces in Ukraine. We cannot ignore the brutality and horror we are currently witnessing in Ukraine. https://t.co/BqNEVKeSOW","date":"Tue Apr 05 22:01:42 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"A vial of insulin in the United States costs nearly 8 times what it does in similar nations.\n\nThat’s why the House passed to cap insulin prices and hold Big Pharma accountable.","date":"Tue Apr 05 13:28:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Solidarity with all the workers who took on Amazon and everyone organizing their workplace! https://t.co/S1EhRgUfN6","date":"Mon Apr 04 21:40:01 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minneapolis native Prince showing solidarity with teachers as an 11 year old!  https://t.co/HB9CsJhD1B","date":"Mon Apr 04 19:54:56 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“When I met with the President and progressive leaders this week, we emphasized the importance of the U.S. remaining a beacon of hope for those fleeing violence around the world... I want to thank the President for listening to those directly impacted and lifting Title 42.” https://t.co/WtjuqrYFR7","date":"Fri Apr 01 22:09:30 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The pandemic is not over, especially in the developing world.\n \nThe pandemic has pushed tens of millions of Africans into extreme poverty.\n \nThis week the Africa Subcommittee held a hearing on the current challenges facing Africa. https://t.co/tPHNvdu6fm","date":"Fri Apr 01 17:51:17 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Ramadan Mubarak to everyone in Minnesota and around the world!","date":"Fri Apr 01 17:15:45 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Update: the Marijuana Opportunity Reinvestment and Expungement Act just passed!","date":"Fri Apr 01 16:36:48 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Capping insulin prices at $35 will save Minnesotans and Americans millions of dollars.\n \nIt’s time to stand up to Big Pharma and do what’s right.\nhttps://t.co/eaDE8yNKHF.","date":"Thu Mar 31 22:03:35 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I was honored to meet with trans youth from Minnesota’s 5th district today to hear directly from them and learn how our office can best support them.","date":"Thu Mar 31 21:46:04 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Excited to host the NCAA Final Four in Minneapolis this week!\n \nSpecial shoutout to Minneapolis native Paige Buecker!\n \nIf you don’t have tickets you can still find events here:\n \nhttps://t.co/hFH1a3QVx2","date":"Thu Mar 31 21:45:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Trans Day of Visibility!\n \nTo the entire trans community in Minnesota and beyond: we see you, we hear you, and will do everything in our power to fight bigoted  attempts to criminalize trans people and suppress your rights. https://t.co/wHJzCbPiSP","date":"Thu Mar 31 20:01:13 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"McDonalds’ CEO got paid $20 million last year, almost double what he made the year before.\n \nMeanwhile McDonald’s STILL won’t pay its workers a $15 minimum wage.\n \nThe problem has always been corporate greed.","date":"Thu Mar 31 14:39:47 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today the House is taking up the MORE Act to decriminalize and deschedule cannabis and expunge many cannabis offenses.\n \n91 percent of Americans support legalizing marijuana.\n \nLet’s get it done.","date":"Wed Mar 30 20:06:26 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, after over a century of attempts, the Emmett Till Anti-Lynching Act finally became federal law. Thank you @POTUS, @VP, and @TheBlackCaucus, for your leadership on this issue. https://t.co/lKIdIDB8Ah","date":"Wed Mar 30 18:59:41 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Corporate profits at record highs. Highest health care costs in the world. Millions still uninsured. Not enough nurses and doctors.\n \nWe need Medicare for All.\n \nI was proud to testify at this week's hearing demanding that healthcare be treated as the human right that it is. https://t.co/FokDz3s5E6","date":"Wed Mar 30 17:46:50 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Join me for my March Town Hall! https://t.co/i3Zoj85EQm","date":"Tue Mar 29 23:05:41 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We'll be getting started at 6:00 PM CT to accommodate Congressional votes","date":"Tue Mar 29 21:47:57 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Haven’t signed up for our Town Hall yet? Be sure to register and ask questions! We look forward to hearing from you! https://t.co/HeSIAlCHCU https://t.co/qEvc0Ym3qb","date":"Tue Mar 29 16:30:21 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today we’re honoring Minnesota civil rights legend Lena Smith for #WomensHistoryMonth.\n \nThe first female president of the Minnesota NAACP and a founder of the Minneapolis Urban League, Smith filed multiple lawsuits challenging housing and other forms of segregation in Minnesota. https://t.co/2WKK3K49Jl","date":"Tue Mar 29 12:10:54 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Billionaires got $5 trillion richer last year.\n \nStop pretending we can’t afford to house our homeless, heal our planet, feed our children, or care for our sick.","date":"Mon Mar 28 20:40:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need Homes for All. Period. https://t.co/taUFXfLSKx","date":"Fri Mar 25 18:45:47 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thank you to original cosponsors @repblumenauer, @RepAndreCarson, @RepChuyGarcia, @RepJayapal, @RepMondaire, @EleanorNorton, @RepAOC, @RepPressley, and @RepRashida https://t.co/31EGta34ZA","date":"Thu Mar 24 17:56:18 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The wealth of world’s billionaires went up by $5 trillion in the last year.\n\nRent increased by 17% and evictions have skyrocketed.\n\nWe need to tax billionaires &amp; invest in social housing.\n\nToday we reintroduced Homes For All to finally guarantee housing as a human right.","date":"Thu Mar 24 17:49:01 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"📸: @sbmaneyphoto","date":"Thu Mar 24 15:54:05 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Black joy ❤️ https://t.co/EdAyhAnXOM","date":"Thu Mar 24 15:51:15 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We're holding a town hall on Tuesday! If you live in the Fifth District, be sure to register and join here. https://t.co/HeSIAlCHCU https://t.co/ph49nWg98q","date":"Wed Mar 23 20:05:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"https://t.co/TtoZ4hPo9q","date":"Wed Mar 23 18:39:42 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The average Wall Street bonus in 2021 increased by 20 percent—up to a staggering $257,000.\n\nMeanwhile real weekly earnings for workers declined.\n\nThe problem isn't scarcity; it's corporate greed.","date":"Wed Mar 23 18:39:06 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Full statement here: https://t.co/pyCCeM4D44","date":"Tue Mar 22 14:29:35 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“Judge Jackson’s lived experience—from her upbringing in Miami to her career as a public defender—are exactly what's needed in our judiciary, and the efforts of a few rightwing senators to smear her record with conspiracy theories only confirm the importance of her confirmation.\" https://t.co/ebTcgN5dLf","date":"Tue Mar 22 14:28:57 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Proud to support these measures, including my amendment to encourage and track trauma-informed counseling in the wake of school shootings. https://t.co/gglrhJKXkw","date":"Fri Mar 18 17:55:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"UPDATE: The CROWN Act has passed!","date":"Fri Mar 18 15:04:24 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I want my two girls to grow up in a world where they know they will not be discriminated against because of their hair or the way they look.\n \nToday the House will take a major step towards that reality by passing the CROWN Act. https://t.co/uNASkshym9","date":"Fri Mar 18 14:34:03 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The House just passed a resolution to condemn killing of 14 individuals on Bloody Sunday and to call for full implementation of Good Friday Agreement to ensure peace &amp; stability in Ireland. Proud to support it.","date":"Thu Mar 17 22:22:17 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🙌🏽","date":"Thu Mar 17 18:56:51 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As we support Ukraine in their fight against Russia’s brutal invasion, we must avoid the knee-jerk calls that risk nuclear war.\n\nA no-fly zone is not simply declared, it must be militarily enforced. It would mean the beginning of World War III.\n\nWe must reject this completely. https://t.co/1AeLf5OdlX","date":"Thu Mar 17 18:37:07 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🚨UPDATE: The President officially signed into law $17 million for the 5th District, including funding for:\n\n- Entrepreneurs on the Northside\n- Fire protection in Cedar Riverside\n- Health clinics in Brooklyn Center &amp; Lakeside\n- Workforce development\n- Clean energy jobs\n- More! https://t.co/ceLXSYpzsD","date":"Thu Mar 17 15:13:51 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Heading to the House floor to speak on the crisis in Ukraine. Tune in. https://t.co/m2ZTjUnkEA","date":"Thu Mar 17 14:04:39 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Presiding over the House is one of my greatest honors as a Representative—especially when we are debating the CROWN Act to ban hair discrimination based on race. \n\nAs a mom of 2 black girls, I’m glad to colead this important bill. Grateful to the people of Minnesota every day! https://t.co/JLE2wtvlZo","date":"Thu Mar 17 01:33:18 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every single refugee in the world, whether from Ukraine, Central America, or Sub-Saharan Africa, deserves a safe home.\n \nWe must welcome people fleeing unspeakable violence around the world.\nhttps://t.co/g5QhMSwZkO","date":"Tue Mar 15 23:11:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Excited to preside as Speaker tomorrow as the House debates the CROWN Act. We co-led the bill with @RepBonnie, @RepPressley, @RepGwenMoore, and  @RepBarbaraLee to ban race-based hair discrimination. \n\nTune in at 11 CT/12 ET!","date":"Tue Mar 15 22:08:01 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Solidarity with the teachers fighting for living wages, mental health support, and smaller class sizes for our kids.\n\nSolidarity forever. https://t.co/xDijtpt5Ej","date":"Tue Mar 15 21:40:28 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"For two and half years, our team has been working tirelessly to bring much-needed sprinklers to public housing in Minneapolis.\n\nProud that these funding will help keep Minnesotans safe. Thanks to @SenTinaSmith and @SenAmyKlobuchar for your partnership.  \nhttps://t.co/xnY9LJHM9f","date":"Tue Mar 15 18:10:22 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we are announcing $17 million in transformational funding for the 5th District secured in the government funding package last week, including:\n\n✅ Healthcare\n✅ Affordable housing\n✅ Clean energy\n✅ Food \n✅ Community centers\n\nWatch it live here: https://t.co/TVT6vVtGRM","date":"Mon Mar 14 15:47:13 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar is proud to secure $17 million in funding for much needed community projects in Minnesota’s 5th. \n \nFrom education to public health to green jobs, this money will support the urgent needs of our community and enrich countless lives. https://t.co/xPuRwuUe1I","date":"Fri Mar 11 21:20:58 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I am also gravely concerned that this ban will mean ramping up domestic oil production. Yet another reason why we must move to a green economy that is proven to be the most reliable and cost efficient. (7)","date":"Thu Mar 10 18:24:29 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Full statement here: https://t.co/72LumufvUb","date":"Thu Mar 10 18:24:29 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It was not repealed until 2012, more than 20 years after the fall of the Soviet Union, well after its usefulness had expired. I have serious concerns that the Suspending Energy Imports from Russia Act... (4)","date":"Thu Mar 10 18:24:28 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The last time Congress passed significant trade restrictions on Russia was the Jackson-Vanik Amendment of 1974. Like this bill, it was motivated by genuine concern for human rights and human security. (3)","date":"Thu Mar 10 18:24:28 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"will become yet another clear example where a policy stays on the books well past its utility because the political will to lift it has never materialized. (5)","date":"Thu Mar 10 18:24:28 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"One thing that is very clear is that our dependance on oil means a dependence on tyrants, and this has always been true. There is no meaningful principle at play in a decision to ban Russian oil but seek it from Saudi Arabia instead. (6)","date":"Thu Mar 10 18:24:28 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I opposed the Suspending Energy Imports from Russia Act, a bill that mandates a complete ban on Russian oil imports. The President clearly already has the authority to take this step - evident in that President Biden announced such a ban yesterday. (1)","date":"Thu Mar 10 18:24:27 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"But putting the specifics into statute with no sunset and no conditions for lifting the ban creates a dangerous scenario, one in which we are taking today’s policy question and making it tomorrow’s political question. (2)","date":"Thu Mar 10 18:24:27 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar’s Statement on Suspending Energy Imports from Russia Act: https://t.co/qhcyySTGQS","date":"Thu Mar 10 18:24:26 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Full statement here: https://t.co/PobnElAuc7","date":"Thu Mar 10 18:24:19 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This government funding package will help middle class families with the cost of living, create American jobs, supports the vulnerable, and works to help small businesses and restaurants that are key to our economic future. (9)","date":"Thu Mar 10 18:24:19 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Taken together, the funding for Minnesota’s 5th and the funding increases for critical government programs will reverse decades of disinvestment in our communities and strengthen our nation. (10)","date":"Thu Mar 10 18:24:19 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"$1,000,000 for Avivo, Minneapolis, MN for workforce training related to clean energy and green building\n$100,000 for a City of Brooklyn Center, MN health initiative\n$4,600,000 for a Hennepin Healthcare East Lake Clinic (8)","date":"Thu Mar 10 18:24:18 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"$2,000,000 for Fire Protection Upgrades in High-Rise Public Housing\n$1,000,000 for Comunidades Organizando el Poder y la Accion Latina Education Fund, Minneapolis, MN for workforce development activities (7)","date":"Thu Mar 10 18:24:18 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"$1,000,000 for NEON Food Entrepreneur Incubation Center\n$1,800,000 for Wadaag Commons\n$500,000 for Sabathani Community Center Building Revitalization Project\n$2,000,000 for North Commons Regional Vision\n$3,000,000 for Minneapolis American Indian Center, All Roads Campaign (6)","date":"Thu Mar 10 18:24:18 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar championed funding for 10 projects that will directly benefit Minnesota’s 5th district residents. These include: (5)","date":"Thu Mar 10 18:24:17 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“I am incredibly pleased to secure $17,000,000 in Community Project Funding in this bill that I know will have a profound impact in our communities,” Rep. Omar said. (3)","date":"Thu Mar 10 18:24:17 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This funding, included in the appropriations government funding package, responds directly to some of the most pressing needs in her district. (2)","date":"Thu Mar 10 18:24:17 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“These investments support underserved areas and foster economic development, making a real difference in the lives of so many in our community. I am proud to have fought for funding that will make our community healthier, safer, stronger, and even more resilient.” (4)","date":"Thu Mar 10 18:24:17 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, Representative Omar voted to fund $17,000,000 in Community Project Funding that she previously secured for Minnesota’s 5th Congressional District. (1)","date":"Thu Mar 10 18:24:16 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar’s statement on local community funding: https://t.co/RC2Eg6jGT1","date":"Thu Mar 10 18:24:16 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, Rep. Omar joined the @HouseForeign hearing on USAID’s efforts to support locally-led development.\n\nRep. Omar asked about accountability, outreach, and appropriations practices for local community development projects. https://t.co/1gDnnBgVJT","date":"Wed Mar 09 21:15:40 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"27 years ago today, Rep. Omar arrived in the United States as a refugee fleeing war.\n\nIf you’re a refugee - no matter where you’re from - know you have an advocate who believes in all you have to offer your new home.","date":"Tue Mar 08 23:30:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy #InternationalWomensDay! \n \nToday and everyday we must uplift and celebrate the powerful women, femme, trans, and non-binary people who enrich our world.","date":"Tue Mar 08 23:00:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As we continue to do everything in our power to support the people of Ukraine, we must offer the same compassion to all refugees - regardless of nationality or race. https://t.co/lSf6uZbXIu","date":"Tue Mar 08 22:23:19 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As a former refugee, Rep. Omar understands the heartbreak and distress of leaving behind your home in search of safety.\n \nThe United States and our European friends must do everything we can to provide humanitarian assistance for Ukrainian refugees. https://t.co/SgYKFbbvMd","date":"Tue Mar 08 14:55:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Medicare for All is the remedy to our broken healthcare system. \n \nNo premiums.\nNo deductibles. \nNo hidden fees. \nNo co-payments.\nNo medical debt.","date":"Sun Mar 06 15:10:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Education is a pathway to greater opportunity and economic security, yet many Americans simply can’t afford it or become crushed by student loans.\n \n@POTUS, we must cancel student debt.","date":"Sat Mar 05 16:30:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minnesotans, if you’re struggling to keep up with the cost of utilities, help may be available.\n \nApply now - https://t.co/BdcGS1LeFG","date":"Fri Mar 04 21:30:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thank you @POTUS. I was proud to sign a letter in support of TPS for Ukrainians. I have also signed letters asking for TPS for Cameroonians and Ethiopians. Those deserve the same urgency.","date":"Fri Mar 04 20:08:57 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Muslim women are among the most likely to regularly face religious discrimination. Unacceptable.\n\nThis #WomensHistoryMonth, let’s make history by passing the Combating International Islamophobia Act.","date":"Thu Mar 03 22:30:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The detention of asylum seekers is inhumane, abusive and unjust – full stop.\n\nReducing the number of people behind bars in immigration detention should be @POTUS's utmost priority. #CommunitiesNotCages","date":"Thu Mar 03 21:00:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Too often, no-knock warrants are a death sentence for Black and Brown people across the country. It's past time to end the pain and trauma.\n\nWe need the Amir Locke End Deadly No-Knock Warrants Act. https://t.co/xUga05c4RD","date":"Thu Mar 03 20:22:22 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, the @HouseForeign Committee held a hearing on the 2001 AUMF and war powers.\n\nRep. Omar asked about air strikes conducted in Somalia and troop deployment in Cameroon, Niger, and the wider Sahel. https://t.co/tmcW2hzH5H","date":"Thu Mar 03 04:30:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar applauded @POTUS for engaging with our allies in response to Russian aggression in a measured way that incentivizes de-escalation and doesn’t plunge the US into WWIII and risk nuclear war. https://t.co/wHWlbuj43j","date":"Thu Mar 03 04:09:07 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Deadly no-knock warrants have wreaked havoc on families and communities for far too long.\n \nToday, Rep. Omar introduced the Amir Locke End Deadly No-Knock Warrants Act to add limitations on no-knock warrants, night-time raids, and use of explosive devices. https://t.co/BjTAunL9kn","date":"Tue Mar 01 22:30:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, Rep. Omar testified at the @HouseJudiciary hearing on discrimination and the civil rights of the Muslim, Arab, and South Asian Communities.\n\nIt's critical we overturn an outdated, xenophobic law by passing the Neighbors not Enemies Act. https://t.co/wENeWzhvko","date":"Tue Mar 01 21:26:12 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s past time we take serious action against climate change. We know what’s at stake - a livable future.\n\nWe need a Green New Deal.","date":"Tue Mar 01 17:23:15 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, the House will vote on the #CROWNAct.\n\nFor too long Black women have been told their natural hair is unprofessional, exotic, or unruly. Let’s call this what it is - discrimination.\n\nPassing the CROWN Act is a crucial step forward. https://t.co/ERGtq8eoxS","date":"Mon Feb 28 20:17:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"President Biden’s nomination of Ketanji Brown Jackson is not only historic, but an affirmation for young black girls everywhere that they too can aspire to serve on the highest court in the US. Judge Jackson is eminently qualified and will make an excellent Supreme Court Justice.","date":"Fri Feb 25 18:18:59 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“The United States should lead by example, and begin to resettle refugees here as soon as it becomes necessary.”","date":"Thu Feb 24 18:24:10 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“This includes making allowances for humanitarian organizations to operate in sanctioned territory, and it also includes preparing to welcome the likely influx of refugees fleeing the conflict. As always, the countries immediately bordering Ukraine will face the greatest burden.”","date":"Thu Feb 24 18:23:42 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“Finally, we must direct some of the unity and resolve that we and our partners have shown in this crisis toward the civilians that are in harm’s way.”","date":"Thu Feb 24 18:23:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“I am heartened that the Biden Administration has included humanitarian exemptions and general licenses to the first tranche of sanctions, but I am also aware that exemptions and licenses have never been sufficient to prevent indiscriminate human suffering.”","date":"Thu Feb 24 18:22:40 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“I support sanctions that are targeted at Putin, his oligarchs, and the Russian military, especially targeted at their offshore assets. But will continue to oppose broad-based sanctions that would amount to collective punishment of a Russian population that did not choose this.”","date":"Thu Feb 24 18:22:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“We must continue to support diplomacy even as it becomes more difficult – though it is becoming harder to imagine, this could still escalate to something much more devastating.”","date":"Thu Feb 24 18:20:05 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“I condemn in the strongest possible terms Vladimir Putin’s reckless, illegal invasion of Ukraine. My thoughts are with the Ukrainian civilians who have already suffered immensely and are again suffering the brunt of this terrible conflict.”","date":"Thu Feb 24 18:19:39 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar’s Statement on Russian Invasion of Ukraine: https://t.co/ror6RFpQ8X","date":"Thu Feb 24 18:18:27 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Sending our deepest condolences to the family, friends, and staff of Rep. Jim Hagedorn.","date":"Fri Feb 18 20:06:14 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Facebook’s treatment of workers and their role in perpetuating hate speech is unacceptable.\n\nLast year, we wrote a letter to Mark Zuckerberg about Facebook’s role in the catastrophic violence that has encompassed Ethiopia and around the world.\n\nSolidarity with the whistleblowers.","date":"Fri Feb 18 16:08:35 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This afternoon, we met with stakeholders about the St. Anthony Falls Upper Lock. \n\nWe have a once-in-a-generation opportunity to start a new chapter in the history of Minneapolis’s riverfront – one that centers Indigenous voices and celebrates this sacred site. https://t.co/ohwZUuzLuN","date":"Thu Feb 17 22:46:55 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Black migrants remain in detention longer, pay higher bonds for release, and are often not given a fair opportunity to seek asylum. \n \nIt’s time to address anti-Blackness in our immigration policies. \n \nProud to support this letter.","date":"Thu Feb 17 21:38:13 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every worker should be able to join a union. \n \nWe need the PRO Act to put power back into the hands of workers.","date":"Wed Feb 16 14:19:27 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It is unconscionable that no-knock warrants continue to be in effect with little to no restrictions, regulations, and regard for the impact on lives.\n\nThis violence must end.\n\nWe plan on introducing legislation to change that. https://t.co/ZsQJV87ubw","date":"Wed Feb 16 01:26:27 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Tune in for our town hall to hear about our work for the 5th District.\n https://t.co/fy1oQITDUl","date":"Tue Feb 15 23:03:26 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happening tonight! Excited to answer your questions.","date":"Tue Feb 15 22:16:13 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"TOMORROW: Our office will hold a virtual town hall. \n\nWe will provide an update on our ongoing work fighting for the 5th District and answer any questions you have.\n\nJoin us! https://t.co/yGStF2zhMH https://t.co/b88RZC8CL6","date":"Mon Feb 14 23:28:25 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we hosted a Galentine’s Day lunch with our district’s female elected leaders. \n\nHonored to be in community with these women who are making a difference for our communities. ❤ https://t.co/7rId9KojIX","date":"Mon Feb 14 21:05:42 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we wrote a letter to the Biden Administration regarding the current ambiguous sanctions on Somalia, their utility and removal process. \n\nOur letter: https://t.co/rBlfzgy3Oa","date":"Fri Feb 11 15:10:52 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Shoutout to @go4esther for carrying the CROWN Act in the Minnesota State House to end hair discrimination in our state.","date":"Fri Feb 11 14:02:44 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Far too often, Black women and girls face hair discrimination at work and school simply for existing as themselves. \n\nOur office is a proud to cosponsor the CROWN Act to end race-based hair discrimination once and for all.","date":"Fri Feb 11 14:02:43 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week, we wrote letters to the Presidents of CenterPoint Energy &amp; Xcel Energy asking about the rate increases &amp; the impact it will have for Minnesotans. \n\nMinnesotans are already grappling with historic inflation &amp; should not have to pay even higher gas and electric bills. https://t.co/vrcDdUorEv","date":"Fri Feb 11 01:14:26 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We wrote a letter to @SecVilsack asking for information &amp; further investigation regarding reports of fraudulent misuse of funds by a non-profit intended to help feed children.\n\nUsing the guise of feeding kids to funnel millions of dollars toward extravagant expenses is abhorrent. https://t.co/FIPyOlc5Nt","date":"Thu Feb 10 23:36:23 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thankful we were able to welcome @FLOTUS and @SecBecerra to Minnesota to highlight the American Rescue Plan’s $550 million investment in childcare for our state. \n\nThis investment moves us one step closer to a future where all working families can thrive. https://t.co/dqxPn36epN","date":"Thu Feb 10 21:47:58 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Amir Locke’s life mattered.\n\nWe need to confront the systemic injustices that haunts all aspects of our society. https://t.co/97xwsQwvEk","date":"Wed Feb 09 20:49:42 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Childcare should be a right, not a privilege.\n\nToday, we’re joining @FLOTUS to highlight the American Rescue Plan’s investments in childcare in Minneapolis. Because of this bill, Minnesota received over $500 million in additional support for childcare.","date":"Wed Feb 09 19:14:54 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Canceling $50,000 in student loan debt per borrower would increase the wealth of Black Americans by 40%.\n \nLet’s be clear, the student loan debt crisis is a racial justice issue.\n \n@POTUS it’s time to cancel it.","date":"Mon Feb 07 16:07:25 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Black women are 3 times more likely to die from pregnancy than white women.\n \nThis is unacceptable and we must do better.\n \nThat’s why we co-founded the Black Maternal Mortality Caucus and Emergency Task Force to address these unacceptable disparities.","date":"Fri Feb 04 19:59:15 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In 2012, DEA agents participated in a raid in Honduras in which four indigenous Hondurans were murdered, then lied to Congress &amp; covered it up. Nobody was held accountable. Today, Rep. Omar asked what this means for the fight against impunity &amp; US credibility in Central America. https://t.co/LEjHQWzUUH","date":"Thu Feb 03 23:20:21 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our District Office is here to serve YOU.\n \nOur office has helped thousands of constituents with cases ranging from difficulties with Medicare, Social Security, the VA, immigration, and more.\n \nWe will do everything in our power to fight for you and get you the help you need. https://t.co/HtxRHdaU9u","date":"Thu Feb 03 17:15:16 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“It’s shameful this Administration is continuing our involvement in the Yemen conflict with military assistance. Nearly a year ago, President Biden promised to end our involvement in Yemen.\"","date":"Thu Feb 03 01:31:59 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"This is a dereliction of what this Administration campaigned on, and out of step with a foreign policy agenda rooted in human rights and peace. The Administration must follow through on their promise and work to end our involvement in the war once and for all.”","date":"Thu Feb 03 01:31:59 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Administration must follow through on their promise and work to end our involvement in the war in Yemen once and for all.\n\nRep. Omar’s statement: \nhttps://t.co/uRk3t5kSWS https://t.co/HmYGnQg48i","date":"Thu Feb 03 00:54:10 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"You can also read the full statement here: https://t.co/dHewdU3f9T","date":"Wed Feb 02 23:54:57 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar’s statement on the proposed Ukraine defense package: https://t.co/q5JaynhhFY","date":"Wed Feb 02 23:34:38 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need to make the Child Tax Credit permanent.\n\nThis program drastically cut child poverty and provided a lifeline to millions of families. We have a moral responsibility to reinstate it.","date":"Wed Feb 02 14:11:13 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Heartbroken by this horrific shooting in our district. Our thoughts are with the victim and their family right now.","date":"Wed Feb 02 00:15:36 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every year, we provide more than $15 billion to subsidize the fossil fuel industry.\n \nWe introduced the End Polluter Welfare Act to end these harmful giveaways to polluters.","date":"Tue Feb 01 16:03:55 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Co-governance is one of the core values of our office and shapes the work we do every day.\n \nLast week, we had a district work week and we wanted to share some of the highlights with you.\n \nHere’s our district recap: \nhttps://t.co/gnVs6FfdHM","date":"Mon Jan 31 23:18:35 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Muslim ban will forever be a moral stain on our country’s history.\n \nLast year, the House passed the No Ban Act to ensure no future president has the power to ban people based on their religious affiliation ever again. The Senate must pass this bill &amp; send it to Biden's desk.","date":"Fri Jan 28 18:54:10 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It is way past time we legalize marijuana and expunge records for cannabis-related offenses.\n \nOur office is proud to co-sponsor the MORE Act to help make this a reality.","date":"Fri Jan 28 14:01:37 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we remember the 6 million Jews who were murdered during the Holocaust and redouble our efforts to stand up against antisemitism and all forms of religious discrimination. #HolocaustMemorialDay","date":"Thu Jan 27 22:19:22 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is a huge victory for our beautiful Boundary Waters! Shoutout to the advocates and organizers on the ground who made this win possible.","date":"Wed Jan 26 20:30:48 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Proud to team up with @SenWarren, @SenSchumer, @RepPressley, @RepJayapal, and @RepKatiePorter to call on the Biden Administration to cancel *at least* $50K of student loan debt per borrower. \n\nPresident Biden has the legal authority to cancel student debt and must act. https://t.co/fhQGamn4CY","date":"Wed Jan 26 16:46:11 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Student loan payments resume in less than 100 days.  \n \nThe pause on student loan payments has allowed millions of borrowers to start a business, participate in our economy, and save for the future.  \n \n@POTUS must use his authority and cancel student debt.","date":"Wed Jan 26 14:54:37 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Tune in for our town hall to hear about our ongoing work fighting for the 5th District.\n https://t.co/JRhIOYJtFg","date":"Tue Jan 25 23:18:46 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"TONIGHT: Our office will host our first town hall of 2022 at 5pm CT. \n \nCan’t wait to answer your questions! \n \nRegister here: https://t.co/4EGFlJfbbU https://t.co/IZYHnfO9TR","date":"Tue Jan 25 20:37:21 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Medicare for All will fully guarantee healthcare as a human right—no questions asked.\n \nNo premiums.\nNo deductibles. \nNo co-payments.","date":"Mon Jan 24 16:13:26 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In Minnesota, the weather may be cold, but our hearts are warm!\n \nLearn how to help our new neighbors here ⬇️\nhttps://t.co/CNhhzgPt3X","date":"Sun Jan 23 16:37:02 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is what good trouble looks like.\n\nSending love and strength to @RepBowman and other protesters who put their bodies on the line to protect voting rights. \n\nThe fight continues. ✊🏽","date":"Fri Jan 21 18:56:02 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Homes for All.\nMedicare for All.\nNo Student Debt.\nA Green New Deal.\n\nWe are fighting for policies that lift up all Americans.\n\nTogether we get to decide what is possible. https://t.co/MBJqH7Ahsx","date":"Thu Jan 20 22:24:20 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Next Tuesday at 5pm CT, our office will host our first town hall of the new year.\n\nWe will discuss the Build Back Better Act, voting rights, and answer any questions you have. \n\nJoin us! https://t.co/4EGFlJfbbU https://t.co/NL4zkNHV9l","date":"Thu Jan 20 14:53:15 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Poverty is a policy choice. \n\nProud of our city for leading the way. Last summer, our office introduced legislation to make guaranteed income a reality in localities nationwide. \n\nIt’s time we safeguard people’s economic well-being.","date":"Wed Jan 19 22:31:42 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last week, the House passed the Freedom to Vote: John R. Lewis Act.\n\nNow the Senate must abolish the filibuster and protect the right to vote.","date":"Wed Jan 19 17:14:30 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"PSA: You can now order FREE COVID-19 tests delivered to your home. You’ll get four free tests per household. \n\nOrder here: https://t.co/qn6F0s8jnm","date":"Wed Jan 19 14:05:43 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today we honor the life of Dr. Martin Luther King, Jr.\n \nLet’s continue to honor his legacy by working to create a more fair and just society for all. https://t.co/6rEtft9k7v","date":"Mon Jan 17 17:13:24 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every American deserves access to a safe and stable place to live. \n\nThat’s why Rep. Omar introduced the Homes for All Act to guarantee housing as a human right. This legislation would authorize the construction of 12 million new public and affordable housing units.","date":"Sat Jan 15 15:05:00 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, millions of parents who use the #ChildTaxCredit to pay for food, rent, and bills discovered the support they need is gone. It’s unacceptable.  \n\nThe Senate MUST restore the Child Tax Credit by passing the Build Back Better Act.","date":"Fri Jan 14 19:28:58 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thank you to our @mnnurses for all that you do. ❤\n\nWe won’t stop fighting until we create a system that puts the health and safety of nurses before profits. https://t.co/ziPA4UYoXo","date":"Thu Jan 13 22:08:16 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Protecting your right to vote is how we save our democracy.\n\nWe must end the filibuster and pass voting rights legislation through the Senate.","date":"Thu Jan 13 20:34:25 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Student debt is holding millions back from homeownership, opening a business, and saving for the future.\n\nOur office has led a few letters requesting @POTUS to keep his promise and cancel student debt. \n\nWe're still waiting.","date":"Thu Jan 13 14:52:52 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Child hunger shouldn’t exist.\n \nRep. Omar introduced the Universal School Meals Program Act to ensure that no child goes hungry. This legislation would provide free breakfast, lunch, dinner, and a snack to all students *AND* eliminate all school meal debt.","date":"Tue Jan 11 22:05:09 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Guantanamo Bay prison is a moral stain on our country. \n \nThe ongoing detention goes against the most basic standards of justice, and continues to damage lives and our reputation around the world.\n \nRep. Omar's op-ed:\nhttps://t.co/ZCMWFRUBCK","date":"Tue Jan 11 17:13:45 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Child Tax Credit has lifted millions of children out of poverty.\n \nIn our district, we were able to deliver over $30 million to 69,000 families.\n \nThe Senate must pass the Build Back Better Act and restore the Child Tax Credit.","date":"Mon Jan 10 16:10:56 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The coup attempt on January 6th was a warning for what’s to come if we don’t act. The work to prevent the next coup begins now.","date":"Thu Jan 06 14:02:12 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"You can read the full statement here: https://t.co/Fj9BHHMYid","date":"Thu Jan 06 14:02:12 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"That requires abolishing fundamentally antidemocratic elements of our system like the Senate filibuster and the electoral college, and it requires major investments in childcare, education, health and climate like the Build Back Better Act.","date":"Thu Jan 06 14:02:11 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"To stop the next coup, we must reinvigorate the democratic experience. That requires, at a minimum, passing the John Lewis Voting Rights Act and strengthening election laws around the country to prevent the next coup.","date":"Thu Jan 06 14:02:11 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"But it also requires reforming our institutions so that they are once again responsive to the core demands of our constituents.","date":"Thu Jan 06 14:02:11 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"A democracy is more than a form of government; it is primarily a mode of associated living, of conjoint communicated experience,\" John Dewey once said.","date":"Thu Jan 06 14:02:10 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Borrowing from demagogues around the world, authoritarians like Donald Trump filled the void, offering false promises while scapegoating immigrants, and religious and racial minorities.","date":"Thu Jan 06 14:02:10 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Trust in our government’s ability to tackle the biggest problems we face—from healthcare to climate to food insecurity—has cratered as a result.","date":"Thu Jan 06 14:02:09 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Inequality has skyrocketed, as has the cost of basics like healthcare and education, while the average American’s wages have not kept pace. Self-interested elites have prioritized profit and greed over the common good.","date":"Thu Jan 06 14:02:09 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If that’s not enough, they are stripping power from nonpartisan election officials and rewriting state laws to seize partisan control over election certification. The next coup is not only possible; it has already begun.","date":"Thu Jan 06 14:02:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"But the causes of the attempts to overturn our democracy run much deeper than Donald Trump. For decades, our institutions have been failing to meet the needs of the people they are tasked to represent.","date":"Thu Jan 06 14:02:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I know personally what happens when a government fails, civil strife takes hold, and people are displaced. And I know that coup attempts are rarely one-time affairs.","date":"Thu Jan 06 14:02:07 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In fact, as we speak, Donald Trump’s allies in statehouses across the country are seeking to erect barriers to voting—largely affecting low-income people, people of color, and seniors.","date":"Thu Jan 06 14:02:07 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"refusing a peaceful transition of power, pressuring election officials and his own administration to overturn results, and organizing a rally and march on the seat of government when his other efforts failed.","date":"Thu Jan 06 14:02:06 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"With each passing day, it becomes more and more clear that the outgoing President of the United States planned and executed the coup attempt...","date":"Thu Jan 06 14:02:06 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"No, January 6th was significant because it was an attack on the seat of our democracy, specifically designed to undermine, interrupt and overturn the most fundamental of democratic processes—an election—on the day its results were to be certified.","date":"Thu Jan 06 14:02:05 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"But the insurrection of January 6th was not solely significant for the havoc that it caused, the property destroyed, or the lives it cost.","date":"Thu Jan 06 14:02:05 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today marks one year since the attacks of January 6th. I will never forget the experience of fearing for my life, my fellow members, and staff on a day designed to show the strength of our democracy.","date":"Thu Jan 06 14:02:04 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I will never forget the call I made to the father of my children, asking him to tell my children I loved them if I couldn’t.","date":"Thu Jan 06 14:02:04 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s time to end federal subsidies to the fossil fuel industry. \n\nThat’s why we introduced the End Polluter Welfare Act to end the billions in tax giveaways to the very people responsible for polluting our water and lands.","date":"Wed Jan 05 20:27:52 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Make an appointment here: https://t.co/KeXtQeKs5O","date":"Wed Jan 05 15:29:08 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Right now, we’re seeing a drop in blood donations across Minnesota. The Minnesota Blood Bank reported that donations are at their lowest levels in over a decade. \n\nFor those that can, please consider donating blood at your nearest blood bank. Your donation could save a life.","date":"Wed Jan 05 15:29:07 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy New Year! Wishing you all a healthy, joyful, and meaningful 2022.\n \nCan’t wait to keep making progress with you in the new year. https://t.co/fXhFAYKCU9","date":"Sat Jan 01 17:50:16 +0000 2022","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Now would be a good time to cancel student debt @POTUS.","date":"Tue Dec 28 17:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Merry Christmas to all those celebrating! Wishing you and your family a holiday filled with love, peace, and joy.","date":"Sat Dec 25 15:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minnesota is expanding COVID testing across our state. \n \nFind more information at: https://t.co/3xiiZnJU6E","date":"Thu Dec 23 18:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The pandemic isn’t over. As people start gathering for the holidays, please get vaccinated, boosted, and tested to celebrate safely.","date":"Tue Dec 21 16:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Abolish the filibuster.","date":"Mon Dec 20 16:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As we close out 2021, we want to share what we have accomplished for the 5th District.\n\nEvery day we fight to make sure that people from all corners of the 5th District have a shot at the American Dream.\n\nWe can’t wait to keep making progress with you. #FightingForThe5th https://t.co/TT92VnPpYa","date":"Sat Dec 18 20:01:19 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"70% of voters oppose restarting student loan repayments. \n \nWe need to continue the freeze on repayments until the pandemic is over.\n \nBetter yet, we must cancel student debt. \nhttps://t.co/MV6JBcJgYj","date":"Fri Dec 17 15:19:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need the Build Back Better Act *AND* voting rights legislation.\n \nThe people are counting on us to deliver BOTH priorities— not pit them against each other.","date":"Thu Dec 16 22:10:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Please stay safe Minnesota. \n \nAs we continue to face unusual weather conditions, stay up to date with the latest forecast and Minnesota’s local NWS, @NWSTwinCities. \nhttps://t.co/WBgrjo1Pej","date":"Thu Dec 16 20:41:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🙏🏽 Thank you to our Minnesota doctors. Please get vaccinated and get your booster.\n\nhttps://t.co/81DDK96HkF https://t.co/a58WsStuAM","date":"Wed Dec 15 22:26:56 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s be clear: The Build Back Better Act that aims to tackle climate change and rapidly decarbonize our economy CANNOT include gifts for polluters.","date":"Wed Dec 15 20:45:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, the House passed our Combating International Islamophobia Act. \n \nWe’re one step closer to ensuring we have the resources needed to defend human rights and stop anti-Muslim hate worldwide.","date":"Wed Dec 15 17:55:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There are cynics who would rather see us divided on racial, ethnic, gender and religious lines.\n \nBut as Americans we should stand united against all forms of bigotry.\n\nRep. Omar’s speech in support of the Combating International Islamophobia Act: https://t.co/m2EL2UIO9w","date":"Tue Dec 14 23:43:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thank you, Mr. President! https://t.co/NgOhN6mqyD","date":"Tue Dec 14 19:29:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I got to stop by Webster Elementary School in Northeast this week to talk about my work in Congress.\n\nOne of my favorite parts of the job! https://t.co/Yx1UgD7NHD","date":"Tue Dec 14 17:55:19 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today the full House of Representatives votes on the Combatting International Islamophobia Act.\n \nUntil everyone is free to practice their religion, no one is.","date":"Tue Dec 14 15:43:24 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The House just passed the Protecting Our Democracy Act to safeguard our democracy including our amendment to extend whistleblower protections to interns + fellows.\n\nThis bill will restore our system of checks and balances, protect our elections, &amp; bolster congressional oversight.","date":"Thu Dec 09 21:35:15 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, the @HouseForeign Committee is marking-up our bill to create a special envoy to combat Islamophobia.\n \nThis is an important step to confront anti-Muslim hate and establish a comprehensive strategy for establishing U.S. leadership to stop Islamophobia worldwide. https://t.co/Yn1BPy4jpK","date":"Thu Dec 09 19:38:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Guaranteed income is the future.\n \nExcited our city created this pilot program. Learn more here ⬇️","date":"Thu Dec 09 15:35:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, the House approved a $768 billion Pentagon budget.  \n\nWe have a moral responsibility to reduce our defense spending and invest in the American people, not in weapons manufacturers.\n\nThat’s why Rep. Omar voted NO.","date":"Thu Dec 09 02:04:27 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need accountability for Rep. Boebert’s hateful, anti-Muslim remarks. \n\nThis blatant Islamophobia should have no place in the halls of Congress. https://t.co/U3OVolusl4","date":"Wed Dec 08 03:49:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Senate must block this weapons sale and send a clear message: Congress will not tolerate Saudi impunity as it commits war crimes and starves the people of Yemen.","date":"Tue Dec 07 22:22:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Student loan payments resume in less than 60 days. \n\n-89% of borrowers say they aren't financially secure enough to resume their student loan payments. \n-27% will spend at least a third of their income on their loan payments.\n\n@POTUS must lift this burden and cancel student debt.","date":"Mon Dec 06 22:38:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Great news! 🥳\n \nProud of U of M for taking bold action to reduce harmful climate-change emissions.","date":"Mon Dec 06 19:15:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Congratulations to fellow Minnesotan, Luke Becker for winning the National Teacher of the Year award! \n\nThank you for sharing your expertise with our students and making a difference for the next generation.\nhttps://t.co/AObMjamOHJ","date":"Fri Dec 03 20:59:47 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our office has been subjected to countless death threats in the wake of Rep. Boebert’s anti-Muslim remarks. \n \nTo confront anti-Muslim hatred, we must hold those who perpetuate it accountable—to show that we are truly a democracy that respects freedom of religion. https://t.co/w9VQN14Aw4","date":"Fri Dec 03 15:07:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Build Back Better Act included provisions based on our Zero Waste Act. \n\nIt includes $750 million to create a federal grant program to help local cities invest in zero waste initiatives and end toxic landfills.\n\nThis legislation will create jobs and protect our communities.💪🏽","date":"Thu Dec 02 18:12:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is great news for Lake Street!","date":"Thu Dec 02 14:24:24 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar chaired the @HouseForeign hearing on US-Africa relations.\n\nToday, Rep. Omar asked about the crisis in Ethiopia, next steps following the coup in Sudan and elections in Somalia. https://t.co/yHowZQGoRR","date":"Wed Dec 01 20:17:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar chaired the @HouseForeign hearing on US-Africa relations.\n\nRep. Omar asked about the travel bans to South Africa, what the US is doing to protect the human rights of African migrants in Libya, and decision to freeze the $700M in funding to Sudan in the wake of the coup. https://t.co/caL7YHmmeo","date":"Wed Dec 01 18:29:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Reminder: All Minnesota adults are eligible to get a booster shot to help protect against COVID-19.\n\nFind a location: https://t.co/LPRXOaFmuN","date":"Wed Dec 01 15:19:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"https://t.co/d4Z5Okynpp","date":"Wed Dec 01 01:22:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Part 2 here: https://t.co/d4Z5Okynpp","date":"Wed Dec 01 01:20:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“It was never an option for me to take off my hijab to run. Because I know that when we proudly stand up for our values—when we celebrate the diversity of this country, and the freedoms enshrined in our Constitution, others stand with us.” \n\nRep. Omar’s remarks: https://t.co/SeY0WV3CgN","date":"Wed Dec 01 01:18:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Islamophobia should have no place anywhere in America, let alone in the halls of Congress. You can watch the press conference led by @RepAndreCarson, @RepRashida, and @Ilhan below. https://t.co/NqbL5FQhiP","date":"Tue Nov 30 23:16:46 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Tune in for our town hall to hear about the Build Back Better Act and our ongoing work fighting for the 5th District.\n\n https://t.co/Td5gT7Q3Hm","date":"Tue Nov 30 22:28:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"TODAY: We’re holding our virtual town hall at 4pm CT to hear directly from you and carry your priorities to the People’s House!\n\nRegister here: https://t.co/O3OxK7QUDe https://t.co/53WXhNk6v0","date":"Tue Nov 30 18:37:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Today, we’re talking about why we need to make school meals universal and eliminate all school meal debt. It’s time we pass legislation to end child hunger. https://t.co/wA6kfqEXMC","date":"Mon Nov 29 22:03:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happening at 4pm CT! Can’t wait to talk with @SenTinaSmith about our work to guarantee universal school meals.","date":"Mon Nov 29 21:56:28 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“This is not about one hateful statement or one politician; it is about a party that has mainstreamed bigotry and hatred. It is time for Republican Leader McCarthy to actually hold his party accountable.”","date":"Mon Nov 29 19:53:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“To date, the Republican Party leadership has done nothing to condemn and hold their own members accountable for repeated instances of anti-Muslim hate and harassment.”","date":"Mon Nov 29 19:53:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“I believe in engaging with those we disagree with respectfully, but not when that disagreement is rooted in outright bigotry and hate.”","date":"Mon Nov 29 19:53:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“Instead of apologizing for her Islamophobic comments and fabricated lies, Rep. Boebert refused to publicly acknowledge her hurtful and dangerous comments. She instead doubled down on her rhetoric and I decided to end the unproductive call.”","date":"Mon Nov 29 19:53:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“Today, I graciously accepted a call from Rep. Lauren Boebert in the hope of receiving a direct apology for falsely claiming she met me in an elevator, suggesting I was a terrorist, and for a history of anti-Muslim hate.”","date":"Mon Nov 29 19:53:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar’s statement on her conversation with Rep. Lauren Boebert. https://t.co/B5JJVijXKI","date":"Mon Nov 29 19:53:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In the wealthiest country in the world, no child should ever go hungry. \n\nOn November 29th at 4pm CT, we’re hosting another Coffee and Kulan with @SenTinaSmith to discuss our legislation to provide free breakfast, lunch, and dinner to every student in America. https://t.co/SyDIw5prJ0","date":"Wed Nov 17 17:20:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy first night of Chanukah to everyone celebrating!","date":"Mon Nov 29 00:57:07 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Build Back Better Act will provide universal pre-k that will ensure every 3- and 4-year-old in America has access to high-quality early education. \n\nThis is HUGE.","date":"Tue Nov 23 21:57:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This fight isn’t over until insulin is free for individuals like Alec who do not have insurance.","date":"Tue Nov 23 17:17:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Build Back Better Act will cap out-of-pocket insulin costs at $35 per month. \n\nThinking of Alec Smith, a Minnesota restaurant manager who tragically passed away because he couldn’t afford the cost of his insulin.\n\nThis insulin cap is for him and so many others.","date":"Tue Nov 23 15:30:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"NEXT WEEK: Our office is hosting a virtual town hall on Tuesday at 4pm CT. \n\nWe’re going to discuss the passage of the Build Back Better Act and what that means for Minnesotans.\n\nRegister here: https://t.co/O3OxK7QUDe https://t.co/1vNEIWWoo9","date":"Mon Nov 22 22:12:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Exactly right. We should NEVER sell weapons to human rights abusers. \n\nCongress has the authority to stop these sales AND we must exercise that power.","date":"Mon Nov 22 18:46:32 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Paid leave.\nUniversal pre-k.\nAffordable childcare. \nMedicare hearing benefit. \nNutrition assistance for kids.\nLower prescription drug costs.\n\nThat’s what we passed in the Build Back Better Act.\n\nNow we need a vote in the Senate to deliver these investments to the American people.","date":"Mon Nov 22 14:18:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is great news, Senator! \n\nEarly detection saves lives. A reminder to schedule your mammogram or other preventative screenings today.","date":"Sat Nov 20 21:06:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Build Back Better Act finally passed the House yesterday!\n\nWe’re going to provide universal pre-k, green jobs, paid leave, and combat the climate crisis. https://t.co/RS8HfWo5CX","date":"Sat Nov 20 15:41:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“Now it is on the Senate to act. Promises have never been enough. We need a vote in the Senate to deliver these investments to the American people as quickly as possible.”","date":"Fri Nov 19 14:48:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“The Twin Cities has the worst housing shortage in the entire country—and Build Back Better would create a housing acquisition fund to address it.”","date":"Fri Nov 19 14:48:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“Minnesotans spend an average of over $16,000 a year on childcare—as much as they spend on mortgage payments—and Build Back Better would address it.”","date":"Fri Nov 19 14:48:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“We need good union jobs, and Build Back Better would invest in a civilian climate corps, and home health care workers paying fair wages. My constituents need the Build Back Better Act, and they can’t wait any longer.”","date":"Fri Nov 19 14:48:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“Minnesotans are facing the biggest housing affordability crisis in the country, a massive racial wealth and education gap, and a childcare affordability crisis. The Build Back Better Act is our opportunity to address this.”","date":"Fri Nov 19 14:48:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“From the beginning of this process, progressives have put our votes on the line to deliver needed relief to our constituents in the Build Back Better Act, and today we got the opportunity to pass it out of the House.”","date":"Fri Nov 19 14:48:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"From the beginning of this process, progressives have put our votes on the line to deliver needed relief to our constituents in the Build Back Better Act, and today we got the opportunity to pass it out of the House.\n\nRep. Omar’s full statement: https://t.co/y7NDW2KklO","date":"Fri Nov 19 14:48:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re getting close to passing the Build Back Better Act that will deliver universal pre-k, affordable childcare, green jobs, and paid family and medical leave.\n\nWe’re ready to deliver.","date":"Thu Nov 18 20:59:46 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The pause on student loan payments has allowed millions of borrowers to start a business, participate in our economy, and save for the future.\n \nImagine what could happen if borrowers had permanent relief.\n \nIt’s time to cancel student debt, @POTUS.","date":"Thu Nov 18 17:10:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Humans are capable of tremendous compassion. Naturally, we are caring and that is either nurtured in us or it is beaten out of us.\n\nYou can listen to the full conversation with @chrislhayes here: https://t.co/sBaRV8AN7Z https://t.co/ql5yCnUhK9","date":"Thu Nov 18 14:34:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minnesotans are facing the biggest housing affordability crisis in the country, a massive racial wealth and education gap, and a childcare affordability crisis.\n\nMinnesotans need Build Back Better and we can't wait any longer. https://t.co/I7xQQGhCui","date":"Thu Nov 18 00:25:56 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In the wealthiest country in the world, no child should ever go hungry. \n\nOn November 29th at 4pm CT, we’re hosting another Coffee and Kulan with @SenTinaSmith to discuss our legislation to provide free breakfast, lunch, and dinner to every student in America. https://t.co/SyDIw5prJ0","date":"Wed Nov 17 17:20:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Who’s excited to Build Back Better? 🙋🏽‍♀️ https://t.co/h3Knqh7wRc","date":"Wed Nov 17 14:29:07 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re the only industrialized country NOT to guarantee paid family and medical leave. \n \nNow is our chance to change this with the Build Back Better Act.","date":"Wed Nov 17 01:36:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Here’s an idea: stop arming human rights abusers. https://t.co/W6Lk1BCugO","date":"Tue Nov 16 14:00:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is a BFD for Minnesota’s indigenous community and a welcome announcement from our Governor! https://t.co/SaSgvxzvcs","date":"Mon Nov 15 22:51:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today would be a great day to pass the Build Back Better Act.","date":"Mon Nov 15 19:30:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Build Back Better Act will make the largest investment in clean energy EVER.\n\nThis is a much-needed step to address the climate emergency with the urgency it deserves.","date":"Sun Nov 14 15:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Horrific and unacceptable. No one should ever be subjected to this kind of bigoted hate. \n \nWe must all demand a Minnesota and country where no one is targeted because of the color of their skin. \n \nThese injustices must end. \n \nhttps://t.co/PTIM8UCqlk","date":"Sat Nov 13 19:05:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re fighting for the Build Back Better Act because we know what’s at stake:\n \nGreen jobs\nUniversal pre-k \nMedicare expansion\nAffordable childcare\nExpanded child tax credit\nPaid family and medical leave\n \nIt’s time to invest in the American people.","date":"Sat Nov 13 15:22:38 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It's unconscionable to sell weapons to Saudi Arabia while they slaughter innocent people and starve millions in Yemen, kill and torture dissidents, and support modern-day slavery.\n\nToday, Rep. Omar introduced a bill to block the $650M sale to Saudi Arabia.\nhttps://t.co/1U0BM0dJdQ","date":"Fri Nov 12 22:08:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today we honor our veterans for their sacrifice to our country.\n\nBut it is not enough to thank them. We must act to end the injustices far too many veterans face.\n\nNo veteran should go hungry.\nNo veteran should sleep on the street.\nNo veteran should go without the care they need.","date":"Thu Nov 11 14:05:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We don’t have time for incrementalism.\n \nClimate change is here, and it is an existential threat to humanity.\n \nWe must take bold, collective action to address this crisis.\nhttps://t.co/7XNELbsgoF","date":"Wed Nov 10 21:46:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There are only 5 DAYS left for nonfilers to get this much-needed benefit in 2021. Sign-up here: https://t.co/KtjvbxJRFB","date":"Wed Nov 10 18:14:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Child Tax Credit is benefiting 68,000 families in MN-05. So far, over $30 million has already gone directly to families in our community.\n \nThis program has already reduced child poverty. \n \nLet’s make it permanent.","date":"Wed Nov 10 18:14:38 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We provide more than $20 billion every year to subsidize the fossil fuel industry.\n \nPolluters shouldn’t be rewarded for poisoning our communities.\n \nThat's why Rep. Omar introduced the End Polluter Welfare Act to end fossil fuel subsidies AND hold polluters accountable.","date":"Wed Nov 10 14:44:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The State Department oversees about $170 billion in arms sales every year, including to some of the most egregious human rights abusers in the world. \n\nWe need to stop arming human rights abusers, full stop.\n\nProud to co-lead this bill.","date":"Tue Nov 09 20:46:51 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"President Biden can cancel student debt with the flick of a pen AND boost our economy in the process. \n \nLast month, Rep. Omar led a letter calling on the Administration to release the memo on student debt cancellation, and ultimately cancel student debt.\n \nWe’re still waiting.","date":"Mon Nov 08 17:17:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"And for those reasons, I voted NO on the infrastructure package.\"","date":"Sat Nov 06 03:54:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"You can view the full statement here: https://t.co/l80rK56DgD","date":"Sat Nov 06 03:54:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"My community cannot wait any longer for these much-needed investments that will be delivered through the Build Back Better Act. I cannot in good conscience support the infrastructure bill without voting on the President’s transformative agenda first.\"","date":"Sat Nov 06 03:54:11 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"Minnesota is experiencing some of the fastest rising temperatures in the nation. The Build Back Better Act makes the boldest investment in history in the climate crisis—investing in zero waste initiatives and creating jobs in the process.\"","date":"Sat Nov 06 03:54:11 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"In the Twin Cities, we have the worst housing shortage in the nation. The Build Back Better Act addresses it, by investing $150 billion in affordable housing.\"","date":"Sat Nov 06 03:54:11 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"The Build Back Better Act addresses it by creating a universal pre-k program, affordable childcare, and paid family and medical leave.\"","date":"Sat Nov 06 03:54:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"Right now, families across my district are struggling with the rising cost of childcare, the inability to get family leave to take care of their kids and deal with a medical emergency.\"","date":"Sat Nov 06 03:54:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"From the beginning, I have been clear that I would not be able to support the infrastructure bill without a vote on the Build Back Better Act.\"","date":"Sat Nov 06 03:54:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"Passing the infrastructure bill without passing the Build Back Better Act first risks leaving behind childcare, paid leave, health care, climate action, housing, education, and a roadmap to citizenship.\"","date":"Sat Nov 06 03:54:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re going to tax the rich to provide universal pre-k, green jobs, and paid family and medical leave. Let’s go!","date":"Fri Nov 05 19:45:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re close to passing the Build Back Better Act in the House that will deliver:\n \nGreen jobs\nUniversal pre-k \nMedicare expansion\nPaid family and medical leave\nLower prescription drug costs\n \nAnd it will be fully paid for by making the ultra-wealthy pay their fair share.","date":"Fri Nov 05 17:30:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Billionaires grew their wealth by 70% during the pandemic.\n\nThis is NOT how we build a fair and moral society.\n\nTax the rich.","date":"Fri Nov 05 14:58:47 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Paid family and medical leave was added back into the Build Back Better framework. \n\n73% of the American people want this done. We won’t stop fighting to keep this in the final bill.","date":"Thu Nov 04 21:12:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s go! 5- to 11-year-old children are now eligible for the COVID-19 vaccine. \n\nSign-up and learn more here: https://t.co/e1NCgSrnLv","date":"Thu Nov 04 20:10:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Diwali to everyone celebrating the Festival of Lights in Minnesota and around the world. \n\nMay this holiday be filled with light and love.","date":"Thu Nov 04 18:15:27 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, the @HouseForeign Committee held a hearing on assessing progress and challenges within the State Department’s management and operations. \n\nIt’s critical we work to ensure diplomats can do on-the-ground, face-to-face diplomacy to broaden our overseas engagement. https://t.co/WgPYNqgB6X","date":"Wed Nov 03 17:51:28 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minneapolis: Today is the day to make your voice heard. \n \nThe beautiful thing about our democracy is no matter your zip code or wealth—your vote counts the same.\n \nFind your polling place at https://t.co/k12YaErVk4","date":"Tue Nov 02 14:00:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We fought to deliver historic investments that will change people’s lives through the Build Back Better Act. \n \nThis is about providing free preschool, universal childcare, housing investments, improved healthcare, and green jobs. \n \nWe’re ready to deliver. 💪🏽","date":"Mon Nov 01 21:04:46 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Tomorrow, Minneapolis has an important election. \n \nThis is your chance to make your voice heard. \n \nFind your polling place: https://t.co/k12YaErVk4","date":"Mon Nov 01 19:33:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Reproductive rights, voting rights, health care, racial justice, climate, immigration reform, DC statehood, and democracy itself are all under attack. \n \nIt’s time to expand the Supreme Court. https://t.co/l2Q7Mjyua9","date":"Mon Nov 01 16:58:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🌎Millions of clean energy jobs\n🏫Universal pre-k\n👶🏽Monthly child allowance\n👵🏽Expanded care for seniors\n♻️Zero Waste\n🏘Affordable housing\n🩺Medicare expansion\n \nThe Build Back Better Act is one of the most important pieces of legislation, and we need to pass it immediately.","date":"Fri Oct 29 22:06:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Elections in Minneapolis are Tuesday! Find your voting location here: https://t.co/y9xGnu4dGE","date":"Fri Oct 29 15:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Fossil fuel companies have polluted our air, land, and water for profit – despite knowing the devastating impact it has on our communities.\n \nTemporary profits cannot continue to be prioritized over the future of our planet.\n \nIt’s past time to hold these companies accountable. https://t.co/F8bsVeM2M5","date":"Thu Oct 28 21:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If we are going to address human trafficking, we have to think holistically about humane immigration systems, being siblings of one another and the education of young girls across the world. \n \nThank you @HouseForeign for holding this important hearing. https://t.co/RjoVy9NqYo","date":"Thu Oct 28 18:28:35 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Proud to hold the gavel in the @HouseForeign subcommittee hearing yesterday! https://t.co/PgKPOkU0g4","date":"Thu Oct 28 15:20:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The United States is the only industrialized country in the world not to guarantee family and medical leave.\n\nIt’s an outrage.\n\nBuild Back Better is our opportunity to change it.","date":"Thu Oct 28 13:44:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Student debt is not the result of “poor choices.” \n\nIt’s the result of a two-tiered education system—one for the rich and another for the poor and middle class, who have to pay off that education for the rest of their lives.\n\nIt’s time to lift the burden and cancel student debt.","date":"Wed Oct 27 13:33:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The @EdLaborCmte held a hearing on how workplace vaccination policies can protect Americans’ lives and livelihoods.\n\nYou can watch Rep. Omar’s remarks below. https://t.co/8jbqSrCk5p","date":"Wed Oct 27 00:25:27 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today our office received a package with a suspicious substance and a threat reading “The Patriarchy will rise again. Merry f***ing Christmas.”\n\nEveryone on our team is okay. We reported the package to Capitol Police and they determined it to be safe.","date":"Tue Oct 26 20:24:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Investment in childcare for toddlers, by country\n🇳🇴 $29,726\n🇮🇸 $24,427\n🇫🇮$23,353\n🇩🇪 $18,656\n🇸🇪 $14,436\n🇦🇹 $12,864\n🇸🇮 $11,664\n🇳🇿 $10,349\n🇪🇸 $9,084\n🇨🇱 $8,450\n🇱🇹 $8,184\n🇦🇺 $8,088\n🇭🇺 $7,222\n🇮🇱 $3,327\n🇺🇸 $500\nIt’s time we finally invested in childcare. Build Back Better can fix that.","date":"Tue Oct 26 19:15:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, @TLHumanRights held a hearing on counter-terrorism measures and their impact on human rights. Checkout Rep. Omar’s questions on the topic. https://t.co/R8O2W61Yqr","date":"Tue Oct 26 15:58:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s be clear: The Build Back Better Act will make the largest investment to combat climate change in our country’s history.\n\nEvery single climate provision MUST stay in the bill.","date":"Tue Oct 26 13:00:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Prince showed that it was okay to be a short, Black kid from Minneapolis and still change the world.\n \nToday, we led the Minnesota Congressional Delegation with @SenAmyKlobuchar to honor Prince with the Congressional Gold Medal. https://t.co/sa6ffF6Ffz","date":"Mon Oct 25 22:01:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Shoutout to @SenTinaSmith, @BettyMcCollum04, @RepDeanPhillips, @RepAngieCraig, @RepHagedorn, @RepTomEmmer, @RepFischbach, and @RepPeteStauber for joining us to honor @Prince! #PrinceGoldMedal","date":"Mon Oct 25 22:01:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"“We all do better when we all do better.” -Paul Wellstone\n\nToday marks 19 years since Paul Wellstone passed away. We will never forget his bold leadership and advocacy for a more just Minnesota and country.","date":"Mon Oct 25 21:09:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re in direct conversations with families in our community every single day.\n\nThey want us to strengthen the care economy, invest in affordable housing, and combat the climate crisis.\n\nWe won't stop fighting until we get this done. https://t.co/i4W675yoOL","date":"Fri Oct 22 23:05:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In 3 weeks, @POTUS will attend the UN Climate Change Conference to push for global climate cooperation.\n\nHis advocacy will ring hollow if we can't deliver climate action in the Build Back Better Act.\n\nIt's not just American leadership at stake, but our livelihoods. Our letter: https://t.co/AYDq8kxfQu","date":"Fri Oct 22 21:02:26 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Black women are 40% more likely to die from breast cancer than white women. \n\nThis shouldn’t be happening in the United States. \n\nProud to join our @TheBlackCaucus colleagues to advocate for prevention, treatment, and research for this disease. #PinkFriday https://t.co/TeerJKssr6","date":"Fri Oct 22 19:04:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"TOMORROW: We’re holding our town hall at 11am CT. \n \nCan’t wait to answer your questions!","date":"Fri Oct 22 18:23:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"What’s on the line? \n\n-Paid leave\n-Green jobs \n-Universal pre-k\n-Medicare expansion \n-Lower prescription drug costs\n\nNow is the time for ALL Democrats to negotiate in good faith so that we can pass the entirety of the President’s transformative agenda as quickly as possible. https://t.co/xyvzFQaZyS","date":"Thu Oct 21 20:25:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we introduced legislation with @janschakowsky to create a special envoy to better understand the global problem of anti-Muslim bigotry.\n\nIt will establish a comprehensive strategy for establishing U.S. leadership in combatting Islamophobia worldwide.https://t.co/2kjqqcSHca","date":"Thu Oct 21 14:11:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Biden administration just announced their plan to preserve the Boundary Waters by ordering a study that could lead to a 20-year ban on mining upstream. \n\nThis is an important step to protect our beautiful Boundary Waters! 💪🏽","date":"Wed Oct 20 22:43:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Immigration reform is essential, urgent, and popular. \n\nWe must deliver through budget reconciliation. #TheMomentIsNow","date":"Wed Oct 20 19:47:07 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This Saturday, we’re holding our monthly town hall at 11am CT.  \n\nSee you soon! Register: https://t.co/PwqeYXKg3H https://t.co/LVXNf0PRUv","date":"Wed Oct 20 12:57:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This Saturday, we’re holding our monthly town hall at 11am CT.  \n\nSee you soon! Register: https://t.co/PwqeYXKg3H https://t.co/LVXNf0PRUv","date":"Wed Oct 20 12:57:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In Minnesota, the average cost for an infant in a childcare center is $16,164/year. \n\nWe need to make universal childcare a reality.","date":"Tue Oct 19 22:12:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Cancelling student debt would boost GDP by up to $108 billion per year.\n\nIt’s time to cancel student debt. All of it.\n\nThat’s why Rep. Omar led a letter to @POTUS urging him to release the memo on student debt cancellation and cancel student debt.","date":"Tue Oct 19 18:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We have an opportunity to pass the most consequential economic legislation since the New Deal with the Build Back Better agenda. \n\nWe can: \n-provide universal pre-k \n-address the climate crisis\n-lower prescription drug costs \n-create millions of good-paying jobs\n\nLet’s deliver.","date":"Tue Oct 19 12:45:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Clean drinking water is a human right. \n\nOn the 49th anniversary of the Clean Water Act, we must renew our commitment to protect the health of our communities.  \n\nThat’s why Rep. Omar co-introduced the THRIVE agenda to ensure ALL communities have access to safe and clean water.","date":"Mon Oct 18 20:34:19 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need to eliminate all student debt and guarantee debt and tuition-free public colleges.\n\nWith the Build Back Better Act, we will move one step closer to achieving this with free community college.\n \nToday, we visited @MplsCollege to discuss college affordability. https://t.co/K8uaOINSrM","date":"Mon Oct 18 18:16:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The top 1% controls more wealth than the entire middle class. \n\nWith the Build Back Better Act, they will finally pay their fair share in taxes that will help provide paid leave, green jobs, universal pre-k, free community college, nutrition assistance for kids, and so much more.","date":"Fri Oct 15 21:19:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"You can view the full statement here: \n\nhttps://t.co/M8pQZR6JKc https://t.co/gcXcV3mSxe","date":"Fri Oct 15 20:18:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"It also includes living up to our moral responsibility to resettle those fleeing oppression around the world, including Africa. President Biden must follow through on his commitment to raise the refugee cap next year and once we do that, the rest of the world should follow.\"","date":"Fri Oct 15 20:12:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"That includes support for peaceful elections and the UN-recognized transitional government, full accountability for crimes against humanity, war crimes, and human rights abuses committed during the Civil War and the ongoing migrant crisis.\"","date":"Fri Oct 15 20:12:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"But much of that money has been diverted to militias and human traffickers. The U.S. needs a comprehensive strategy to address the ongoing human trafficking and modern day slavery crisis in Libya, and I was proud to author and pass legislation this year to require just this.\"","date":"Fri Oct 15 20:12:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"I am deeply disturbed by the latest reports of rampant abuse, torture, sexual violence and extortion of migrants in Libya, many from sub-Saharan Africa.\"","date":"Fri Oct 15 20:12:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"\"Instead of welcoming the thousands of refugees fleeing violence and instability, the Libyan coast guard hands migrants over to militias, who systematically torture, rape, abuse and enslave them. Instead of welcoming refugees, the EU has sent $455 million to Libya since 2015.\"","date":"Fri Oct 15 20:12:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It is National School Lunch Week. \n \nWe introduced the Universal School Meals Program Act to ensure that no child goes hungry. \n \nThis legislation would provide free breakfast, lunch, dinner, and a snack to all students AND eliminate all school meal debt.","date":"Fri Oct 15 14:06:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our office stands in solidarity with all those organizing and fighting for a livable planet.\n \nIt’s way past time we treat climate change like the national emergency that it is.","date":"Thu Oct 14 19:49:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Bold investments in good-paying union jobs, climate action, immigration reform, and caregiving are essential. \n \nYesterday, we joined members of the @USProgressives Executive Board in a letter to House leadership to protect the scope of the Build Back Better Act. https://t.co/EBshEnq2ec","date":"Thu Oct 14 17:46:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Child Tax Credit is expected to cut child poverty by 50%. \n \nSo far, over $30 million has gone out to families in MN-05. \n \nLet’s make it permanent.","date":"Thu Oct 14 14:03:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"88% of Americans support lowering prescription drug prices\n\n84% support expanding Medicare to cover dental, vision &amp; hearing\n\n73% support paid family/medical leave\n\nLet's be clear: there is no political justification for opposing the Build Back Better Act other than corruption.","date":"Wed Oct 13 20:47:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Get vaccinated. Protect yourself and our communities.","date":"Wed Oct 13 19:12:41 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Next Saturday, our office will hold our monthly town hall at 11am CT. \n \nWe will discuss the Build Back Better Act, the Child Tax Credit, and student debt cancellation. \n \nRegister here:https://t.co/PwqeYXKg3H https://t.co/m0VkkCJLbu","date":"Wed Oct 13 14:57:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Investments in childcare can’t wait. \n\nThe Build Back Better Act will save families THOUSANDS of dollars in childcare costs every year. \n\nIn Minnesota, a typical family with 2 kids will save $26k on childcare. \n\nThis is our chance to deliver affordable childcare.","date":"Tue Oct 12 21:31:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Student debt is a policy failure. \n \nCancelling student debt is both the morally right and economically sound thing to do.\n \nThat’s why we led a letter to @POTUS asking him to release the memo on student debt cancellation and cancel student debt. https://t.co/7BwgRxZoXx","date":"Tue Oct 12 18:29:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"President Biden can cancel student debt with the flick of a pen. \n\nToday, we are calling on the Administration to release the memo on student debt cancellation and #CancelStudentDebt. https://t.co/L2VnCNkXD8","date":"Fri Oct 08 16:40:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Paid leave\nHealthcare\nClimate action\nAffordable housing\nImmigration reform\n \nThese were the priorities we promised. And this is what we must deliver.","date":"Thu Oct 07 19:11:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Stop saying we can’t afford universal childcare. https://t.co/6wDW0P5WUP","date":"Thu Oct 07 16:20:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Congratulations, Senator! He is adorable ❤️🥳","date":"Wed Oct 06 17:44:46 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need BOTH the Build Back Better Act AND the infrastructure bill. https://t.co/f8PXV6EJjB","date":"Wed Oct 06 13:42:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"For far too long, Black women and girls have been punished at work and school simply for existing as themselves. \n \nThe CROWN Act is a necessary step to end race-based hair discrimination.","date":"Tue Oct 05 17:12:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is heartbreaking. We urge our fellow Minnesotans: please get vaccinated. https://t.co/eSWL9PHJwh","date":"Tue Oct 05 13:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Wealth of U.S. billionaires: $3.65 trillion\n\nEstimated annual cost of the Build Back Better Act: $350 billion\n \nWe don’t suffer from scarcity. We suffer from greed.","date":"Tue Oct 05 01:18:33 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Reminder: the Build Back Better Act is President Biden’s agenda, not progressives.\n \nAnd we are prepared to deliver the votes to send it to his desk.","date":"Mon Oct 04 20:09:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"-Paid leave\n-Universal child care\n-Green jobs \n-Medicare expansion\n-Affordable housing\n \nThe Build Back Better agenda that we’re fighting for isn't some fringe wish list. These policies aren’t only necessary, they are popular. https://t.co/vIo2j4CbbC","date":"Fri Oct 01 20:58:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"How will we fund the Build Back Better Agenda? \n\nIt’s going to be paid for by making sure billionaires and corporations finally pay their taxes.\n\nIt’s time to deliver.","date":"Thu Sep 30 22:59:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Skin-lightening cosmetics are part of an $8.6B global industry.\n\nThese products have real-life consequences.\n\nThe U.S. should be part of the advocacy to condemn and limit the usage of these products and change the ideas of beauty standards.  \nhttps://t.co/pOPOwAxvBQ","date":"Thu Sep 30 19:52:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We remain fully committed to passing President Biden’s entire Build Back Better agenda and delivering transformative change. \n\nIt is what we promised voters when they delivered us the House, Senate, and White House — one supported by 96 percent of the Democratic Caucus. https://t.co/Lt2IMAwEfi","date":"Thu Sep 30 14:01:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Paid leave. \nGreen jobs. \nUniversal pre-k. \nMedicare expansion.\nFree community college. \nNutrition assistance for kids.\nLower prescription drug costs. \n\nThat’s what’s included in the Build Back Better Act. \n\nLet’s get this done.","date":"Wed Sep 29 18:05:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Your vote is your voice.\n \nIt’s #NationalVoterRegistrationDay, Minnesota! Please make sure you’re registered and encourage your friends, family, and neighbors to check at https://t.co/K0NExDg5rs.","date":"Wed Sep 29 01:00:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Lowering drug prices has to be part of the Build Back Better reconciliation package.\n\nPass it on.","date":"Tue Sep 28 23:55:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need comprehensive strategies for the Sahel, Somalia, and Democratic Republic of Congo. \n\nToday, @HouseForeign held a hearing to discuss our approach to conflict in Africa and why a comprehensive strategy is needed. https://t.co/aTkBhBkbQL","date":"Tue Sep 28 23:10:46 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"From the beginning of this process, we’ve been clear: the infrastructure package and the Build Back Better reconciliation bill are two parts of a whole, and they must be passed together. \n \nAny other way goes against everything the President and Congressional Democrats promised. https://t.co/HuIwXUG4pt","date":"Tue Sep 28 21:18:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Refugees are welcome here.\n\nThis weekend, we joined @RepGwenMoore to meet with Afghan refugees at Fort McCoy and see the resettlement process firsthand after hearing reports of mistreatment. \n\nIt’s crucial our new neighbors are treated with respect and dignity. https://t.co/2NtEdIeCxJ","date":"Mon Sep 27 20:57:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Great news! Student organizing matters 💪🏽\n\nNow Congress should do the same.","date":"Mon Sep 27 19:08:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Americans need the Build Back Better agenda.\n\nWe will not leave behind childcare, paid leave, healthcare, housing, climate action, and a long-overdue road map to citizenship.\n\nOur op-ed on why we will put our votes on the line for the Build Back Better Act:https://t.co/LeuYWaGoKI","date":"Mon Sep 27 17:06:32 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Now is not the time to spend billions of dollars to bolster our defense budget while millions of Americans remain housing and food insecure. \n\nWe should be investing in the American people, not in weapons manufacturers.\n\nThat’s why Rep. Omar voted NO on the $760B Pentagon budget.","date":"Fri Sep 24 21:10:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need a national commitment to ensure that every American has a high-quality home they can afford. \n \nToday, Rep. Omar introduced the Affordable Housing Opportunities Made Equitable (HOME) Act with @SenJeffMerkley to tackle the affordable housing crisis. https://t.co/FIkfJfcooS","date":"Fri Sep 24 19:35:30 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The proposals in the Build Back Better bill will allow people to feel real hope that the government has their backs, and that they have real opportunity now.\n\nThe Biden agenda is our agenda. It’s the agenda for the people. \n\nLet’s deliver.\nhttps://t.co/N6atA5bbG7","date":"Thu Sep 23 23:24:07 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Asylum is a right. \n\nRep. Omar joined members to condemn the abuse and inhumane treatment of Haitians at the border. \n\nTitle 42 must be repealed. https://t.co/UAs751MPbK","date":"Wed Sep 22 22:19:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We have the House, Senate, and White House—there are no excuses for our inability to provide a pathway to citizenship.\n\nThis is our once in a lifetime opportunity to do the right thing and create an immigration system that brings humanity to the forefront. https://t.co/TiZ2QPGoMG","date":"Wed Sep 22 18:38:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We provide over $20 billion in tax giveaways to Big Oil and Gas every year.\n\nPolluters should not be rewarded for poisoning our communities.","date":"Tue Sep 21 23:05:26 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"No one deserves to be thrown out of their home.\n\nProud to join @RepCori and @SenWarren to protect renters from eviction by giving HHS the authority to create federal eviction moratoriums. \n\nTogether we will make sure everyone in this country has a stable home and life of dignity. https://t.co/0S3Xr4kPWk","date":"Tue Sep 21 20:24:19 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, Rep. Omar led a letter calling on the Biden Administration to end the continued implementation of visa sanctions enacted under President Trump. \n \nThese harmful sanctions have resulted in increased removals of refugees and asylum seekers from Africa and Southeast Asia. https://t.co/mT9aRMWXwr","date":"Tue Sep 21 17:02:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar introduced 6 amendments for this year’s National Defense Budget to uphold universal human rights and limit our global military presence.\n \nIt’s time to center the needs of the American people, not write blank checks to appease defense contractors and special interests. https://t.co/FL4rmk7ZUn","date":"Mon Sep 20 17:13:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The pandemic is far from over. It’s critical we extend unemployment assistance while millions are still struggling to make ends meet. \n \nProud to join my sister @RepAOC in fighting to extend lifesaving UI payments.","date":"Sat Sep 18 15:48:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There are limited options available to purchase kosher and halal food through the Emergency Food Assistance Program.\n\nOur federal feeding programs should be equitable and accessible for all people who have culturally and religiously mandated dietary restrictions.\n \nOur letter: https://t.co/ekoi34yl88","date":"Fri Sep 17 21:32:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There are concerning reports of mistreatment faced by Afghan refugees at Fort McCoy. \n \nThese families fled their homes and left everything behind. They should be treated with compassion and dignity.\n \nProud to partner with @RepGwenMoore to get answers. \n \nhttps://t.co/pYoCQNcULH","date":"Fri Sep 17 18:37:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Grateful every day to represent our community in the People’s House!\n \nThank you to everyone who joined our town hall last night.\n \nIf you missed our town hall, you can watch a livestream here: https://t.co/GwmqBxxkti https://t.co/iT1rS4I71y","date":"Thu Sep 16 00:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In Minnesota, the criminal statute of limitations for reporting sexual violence ends today.\n\nThis victory wouldn’t be possible without the courageous survivors who fought for this legislation.\n\nWe will continue our fight to lift up survivors and hold predators fully accountable.","date":"Wed Sep 15 22:55:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Wishing the Jewish community in Minnesota and around the world a meaningful and easy fast this Yom Kippur.\n \nG'mar Chatima Tova.","date":"Wed Sep 15 21:59:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The #ChildTaxCredit is benefiting 69,000 families in MN-05. A total of $30.1 million has gone directly to families in our community.\n \nWe’ve been able to cut childhood hunger and poverty.\n \nLet’s make it permanent.","date":"Wed Sep 15 12:53:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"What’s in the Build Back Better Act?\n \nUniversal preschool \nFree community college\nLower prescription drug costs\nNutrition assistance for kids\nInvestments in green jobs\n\nWe’re going to pay for it by ensuring the uber-wealthy and corporations finally pay their fair share in taxes.","date":"Tue Sep 14 20:04:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"TONIGHT: We’re holding our monthly town hall at 5:30pm CT.\n \nCan’t wait to answer your questions!\n \nRegister here: https://t.co/fjpcZOzR0u https://t.co/RmfLUzjrcX","date":"Tue Sep 14 17:03:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, @SecBlinken testified before the @HouseForeign Committee on the end of the war in Afghanistan. \n\nWatch Rep. Omar’s remarks below. https://t.co/mBzZsmNMXs","date":"Tue Sep 14 00:01:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Tomorrow, our office is holding an in-person town hall at 5:30pm CT to hear directly from you and carry your priorities to the People’s House!\n\nRegister here: https://t.co/fjpcZOzR0u https://t.co/adGnXxFbjy","date":"Mon Sep 13 21:01:30 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Immigrant justice means recognizing that our communities are not divided by citizenship or status – that the success of each of us is deeply connected to the success of those around us.\n\nYesterday, we joined a forum with @PueblosMN to discuss immigrant justice. ✊🏽 https://t.co/65lMqCzFIX","date":"Mon Sep 13 18:35:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Congratulations @RepBarbaraLee on this well-deserved honor! We’re grateful to have a champion for peace, justice, and human rights represented on the world stage.","date":"Mon Sep 13 17:13:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Young Minnesotans are stepping up to keep our communities safe. 💪🏽❤️\n\nIf you haven’t gotten your COVID vaccine, please get vaccinated: https://t.co/ypN5xUgwND","date":"Mon Sep 13 13:59:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"On September 11th our world changed forever. \n\nWe will never forget the thousands of Americans who lost their lives and the sacrifice, courage, and heroism displayed by our first responders.\n\nWe will continue to fight to care for first responders and families who lost loved ones.","date":"Sat Sep 11 12:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today marks #WorldSuicidePreventionDay.\n\nMental health is just as important as our physical health.\n\nIf you or someone you know is experiencing suicidal thoughts, you can reach out to the Suicide Prevention Lifeline at 1-800-273-TALK (8255) or the Crisis Text Line at 741741.","date":"Fri Sep 10 22:42:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we celebrated the completion of the 35W downtown to crosstown reconstruction project!\n\nExcited for better commutes for members of our community. \n\nProud of the work on the state, local and federal level to make this happen. https://t.co/T4MMGiO1iz","date":"Fri Sep 10 21:16:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"https://t.co/ZmWQ2S1nez","date":"Fri Sep 10 16:14:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Billionaire wealth increases during the pandemic:\n\nJeff Bezos- $75 billion\nWarren Buffett- $37.5 billion\nElon Musk- $150.8 billion\n\nBillionaire true tax rate:\n\nJeff Bezos-  .98%\nWarren Buffett-  .1%\nElon Musk-  3.27%\n\nTax the rich.","date":"Fri Sep 10 16:14:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our office has been working to help as many Afghans as possible. \n\nAs a refugee, I know finding a stable home is a matter of life or death.\n\nThat’s why we have fought to give other families the same opportunity to come to the U.S. and rebuild their lives. \nhttps://t.co/rOZCzIWIg7","date":"Fri Sep 10 13:38:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Line 3 would pump some of the dirtiest fossil fuels, polluting our state and violating tribal treaty rights.\n\nNow is the time to #StopLine3. \n\nShoutout to my sisters @RepPressley, @RepCori, @RepRashida, @MaryKunesh9, @RepAOC, and @RepJayapal for their work to stop this pipeline. https://t.co/lBokLb403S","date":"Thu Sep 09 21:46:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Love being in community with you all! ❤️\n\nNext week, our office will hold another outdoor town hall on Tuesday at 5:30pm CT. \n\nRegister here: https://t.co/fjpcZOzR0u https://t.co/SaGKebVLt7","date":"Thu Sep 09 13:17:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As we begin another school year, it’s critical districts have the support they need to reopen safely and make up for lost time in the classroom. \n\nProud we’re delivering $1.3 billion for Minnesota schools 💪🏽#Delivering4MN https://t.co/Y2dhxqyi78","date":"Wed Sep 08 21:59:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The climate crisis is now. \n\nWe can’t stop pushing for a #GreenNewDeal to save our planet.","date":"Wed Sep 08 18:03:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Wishing the Jewish community in Minnesota and around the world a joyful and peaceful New Year.\n\nI hope this year brings you light, love, and happiness. L’Shana Tovah.❤️","date":"Mon Sep 06 18:33:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Labor Day! \n\nThe Senate must pass the PRO Act to put power back in the hands of workers. #UnionsForAll","date":"Mon Sep 06 18:13:30 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Sisterhood is powerful. Thankful to have my sisters in service in this fight to stop the Line 3 pipeline. https://t.co/u6HGJuVDdP","date":"Sun Sep 05 00:38:51 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Line 3 pipeline will impact more than a 1,000 acres of wetlands. Enbridge wants to prioritize corporate profits over the future of our planet. We’re standing in solidarity with Indigenous leaders to stop Line 3. Watch live: https://t.co/Vn0emDbSt9","date":"Sat Sep 04 16:31:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rejecting the dirtiest fuel in the world should be a no-brainer.\n\nI am in proud to join my sisters @RepPressley, @RepRashida and @RepCori to call on President Biden to reject the Line 3 pipeline.","date":"Fri Sep 03 18:24:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Stop Line 3 https://t.co/TKskTc5rzG","date":"Fri Sep 03 18:16:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today we discussed the need for economic development and prosperity in the Northside with @keithellison and @SenTinaSmith.\n\nOur office was able to advance $1M in community project funding for @NEONBusiness and will continue to fight to provide critical resources to the Northside. https://t.co/zOe0fneT9r","date":"Tue Aug 31 21:06:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Tonight, we’re having our first in-person town hall since the start of the pandemic. \n\nCan’t wait to be in community with you all! \n\nRegister here: https://t.co/qWz0mAAZhb","date":"Tue Aug 31 19:11:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Welcoming Afghan refugees to Minnesota will take a combined community effort.\n\nIf you would like to help and receive updates on ways to get involved, sign-up here: https://t.co/VnnucphWtv","date":"Tue Aug 31 13:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In Minnesota, we’re making our voices loud and clear: Protect Indigenous sovereignty. \n\nToday, I led a letter to President Biden to call for urgent intervention amidst the Line 3 pipeline construction. https://t.co/QJwYyyOowo","date":"Mon Aug 30 22:27:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s time to end taxpayer subsidies to fossil-fuel companies.\n \nThat’s why @RepRoKhanna, @RepMaloney, and I wrote a letter asking House leadership to repeal these harmful and wasteful subsidies in the Build Back Better Act. https://t.co/IgCtBHFwmO","date":"Mon Aug 30 16:57:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Minnesota State Fair is back!\n \nMinnesotans: What food are you most excited about?\nhttps://t.co/dpcaZ4MKbk","date":"Mon Aug 30 14:41:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our first in-person outdoor town hall since the start of the pandemic is happening this Tuesday at 6pm CT. \n\nWe will discuss the eviction moratorium, the situation in Afghanistan, and the Build Back Better agenda. \n\nCan’t wait to talk with you! Register: https://t.co/EebjkaUhfV","date":"Sun Aug 29 18:19:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We have a moral responsibility to protect the lives of people impacted by our foreign policy decisions. \n\nAs a refugee, I know finding a stable home is a matter of life or death. \n\nWe must live up to our promises and increase the refugee cap.","date":"Fri Aug 27 21:06:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Landlords are required to give tenants a written notice 15 days before an eviction for nonpayment is filed. \n\nThis notice will give tenants time to apply for emergency rental assistance. \n\nIf you need free legal advice, please visit https://t.co/b7bclviPAJ or call 612-728-5767.","date":"Fri Aug 27 19:10:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minnesotans: If you’re currently behind on rent, you should apply for rental assistance through https://t.co/qHhKCvBpDD or call 211. \n\nThis assistance will last until June 1, 2022, but only for those tenants who have pending applications, so please apply ASAP.","date":"Fri Aug 27 19:10:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Supreme Court decision to strike down the CDC’s eviction moratorium is cruel and will put millions of lives in danger. \n\nWe will continue to fight for BOLD legislative solutions to the mass eviction crisis.\n\nIn Minnesota, renters still have protections from eviction (THREAD).","date":"Fri Aug 27 19:10:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In this critical moment, we must draw upon the best of our history and open our arms to the huddled masses yearning to breathe free in Afghanistan.\n\nWe owe it to the Afghans who risked their lives to fight alongside the United States.\n\nMy @CNNOpinion op-ed:https://t.co/oDK6gA8qSI","date":"Fri Aug 27 13:04:14 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"MN-05 appreciation post ❤ https://t.co/vOrHMqpfhM","date":"Wed Aug 25 14:41:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Black Entrepreneur State Fair is happening this week in Minneapolis. \n \nPlease stop by and support our Black-owned businesses.\n  \nhttps://t.co/Bg0OQPvlXG","date":"Tue Aug 24 21:33:56 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"GOOD NEWS: The Pfizer vaccine is now fully approved by the FDA.\n \nIf you haven’t gotten your vaccine yet, now is the time. \n\nhttps://t.co/TJAjgNjIVt\n \nhttps://t.co/KeiMoGAyvz","date":"Tue Aug 24 17:48:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week, the House will vote on the infrastructure package and the reconciliation package that will deliver transformative improvements.\n \nThis is our once in a generation opportunity to tackle the climate crisis, expand childcare and build a 21st century economy.","date":"Tue Aug 24 14:23:19 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If you are a caregiver for a veteran and need support, the VA Caregiver Support Line is available Monday-Friday from 8am to 10 pm and Saturday from 8 am to 6:30 pm ET.\n\n• Call 1-855-260-3274","date":"Fri Aug 20 15:32:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"For women veterans, the VA has a call center that is available Monday-Friday from 8am to 10 pm and Saturday from 8am to 6:30 pm ET.\n\nYou can call or text: 1-855-829-6636","date":"Fri Aug 20 15:32:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Community-based counseling with other veterans is also available. \n\n• Call 1-877-927-8387 \n• Visit https://t.co/RMatWLROgI","date":"Fri Aug 20 15:32:38 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The @DeptVetAffairs released a guide for mental health services available through the VA. \n\nYou can read the guide here: https://t.co/81IMjhVHSH","date":"Fri Aug 20 15:32:38 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is a challenging time for many veterans and their loved ones. \n\nKnow you are not alone. There are free mental health resources available. (THREAD)","date":"Fri Aug 20 15:32:37 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Veterans Crisis Line is available 24/7 to help any veteran experiencing a mental health crisis.\n\n• Call 1-800-273-8255 and press 1\n• Visit https://t.co/UNR261IoWV\n• Text 838255","date":"Fri Aug 20 15:32:37 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In Minnesota, the weather may be cold, but our hearts are warm! https://t.co/aNBwq9KCc5","date":"Thu Aug 19 20:43:47 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"My team and I are all safe. \n\nGrateful that the security threat is resolved. It’s time we all took deeply seriously the threat of domestic terrorism.","date":"Thu Aug 19 20:31:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The President was right to end our longest ever war.\n\nBut the end of the war must not mean the end of our commitment to the Afghan people. \n\nThe urgency of the moment demands us to marshal an international coalition to evacuate every Afghan citizen who is fleeing for their lives. https://t.co/Hvj2TPuwUj","date":"Thu Aug 19 20:11:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Line 3 tar sands pipeline will violate tribal treaty rights and pollute our planet. \n\nProud to join @RepJayapal and @SenJeffMerkley to urge the Biden Administration to stop Line 3. https://t.co/3AtUxi0ueg","date":"Thu Aug 19 18:06:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our town hall will now happen on August 31st at 6pm CT.\n \nCan’t wait to talk with you!\n \nRegister here: https://t.co/EebjkaUhfV","date":"Wed Aug 18 16:54:35 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Biden Administration just increased food stamp benefits by 25% —the largest long-term increase in the program's history. \n \nThis increase will help countless Minnesotans put food on the table. \nhttps://t.co/Pzt2RfL7gE","date":"Tue Aug 17 20:15:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must begin to prove that with this airlift operation, and then I look forward to working with him to ensure that when the headlines and emotions of this deeply painful moment subside, we are still focused on the people to whom we owe an enormous amount.","date":"Tue Aug 17 02:06:51 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There will also be Afghan human rights activists, and women, and civil society who choose to stay. We have an obligation to them, too. The President has been clear that the end of the war does not mean the end of our commitment to the Afghan people.","date":"Tue Aug 17 02:06:51 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I hope we genuinely confront them, and reckon with them, rather than doubling down on obsolete talking points from 20 years ago that fail to account for the thousands of American lives cost and trillion-plus dollars spent. I hope we will learn from this, as painful as it is.","date":"Tue Aug 17 02:06:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must hold the airport in Kabul and lead a multinational airlift operation. We have the capacity, and we must find the will to get them out.","date":"Tue Aug 17 02:06:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In the meantime, the urgency of the moment before us now demands we marshal an international coalition to evacuate every Afghan citizen who is fleeing for their lives. This is an American responsibility, and it is also a NATO responsibility, and it is also a human responsibility.","date":"Tue Aug 17 02:06:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There will be plenty of time for confronting the fundamental failures of our Afghanistan policy over the course of many decades and four presidencies.","date":"Tue Aug 17 02:06:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"War and conflict never produce peace and stability. Violence and militarism, even when cloaked in the language of humanitarianism, are fundamentally at odds with human flourishing and opportunity.","date":"Tue Aug 17 02:06:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Violence only produces trauma, trauma that can turn into anger, vengefulness and a continuing cycle of violence. That must be a lesson as we deal with conflicts around the world.","date":"Tue Aug 17 02:06:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I agree with President Biden: an endless American military occupation of Afghanistan was unacceptable.","date":"Tue Aug 17 02:06:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Of course, the tragedy did not begin in the last couple of weeks. The hard truth about America’s longest war is that for 20 years, we made promises we couldn’t keep. The simple fact is that prolonging a war indefinitely would not have delivered a stable, peaceful Afghanistan.","date":"Tue Aug 17 02:06:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"On August 24th, our office will hold our first in-person outdoor town hall since the start of the pandemic. 🙌🏽\n\nExcited to discuss what’s happening in Congress and answer your questions. See you there! \n\nSign-up for details here: https://t.co/HS48ouVb75","date":"Tue Aug 10 13:47:14 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As with so many moments in this two-decade long conflict, I have not been able to read the news without seeing myself and my family, many years ago, desperately fleeing imminent violence in Somalia.","date":"Tue Aug 17 02:06:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Like many of us, I have watched the immense human tragedy in Afghanistan in horror. My heart goes out to the Afghan people, especially the many Afghans who risked their lives for a safer, freer Afghanistan... https://t.co/3JB9aaxpSo","date":"Tue Aug 17 02:06:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It has also, for me, been personally painful. I know what it’s like to be the child in the family scrambling for safety in a war-torn country. I also know intimately the difference between making it out and not making it out.","date":"Tue Aug 17 02:06:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"...as well the of countless Americans who served in this conflict, thousands of whom made the ultimate sacrifice.","date":"Tue Aug 17 02:06:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We will follow up with the State Department with your information and help facilitate your case.","date":"Mon Aug 16 20:52:20 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our office has received a lot of inquiries from people in Afghanistan or from family/friends of someone who is trying to evacuate safely. (THREAD)","date":"Mon Aug 16 20:52:19 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If you have a pending Special Immigrant Visa application or your safety is at risk, you can fill out this form: https://t.co/ZVf9GSGjTd so we can flag your case.","date":"Mon Aug 16 20:52:19 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There will be plenty of time for confronting the repeated failures of Afghanistan policy over the course of 4 presidencies. The urgency of the moment now demands we marshal an international coalition to evacuate every Afghan citizen who is fleeing for their lives. My statement: https://t.co/rFJFbhxg3h","date":"Mon Aug 16 19:56:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Childcare should be a right—not a privilege.\n\nMinnesota is taking steps to make this is a reality by providing financial assistance for families for childcare.\n\nFor assistance, apply here: https://t.co/ShN9hnUA4G","date":"Mon Aug 16 15:00:37 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Congratulations Natalia Benjamin for being named Minnesota’s Teacher of the Year!\n \nThank you for making a meaningful difference for the next generation.\n \nhttps://t.co/PBPjSr5jLR","date":"Sun Aug 15 15:59:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is great news for Minnesotans!\n\nFind a vaccination site near you: https://t.co/TJAjgNjIVt","date":"Fri Aug 13 20:16:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We are in a climate crisis. \n\nWith increased natural disasters and a warming planet—we need large scale action to combat climate change and ensure everyone has access to clean air, clean water, and a healthy environment. #climateweekofaction \n\nhttps://t.co/oDHPDJ6vCe","date":"Fri Aug 13 17:00:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our goal is to ensure we deliver for the American people. \n\nWe need a reconciliation bill, along with the infrastructure bill, to meet this moment. That means adequately funding physical infrastructure, caregiving, housing, workforce development, and tackling the climate crisis. https://t.co/KgOsGZCSHJ","date":"Fri Aug 13 14:49:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We are already seeing the devastating impacts of this pipeline.\n\nPull the permits! #StopLine3","date":"Tue Aug 10 19:27:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"On August 24th, our office will hold our first in-person outdoor town hall since the start of the pandemic. 🙌🏽\n\nExcited to discuss what’s happening in Congress and answer your questions. See you there! \n\nSign-up for details here: https://t.co/HS48ouVb75","date":"Tue Aug 10 13:47:14 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our state understands that housing is fundamental to give people a real shot at the American dream.\n\nMinnesotans: If you’re pursuing homeownership and need assistance to make it a reality, check out this resource: https://t.co/nZr8bud1b6","date":"Mon Aug 09 22:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need BOLD, transformative policies to match the scale of the climate crisis. \n \nWe need the Green New Deal.","date":"Mon Aug 09 20:35:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minneapolis assembled a list of free or low-cost attorneys who may be able to help you submit your application: \n\nhttps://t.co/wdllmGSsar","date":"Mon Aug 09 13:47:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"President Biden recently designated TPS for Burma, Somalia, Syria, Venezuela and Yemen. If you qualify, you should submit your application ASAP to get status and work authorization.\n\nMore information here: https://t.co/u6CrU4hL9S","date":"Mon Aug 09 13:47:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Holding the door wide open and leaving the ladder behind for future generations ❤ https://t.co/Ar1KF5vb55","date":"Sun Aug 08 18:36:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We stand with White Earth Nation. #StopLine3","date":"Sat Aug 07 14:31:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Congratulations, Gable! Making Minnesota proud! 👏🏽","date":"Fri Aug 06 20:41:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"56 yrs ago, the Voting Rights Act was signed into law. \n\nToday, Republicans want to turn back the clock and restrict access to the ballot box. \n\nIt’s more important than ever to pass the For the People Act &amp; John Lewis Voting Rights Advancement Act to protect our right to vote.","date":"Fri Aug 06 19:04:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must use all tools at our disposal to stop evictions from taking place and demand housing be treated as a human right. \n \nRep. Omar introduced the Rent and Mortgage Cancellation Act to permanently cancel ALL payments on rental homes and mortgages until the end of the pandemic. https://t.co/qgw8jsO1Iz","date":"Fri Aug 06 13:58:32 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Saddened to hear about the passing of labor movement giant, Richard Trumka. \n\nEvery day he fought tirelessly to better the lives of working people. \n\nMy heart is with all who knew and loved him.","date":"Thu Aug 05 20:51:19 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The prison at Guantanamo is a moral stain on our country. \n\nIt’s way past time we end this monument to cruelty and torture.\n \nProud to partner with @RepAdamSchiff, @RepDavidEPrice, and 70+ of our colleagues on this letter and glad to see the Admin take steps to close this prison. https://t.co/oHcPg4LDwz","date":"Thu Aug 05 19:51:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"With the rise of the Delta variant, @MayorFrey issued new masking guidance for indoor spaces in Minneapolis. \n \nLearn more here: https://t.co/JOBvk0PhhQ","date":"Thu Aug 05 19:19:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s keep it up Minnesota! Together we will beat this virus.\n\nFind a vaccination site here: https://t.co/3lgARoFKay","date":"Wed Aug 04 14:00:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar statement on the new CDC eviction moratorium: https://t.co/VzU8P3TPDI","date":"Tue Aug 03 23:02:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today is Black Women’s Equal Pay Day.\n \nThis day signifies the additional 214 days that Black women must work to catch up with what white men earned last year.\n \nIt’s past time to close the wage gap and ensure equal pay for equal work.","date":"Tue Aug 03 19:19:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I visited the American Indian Center to discuss the impact of the $3M in community project funding we advanced in the House. \n\nI also visited @northmemorial to hear about the “Next Step” program that connects victims to support. \n\nThankful to represent our incredible community! https://t.co/7q9fO5zzPl","date":"Tue Aug 03 18:21:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This year alone, we have seen over 500 reported incidents of anti-Muslim hate in the U.S. \n \nAnti-Muslim bigotry should have no place in our country. \n \nProud to partner with @janschakowsky to call on Secretary Antony Blinken to create a special envoy to combat Islamophobia. https://t.co/gkcvW25do5","date":"Mon Aug 02 21:50:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minnesotans: Know your rights.\n \nYou can find more information at https://t.co/qHhKCvBpDD or call 211.","date":"Mon Aug 02 19:02:37 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re in the middle of an eviction emergency.\n \nExtend the eviction moratorium. 📢 https://t.co/yuxBqNeKy4","date":"Mon Aug 02 17:17:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minnesotans: If you haven’t gotten your COVID vaccine, now is the time! \n \nGovernor Walz announced every Minnesotan who gets vaccinated starting today will get $100.  \n \nLearn more here: https://t.co/aXdcE3J4tw","date":"Fri Jul 30 22:09:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Poverty is a choice. It’s time we prioritize new economic indicators and economic policies that will prioritize sustainable and equitable growth.\n \nToday, we’re introducing TWO bills: \n-A guaranteed income bill\n-A bill to establish an alternative economic metric https://t.co/3o2iOa0nIx","date":"Fri Jul 30 17:25:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, Minnesota had the worst air quality ever recorded in state history.\n \nClimate change is a public health emergency.\n \nWe must work together to combat climate change. \nhttps://t.co/zgyqzYPf9j","date":"Fri Jul 30 16:29:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Starting now! Tune in: https://t.co/rtOeSz61sq","date":"Thu Jul 29 22:06:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It's a reminder that we can propose bold solutions to the biggest challenges we face—from the climate crisis to housing and healthcare affordability—while also effectively securing amendments in major bills. \n \nThat is what cogovernance on behalf of the 5th District looks like.💪🏽","date":"Thu Jul 29 21:46:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Together, we have been able to pass multiple amendments that will move the needle on issues Minnesotans care about, from housing to education, economic development, First Amendment rights and more.","date":"Thu Jul 29 21:46:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today is one of the proudest moments we’ve had so far in Congress. \n \nThrough the surface transportation and appropriations process, we have passed over $46 million in funding through the House for our district.","date":"Thu Jul 29 21:46:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The town hall will be delayed due to votes on the House floor. We will start closer to 5pm CT!","date":"Thu Jul 29 20:56:56 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"TONIGHT: We’re holding our monthly town hall.\n \nExcited to talk about the $46 million we advanced for the district, the impact of the child tax credit, and our guaranteed income bill. \n \nTune in at 4pm CT. \nhttps://t.co/rtOeSz61sq https://t.co/29b866YEH1","date":"Thu Jul 29 19:22:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week we are considering critical legislation to invest in America and Minnesotans.\n\nIn the 5th District alone, we advanced over $46 million dollars in transportation and community project funding—including funding for healthcare, clean energy, and housing. 💪🏽 https://t.co/RROsShZfg9","date":"Thu Jul 29 15:10:14 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Good morning, Minnesota! ☀️\n \nToday is a good day to get vaccinated. \n \nSign-up here: https://t.co/XdFxsbnAiR","date":"Thu Jul 29 13:12:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Nothing beats sunsets with @RepJahanaHayes and @RepNikema! https://t.co/n77vIVWngI","date":"Thu Jul 29 00:55:08 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Loved hosting my @TheBlackCaucus sisters for dinner tonight! https://t.co/hbYJtHsKqh","date":"Wed Jul 28 23:45:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Art is often the context that helps us understand who we are and where our common ground is.\n \nThe Northside Arts Crawl is this Thursday through Saturday. This event celebrates grassroots orgs and local artists in our community. \n \nLearn more here: https://t.co/JlEaZeRv4Y","date":"Wed Jul 28 19:12:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"You can learn more about each here: https://t.co/iFk2aA5faU","date":"Tue Jul 27 20:33:37 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We have an opportunity to ensure that no child lives through violent conflict, and to mean what we say when it comes to championing human rights. Today I introduced two bills to center human rights:\n \n-The Stop Arming Human Rights Abusers Act\n-The Global Migration Agreement Act https://t.co/GOcK2lTeaJ","date":"Tue Jul 27 20:32:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"31 years ago, the Americans with Disabilities Act was signed into law.\n\nThis transformative bill paved the way towards a more inclusive world for people living with disabilities. \n\nWe must continue to fight until all people can live an independent, dignified life. #ADA31","date":"Mon Jul 26 21:20:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Register for our town hall this Thursday, July 29th at 4pm CT. \n\nWe will discuss the Child Tax Credit program, guaranteed income, and community project funding for our district. \n\nhttps://t.co/rtOeSz61sq https://t.co/yUVfaA8E8P","date":"Mon Jul 26 14:38:26 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our focus is on a politics of joy. https://t.co/bju4OMUySM","date":"Sun Jul 25 15:43:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"82.1% of children in our district will benefit from the Child Tax Credit. \n\nThis is a monumental legislative victory that will provide a lifeline to parents struggling to make ends meet. \n\nYou can learn more here: https://t.co/JCDZNAYk0N\n\nhttps://t.co/acIQZg3IUl","date":"Sat Jul 24 16:37:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week, we held a press conference calling on the State Department to create a special envoy to combat Islamophobia.  \n\nThis year we’ve seen over 500 documented complaints of anti-Muslim hate and bias in the U.S.\n\nWe must all stand united against this horrific rise in hate. https://t.co/iWsuAJrFzX","date":"Fri Jul 23 20:44:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It is critical that any military action must be part of a broader strategy focused on the security of the Somali people and the stability of the Somali state.\n \nRep. Omar sent a letter to @POTUS requesting more information on the airstrike the US carried out this week in Somalia. https://t.co/HvZwPZpVzv","date":"Fri Jul 23 17:01:15 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If you haven’t gotten vaccinated, now is the time! \n\nThe vaccine is safe and effective. \n\nFind a site here: https://t.co/3lgARoFKay","date":"Wed Jul 21 22:27:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we are hosting a press conference to call for a special envoy to combat Islamophobia. As part of our commitment to international religious freedom and human rights, we must recognize Islamophobia and do all we can to eradicate it. https://t.co/B6vO0EI6Ij","date":"Wed Jul 21 20:34:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We are seeing a rise in anti-Muslim hate in nearly every corner of the globe.\n\nThat’s why we are leading a letter with @RepSchakowsky calling for a special envoy to combat Islamophobia.\n\nhttps://t.co/KeN5BYVdQI","date":"Wed Jul 21 16:03:38 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Eid Mubarak. Wishing all those celebrating in Minnesota and around the world a blessed day #EidMubarak","date":"Mon Jul 19 21:29:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In May, our office led a letter calling for an extension and redesignation for Somali TPS holders.\n\nToday the Administration did just that. \n\nThis is a major victory. Now the Senate needs to pass the Dream and Promise Act to end this cycle of uncertainty.  https://t.co/pS4dMtrULk","date":"Mon Jul 19 15:37:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The stakes could not be higher. \n\nTo address the climate emergency, we will need mobilization around the world. \n\nWe are proud to join the Global Alliance for a Green New Deal! https://t.co/lN5v7y7DZf","date":"Mon Jul 19 14:50:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our office advanced $14 million in funding for community projects for the 5th District.\n \nWe are fighting for the many, not the few!\nhttps://t.co/IgYal46ZA7 https://t.co/7EdnRRttAX","date":"Sun Jul 18 17:05:24 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🥳 https://t.co/SKU2vWOl96","date":"Sat Jul 17 17:14:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The US government has an obligation to uphold our treaties with sovereign indigenous nations.\n \nWe stand with White Earth Nation. ✊🏽\n https://t.co/Cq1WYBG3OU","date":"Fri Jul 16 20:30:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Philando Castile lost his life to police brutality, a preventable tragedy.\n \nToday, we remember him and redouble our efforts to demand justice for Black lives.","date":"Fri Jul 16 16:08:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our office is proud to move forward $1 million for the Northside Economic Opportunity Network (NEON).\n\nThis funding will support an affordable commercial kitchen space in North Minneapolis, which has the fifth largest food desert in the nation. #FightingForThe5th https://t.co/1h6mdp8foE","date":"Fri Jul 16 12:56:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I applaud Governor Walz for this decision that will change the lives of so many LGBTQ+ kids.\n \nThe advocacy of many brave young people has brought us to this moment.\n \nIt’s a proud day for Minnesota and hope the rest of the country follows suit. 🏳️‍🌈","date":"Thu Jul 15 20:55:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"https://t.co/JCDZNAYk0N","date":"Thu Jul 15 20:33:26 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"TODAY: Working families will start to receive their first child tax credit payments. \n \nThis will spur the largest one-year decrease in child poverty in American history.\n \nLet’s go!","date":"Thu Jul 15 20:33:26 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I’m excited to announce we’ve been able to advance $46.9 million in federal funding for the 5th District.\n \nThis critical funding will help us address joblessness, housing insecurity, access to healthcare, and transportation barriers in our community.\nhttps://t.co/drELJo8xvt","date":"Thu Jul 15 14:32:30 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Sunisa Lee will be the first Hmong American to compete in the Olympics!\n \nMinnesota is so proud of you ❤️\nhttps://t.co/pxhaqHKs8d","date":"Wed Jul 14 16:18:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Starting this week, child tax credit payments will start to hit bank accounts and mailboxes.\n \nThese payments will benefit 120,200 children in our district and lift 10,600 out of poverty.\n \nWe’re one step closer to eradicating child poverty 💪🏽\nhttps://t.co/JCDZNAYk0N","date":"Wed Jul 14 13:07:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must invest in our caregiving workforce and create good union jobs for the workers who provide lifesaving care. #CareIsEssential","date":"Tue Jul 13 21:49:47 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Say her name: Sandra Bland\n \nIt’s been six years since her death. \n \nWe must continue fighting for justice.\nhttps://t.co/AkTIh22PTO","date":"Tue Jul 13 18:59:56 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is a major step towards accountability. But true justice can only occur when environmental activists are not murdered by state-sanctioned killers.\nhttps://t.co/qXoAis8ZO6","date":"Mon Jul 12 23:52:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"How much pain does one family have to go through?\n\nOur hearts are with Leneal Frazier’s entire family during this time.\n\nWe can and we must build a system that values human life above all else. https://t.co/bLw441QC0n","date":"Fri Jul 09 17:48:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If you haven’t received your vaccine yet, now is the time!\n \nOur office is partnering with @mnhealth and @childrensmn next week for another vaccination event at Brooklyn Center Middle and High School.\n \nCheck out more details below👇🏽 https://t.co/becNhStr6S","date":"Fri Jul 09 13:58:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Congratulations to Abdulaziz for becoming the first Somali American student body president at the University of Minnesota! ❤️💪🏽\nhttps://t.co/fVwqBtb5wy","date":"Thu Jul 08 21:22:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thousands of Minnesota renters need protection from eviction and utility shut-offs.\n \nYou can apply for assistance at https://t.co/qHhKCvBpDD or you can call 211.","date":"Wed Jul 07 20:17:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need to stop providing billions of dollars in tax giveaways to the fossil fuel industry.\n \nRep. Omar reintroduced the End Polluter Welfare Act to end federal subsidies to the fossil fuel industry and hold polluters accountable. https://t.co/CkUId3bNae","date":"Wed Jul 07 15:46:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"No child should ever face school lunch shaming.\n\nRep. Omar will reintroduce the No Shame at School Act to prohibit school lunch shaming nationwide.\n\nNext: Let’s make school meals universal to ensure all children have the nutrition they need to succeed.","date":"Tue Jul 06 22:00:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last week, the House passed crucial funding for much-needed transportation improvements in our district.\n \nGlad our state will also take action to help rebuild and reinvest resources to support our communities. 💪🏽\nhttps://t.co/bI7vot6hbc","date":"Tue Jul 06 20:16:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Independence Day! Honored to represent Minnesotans and serve our country in Congress. https://t.co/847EQlfZB9","date":"Sun Jul 04 13:58:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This funding has now passed the House. We are one step closer to getting much-needed transportation funding to the 5th District. https://t.co/SYwPM3xkty","date":"Sat Jul 03 13:01:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s keep it up Minnesota! Together we can beat this deadly virus.\n https://t.co/GjJCC1BWOh","date":"Fri Jul 02 21:05:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today I am announcing $1 million in community project funding for the Northside Economic Opportunity Network (NEON). This will provide much needed goods and services to the Northside community, which is the fifth largest food desert in the nation. https://t.co/9UKLB9hP5Q","date":"Fri Jul 02 20:10:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We stand in solidarity with all those fighting for equality in Tbilisi, Georgia. \nhttps://t.co/Lt01BX5Nsp","date":"Wed Jun 30 16:12:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, the @HouseForeign Committee had a hearing on the conflict in Ethiopia. \n\nWatch Rep. Omar’s remarks below. https://t.co/g6XFNT29Y1","date":"Tue Jun 29 22:34:47 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"TONIGHT: We’re hosting our monthly town hall at 5:30pm CST. \n \nRegister here: https://t.co/gaa97DoQs9 https://t.co/Vc7jyE9D7I","date":"Tue Jun 29 21:40:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must create a pathway to citizenship for all undocumented people living here.\n\nMet with activists with @Chirla, who have been fasting for days to push for a pathway to citizenship. \n\nImmigrants get the job done. ❤ https://t.co/DbYXrlVPYK","date":"Mon Jun 28 12:56:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our monthly town hall is happening on Tuesday at 5:30pm CT. \n\nRegister here: https://t.co/gaa97DoQs9","date":"Sun Jun 27 17:15:11 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, @HouseForeign had a historic hearing on advancing and protecting LGBTQIA+ human rights abroad. \n\nRep. Omar asked about the links between authoritarianism and violations of LGBTQIA+ people’s rights. https://t.co/j7zr3NJR4H","date":"Fri Jun 25 23:13:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rep. Omar Statement on Derek Chauvin Verdict: https://t.co/CnAnarROyn","date":"Fri Jun 25 21:14:26 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’ve secured $32.5 million for 4 crucial infrastructure projects in Minnesota’s 5th District.\n \nThese transit projects will help better connect Minneapolis to the suburbs and improve our economy.  💪🏽 #FightingForThe5th https://t.co/wVB861oxti","date":"Fri Jun 25 19:13:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"45 million Americans now carry student debt. \n \nThe pandemic has only made this crisis worse.\n \nWe need to cancel student debt and give families across the country the opportunity to pursue their dreams of homeownership, opening a business, or starting a family. https://t.co/Wo2iNpPAD8","date":"Thu Jun 24 22:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Two professors, Dr. Marc Hillmyer and Dr. William Doherty, from @UMNews testified before the @HouseScience Committee and the @ModernizeCmte. \n\nGlad to have their voices and expertise brought to the People’s House. Minnesotans get things done 💪🏽 https://t.co/XVDlbqo0fY","date":"Thu Jun 24 21:44:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"MN-05 residents: If you haven’t gotten your vaccine yet, now is the time! \n\nBrooklyn Center Community Schools is hosting a vaccination event TODAY from 12-7pm CT at the Brooklyn Center Middle and High School. https://t.co/ChkM7WDZ4n","date":"Thu Jun 24 16:36:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As we begin our withdrawal from Afghanistan, we must ensure Afghans who risked their lives to serve our country are granted Special Immigrant Visas to live in the United States. \n\nWe must honor our commitments and leave no one behind. https://t.co/umt3Btp4ap","date":"Wed Jun 23 21:11:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In honor of World Refugee Day, we should extend humanity and compassion to asylum seekers and refugees.\n \nIt’s important that we as a nation and as a movement proudly stand up for the rights of those seeking refuge.     https://t.co/cpx6932uZH","date":"Wed Jun 23 20:23:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every single student deserves a quality education and the support to make that possible.\n \nThe Counseling Not Criminalization in Schools Act addresses the over-policing in our nation’s K-12 schools and provides resources to help all students thrive. \n \nhttps://t.co/VZPxORbb0p","date":"Wed Jun 23 13:57:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Egypt engaged in routine human rights violations. It's also clear Egyptian intelligence was complicit in the Khashoggi murder. We need a human rights advocacy that is consistent around the world. https://t.co/znpfdwq0VN","date":"Tue Jun 22 20:25:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our general town hall will be next Tuesday at 5:30pm CT. \n \nWe will discuss legislative updates and answer your questions. \n \nSign-up here: https://t.co/gaa97DoQs9","date":"Tue Jun 22 18:55:35 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today would be a good day to make school meals universal.","date":"Tue Jun 22 13:32:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Alien Enemies Act, a 1798 law used to justify the Muslim Ban and detain Japanese-Americans during World War II is *still* on the books. \n \nI reintroduced legislation to put this hateful law in the dustbin of history where it belongs.\nhttps://t.co/vCgOn2mVyC","date":"Mon Jun 21 20:44:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Next month, working families will start to receive monthly child tax payments of up to $300 per child. \n \nThis tax credit will lift millions of children out of poverty! 💪🏽\n \nYou can learn more here: \nhttps://t.co/JCDZNAYk0N","date":"Mon Jun 21 16:50:07 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Student debt is holding millions back from pursuing their dreams of homeownership, opening a business, or starting a family. \n\nWhat would it mean to YOU if we canceled student debt?","date":"Mon Jun 21 13:00:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our criminal legal system should be centered on restoration and rehabilitation. \n \nWe must radically transform our approach to criminal justice and ensure formerly incarcerated individuals are fully supported in their transition back to society. https://t.co/rCpAWW7JXX","date":"Sun Jun 20 18:36:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Proud #Juneteenth is now a federal holiday. \n\nAs we reflect on the significance of what this day symbolizes, let’s keep fighting to address the lasting consequences of slavery.  \n\nNext step: reparations.","date":"Sat Jun 19 15:00:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I asked the Administration about their efforts to at long last close the Guantanamo Bay Detention Center. https://t.co/8hkOfH5IMS","date":"Fri Jun 18 18:16:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Kids need support, not punishment. \n\nIn my city of Minneapolis, Black students are 41% of the student population, but make up three quarters of all suspensions.\n\nProud to support the Counseling Not Criminalization in Schools Act to make sure our kids have the support they need.","date":"Fri Jun 18 15:00:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Now we must pass the John Lewis Voting Rights to protect the right to vote.\n\nWe must pass the George Justice in Policing Act to end qualified immunity and protect innocent Black men, women and children.","date":"Thu Jun 17 21:59:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As Martin Luther King Jr. said, ‘The arc of the moral universe is long, but it bends toward justice.’\n\nAnd we have an opportunity in this moment, in this Congress, to bend that arc towards justice","date":"Thu Jun 17 21:59:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must pass the For the People Act to end the corruption and influence of big money in politics.\n\nWe must abolish the filibuster, a relic of the Jim Crow Era. \n\nAnd we must at long last provide reparation to address centuries of harm and provide resources to uplift Black lives.","date":"Thu Jun 17 21:59:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today is a landmark step on the long march to justice. But it should not be an excuse for neglecting the substantive work that is needed on behalf to the Black community.","date":"Thu Jun 17 21:59:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is a milestone.\n\nFor centuries, African-Americans have celebrated their emancipation without an official day of recognition from their country. https://t.co/99ODrnxlsc","date":"Thu Jun 17 21:59:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The failures of the Minneapolis Police Department have cost taxpayers tens of millions of dollars in the last decade alone.\n\nImagine if we created a public safety system that empowered and protected our residents AND invested in our community.","date":"Thu Jun 17 20:18:33 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I’m headed to the White House today to see President Biden sign a bill to make #Juneteenth a federal holiday!\n\nAs we celebrate this milestone, we must renew our commitment to address the lasting consequences of slavery.","date":"Thu Jun 17 18:57:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We as a nation and as a movement must proudly stand up for the rights of all asylum seekers and refugees. \n\nProud to join Lutheran Immigration and Refugee Service ahead of World Refugee Day!","date":"Thu Jun 17 17:12:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I’m proud to join my colleague @RepBarbaraLee in supporting the 2002 AUMF repeal. https://t.co/HED9fmv5VO","date":"Thu Jun 17 14:30:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"@HouseForeign @USAmbUN That’s a wrap 👋🏽\n \nLet me know what you want to see next!","date":"Thu Jun 17 03:01:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"@HouseForeign @USAmbUN Last but not least, Teddy came to visit the office and brought smiles to our faces after a busy day. https://t.co/ijsoNMvqnd","date":"Thu Jun 17 03:01:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"@HouseForeign @USAmbUN We also voted on making Juneteenth a federal holiday.\n \nThis is an important step in recognizing the lasting effects of slavery.","date":"Thu Jun 17 03:00:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"@HouseForeign @USAmbUN Later, I went to votes. \n \nWe voted and passed the ESG Disclosure Simplification Act, legislation that will require new disclosure requirements for public companies. \n \nThis is a big deal that will require the SEC to adopt needed corporate disclosure rules.","date":"Thu Jun 17 02:59:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Next, I had a @HouseForeign committee hearing with @USAmbUN Linda Thomas-Greenfield. \n \nI asked about the on-going situation in Ethiopia. \n\nYou can watch my remarks here: https://t.co/Jig7vNIY3i","date":"Thu Jun 17 02:59:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"First up, I had an Education and Labor Committee hearing with Secretary Xavier Becerra. \n \nI asked about the role of the pharmaceutical industry in curbing innovation. \n \nYou can watch some of my remarks here: https://t.co/kAGHRksqh6","date":"Thu Jun 17 02:22:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week, Congress is back in session after a district work and committee work period. \n \nI wanted to take you behind the scenes of what happened today. \n \nHere’s a day in the life ⬇️","date":"Thu Jun 17 02:21:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Low staff salaries have deterred many working-class and people of color from pursuing a job on Capitol Hill. \n\nExpanding the MRA will increase the applicant pool for staff positions and overall help reflect the diversity of America. \n \nThanks sis, @AOC for your work on this!","date":"Wed Jun 16 20:20:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Blood banks in Minnesota are in dire need of donations. If you can, please consider donating to your local blood bank.  \n\nIn the meantime, Pride month would be a great time to lift the ban on LGBTQ+ blood donors.","date":"Wed Jun 16 17:40:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday we commemorated the 9th anniversary of DACA.\n\nWhen it comes to protecting immigrant communities, DACA remains the floor, not the ceiling. \n\nIt’s way past time we guarantee citizenship to DACA and TPS recipients. #HomeIsHere","date":"Wed Jun 16 15:22:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need universal childcare and pre-K for all families—and we need to pay our childcare workers a living wage.\n\nProud to be working on the American Families Plan that moves us closer to a future where all working families can thrive. https://t.co/36P11lyXnt","date":"Wed Jun 16 00:32:08 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Minnesota State Fair is coming back (aka the BEST state fair!) 🎡\n\nWhat’s your favorite type of fair food? \n\nhttps://t.co/5OXPyK8CQg","date":"Tue Jun 15 13:22:24 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s be clear: We don’t have a labor shortage; we have a shortage of jobs paying workers a living wage.","date":"Mon Jun 14 21:06:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Devastating. Line 3 will pollute our state and violate tribal treaty rights.\n\nPresident Biden must act to stop Line 3.","date":"Mon Jun 14 18:33:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Black tenants are *twice* as likely to have eviction cases filed against them.\n\nOur eviction crisis is a racial justice issue and why we must renew our call to cancel rent and mortgage payments until the pandemic ends.\n\nhttps://t.co/xUy2rEiJJa","date":"Sun Jun 13 19:23:56 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week, I hosted an Indigenous roundtable to hear from community leaders on the work they’ve been doing.\n\nWe discussed the American Rescue Plan, support for the urban Indian population, and my efforts to federally support the American Indian Center. https://t.co/jWjqIzpLJr","date":"Sat Jun 12 20:37:08 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Congratulations to Darnella Frazier on this well-deserved honor! ❤️✊🏽\n\nGrateful for her extraordinary courage that helped bring accountability for George Floyd’s murder.","date":"Sat Jun 12 15:09:27 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Since getting elected, I made a promise to cogovern with you. \n\nThis promise was anchored in the belief that my success in Congress is contingent upon inviting members of our community to come alongside this journey with me. \n\nHere's my district recap👇🏽\nhttps://t.co/CN5RbJulOv","date":"Wed Jun 09 18:47:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is long overdue.   \n\nNext step: Implementing UBI nationwide. \n\nThis Congress, I’ll be introducing a UBI pilot program to get money in people’s pockets.","date":"Wed Jun 09 13:23:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Importing goods made from forced labor is direct violation of U.S. law, in addition to human rights and labor rights standards.\n \nI will continue to advocate for full accountability for these human rights abuses and U.S. corporations’ own complicity in them.","date":"Wed Jun 09 00:19:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Rebuilding trust between community and law enforcement starts with accountability.\n\nToday, I led a letter to the DOJ to expand its review of the Minneapolis Police Department to include other agencies so we can begin the process of accountability and trust.https://t.co/Aoi74DPbmo","date":"Tue Jun 08 22:49:47 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must have the same level of accountability and justice for all victims of crimes against humanity. \n\nWe have seen unthinkable atrocities committed by the U.S., Hamas, Israel, Afghanistan, and the Taliban.  \n\nI asked @SecBlinken where people are supposed to go for justice. https://t.co/tUtxW5cIow","date":"Mon Jun 07 19:34:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Stop giving fossil fuel corporations $15 billion a year.","date":"Mon Jun 07 14:57:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In a fair, humane, and equitable society, no one should have billions of dollars in wealth while millions go hungry.","date":"Sun Jun 06 15:40:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need a global mobilization to reverse the worst effects of climate catastrophe.\n \nThe very least we can do is stop dirty pipelines pumping in more fossil fuel. \n \nProud of our indigenous organizers who are fighting to #StopLine3 this weekend!","date":"Sat Jun 05 19:27:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"More vaccinations = more people going back to work AND lower COVID rates.\n \n#RollUpYourSleevesMN!","date":"Sat Jun 05 14:54:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Abolish the filibuster to expand voting rights and access to the ballot box with HR1.","date":"Fri Jun 04 16:48:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The federal minimum wage hasn’t increased in TWELVE YEARS.\n \nRaise the wage!","date":"Fri Jun 04 13:27:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This racist and xenophobic law is dangerous and must be taken off the books.\n \nWe must close ALL policy loopholes to prevent more pain to be inflicted on our communities.","date":"Thu Jun 03 21:18:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We will not move forward as a city with more force and police presence.\n\nIf we truly want to build community, we must listen to the people directly impacted and make investments that address the longstanding racial and economic disparities in Minneapolis. https://t.co/0Rbs0TM1xh","date":"Thu Jun 03 18:48:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s go! 💪🏽\n \nIf you haven’t gotten your vaccine yet, you can sign up here: https://t.co/XdFxsb5YUh","date":"Thu Jun 03 13:58:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Pride month! 🏳️‍🌈\n \nI won’t stop fighting until all LGBTQ+ Americans are granted full equality under the law.","date":"Wed Jun 02 22:17:28 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In one month, the national eviction moratorium will expire, forcing thousands out of their homes.\n\nWe need to cancel rent and mortgages to prevent a national housing crisis.","date":"Wed Jun 02 20:09:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I reintroduced the Neighbors Not Enemies Act to fully repeal the 1798 law that was used to justify the Muslim Ban and Japanese-American internment. \n\nIt’s way past time we put this hateful law in the dustbin of history where it belongs.\nhttps://t.co/D1jd3luCZc https://t.co/UqC3kfkWlB","date":"Tue Jun 01 17:52:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"That starts with not turning our backs on veterans or their families who sleep on the streets, who go hungry, and go without healthcare. \n\nIn Congress, I’ll continue to fight to guarantee healthcare, housing, and work toward a more peaceful world without endless wars.","date":"Mon May 31 14:55:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This #MemorialDay, I want to extend a sincere thank you to each of our veterans and their families.\n\nToday is about honoring those who made the ultimate sacrifice for our nation. \n\nI remain committed to ensuring we uphold the promises made to our servicemembers. https://t.co/eufEwQEuDC","date":"Mon May 31 14:54:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every year we spend $182 billion on mass incarceration.  \n \nWe need restorative justice and preventative programs now more than ever.","date":"Sun May 30 18:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I’m heartbroken and angry. \n\nAnother child was stolen from us from gun violence.\n\nWhen will it be enough? We can’t afford to ignore the gun violence epidemic in America.","date":"Sun May 30 15:05:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our essential workers don’t just need our thanks—they need paid leave and hazard pay. Thank you @SEIU26 and @mnnurses for fighting for workers.\n \nhttps://t.co/uY7iKWUS2r","date":"Sat May 29 18:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🗣️ College should be debt- and tuition-free.","date":"Sat May 29 13:53:28 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Somali TPS holders – some of whom have lived in the U.S. for almost three decades – face the agonizing uncertainty of their futures.  \n\nI led a letter with @RepYvetteClarke, @RepAdamSmith, and @RepJayapal urging for the extension and redesignation of TPS for Somali nationals. https://t.co/0AWXt3DA0t","date":"Thu May 27 23:31:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Grateful that Somalia will move forward with free and fair elections. All Somalis deserve a stake in the future of their country. https://t.co/PnRrUzqx8u","date":"Thu May 27 19:37:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last year, I led a letter to oppose funding for the Jilamito hydropower project: https://t.co/MePAeh0loO","date":"Thu May 27 18:59:14 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Proud of organizers who made this win possible! 👏🏽\n\nWe should be promoting human rights, environmental protections, and community consultation abroad. Period. \nhttps://t.co/E0kLIN9swX","date":"Thu May 27 18:58:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Surprise: Republicans are negotiating in bad faith once again.\n\nNow is the time to go BOLD without the GOP through reconciliation.","date":"Thu May 27 17:05:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"End qualified immunity. \n \nThe provision to end qualified immunity in the George Floyd Justice in Policing Act is crucial to bring real accountability to policing. \n \nI can’t support the bill without it.","date":"Thu May 27 13:25:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The United States spends more on its military than the next 10 countries combined. \n\nImagine if we invested in education, housing, and healthcare for our people instead $700+ billion in Pentagon waste and endless wars? https://t.co/VP8GFvMTsR","date":"Wed May 26 22:32:56 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Break up Amazon.","date":"Wed May 26 20:40:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Peace requires justice, and it is through demanding justice that we can finally create the conditions for Palestinian liberation and equality for Palestinians living in Israel.","date":"Wed May 26 19:31:33 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We speak out because we believe in peace. And I hope all who believe in statehood for Palestinians will join us.","date":"Wed May 26 19:31:33 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The fight for Palestinian liberation is overdue and needed in Congress. If we ever want peace, we must stand against efforts to silence legitimate dissent and accountability for illegal Israeli government actions.","date":"Wed May 26 19:31:32 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Believing in a two state solution means actually fighting for Palestinian statehood.\n\nJust repeating the words “two-state solution” without any action and accountability doesn’t cut it. https://t.co/Bf1nEXrs6N","date":"Wed May 26 19:31:32 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, we celebrated #AfricaDay during the @HouseForeign Subcommittee.\n\nAs the first African-born Member of Congress, I am grateful to fight for a more just and prosperous future for the continent.\n\nYou can watch my questioning on the impact of sanctions in Africa below👇🏽 https://t.co/ghNrkCzuWm","date":"Wed May 26 13:15:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I joined members of our community to mark one year since George Floyd’s murder. \n \nTrue justice for George Floyd and so many others will only be achieved by radically transforming our approach to criminal justice and dismantling systemic racism wherever we find it. https://t.co/zGy7epUrjk","date":"Wed May 26 01:48:15 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we remember George Floyd and uplift all who loved him. \n\nNow is the time to address centuries of brutality. Let's seize it. ✊🏽\n\nhttps://t.co/YQ9r3xFg7p","date":"Tue May 25 16:23:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I am holding a press conference with local officials celebrating the American Rescue Plan and ensuring the funds are used to directly support Minnesotans. https://t.co/AAvIn1lUDV","date":"Mon May 24 20:18:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In 1968, Dr. Martin Luther King, Jr. called on our government to “guarantee a job to all people who want to work and are able to work.”\n\nIt’s time to make this a reality with a federal jobs guarantee.","date":"Mon May 24 13:19:28 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"No child in the richest country in the world should go hungry. \n \nCancel all school meal debt and make school meals universal.","date":"Sun May 23 17:44:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Ending qualified immunity is necessary to bring real change and accountability to policing. \n\nProud to support this letter.","date":"Sun May 23 15:52:32 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy to be back home after a busy week in Washington! \n\nToday, I visited the Becker Park grand opening celebration, the Native American Community Clinic, and a vaccination event at the Midtown YWCA. \n\nGrateful to represent our beautiful community 🙏🏽 https://t.co/pmPC49k83d","date":"Sat May 22 19:25:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Heartbreaking.\n \nWe can’t continue ignoring the pain of our communities. We need action NOW. \n\nhttps://t.co/F9YVklrekK","date":"Sat May 22 15:55:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I toured the Minneapolis VA Medical Center with @DenisMcDonough, @GovTimWalz, @SenAmyKlobuchar, and @SenTinaSmith. \n \nI'm committed to strengthening the VA, ensuring our servicemembers do not have to fight in needless wars, and are taken care of when they return home. https://t.co/PsZWHoCaFa","date":"Fri May 21 21:55:37 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Canceling student debt will help 45 million Americans:\n \n-Buy a house\n-Start a family\n-Start a business\n-Save for the future\n-Participate in our economy\n \nNow is the time to put money in people's pockets and #CancelStudentDebt.","date":"Fri May 21 13:05:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"To have a livable planet, we’re moving the Green New Deal from a moral vision to concrete legislation.  \n \nThat’s why I reintroduced the End Polluter Welfare Act with @SenSanders to end the *$15 billion* in federal subsidies to the fossil fuel industry every year.🌎","date":"Thu May 20 20:10:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I voted NO on the $1.9 billion security supplemental along with @RepCori AND @RepPressley. \n\nWe should not be giving more money to law enforcement without addressing the root causes of their problems.\n\nOur statement below: https://t.co/TLWyTtp4Ot","date":"Thu May 20 17:56:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We were able to secure $1,750,000,000 in federal grant money for infrastructure and other community projects last Congress.\n \nI won’t stop #Fightingforthe5th and making sure our community project needs are funded.","date":"Thu May 20 01:39:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I may not sit on the @TransportDems committee, but I’ll go anywhere to advocate for Minnesota infrastructure. 💪🏽\n\nLast year, I testified before the committee to discuss the vital need for infrastructure improvements in MN05 and across the country. https://t.co/7iw5V76My1","date":"Thu May 20 01:38:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, the House passed legislation to ensure better oversight of anti-Asian hate crimes and more support for victims. \n\nI met with AAPI community leaders to discuss the passage and hear their legislative priorities. \n\nProud to have voted YES to #StopAsianHate.","date":"Wed May 19 23:11:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Median pay for workers at McDonald’s: $9,124.\nPay for McDonald’s CEO: $10.8 million. \n\nI’ve said it before and I’ll say it again: Our country’s weakness is not scarcity — it’s greed. Proud to stand with @McDonalds workers striking today for a living wage✊🏽","date":"Wed May 19 21:48:41 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🙏🏽","date":"Wed May 19 21:06:20 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It's clear the criminal justice system is not equipped to prosecute itself. \n \nLast month, I introduced legislation to create a separate agency responsible for investigating all nationwide deaths occurring in police custody and officer-involved shootings.\nhttps://t.co/XdIxxwbeX7","date":"Wed May 19 14:18:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minnesotans: If you haven’t received your vaccine yet, now is the time. \n\nSign-up here: https://t.co/XdFxsbnAiR","date":"Tue May 18 21:36:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As we begin our withdrawal from Afghanistan, we must ensure the Afghan judicial system has the capability to adequately pursue justice for the victims of atrocity crimes and ensure the safety of Afghan women. \n \nYou can watch my remarks from the @HouseForeign hearing below. https://t.co/KPVtEXD00l","date":"Tue May 18 19:15:11 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Expand the Court.","date":"Tue May 18 13:05:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week, the House is set to vote to establish a commission to investigate the January 6th insurrection. \n \nDemocracy demands accountability.","date":"Mon May 17 21:05:47 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Palestinian lives matter. Pass it on.","date":"Mon May 17 19:33:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The United States should not stand idly by while crimes against humanity are being committed with our backing.\n\nMy statement on proposed arms sale to Israel amidst escalating violence and human rights abuses in Gaza: https://t.co/N70iuVhesd","date":"Mon May 17 18:10:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Nike: $2.9 billion income\nTaxes: $0 \n\nDish Network: $2.5 billion income\nTaxes: $0 \n\nSalesforce: $2.6 billion income\nTaxes: $0 \n\nFedEx: $1.2 billion income\nTaxes: $0 \n\nThis is not how we build a fair and moral society. Tax giveaways to corporations and the rich must end. #TaxDay","date":"Mon May 17 17:05:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"https://t.co/2IHjTKwbzq","date":"Mon May 17 17:05:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If we can afford to give the Pentagon $2B every day, we can afford Medicare for All.","date":"Sun May 16 18:05:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Housing is a basic human right. \n\nWe need to invest the resources necessary to secure housing for all.","date":"Sat May 15 20:45:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"On the 3rd anniversary of mass arrests of women’s rights activists in Saudi Arabia, I sent a letter to advance women’s equality in the country.\n\nProud to join @RepBonamici, @RepSchakowsky, and @RepSpeier to hold perpetrators of violence accountable. https://t.co/gdf7WNxJGP","date":"Sat May 15 15:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Women should never have to choose between pregnancy and a paycheck. \n\nToday, I voted YES on the Pregnant Workers Fairness Act to secure strong and clear protections for pregnant workers.","date":"Fri May 14 21:25:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🙏🏽https://t.co/DTdwEQujTp","date":"Fri May 14 17:04:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"My amendment to study the harmful debt collection practices by private debt collectors and student loan companies passed the House! \n\nWe’re one step closer to bringing greater transparency and accountability to the student debt collection industry. 💪🏽","date":"Fri May 14 16:20:19 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, the MN House passed historic legislation to legalize cannabis for adult use and expunge non-violent cannabis convictions. #LegalizeMN\n\nNow, let’s legalize cannabis and expunge records nationwide.","date":"Fri May 14 15:13:15 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today is Eid, one of the most joyous days in the Muslim calendar.\n\nWhile I'd rather be spending it with my family, I have an obligation to stand up for the families whose children were taken from them because of the violence in Palestine.\n\nMy remarks on the House Floor tonight https://t.co/MSnNpuZuit","date":"Thu May 13 23:19:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Heading to the House Floor to speak now https://t.co/m2ZTjUnkEA","date":"Thu May 13 22:10:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If we claim to stand for human rights, we must stand for them everywhere. \n\nI’ll be joining @RepMarkPocan and @RepMarieNewman for a special order hour at 5:00pm CT/6:00pm ET on the situation in Gaza. \n\nTune in: https://t.co/m2ZTjUEVw8","date":"Thu May 13 15:20:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Eid Mubarak! \n\nWishing everyone in Minnesota and around the world a blessed Eid. May it be filled with peace, joy, and love.","date":"Thu May 13 13:00:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Sending my sincere condolences to @AmyKlobuchar on the loss of her father. \n\nMy heart goes out to all who knew and loved him. May you find comfort in the memories you shared.","date":"Wed May 12 21:09:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Proud to join.\n\nWe cannot stand silently by as blatant violations of international law are committed by Netanyahu and his government.","date":"Wed May 12 20:37:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Great news 👏🏽\n\nNow, let’s make Juneteenth a federal holiday.","date":"Wed May 12 18:59:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We are the only major country to NOT provide paid maternity leave. \n\nIt’s way past time we guarantee paid parental leave for all workers. \nhttps://t.co/jvIatcJIVt","date":"Wed May 12 15:58:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Birthday, Minnesota! \n\nGrateful every day to represent the 5th District in Congress. \n\nTogether, we are creating a more just world for every Minnesotan 💪🏽 https://t.co/2BZdZQtAr1","date":"Tue May 11 22:37:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Now is our chance to end poverty wages. \n\nNow is our chance to make billionaires pay their fair share. \n\nNow is our chance to guarantee paid leave for working people.\n\nNow is our chance to fight for a livable planet.\n\nNow is our chance to center people’s needs in our politics.","date":"Tue May 11 20:30:30 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"School meals should be universal. Period. \n \nLast week, I introduced legislation to make this a reality.\nhttps://t.co/sr9mEkxcO2","date":"Tue May 11 18:21:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Cancel all student debt.","date":"Tue May 11 13:05:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It is long past time we stop paying lip service to Palestinian human rights and finally take action to protect them.\n\nProud to join @RepRashida and @RepAndreCarson to condemn the attacks on Muslims during the holy month of Ramadan. \n\nYou can read our statement below. https://t.co/1HxuYlS66Q","date":"Mon May 10 23:34:24 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"53,000 Minnesota households are estimated to be behind on rent. \n\nMy Rent and Mortgage Cancellation Act will cancel ALL rent and mortgage payments until the end of the pandemic.\n\nWe owe it to our communities to prevent evictions and displacement. \nhttps://t.co/PslBfPgVgh","date":"Mon May 10 21:38:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We don’t have to live like this.\n\nEliminate the filibuster so we can actually pass gun violence prevention legislation.","date":"Mon May 10 19:47:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yes to all of this. https://t.co/IdpHUnRHrh","date":"Mon May 10 14:09:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This #MothersDay, let’s honor the millions of home care moms caring for our family members by giving them what they really want: protections and pay they deserve. #CareIsEssential","date":"Sun May 09 16:30:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Mother’s Day! Proud to be mom “Hooyo” to some incredible kids. ❤ https://t.co/5MvBIHA4OW","date":"Sun May 09 14:15:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The vaccine is our ticket back to normalcy.\n\nYou can find a vaccination site here: https://t.co/XdFxsb5YUh\n\nhttps://t.co/P7cncBx0Rq","date":"Sat May 08 23:04:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"A job should get you out of poverty, not keep you in it. \n\nWe needed a $15/hour federal minimum wage yesterday.","date":"Sat May 08 18:09:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"These indictments are a crucial step to help bring accountability.  \n\nBut we will not see justice until we undertake systemwide reforms. That includes creating an agency to investigate misuse of force by police, demilitarizing police departments, and ending qualified immunity.","date":"Sat May 08 15:14:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"@SenSanders @SenGillibrand @RepGwenMoore This builds on the success of the MEALS Act, which I passed last year to fund universal school meals during the pandemic https://t.co/bjmLP6Xgir","date":"Fri May 07 16:10:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"75% of school districts have school meal debt.\n \nNo child should be forced into debt because they can’t afford to eat.\n \nToday, I introduced the Universal School Meals Act with @SenSanders, @SenGillibrand and @RepGwenMoore to make school meals universal.\nhttps://t.co/OVDZuLJlXy","date":"Fri May 07 15:59:32 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I'm honored to receive this award from @NIACouncil. They are a vital voice for the Iranian-American community, peace and civil rights for all Americans. Join here:\nhttps://t.co/NCiG4xbvMX","date":"Thu May 06 23:55:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s climate action or the filibuster.\nIt’s marijuana legalization or the filibuster.\nIt's LGBTQ+ rights or the filibuster.\nIt's Dreamers or the filibuster.\nIt's police accountability or the filibuster.\n \nIt’s our democracy, or it’s the filibuster.\n#EndTheFilibuster","date":"Thu May 06 21:50:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Honored to help lead this vital commission and to fight for human rights worldwide!","date":"Thu May 06 20:12:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thank you @POTUS for supporting a vaccine waiver and to @janschakowsky, @repblumenauer, @rosadelauro and so many more for your advocacy.\n \nNow we must make sure the WTO follows suit.\n \nUntil all of us are safe from this virus, no one is. https://t.co/mbwCRqc9db","date":"Thu May 06 19:06:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"People often ask how I deal with the haters and the answer is: I was built this way 💁🏽‍♀️\n\nMy advice to anyone dealing with hate is to stay rooted in reality and don’t give energy to those trying to knock you down. https://t.co/zw3IPy7FRg","date":"Wed May 05 17:14:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The tipped minimum wage of $2.13/hour is a starvation wage, and it disproportionately affects women and workers of color. \n \nEliminate it and pay all workers at least $15 an hour. https://t.co/fALqJi5YV6","date":"Wed May 05 14:33:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is how democracy dies.\n \n Salvadoran President Nayib Bukele is plunging the country into dictatorship—furthering the migration crisis in the region.\n \nWe must reassess any and all U.S. aid to Bukele’s regime, and cut security assistance immediately.  https://t.co/jDaXhsPW45","date":"Tue May 04 21:14:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Throughout American history, surveillance has been used to intimidate and victimize communities of color. \n \nNo one in the 5th District should have their entire neighborhood surveilled. Period. https://t.co/iJxRufvdjt","date":"Tue May 04 19:07:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every person in America should have the right to guaranteed housing, universal healthcare, a living wage, and a quality standard of living.","date":"Tue May 04 13:33:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Standing in solidarity with the unions and workers in Colombia who are facing violence at the hands of the state during International Workers’ Day protests.\n\nPolice violence is a transnational problem. https://t.co/jBuoOBtd99","date":"Mon May 03 21:34:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Nearly 45 million Americans are shackled with student loan debt and the average amount of debt is more than $30,000. \n\nIt’s time to invest in the American people and cancel student debt.","date":"Mon May 03 20:29:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In the richest country in the world, no one should live in poverty. Period.\n\nEradicating poverty starts with implementing:\n-Medicare for All\n-$15 minimum wage\n-Social Security Expansion\n-Homes for All \n-Federal Jobs Guarantee","date":"Fri Apr 30 19:17:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It should be illegal for anyone to serve in the U.S. government if they were previously on the payroll of dictatorships.\n \nThe government should be serving the American people—not serving the interests of brutal dictatorships. \n \nYou can watch my @TLHumanRights remarks below👇🏽 https://t.co/TtRV4XMPuy","date":"Fri Apr 30 17:04:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Due to some technical issues, we'll just be on Zoom tonight (and post the full town hall after). You can join here: https://t.co/kyyhlNloiu…","date":"Thu Apr 29 21:42:24 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Can't wait to talk to Minnesotans this evening!","date":"Thu Apr 29 21:15:27 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday was a big win for environmental justice in Minnesota! \n\nWe shouldn't be giving blank checks to corporations to pollute water, destroy ecosystems, and violate Indigenous sovereignty.","date":"Thu Apr 29 15:16:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If you are not a constituent, you can join the town hall on https://t.co/tb6Af5RaAR https://t.co/NiSCEgXdw3","date":"Wed Apr 28 18:53:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Tomorrow at 5pm CT, I’m hosting a town hall to answer your questions.\n \nWe will discuss my new bills to reform our criminal justice system and what’s happening in Congress.\n \nRegister here: https://t.co/yBuLIFLdlx","date":"Wed Apr 28 18:53:41 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s clear we need systemwide reform to transform our criminal justice to protect all of us. \n \nToday, I introduced a package of bills to address continued police brutality and misuse of force. https://t.co/jD7dG5xO5p","date":"Wed Apr 28 15:12:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last week’s verdict was just a first step.\n\nNow, we must take steps to reimagine a public safety system that works for ALL of us. That starts with the passage of the George Floyd Justice in Policing Act in the Senate. #JusticeInPolicing","date":"Tue Apr 27 20:28:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This weekend, I joined an Earth Day🌎 cleanup in Columbia Heights, honored @MaryMoriarty for her 30 years as a public defender, and my office partnered with the community to host a vaccine equity event in Brooklyn Center. \n \nThankful to represent such an incredible community! https://t.co/VkxStobWYD","date":"Tue Apr 27 15:16:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s go!💪🏽","date":"Mon Apr 26 22:00:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It is important for us to remember parts of the history of this country where people came out to watch public lynchings.\n\nIt is going to be important for us to confront that reality, to confront our past history and trauma, in order to build a more just society. https://t.co/VAye9oK4vt","date":"Mon Apr 26 20:51:38 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In honor of #EarthDay, let's stop giving polluters $20 billion in corporate welfare every year.","date":"Sun Apr 25 20:33:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Thank you, @MinneapolisNAACP for your continued partnership and organizing in our efforts to combat systemic racism. https://t.co/8jNngKmigT","date":"Sun Apr 25 20:12:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Update: The Administration just took action to provide raw materials for COVID-19 vaccines to India. This is what happens when we organize and raise our voices 💪🏽\nhttps://t.co/sWRLQ9w7fk","date":"Sun Apr 25 19:33:14 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Join us for a Coffee and Kulan discussion about an important intersection – faith, racial justice, and the climate crisis. https://t.co/z5MEQQw4Ea","date":"Sun Apr 25 19:03:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"My heart breaks for India.\n \nPresident Biden must stand up to Big Pharma and allow everyone to have access to the vaccine. \n\nUntil everyone is safe from this virus, no one is. https://t.co/lED0baWNsF","date":"Sun Apr 25 17:12:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I join the Armenian community in Minnesota and worldwide in mourning the lives lost. We must acknowledge today’s recognition wouldn’t be possible without the Armenian community fighting to honor those lives. #ArmenianGenocide","date":"Sat Apr 24 22:24:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This Sunday at 2pm CT, I’m hosting another Coffee and Kulan with faith leaders to discuss racial and climate justice.\n \nCan’t wait to talk with you! https://t.co/wWxPUqaZQl","date":"Sat Apr 24 17:28:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Voting rights\nReimagining policing\nClimate justice\nGun violence prevention\nImmigration reform\nLGBTQ+ equality\nMarijuana legalization\n \nNone are possible unless we end the filibuster. Proud to join @RepCori’s letter demanding we #EndTheFilibuster.","date":"Sat Apr 24 15:52:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, I signed onto the Green New Deal as an original cosponsor.🌎\n \n2020 saw some of the worst climate catastrophes—with wildfires raging on the West Coast, an increase in hurricanes, heatwaves in Australia, and flooding around the world.\n\nIt's time we confront this crisis.","date":"Wed Apr 21 22:01:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Update: The #NOBANAct passed!","date":"Wed Apr 21 21:05:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last year, I introduced and passed the MEALS Act to make sure children have the nutrition they need to succeed during the pandemic. \n \nNow it is protecting millions of kids from hunger.\n \nNext step: universal school meals💪🏽","date":"Wed Apr 21 19:29:47 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, the House will vote on the No Ban Act. \n\nThis legislation will ensure no future president has the power to institute another Muslim ban or any other based on religious affiliation ever again.","date":"Wed Apr 21 17:50:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It is what motivated nonviolent movements from South Africa to South Asia to the American South.\n\nIt is what drives the Black Lives Matter movement today. And it is what must drive our elected leaders.","date":"Tue Apr 20 21:40:07 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"For centuries, systemic inequalities in the form of housing, income, education, and criminal justice have plagued our country—holding us back from our creed of liberty and justice for all. \n\nLet this be a turning point.","date":"Tue Apr 20 21:40:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let this be the moment where we implement a broad anti-racist agenda to root out the inequalities that continue to plague us. \n \nThat is what drove Martin Luther King, Jr. and the civil rights movement.","date":"Tue Apr 20 21:40:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"While today’s conviction is a necessary condition of justice, it is not sufficient. \n\nFor centuries, Black people have faced violence at the hands of the state in our country.","date":"Tue Apr 20 21:40:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today’s verdict is a major step on the path towards justice &amp; accountability. I thank our incredible @keithellison + the prosecution team, who successfully prosecuted a law enforcement homicide—notoriously difficult cases to prosecute &amp; held a murderer accountable on all charges.","date":"Tue Apr 20 21:40:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"My statement on the passing of Walter Mondale: https://t.co/2wUwASgfnx","date":"Tue Apr 20 01:56:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Proud to join this call for justice for the family of George Floyd. ✊🏽","date":"Mon Apr 19 19:38:24 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As a refugee, I know finding a home is a matter of life or death for children around the world.\n \nIt is shameful that @POTUS is reneging on a key promise to welcome refugees, moments after @RepSchakowsky @RepJayapal, myself and others called on him to increase the refugee cap. https://t.co/eaxjHCUhrI","date":"Fri Apr 16 17:40:20 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Taxpayers spend $15B/year in direct federal subsidies to the fossil fuel industry. \n\nWe shouldn't provide giveaways to the very people responsible for polluting our water and lands.\n\nI’m proud to work with @SenSanders to end the fossil fuel welfare system.\nhttps://t.co/D6wtAZCl7M https://t.co/TXTbh1u4e7","date":"Thu Apr 15 21:22:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every person, regardless of their race or nationality, should have equal access to the vaccine. \n\nWe need to stand up to Big Pharma and make generic vaccines available worldwide.","date":"Sat Apr 10 13:17:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Line 3 pipeline would emit 193M tons of CO2 a year, more than the rest of the MN *combined.* It is a nail in the coffin for sustainable human life on this planet and a slap in the face to indigenous sovereignty.\n\nMy op-ed with @zhaabowekwe. ⬇️ ⬇️ ⬇️ https://t.co/DXczEAWdsY","date":"Fri Apr 09 21:17:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The climate crisis is the greatest threat we face as a nation and a planet.\n \nToday I led a letter with @RepRashidaTlaib urging President Biden to conduct a thorough review of existing and proposed oil pipeline projects, including Line 3, Dakota Access Pipeline , and Line 5. https://t.co/NcxOahpSGX","date":"Fri Apr 09 20:54:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Great news! Trump’s cruel sanctions are leading to a medical crisis and record COVID cases. \n \nLet’s lift them and return to the deal. https://t.co/3BQNr75IjB","date":"Thu Apr 08 20:11:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is great news that will save lives.\n \nNext up: abolish the filibuster and pass gun safety legislation.","date":"Thu Apr 08 19:27:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, we remember the six million Jews and countless others who were murdered during the Holocaust, as well as the acts of resistance against unspeakable violence.\n\nAnd we commit ourselves to prevent genocide and all crimes against humanity. #NeverAgain","date":"Thu Apr 08 17:15:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Jeff Bezos is now worth $193 billion.\n\nHe makes $152,000 per *minute* and yet his workers are forced defecate in bags, and face retaliation for trying to exercise their right to collectively bargain.\n\nDon’t pretend this is normal.","date":"Thu Apr 08 13:21:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We cannot and we must not fall victims to politics of fear and hatred that drives the far-right. \n\nMy statement on President Biden's promise to lift the refugee cap and reject Trump's wall. https://t.co/is69xyT2R4","date":"Wed Apr 07 22:51:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If Republicans oppose providing care to seniors and people with disabilities, they should just say so.","date":"Wed Apr 07 22:00:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Grateful every day to have the opportunity to represent the 5th District of Minnesota in the People’s House!\n\nLast week, we had another busy district work week. Here’s some of the highlights ⬇️\n\nhttps://t.co/nRqbP8oOOa","date":"Wed Apr 07 13:30:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s National Library Workers Day.📚\n\nWhat’s the best book you ever checked out?","date":"Tue Apr 06 21:37:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"A child is dying every 75 seconds in Yemen. Today, I met with @LiberateYemen activists who have been on a hunger strike for the past 9 days to demand an end to the inhumane U.S. backed Saudi blockade in Yemen. \n\nProud to support this letter.","date":"Tue Apr 06 19:39:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Sending my sincere condolences to the family, friends, and staff of Rep. Alcee Hastings. \n\nHe was a beloved member of the Congressional Black Caucus who fought tirelessly on behalf of his district. He will be deeply missed.","date":"Tue Apr 06 17:40:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Feeling hopeful! Over 1.1 million Minnesotans have been vaccinated💪🏽\n\nWe must continue to stay vigilant to keep each other safe until everyone can get vaccinated. \nhttps://t.co/OvLOuImVwM","date":"Tue Apr 06 13:47:27 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s be clear: Voting is a right, not a privilege. \n\nNow more than ever, it’s critical we pass #HR1 to expand voting rights and access to the ballot box.","date":"Mon Apr 05 22:13:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We are all tied together by our common humanity.\n\nThis past year has been painful for all of us. As dark as many of these days have been, I remain in awe of the way our community has shown up and gone to bat for one another. \nhttps://t.co/kIG2Pekoi9","date":"Mon Apr 05 20:06:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Raising the minimum wage to $15 will:\n-Provide a raise to 32 million workers\n-Lift 1.3 million households out of poverty\n-Boost economic growth\n\nStarvation wages shouldn’t exist in America. Let’s #RaiseTheWage!","date":"Mon Apr 05 17:55:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Easter to all those celebrating! I hope your day is filled with joy and peace.","date":"Sun Apr 04 15:42:15 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Heartbroken to learn another CP was killed while protecting the Capitol. My thoughts and prayers go out to the officer’s family and the entire Capitol Police force. The death toll would have been worse if the assailant had an AR-15 instead of a knife.","date":"Fri Apr 02 20:44:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is a long overdue victory for international justice and the rule of law.\n \nI was proud to join @RepMcGovern and @JoaquinCastrotx in pushing for these sanctions to be lifted.\n \nIt is time for us to mean what we say and say what mean on human rights once and for all.","date":"Fri Apr 02 19:26:51 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"School visits are my favorite district work week activity. Love meeting with our amazing kids and school staff! https://t.co/FgluNxmrlW","date":"Thu Apr 01 21:11:54 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s April 1st. Rent is due. \n\nCancel rent and mortgages until this crisis is over.","date":"Thu Apr 01 16:06:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"On #CesarChavezDay, we honor the civil rights and labor activist who fought tirelessly for justice and better treatment of farmworkers.\n\nLet’s honor his legacy by ensuring all workers are provided a living wage, a safe workplace, and the right to organize.","date":"Thu Apr 01 00:17:02 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Excited to answer your questions on immigration, the stimulus package, and what I’ve been working on in Congress. https://t.co/lQ7DOxV6J5","date":"Wed Mar 31 22:33:50 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Now is not the time to remain beholden to a bankrupt, unpopular ideology that allows the richest people in the world to continue paying next to nothing in taxes, while millions starve in our streets. \n\nNow is the time to be bold. \n\nMy statement on the Build Back Better Plan: https://t.co/5uZrIYlObU","date":"Wed Mar 31 20:26:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I’m holding a press conference to condemn attacks against the AAPI community because an attack on one community is an attack on all of us. https://t.co/ZSu21oqx9R","date":"Wed Mar 31 19:35:27 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy #TransDayofVisibility to trans and non-binary people in Minnesota and worldwide.\n\nYou are seen. You are valued. And we’re going to keep fighting for a world free from discrimination.","date":"Wed Mar 31 18:21:28 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need to ensure our vulnerable neighborhoods are able to heal and recover holistically in the face of this COVID-19 crisis. \n\nThat is why I introduced the HEALING Act to invest $11 billion in aid to disinvested communities.","date":"Tue Mar 30 22:03:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"End qualified immunity.","date":"Tue Mar 30 19:56:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our community sent me to Washington to fiercely fight on your behalf.\n\nOn Wednesday at 5:30pm CT, I’ll be hosting a digital town hall to hear directly from you and carry your priorities to the People’s House! https://t.co/HLnpgWzPuO","date":"Mon Mar 29 22:23:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need justice. https://t.co/nZ53K3hqp0","date":"Mon Mar 29 18:55:46 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week, I visited the border and talked with children who fled unthinkable atrocities. \n \nI met a 12 year old boy who yearned for a better life—he was the same age as me when I came to the United States.\n \nThese children deserve to be treated with basic humanity and empathy. https://t.co/ERQhas73YX","date":"Mon Mar 29 03:36:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Passover to all who are celebrating!\n \nWishing you and your family good health, blessings, and peace. Chag Pesach Sameach!","date":"Sat Mar 27 15:36:07 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Black girls are suspended and expelled at higher rates—often due to discriminatory hair and dress policies.\n \nProud to reintroduce the #PUSHOUTAct with @RepPressley and @RepBonnie to end the trauma-informed policies in schools and create an environment where all girls can thrive.","date":"Fri Mar 26 22:09:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every child being detained deserves dignity and empathy.\n \nWe have a chance to restore hope for the little girls and boys who dream of a life of opportunity and stability in the United States of America. I should know. I was one. https://t.co/r7T3ymEvdy","date":"Fri Mar 26 18:54:05 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Together, we can welcome immigrants with open arms instead of a clenched fist.\n \nTogether, we can care for migrant children instead of throwing them in cages.\n \nTogether, we can create an immigration system that brings humanity to the forefront.","date":"Fri Mar 26 17:39:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"7 of the 10 biggest mass shooting events in our country were carried out with assault weapons.\n\nCongress banned them before. We can do it again.","date":"Thu Mar 25 18:39:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Legalize marijuana nationwide.","date":"Thu Mar 25 16:19:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last year, U.S. special operations forces were deployed to 154 countries, which is roughly 80 percent of the world. \n\nReforming war powers is more than just repealing AUMFs. \n\nWe need full accountability and transparency on our armed footprint around the world. https://t.co/GC4PAQiHMS","date":"Tue Mar 23 23:41:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"You can watch the full committee hearing here: https://t.co/zFXIQhLXsg","date":"Tue Mar 23 21:49:07 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We are the only country in the world not to have ratified the UN Convention on the Rights of the Child. \n\nToday in the @HouseForeign Committee, I asked what this does to our credibility on human rights when we refuse to ratify these treaties and conventions ourselves. https://t.co/8XwzfTCUWt","date":"Tue Mar 23 21:49:06 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"10 people in Colorado lost their lives to another senseless act of gun violence. \n\nWe can’t let the news cycle move on. We have the power to end gun violence and must act.","date":"Tue Mar 23 20:16:08 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Great news! Let’s keep it up Minnesota 💪🏽","date":"Tue Mar 23 00:35:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is a huge victory! 1.1 million children in Minnesota are expected to be impacted by the child tax credit in the recently passed stimulus package.\n\nThis is what happens when we prioritize the needs of the American people over corporate interests.\nhttps://t.co/dadbHxHjhP","date":"Mon Mar 22 21:59:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Good. \n\nNow cancel the rest of it.","date":"Mon Mar 22 19:28:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"For far too long, Black women have been penalized for simply existing as themselves. \n\nI joined my colleagues in reintroducing the CROWN Act to end hair discrimination.","date":"Mon Mar 22 16:55:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy #Nowruz to all those celebrating! \n\nI look forward to a year ahead filled with the blessings of peace, happiness, and the love of our families. https://t.co/9X2MFDo91A","date":"Sat Mar 20 18:56:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is the face of corporate greed. \n\nAll of our frontline workers deserve hazard pay and workplace protections as a bare minimum.","date":"Fri Mar 19 22:06:24 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Together, we can welcome immigrants with open arms instead of a clenched fist.\n\nTogether, we can care for migrant children instead of throwing them in cages.","date":"Fri Mar 19 19:29:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Who’s received their $1400 stimulus check? 🙋🏿‍♀️🙋🏼‍♀️🙋🏾‍♂️\n \nIf you haven’t yet, you can check on your payment status here: \nhttps://t.co/bdfA0Rj0k7","date":"Fri Mar 19 15:40:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, the House took steps to reform our broken immigration system by passing legislation to provide a pathway to citizenship for Dreamers and farm workers.\n\nI won’t stop fighting until all immigrants have a simple and accessible pathway to citizenship.✊🏽","date":"Fri Mar 19 00:01:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It is immoral that we spend more money on endless wars than we do on education, housing, and healthcare for our people. \n\nProud to join this letter to prioritize the American people over Pentagon waste.","date":"Thu Mar 18 20:13:23 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The House just passed a historic reauthorization of the Violence Against Women Act, which will make much needed investments in domestic violence prevention!\n \nThis bill included three of my amendments to better track the economic consequences of violence against women.","date":"Wed Mar 17 21:32:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Medicare for All. \n \nNo premiums, no co-payments, no deductibles—guaranteeing healthcare to all.","date":"Wed Mar 17 18:25:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Headed back from votes! We will begin shortly.","date":"Tue Mar 16 22:35:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Tonight, we are discussing ways to make our democracy work for the American people. https://t.co/Wl3AEKm1R8","date":"Tue Mar 16 22:32:36 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Across the country, Republicans are launching a full scale attack on your right to vote. \n\nTonight at 5:30pm CT, I’m holding a discussion with @MNSecofState and @emmagreenman on how we’re fighting to strengthen voter protections and ballot access.","date":"Tue Mar 16 20:02:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I know the difficulties of going through the refugee vetting process and am appalled that we are canceling flights and putting people’s new lives in the US on hold.\n\nI am calling on @POTUS to issue a new Presidential Directive immediately.\nhttps://t.co/jNeFFT1NHx","date":"Tue Mar 16 18:01:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"1 in 3 women have experienced physical abuse or sexual violence in their lifetimes. \n\nThese cases have only gone up due to the pandemic.\n\nProud to support the #ViolenceAgainstWomenAct—legislation to disarm domestic abusers and provide resources to women who have experienced abuse","date":"Mon Mar 15 22:16:11 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Reauthorize the Violence Against Women Act.","date":"Mon Mar 15 21:01:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Two years ago, we lost 51 lives in the horrendous Christchurch mosque attacks in New Zealand. \n\nToday is a reminder of how vigilant and resolute we must be in our fight against white supremacy and Islamophobia.","date":"Mon Mar 15 18:36:56 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must truly sever the financial incentives causing the expansion of an unnecessary and abuse-ridden system of mass incarceration.\n\nProud to lead the effort to end ICE contracts with state, county, and local prisons. https://t.co/wz63vSqS7G","date":"Mon Mar 15 16:01:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need to reform our democracy to make it work for the people. That starts with abolishing the filibuster and the Electoral College. \n\nOn Tuesday at 5:30pm CT, I’m hosting a discussion on democracy reform with MN Secretary of State, Steve Simon and State Rep. Emma Greenman. https://t.co/FFsea4oAJN","date":"Mon Mar 15 00:20:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must cancel rent and mortgage payments through the duration of the pandemic to prevent an even bigger housing crisis. https://t.co/T6Tr4dBLpn","date":"Sun Mar 14 15:26:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Cancelling rent and mortgage payments isn’t a radical idea. \n\nIt’s what is needed to prevent an inevitable housing crisis once the national rent moratorium ends.","date":"Sat Mar 13 16:56:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I hosted my second Green New Deal Task Force.\n\nWe need to take bold action to have a planet where future generations can thrive.\n\nProud to work with Minnesota stakeholders on this critical work! https://t.co/yFghpV1qIi","date":"Sat Mar 13 01:28:27 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Because of the American Rescue Plan you can start receiving checks this weekend!\n \nThis package will finally include payments to dependents and mixed status families. \n \nThanks to the advocates and organizers on the ground who made this win possible🎉","date":"Fri Mar 12 21:49:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, the House passed #HR8, legislation to require universal background checks on all gun sales. \n\nThis bill is an important step forward to preventing gun violence. \n\nProud to be a cosponsor of this critical legislation!","date":"Thu Mar 11 21:54:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Right now, 12 million Americans owe $6K on average in back rent. \n \nToday, I’m reintroducing the Rent and Mortgage Cancellation Act to provide a lifeline to the millions on the brink of housing insecurity. \n\nIt’s time to deliver bold solutions to prevent a mass wave of evictions. https://t.co/tdEJn2EsB8","date":"Thu Mar 11 17:48:51 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I’m holding a press conference on the Rent and Mortgage Cancellation Act. This bill will permanently cancel all rent and mortgage payments until April 2022. https://t.co/xvHtCHmWgg","date":"Thu Mar 11 17:07:08 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The PRO Act—the largest expansion of workers’ rights in generations—passed overwhelming in the House.\n\nAnd it is dead on arrival in the Senate unless we get rid of the filibuster.\n\nAbolish it.","date":"Thu Mar 11 01:52:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Diplomacy, not violence, should be at the center of our foreign policy.\n\nPresident Biden promised to rejoin the Iran nuclear deal. \n\nToday, I asked @SecBlinken why the President has yet to follow through on this commitment. https://t.co/8dkFvNYt5M","date":"Wed Mar 10 23:16:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yes! We should be prioritizing the students’ academic, and emotional well-being, not arbitrary standardized testing goals. \n\nProud to join @RepBowman in an effort to provide students with standardized testing waivers for this academic year. #SuspendTheTests https://t.co/6rtol7ViXa","date":"Wed Mar 10 18:34:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The American Rescue Plan is one of the boldest pieces of legislation in generations. \n \nAs Whip of the @USProgressives, I worked to keep the thresholds for survival checks the same and include a child tax credit that will cut child poverty in half.\n \nMy statement below: https://t.co/YVeappkCFP","date":"Wed Mar 10 17:01:08 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Labor unions have been the driving force for positive change for workers in modern history.\n \nAs a former union member, I can attest to the power that workers wield when they exercise their right to organize.\n \nWe need the PRO Act to put power back in the hands of workers. https://t.co/I75b0SJH3B","date":"Tue Mar 09 18:59:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s time for Congress to offer more than thoughts and prayers—we need real action to end gun violence. \n\nThis week, the House will vote on #HR8, legislation to require background checks on gun sales.","date":"Tue Mar 09 17:18:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy International Women’s Day!\n\nHere at home and around the world, we must fight for a world where every woman is treated with the dignity and respect they deserve.","date":"Tue Mar 09 02:02:38 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"These steps will move us closer to a more just world. \n \nI stand in solidarity with all those demanding justice in the streets in Minneapolis. \n \nTogether, we will continue our fight to end police brutality.✊🏽","date":"Mon Mar 08 23:30:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We can’t just root out systemic oppression in the criminal justice system — we must also tear down systems of oppression that exist in housing, education, healthcare, employment and the air we breathe.\n \nWe need to take a holistic approach to combat structural racism.","date":"Mon Mar 08 23:30:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"After George Floyd’s death, I introduced a series of bills to create stronger accountability for law enforcement and protect protesters. \n \nI plan to reintroduce these bills this Congress.","date":"Mon Mar 08 23:30:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"For far too long, we have witnessed the people who are sworn to protect our communities abuse their power. \n \nAs the trial of Derek Chauvin begins, I wanted to share some of the work we are doing to combat police brutality.","date":"Mon Mar 08 23:30:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must heed the calls from those who are impacted by police brutality daily. \n \nThat’s why right after the murder of George Floyd I hosted a listening session and continue to hold meetings to hear directly from Black community leaders. \nhttps://t.co/FO0jy1skRj","date":"Mon Mar 08 23:30:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last week, the House passed the George Floyd Justice in Policing Act. \n \nThis legislation will eliminate qualified immunity for law enforcement, prohibit racial profiling, and ban chokeholds. \n \nThis is an important step in the right direction, but we can’t stop here.","date":"Mon Mar 08 23:30:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"If the United States truly supports freedom of expression, democracy and human rights, there is no reason not to sanction Mohammed bin Salman—a man who approved the murder of Jamal Khashoggi.\n \nThat’s why I introduced legislation to hold the Crown Prince accountable. https://t.co/r7WNPPd7tj","date":"Sat Mar 06 00:14:49 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As someone who survived civil conflict, I know personally that political violence does not go away on its own. \n\nWe need dramatic reform to end corruption and restore our democracy. \n\nH.R. 1 is a critical step along that path. https://t.co/9rajXqknKp","date":"Fri Mar 05 00:30:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s be clear: raising the minimum wage to $15 is already a compromise. \n \nWe shouldn’t let an unelected official whose role is to advise—block a pay raise for 28 million Americans.\n \nDemocrats MUST keep the $15 minimum wage in the final COVID package. https://t.co/9eFlARQqJv","date":"Thu Mar 04 20:57:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The House just passed #HR1, legislation to end the culture of corruption in Washington. \n\nThe bill ends the dominance of big money in politics, protects the right to vote, and strengthens campaign finance oversight.\n\nWe’re going to put power back in the hands of the people.💪🏽","date":"Thu Mar 04 04:07:04 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, 10 months after George Floyd’s murder, I had the honor to preside over debate and call the vote ahead of passage of the George Floyd Justice in Policing Act.\n\nWe have an opportunity to address centuries of brutality. Let's seize it. https://t.co/u4wgvbIRFz","date":"Thu Mar 04 02:27:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The situation in Venezuela is dire.\n\nPeople are going without food and medicine—and U.S. sanctions are only making it worse.\n\nWe cannot allow people to suffer for our own domestic politics. Today, in the @HouseForeign Committee we discussed the challenges facing Venezuela. https://t.co/7bRP5eBajy","date":"Wed Mar 03 23:15:37 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This week, the House will vote on the George Floyd Justice in Policing Act. \n\nThis legislation will eliminate qualified immunity for law enforcement, ban chokeholds, and mandate data collection on police encounters. \n\nThis is the first step in bringing real change to policing.","date":"Wed Mar 03 15:25:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I had the honor of chairing a @HouseForeign hearing on elections in Africa.\n \nWe must ensure Somalia has fair elections and a peaceful transition of power. \n \nYou can watch my remarks below or the full committee hearing here: https://t.co/LzdLuQJleL https://t.co/t14coQRyKE","date":"Tue Mar 02 23:32:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As someone who experienced hunger, I know that going hungry is not a family choice—it's a policy choice. \n\nIn the richest country in the world, no one should be food insecure. \n\nFighting food insecurity remains one of my top priorities in Congress. \nhttps://t.co/MBoEZdaQF3","date":"Tue Mar 02 22:08:03 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Every minute Mohammed bin Salman escapes punishment is a moment where U.S. interests, human rights, and the lives of Saudi dissenters are at risk.\n\nToday, I introduced legislation to place sanctions on the Crown Prince for his role in the murder of Jamal Khashoggi. https://t.co/MKBzxotVbO","date":"Tue Mar 02 19:06:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We must ensure that lobbyists who represent foreign governments operate in full transparency and good faith, so they aren’t able to unduly influence elected officials.\n\nToday, I introduced the PAUL Act that will help end the culture of corruption in Washington.","date":"Mon Mar 01 23:30:43 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"A single unelected official shouldn’t be able to block a pay raise for 28 million Americans. \n\nProud to join this letter to ensure the $15 minimum wage is included in the COVID relief package. \nhttps://t.co/MnzqoO1HcQ","date":"Mon Mar 01 17:16:26 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The No Ban Act was just reintroduced in the House yesterday!\n \nThis bill will ensure no future president can ever ban a group of people from this country based solely on their religion or nationality. \n \nIt’s time to put the Muslim Ban in the dustbin of history where it belongs.","date":"Sat Feb 27 03:06:46 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Tonight, we are voting on the COVID relief bill that will include a $15 minimum wage. \n \nMake no mistake: Providing a raise to 28 million Americans *is* COVID relief.","date":"Sat Feb 27 01:54:15 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"There must be direct consequences for Mohammed bin Salman and his functionaries. \n\nIn the coming days, I plan to introduce a bill to place sanctions on Crown Prince Mohammed bin Salman for his role in this and other human rights abuses.\nhttps://t.co/IUuyfRKyph","date":"Sat Feb 27 00:34:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Administration must provide a legal rationale for the air strikes in Syria and why these strikes met the high bar for military action without Congressional approval. \n\nMy statement on the U.S. air strikes in Syria: https://t.co/bjgz9p5Ont","date":"Fri Feb 26 18:43:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Can't wait!","date":"Fri Feb 26 18:18:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Tonight, I am answering your questions on the next COVID relief package, student debt cancellation, and climate action. https://t.co/GCRzebInY2","date":"Thu Feb 25 23:56:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The Equality Act just passed the House! \n \nToday, we are one step closer to a future where every LGBTQ person can live their lives free from the fear of discrimination. Proud to be an original co-sponsor of this legislation.🏳️‍🌈","date":"Thu Feb 25 21:32:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happening tonight! Can’t wait to answer your questions.","date":"Thu Feb 25 19:29:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We have to rethink our foreign policy approach. \n\nAfter 4 years of failed leadership, we now have an opportunity to create foreign policy that stands for human rights, democracy, and justice. \n\nYou can watch my remarks here👇🏽 https://t.co/awotWUZUl1","date":"Thu Feb 25 15:50:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"About to ask some questions for the @HouseForeign committee hearing. \n\nWe are talking about restoring diplomacy and development around the world. \n\nSince we aren’t going in person to hearings, I thought I would change up my background😉 https://t.co/1Rui2CcmMZ","date":"Wed Feb 24 21:28:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Tomorrow at 5:30pm CT, I will be holding a virtual town hall. \n\nLeave your comments below and I’ll try my best to answer as many as possible. https://t.co/JRcWj6v0Ll","date":"Wed Feb 24 20:51:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Transportation is the #1 contributor to climate emissions in Minnesota. \n\nAdopting clean car standards will help us meet our state’s climate goals and reduce emissions. #CleanCarsMN\n\nhttps://t.co/X7KBaVokl7","date":"Wed Feb 24 20:06:25 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I survived a civil war. \n\nI witnessed the devastating consequences of war and the impact it has on millions of lives and entire societies. \n\nMy new leadership role on @HouseForeign will focus on ensuring no child goes through what I went through.\n\nhttps://t.co/WgpsrcJKWE","date":"Wed Feb 24 16:26:18 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"40% of Black-owned businesses have closed due to the pandemic. \n\nThis is unacceptable and a disservice to our communities. \n\nIf you’re a Black business owner or ally, you can register for this roundtable here: https://t.co/0Y9rjZwCuc","date":"Wed Feb 24 15:34:48 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"$15 minimum wage. Not $10, not $11. $15.","date":"Wed Feb 24 14:11:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"One year ago, Ahmaud Arbery was murdered in broad daylight. \n\nIt took over 2 months for his killers to be arrested. \n\nWe must implement lasting reforms to dismantle racism and white supremacy wherever we find it. https://t.co/udAbqUzFTr","date":"Wed Feb 24 00:58:11 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minnesotans: The MN Department of Health just launched the “Vaccine Connector” portal where you will be alerted when vaccines become available to you.\n\nYou can sign-up here: https://t.co/RP9pBUrvVO","date":"Tue Feb 23 14:32:01 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"PS let me know what you want to see next!","date":"Mon Feb 22 23:55:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I don’t just want to represent you, I want to cogovern with you. \n\nLast week, we had a jam-packed district work week and I wanted to show you what we’ve been working on. \n\nYou can view the behind the scenes below⬇️#FightingForThe5th \nhttps://t.co/AfzeWLSFD1","date":"Mon Feb 22 23:55:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Until everyone is safe from the virus, no one is. \n\nThe longer we wait to get this virus under control globally, the more it has a chance to mutate and spread further—we should be leading the global community in ensuring the broadest possible distribution of the vaccine.","date":"Mon Feb 22 21:31:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"For far too long, BIPOC students have been disproportionately underrepresented in Capitol Hill internships. \n\n@RepJayapal and I are fighting to change this by removing financial barriers that have stopped students from interning by allowing telework. \nhttps://t.co/cadKBYAwB5","date":"Mon Feb 22 20:23:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Stopping Line 3 will require a mass movement of people standing in solidarity to demand an end to these harmful pipelines.\n \nGrateful for the work of @MorePerfectUS that captured what’s happening on the ground.\n \nGive them a follow to see more of their incredible work😉","date":"Fri Feb 19 22:57:15 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Tar sands are the dirtiest fossil fuels in the world. \n \nIn Northern Minnesota, the Line 3 tar sands pipeline will threaten Indigenous communities’ ability to exist if this pipeline is built. \n \nWe must continue to put the pressure on the Biden Administration to #StopLine3. https://t.co/5CJ3shqYwp","date":"Fri Feb 19 19:52:37 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"You can watch my full @crookedmedia interview here: https://t.co/gLwQQgx1ZQ","date":"Fri Feb 19 14:35:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We cannot fall into the trap of making policies guided by terror, treating the symptoms of the illness without addressing the root causes.\n\nThe answer is not more laws expanding the surveillance and security state.  \n\nWe need restorative justice now more than ever. https://t.co/fYAYYDtRku","date":"Fri Feb 19 14:34:40 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"In order to build a more just world, we need to stay rooted in community together. \n \nGlad to talk with the Hennepin County board on ways we can collaborate and bring meaningful change to #MN05.","date":"Thu Feb 18 22:15:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"No one should be in prison for marijuana possession.\n\nPardon cannabis convictions now. #CannabisJusticeNOW","date":"Thu Feb 18 20:10:31 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"For decades now, the Muslim community have had their civil liberties compromised, their rights abused, and their privacy ignored.\n\nThe Biden Administration must provide a full explanation for this blatant abuse of power and ensure that it does not happen again.","date":"Thu Feb 18 18:32:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Racist and xenophobic attacks against the AAPI community aren’t new. \n\nWe need to work together to find ways to combat this hate together. \n\nYesterday, I met with local leaders to hear their stories and concerns. https://t.co/GCpniAPk1v","date":"Thu Feb 18 15:41:34 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Here’s the truth: Biden has the authority to cancel $50K in student loan debt and can do so with a stroke of a pen. \n\nWe should be investing in the futures of the American people where they aren’t crushed by exorbitant debt.  \n\nI hope President Biden acts to #CancelStudentDebt.","date":"Thu Feb 18 14:20:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We’re live! Today, we’re talking about why we need to legalize marijuana. Leave your questions in the comments below. https://t.co/LuVlGGWfoe","date":"Tue Feb 16 23:35:16 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Excited to host my first “Coffee and Kulan” discussion on cannabis legalization with @RepBarbaraLee and @_RyanWinkler.\n\nWe will talk about our work on the state and federal level to implement restorative justice practices and end the war on drugs. \n\nTune in! https://t.co/tfBzBhsq6g","date":"Tue Feb 16 20:46:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"During Black History Month and all year-round, I hope we can celebrate every shade of Black and work to root out the racism embedded within the beauty industry—starting with skin-whitening products. \n\nRead my op-ed here.\nhttps://t.co/ZS3BpAzi0V","date":"Tue Feb 16 19:33:00 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"It’s time to decriminalize marijuana.\n \nTomorrow, I’ll be hosting a “Coffee and Kulan” discussion on cannabis legalization with @RepBarbaraLee and @_RyanWinkler.\n \nCan’t wait to talk with you! https://t.co/eTpTm0ofjQ","date":"Mon Feb 15 21:35:10 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The pandemic does not adhere to borders. \n\nUntil the virus is eradicated everywhere, it is not eradicated anywhere.\n\nI led a letter with my colleagues to urge President Biden to rethink our existing sanctions to provide dire humanitarian aid.\nhttps://t.co/AOWnXzeWHJ","date":"Mon Feb 15 16:23:39 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The GOP has made the calculation that power and violence are more valuable than protecting our democracy. https://t.co/BXBuLMRseV","date":"Sun Feb 14 22:22:59 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This Valentine’s Day let’s lead with radical love and fight for a more just world for all. https://t.co/nKVOKKt7Ek","date":"Sun Feb 14 15:38:22 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I hosted a virtual lunch with our district’s female elected leaders. \n\nI always say: you don’t need permission to exist and to step into your power—all of these women have stepped up and are transforming their communities. \n\nWomen get the job done💪🏽 https://t.co/BgUtrGcYGS","date":"Sat Feb 13 01:41:29 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Happy Lunar New Year to everyone celebrating! Sending love to our AAPI community who have endured unspeakable hate especially in the past few weeks. \n\nI hope this year brings joy, health, and blessings.","date":"Sat Feb 13 00:25:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"This is the reality too many women of color face. \n\nProud to support the Black Maternal Health #Momnibus Act to address the racial disparities within our healthcare system.\n\nI won’t stop fighting until we end the maternal mortality crisis.","date":"Fri Feb 12 16:09:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"My heart breaks for all those that knew her.\n\nSending my condolences to her family and loved ones.\n\nWe have the power to end gun violence—we just need the moral clarity to act.\nhttps://t.co/MLSAEAOflX","date":"Fri Feb 12 01:41:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The best part of my job is connecting with Minnesotans.\n\nToday, I got to talk with members of the Minneapolis City Council on ways to stabilize rent prices and create more affordable housing options in our city. https://t.co/0KEnc8U029","date":"Thu Feb 11 23:15:20 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Excited to be named Vice Chair of the @HouseForeign Subcommittee on Africa, Global Health, Global Human Rights and International Organizations.\n\nI am thrilled to play a leadership role in overseeing our international aid and foreign policy on the continent.💪🏽","date":"Thu Feb 11 22:13:53 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Far too often, sanctions have been imposed without a comprehensive assessment of their impacts.\n\nToday, I joined @SenWarren + @RepChuyGarcia to call the Biden Admin to conduct a review of our existing sanctions so we can provide badly needed humanitarian aid. #ReviewSanctionsNow https://t.co/Xf2GIFhQYT","date":"Thu Feb 11 16:00:45 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Shoutout to @GiniwCollective for hosting me!","date":"Wed Feb 10 22:37:44 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I recently met with Indigenous activists trying to stop the Line 3 tar sands pipeline from destroying their ancestral home. \n\nRejecting some of the dirtiest fuel in the world should be a no-brainer.\n\nJoe Biden has an opportunity to be the climate president and #StopLine3 https://t.co/OTMdD6KtTK","date":"Wed Feb 10 22:36:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The United States has one of the highest child poverty rates in the world. \n\nWe now have the opportunity to cut childhood poverty by 50% with the American Rescue Plan. \n\nThis is an important first step, but we can and must go bolder until poverty is eradicated.","date":"Wed Feb 10 19:53:35 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Always love connecting with our local leaders. \n\nWe talked about COVID-19 relief for local governments, increasing transportation options, and bringing more affordable housing options to Golden Valley.","date":"Wed Feb 10 18:49:09 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Last night, my GOP colleagues focused on regional cost of living differences to oppose an increase in the minimum wage. \n\nThe regional minimum wage was first proposed to suppress wages for people of color.\n\nWe must continue to reject these efforts and work to protect all workers. https://t.co/UGK4n3PhyF","date":"Wed Feb 10 17:52:27 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Here’s what we know: lifting the federal minimum wage would raise wages for 27 million workers.\n\nCities and states that have increased their minimum wage to $15/hour have seen an increase in consumer spending AND job growth.","date":"Wed Feb 10 14:38:14 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Our Maternal Health Caucus has been focused on making the prenatal workforce more diverse in order to fully address the needs of women of color. #Momnibus \n\nExcited to join @RepAdams, @RepUnderwood, and @SenBooker for this vital work that will save lives.","date":"Tue Feb 09 23:11:14 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We promised $2000 checks. \n\nWatering down these checks—and excluding millions of people who lost jobs or wages in 2020—would be an unforced and potentially catastrophic mistake. \n\nIt’s bad politics and bad policy.","date":"Mon Feb 08 21:01:33 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Minnesotans: Getting a COVID-19 test is free and easy. \n\nYou can find a testing site here: https://t.co/8bnn3jK85q","date":"Mon Feb 08 19:53:47 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"The last thing people should be worried about is their student loan debt.\n\nIn Minnesota, there are 750,000+ student loan borrowers and each owe $34,932 on average. \n\nI promise I won’t stop fighting until we have cancelled student debt for everyone in America. https://t.co/hjUP8pApBF","date":"Sun Feb 07 18:26:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I came to Congress on a promise of cogovernance. \n \nAs your Congresswoman, I do not only want to represent Minnesotans, I want to govern with you. \n \nOn February 25th at 5:30pm CT, I will be holding a virtual town hall to hear from you. Can’t wait to answer your questions! https://t.co/Wzn5sYNGts","date":"Fri Feb 05 22:37:55 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Yesterday, I got to congratulate one of our bright and talented students from #MN05 on his selection for an appointment to the United States Military Academy at West Point.\n\nProud to represent so many brilliant and capable young people. https://t.co/YE9mGFFUme","date":"Fri Feb 05 18:46:52 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need recurring MONTHLY checks until the pandemic ends. \n \nLast week, I led a letter to the Biden Administration urging the inclusion of recurring cash payments in their future economic relief plans.\n \nWe cannot be too bold in responding to this crisis. \nhttps://t.co/yzWPo5pDWS","date":"Fri Feb 05 17:01:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"My office has been inundated since March with calls of personal pleas for Congress to act and implement substantial measures to provide a lifeline.\n \nPeople are suffering from no fault of their own and it’s our job as legislators to fight for them.","date":"Fri Feb 05 17:01:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"I always say, America does not suffer from scarcity. We suffer from greed.\n\nWe can choose to lift the burden millions of people face and we can actually invest in the futures of the American people.\n\nToday, I joined my colleagues to do just that and cancel student loan debt. https://t.co/1UsNFIXCoc","date":"Fri Feb 05 00:58:57 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"As a survivor of civil conflict, I know political violence does not go away on its own.\n \nThis is about whether or not we will continue to be a peaceful and functioning democracy. https://t.co/dbWp3ZlPwj","date":"Thu Feb 04 23:09:17 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Let’s be clear: This is not about me. \n \nThis is about a member of the Republican Caucus who has repeatedly incited violence and Republicans can’t just wave a magic wand and attack the Black Muslim woman. https://t.co/0PaonmEHgK","date":"Thu Feb 04 18:15:58 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"45 million people are shackled with student debt and unable to participate in our economy, start a family, and buy their own homes. \n\nNo one should be penalized for trying to get ahead. \n\nThat’s why I will continue to push for student debt cancellation this Congress.","date":"Thu Feb 04 14:57:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"You can also find the full statement here: https://t.co/4DWdAexg8Z","date":"Wed Feb 03 19:57:42 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"My statement on Republican efforts to whitewash Marjorie Taylor Greene’s incitement of violence. https://t.co/4igQmZf7AX","date":"Wed Feb 03 18:12:12 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Today, I led a letter to President Biden urging him to stop the construction of the Line 3 pipeline. \n\nClimate change does not stop at the border of a reservation or a state or a country—it impacts us all. \n\nThe Biden Administration can and must act to stop Line 3. https://t.co/ji5rHqS5Gc","date":"Wed Feb 03 16:39:20 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"We need to legalize cannabis and expunge records nationwide to begin undoing the devastation caused by the war on drugs. \n\nIf you want to learn more, make sure you tune into our “Coffee and Kulan” conversation on February 16th at 5:30pm CT live on Facebook.","date":"Tue Feb 02 22:58:11 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Right now, Cameroonian and other African asylum-seekers face deportation. \n\nThese asylum-seekers fled unthinkable atrocities and deserve complete consideration of their asylum request. \n\nWe must restore basic humanity to our immigration system and that starts with abolishing ICE.","date":"Tue Feb 02 21:54:21 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"Eliminating the filibuster will allow us to bring meaningful change to the American people. \n\nIt’s time to abolish it. \nhttps://t.co/KGW5omTzn4","date":"Mon Feb 01 22:46:13 +0000 2021","user_id":"1082334352711790593"},{"handle":"Ilhan","text":"🙌🏽This is great news! \n\nYou can find vaccine locations here: https://t.co/xqEkNnoQGp","date":"Mon Feb 01 20:12:19 +0000 2021","user_id":"1082334352711790593"}]