[{"handle":"MarioDB","text":"Proud to join my colleagues in introducing the House companion of this crucial bill that ensures that our growers and processors have the flexibility to continue producing OJ in #Florida and not have to depend on foreign imports. 🍊https://t.co/Ea46ZUPL6l","date":"Thu Jun 16 15:26:01 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"It was a profound honor and privilege to meet with a true hero, @EnesFreedom. Enes has proven to be not only a talented athlete but a man of courage and conviction. I greatly admire his unwavering support and advocacy for freedom and human rights. https://t.co/K2BtFCnr0G","date":"Wed Jun 15 18:04:19 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"#EvergladesCity was recognized as one of the best small towns to visit in 2022! I’m proud to represent this wonderful community. https://t.co/VvTgGShCVy","date":"Mon Jun 13 20:07:50 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"The national average gas price just hit $5.00/gallon. The American people are now spending more than $5,000 a year on gasoline, all because the Biden Administration refuses to unleash American energy. #BidenGasHike","date":"Sat Jun 11 18:01:39 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"I wonder what “Cuban spirit” leftists will push at Radio Mambi. Probably not the one of our community. We don’t want Radio Granma here.","date":"Fri Jun 10 23:49:57 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"U.S. inflation hit 8.6% in May, its highest level in more than four decades and the fastest annual pace since December 1981. https://t.co/9X6WqAdoNK","date":"Fri Jun 10 13:43:15 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"Tonight’s J6 committee hearing is the most blatant attempt to distract the American people from the disastrous and failed policies of the Democratic Party.","date":"Fri Jun 10 01:11:47 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"When is the primetime spectacle on Schumer inciting violence against specific Supreme Court Justices, leading to the arrest of Nicholas John Roske for attempting to murder Justice Kavanaugh?","date":"Thu Jun 09 19:19:27 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"Me uní a @SenRubioPress en una carta a la @FCC solicitando que analice minuciosamente la venta propuesta de 18 estaciones de radio en español, incluyendo Radio Mambí.","date":"Thu Jun 09 19:11:04 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"I'm proud to join @SenRubioPress in this letter to the @FCC requesting that it thoroughly scrutinize the proposed sale of 18 Spanish-language radio stations, including Radio Mambi.","date":"Thu Jun 09 19:08:06 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"La #CumbreAmericas no debe ser un ejercicio partidista vacío; Los líderes prodemocracia en las Americas que se preocupan por nuestra seguridad nacional y la del hemisferio deben ser incluidos e involucrados.","date":"Wed Jun 08 18:19:00 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"4. Coordinar estrategias para traer la manufactura crítica a las Américas para que no seamos rehenes de peligrosos adversarios de energía, medicinas, tecnología y otras necesidades básicas.","date":"Wed Jun 08 18:07:30 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"5. Galvanizar a otros países de las Américas para que nos apoyen en el fortalecimiento de la democracia, la libertad y los derechos humanos, y en la oposición a la tiranía.","date":"Wed Jun 08 18:07:30 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"3. Enfatizar la influencia maligna que representan la #China comunista, #Rusia, #Cuba, #Irán, #Nicaragua y el régimen de #Maduro en nuestro hemisferio.","date":"Wed Jun 08 18:07:30 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"2. Rechazar todos los intentos para legitimar dictaduras ilegítimas y no elegidas que perpetran atroces abusos contra los derechos humanos y amenazan los intereses de seguridad nacional de EE.UU.","date":"Wed Jun 08 18:07:30 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"En la #CumbreAmericas, Biden debe: 🧵\n\n1. Incluir a la sociedad civil, periodistas independientes, activistas de derechos humanos, exprisioneros políticos y activistas laborales independientes, particularmente de países totalitarios donde estos héroes son los verdaderos líderes.","date":"Wed Jun 08 18:07:29 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"The #SummitAmericas should not be an empty, partisan exercise; American leaders who care about our national security, and the Americas, should be included and involved.","date":"Wed Jun 08 18:01:21 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"3. Emphasize the malign influence posed by #CCPChina, #Russia, #Cuba, #Iran, #Nicaragua, and the #Maduro regime in our hemisphere.","date":"Wed Jun 08 18:00:59 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"4. Coordinate strategies for nearshoring and bringing critical manufacturing to the Americas so that we are not held hostage by dangerous adversaries for energy, medicines, tech, and other basic necessities.","date":"Wed Jun 08 18:00:59 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"5. Galvanize other countries in the Americas to support us in strengthening democracy, liberty, and human rights and opposing tyranny.","date":"Wed Jun 08 18:00:59 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"During the #SummitAmericas, the Biden Admin should: 🧵\n1. Include civil society, independent journalists, human rights activists, former political prisoners, &amp; independent labor activists, particularly from totalitarian countries where these brave heroes are the true leaders.","date":"Wed Jun 08 18:00:58 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"2. Refuse all attempts to legitimize illegitimate, unelected dictatorships that perpetrate egregious human rights abuses and threaten U.S. national security interests.","date":"Wed Jun 08 18:00:58 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"Proud to join my colleague, @GReschenthaler, in this letter urging the VA to improve its mortgage loan process for our nation's veterans. https://t.co/vChG0Y92nO","date":"Tue Jun 07 13:57:08 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"For years, an increasingly radical left has sought to silence conservative Hispanic voices in South Florida.\n\nRead my joint statement with @RepMariaSalazar &amp; @RepCarlos on the recent purchase of Radio Mambi. https://t.co/1emoFsuR4s","date":"Tue Jun 07 00:03:10 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"Durante años, una izquierda cada vez más radical ha buscado silenciar las voces hispanas conservadoras en el sur de la Florida.\n\nLean mi declaración junto a @RepMariaSalazar y @RepCarlos sobre la compra de Radio Mambí. https://t.co/5qBCBoj7fx","date":"Tue Jun 07 00:01:57 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"On the 78th anniversary of #DDay, we remember and honor the courageous heroes who stormed the beaches of Normandy to liberate Europe from Nazi tyranny. May we never forget their fight for freedom. https://t.co/OXx9bZRf5Q","date":"Mon Jun 06 14:15:27 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"(2/2) La Administración Biden debe detener estas concesiones unilaterales al régimen que oprime y encarcela sin piedad a los activistas, incluidos los niños, simplemente por exigir la libertad. https://t.co/KujsLBURVx","date":"Thu Jun 02 20:13:38 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"(1/2) Como dije cuando estos cambios se anunciaron por primera vez el mes pasado, aumentar los ingresos del régimen cubano es una traición desvergonzada al pueblo cubano en su lucha por la libertad. #SOSCuba","date":"Thu Jun 02 20:13:37 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"(2/2) The Biden Administration must stop these unilateral concessions to the regime that ruthlessly oppresses and imprisons activists, including children, for simply demanding freedom. https://t.co/jcSQlt4Eoa","date":"Thu Jun 02 20:05:26 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"(1/2) As I said when these changes were first announced last month, increasing revenue to the Cuban regime is a shameless betrayal of the Cuban people in their struggle for freedom. #SOSCuba","date":"Thu Jun 02 20:05:25 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"Glad to join @SenRickScott today in a press conference on hurricane preparedness. As we begin hurricane season, it is crucial that we are prepared with the resources we need and know the steps to take before, during, and after a storm. https://t.co/RJgtM1gFKK https://t.co/AWrsCHPSfG","date":"Wed Jun 01 21:30:35 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"Another week of record-high gas prices under the Biden Administration. Make no mistake, this is a direct result of Biden’s war on American energy. #BidenGasHike https://t.co/vKDHavT7Ib","date":"Wed Jun 01 14:29:49 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"On #MemorialDay, I express my immense appreciation to our nation’s heroes who sacrifice it all for our freedom, especially those who have paid the ultimate price in the line of duty. I’m grateful for their selflessness &amp; love of our country. Our debt to them can never be repaid.","date":"Mon May 30 14:44:55 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"Los colombianos acuden hoy a las urnas para elegir democráticamente a su próximo presidente. Felicito a #Colombia por su vocación de respeto a la libertad y a los derechos de sus ciudadanos y espero una exitosa y pacífica jornada electoral.","date":"Sun May 29 14:38:12 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"2/2 Esos valientes representan la esperanza de un futuro democrático y son los verdaderos líderes en #Cuba, #Venezuela y #Nicaragua.","date":"Fri May 27 17:19:04 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"1/2 Las dictaduras ilegítimas y anti democráticas no representan a las personas que oprimen. En lugar de dar la bienvenida a los abusadores de #DDHH a EE.UU. para la Cumbre, la Admin Biden debería invitar a líderes de derechos humanos y activistas a favor de la democracia.","date":"Fri May 27 17:19:03 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"1/2 Illegitimate, unelected dictatorships do not represent the people they oppress. Instead of welcoming human rights abusers to the U.S. for the Summit, the Biden Administration should invite human rights leaders and pro-democracy activists.","date":"Fri May 27 17:16:05 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"2/2 Those courageous individuals represent the hope of a democratic future, and are the true leaders in #Cuba, #Venezuela, and #Nicaragua.","date":"Fri May 27 17:16:05 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"It’s unconscionable that Senate Democratic Leadership blocked this bipartisan legislation that would actually make a real difference simply because it didn’t align with their hyper-partisan politics. The American people deserve better.","date":"Wed May 25 21:39:31 +0000 2022","user_id":"37094727"},{"handle":"MarioDB","text":"We can and must protect our children and schools. I urge House Democratic Leadership to bring these bipartisan, bicameral bills to the House floor for a vote. Congress must take legitimate and effective action now.","date":"Wed May 25 16:33:39 +0000 2022","user_id":"37094727"}]