[{"handle":"NormaJTorres","text":"Truly heartbreaking 💔 meanwhile the Senate is still scratching their heads.","date":"Fri Jun 17 01:09:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to Police Chief Darren Goodman, the first Black police chief in San Bernardino. Wishing you the best of luck on your new job. I’m always praying for the safety of our officers. https://t.co/JYOCPvSq5I","date":"Fri Jun 17 00:36:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our airport service workers at LAX &amp; Ontario have been on the frontlines of this pandemic, risking their health while trying to make ends meet. I’m proud to stand with my colleagues in supporting the Good Jobs for Good Airports Act to end poverty-level jobs at airports.","date":"Thu Jun 16 23:05:49 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"❗️Scam alert: Beware of texts such as the one below. The IRS will not contact you via text. Do NOT click on any links. For more info on IRS scams, visit https://t.co/YNBsTYFPFI.","date":"Thu Jun 16 21:46:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last year, I introduced the Protecting Vice Presidents Act, legislation that provides lifetime Secret Service benefits to all former VPs. I introduced this legislation because, in America, we don’t stand with insurrectionists who desire to hang our VP. #January6thHearings","date":"Thu Jun 16 17:59:12 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Familes across the Inland Empire are paying up to $70 dollars to fill up their gas tanks. Today, I’m voting for the Lower Food and Fuels Costs Act because it’s a step forward in reducing costs at the gas pump. We must continue to find solutions to this nationwide issue.","date":"Thu Jun 16 16:12:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you @USArmy for dropping off cupcakes to our office to celebrate your 247th birthday! Thank you for all you do in defense of our country. Here’s to many more! #Army247 https://t.co/iP1CJlIuiK","date":"Thu Jun 16 00:00:55 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was a pleasure to welcome Yusuf from the Dawoodi Muslim community to Capitol Hill and hear directly from him on legislative priorities for the community. Thank you for stopping by! https://t.co/1KjjLUIl2q","date":"Wed Jun 15 20:32:35 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I met with @CHIRLA members and DACA holders to discuss their concerns for access to higher education, and the need for permanent protections, including updating the registry date. https://t.co/6yjMD54yKF","date":"Wed Jun 15 18:27:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Como alguien que vino a los Estados Unidos cuando era niña, entiendo profunda y personalmente la experiencia de los jóvenes migrantes. DACA ha fortalecido a nuestra nación al mantener unidas a las familias y brindar una expansión de posibilidades a los inmigrantes.#NoSonOlvidados https://t.co/BrqpqAoK6d","date":"Wed Jun 15 15:55:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"As someone who came to the United States as a child myself, I deeply and personally understand the experience of young migrants. #DACA has made our nation stronger by keeping families together, and providing an expanse of opportunities to immigrants. #NoSonOlvidados https://t.co/BXEjQf28FA","date":"Wed Jun 15 15:53:13 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"In honor of #FlagDay yesterday, Pomona American Legion Post 30 hosted a ceremony to retire American flags. Many were dedicated to past veterans, present and future military who dedicate their lives to serving our country. We salute you! https://t.co/4rSgitT2E4","date":"Wed Jun 15 13:57:23 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is terrible news. Prayers for their families 🙏🏼","date":"Wed Jun 15 03:02:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today I sent a letter to @DrCaliff_FDA urging the FDA to take steps to address our blood supply shortage. We must strengthen our blood supply to improve patient care &amp; outcomes. That includes allowing LGBTQ+ Americans to donate blood. #WorldBloodDonorDay https://t.co/izgg0t4qlb","date":"Tue Jun 14 21:51:56 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This weekend the @OntarioCLC and the @chaffeycollege  Museum of Art presented “Then &amp; Now: Women Artists of the Pomona Valley,\" featuring amazing work by talented local artists. https://t.co/kedn5tju0E","date":"Tue Jun 14 17:03:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"🗣 Schadenfreude!","date":"Tue Jun 14 01:26:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The solution is not - and never will be - more guns.","date":"Mon Jun 13 21:43:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We had a great turnout for our veterans job and resource fair last week in @CityofOntario. A big thanks to all our partners and volunteers for helping put on this event. https://t.co/XzAAO457XO","date":"Mon Jun 13 18:32:30 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am sitting in the room where history is being made and the truth is being told. Thank you @January6thCmte for your work uncovering the truth of what happened on January 6th and the days that led to the violent insurrection. https://t.co/oTWHWtE38W","date":"Mon Jun 13 15:54:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today we continue to hear first-hand testimony and see new evidence from @January6thCmte demonstrating just how coordinated the insurrection was by former president Trump and his followers. Truth will prevail.","date":"Mon Jun 13 15:42:56 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I joined @RepRaulGrijalva, @JoaquinCastrotx, @RepEscobar, and @RepChuyGarcia in urging \n@TxDPS to provide updates to the Uvalde community in Spanish, especially as misinformation and inconsistencies circulate. Residents shouldn’t be left in the dark because of a language barrier.","date":"Mon Jun 13 13:45:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The people of Uvalde have a right to know all the information about the horrific shooting that took place at Robb Elementary, and those whose first language is Spanish cannot continue to be overlooked. https://t.co/9PPucfWi0d","date":"Mon Jun 13 13:45:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"And that’s wrap for the #SummitoftheAmericas https://t.co/1FJWekSmPl","date":"Sat Jun 11 06:00:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Canada is one of our most trusted and important allies – thank you @JustinTrudeau for your commitment to working together on tough issues and continued partnership. https://t.co/xK3ATjiauc","date":"Fri Jun 10 21:53:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great to see @POTUS at @SummitAmericas reaffirming his administration’s commitment to combating corruption and upholding human rights across the Americas. https://t.co/gkYZpCoOBc","date":"Fri Jun 10 19:43:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m proud to join @SpeakerPelosi &amp; the rest of the Congressional delegation to @SummitAmericas. We will continue our commitment to improving opportunity &amp; protecting democracy &amp; human rights in Latin America &amp; the Caribbean - causes that have been pillars of my work in Congress.","date":"Fri Jun 10 19:26:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I thank the @CapitolPolice and all law enforcement who responded that day for keeping us safe. And I thank the @January6thCmte for their relentless pursuit of the truth. What they’ve discovered is difficult to watch and hear, but we cannot look away.","date":"Fri Jun 10 17:04:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last night, we watched gut-wrenching footage and heard poignant testimony during @January6thCmte's first hearing. I remember being in the Capitol building, unsure if I’d make it out alive with my colleagues. Our law enforcement officers were heroes that day and every day.","date":"Fri Jun 10 17:04:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".thank you for sharing this @RepJohnLarson, proud to have been with you and proud to see our #Pomona blanket made the photo.","date":"Fri Jun 10 16:37:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"January 6th was an insurrection encouraged by former President Trump and his allies. Tonight we will hear from @January6thCmte and learn what they have found through their investigations. Democracy can only prevail if we hold those who aim to undermine it accountable.","date":"Thu Jun 09 21:57:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"-Bans high-capacity magazines\n-Raises the age to buy military-style rifles to 21\n-Promotes safe storage \n-Bans bump stocks and ghost guns \n \nThese policies will protect our kids and communities.","date":"Thu Jun 09 20:35:42 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last night, only FIVE Republicans had the courage to vote for the Protecting Our Children Act. It’s a shame the majority of Republicans care more for campaign contributions than saving the lives of our children. What does this legislation do? Let’s take a look ⬇️","date":"Thu Jun 09 20:35:23 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great meeting with Los Angeles District Army Corps of Engineers Colonel Julie Balten, Commander of the Los Angeles District and David Van Dorpe. We discussed the Prado Dam and bringing water to the Inland Empire amid the drought. https://t.co/67blac39Nc","date":"Thu Jun 09 15:54:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"These individuals deserve to have a seat at the table, and these are the communities @SummitAmericas should be working to serve. I will continue to uplift the voices of immigrants who have been left behind and overlooked. https://t.co/YMbO3hrvrX","date":"Thu Jun 09 13:54:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m voting this evening for the #ProtectingOurKidsAct. Firearms were the leading cause of death for children and teens in 2020 in our country - this problem is uniquely American, and we have a responsibility to end it.","date":"Wed Jun 08 23:14:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I met with @AMarch4OurLives to hear their priorities for gun reform and reaffirm my commitment to keeping weapons of war off our streets and out of our schools, churches, and communities. https://t.co/BUKo1KyPpg","date":"Wed Jun 08 23:05:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Yesterday, President Biden signed nine bills to improve veterans’ access to their benefits. Veterans sacrifice so much when protecting and defending our democracy. These laws will honor their efforts and sacrifices and strengthen benefit accessibility. https://t.co/DRR2yq8Sxf","date":"Wed Jun 08 17:25:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is heartbreaking and gut-wrenching. These parents should still have their daughter. Lexi should still have a bright future ahead of her. We can't bring her back, but we can make sure no more parents have to experience this grief.\n\nHow can anyone watch this and be unmoved?","date":"Wed Jun 08 16:25:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Desde la migración hasta el desarrollo económico y el cambio climático, la Cumbre de las Américas es una ocasión trascendental para planificar y abordar los desafíos que enfrenta nuestra región. Estoy profundamente preocupado por los líderes que han optado venir. https://t.co/umvDUm4Fe7","date":"Wed Jun 08 14:38:04 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"From migration to economic development to climate change, the Summit of the Americas is a momentous occasion to plan and address the challenges our region faces. I’m deeply troubled by the leaders who have chosen not to attend. https://t.co/TGH8npVnuu https://t.co/ciTFLYwhnn","date":"Wed Jun 08 14:36:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Help us find the #Grinch","date":"Wed Jun 08 05:05:04 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This Thursday, our country will listen to the findings of the January 6th Committee and the danger Trump and his supporters caused that day. This guide is a good read ahead of time. https://t.co/oOw9JUWWyo","date":"Tue Jun 07 22:13:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was a pleasure to connect with @ClaudiaOrtizSV. We both agree that the investments coming from the Biden Administration should be subject to thorough oversight. No corrupt officials should get their hands on these impactful investments.","date":"Tue Jun 07 19:18:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This #NationalHigherEducationDay I'm thanking Dr. Coley at @calpolypomona. CPP serves nearly 30k students and conducts valuable research. Thank you Dr. Coley for your leadership and for providing exceptional academic and professional opportunities to the #InlandEmpire. https://t.co/Rv2xJLQyzd","date":"Tue Jun 07 02:54:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to all who participated in the conversation. We must be clear-eyed about with whom we are working and the enormity of the challenge our nations face and recognize that we have the opportunity now to make a real change to improve conditions for the people we serve.","date":"Tue Jun 07 02:10:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I joined @house_democracy today at @SummitAmericas to discuss strengthening democratic resilience to combat corruption.","date":"Tue Jun 07 02:09:30 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I sent a letter to @USDOT @SecretaryPete outlining my FY23 transportation priorities for the #InlandEmpire, including transportation equity, air quality, and transit workers. https://t.co/rFPxhmyXoU","date":"Mon Jun 06 15:36:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"No 18-year-old in America needs a semiautomatic rifle. Weapons of war shouldn’t be easily accessible to young adults – or anyone in our country.","date":"Mon Jun 06 13:28:19 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our economic recovery continues to be strong: In May, 390,000 jobs were created, and unemployment stayed near historic lows. Americans continue to join our resilient and diverse labor force, even in the Inland Empire. Happy #JobsDay to those who celebrate!","date":"Sat Jun 04 01:04:04 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Call (202) 224-3121 to be connected to your Senator’s office and urge them to pass Bipartisan Background Checks and Enhanced Background Checks. There’s no reason for commonsense gun reform to be stalled in the Senate right now.","date":"Fri Jun 03 23:56:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Next week, we will take another significant step in the House to #EndGunViolence through common-sense gun legislation that will protect our communities.\n \nThis Gun Violence Awareness Day, I’m remembering every victim of gun violence and driving my anger into action.","date":"Fri Jun 03 23:55:53 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Join my office for a job and resource fair next Friday in @CityofOntario and learn what other programs and services we offer to local veterans. https://t.co/iQvyC1WQEc","date":"Fri Jun 03 16:40:07 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"All California active registered voters receive a vote-by-mail ballot for the Primary Election. Learn how to return your mail-in ballot, or find an in-person voting location on election day at https://t.co/cvPkCo3awU.","date":"Fri Jun 03 13:41:52 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On National Egg Day I'd like to recognize Golden Fresh Egg Ranch in @CityofFontanaCA, who for 50+ years have provided fresh local eggs to the #InlandEmpire. Thank you to the owner Phillip and family! https://t.co/2ahRGZkXjv","date":"Thu Jun 02 20:55:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Nonconsensual condom removal is sexual violence that can have lifelong consequences – consent is key, it’s that simple.\n \n@RepMaloney, @RepRoKhanna, and I introduced the Consent is Key Act &amp; Stealthing Act of 2022. https://t.co/HZciwU0xsV https://t.co/Fh0Bjyq3EW","date":"Thu Jun 02 18:48:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This month, we honor the trailblazers who have paved the way for LGBTQ+ rights in our country because no one should be discriminated against based on their identity and who they decide to love. Happy #PrideMonth! #loveislove https://t.co/BxvbF3CSBN","date":"Thu Jun 02 15:00:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"A special congratulations to Chino resident, and my Appointee Nicholas Ramos who graduated from @WestPoint_USMA. Nicholas has been a pillar of the community and I'm proud to recognize his dedication to service and his academic accomplishment. https://t.co/3yMxm5EvJ4","date":"Thu Jun 02 13:30:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Great Job keeping the kids safe!","date":"Thu Jun 02 02:55:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This #WorldMilkDay, I'm recognizing Scott Bros Dairy in @CityofChinoGov and Drake Family Farms in @CityofOntario for many years as members of our community. https://t.co/ik1Rr4EvxX","date":"Thu Jun 02 00:26:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".@CityofMontclair and the @MontclairCavs Army Junior ROTC led a Memorial Day Ceremony honoring six veterans who passed away and are now memorialized on the Veteran’s Memorial Wall. May they and all those who sacrificed their lives in service to our country Rest In Peace. https://t.co/rqkX9P5L0V","date":"Wed Jun 01 13:26:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is not normal. We will not allow this to become normal. It’s time for action.","date":"Tue May 31 20:40:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This #MemorialDay, I'm thinking of Army Specialist Enrique Roman-Martinez, who disappeared and died two years ago this weekend. We will always honor and remember Enrique, and continue to seek justice for his family. https://t.co/EDbNVcYnmP","date":"Tue May 31 01:58:12 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today I joined @CityofOntario, @CityofChinoGov, and @CityofPomona, for their Memorial Day ceremonies honoring our fallen servicemen and women. Thank you to all who joined us to commemorate those who made the greatest sacrifice for our country. https://t.co/oiGfg2Mjan","date":"Mon May 30 21:41:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Stop deflecting on the fact that two AR-15’s were sold to a mentally unstable 18 year old. Who allowed this to happen? The Texas legislature &amp; their dumb-ass governor! Not to mention 50 GOP US Senators &amp; 2 Democrats #AbbottFailedTexasAgain #AbbottCruzMassacre #EndTheFilibuster","date":"Fri May 27 23:19:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"No words! 😭","date":"Fri May 27 21:32:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".What happens to your “human rights when you are dead and buried?” This is such a stupid tone death attempt to pivot. 👇🏼 we cannot forgive the fact that 19 children and their teachers were murdered while in school with a weapon of war.","date":"Fri May 27 21:22:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@RepSchneider This legislation is a step toward protecting our communities from senseless attacks on children in schools and people in church or out shopping. \n\nGun violence is the leading cause of death among children – it's time for change. We owe it to every family in America.","date":"Fri May 27 20:52:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On Tuesday we lost 21 lives to horrific violence. Rather than sending thoughts &amp; prayers, I’m listening to the majority of Americans who are tired of waiting for change. Today, I am reintroducing the Multiple Firearm Sales Reporting Modernization Act. https://t.co/1bVCSBq3dD https://t.co/KHG6WaV5R2","date":"Fri May 27 20:50:53 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Days after 21 people were slaughtered in an elementary school, Republicans are still attending the NRA conference in Texas. And get this, guns are banned in the conference. They are okay with AR-15s at schools, but not at their events.","date":"Fri May 27 17:45:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Republicans are too cowardly to even DEBATE protecting Americans from gun violence and domestic terrorism. Despicable.","date":"Fri May 27 15:59:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"History repeating itself over &amp; over again. Call your U.S. Senators (202) 224-3121 &amp; demand action. #EndTheFilibuster #SensibleGunLaws #50 Republican &amp; #2Democrats are blocking the vote. https://t.co/5BhGAA451q","date":"Fri May 27 03:26:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".@SenateDems 👇🏻","date":"Thu May 26 21:55:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Children are affected by violence in schools, even if they don’t directly experience it. Here are some resources to help parents and educators communicate with children about violence. https://t.co/3oI3koCVg1","date":"Thu May 26 13:54:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Since 2020, gun violence is the leading cause of death among children and teenagers. When car crashes were the leading cause of death to children, we changed the laws. We made cars and driving safer. Now it’s time to act on #gunviolenceprevention.","date":"Wed May 25 20:53:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Call (202) 224-3121 to be connected to your Senator to express your concerns and urge them to pass the Bipartisan Background Checks Act and the Enhanced Background Checks Act.","date":"Wed May 25 16:52:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"There are no words to describe what these families are going through right now. What are we doing if we cannot even protect our children. The Senate must take action before more of our children are taken away by guns designed for war.","date":"Wed May 25 16:52:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Llame a (202) 224-3121 para conectarse con su Senador para expresar sus inquietudes e instarlos a aprobar la Ley de Verificación de Antecedentes Bipartidista y la Ley de Verificación de Antecedentes Mejorada.","date":"Wed May 25 16:50:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"No hay palabras para describir lo que estas familias están pasando en este momento. Qué estamos haciendo si ni siquiera podemos proteger a nuestros hijos? El Senado debe tomar medidas antes de que más de nuestros niños sean arrebatados con armas diseñadas para la guerra. https://t.co/dH9XNQIYCn","date":"Wed May 25 16:49:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is gut wrenching. My heart is broken for the parents who have lost their children to yet another senseless act of violence. Call (202) 224-3121 to be connected to your Senator’s office and demand the Senate pass gun reform legislation.","date":"Tue May 24 22:09:07 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".@CoveredCA is holding a special enrollment period allowing consumers to enroll in or make changes to their health insurance plan. Read more about their eligibility requirements and check if you qualify at https://t.co/xoOarbYUdJ","date":"Tue May 24 20:05:16 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"California will continue to be a safe state for women, and we will continue to ardently defend the right to choose for all women across our country. https://t.co/L0i1bFIxeF","date":"Tue May 24 17:45:16 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The expansion of the Child Tax Credit lifted millions of children out of poverty around the country. It should have never expired. We need to restore this crucial benefit for our families. https://t.co/tEE8mtqDg3","date":"Tue May 24 01:21:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our health care workers have been heroes throughout this pandemic and are heroes every day. Addressing burnout will ensure our health care workers can thrive, and keep us all safer and healthier.","date":"Mon May 23 20:51:20 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Proud to announce that @CalPolyPomona has received nearly $300K from @NSF for a program that aims to help address fresh-water scarcity through research of dynamic membrane processes, a widely-used desalination technique. https://t.co/i0SI9D6qNl","date":"Mon May 23 14:49:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My thoughts are with the victims, their families, and the San Bernardino community. I’m grateful to all the first responders, and will continue to stay in touch with local officials as we get more updates on this situation. https://t.co/G0rMcmU6Qj","date":"Sat May 21 18:35:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We are ensuring the Ukrainian people have the necessary equipment to continue defending themselves from Russia. I’m proud to stand with Ukraine.","date":"Sat May 21 00:52:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"By investing in electric and low emission buses, our students in the Inland Empire will have more reliable transportation to and from school while breathing cleaner air. The Bipartisan Infrastructure Law impacts even our youngest learners! 🚌","date":"Fri May 20 18:15:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This week, I voted for a bill that will address the infant formula shortage because no parent should go to the grocery store and see empty shelves for formula. For tips on finding available baby formula, visit https://t.co/vAm4nkLQWQ!","date":"Fri May 20 16:09:12 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Antisemitism is on the rise in our country. I voted for the measure because no one deserves to be assaulted or attacked just for being Jewish.","date":"Thu May 19 20:43:56 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thanks to the leadership of President Biden and @HouseDemocrats, our economy has seen record-breaking job growth throughout the pandemic. Our plan lowers costs, lowers the deficit, and asks corporations to pay their fair share. #BidenEconomy","date":"Thu May 19 17:58:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Republicans are “pro-life” until it’s time to assist our moms and babies. From voting against Child Tax Credit expansion to voting no on emergency funding to address the baby formula shortage, they repeatedly show they are not 'pro-life.'","date":"Thu May 19 16:33:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Since the start of Russia’s invasion of Ukraine, oil companies have abruptly increased prices impacting consumers nationwide. Today, the House sends them a clear message — we will crack down on price gouging. I will vote for the Consumer Fuel Price Gouging Prevention Act. ⛽️","date":"Thu May 19 15:23:03 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This year, we had more than 80 community project funding applications submitted. With the input of my constituents, 15 projects were selected. Together we will make our communities safer and stronger. Take a closer look at the projects selected: https://t.co/5p0Bd8ngHd","date":"Thu May 19 14:24:18 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Thank you @GavinNewsom, #California is always ready to help our neighbors. #NMFire","date":"Thu May 19 01:12:35 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is historic! No matter the sport, our women athletes deserve to be paid equally to their male counterparts. Sports belong to all, and so does equal pay.","date":"Thu May 19 00:15:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The United States welcomes Sweden and Finland to North Atlantic Treaty Organization, @NATO. This step is making it clear to President Putin we are standing strong for Ukraine and its bordering countries.","date":"Wed May 18 23:03:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Celebrating the 25th Anniversary of @NewDemCoalition with my colleagues, we will continue to work together to deliver on policies that improve American lives. New Dems get stuff done! https://t.co/7JYmwkbwbE","date":"Wed May 18 21:32:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today I will vote for the Domestic Terrorism Prevention Act of 2022 because domestic terrorism has no home in our country. This legislation will ensure our law enforcement has the necessary tools, training and resources to combat this rising issue.","date":"Wed May 18 20:12:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I support getting rid of the Hyde Amendment, which impacts this story. However, the State Department still can do much more regarding reproductive health care for those who dedicate their careers to public service with the Department.","date":"Wed May 18 17:07:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is horrific and incredibly alarming. Our American diplomats should be provided the same reproductive health services readily available here in the United States, no matter where they are abroad. https://t.co/4uR1TIZxXW","date":"Wed May 18 17:06:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s a pleasure to welcome and meet with the National Association of Development Companies. Certified Development Company has had a tremendous impact on California’s small businesses, economic development, and job creation. https://t.co/r5A8qwDDcf","date":"Wed May 18 16:00:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"#NationalTransportationWeek is a great time to apply for @USDOT's Safe Streets and Roads Grant. This program provides funding to projects that will help prevent roadway deaths and serious injuries, including pedestrian incidents. https://t.co/MZ9zhD4ps3","date":"Wed May 18 01:17:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Si tiene problemas para encontrar fórmula infantil debido a la escasez actual, estos recursos de @HHSgov pueden ayudarle. https://t.co/3VzlM2XkL2","date":"Tue May 17 20:42:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"If you are having trouble finding infant formula due to the current shortage, these resources from @HHSgov may help. https://t.co/3VzlM2XkL2","date":"Tue May 17 20:41:38 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s a pleasure to meet with local @UAW leaders to talk about how Congress is lowering inflation, addressing consumer price gouging, and investing in our auto and manufacturing workers. https://t.co/FRlfmYaWb7","date":"Tue May 17 16:58:04 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today, I express my commitment to fighting homophobia, transphobia, and biphobia in our country. We must work tirelessly for a more inclusive and welcoming America. There is no place for discrimination toward LGBTQ+ youth and people.","date":"Tue May 17 15:08:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"In Southern California, we feel the rising costs of housing acutely. I look forward to continue to work with the Biden Administration to tackle this issue, and help expand access to quality, affordable housing for all. Everyone deserves a home 🏡 https://t.co/JFGPwHssgJ","date":"Mon May 16 21:53:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m back in Washington this week with my colleagues to address the ongoing formula shortage caused by the recall. We must take steps to address this crisis now for the health and well-being of our families.","date":"Mon May 16 20:55:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am heartbroken for the victims and the families affected by the horrific hate crime in Buffalo that cut 10 lives short. In order to eradicate this violence, we must acknowledge it for what it is - blatant domestic terrorism. https://t.co/MZRx2XslKE","date":"Mon May 16 20:27:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is a horrific attack, and it would have been much worse if it weren’t for the bravery and heroism of the people in the church. My prayers are with the victims and all those affected. https://t.co/pb2ika4bh6","date":"Mon May 16 19:54:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Be in the lookout! The California Mortgage Relief Program will soon expand to include assistance with past due property taxes for all eligible homeowners. Be notified when applications open at https://t.co/J69xRGXXwG.","date":"Mon May 16 13:58:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Everyone — no matter where you live or how much money you make — deserves access to essential health care, including abortion care, free of barriers or political roadblocks.\n \nNo vamos a permitir que una Corte Suprema conservadora y Republicanos criminalicen la atención médica. https://t.co/F07RRgmUmY","date":"Sun May 15 15:14:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to Carolina Gonzalez Ceja from Bloomington, who won this year’s #CA35 Congressional Art Competition with her work “It’s the mirror that stings.” This piece will be on display in the U.S. Capitol for the next year! https://t.co/P1TE9gmtcd","date":"Sat May 14 15:00:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Judiciary employees should have the same civil rights as other federal employees, and should be guaranteed a safe workplace free of harassment. I asked Judge Roslynn Mauskopf how the federal courts are protecting their employees. https://t.co/KTj5Rr3HQ3","date":"Fri May 13 21:11:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is an excellent step by President Biden to make our communities safer! $10 million from the American Rescue Plan has been committed to help counteract crime, prevent police layoffs, and grow police academies, among other things. #NationalPoliceWeek https://t.co/YVTTU3WLmI","date":"Fri May 13 19:02:41 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".@SBCounty hosted a hiring and expungement event to bring employment and record-clearing resources to the community. Thanks to all who made this event possible! https://t.co/T5oQtVLqCw","date":"Fri May 13 15:53:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I joined my colleagues for a moment of silence to remember the 1 million Americans we have lost to the #COVID19 pandemic. 1 million lives have been tragically cut short, and countless more are left to grieve their loss. https://t.co/lpdMVeRUZf","date":"Fri May 13 13:27:19 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Dr. Huu Vo has dedicated years of his life to supporting our community as a leader of the Vietnamese Community of Pomona Valley. Yesterday, he organized the 47th Commemoration Fall of Saigon at Hoa Binh Holt Plaza. Thank you for your leadership, Dr. Vo! https://t.co/QOwqqNgasF","date":"Thu May 12 23:38:53 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The @January6thCmte has been working incredibly hard to find out the facts about what happened on January 6th. Today, they took an additional step to hold people accountable for the insurrection by subpoenaing members of Congress who may know those facts.","date":"Thu May 12 19:21:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"A couple of months ago I met with federal wildland firefighters who described the fatigue and smoke inhalation issues they experience on the job, and felt like the federal government didn’t do enough to help them. This bill will right that wrong.","date":"Thu May 12 16:15:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I included two amendments in the Federal Firefighters Fairness Act to guarantee health protections for Federal Firefighters who face work-related health risks due to exposure. https://t.co/EHrqJHAF08","date":"Thu May 12 16:15:08 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today marks the start of #NationalPoliceWeek, during which we remember those officers who lost their lives in the line of duty. We thank them for their bravery, and honor their sacrifice by continuing to support law enforcement as they protect our communities. https://t.co/YLLpQdk2bE","date":"Wed May 11 23:24:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Droughts in Southern California threaten the ability to develop new, affordable housing due to lack of reasonable water supply. Today I asked @SecFudge how @HUDgov is working to coordinate expanding water access with affordable housing needs. https://t.co/6FRAvF89GP","date":"Wed May 11 22:05:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last night, I voted for @RepAndyLevin’s resolution granting congressional staff the right to unionize. As a former union member myself, I know first-hand the importance of the right to organize.","date":"Wed May 11 21:34:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Low-income communities often miss out on federal funding, including crucial transportation investments that can help people access affordable housing &amp; good jobs. I asked @SecretaryPete how @USDOT is ensuring infrastructure funding reaches historically-overlooked communities. https://t.co/rJkT6AcHZ2","date":"Wed May 11 16:31:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Reminder: @fema may be able to help you cover the cost of a COVID-19 funeral, up to $9,000. To learn more about the program, including eligibility requirements and how to apply, see https://t.co/4o6wMUtVWs","date":"Wed May 11 14:37:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"#InlandEmpire residents often have to commute long hours to work and lack good public transit options. I asked @SecretaryPete how we can expand transit-oriented development and work with state and local governments to increase reliable transportation. https://t.co/tNTylWynZ9","date":"Wed May 11 13:28:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to all the National Latina Business Women Association-IE LEILA award nominees who have demonstrated entrepreneurial leadership and great service to their communities. https://t.co/cFi0aEewQf","date":"Wed May 11 00:13:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"ICYMI: The economy added 428,000 jobs in April, bringing the total number of jobs created since President Biden took office to 8.3 MILLION. Americans are getting back to work in record numbers!","date":"Tue May 10 21:40:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Proud to announce that @FontanaUnified has been awarded $40,000 for @AmeriCorpsVISTA programs in our community. Learn more about the award and good work being done by AmeriCorps VISTA: https://t.co/AvkNwu8aBi","date":"Tue May 10 20:28:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is fantastic news! This $40 million in federal funding announced by the Department of Justice will be critical for public safety and community policing. This is how we keep our communities safe!","date":"Tue May 10 18:46:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"From health care to education, access to high-speed, reliable internet at home is crucial in so many aspects of daily life. This will impact nearly 40% of American households - Thank you President Biden for lowering costs to support families. https://t.co/1liegro3MS","date":"Tue May 10 17:20:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am always working to secure federal funding for #InlandEmpire infrastructure - including roads, bridges, and airports. Tune in to today's @AppropsDems hearing with @SecretaryPete at 1 PM ET, where I will discuss #CA35's infrastructure priorities. https://t.co/ansqhO2MqI","date":"Tue May 10 16:02:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Les deseo un #FelizDiaDeLasMadres a todas las mamis celebrando hoy. 💐 https://t.co/V1XsxRuN5z","date":"Tue May 10 14:19:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".it’s going to take a lot of convincing for me to vote for this.","date":"Tue May 10 02:24:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is a great step forward! Immigrants with STEM degrees are a strong asset to our country and workforce, so are our immigrants on DACA. https://t.co/UFQO7ivolL","date":"Mon May 09 21:16:37 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"As the costs of a traditional 4-year degree continue to rise, I am working to ensure Californians have access to other opportunities through apprenticeships and workforce training programs like @intech_center. https://t.co/2fmoexdUKH","date":"Mon May 09 20:33:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".I can’t wait to taste them!","date":"Mon May 09 20:06:28 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On Mother’s Day, our First Lady met with Ukraine’s First Lady to demonstrate America’s support for the people of Ukraine. Thank you, @FLOTUS! https://t.co/ZyJd04dI2z","date":"Mon May 09 19:14:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@CityofOntario Únase a nosotros el 12 de mayo para un evento de contratación y limpieza de registros en @CityofOntario. Esta es una gran oportunidad para cualquier persona que quiere comenzar el proceso de eliminación de antecedentes penales o que busca nuevas oportunidades profesionales. https://t.co/TqdoForuOU","date":"Mon May 09 18:44:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to @chaffeycollege for breaking ground on their new @CityofChinoGov campus! Thanks in large part to Measure P bonds, students will get access to upgraded classrooms, labs, and technology. https://t.co/tWtxqOhfPX","date":"Mon May 09 17:26:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"JOB-SEEKERS: Join us on May 12 for a hiring and record-clearing event in @CityofOntario. This is a great opportunity for anyone looking to begin the expungement process or seeking new career opportunities. https://t.co/uVxl5ChUnD https://t.co/aTqFHtKpvG","date":"Mon May 09 15:28:38 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Some Mother’s Days are extra special. In 2015, I had the honor of visiting military moms in Afghanistan. I will never forget this visit. Happy #MothersDay to all moms - and a special thanks to our moms in uniform. https://t.co/INPNYHOLVc","date":"Sun May 08 18:11:20 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The last few years have shown how crucial nurses are and how hard they work to keep us healthy. Thank you to all our nurses for your dedication and sacrifice that often don’t get the appreciation they deserve. #NationalNursesDay","date":"Fri May 06 22:21:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Representation matters: @KJP46 will be the first Black woman and the first openly LGBTQ+ person to serve as White House Press Secretary. Congratulations Karine! https://t.co/fjyuzwT1C1","date":"Fri May 06 20:39:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"As we wrap up #WildfirePreparednessWeek, remember – you can’t be overly prepared for wildfires. Get more resources for wildfire prevention and preparedness at https://t.co/gnoAmWGCxw https://t.co/K9EKU7es3O","date":"Fri May 06 20:14:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last year, we received 522,000 new business applications in California! Small businesses create jobs, bolster our economy, and spur innovation. #SmallBusinessBoom https://t.co/yGYot5dbbu","date":"Fri May 06 17:42:56 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to Fontana native Christian Torres for his accomplishments as a professional soccer player and a trailblazer in sports – in 2020, Torres became the youngest player to start in an @MLS game! https://t.co/jbatJqGmul","date":"Fri May 06 15:57:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Southern Californians are experiencing the consequences of the climate crisis firsthand with unprecedented water restrictions. We must continue to take emergency steps to preserve water levels, our day-to-day lives depend on it. https://t.co/53rJRRFB76","date":"Fri May 06 14:21:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today, we celebrate Cinco de Mayo, the day the Mexican army won against France at the Battle of Puebla. The Mexican population have contributed so much to the fabric of our country, and we take today to honor their diverse culture and heritage.","date":"Thu May 05 20:28:44 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"A lack of accurate and comprehensive data on #MMIW keeps Native women invisible. Savanna’s Act will help bring these cases to light, help law enforcement seek justice for victims, and prevent future crimes.","date":"Thu May 05 19:11:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today is the National Day of Awareness for Missing and Murdered Indigenous Women &amp; Girls. I introduced Savanna’s Act to improve data collection &amp; train law enforcement agencies to respond effectively to these cases, because we must do more to address this violence. #MMIW","date":"Thu May 05 19:10:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our country is safer when we combat disinformation online. This is not a partisan issue – it’s a matter of safety and national security. https://t.co/pVUSnrvxp4","date":"Thu May 05 17:01:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"With wildfire season growing each year, it’s important to have a plan in place to protect your family. Below are wildfire prevention and preparedness tips to keep your family, community, and home safe. #WildfirePreparednessWeek https://t.co/nOiX0ZbMyb","date":"Thu May 05 15:27:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I joined @SiemensUSA CEO Barbara Humpton to tour the company’s new greenfield manufacturing site in @CityofPomona. Siemens’ investment will create good-paying, union jobs, all while developing crucial components to help expand our green economy. https://t.co/XBkDFC08GW https://t.co/5SubV91EvP","date":"Thu May 05 14:00:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"GREAT NEWS! For the first time in six years, the government can pay down the national debt this quarter. Thanks to President Biden’s leadership, strong jobs growth is allowing us to have a strong economic recovery! https://t.co/StjV7YT0Zk","date":"Thu May 05 13:22:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am proud of the steps Governor @GavinNewsom has taken to enshrine the fundamental right for women to choose what is best for their own bodies and health in California. Our state is and will continue to be a haven for women. https://t.co/MVt0hr5kiW","date":"Thu May 05 03:15:51 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was an honor to join @CalPolyPomona’s veteran graduation ceremony as the keynote speaker. Congratulations to the class of 2022 - we thank you for your service to our country, and look forward to all you will continue to achieve! https://t.co/4Bc9bUHnm1","date":"Wed May 04 22:38:16 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"IBEW workers have strengthened our workforce by empowering young adults and single parents to participate in apprenticeship programs to change their lives. Grateful to workers with IBEW Local 477 who have made our communities stronger and helped secure more jobs! https://t.co/T20qge1bqI","date":"Wed May 04 19:31:18 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I secured $2 million in federal funds to help Saratoga Park update their heavily used recreation facility. The funding will also address ADA compliance needs to better serve @CityofMontclair residents. Looking forward to seeing the completed upgrades! https://t.co/gfjQYGgCp0","date":"Wed May 04 13:36:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our teachers empower and inspire the next generation of leaders through their creativity and guidance in and out of the classroom. During #TeacherAppreciationWeek, take a moment to thank a teacher! https://t.co/6bbcyEii0E","date":"Tue May 03 20:58:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #InlandEmpire is home to hundreds of ironworkers who help build and maintain our communities. I had the pleasure of touring the University of Iron in Fontana and meeting with their leadership to learn more about their great work. https://t.co/uq6VI9M9iz","date":"Tue May 03 17:29:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Lavrov’s comments are disgusting and inexcusable. We must unequivocally condemn hateful, anti-Semitic rhetoric, especially coming from world leaders.","date":"Tue May 03 15:56:13 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We can no longer afford to wait to pass federal legislation protecting a woman’s right to choose. The Senate must act now.","date":"Tue May 03 02:39:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Prosecutors and judges who investigate corrupt officials in Guatemala are often forced to flee their homeland. That’s why anti-corruption efforts are important – we must hold those in power accountable and not be threatened for doing so. https://t.co/IS7DQqZ5Xr","date":"Tue May 03 00:49:18 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Every year, wildfire season in California increases in length and frequency of fires. This #WildfirePreparednessWeek, take the time to ensure you know how to prevent and protect yourself and your home from a fire. https://t.co/FnN4W8TQw9","date":"Mon May 02 23:15:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The @CityofMontclair celebrated Arbor Day last week by planting mango, apple, and pear trees! Montclair is now officially a member of Tree City USA. 🌳💚 https://t.co/uvTIIgRM2k","date":"Mon May 02 22:35:28 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Eid Mubarak to all those celebrating in the #InlandEmpire and around the world! Wishing you joyful and safe festivities.","date":"Mon May 02 21:34:37 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Democrats are committed to addressing price gouging by oil companies. We can’t allow corporations to line their pockets at the expense of American consumers, especially as we continue to navigate the pandemic and Putin’s invasion of Russia. https://t.co/UVkTjuzG1t","date":"Mon May 02 13:56:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Throughout the month of May, we honor the contributions that Jewish Americans provide to the fabric of our diverse country. This #JAHM2022, let’s remain committed to combatting antisemitism across the country and the world.","date":"Mon May 02 02:03:03 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Important safety information shared at last night's Northeast Commander Meeting in @CityofPomona regarding human trafficking, homelessness, and code enforcement. https://t.co/nu00ppSkAH","date":"Fri Apr 29 19:19:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last night @chaffeycollege celebrated impressive honorees at their Alumni of the Year dinner. It's great to see Chaffey students and alumni doing big things in the #InlandEmpire and beyond. https://t.co/NsZ7viuSKb","date":"Fri Apr 29 16:39:08 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I asked @SecBlinken what measures the U.S. is taking to combat corrupt actors in Central America and help address the root causes of migration. @AppropsDems https://t.co/SupaRBlKns","date":"Fri Apr 29 13:35:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"So far, we have created more than 6.6 MILLION jobs during President Biden’s first year in office, the greatest single year of job creation in American history. We are #BuildingABetterAmerica.","date":"Thu Apr 28 20:14:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I wrote a letter to @USTreasury Secretary Yellen asking the Office of Foreign Assets Control to use stronger tools to uphold the rule of law and prevent corruption and human rights abuses in Guatemala. https://t.co/jNyklxuv7o","date":"Thu Apr 28 17:57:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was a pleasure to meet with members of @CSBA_Now from Rancho Cucamonga, Fontana, &amp; Rialto to talk about special education, student nutrition, broadband, &amp; mental health resources in our schools. https://t.co/wFHJISCfol","date":"Thu Apr 28 14:52:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Small Business Development Centers help create jobs and strengthen our local economies. I voted for the #SBDC Improvement Act this week to broaden services and create good jobs in California.","date":"Thu Apr 28 13:19:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Secretary Albright’s work made our country safer &amp; more welcoming to immigrants &amp; refugees who came here – often when they had nowhere else to turn. Today we celebrate her legacy, which will continue to shape America &amp; the world for generations to come. https://t.co/IuHYc0liMW https://t.co/51P1mRQ8Kg","date":"Wed Apr 27 21:22:20 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My team joined @GO_cvb for their quarterly report luncheon. It was great hear from some of those most invested in our community, and learn about exciting things to come for the city. https://t.co/pZZP1B2fUg","date":"Wed Apr 27 20:44:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"April is #FinancialLiteracyMonth. If you have money questions, Ask @CFPB is a great online educational tool. Since 2012, the Ask #CFPB portal has responded to more than 33 million visitors.💵📖 https://t.co/ueafJfb1od","date":"Wed Apr 27 18:35:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On Yom HaShoah, Holocaust Remembrance Day, we remember and mourn the six million Jews murdered by Nazis during the Holocaust. Today, as anti-Semitism is on the rise, we recommit to creating a nation &amp; world where all people are treated with respect &amp; can live in peace.","date":"Wed Apr 27 17:44:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s great to see the United States and our allies working together to stand with Ukraine. We are all stronger when united.","date":"Wed Apr 27 13:15:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Voting is now underway for my 2022 Congressional Art Competition! Vote for your favorite artwork by \"liking\" the photo on Facebook. The winning entry will be displayed in the U.S. Capitol for the next year. Voting ends 4/29 at 5 PM PT. https://t.co/fDx4sleB97","date":"Tue Apr 26 21:14:51 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Wishing @VP Harris a speedy recovery, and hoping she remains symptom-free. https://t.co/tnCHRp2wlm","date":"Tue Apr 26 19:47:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am amazed at all the parents from the Ontario-Montclair Unified School District’s Parent Class of 2022 who worked incredibly hard to earn their GEDs this weekend. Congratulations to all! https://t.co/Ly9ZhZrOIk","date":"Tue Apr 26 00:00:03 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to the new graduates of Chaffe High School’s Navy JROTC SNSI. Wishing you all the best in your continued service to our country! https://t.co/RjviYms1IN","date":"Mon Apr 25 21:03:44 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m happy to have secured $2.5 million in federal funding to help get this project off the ground!","date":"Mon Apr 25 19:06:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Proud to have joined @calpolypomona for the unveiling of their Liquid Rocket Lab, which will provide hands-on education, cultivate the leading scientists and engineers of tomorrow, and open doors for students who otherwise might not consider careers in STEM. 🚀 https://t.co/Ds1sQvvo6k","date":"Mon Apr 25 19:05:02 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Yesterday marked 107 years since the start of the Armenian Genocide. A genocide that stole the lives of 1.5 million Armenian men, women, and children. I honor the victims of this horrific event and mourn their loss.","date":"Mon Apr 25 17:56:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Democracy dodge another bullet today! 😅","date":"Sun Apr 24 19:50:52 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is the right thing to do. By protecting our workers, we protect our communities.\nhttps://t.co/s2yketGvBE","date":"Fri Apr 22 21:00:51 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Yesterday, the District Council of Ironworkers had its Annual Apprenticeship Competition. My team had the opportunity to meet and speak with many of them about their impact to our infrastructure and tour their program, which has helped many of our residents. https://t.co/kYdU6Jh1sA","date":"Fri Apr 22 20:02:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great news! SNAP beneficiaries will soon be able to enroll in Head Start. @HHSGov is making it easier for families already eligible for Head Start to enroll in the program by reducing the application burden. To learn more about Head Start, visit https://t.co/1qHok4Vqy4!","date":"Fri Apr 22 18:00:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was a pleasure to join @SecMartyWalsh, @SecGranholm, @RepLindaSanchez, and @RepJudyChu to highlight the importance of investing in people to start startups and small businesses that impact their communities. https://t.co/PBQYn14c8D","date":"Fri Apr 22 17:01:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This #EarthDay, we are reminded of our responsibility to protect our planet for the generations to come. I will continue to work with my House colleagues to create clean energy jobs, build resilient infrastructure, and invest in scientific research. 🌏 https://t.co/JJ7PsVqXRW","date":"Fri Apr 22 16:14:55 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today is an important day for democracy and human rights. My statement on the extradition of Juan Orlando Hernandez, the former president of Honduras: https://t.co/ezLXucmqJh","date":"Fri Apr 22 14:15:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hoy es un día importante para la democracia y los derechos humanos. Mi declaración sobre la extradición de Juan Orlando Hernandez, expresidente de Honduras: https://t.co/2oi4Zfd4Mo","date":"Fri Apr 22 14:14:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was great to have @SecMartyWalsh in #CA35 yesterday – thank you for the early birthday gift and wishes! https://t.co/ipe8LIOumt","date":"Thu Apr 21 21:00:55 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Muchas gracias a todos estos valientes que participan en la “Operación Liberación” el pueblo Hondureño merece una República que realmente trabaje para ellos. #CoConspirator4","date":"Thu Apr 21 18:46:18 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Warehouse workers are critical to keeping our economy up and running smoothly. I’m committed to ensuring there are protections in place to guarantee these essential workers fair and safe conditions and pay.","date":"Thu Apr 21 18:01:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the @CapitolPolice for their swift action yesterday and their steadfast commitment to keeping the Capitol Hill community safe.","date":"Thu Apr 21 16:26:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"By partnering with educators, industry, and local leaders, the @intech_center has been instrumental in developing the next generation of American workers in critical sectors like automation, robotics, electricity, and mechanics.","date":"Thu Apr 21 00:26:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"California is home to 28 beautiful National Parks that bring in millions of visitors year-round. This #NationalParkWeek, visit https://t.co/efRrXeXHhf to #FindYourPark and get outside! 🌵☀️ @JoshuaTreeNPS https://t.co/WzKPHOuLLm","date":"Wed Apr 20 20:11:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Welcome to Southern California, @SecMartyWalsh. It’s an honor to have you visit the Inland Empire! ☀️ https://t.co/iS5aGhe7Pi","date":"Wed Apr 20 18:53:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@California_HCD @HUDgov Homelessness and affordable housing remain a great challenge in the #InlandEmpire and all over California. With this investment, we are one step closer to ensuring all our residents have a place to live, and I thank everyone working together toward that goal.","date":"Tue Apr 19 21:45:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m proud to announce that @California_HCD will receive $1.5M+ from @HUDgov to address homelessness in Los Angeles and San Bernardino through rapid rehousing assistance, emergency shelters, homelessness prevention, and outreach services. https://t.co/b6xNP1lbu9","date":"Tue Apr 19 21:42:20 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Welcome back to Pomona City Council, staff, and community - last night was the first in-person meeting since the start of the pandemic, and it was great to reconnect with everyone. https://t.co/QMMXHwaicu","date":"Tue Apr 19 20:00:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"54 years ago, President Johnson signed the #FairHousingAct — and much work remains to make housing more equitable and accessible for all. I will continue to fight for fair and affordable housing, because everyone deserves a safe home. #FairHousingMonth 🏡","date":"Tue Apr 19 18:06:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is tragic and preventable. We must address the root causes of migration – violence, corruption, and poverty – so people can have a safe and prosperous future in their home countries, and don't feel compelled to make the dangerous journey to the U.S. https://t.co/3wMbq9G219","date":"Tue Apr 19 16:50:18 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to the award recipients of the San Bernardino Valley Young Marines in @CityofRialto! We are proud of you and see future cadets of our U.S. Service Academies in your award-winning program. https://t.co/ZPaV7Zskd8","date":"Tue Apr 19 16:20:13 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"A great afternoon with City of Chino Hills elected officials, city manager, and leadership team. I had an opportunity to hear about some of the upcoming projects and learn more about the community. https://t.co/ohDZ4PvgLx","date":"Tue Apr 19 14:56:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you City Manager Blay for providing your list of concerns and priorities for the City of Upland. I'm looking forward to finding solutions and pathways to partner together at the federal level. https://t.co/EBrSsW0PCC","date":"Tue Apr 19 03:00:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was great to connect with President Soraya M. Coley of @calpolypomona to talk about how we can partner together to address the needs of our students. https://t.co/z3mnvl8R79","date":"Mon Apr 18 20:34:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"According to our survey results, the top three priorities for our community are housing, public safety, and healthcare. I look forward to securing federal funding for programs that address these needs and more.","date":"Mon Apr 18 19:29:07 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We received 78 community project funding applications this year! I wanted to hear from you about how we should prioritize these investments in #CA35, and got some great feedback - thanks to everyone who participated. https://t.co/kxkFMpRkkH","date":"Mon Apr 18 19:28:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"🚨 Today is the deadline to file your 2021 taxes. Avoid a late fee and submit today! #TaxDay2022","date":"Mon Apr 18 18:25:04 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I joined the @PomonaChamberC and @WesternUNews for a State Legislative Luncheon to provide updates on federal funding and hear about priorities within the local business community. https://t.co/04LL1W96AN","date":"Mon Apr 18 17:22:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Happy #Easter! Today we celebrate a renewed sense of hope and peace. I hope everyone gets to spend time safely today with family and loved ones.","date":"Sun Apr 17 22:54:12 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This toolkit from @NHTSAgov provides Emergency Communications Centers with guidance to help achieve reclassification for 911 dispatchers. A great resource this National Public Safety Telecommunicators Week! 📞 #NPSTW https://t.co/EI4qPIs9I7","date":"Sat Apr 16 02:03:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the Dawoodi Bohras of Orange County and the Inland Empire for inviting us to join your iftar. More than 120 people from the congregation gathered to share dinner together. https://t.co/1rf8I3aAkp","date":"Sat Apr 16 00:48:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This #Passover, let us remember the importance of working together to overcome adversity. #ChagSameach to all those celebrating in #CA35 and around the world.","date":"Fri Apr 15 22:46:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Being sanctioned by Russia is a badge of honor. I am proud to stand with Ukraine and against Putin’s ruthless war. https://t.co/6Kv3Lk7kM7","date":"Fri Apr 15 22:16:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Supreme Court Justices Sandra Day O’Connor and Ruth Bader Ginsburg were both trailblazers who inspired countless women and girls across the country to work hard and make a difference. I look forward to seeing these statues in the Capitol!","date":"Fri Apr 15 14:42:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Stopped by Molly’s Souper to meet with Upland Unified School District Trustee Sherman Garnett and Superintendent Dr. Lynn Carmen Day. They recently added a full-day Kindergarten to help enroll more students! ✏️ https://t.co/lW2IQdNerM","date":"Fri Apr 15 13:12:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"A jolt of delight to have a cup of coffee with Councilwoman Janice Elliott of Upland.☕️ We were able to discuss our shared passion for public service and what the city's priorities are. https://t.co/byG2eACRza","date":"Fri Apr 15 00:07:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was nice to visit the Park Vista Estates in Pomona. We heard from members of the team and provided PPE care packages for the park. https://t.co/Z20UJWXEoB","date":"Thu Apr 14 23:06:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I joined Upland resident and UPS driver Hassan to visit businesses who have donated PPE supplies and hygienic  products to fill for backpacks for foster care children. Thank you @UPS for helping give back. https://t.co/HFCH7JtFBh","date":"Thu Apr 14 21:54:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The work 911 dispatchers do often means the difference between life and death. \n \nThe #911SAVES Act recognizes the lifesaving work of our dispatchers. Our communities are safer because of their sacrifices and efforts. #NPSTW https://t.co/65JtJXQHgW","date":"Thu Apr 14 16:57:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It's was lovely catching up with Superintendent Ted Alejandre of @SBCounty schools to hear about how they have been able to use COVID relief funds to support students. Looking forward to wrapping up this school year on a high note. https://t.co/HUg60Kw0ih","date":"Thu Apr 14 14:14:02 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Coronavirus cases are up 23% in @CountyofLA. Public health officials recommend masking, getting tested, and getting vaccinated to prevent the spread of #COVID19. Find a testing site or vaccine clinic near you at  https://t.co/PYTdGyeoaz. https://t.co/DRO3K5kpzs","date":"Thu Apr 14 13:22:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I have flown in a Blackhawk military helicopter without a door but never in a truck with an open door. 👍🏼 https://t.co/pPyhs374tr","date":"Wed Apr 13 18:01:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"First day of work, I’m going to get fired because I’m late! ⁦@UPS⁩ #ADayInYourShoes https://t.co/Rchnya4mvx","date":"Wed Apr 13 15:41:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"God’s Pantry in @CityofPomona helps address food insecurity in the #InlandEmpire through robust food distribution efforts. To assist their efforts, we donated computer towers and a printer to help continue and grow their service to our community. https://t.co/lHoS16VOsx","date":"Wed Apr 13 13:44:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The 3rd International Day of Conscience was a great success. Thank you to the Tai Ji Men Qigong Academy and the Federation of World Peace and Love for being a positive force in our community and reminding everyone of the importance of conscience in our lives. https://t.co/e8Bf4KyjIL","date":"Tue Apr 12 20:46:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Transit-oriented development provides residents with more opportunities for good jobs, affordable housing, travel, &amp; entertainment. This @FTA_DOT funding will improve our neighborhoods, support small businesses, create jobs, &amp; expand access to transit.🚊https://t.co/aMTARwKkzs","date":"Tue Apr 12 19:31:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My team joined the Pomona Fraternal Order of Eagles #2215 for their Easter Celebration. President Janine and the organization are a great presence in our community, and we are proud to recognize them. https://t.co/iQVOhQ5nEt","date":"Tue Apr 12 18:14:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We appreciate listening to experts, however there’s a lot going on behind the scenes at the #911Center take us there! We want to see the unsung heroes working taking calls from victims, witnesses &amp; coordinating resources. #911SavesAct","date":"Tue Apr 12 15:31:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My prayers are with the people in #Brooklyn https://t.co/uafWxx3OkD","date":"Tue Apr 12 15:25:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Excited to see Overspray Art Supply and Gallery open in @CityofPomona. Many new artists will now have a place to exhibit their talents. Congratulations! https://t.co/oSxmtyIMdx","date":"Tue Apr 12 13:53:51 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Thanks for visiting my 911 center &amp; for recognizing these unsung heroes @JRosenworcel","date":"Tue Apr 12 00:30:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@APCOIntl @911LAPD That’s why I introduced #911SAVES to reclassify dispatchers from an administrative role to a protective service occupation – to recognize the nearly 100,000 professionals across America who answer emergency calls every single day. #NPSTW https://t.co/pcFTeJVkI4","date":"Mon Apr 11 20:55:18 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This week, I’m joining @APCOIntl in celebrating National Public Safety Telecommunicators Week! \n \nAs someone who answered calls for @911LAPD for 17+ years, I know that dispatchers are the unsung heroes of our emergency response system. #NPSTW https://t.co/G1QYM8PUz3","date":"Mon Apr 11 20:54:56 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@POTUS @ATFHQ I authored the Multiple Firearm Sales Reporting Modernization Act and co-sponsored the Ghost Guns are Guns Act in Congress because it’s long past time to enact commonsense gun safety legislation to help protect our communities from senseless violence. https://t.co/txSsnrmR5a","date":"Mon Apr 11 19:23:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thousands of untraceable and homemade ghost guns are confiscated every year across the country.\n\nI thank @POTUS for supporting law enforcement &amp; taking a strong step to keep our communities safe by issuing a final rule on untraceable ghost guns &amp; announcing a new @ATFHQ Director. https://t.co/Mo0g6G0SR8","date":"Mon Apr 11 18:43:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"If Bukele was serious about addressing corruption and gang violence, he wouldn’t have released four dangerous MS-13 leaders back into society. These men should be facing their day in court, not out free to continue terrorizing the citizens of El Salvador. https://t.co/ExJdslrKzN","date":"Mon Apr 11 15:50:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great news for the #InlandEmpire: $690M in @FTA_DOT funding is coming to the Los Angeles-San Bernardino region.\n \nThis funding will help modernize and expand transit services, and bring new jobs and economic development to the area.🚌 https://t.co/B1URLBwxkX","date":"Fri Apr 08 20:41:23 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"🍎🥦🛒 Several California retailers are participating in the new @USDANutrition SNAP Online Purchasing program. See a full list of grocers and learn how to use benefits online at https://t.co/I5DUbcM3vd.","date":"Fri Apr 08 16:59:44 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is the right course of action by the United Nations. I applaud the countries that voted yes in standing up to Putin and his dictatorship.","date":"Fri Apr 08 15:42:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last night @PomonaUnified celebrated Superintendent Richard Martinez to thank him for his 15 years of service in Pomona. Congratulations on your retirement Superintendent Martinez! https://t.co/GO7148uVCa","date":"Thu Apr 07 20:51:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations Justice Ketanji Brown Jackson. Your perseverance is an inspiration and our nation is fortunate to have your leadership.","date":"Thu Apr 07 18:38:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Inland Empire restaurants received more than $41 million from the Restaurant Revitalization Fund last year. I'm proud to vote to provide additional support to our local businesses as they continue to recover from the COVID-19 pandemic. #ReplenishRRF","date":"Thu Apr 07 16:31:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s exciting to see new resources and programs available for our children. The new @OMSD_omsd Wellness Art and Technology Center will serve as a haven for students to harbor their talents and be creative. https://t.co/LkzhsnSug3","date":"Thu Apr 07 13:27:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I just voted to hold Peter Navarro and Dan Scavino in contempt of Congress for refusing to comply with subpoenas issued by @January6thCmte. We must continue to seek out the truth about what happened on January 6th — our democracy depends on it.","date":"Wed Apr 06 23:32:51 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Many great businesses in the @CityofOntario were highlighted at last night’s Hispanic Chamber of Commerce installation. Congratulations to all the new officers! https://t.co/coWkRq8qFl","date":"Wed Apr 06 22:36:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The first of many congratulatory moments as we wish City Manager Matt Ballantyne from @CityofChinoGov the very best on his transition to the @CityofFontanaCA. We thank him for his 10 years of leadership and countless hours of volunteering. https://t.co/l52SDt8oM3","date":"Wed Apr 06 18:42:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I commend President Biden for this historic nomination, and thank Admiral Fagan for her continued service to our nation. Leaders with diverse perspectives and experiences are an asset to our national security. https://t.co/TRqXUrXApv","date":"Wed Apr 06 16:50:49 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My team was at the Groundbreaking Ceremony of the Village at Montclair, a transit-oriented development with affordable housing off the @Metrolink rail.  Congratulations to the @CityofMontclair for making progress to provide more accessible housing for our families. https://t.co/l1w0V5wlVg","date":"Wed Apr 06 13:15:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am glad to see that Judge Ketanji Brown Jackson has bipartisan support in the Senate. She is incredibly qualified, and I look forward to her making history as the first Black woman on the Supreme Court. https://t.co/v15bzrdu45","date":"Tue Apr 05 19:44:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Si se perdió nuestro telefónico de seguridad en el internet anoche, no se preocupe: mi sitio web tiene recursos para evitar estafas y mantener a su familia segura en línea. https://t.co/mZ0TULc6PO","date":"Tue Apr 05 18:41:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"If you missed our online safety telephone town hall last night, do not worry – my website has resources for avoiding scams and keeping your family safe online. https://t.co/vB8KtSvuS0","date":"Tue Apr 05 18:34:30 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was a great time at Healthy Family Day in @CityofChinoGov over the weekend! Chino is doing excellent work to ensure our families have resources to stay healthy and happy. https://t.co/JCvnYWjxoB","date":"Tue Apr 05 14:38:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@RepRickCrawford El Salvador is an independent democracy and we respect its right to self-govern, but the United States must have a plan in place to protect our financial systems from the risks of this decision.","date":"Tue Apr 05 01:09:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today, I introduced the Accountability for Cryptocurrency in El Salvador Act with @RepRickCrawford. El Salvador’s adoption of #Bitcoin is not a thoughtful embrace of innovation, but a careless gamble that is destabilizing the country. https://t.co/Ag9K8fyHMb https://t.co/4N8DN7895w","date":"Tue Apr 05 01:08:04 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Únase a mí ESTA NOCHE a las 7 PM para un telefónico para discutir estrategias y recursos para mantenerse seguro en el internet y evitar estafas. Regístrese y envíe preguntas a https://t.co/HNYsk95UMq","date":"Mon Apr 04 20:14:41 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Join me TONIGHT at 7 PM for a tele-town hall to discuss strategies and resources for staying safe online and avoiding scams. Register and submit questions at https://t.co/HNYsk95UMq. https://t.co/pQh9SgZEcj","date":"Mon Apr 04 20:12:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Nuestros miembros del servicio que no son ciudadanos sacrifican mucho en defensa de nuestro país. Deberíamos honrar su servicio eliminando las barreras a la naturalización.\nPara obtener asistencia legal a bajo costo, visite https://t.co/jNQjE2Vjsq. #NoSonOlvidados https://t.co/RFgVB9c31v","date":"Mon Apr 04 19:44:38 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our non-citizen service members sacrifice so much in defense of our country. We should honor their service by removing barriers to naturalization.\n\nFor low-cost legal assistance, visit https://t.co/jNQjE2Vjsq. #NoSonOlvidados https://t.co/NnMH0Cd7hZ","date":"Mon Apr 04 19:44:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is the right thing to do, thank you Ambassador Thomas-Greenfield.","date":"Mon Apr 04 17:36:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Happy Anniversary to my husband Louis, 35 years, 3 sons and 1 grandson. 🥂 https://t.co/8PSvuHdYGR","date":"Mon Apr 04 16:34:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My team stopped by Becy African Store in @CityofMontclair for their grand opening. Great food and great service, thank you for investing in our community! https://t.co/lEgiJyX4D3","date":"Mon Apr 04 13:30:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Another horrible incident of gun violence. Weapons that can kill/injure so many people instantly do not belong in the hands of civilians. 6 dead - 15 shot 😢🙏🏼🙏🏼","date":"Sun Apr 03 13:56:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"10% of adults in my district and 10.5% of Americans across the country are living with diabetes. No one should have to choose between paying for critical insulin and other basic necessities like food and rent.","date":"Sat Apr 02 16:24:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The skyrocketing cost of insulin means many Americans have had to cut back or skip doses - a potentially deadly risk. I voted for the #AffordableInsulinNowAct to cap the cost of this lifesaving drug at $35/month and send the message to big pharma that human life is not for sale. https://t.co/DS037wnAt8","date":"Sat Apr 02 16:22:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Ramadán Mubarak ☪️ to everyone observing this holy month. May Allah bless you with peace &amp; grace.","date":"Sat Apr 02 03:17:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My team visited the site of yesterday's explosion in Montclair. Our office is in contact with the city, the chief of police, and the San Bernardino County Hazmat Fire Dept. to offer support as they continue to investigate. https://t.co/knWoUzzGmJ","date":"Sat Apr 02 01:18:30 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thanks to @POTUS’ leadership and @HouseDemocrats’ commitment to working families, the U.S. added 431,000 jobs in March, and unemployment dropped to 3.6%. Our economic recovery is strong! https://t.co/WRBskhrzbj","date":"Sat Apr 02 00:35:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Please don’t dump dangerous weapons in the dumpster. Call your local police, they will help you discard it appropriately.","date":"Fri Apr 01 20:09:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Ahora debemos aprovechar esta oportunidad para reconocer la importancia de proteger a quienes llegan a nuestras fronteras en busca de refugio y abordar las causas profundas de la migración en Centroamérica. #Título42 https://t.co/YJdfTzNEAk https://t.co/cZw6YyWzLs","date":"Fri Apr 01 19:43:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We must use this opportunity to recognize the importance of protecting those who arrive at our borders seeking refuge, and addressing the root causes of migration in Central America. #Title42 https://t.co/YJdfTzNEAk https://t.co/pdnEr5UTi9","date":"Fri Apr 01 19:42:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"A big thank you to God’s Pantry for the work they do in our communities. In addition to food distribution, they offer at-risk youth services, housing, and job training. https://t.co/teUl6vUDv6","date":"Fri Apr 01 00:40:30 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This #TransDayOfVisibility, and every day, I’m committed to lifting the voices of our transgender neighbors and protecting their rights under the law. Their resilience is inspiring. #TransIsBeautiful","date":"Thu Mar 31 22:21:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My thoughts are with those injured in this accident. My team is monitoring the situation and is in touch with local authorities to assist those affected. https://t.co/yteqZ9WD9n","date":"Thu Mar 31 21:18:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"César Chávez was a civil rights leader and a champion for immigrant workers. His work inspired countless others after him, and remains critical today as we continue the fight for fair wages, safe working conditions, and dignity for all workers. #CésarChávezDay https://t.co/938xWxS0T9","date":"Thu Mar 31 18:54:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The @CityofMontclair hosted a birthday celebration yesterday for all seniors! Our team joined the festivities and dropped off birthday cards. https://t.co/ThQuWy1QAU","date":"Thu Mar 31 18:05:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@HousingIsKey FECHA LÍMITE: Hoy es el ÚLTIMO DÍA para solicitar asistencia para inquilinos a través de @housingiskey si ha sido afectado financieramente por #COVID19. Los inquilinos elegibles que hayan solicitado no pueden ser desalojados. Obtenga más información aqui: https://t.co/EAkOd0KtC9","date":"Thu Mar 31 16:06:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"DEADLINE: Today is the FINAL DAY to apply for rent relief through @housingiskey if you have been financially impacted by #COVID19. Eligible renters who have applied cannot be evicted. Learn more at https://t.co/EAkOd0KtC9","date":"Thu Mar 31 16:06:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Congratulations @ABCNewsPR, @MariaESalinas is a great addition to your team! #Felicidades","date":"Thu Mar 31 00:22:28 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The free press is essential to anti-corruption and holding leaders accountable - and any attempts to criminalize the press are unacceptable. We must protect journalists doing the work of the people.","date":"Wed Mar 30 21:45:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"La prensa libre es esencial para combatir la corrupción y hacer que los líderes rindan cuentas, y cualquier intento de criminalizar a la prensa es inaceptable. Debemos proteger a los periodistas que hacen el trabajo del pueblo.","date":"Wed Mar 30 21:45:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Yesterday, @POTUS signed @RepBobbyRush’s Emmett Till #AntilynchingAct into law, making lynching a federal crime for the first time American history. I'm proud to have voted for this bill to finally correct this grave injustice &amp; close this dark and shameful chapter of our past. https://t.co/KlwVpj57Oq","date":"Wed Mar 30 20:37:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On #NationalDoctorsDay I want to personally recognize my @KPSCALnews MD Lisa Jung Sook Choi-Flores. Thanks for keeping me healthy Dr. Choi-Flores! https://t.co/QLqtfqD0kY","date":"Wed Mar 30 19:57:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you for visiting, @SecCardona – you’re welcome in the Inland Empire any time!","date":"Wed Mar 30 19:22:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The @intech_center has been instrumental to job-seekers and local businesses alike by training and developing a strong workforce.\n \nAlongside Superintendent @TonyThurmond and @SecCardona, I’m committed to strengthening our workers and economy by supporting programs like InTech. https://t.co/8X3IKXs19u","date":"Tue Mar 29 22:10:07 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".@DeAnza_OMSD has been a model of resilience and excellence in academics through the pandemic. It’s great to be here with @SecCardona to hear directly from students and teacher leaders about how we can continue to help them excel both in and outside of the classroom. https://t.co/om8sTIYzQR","date":"Tue Mar 29 21:21:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s a pleasure to welcome @SecCardona to the #InlandEmpire. Together we will be visiting @DeAnza_OMSD and @intech_center to meet with teachers, staff, and students. https://t.co/gDLws3djYL","date":"Tue Mar 29 20:03:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"A mobile health center will greatly improve access to care for many #InlandEmpire residents. I look forward to seeing this project come to life.","date":"Tue Mar 29 17:04:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am glad the court ruled to allow Hernandez to be extradited, and I look forward to seeing him stand trial for his crimes here in the U.S. But the court also must answer for the special treatment they showed him.","date":"Tue Mar 29 13:46:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Me alegro que la corte ha decidido permitir la extradición de Hernández, y espero verlo enjuiciado por sus crímenes aquí en los Estados Unidos. La corte también debe de responder por el trato especial que le dieron. https://t.co/WMa3YFm8aU","date":"Tue Mar 29 12:42:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"City managers from Ontario, Pomona, Eastvale, Fontana, and Chino joined us for a roundtable last week to discuss ARPA funds, community funding projects, additional grants, and other priorities. https://t.co/eBx2APpNNI","date":"Mon Mar 28 20:06:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".@FoothillTransit is leading by example by reducing emissions with their two new electric double decker buses. I look forward to supporting their work to provide sustainable transit in the @CityofPomona and #InlandEmpire. https://t.co/6ZwdbiUoty","date":"Mon Mar 28 18:33:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Tense? Bad jokes set aside. How about the blatant disregard for the safety of the person on stage! Where was security to stop someone from walking up to the stage &amp; physically assaulting the presenter.","date":"Mon Mar 28 16:28:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Ganesha Park is receiving $3,000,000 for trail, street, and drainage improvements to increase recreation opportunities for residents.🌳 https://t.co/qxiSRYzlwy","date":"Mon Mar 28 15:35:49 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I met with @FontanaUnified Superintendent Randal Bassett to talk about the Innovation Center set to open in May and other upcoming opportunities for our students, including a large expansion of WiFi on school campuses. https://t.co/ZJDv5oBplb","date":"Sun Mar 27 23:24:42 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"“These projects are set to become reality as the result of more than $14.3 million in federal funding secured by Rep. Norma Torres for needs across the region.”\n\nTake a look at the investments coming to our community: https://t.co/cg9QE9rIQA","date":"Sun Mar 27 18:02:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On the 2nd anniversary of the #COVID19 pandemic, @CityofRialto memorialized the loss of 385 of its residents. I pay tribute to all of the victims and send my deepest condolences to all of the families who felt this loss. https://t.co/8KNckl1Phv","date":"Sat Mar 26 14:42:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"New:\n🚰water pipelines\n🔥fire hydrants\n🎛️water meters\n💧and connections to existing waterlines.\n \nWith the $2,000,000 coming to @MyWVWD, our community will be safer and more livable for all residents. https://t.co/Hqx1sJHyXH","date":"Fri Mar 25 15:33:49 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"When we provide adequate support for youth in the criminal justice system, they have greater opportunity to discover their place in the world and thrive in our communities.","date":"Fri Mar 25 14:11:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The $380,000 in funding for the LOVE Program will provide mental health services, substance use disorder treatment, &amp; diversion programs to help reduce juvenile recidivism rates. https://t.co/eBPGGFVOyj","date":"Fri Mar 25 14:11:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I started my morning in @CityofRialto to discuss the $862,500 in funding they will receive for a new emergency operations center. These investments will be crucial in supporting multi-agency and multi-jurisdictional responses and recovery efforts in the Inland Empire. https://t.co/ZHsQ9NIbBT","date":"Thu Mar 24 19:35:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thanks for not embarrassing us by physically shoving world leaders out of the way. Thank you for leading on #WorldPeace","date":"Thu Mar 24 15:03:53 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".True we have sent a lot thoughts &amp; prayers. Many of our own families are included in the victims tally. It’s not “Congress” preventing common sense gun laws, standing in the way is the GOP. @HouseDemocrats passed several pieces of legislation, the Senate has failed to pass.","date":"Thu Mar 24 14:51:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".@UPS pulled out all the stops for our tour, sharing the wonderful work their staff has been doing during these challenging pandemic times. Their teams ensure we process logistical shipment all while minimizing environmental impacts and keeping employees safe. https://t.co/dcGYisGK8h","date":"Thu Mar 24 14:18:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Every single woman has felt this pain of being told they are not good enough. We are you, and you are us. We see you!#JudgeKetanjiBrownJackson #youareworthy #ConfirmationHearing","date":"Thu Mar 24 01:27:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Estoy profundamente triste de escuchar sobre el fallecimiento de la Secretaria Madeleine Albright. https://t.co/YnALA2ri9a","date":"Thu Mar 24 01:20:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am deeply saddened to hear about the passing of Secretary Madeleine Albright. https://t.co/UKtAz8JrOF","date":"Thu Mar 24 01:19:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We took a tour with Carpenters 909/951 Union Hall to catch up on their priorities on youth programs, competitive apprenticeships, and ensuring the community continues to benefit from training for quality jobs. https://t.co/rIcSxYtSKy","date":"Wed Mar 23 23:18:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Free public transit, yes!! I can’t wait to hear how @CAgovernor will work with @IWillRide @FoothillTransit @Metrolink @Omnitrans @METROBUS and so many others to make this happen quickly.","date":"Wed Mar 23 20:35:35 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Have you met Tony Maglica from @MAGLITE flashlights in @CityofOntario? Tony started his manufacturing business with only $125 in his pocket and now produces top-quality safety equipment - all #MadeintheUSA. https://t.co/WkiAY7g6Q9","date":"Wed Mar 23 19:57:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"CJUHSD Assistant Superintendent Charlene Saenz has helped break barriers for women in leadership. I’m was proud to recognize her impressive work in honor of #WomensHistoryMonth","date":"Wed Mar 23 01:04:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The state has distributed more than $2.4 billion through the Housing is Key program. If you need help paying rent, don’t miss your opportunity to apply for these funds. https://t.co/qLrpYmm0wl","date":"Tue Mar 22 18:55:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"🗓️Deadline approaching: Both renters and landlords who have been impacted by COVID-19 are eligible to apply for rent relief by March 31. https://t.co/EAkOd0KtC9","date":"Tue Mar 22 18:52:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My statement on the news of Judge Erika Aifán’s resignation. https://t.co/7mlzAVwD1Z https://t.co/qBIcLkUcUg","date":"Tue Mar 22 14:50:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Mi declaración sobre la noticia de la renuncia de la Jueza Erika Aifán al sistema judicial guatemalteco por su trabajo en anticorrupción. https://t.co/7mlzAVwD1Z https://t.co/g2jhqHQ8nL","date":"Tue Mar 22 14:49:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This funding will drive innovation and create hands-on learning opportunities for students while strengthening our national security technology with research, development, and analysis.","date":"Tue Mar 22 13:22:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"ICYMI: @gracenapolitano, @RepCarbajal, and I secured $10 million in this year’s government funding bill for Air Force Research Lab partnerships with Cal Poly. https://t.co/0lWmZlgxNj","date":"Tue Mar 22 13:21:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"And Rialto Passport Day was well-attended with lines stretching across the Civic Center. It was great to see so much of the community out this weekend! https://t.co/kD5bt6HlCS","date":"Mon Mar 21 21:54:16 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We had a busy weekend in Rialto! Rialto Pony, the Bill Batt Rialto Girls Softball Association, &amp; the North Rialto Little League had their Opening Day Ceremonies. https://t.co/BDdBQwVHcf","date":"Mon Mar 21 21:53:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".what in the world 🤥 is he saying. Mr. Cruz ran away from his community when they were freezing &amp; hungry &amp; the electrical grid failed. It was too uncomfortable for him to stay &amp; help, so he went to Acapulco to enjoy the sun &amp; warm beach. #ConfirmJudgeJackson","date":"Mon Mar 21 18:56:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The 30,000 federal judiciary employees deserve the same anti-discrimination rights that private sector and government employees have. We must pass the Judiciary Accountability Act to make these reforms a reality. https://t.co/nR0S2nbp31","date":"Mon Mar 21 13:22:37 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congressman Don Young was a champion for Alaska. His legacy of willingness to work across the aisle on important issues and leadership as Dean of the House will live on. My prayers are with Anne and their family.","date":"Sun Mar 20 22:23:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Currently, asbestos disclosure regulations vary by state, and in California, landlords are only “strongly urged,” but not required, to disclose asbestos. The Asbestos in Housing Reduction Act will create a federal requirement to disclose asbestos to buyers and tenants.","date":"Fri Mar 18 20:31:28 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Asbestos-related illness and death is preventable, and we have a responsibility to limit it everywhere we can. I introduced the Asbestos Exposure in Housing Reduction Act to protect tenants and renters from asbestos exposure in their homes. https://t.co/amDGmHjVdq https://t.co/9VL4mJF0Ru","date":"Fri Mar 18 20:28:42 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Southridge Tech Middle School hosted their college and career day, inviting experts in different fields to talk about their professions and share their career advice. https://t.co/sjK2rfIptb","date":"Fri Mar 18 17:45:56 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The 25th Annual #LULAC National Legislative Awards Gala highlighted critical legislative issues affecting Hispanic Americans and recognized key leaders who have served the Hispanic community well. Thank you to all who joined us for #Gala22. https://t.co/8MWrMsMtSw","date":"Fri Mar 18 14:10:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I was honored receive this year’s @LULAC National Legislative Award! https://t.co/wosD6Cw9eZ","date":"Fri Mar 18 14:10:20 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I met with @CALNENA911 members to hear their stories and affirm my support for our 911 operators, who work daily to save lives. The #911Saves Act would recognize the life-saving work of 911 dispatchers by classifying them as emergency personnel. https://t.co/FvoortefeH","date":"Fri Mar 18 02:40:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My statement on the extradition of Juan Orlando Hernandez. https://t.co/8CeNIM1NBC https://t.co/B1xjDWz4V8","date":"Thu Mar 17 16:51:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Mi declaración sobre la extradición de Juan Orlando Hernández. https://t.co/8CeNIM1NBC https://t.co/UWOfUFEI1B","date":"Thu Mar 17 16:48:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".muy pronto le vamos a dar la bienvenida al #coconspirator4 felicidades #Honduras","date":"Thu Mar 17 02:38:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I had a great meeting yesterday with the Federal Wildland Firefighters to learn more about the work they do to keep us safe &amp; how Congress can support them. In California, we know the threat &amp; impact of wildfires all too well, &amp; we are so appreciative to these brave firefighters. https://t.co/A5Hic1ZhWW","date":"Wed Mar 16 19:53:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The US stands in full support of Ukraine, with $13.6 billion in aid in the government funding bill signed into law yesterday, &amp; the additional $800 million authorized by President Biden today. This money will help support the millions of refugees forced from their homes.","date":"Wed Mar 16 18:10:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This morning we heard President Zelenskyy speak emphatically and clearly about the atrocities suffered by the people of his country at the hands of Vladimir Putin.","date":"Wed Mar 16 18:09:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@gracenapolitano @RepCarbajal @AFResearchLab @CalPoly I’m proud the Air Force is investing in the next-generation workforce right here in the Inland Empire to prepare our students for high-technology careers and bright futures.","date":"Wed Mar 16 17:52:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I partnered with @gracenapolitano and @RepCarbajal to deliver $10 million for @AFResearchLab partnerships with @CalPoly. This partnership creates unique learning opportunities for students while helping the Air Force develop new technologies. https://t.co/Kjzmw1w6X0","date":"Wed Mar 16 16:22:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"With more than 11,000 anti-Asian hate incidents since the start of the pandemic, we must do more to reject xenophobia and #StopAsianHate. https://t.co/4b55jUiGHj","date":"Wed Mar 16 16:13:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I joined @CAPAC and @SpeakerPelosi to commemorate the one year anniversary of the Atlanta spa shootings, where a gunman targeted 3 Asian-owned spas and brutally killed 8 people. https://t.co/9rBVDLYmdD","date":"Wed Mar 16 16:12:44 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"At noon today, I will be managing the rule on the FAIR Act — which aims to end forced arbitration agreements for both consumers and employees.\n\nYou can tune in here: https://t.co/KtyPEMY4XS","date":"Wed Mar 16 15:50:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"🎨 We are now accepting submissions for the 2022 Congressional Art Competition! Entries are due by April 15. See all guidelines and submit at https://t.co/JlwnNtNHib. https://t.co/vFmxqnDuPo","date":"Tue Mar 15 23:31:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is a historic moment. Congratulations Shalanda Young for being confirmed to serve as the first Black woman Director of the Office of Management &amp; Budget. This is well-deserved, and a great accomplishment to celebrate during #WomensHistoryMonth! https://t.co/uWPVz6AV4O","date":"Tue Mar 15 22:34:35 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"In great company celebrating #WomensHistoryMonth at the @WhiteHouse this afternoon. https://t.co/GuwVmtFC7B","date":"Tue Mar 15 21:33:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This #EqualPayDay, I’m raising awareness about the wage gap for Latina women.\n \nFor every $1 paid to white fathers, Latina moms make just 46 CENTS. Equal pay for equal work is not only fair, it helps address economic, health, and education disparities among children. https://t.co/x7ciZQoyoF","date":"Tue Mar 15 18:10:20 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to Coastal Vision Medical Group for the grand opening of their newest branch in @CityofChinoGov! Welcome to #CA35. https://t.co/6dV9yyqFCh","date":"Tue Mar 15 16:44:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This weekend my team recognized President Johnny Caraballo and the Rialto Park Little League Executive Board during their Opening Day Ceremony. Best wishes to the players and families for a great season. https://t.co/i2EFjfiPU4","date":"Tue Mar 15 15:21:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".@CountyofLA will begin taking applications March 31 for its Breathe program that will provide $1000/month to select eligible residents who have been financially impacted by #COVID19. Visit https://t.co/xn5NdItpKP for more info including eligibility requirements.","date":"Tue Mar 15 13:00:41 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"President Zelenskyy’s bravery and leadership in the midst of crisis have inspired the world. I look forward to hearing from him this week. https://t.co/i6rFSeauRG","date":"Mon Mar 14 18:37:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My team joined @ChaffeyHSTigers as they hosted SCE Federal Credit Union’s Mad City Money event, which teaches students about financial literacy and budgeting before they graduate. https://t.co/xiV2hGwxTK","date":"Mon Mar 14 16:17:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Big congratulations to @MontclairCavs for their TWO CIF champions! The Montclair Boys’ Soccer team brought home the CIF Southern Section Div. IV Championship and Johanna Forman is now a two-time CIF Southern Section and State champion. Go Cavs! https://t.co/VzHsNssxJS","date":"Mon Mar 14 13:54:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today we are celebrating a milestone accomplishment with my daughter in-law Tami Jo. Congratulations 🎉 NP Torres https://t.co/XfKzc4dE9t","date":"Sat Mar 12 19:30:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The U.S. has a responsibility to uphold human rights, democracy, and rule of law in the Northern Triangle. I’m glad to have secured these provisions ensure that we aren’t funding corrupt governments responsible for human rights abuses. https://t.co/nKFBqaQUbN","date":"Fri Mar 11 23:08:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Creating a profit incentive for human captivity is immoral and regularly leads to abuse and appalling conditions for inmates. That’s why I joined my colleagues in calling on @ICEgov to phase out the use of private for-profit facilities. https://t.co/HeckhnGxdq","date":"Fri Mar 11 19:48:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".There is #NoExcuseFor911Abuse please don’t call 911 for non-emergency concerns. The emergency line MUST remain available for true emergencies.","date":"Fri Mar 11 18:42:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"In the year since passing the #AmericanRescuePlan to address the economic impact of COVID-19, we’ve created more than 7 million jobs, unemployment is down to 3.8%, and private sector job growth is strong, boosted by @HouseDemocrats and @POTUS.","date":"Fri Mar 11 17:47:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m proud to deliver these funds to the community partners who I know will put them to great use making our cities and towns stronger, safer, and more vibrant, and I will visit these sites in the coming weeks to discuss the impact of this funding.","date":"Thu Mar 10 14:33:12 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great news: The Inland Empire will receive more than $14.3 million for local projects in this year’s government funding bill. https://t.co/JRUVJC4Ol7","date":"Thu Mar 10 14:32:35 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Did you hear my excitement all the way from DC! These are just a few of my appropriation wins. #ForThePeople https://t.co/xXTVBH8iJT","date":"Thu Mar 10 03:33:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The Guatemalan Congress should be focused on eradicating public corruption and punishing those who rape and abuse women and children, but instead they have chosen to force women who have been raped to endure more suffering. https://t.co/jfWd8OZZ8P","date":"Wed Mar 09 21:14:52 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our community continues to feel the effects and mourn the loss of Officer Casillas’ death. We continue to honor his sacrifice.","date":"Wed Mar 09 18:47:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"🚆🚌 Great news: @Omnitrans and @FoothillTransit have received $63 million from the #AmericanRescuePlanAct to continue supporting their operations through the pandemic. https://t.co/C7JAIcVTLx","date":"Wed Mar 09 17:38:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On #InternationalWomensDay we celebrate the progress we've made to advancing gender equality around the globe, while recognizing there is still work to do. I'm proud to serve with these women in Congress to do our part making the world a safer, fairer place for women and girls. https://t.co/1skB4rzGN7","date":"Tue Mar 08 23:15:23 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I led a letter to President Lasso of Ecuador urging him to affirm the will of the people and the National Assembly, and support access to abortion for survivors of rape. https://t.co/37s0SasoQM https://t.co/HvD0sfCyUC","date":"Tue Mar 08 22:43:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great grant opportunities available from the #BipartisanInfrastructureLaw  - apply by May 31.","date":"Tue Mar 08 21:12:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I had so much fun at the Montclair Little League Opening Day ceremony! These families are ready for a fun and competitive season. Let's play ball, @CityofMontclair! https://t.co/XDKlwifdx2","date":"Tue Mar 08 14:55:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @SBCounty for helping us get tests to these parishioners.","date":"Tue Mar 08 00:26:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last time I spoke to Fathers Gomez &amp; Restituto, they asked for help getting tests for their most at-risk parishioners. On Friday, I stopped by St. Margaret Mary Church in Chino to drop off 2,000 at-home COVID-19 rapid tests to be distributed to members of their church. https://t.co/uaDTPdxvTp","date":"Tue Mar 08 00:24:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"TONIGHT: Join me at 7 PM for a live tele-town hall to discuss local and federal resources available to #InlandEmpire small businesses. Register and submit your questions at https://t.co/D54hVTZCn4. https://t.co/JPz3K05nKA","date":"Mon Mar 07 17:32:53 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Buy 🇺🇸 products, consumers drive demand.","date":"Sun Mar 06 21:06:30 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Russia’s barbaric war on Ukraine 🇺🇦. 🙏🏼","date":"Sat Mar 05 21:15:42 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"More than 270 million at-home COVID-19 test kits have been delivered to our doors.  While there’s still more work to be done, it is a good start.  Locally, I’m committed to providing more access to testing for our residents. https://t.co/VdP1rQvBs1","date":"Sat Mar 05 16:25:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am hosting a live tele-town hall on Monday to discuss local and federal resources available to #InlandEmpire small businesses. Please join us and bring your questions. https://t.co/LKDSMfdf11","date":"Fri Mar 04 23:24:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the @CityofPomona Public Library for hosting the Dr. Seuss Birthday Bash in honor of Dr. Seuss’ 118th birthday. They read some of his classic work and donated books to families to enjoy at home. https://t.co/ef43Vty5Fc","date":"Fri Mar 04 22:25:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thrilled that $40 million will be coming to @CityofPomona for a greenfield manufacturing site for electrical infrastructure &amp; EV charging equipment. These are the jobs we need in a competitive 21st century economy, &amp; I'm proud they will be right here in the #InlandEmpire.","date":"Fri Mar 04 20:03:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"A @USGAO study shows more than half of SNAP-eligible students never access their benefits, in part due to complex eligibility rules. This problem can be addressed by ensuring students know what benefits they are eligible for and how to access them. https://t.co/c5CQ6B7tdo","date":"Fri Mar 04 14:28:51 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I joined my colleagues in writing a letter to @SecVilsack requesting the @USDA address the growing food insecurity among college students by issuing clear guidance about eligibility for SNAP and other federal benefits. https://t.co/epgIqEgwnt","date":"Fri Mar 04 14:28:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is terrifying!  #PutinWarCriminal","date":"Fri Mar 04 01:27:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Nombres?","date":"Thu Mar 03 20:48:20 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Y quien del congreso lo defiende?","date":"Thu Mar 03 20:44:51 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Buenas tardes #Honduras, cómo está el #coconspirator4? Cuéntenme, porque no he podido seguir las noticias.","date":"Thu Mar 03 20:35:52 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@VetAffairsDems I included two amendments in this bill to ensure care is accessible to veterans in the 10 most-spoken languages in the U.S., and to require the @DeptVetAffairs to study how early detection diagnostic tests can improve veterans’ care. https://t.co/hE8zP30Q0T","date":"Thu Mar 03 17:10:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I'm proud to vote for the Honoring our PACT Act, to expand access to care and benefits for toxic-exposed veterans. https://t.co/6wFSu7vXKI","date":"Thu Mar 03 16:50:02 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".This is what #Putin’sWar on innocent women &amp; children looks like. #StopRussia #StandUpForPeace","date":"Thu Mar 03 15:39:41 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".exciting news! https://t.co/Vc5sAcDPKy","date":"Thu Mar 03 15:21:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Way to go!","date":"Thu Mar 03 14:22:53 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I will continue to fight for all Dreamers, including the estimated 14,000 in the communities I represent.","date":"Wed Mar 02 03:00:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We need comprehensive immigration reform, including an accessible pathway to citizenship and protections for #DREAMERS. I will continue to fight to ensure immigrants are treated with respect and dignity when they arrive here, and that they are given a fair shot in our country.","date":"Wed Mar 02 02:59:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Millions of kids have been forced back into poverty without the support of the #ChildTaxCredit. There's no excuse for not renewing and expanding this crucial support that helps families put food on the table and keep a roof over their heads - including 167,000 kids in #CA35.","date":"Wed Mar 02 02:48:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #AmericanRescuePlan provided nearly $15 billion in supplemental Child Care and Development Fund grants to help families pay for child care, including $1.4 billion for California. America is stronger when we support our families and children.","date":"Wed Mar 02 02:42:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Jobs, jobs and more jobs! Good wages! And protections for workers. Racing to the top with @POTUS #MakeItInAmerica #StateOfTheUnion https://t.co/vCnAvtADDc","date":"Wed Mar 02 02:34:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The investments in the #BipartisanInfrastructureLaw are already making a difference in the #InlandEmpire by making commutes safer and easier, upgrading our airports, bridges, and transit, and putting Americans to work with good-paying jobs.","date":"Wed Mar 02 02:26:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"In the last year, we saw the fastest job growth in American history and the fastest economic growth in nearly 40 years. We will continue to build on this progress as we recover from the pandemic by creating good-paying jobs here at home and reducing costs for working families.","date":"Wed Mar 02 02:23:28 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Ready to hear from @POTUS tonight about a year of great progress and his vision for the next year. https://t.co/H2pEhUAXvw","date":"Wed Mar 02 01:44:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I proudly joined my House colleagues today to stand in support of brave Ukrainians fighting for their country. https://t.co/NSC8tbtKmz","date":"Tue Mar 01 21:19:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m looking forward to attending the #SOTU with @POTUS. #KeepAmericamovingforward https://t.co/ZJfsLKossW","date":"Tue Mar 01 18:43:23 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Happy 50th anniversary to Baldy View ROP and congratulations on their successful Community Open House &amp; Career Fair! They are helping young adults learn about different career paths and providing training so they can enter the workforce with the tools they need to succeed. https://t.co/FIlzImbUzE","date":"Tue Mar 01 16:47:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Prayers for the innocent victims of this shooting.","date":"Tue Mar 01 02:42:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This weekend I joined Rialto’s District African American Parent Advisory Committee’s #BlackHistoryMonth Celebration with a focus on HBCUs. Thank you to Keynote Speaker Dr. Will Greer, Principal Kimberly Watson &amp; the DAAPAC Board for their work with parents in the community. https://t.co/hgm5ziiUeZ","date":"Mon Feb 28 23:23:38 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Abortion restrictions disproportionately harm those already facing barriers to care, including people of color and those with low incomes. That's why last year I voted to pass the Women's Health Protection Act - now it's time for my colleagues in the Senate to do the same. #WHPA","date":"Mon Feb 28 21:37:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to @GaneshaHighPUSD teacher Kevin Tharpe and his sixteen amazing art students for their exhibit showcasing the legacy of Black role models in honor of #BlackHistoryMonth. https://t.co/QxyaCPqPBb","date":"Mon Feb 28 20:24:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Sending my condolences to Senator Feinstein and her family. They are in my prayers.","date":"Mon Feb 28 18:26:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I'm proud to recognize Ms. Jasmine Saunders at Elderberry Elementary for her educational leadership as teacher of the year. I stopped by her classroom to thank her for her dedication during #BlackHistoryMonth. https://t.co/8HXVwWCVzJ","date":"Mon Feb 28 14:52:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Ukraine 🇺🇦 is a free democracy. #StopRussia","date":"Sat Feb 26 16:37:42 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Who should listen to his speech? The “people” everywhere! Make him go viral so that Russians and people everywhere can hear it. #NoWar #UkraineRussiaCrisis","date":"Fri Feb 25 16:08:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Vladimir Putin’s unprompted invasion of Ukraine is a clear threat to democracy and national security worldwide that will result in senseless suffering &amp; death. We must continue to oppose this violation of peace &amp; international norms, not only in word, but with definitive action. https://t.co/d7n0Y6G6SB","date":"Fri Feb 25 00:09:02 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Free groceries, at-home COVID tests, and COVID vaccines will be available tomorrow at the Pomona Community Resource Center. Register for the event at https://t.co/zEQHGSmt2M. https://t.co/egGabP8iGA","date":"Thu Feb 24 21:15:16 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was great to see so many familiar faces at @CityofChinoGov’s State of the City luncheon. https://t.co/J4JENu6dHS","date":"Thu Feb 24 14:47:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Darn right! “There is no purgatory for war criminals, they go straight to hell.” May God deal with this devil of a man #Putin in this life or the next. #UkraineRussiaCrisis","date":"Thu Feb 24 05:00:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Contact my office if you are interested in attending one of our prestigious U.S. Military Academies. https://t.co/myb57LdEp3","date":"Wed Feb 23 21:32:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was great to run into Mr. and Mrs. Rodríguez last weekend while out in the community. They are the proud parents of Iseiah Rodriguez who I had the honor of appointing to West Point 2 years ago! https://t.co/2hp9eJow6R","date":"Wed Feb 23 21:32:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Best of luck to our finalists! I believe that we can win!","date":"Wed Feb 23 19:19:04 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"In honor of #BlackHistoryMonth @TheBlackCaucus and @JECDems released new analysis of the current economic status of Black Americans, celebrating the progress that has been made and recognizing the challenges that remain. \n \nhttps://t.co/6akAl80PxX #JECxCBC","date":"Wed Feb 23 18:14:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I hope the Republican lawmakers who so quickly found money to send additional weapons overseas can also find the money to support American families here at home with basic programs including the #childtaxcredit. https://t.co/cYW6hHaT3w","date":"Wed Feb 23 01:23:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Vladimir Putin has once again displayed contempt for Ukraine’s sovereign borders and the rule of law. He has rejected diplomacy and all concern for innocent human life.\n \nWe will hold him accountable.","date":"Wed Feb 23 01:23:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hands up! It was great to meet with third grade teacher Donna Colson, an outstanding educator, and her class at Dorothy Grant Innovations Academy in @CityofFontanaCA, to recognize her work during #BlackHistoryMonth. https://t.co/ccUD9Yuyov","date":"Tue Feb 22 20:03:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to Ms. Artina McIntosh from Empower Success Now for her non-profit work and college prep with Fontana students. I’m proud to recognize her achievements in honor of #BlackHistoryMonth. https://t.co/UKuJWb1GFU","date":"Tue Feb 22 15:42:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is a great step to help prioritize historically underserved communities – like mine – that are often overlooked when it comes to federal investments.","date":"Fri Feb 18 20:06:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Every month, @CityofMontclair provides food to our community. Yesterday they distributed food to more than 150 families – look out for next month’s event. https://t.co/FPwVDTppaf","date":"Fri Feb 18 17:05:44 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today we will be handing out COVID-19 rapid test kits at Palomares Park in @CityofPomona. There will be a limit of two kits per household while supplies last. Register for a kit at https://t.co/gbdU9nWuCM","date":"Fri Feb 18 14:33:03 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today I joined Governor @GavinNewsom as he unveiled the next phase of California’s COVID-19 response at the Cal OES in @CityofFontanaCA. https://t.co/mEDFEtPwsv","date":"Fri Feb 18 02:14:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Republican state legislatures will continue to pass more and more restrictive laws taking away a woman’s autonomy until we pass legislation to codify the protections in Roe.","date":"Thu Feb 17 22:13:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I'm looking forward to highlighting the work of some of our local leaders and giving them the recognition that they deserve. Please join me in learning a little more about the work Black leaders are doing every day to enrich our communities.","date":"Thu Feb 17 17:37:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our nation has made great progress in large part due to the work of Black Americans in Washington and here at home. #BlackHistoryMonth is a chance to honor the legacy of the progress we have made, and to rededicate ourselves to the work that still needs to be done.","date":"Thu Feb 17 17:37:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Every day, Black leaders here in #CA35 district are making a difference and giving back, by teaching our children, providing health care and coronavirus resources, working in our local governments, running successful local businesses, and so much more.","date":"Thu Feb 17 17:36:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"In celebration of #BlackHistoryMonth, I will be visiting exemplary Black leaders throughout the #InlandEmpire to recognize their contributions to our community.","date":"Thu Feb 17 17:36:38 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hernandez has been a central figure in undermining rule of law in his own country &amp; protecting &amp; assisting drug traffickers to move their materials through Honduras to the United States. It is essential we hold him accountable for his criminal behavior. https://t.co/Wy1wMzYEyd","date":"Thu Feb 17 16:27:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My thoughts are with all the victims of this disaster. I hope @usembassyguate is working to facilitate assistance for those affected. https://t.co/qONNafnH3E","date":"Thu Feb 17 14:34:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Seguimos salvando vidas en #Guatemala donando vacunas. 👇🏼","date":"Thu Feb 17 02:10:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I have long fought for increased federal funding to combat human trafficking, and I'm glad to see operations like this one have such success. I will continue to advocate to ensure law enforcement has the resources to stop perpetrators, and that we care for survivors.","date":"Thu Feb 17 00:09:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".@lapublichealth is implementing new guidance and programs for this post-surge period, including updated masking guidance and a new text-messaging program to provide info for residents who test positive for #COVID19. Learn more at https://t.co/uQLEQuoPJe","date":"Wed Feb 16 22:53:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations Professor Winny Dong from @calpolypomona for receiving the Presidential Award for Excellence in Science, Mathematics and Engineering Mentoring! https://t.co/MeEySzzn04","date":"Wed Feb 16 19:31:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is undoubtedly a victory for the families of the Sandy Hook victims, and I hope it provides them some sense of justice and accountability. Let this serve as an example to all others in the gun industry willing to turn a blind eye to safety in exchange for profit.","date":"Wed Feb 16 16:50:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Aplaudo la decisión de los Estados Unidos de solicitar rápidamente la extradición del ex presidente Juan Orlando Hernández, y me siento aliviada de que el gobierno de Honduras esté dando los pasos necesarios para trabajar con nosotros para llevarlo a la justicia. https://t.co/XEgoYxMDkw","date":"Wed Feb 16 00:50:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I applaud the United States’ decision to quickly request the extradition of former President Juan Orlando Hernandez, and I am relieved the Honduran government is taking the steps to work with us to bring him to justice. https://t.co/h1vqAO3XzT https://t.co/RhYt0yyse2","date":"Wed Feb 16 00:39:18 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great to meet with @IJM ambassador Sam Acho to discuss efforts to protect women &amp; children from violence in Central America. Thank you, Sam! https://t.co/OAgIGnEaLY","date":"Tue Feb 15 21:37:44 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations on your retirement, and thanks for bringing so much sweetness to our community for the last 40 years!🍰https://t.co/rrbN0UAhVe","date":"Tue Feb 15 17:50:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@SEIU2015 My team joined @SEIU2015 at a Valentine's Day appreciation event for nurses at Laurel Wellness in @CityofFontanaCA. I’m proud to stand with our dedicated health and home care workers. #SafeStaffingSavesLives https://t.co/VqPgBE0eZT","date":"Tue Feb 15 14:30:58 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".puede correr pero no se puede esconder del pueblo y de la justicia. Ya viene la hora.","date":"Tue Feb 15 05:47:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The students at @OMSD_omsd Bon View Elementary created more than 100 cards to send love to our veterans this Valentine's Day.💘 https://t.co/rhlXOpG57T","date":"Tue Feb 15 00:24:20 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The nursing home industry has lost more than 420k jobs since the start of the pandemic—reducing the workforce to the size it was 15 years ago. I stand with nursing home workers today in their call to #PutCareFirst @SEIU2015 https://t.co/1g7uW3Qfs4","date":"Mon Feb 14 21:28:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We will never forget the 17 lives taken four years ago today in Parkland. And will never stop fighting to keep our communities safe from gun violence and make sure it never happens again. https://t.co/kVDK2qlXwg","date":"Mon Feb 14 19:34:38 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to Just Harmony Nursing Services on their grand opening in @CityofMontclair! https://t.co/xhcTZ7Uqgn","date":"Mon Feb 14 17:59:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Whose house?\n#RamsHouse 🏈","date":"Mon Feb 14 03:00:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Now that’s a #HalfTimeShow #California style. #SuperBowl","date":"Mon Feb 14 01:17:07 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Watching the #SuperBowl in a 3 piece suit. #RamsHouse https://t.co/Zv6m8kXkka","date":"Mon Feb 14 00:02:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is wonderful news! Did you consult with first responders on the closures?  Reminder: North/South traffic is closed at White, Fulton &amp; now only 1 lane open on Garey. We don’t want to delay a 🚒🚓🚑🚍","date":"Sun Feb 13 20:08:25 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you Ben Ray! We will continue to pray for you.","date":"Sun Feb 13 17:52:37 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Join me in praying for #Ukraine and the innocent civilians standing ready to defend their democracy. 🙏🏼🙏🏼","date":"Sat Feb 12 03:24:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"He pedido al Departamento de Estado que tome medidas rápidas y contundentes para que estos líderes corruptos rindan cuentas.","date":"Fri Feb 11 22:04:52 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Estos ataques constantes contra el Estado de derecho son un esfuerzo organizado para proteger los intereses corruptos de los elites y los que están en el poder.","date":"Fri Feb 11 22:04:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Estados Unidos debe garantizar la protección de quienes luchan valientemente por la democracia y el Estado de derecho en Guatemala.","date":"Fri Feb 11 22:04:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"El gobierno de Guatemala ha detenido a otro líder de la lucha contra la corrupción, y no se detendrá hasta silenciar a todos los que luchan por sacar a la luz sus manejos corruptos.","date":"Fri Feb 11 22:03:55 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Lo que el dijo! 👇🏼","date":"Fri Feb 11 20:40:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"If you are participating in the #SuperBowl festivities this weekend, please remember to take COVID precautions.","date":"Fri Feb 11 20:23:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Get ready for Super Bowl Sunday, stop by Palomares Park in Pomona to pick up a free test kit. https://t.co/mY0O3CMJ1x","date":"Fri Feb 11 17:38:35 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"ICYMI: The America COMPETES Act, passed last week by the House, includes language I introduced to create a national supply chain database that would prevent future disruptions and connect small manufacturers with new opportunities. https://t.co/w04E7vFvnk","date":"Fri Feb 11 14:57:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congrats to Dr. Baron from @WesternUNews for joining #TeamUSA for #Beijing2022! Way to represent the Inland Empire. https://t.co/9wwrA1YXNp","date":"Thu Feb 10 23:45:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to Claudia Lopez and the students at Inland Empire Job Corps for the Valentine's Day wishes! These students are working on achieving their career goals with the help of dedicated @DOLJobCorps staff. https://t.co/I1FnzGSg6G","date":"Thu Feb 10 21:17:13 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Glad to see the #EndForcedArbitration Act pass with bipartisan support in the Senate. I look forward to these historic workplace reforms being signed into law. https://t.co/Z7id5NlGQP","date":"Thu Feb 10 18:36:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"9-1-1 dispatchers save lives, and it's time we recognize the vital role they play in keeping us safe. My #911Saves Act would do just that by reclassifying these public safety telecommunicators as protective service occupations. https://t.co/Yzk6LyFQFG","date":"Thu Feb 10 15:04:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"By denying visas to those who commit human rights abuses against LGBTQI+ people, the #GlobalRespectAct affirms that hate has no place in the United States. I voted yes on this important step to advance equality across here at home and across the world.","date":"Thu Feb 10 12:59:28 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Creo que puede ser una casa muy bonita para hospedar a los niños Hondureños que llegan a la frontera pidiendo asilo #coConspirator4 \nhttps://t.co/xU1j7sCskc","date":"Thu Feb 10 06:47:19 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".someone call Senator Rubio and tell him his Twitter brain was hacked. Otherwise  🤥🤥🤥","date":"Wed Feb 09 22:46:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Anyone with information about Enrique’s murder could help bring justice for his family. Please contact Army CID Special Agents at 910-396-8777, the Fort Bragg Military Police Desk at 910-396-1179, or report anonymously online at https://t.co/tKBiHza4tG","date":"Wed Feb 09 21:42:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It is an injustice that nearly two years after his death, Spc. Enrique Roman-Martinez’s family still doesn’t have answers about what happened. https://t.co/BWVm6gKhkm","date":"Wed Feb 09 21:41:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Just last month, I wrote a letter to @USDOL and @USDOT asking for additional measures to ensure warehouse, shipping, and logistics employees - many of whom are not unionized - are not harmed by expanded operations. https://t.co/MvAVuHFXMp","date":"Wed Feb 09 18:54:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Warehouse workers in my district are shouldering a huge burden to keep our supply chains up and running amid global disruptions. I'm glad to see the Biden Administration taking steps to guarantee protections for a workforce that is often overlooked. https://t.co/E9xjnF1Pe3","date":"Wed Feb 09 18:50:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The provisions in the bipartisan #PostalServiceReformAct are critical to helping @USPS remain financially viable and ensuring my constituents get their mail on time. I voted yes on this bill to provide reliable postal service for my district. https://t.co/IkGRfzoT95","date":"Tue Feb 08 22:25:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Si su ingreso familiar de 2021 fue menos de $58,000, puede ser elegible para el servicio gratuito de preparación de impuestos del @SBCounty. Aprenda más y haga una cita: https://t.co/vihWKa2FBm","date":"Tue Feb 08 20:41:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"If your 2021 household income was less than $58,000, you may be eligible for @SBCounty’s free tax preparation service. Learn more and make an appointment: https://t.co/xsyjfqiwDB","date":"Tue Feb 08 20:41:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"For eligible families who did not receive advance monthly payments, it’s not too late to receive the expanded #CTC by filing your federal tax return. Visit https://t.co/ilyRd2iPkJ or https://t.co/GEoipPo05g to get started.","date":"Tue Feb 08 18:11:28 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #ChildTaxCredit has cut childhood poverty by roughly 30%. If made permanent, it would cut child poverty in half. We must expand the #CTC and #EITC to support working families.","date":"Tue Feb 08 18:08:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hospitals here at home are over capacity and ICUs are full because only half of @SBCounty is vaccinated. Vaccines are safe, effective, and the best tool we have to end this pandemic. Please do your part and get vaccinated. https://t.co/yZDPxuYL4r","date":"Tue Feb 08 16:26:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Tonight we gathered to recognize more than 900,000 American lives lost to COVID-19. It's heartbreaking and frustrating to watch this death toll continue to climb, but it strengthens our resolve to continue doing everything we can to end this suffering and needless loss. https://t.co/Q4g782FBqg","date":"Tue Feb 08 02:15:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On Friday my office handed out at-home COVID-19 tests and masks to more than 600 people in our community. We will continue to work to make sure everyone has the supplies to stay safe and healthy. https://t.co/WPjilqgYEy","date":"Tue Feb 08 00:27:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It is critical that our nation hold him accountable, so that the Honduran people – and all those harmed by his administration –  can begin the process of healing, and change.","date":"Mon Feb 07 21:21:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hernández has been a central figure in undermining the rule of law in his own country &amp; in protecting and assisting drug traffickers to move their materials through Honduras and to the United States. His criminal behavior over the years is well-documented. https://t.co/JA6XMiMBjO","date":"Mon Feb 07 21:21:18 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Primer paso, luego vienen los cargos revelados en la corte de NY, y después la extradición!  #coConspirator4","date":"Mon Feb 07 21:13:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Forced arbitration clauses deny survivors their day in court and shield abusers from consequences. I’m proud to be a cosponsor of this legislation to make sure victims’ voices are heard. #EndForcedArbitration","date":"Mon Feb 07 19:43:38 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@SenatorMenendez @RepChuck @MarshaBlackburn This database will help prevent supply chain disruptions by identifying potential breakdowns and filling in the gaps before they happen. It will also connect small manufacturers with opportunities, creating good-paying jobs for American workers.","date":"Mon Feb 07 17:53:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Good news: Legislation I introduced with @SenatorMenendez, @RepChuck, and Sen. @MarshaBlackburn to create a National Manufacturing Extension Partnership Supply Chain Database was included in the #AmericaCOMPETES Act. https://t.co/w04E7vFvnk","date":"Mon Feb 07 17:52:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to Let's Party Entertainment for their grand opening in @CityofChinoGov! https://t.co/Bi3VjRWa2j","date":"Mon Feb 07 16:12:03 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Yesterday, Mayor @AcqieWarren and State Treasurer @FionaMa unveiled the @LionsClub International Peace Poster Contest at the Lewis Library in @CityofFontanaCA – one of four cities in California to host the international exhibition. https://t.co/zXvdj8wwd2","date":"Fri Feb 04 21:24:24 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My prayers are with this officer for a quick and full recovery.","date":"Fri Feb 04 18:20:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I'm proud to vote for the #AmericaCOMPETES Act, which supports workers and businesses by ensuring they have the resources to #MakeItInAmerica. This will expand opportunity and create good-paying jobs right here at home, making our economy more prosperous for all.","date":"Fri Feb 04 17:31:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@USDOT Federal transportation projects can help a community move out of poverty, but a lack of investment can lock them into it. The #FairTransportationAct can help can even the playing field for those who have historically been overlooked. #TransitEquityDay","date":"Fri Feb 04 14:25:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It's crucial we prioritize economically disadvantaged communities when we invest in transportation and infrastructure. Last year I introduced the Fair Transportation Act to ensure @USDOT funding is distributed equitably. #TransitEquityDay https://t.co/2sFeIaUFhy","date":"Fri Feb 04 14:25:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Si recibió un aviso de desalojo, tienes 15 días laborables para aplicar al alivio de renta de CA COVID19 e informar a su propietario. Solicitantes elegibles que han aplicado al programa no pueden ser desalojados. Para obtener más información, visite https://t.co/u3zOJLdZEU.","date":"Thu Feb 03 23:03:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"👏🏼👏🏼👏🏼","date":"Thu Feb 03 20:20:41 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"If you have received an eviction notice, you have 15 business days to apply for CA COVID-19 rent relief and inform your landlord. Eligible applicants who have applied to the program cannot be evicted. For more information and to apply, visit https://t.co/u3zOJLdZEU. https://t.co/sVguzEsRPr","date":"Thu Feb 03 20:01:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"¡Celebra el #DíaDeLaEquidadDeTránsito a bordo de Metrolink! Para conmemorar el cumpleaños de Rosa Parks y resaltar el compromiso de @Metrolink con el transporte público equitativo, Metrolink ofrecerá VIAJES GRATIS el 4 de febrero.\n#Todosabordo https://t.co/m6QkaHuSnT https://t.co/vP9VMmsvfo","date":"Thu Feb 03 14:55:16 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"TOMORROW: To commemorate Rosa Parks’ birthday and to highlight @Metrolink’s commitment to equitable public transportation, Metrolink is offering free rides on February 4. #AllAboard https://t.co/m6QkaHuSnT https://t.co/07QInIHm9J","date":"Thu Feb 03 14:54:35 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Gun violence here at home is on the rise, reaching a 15-year high in Los Angeles. We must pass commonsense gun safety legislation to protect our communities and put an end to the violence. https://t.co/c7kizFIjMb","date":"Wed Feb 02 21:54:03 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Every day, more than 110 Americans are killed due to gun violence. #GVSurvivorsWeek represents the date that gun deaths in the United States surpass those in other countries in an entire calendar year. Just one month into 2022, the U.S. has reached this tragic milestone. https://t.co/YXw0vSI3Cz","date":"Wed Feb 02 21:53:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The investments in the Bipartisan Infrastructure Law will make a big difference in the #InlandEmpire: $29B for California bridges &amp; highways, $9.45B for public transit in the state, &amp; $84M to protect against wildfires. I'm proud to bring this support to our communities.","date":"Wed Feb 02 19:02:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Civil society groups are often our most trusted partner in our efforts to promote community-led development and support a more democratic, prosperous region. We must protect their ability to continue their critical work promoting human rights and anti-corruption.","date":"Tue Feb 01 23:21:07 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I, along with my colleagues @SenMarkey, Rep. @JoaquinCastrotx, &amp; @RepMcGovern, am calling on @StateDept and @USAID to prioritize advocacy on behalf of and protections for civil society organizations in Central America. https://t.co/zS2jmpYMzy","date":"Tue Feb 01 23:07:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I join your constituents in praying for a quick recovery.","date":"Tue Feb 01 21:57:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Happy Lunar New Year to all those celebrating in #CA35 and around the world! Wishing everyone a healthy, happy, and prosperous #YearOfTheTiger.","date":"Tue Feb 01 21:12:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"High winds are expected throughout our area this week. Use caution and avoid traveling during periods of strong wind if possible. Follow @NWSLosAngeles for updates and visit https://t.co/U599w0XTm6 for guidelines to stay safe in high winds. https://t.co/drbV9641t9","date":"Tue Feb 01 18:44:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was great meeting last week with @SecretaryPete and my fellow members of the LA delegation to discuss the crucial role that @PortofLA and @portoflongbeach play in our national supply chains, and how to keep them running smoothly. https://t.co/63EgLdpj5d","date":"Tue Feb 01 14:10:08 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Did you know the 1st #SocialSecurity check was delivered on this day, but here we are 82 years later and #Teachers still can’t access this benefit.","date":"Mon Jan 31 22:05:54 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Good news: More than 700,000 Californians got vaccinated in January. Getting the #COVID19 vaccine is the most important thing you can do to protect yourself and those around you from sickness, hospitalization, and death. https://t.co/1AudGT5JP0","date":"Mon Jan 31 22:03:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"🗓️ Today is the last day to sign up for health coverage for this year through @CoveredCA. Visit https://t.co/hVbeC6ZgDT to view plans and enroll.","date":"Mon Jan 31 17:33:51 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I talked with @CityofMontclair officials about repairing our bridges in poor condition. The #IIJA included funding to improve our communities by restoring aging and potentially dangerous bridges and roads. https://t.co/KSOd2piElE","date":"Mon Jan 31 13:54:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Whose house?  #RamsHouse","date":"Mon Jan 31 02:41:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Dont forget to ride the Metrolink 🚊 on February 4th. It’s FREE","date":"Sat Jan 29 01:33:41 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I met with Pastor Tommy Morrow and the Oglesby family to connect about their work in the community from housing to mentorship to children’s books. https://t.co/MK7U4hmFVG","date":"Fri Jan 28 20:56:14 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My thoughts are with those injured and I wish them a speedy recovery.\n\nAmerica’s infrastructure is crumbling before our eyes. We must quickly get to work using the funds in the Infrastructure Investment and Jobs Act.","date":"Fri Jan 28 17:55:44 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This time last year, we celebrated @POTUS rescinding the #GlobalGagRule, but that was just the first step. Now we must make this repeal permanent to prevent dangerous overreach and protect the health of women, girls, and vulnerable individuals across the world.","date":"Fri Jan 28 00:59:47 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congressman Esteban Torres was a dedicated public servant and unwavering advocate for workers, veterans, immigrants, and so many others. His work and legacy have profoundly impacted Southern California, and beyond. My prayers are with his family. https://t.co/57hl1hrj6S","date":"Thu Jan 27 23:47:03 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today we honor more than 6 million Jewish victims who were persecuted &amp; murdered at the hands of the Nazis. We must tirelessly combat the anti-Semitism &amp; hatred we see on the rise today, and recommit to ensuring the victims' stories are never forgotten. #HolocaustRemembranceDay","date":"Thu Jan 27 21:43:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hernandez has been repeatedly identified as a co-conspirator in other drug trafficking cases and has caused incredible pain to both the people of Honduras and the United States. I believe it is essential that the United States hold him accountable for his criminal behavior.","date":"Thu Jan 27 16:10:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am calling on the @TheJusticeDept to immediately indict and request the extradition of President Juan Orlando Hernandez for his role in protecting and assisting drug traffickers to move their materials through Honduras and to the United States. https://t.co/h1vqAO3XzT","date":"Thu Jan 27 16:10:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was a pleasure to attend the Montclair Senior Birthday Drive Thru. We passed out at-home COVID tests, meals, and birthday wishes. https://t.co/PNTx7NRCvz","date":"Thu Jan 27 14:26:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Transparencia, rendición de cuentas y libertad son valores básicos en toda democracia – y esta es una emocionante oportunidad para que la nueva administración asuma estos valores y ayude a la reconstrucción de Honduras. https://t.co/WLzGZ9ZXd5","date":"Thu Jan 27 02:33:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Transparency, accountability, and freedom are basic values in any democracy – and this is an exciting opportunity for President-elect Xiomara Castro to embrace those values and help Honduras rebuild. https://t.co/QpUty2Xh05","date":"Thu Jan 27 02:33:10 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was great to catch up with Principal Cho of @MontclairCavs and the CIF-SS Runner-Up @MHSCavFootball team captains! Montclair High School is doing a great job helping their athletes excel on the field as well as in the classroom. https://t.co/0ilq1tiIYf","date":"Thu Jan 27 01:27:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I had the pleasure of meeting with the @NLBWA_LA to talk about how they're helping Latinas start and grow businesses in #CA35. Their work is helping underserved communities break through barriers to entry and pursue their dreams. https://t.co/eFgnostzEu","date":"Wed Jan 26 22:29:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is so important to protect our communities and workers – people should not feel that they must work while sick in order to make ends meet, or risk losing their job to care for a sick family member. https://t.co/sAYpobxL5D","date":"Wed Jan 26 20:42:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations, welcome to the #InlandEmpire!","date":"Wed Jan 26 18:58:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #ARPA is helping our nation recover from #COVID19 by investing in our communities and creating jobs here at home. Learn more about local opportunities:","date":"Wed Jan 26 02:04:12 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #CleanAirAct is vital for protecting families from carbon pollution - but Republicans are fighting in the Supreme Court to undermine it.\n\nI'm proud to stand with more than 190 of my Democratic colleagues to support clean air for all Americans. https://t.co/2BRfX9nQpe","date":"Tue Jan 25 20:10:04 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m proud to score 100% on @NETWORKLobby’s 2021 Voting Record by voting to protect our democracy, support vulnerable communities, and create a more just nation. Learn more about the score and see how other members voted: https://t.co/Qc39LCis35","date":"Tue Jan 25 17:31:30 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"For the first time ever, the American Red Cross has declared a national blood crisis. Here are some locations in the #InlandEmpire where you can donate blood and help save lives. Learn more about the crisis and schedule a donation at https://t.co/IOpr8BAkYA https://t.co/6jBAajfld9","date":"Tue Jan 25 03:26:13 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"La temporada de impuestos federal de 2022 comienza hoy.\n¿Quieres acelerar el proceso? Entrega tus impuestos electronicamente lo mas antes posible y escoje depósito directo. Aqui hay algunos consejos que le ayudarán a entregar tus impuestos: https://t.co/uMptFnO8dC","date":"Mon Jan 24 21:54:38 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The 2022 tax filing season begins today.\nWant to speed up the process? File electronically as early as possible and opt for direct deposit. Here are some tips to help you file:\nhttps://t.co/uMptFnO8dC","date":"Mon Jan 24 21:53:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"#Noticias: Todos los hogares son elegibles para ordenar 4 pruebas caseras gratis de COVID-19 por visitando https://t.co/000pIB1a0h","date":"Mon Jan 24 18:41:13 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"REMINDER: Every household can now order four rapid at-home tests completely free online at https://t.co/GDAScJY7Kl.","date":"Mon Jan 24 16:31:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Tonight I’m praying for the people in #Honduras. Mañana comenzamos a llamar por la extradición del nombrado en la corte de NY. Paciencia, la pesadilla ya mero termina.","date":"Mon Jan 24 05:47:30 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We need the city’s contractor to return to work! They left to another city. https://t.co/4pXq1Y4oN0","date":"Sat Jan 22 22:17:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you city workers for your dedication and commitment to service. My constituents are busy working to clear all the debris from the street. The next 48 hrs are critical. My staff &amp; I are trying to get updates for you. https://t.co/Z8SRO6Wjls","date":"Sat Jan 22 21:39:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"To report downed trees, contact your city’s public works:\nPomona: 909-620-2261\nMontclair: 909-625-9478\nChino: 909-591-9824 \nOntario: 909-395-2800\nFontana: 909-350-6760\nRialto: 909-820-2602\n\nFor utility outages or emergencies:\nSoCal Edison: 1-800-611-1911\nSoCal Gas: 1-800-427-2200","date":"Sat Jan 22 21:04:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today we celebrate the 49th anniversary of #RoevWade.\n\nIn the face of anti-choice state legislators and a conservative Supreme Court, we must protect women’s hard-won reproductive rights by passing the Women’s Health Protection Act and the EACH Act.","date":"Sat Jan 22 17:59:57 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m so proud of all the women in our communities who are thriving as business owners and entrepreneurs! https://t.co/qzpszgh4kp","date":"Fri Jan 21 20:43:42 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Cinco horas con @MarcosAntil muchas gracias por el libro. https://t.co/SnP89wtSjG","date":"Thu Jan 20 21:54:08 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Proud to join my colleagues to call on tech companies to take action against Spanish misinformation. Millions of Americans, including Latino communities, rely on digital platforms as a resource during #COVID19, and we have a responsibility to them. https://t.co/XlnQxMg3Ql","date":"Thu Jan 20 18:25:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Since our nation’s founding, the right to vote has been a core tenet of our democracy. This right is now being threatened by Republican state legislatures across the country - the Senate must pass the Freedom to Vote Act and the John Lewis Voting Rights Advancement Act.","date":"Thu Jan 20 15:23:53 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"ICYMI: The American Rescue Plan and Infrastructure Investment and Jobs Act - both of which I proudly voted for - are delivering $36 million to @flyONT and @ChinoAirport for COVID-related expenses and airport upgrades, improvements, and equipment. https://t.co/SdcGAgsgZT","date":"Thu Jan 20 02:32:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @CityofPomona Commissioner Jacqueline Elizalde for coordinating the first Pomona Goddess Art Celebration over the weekend! Great turnout and good family fun. https://t.co/8iGtNOPEWM","date":"Wed Jan 19 23:15:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hateful rhetoric has dangerous consequences, and we can't allow bigotry and anti-Semitism to spread under the guise of free speech.","date":"Wed Jan 19 22:14:05 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am so thankful all the hostages of the Colleyville synagogue survived. But the survivors and Jewish communities across our country will continue to bear the trauma of this day, and events like this one, which have become all too common.","date":"Wed Jan 19 22:13:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The CA COVID-19 Rent Relief program is still available for renters and landlords who have been impacted by the pandemic and need financial assistance. Find out if you are eligible, apply, or check the status of your application at https://t.co/EAkOd0KtC9","date":"Wed Jan 19 21:35:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Does “the government” have a last name or a voting record? NO! But you know who does - 100 US Senators. #BeAHeroForVotingRights","date":"Wed Jan 19 20:00:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Between Los Angeles County and San Bernardino County, there are 166 bridges in poor condition that could benefit from this funding. This investment will have a huge impact and make our commutes and communities safer.","date":"Wed Jan 19 14:48:38 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Investing in bridges = good-paying jobs &amp; safer commutes. Thanks to #IIJA, California will receive $4.25 billion over 5 years to upgrade our bridges &amp; get the #InlandEmpire back to work.\n\nLearn more about how the infrastructure deal is working for you: https://t.co/OnSTHJ0Frb https://t.co/aRZWSws2DJ","date":"Wed Jan 19 14:48:21 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Exciting to see this year’s batch of new stamps including Mariachi, African Daisy, Shel Silverstein and more. Take a look and support our local @USPS offices. https://t.co/7yfR3f2Bwz","date":"Wed Jan 19 13:55:36 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Right on! Más fuerte para que todos escuchen.","date":"Wed Jan 19 00:51:13 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"If you are already vaccinated, please get your booster and continue to follow safety guidance including wearing a mask, social distancing, limiting travel, and getting tested.","date":"Tue Jan 18 21:29:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"If you are not vaccinated, you are at increased risk for illness, hospitalization, and death during this COVID surge. Find a vaccine appointment as soon as possible at https://t.co/PYTdGyeoaz.","date":"Tue Jan 18 21:28:40 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"All U.S. households can now order 4 free at-home rapid #COVID19 tests. For more information and to order tests, visit https://t.co/YCSW3p0Pb8.","date":"Tue Jan 18 20:27:17 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Rep. @rosadelauro, @RepDavidEPrice, @RepPeteAguilar, and @RepSherrill joined me in writing to @SecMartyWalsh and @SecretaryPete to ask for additional protections for vulnerable workforces, many of whom come from low-income and often-overlooked communities.","date":"Tue Jan 18 16:27:03 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Warehouse, shipping, and logistics workers are shouldering the burden of our nation's supply chain disruptions. We must guarantee the increased workload doesn't result in dangerous work conditions for those keeping our economy up and running. https://t.co/MvAVuHFXMp","date":"Tue Jan 18 16:26:41 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On #MLKDay we remember the monumental life and legacy of Martin Luther King Jr., and honor his memory by continuing to fight every day to make our nation a safer, more equitable, and just nation for all.","date":"Mon Jan 17 16:10:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".wonderful news.","date":"Sun Jan 16 04:39:41 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".No thank you! 🦠🤢 I’ll take 2 shots &amp; a booster.","date":"Sun Jan 16 03:49:56 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".Prayers for these innocent victims being held hostage. 🙏🏼","date":"Sun Jan 16 00:19:39 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to Mayor @AcqieWarren, CityLink volunteers, and everyone else who helped us distribute 4000 tests in Pomona and Fontana. My office will continue to do everything we can to provide the #InlandEmpire the necessary resources to fight COVID and stay healthy. https://t.co/kRrcyrCCdJ","date":"Sat Jan 15 02:33:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We must recognize workplace misconduct is a pervasive problem in our federal judiciary and create a system in which judiciary employees feel confident that they are protected and that no one is above the law. https://t.co/h3IbiAf3jA","date":"Fri Jan 14 23:00:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Attention parents! Your third and final round of P-EBT has been reloaded to your existing card. 💳 https://t.co/h0Ts1udRTS","date":"Fri Jan 14 21:17:19 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the volunteers that stepped up to help distribute COVID Test. https://t.co/XqBVtC9n7J","date":"Fri Jan 14 18:23:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations Rudy - this is well-deserved and the Administration is lucky to have you! Idaho and our nation will be better for having your leadership.","date":"Thu Jan 13 23:57:43 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".All hail the Queen.","date":"Thu Jan 13 21:31:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Exciting news: The @AMOCAmuseum in Pomona has been awarded $30,000 from @NEAarts to support an exhibition, public programming, and accompanying catalogue on LGBTQA identity, culture, and community.","date":"Thu Jan 13 19:23:49 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Every day spent in uniform – including training – should count towards GI Bill benefits for National Guard and Reserve servicemembers. But 135 House Republicans voted against guaranteeing these hard-earned benefits - while claiming to be the party of patriotism.","date":"Wed Jan 12 21:48:59 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".My buena noticia, felicidades @LeonKrauze","date":"Wed Jan 12 20:07:07 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"@CityofPomona Para obtener una prueba casera en @CityofFontanaCA, regístrese en https://t.co/KiG5uKRz9P.  Debe registrarse para recibir una prueba.","date":"Wed Jan 12 16:49:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Estaremos distribuyendo una cantidad de pruebas caseras de COVID19 este viernes 1/14 en Pomona y Fontana.  Para obtener más información y para registrarse para obtener una prueba casera en el @CityofPomona, visite https://t.co/AUCWM8b92Y. Debe registrarse para recibir una prueba.","date":"Wed Jan 12 16:47:19 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"To get a test kit in @CityofFontanaCA, register at https://t.co/KiG5uKRz9P. You must register to receive a test kit. https://t.co/sO6CByzK2u","date":"Wed Jan 12 16:42:11 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We will be distributing a limited number of #COVID19 rapid test kits this Friday, 1/14 in Pomona and Fontana. For more information and to register to get a kit in @CityofPomona, please go to https://t.co/AUCWM8b92Y. You must register to receive a test kit. https://t.co/DZOYy8WXIH","date":"Wed Jan 12 16:41:19 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Those who live or work in @SBCounty can also pick up free at-home tests at any county-operated test site: https://t.co/jzp7OIKFKk.","date":"Tue Jan 11 22:50:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"🗓️ Aún hay tiempo - la fecha límite para inscribirte en un seguro médico para el 2022 es el 31 de enero. No esperes, ¡obtén cobertura hoy! https://t.co/Ck1fidDw9N","date":"Tue Jan 11 20:49:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"🗓️ There's still time - the deadline to enroll in health insurance for 2022 is January 31. Don't wait and get covered at https://t.co/1XxNDm55jO","date":"Tue Jan 11 20:48:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"On Jan. 6 the brave women &amp; men of the Capitol Police put their lives on the line to protect us. In wake of the insurrection, @HouseDemocrats have provided nearly $1B to support the @CapitolPolice, who are critical to keeping our democracy &amp; country safe. https://t.co/3rRVyKJWyO https://t.co/gTxXtbOw5G","date":"Tue Jan 11 18:08:22 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"All @SBCounty-operated testing sites are offering free rapid COVID test kits to residents who live or work in the county. For locations and more information about rapid tests, visit https://t.co/jzp7OIKFKk.","date":"Mon Jan 10 22:46:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"They don’t want members of our National Guard to earn benefits while they train to protect us!","date":"Mon Jan 10 20:19:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Right now in Rules we are debating benefits for veterans. Is this the leadership you want?","date":"Mon Jan 10 20:08:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"An amazing act of heroism by these officers that saved a life. Thank you for your bravery.","date":"Mon Jan 10 17:36:50 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".This is truly heartbreaking, praying for the families, victims &amp; survivors of this horrific fire.","date":"Sun Jan 09 20:58:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".The heroes working behind the scenes. Thank you! #911Saves","date":"Fri Jan 07 19:01:03 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We experienced a lot of trauma that day but we returned and finished the job. #January6th https://t.co/lcAxMHcy4r","date":"Thu Jan 06 18:14:49 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"In the safe room, we were not safe. Republicans refused to wear a mask. Several of my colleagues tested COVID positive soon after. https://t.co/phvRRTnhZP","date":"Thu Jan 06 17:02:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This video was interrupted by a call from my son Christopher. Also sharing photos taken while we ran/walked to safety. https://t.co/2oif3094ZO","date":"Thu Jan 06 16:58:12 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"OK it’s time to run! But we are questioning if it’s safe to go because an earlier evacuation attempt failed and that was terrifying. https://t.co/WjFe0ccka5","date":"Thu Jan 06 16:54:32 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We are still waiting for evacuation orders. https://t.co/wGTj6sQGPX","date":"Thu Jan 06 16:51:46 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"In the middle of this terrifying chaos ⁦@RepLBR⁩ began to pray. https://t.co/v42SWc3Y2r","date":"Thu Jan 06 16:49:27 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"By this time we were about 40 minutes into the violent political assault. We had crawled the entire length of the gallery, a shot had been fired and tear gas had been deployed. https://t.co/narPK0aXbv","date":"Thu Jan 06 16:44:52 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Following the announcement, we immediately began to organize ourselves - look at ⁦@RepSpanberger⁩ she quickly took position in front of a door. #shero ⁦@RepSherrill⁩ did the same, both armed with nothing but a pen. But they were ready to protect us. https://t.co/duipariXKz","date":"Thu Jan 06 16:40:26 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"The dreadful announcement - The US Capitol had been breached. https://t.co/PFRKG4qKFl","date":"Thu Jan 06 16:34:09 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My first video after receiving multiple security alerts. #January6th https://t.co/DTBr6L8jlZ","date":"Thu Jan 06 16:18:34 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"We were excited and anxiously waiting for the certification process to begin. https://t.co/4wVcSXTC9H","date":"Thu Jan 06 16:13:04 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My first post to my friends @911LAPD #January6thInsurrection https://t.co/Se2hhmdjTp","date":"Thu Jan 06 16:08:31 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"How it started. #January6th https://t.co/T1WrBhN1oT","date":"Thu Jan 06 16:00:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Feliz Día de Los Reyes Magos. #ThreeKingsDay https://t.co/sVIvLmM860","date":"Thu Jan 06 15:38:01 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"My statement on the anniversary of January 6th. https://t.co/jTMmXaoKlw","date":"Thu Jan 06 15:04:45 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I had the pleasure of meeting the winners of this year’s #CA35 App Challenge who impressed us with their submissions, “Bus Tracker” and “Stop &amp; Think.\" These students and their teachers at Lorbeer Middle School are inspiring the next generation of leaders in STEM. https://t.co/DupbiORutu","date":"Thu Jan 06 01:53:12 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Not. Good. Enough!","date":"Wed Jan 05 22:45:13 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"LA County residents who have symptoms or may have been exposed to #COVID19 can receive a free at-home test kit. Learn more and request a kit at https://t.co/107tma4Ca4.","date":"Wed Jan 05 19:12:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I toured Planned Parenthood in Upland to learn more about the crucial reproductive care and services they are providing to our community. https://t.co/9Iuq9fI3zu","date":"Wed Jan 05 17:16:48 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Earlier this week, members of the Claremont Islamic Center met with me to discuss pressing issues facing the community. I always appreciate the opportunity to talk and learn more about how to best serve #CA35. https://t.co/aeRa6lHgpm","date":"Wed Jan 05 14:27:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Stan Smith, VP of Related California, coordinated a site tour for me of the Bloomington Phase 3 affordable housing units. I will continue to advocate in Congress for federal funding for housing needs in the #InlandEmpire. https://t.co/qUat4kKRPo","date":"Wed Jan 05 02:26:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"I had the opportunity to receive an update from the Executive Board of the Baitul Hameed Mosque in Chino—the largest mosque in Southern California. I'm thankful to the @alislam community for their work promoting human rights around the world. https://t.co/SG29NXGekp","date":"Wed Jan 05 00:25:00 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Yesterday I checked in with Rami Asad and Abdual Ahad from @arrahmanislamic in Fontana. During the pandemic, Ar-Rahman Islamic Center distributed groceries to families in need and helped senior citizens get medication. https://t.co/4tRUk0WsXW","date":"Tue Jan 04 22:04:15 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Booster shots are now recommended for children 12 and older. An additional vaccine shot has been proven to provide extra protection against the #omicron variant - make an appointment at https://t.co/PYTdGyeoaz.","date":"Tue Jan 04 18:09:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you @RepSusanWild for sending me 2 COVID test kits all the way from PA. https://t.co/sNizNbCTyS","date":"Tue Jan 04 04:05:29 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"This COVID surge, which is closing schools and keeping many people home from work, further shows the importance of extending the #ChildTaxCredit, which has helped lift millions of children out of poverty. https://t.co/2S83T1IW30","date":"Mon Jan 03 21:48:51 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"It's important to get #COVID tested as #omicron surges and we return from holiday travel and gatherings. Find a testing site near you at https://t.co/JPUDYhjr2W","date":"Mon Jan 03 19:40:08 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you for sharing your story @RepDean. I don’t know if I will have the courage to get on a plane this week but I’m sending you a big hug 💜 from #California #January6 https://t.co/kHT7cVuUoH","date":"Mon Jan 03 19:18:52 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":".we will never forget their actions/statements that lead to a violent attack on our democracy","date":"Mon Jan 03 19:17:06 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Wishing everyone a safe &amp; Happy New Year 🎆 Let’s make it a great one.","date":"Sat Jan 01 03:21:33 +0000 2022","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today marks the 25th anniversary of Guatemala’s peace accords. The deterioration of rule of law &amp; attacks against those fighting for human rights, reconciliation, &amp; accountability are a setback, but I remain committed to fighting for justice &amp; a better future for the country.","date":"Wed Dec 29 20:33:37 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m glad the U.S. State Department and Treasury have taken action to sanction some of these individuals, but our work here is not done, and we can’t lose sight of how the Salvadoran people are suffering due to this government’s corruption and anti-democratic actions.","date":"Wed Dec 29 02:25:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"This reporting confirms what we already knew: Bukele is making secret pacts with violent gangs while shutting down investigations into his corrupt and dangerous dealings.","date":"Wed Dec 29 02:24:56 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m proud to live in a state that recognizes the importance of the Voting Rights Act, and works to ensure communities that have historically been discriminated against have the opportunity to make their voices heard in elections.","date":"Wed Dec 29 00:49:04 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the Commissioners and the Commission staff who devoted countless hours to this process. I think the result accurately reflects our diverse state &amp; appropriately recognizes that Latinos drove the growth in our state over the last decade. https://t.co/zMpnzmpq0P","date":"Wed Dec 29 00:48:41 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Merry Christmas! I hope whoever you are with and however you are celebrating, you find joy and peace today.","date":"Sat Dec 25 19:31:50 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m proud that @ChinoValleyUSD will receive $1M from @DOJBJA’s STOP School Violence Program that provides resources, including evidence-based anti-bullying training, to students and teachers to prevent and respond to violence at school. https://t.co/bkF6hrts6F","date":"Thu Dec 23 02:47:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Shoutout to #LogansCandies in @CityofOntario for being highlighted this holiday season with @alroker. #MadeinCA35 https://t.co/C3Hw3c3Bqo","date":"Thu Dec 23 00:46:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"We have already seen vaccine requirements work with our school staff, I am thankful for this decision.","date":"Wed Dec 22 23:26:31 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The pandemic isn’t over – people are still facing crushing economic hardship. This is the right thing to do.","date":"Wed Dec 22 20:35:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Good news: The Ontario Montclair School Employees Federal Credit Union received nearly $600,000 from the @CDFIFund to continue its important work providing affordable and accessible financial products and support to the community. https://t.co/OHAhMbfqZM","date":"Wed Dec 22 18:09:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The omicron variant is now the dominant coronavirus strain in the U.S. Please get your booster shot and get tested before traveling and gathering this holiday season. https://t.co/j9HKQRjmgy","date":"Wed Dec 22 15:06:03 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"A huge thank you to @LACareHealth and @BlueShieldCA for helping make this season more cheerful by providing fresh produce, groceries, hot chocolate, and toys for families in the @CityofPomona last Friday. https://t.co/OPMyhJKjKi","date":"Tue Dec 21 17:50:06 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the @pomonachamber for hosting their annual Holiday for Heroes lunch. Congratulations to all police officers, firefighters, and veterans who were honored for their commitment to public safety and the outstanding work they do for the Pomona community. https://t.co/KnfuvV2hcv","date":"Tue Dec 21 01:02:11 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Lucille, @RepRoybalAllard If the rumors are true, let’s just say I’m truly heartbroken 💔 I hope you can reconsider. You are an amazing leader &amp; an inspiration to many of us Latinas. Norma","date":"Mon Dec 20 22:51:12 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It saddens me to hear of the passing of Dr. Margaret Hill. She wore many hats—San Bernardino city school board member, retired administrator from the County Superintendent of Schools, author, &amp; friend and mentor to many. My condolences to her family during this difficult time. https://t.co/qsevs9P3il","date":"Mon Dec 20 21:31:23 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The U.S. has a critical role in strengthening democracy &amp; rule of law in the Northern Triangle. I'm proud to have included several measures in the #NDAA that will address root causes of migration from Central America &amp; advance our national security. https://t.co/AojXL2OtbU","date":"Mon Dec 20 15:09:31 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".Neither is birth control, AND abortion is healthcare!","date":"Mon Dec 20 01:12:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Awful, but not surprising. The previous administration has blood on their hands.","date":"Sat Dec 18 15:01:36 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to GOTZ Domestic &amp; Foreign Auto Repair on their grand opening and joining the @FontanaChamber. Welcome to our beautiful city! https://t.co/QlwgHXAX8t","date":"Fri Dec 17 21:52:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is the right decision, and long overdue.","date":"Fri Dec 17 17:01:40 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is devastating news for millions of immigrant families. The House has done our job - the Senate can’t continue to stand by and fail to pass immigration reform.","date":"Fri Dec 17 15:26:54 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you @RepLowenthal for your many years of service to our great state and nation. It’s been an honor to work with you. Congratulations on your retirement!","date":"Fri Dec 17 14:31:32 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Earlier this week, I was proud to vote to ban goods made with forced labor in China's Xinjiang Uyghur Autonomous Region. I'm thankful for my friend @RepMcGovern’s steadfast leadership to hold China accountable for human rights abuses including slave labor. https://t.co/ePM14rMlhK","date":"Thu Dec 16 23:04:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@LACareHealth Vengan MAÑANA a @LACareHealth en el centro comunitario en Pomona para un evento navideño de despensa gratis de alimentos y jugetes. https://t.co/X3kwa3j4Xz","date":"Thu Dec 16 17:45:03 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Join @LACareHealth TOMORROW at the Community Resource Center in Pomona for a holiday food pantry and toy giveaway. https://t.co/OoAjXsEKsG","date":"Thu Dec 16 17:44:36 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"35 million families, including 80,000+ in #CA35, will receive a final #ChildTaxCredit payment today. The Senate must pass #BuildBackBetter to extend these payments that have helped lift millions of kids out of poverty. https://t.co/yUOAysaGfX","date":"Wed Dec 15 23:44:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Coronavirus infections are rapidly rising in California. It’s more important than ever to get vaccinated, get boosted, and follow the state mask mandate.","date":"Wed Dec 15 21:43:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Islamophobia and bigotry are unacceptable across the world, across the country, and here in Congress. That's why I voted for legislation led by @Ilhan and @janschakowsky to create a special envoy to monitor and combat Islamophobia. https://t.co/meDAv4ecG6","date":"Wed Dec 15 19:22:50 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"These storms are causing dangerous flooding, mudflow, and debris. Please travel safely, and check @NWSLosAngeles for latest updates. https://t.co/z7HY6FCMFk","date":"Tue Dec 14 23:42:21 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Please continue to do your part to protect your neighbors and stop the spread, and we will continue to do everything we can in Congress to finally end this pandemic and help our nation recover.","date":"Tue Dec 14 23:10:29 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today I joined my colleagues for a moment of silence in recognition of the 800,000 Americans we have lost to COVID-19. This is a heartbreaking death toll, especially knowing how many of these losses could have been prevented.","date":"Tue Dec 14 23:09:46 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"A great resource for job seekers in Fontana:","date":"Tue Dec 14 20:53:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Nine years ago 20 first-graders and six educators were murdered in a despicable and preventable act of violence at Sandy Hook Elementary School. Today we mourn their loss, and stand resolved in our fight to pass gun safety legislation and end senseless violence in America.","date":"Tue Dec 14 19:32:16 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s clear why Mark Meadows doesn’t want to cooperate with the Jan. 6 investigation. He should be held in contempt like Steve Bannon and everyone else who is responsible for orchestrating the domestic terror attack and this attempted cover-up. https://t.co/qi24AuNV3q","date":"Tue Dec 14 14:45:37 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"This is devastating. My thoughts are with the victims and their families.","date":"Tue Dec 14 03:10:09 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thanks for giving back to our communities, especially now during the holiday season when many people need it the most. https://t.co/X1GjXUxzS2","date":"Mon Dec 13 22:00:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I had a great weekend at the Christmas parades in Chino, Fontana, and my hometown of Pomona! I hope everyone who joined us had a great time celebrating. https://t.co/FYEY67882Q","date":"Mon Dec 13 20:19:25 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the Montclair Chamber of Commerce for hosting the Holiday Food &amp; Toy Drive last week! Your generous donations will help families and children in need and bring them joy this holiday season. https://t.co/ERe5dw2emR","date":"Mon Dec 13 16:50:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great news – congratulations to UC student researchers.","date":"Mon Dec 13 14:21:58 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".Despertando este frió domingo con esta triste noticia. Le mando un fuerte abrazo a su familia y aficionados amantes de sus canciones rancheras. Que sigan sus conciertos en el cielo. #VicenteFernandez","date":"Sun Dec 12 17:20:22 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@CityofFontanaCA Christmas Parade https://t.co/NbB7WLdgok","date":"Sat Dec 11 19:07:03 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Join me at the @CityofChinoGov Christmas Parade https://t.co/a9cDBlV3N3","date":"Sat Dec 11 16:43:13 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".What a difference a year makes. Thank you @FLOTUS","date":"Sat Dec 11 00:30:11 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today is the LAST DAY to apply for my Youth Advisory Committee – a great opportunity to gain leadership experience, meet fellow civically engaged peers, and learn more about our local economy.  https://t.co/WyORgB689T","date":"Fri Dec 10 14:53:18 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m saddened &amp; frustrated by the loss of innocent lives. Prayers for the families involved in this tragic incident.","date":"Fri Dec 10 01:57:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #ChildTaxCredit has delivered $249 million in tax cuts for 80,000 hard-working families in the #InlandEmpire. Our country is strongest when we invest in our families and children. https://t.co/zF9bY4cWhz","date":"Fri Dec 10 01:24:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I'm proud to advocate for funding for the Second Chance Act, which makes programs like these possible, because we know education is crucial to inmate rehabilitation and success.","date":"Thu Dec 09 22:32:40 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Good news: @CalStateLA will bring a Bachelor’s Degree program to the California Institution for Women with a $900K award from @TheJusticeDept under the Second Chance Act. https://t.co/lMwr8W6ZgH","date":"Thu Dec 09 22:25:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"For many tribes, the American buffalo are more than majestic animals, they’re integral to tribal history &amp; culture. I’m proud to work with @repdonyoung on this effort to give back ownership to Native Americans of this crucial part of their lives &amp; culture. https://t.co/seRQFn9ZQU","date":"Thu Dec 09 20:19:07 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations, and welcome! We are lucky to have you, @RepShontelBrown and @RepNikema.","date":"Wed Dec 08 23:54:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was a pleasure helping @chaffeycollege veterans apply for their Veteran ID cards. Thanks to all the students who participated! https://t.co/w5Qadoy90n","date":"Wed Dec 08 23:22:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Join @LACareHealth at the Community Resource Center in Pomona for a free food pantry, COVID vaccines, and more this Friday. https://t.co/6AYVJP8wXu","date":"Wed Dec 08 21:21:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@StateDept @USTreasury I am glad to see sanctions for Luna, Marroquin, and Meza in El Salvador, who have been meeting and negotiating with MS-13 and Barrio 18 gang leaders on behalf of the Salvadoran government. We can't have partners who work hand-in-hand with violent criminals.","date":"Wed Dec 08 20:58:55 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It is our responsibility to ensure our foreign aid is not being used by corrupt leaders to perpetrate human rights abuses. This year I fought for funding for @StateDept &amp; @USTreasury to crack down on such abuses - I'm glad to see progress on this front. https://t.co/uyQnZ7zMZO","date":"Wed Dec 08 20:58:32 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The youth mental health crisis in America is an urgent problem that requires an urgent response. Thank you @Surgeon_General for your leadership in this effort to ensure our children receive the support they need. https://t.co/zYAEzqYXOF","date":"Wed Dec 08 19:05:22 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The COVID-19 vaccine – including the booster shot, when eligible – is your best defense against this virus. Find a vaccine clinic near you and make an appointment at https://t.co/PYTdGyeoaz.","date":"Wed Dec 08 14:28:45 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m disappointed that my Munitions Exports Amendment with @RepKatiePorter was removed from the FY22 #NDAA. This exacerbates the plague of gun violence we face here at home &amp; is a threat to our national security. I’ll continue fighting for more oversight of our firearms exports. https://t.co/EoAbjAcncE","date":"Wed Dec 08 02:40:14 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you for your service, Petty Officer 3rd Class Anthony Urbina. You are making Ontario proud! https://t.co/jp6KVWF9eE","date":"Tue Dec 07 19:05:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Donating blood saves lives.","date":"Tue Dec 07 17:31:51 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today we remember the 2,300 servicemembers who lost their lives 80 years ago in #PearlHarbor, and continue to honor the millions of servicemembers who answered the call to serve in the days and years that followed. https://t.co/841MPtBHg3","date":"Tue Dec 07 14:31:58 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Rest In Peace Dad. I will always love you!🙏🏼😪 https://t.co/1tPzxIMUxF","date":"Mon Dec 06 19:38:14 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".There is zero defense in their failure to send backup to our brave @CapitolPolice! Cowards continue to coverup their incompetence. I can only imagine the stupid look on their faces as they sat on their hands watching &amp; listening to the unforgettable calls for help..5hrs","date":"Mon Dec 06 18:03:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Unfortunately, many of my Republican colleagues refuse to do the bare minimum – to fight this pandemic, to do their jobs, or to do anything in service to the American people. But they don’t like to be reminded of that.","date":"Mon Dec 06 17:13:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Climbing to 30K feet listening to Abba Take a Chance on Me! I get a little nervous on the way, fast music helps me relax.","date":"Mon Dec 06 17:08:30 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Wake up alarm going off every 30 mins since 4 am 🤬. Is this another failure of an #AppleUpdate","date":"Mon Dec 06 16:20:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great to join @House_Democracy to speak about legislators’ role in curbing corruption and kleptocracy. It is our duty to use our positions to uphold democratic institutions and lay the foundations for free and fair societies. https://t.co/Bfh6YMkJWw","date":"Mon Dec 06 15:50:48 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Join me now at the #ChristmasParade in the @CityofRialto 🎄 https://t.co/15vzZ8JFO3","date":"Sun Dec 05 01:46:19 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@TomColeOK04 These lands belonged to Native and Indigenous Peoples long before us. But today, these communities often face countless challenges to economic prosperity and independence. It is our responsibility to create opportunities that will allow Indigenous Peoples to grow and prosper.","date":"Fri Dec 03 20:01:28 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I introduced the Indigenous Peoples Exchange and Economic Cooperation Act with my colleague @TomColeOK04 to help create pathways to success for Native communities through investment, trade, and entrepreneurship. https://t.co/RjssVcX55C","date":"Fri Dec 03 20:01:10 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m proud to join @SpeakerPelosi to sign this #CR and avoid a government shutdown, however, Republicans must now come to the table to negotiate a full year government spending deal so we can deliver critical funding and programs to the American people. https://t.co/H25noxdQV2","date":"Fri Dec 03 15:43:16 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @CSUSBNews for hosting a #DayofRemembrance to commemorate the 6th anniversary of the San Bernardino terrorist attack - today we remember the victims and families of those lost in this tragedy and honor their memories. #SBStrong https://t.co/wU1TkpgUKC","date":"Fri Dec 03 01:06:06 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the @SBCountyMuseum for hosting the special exhibit about the upcoming “Curtain of Courage” Memorial, which will honor the lives of the fourteen victims of the San Bernardino terrorist attack. https://t.co/jX3VP0I13G","date":"Thu Dec 02 22:50:42 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #COVID19 crisis is an acute example of why strong supply chains are so critical, but this isn’t just important in times of emergency. When we can spot supply chain weaknesses before they reach American consumers, our entire economy is more stable. https://t.co/yDtXhJwUwY","date":"Thu Dec 02 22:09:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The resources for jobseekers that we shared last night are all available on my website at https://t.co/RQWrrkMoDR.","date":"Thu Dec 02 19:44:41 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last night I held a telephone town hall to discuss the jobs and crucial upgrades the Bipartisan Infrastructure Deal will bring to #CA35. It was great to hear directly from Inland Empire residents - thank you to everyone who joined the conversation. https://t.co/TsALaXkU2z","date":"Thu Dec 02 19:38:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today we remember the 14 victims who were killed and 22 who were wounded in the San Bernardino terrorist attack six years ago. As we honor their lives and memories, we reaffirm our commitment to rooting out hate and violence in our communities.","date":"Thu Dec 02 18:47:47 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to Tommy’s Express Car Wash in Montclair for hosting today's @RedCross blood drive, and thank you to everyone who donated. Your generosity will help end our nation's blood shortage and give a fighting chance to those in need. https://t.co/lYz93RtsvO","date":"Thu Dec 02 02:32:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#TeamTorres attended the ribbon cutting ceremony yesterday for Bloomington Grove Phase III - It is heartwarming to hear stories from residents like Celeste about the opportunities that #affordablehousing is providing her and her family. https://t.co/Zkecw70Iyj","date":"Thu Dec 02 01:41:45 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to Inland Valley @HopePartners for your Giving Tuesday initiative that will provide valuable resources for Pomona residents. Your commitment to the well-being of our community is to be commended. https://t.co/RwymA1H1Fi","date":"Wed Dec 01 23:35:54 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I look forward to working with president-elect @XiomaraCastroZ to fight corruption, strengthen the rule of law, and help provide opportunities for all Hondurans.","date":"Wed Dec 01 21:42:28 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to the Honduran people, who showed up in historic numbers to exercise their democratic right to vote, and to everyone - from civil society to the candidates - for ensuring the election was free, fair, and peaceful.","date":"Wed Dec 01 21:42:15 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thankful for this ruling that will help keep deadly weapons off the streets. This will make us all safer.","date":"Wed Dec 01 18:29:52 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today the Supreme Court is hearing the most consequential abortion rights case in generations. We are here to remind everyone that #AbortionIsEssential and we must protect a woman's right to choose. https://t.co/MzNLUl2nhT","date":"Wed Dec 01 16:13:07 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m so proud to represent you, thank your for feeding our kids!","date":"Wed Dec 01 02:18:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Vaccines continue to be the most effective protection against #COVID19. Protect yourself and your community - get vaccinated. https://t.co/XKI4a0SdFO","date":"Wed Dec 01 01:49:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Join me TOMORROW at 6 PM PST for a tele-town hall to learn more about what is in the #BipartisanInfrastrucureDeal and how it benefits our communities. Register and submit questions at https://t.co/D54hVTZCn4. https://t.co/cgQhjJwDZl","date":"Tue Nov 30 23:49:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Good news – thanks to the PAWS for Veterans Therapy Act more veterans are now eligible for support from service dogs🐾","date":"Tue Nov 30 17:27:23 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"🏫 High school students: Submit your application to join my Youth Advisory Committee – a unique opportunity to gain leadership experience and learn more about industry and policy in #CA35. Get more info and apply at https://t.co/WyORgB689T.","date":"Tue Nov 30 14:16:03 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"🇺🇸 sigue salvando vidas en Guatemala!","date":"Mon Nov 29 22:44:57 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s important to do everything you can to protect yourself and your loved ones as we celebrate the holidays – especially given the new #OmicronVariant. All adults are now eligible to receive a #COVID19 booster shot – schedule yours today. https://t.co/PYTdGyeoaz","date":"Mon Nov 29 18:15:26 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I had the honor of meeting Ms. Carreon who came to my office for assistance processing her 2020 federal tax return with the IRS. Our office helped her receive her refund - totaling more than $9000 - in less than a month. #CaseworkSuccessFriday https://t.co/SmSlzeWWow","date":"Fri Nov 26 18:49:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Happy Thanksgiving! I hope everyone who is able to gather safely enjoys time with family and friends.","date":"Thu Nov 25 18:45:34 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"When we support American workers, we see great results. Grateful for this positive news a day before Thanksgiving!","date":"Thu Nov 25 01:37:57 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"55 MPH #HighWindWarning 🙏🏼🙏🏼 for all the truckers driving through the IE tonight.  💨","date":"Thu Nov 25 01:10:51 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @EastValleyCHC in Pomona for giving me a tour of your facilities and for providing #COVID19 vaccines to our community. All adults are now eligible to receive a booster shot - schedule yours ASAP to prepare for the holiday season. https://t.co/SBzhvvC8hu","date":"Wed Nov 24 23:48:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Shalanda Young’s expertise and experience on @AppropsDems will make her an excellent OMB Director. I look forward to her leadership and continuing to work together. Congratulations Shalanda! https://t.co/mB0cMYkx32","date":"Wed Nov 24 23:36:09 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Join me next Wednesday, Dec. 1 for a tele-town hall to discuss the benefits the #BipartisanInfrastructure deal will bring to the Inland Empire. Register and submit questions at https://t.co/eQfeyMKKGO https://t.co/dXzTnkdM5h","date":"Wed Nov 24 20:42:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"IMPORTANT: @SCE may temporarily shut off power at various times between this afternoon through Friday afternoon due to strong winds and threat of wildfire. See updates and view impacted areas at https://t.co/XuPJuUogZ0.","date":"Wed Nov 24 17:21:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@RepSires @luisguillermosr We encourage @OAS_official to engage closely with civil society groups across the political spectrum, urge patience among the population in waiting for the election results, continue to condemn acts of violence, and work with credible voices to mitigate tensions.","date":"Wed Nov 24 16:13:38 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".@RepSires and I wrote to @luisguillermosr, Chief of the Organization of American States (OAS) Electoral Observation Mission to Honduras, about the critical role of credible, independent voices. https://t.co/KZVHKpFNAT","date":"Wed Nov 24 16:13:08 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was a pleasure to team up with Fontana Water Company for Operation Gobble, which helps provide turkeys to families in need. https://t.co/pPdJBSBp4Y","date":"Wed Nov 24 15:11:07 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Americans born abroad are still Americans. April from Fontana could not get a REAL ID because the DMV did not recognize her State Department-issued Panama Canal Zone Birth Certificate. My staff helped her obtain a U.S. Passport which she later used to finally get her REAL ID. https://t.co/F75u7XkEQh","date":"Tue Nov 23 23:00:01 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to all those who check in on and care for senior citizens during the holidays.  My team delivered turkeys and pies to senior centers in the Fontana and Rialto areas to make the holidays a little brighter. https://t.co/qZ5hcXlO53","date":"Tue Nov 23 21:59:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".@RepMcGovern and I are encouraging the Salvadoran legislature to table the current draft proposal, continue its process of review, and work with civil society and NGOs on better ways to advance transparency and civic engagement.","date":"Tue Nov 23 20:25:58 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The draft law on foreign donations to Salvadoran NGOs and non-profits would result in closing down scores of programs that directly benefit the Salvadoran people and projects that promote democracy, defend human rights, and advance citizen participation. https://t.co/C7yKWxHFua","date":"Tue Nov 23 20:25:39 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations Northtown Community Center on receiving a $25,000 donation from UPS Foundation to continue providing valuable resources to the residents of the #InlandEmpire. https://t.co/0JnIK0HTRH","date":"Tue Nov 23 19:12:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#TeamTorres joined the Southwest Council of Carpenters Local 909 annual Thanksgiving Luncheon. Thank you to all those who use their talents and work hard to maintain our bridges, buildings, and freeways - I am looking forward to the #BIF funding that will support your work! https://t.co/yhTtXpwO0r","date":"Tue Nov 23 17:11:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@USDOL 📞\n909-204-3773 \n1-866-4-USWAGE \n(1-866-487-9243)\n💻\nhttps://t.co/k4VPDihjGO","date":"Tue Nov 23 17:05:54 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"All workers should be paid fairly and safe on the job. If you work in the #InlandEmpire and have a labor violation to report, contact our local @USDOL:\n\nU.S. Department of Labor\nWage and Hour Division\n3350 Shelby Street\nSuite 340\nOntario, CA 91789-4884","date":"Tue Nov 23 17:04:44 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Special thanks to Dr. Vo from the Vietnamese Community of Pomona Valley for organizing the annual Thanksgiving food drive. https://t.co/u9e8Bu8I5N","date":"Tue Nov 23 15:14:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The Central America Caucus was pleased to host @USAmbOAS last week to discuss the troubling developments in Nicaragua, concern about the new anti-NGO law in El Salvador, and upcoming elections in Honduras. https://t.co/BsFnhdIqDr","date":"Tue Nov 23 13:14:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Back in 2005, when my family &amp; I were victims of a home fire, LACF saved my family &amp; pets. This morning I had the opportunity to talk to them more about the measures our firefighters are taking to combat our unprecedented wildfires &amp; protect people from commercial &amp; home fires. https://t.co/2K00zIxo3c","date":"Tue Nov 23 12:03:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"This weekend my team attended the grand opening of the Anthony Munoz Community Center in Ontario, where families can participate in recreational activities and learning opportunities. https://t.co/ycBp4Mu0y4","date":"Tue Nov 23 01:48:33 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Prayers for the innocent victims of this horrific event. 🙏🏼😪","date":"Mon Nov 22 02:46:40 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hope everyone is OK.","date":"Sat Nov 20 19:48:10 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"We must continue to work together every day to fix this broken system and ensure all Americans are granted justice and equality under the law. You can make a difference - by serving jury duty when you are called, by voting, and by speaking out against injustice in your community.","date":"Fri Nov 19 21:28:38 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our country is already facing a crisis of gun violence and racist attacks, and this decision sends a clear message to future right-wing vigilantes that they can carry out such violence with impunity.","date":"Fri Nov 19 21:28:18 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My thoughts and prayers are with the families of these victims. This verdict clearly indicates our criminal justice system is full of people like this judge, whose priority is not to carry out justice under the law, but according to his own personal beliefs.","date":"Fri Nov 19 21:27:50 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I made it to the airport 🤞🏼 I make it home without too many delays. I can’t wait to visit all the pre-k students that will now have access free of charge. https://t.co/V7j6qNgM2D","date":"Fri Nov 19 17:58:25 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Combined with #BipartisanInfrastructure, this investment will create 1.5 mil. new, good-paying American jobs per year. This is exactly the foundation we need to recover from this pandemic stronger than ever before &amp; I’m proud to vote to bring this support to the people of #CA35.","date":"Fri Nov 19 14:49:23 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"This bill will cut costs &amp; help people get back to work, so parents don’t have to choose between paying rent &amp; putting food on the table. It also extends the #ChildTaxCredit, which benefits 167,000 children in my district alone, &amp; will lift 4.5 million kids out of poverty.","date":"Fri Nov 19 14:48:32 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hardworking Americans built this country – we need to build an economy that gives them a fair shot. #BuildBackBetter finally delivers for working families with historic investments in universal free pre-k, childcare, quality health care, affordable housing, &amp; higher ed.","date":"Fri Nov 19 14:47:28 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My ✈️ boards in 6 hours but that’s OK, I have a back up flight. We will pass #BuildBackBetter when the gibberish ends! Stay with us. #ForThePeople","date":"Fri Nov 19 04:43:49 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Kevin is hoping he will bore you to sleep because he doesn’t want you to see him &amp; his caucus vote against you. https://t.co/3aqIY9hhcy","date":"Fri Nov 19 05:24:27 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thanks for the flan @RepEspaillat https://t.co/7d1WAYWICS","date":"Fri Nov 19 05:15:55 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".@GOPLeader Dr. Seuss called, he said no more Green Eggs &amp; Ham for you.  Let’s vote! #ForTheProple","date":"Fri Nov 19 05:06:22 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My ✈️ boards in 6 hours but that’s OK, I have a back up flight. We will pass #BuildBackBetter when the gibberish ends! Stay with us. #ForThePeople","date":"Fri Nov 19 04:43:49 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"There’s no magic in denying hard working families the relief they need @GOPLeader. Babble all you want, we will vote and deliver for our families. #BuildBackBetter     \n#ForThePeople","date":"Fri Nov 19 04:31:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hard working families 1st! #BuildBackBetterAct","date":"Fri Nov 19 00:35:27 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #ChildTaxCredit is projected to lift 4.5 million children out of poverty. We must pass #BuildBackBetter to extend the #CTC. https://t.co/2cjivKXpv4","date":"Thu Nov 18 21:04:25 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#InlandEmpire residents spend hours on the road getting to and from work. Under #BipartisanInfrastructure California will receive $25+ billion for highways and $4+ billion for bridge replacement &amp; repair. This investment will help make commutes safer and more efficient.","date":"Thu Nov 18 19:20:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"A great sign, and a clear indication that Americans want to work when given access to the necessary skills and good-paying jobs.","date":"Thu Nov 18 17:17:30 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"2020 was the worst #wildfire year on record, with more than 4M acres burned in CA, &amp; 2021 is on track to surpass it. I introduced the Wildfire Grid Resiliency Act to help develop new technology for responding to wildfire-related electric grid emergencies. https://t.co/R48ztyZQnU","date":"Thu Nov 18 16:09:33 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great to meet with @GCastellanosL about the important work @cnahonduras is doing to fight corruption in Honduras. Civil society is vital to upholding the rule of law. https://t.co/QaEUkj9avc","date":"Thu Nov 18 00:45:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"He made himself the face of a violent terror attack against our democracy. It’s a shame it isn’t longer.","date":"Wed Nov 17 22:53:26 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was out of this world to meet with Pomona native @AstroVicGlover today. Earlier this year, Astronaut Glover held a virtual town hall for #CA35 students while aboard the @Space_Station. Thank you for all you do for our country and for being an inspiration to our kids!💫🚀 https://t.co/i6qOdXCnbc","date":"Wed Nov 17 22:19:12 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Members of Congress should not face intimidation while doing their jobs, especially from colleagues on the other side of the aisle. There must be real consequences for these actions.","date":"Wed Nov 17 21:39:57 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Violence against women and violent threats in the work place cannot be tolerated anywhere – and Congress is not an exception. I voted to censure Paul Gosar because we must make it clear that his violent threat against a female member of Congress is completely unacceptable.","date":"Wed Nov 17 21:39:46 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#BuildBackBetter won’t add to inflation – in fact, it will do the opposite and cut costs for families. https://t.co/9i0LQT5LL6","date":"Wed Nov 17 18:26:26 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"REMINDER: The Pfizer vaccine is available at @WesternUNews every Friday from 1 – 3 PM for anyone 12 years and older. Citizenship, ID, and medical insurance are not required, and walk-ins are welcome. For more info, see https://t.co/s60NNi6Oce.","date":"Wed Nov 17 02:07:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you @RepHoulahan for the Pennsylvania mushroom soup! Safe to say my team and I enjoyed it. https://t.co/n3vAaneSdm","date":"Wed Nov 17 00:55:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"That’s why earlier this year I introduced the Fair Transportation Act to ensure @USDOT funds are distributed equitably by federal, state, &amp; local entities. https://t.co/2sFeIaUFhy","date":"Wed Nov 17 00:15:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Infrastructure can be used to empower &amp; uplift vulnerable communities, or further marginalize them. We must make sure #BIF funds do the former. https://t.co/L4guyrFyFU","date":"Wed Nov 17 00:08:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you Mayor @AcqieWarren for your partnership and advocacy on behalf of the @CityofFontanaCA. I’m looking forward to the development we’ll see in #CA35 thanks to the #BipartisanInfrastructureDeal. https://t.co/pd0hqkU882","date":"Tue Nov 16 23:07:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you for your many years of service to our great state &amp; country @RepSpeier. And thank you for giving me a soft landing when I was elected  to congress and didn’t have a place to live.","date":"Tue Nov 16 22:06:05 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@DeptVetAffairs Our nation is safer and stronger when we care for our veterans and ensure they receive all the benefits they earned during their service and sacrifice to our nation.","date":"Tue Nov 16 15:07:01 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@DeptVetAffairs I also reintroduced the GI Bill Distance Learning Improvement Act, which will expand access to education opportunities for GI Bill recipients by providing funding for students to purchase the technology necessary to enroll in online education.","date":"Tue Nov 16 15:06:51 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last week, I introduced the Veterans Administration Backlog Accountability Act, which will require @DeptVetAffairs to address its overwhelming backlog of disability compensation claims, ensuring veterans can more promptly receive their disability pay. https://t.co/M1nDtZSbJQ","date":"Tue Nov 16 15:06:40 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Nuestro compromiso es seguir salvando vidas en #Honduras. #JuntosContraElCovid19 👇🏻","date":"Tue Nov 16 02:19:52 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I talked with @SecretaryPete today at the @WhiteHouse and invited him to visit #CA35 for a firsthand look at our infrastructure challenges, including warehouse space and shipping truck traffic. https://t.co/7sFgS14n1S","date":"Mon Nov 15 23:50:59 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"With @GovMLG and @RepCarbajal as President Biden prepares to sign our once-in-a-generation investment in American workers. #BipartisanInfrastructure https://t.co/inplg0xnyz","date":"Mon Nov 15 21:20:29 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"On the way to the @WhiteHouse for the signing of the historic #BipartisanInfrastructureDeal! https://t.co/SaYGCPqF4n","date":"Mon Nov 15 19:17:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"El #CreditoTributarioPorHijo está cambiando vidas en nuestro país. Si no ha presentado impuestos en los últimos dos años, hoy es el ÚLTIMO DÍA para registrarse para unirse a los 61 millones de familias que reciben este dinero en https://t.co/Mp1Ia1ZwZQ.","date":"Mon Nov 15 17:25:46 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #ChildTaxCredit is changing lives in our country. If you haven't filed taxes in the last two years, today is the LAST DAY of 2021 to register to join the 61 million families receiving the #CTC check at https://t.co/Mp1Ia1ZwZQ.","date":"Mon Nov 15 16:02:28 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I agree, it’s a great list 👍🏼to help build a better future for our families.  His priorities 👎🏼 https://t.co/wJTNt0gIm3","date":"Sun Nov 14 21:52:45 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Every Californian age 18+ who has been fully vaccinated is eligible for a booster shot. Find a clinic near you and schedule an appointment at https://t.co/a5EYialzta","date":"Sun Nov 14 16:42:12 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Se espera que el #CreditoTributarioPorHijo reduzca la pobreza infantil en CA en un tercio. Solo quedan dos días para que los no declarantes se registren para recibir estos fondos cruciales. Compruebe su elegibilidad y regístrese @ https://t.co/Mp1Ia1ZwZQ antes del 15 de noviembre","date":"Sat Nov 13 20:57:34 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #ChildTaxCredit is expected to reduce childhood poverty in California by one-third. There are only two days left for nonfilers to register to receive these crucial funds - check your eligibility and sign up at https://t.co/Mp1Ia1ZwZQ by Nov. 15.","date":"Sat Nov 13 20:55:46 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"In America, we believe no one is above the law. I hope this sends a message to the former president and his allies: you cannot stop us from uncovering the truth about what happened on Jan. 6.","date":"Sat Nov 13 00:41:22 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you @WHAAsstSecty for discussing our efforts to strengthen the rule of law &amp; democratic institutions in Central America, while supporting the brave actors who are doing this critical work in the region. https://t.co/MVYXhgLE2B","date":"Fri Nov 12 23:15:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"His #2 my #booster. @WesternUNews thanks for providing #COVID19 vaccines to my constituents @CityofPomona @PomonaUnified https://t.co/URGM8jLONC","date":"Fri Nov 12 21:08:26 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The Fed Small Business Credit Survey is open through Nov. 19 for all businesses with fewer than 500 employees. Don’t miss this opportunity to share feedback that will inform decisions impacting the future of #SmallBusiness: https://t.co/H9mrwgJCEq","date":"Fri Nov 12 19:40:05 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Next Monday, 11/15, is the last day for eligible non-filers to apply for the 2021 monthly CTC payments. Check if you are eligible and apply at https://t.co/Mp1Ia1ZwZQ.","date":"Fri Nov 12 15:03:28 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Celebrating #VeteransDay throughout #CA35. Thank you Fontana, Chino, and American Legion Post 30 in Pomona for honoring the courage, sacrifice, and bravery of our Veterans. https://t.co/DNeBAXO25N","date":"Thu Nov 11 23:40:45 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today we honor the brave men and women who have served our country - I hope this #VeteransDay you’ll join me in thanking our servicemembers for all they’ve done and continue to do to keep us safe. \n \nHappy Veterans Day! https://t.co/8A7MuOH117","date":"Thu Nov 11 22:34:35 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you CalRTA for stopping by my district office to share an update on the impacts of #COVID19 vaccines. Your support during these challenging times to return back to school amid a teacher/substitute shortage is greatly appreciated. https://t.co/JqBKpXVMNt","date":"Thu Nov 11 03:24:18 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Commander Murillo helps support our youth with the with scholarships and food drives. Thank you Commander Murillo for your service to #CA35 and our nation. https://t.co/mK6gVExSNh","date":"Thu Nov 11 02:15:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great meeting this morning with local labor leaders to discuss job training and how this money will benefit workers and assist with our economic recovery. https://t.co/OTZwRKKNrB","date":"Thu Nov 11 01:09:35 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last week, I voted to pass a Bipartisan Infrastructure Deal – this bill will help #CA repair and rebuild roads, improve public transportation options, provide reliable high-speed internet, ensure communities have clean drinking water, and create good-paying jobs.","date":"Thu Nov 11 01:09:32 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Happy birthday to the @USMC! Thank you for 246 years of service in defense of our country. https://t.co/STg7kJVgsM","date":"Thu Nov 11 00:07:31 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am honored to receive this Distinguished Award from @National_CORE! I will continue to advocate for affordable housing to ensure that everyone has the opportunity to achieve the American Dream. Congratulations to awardees! https://t.co/yhqgnfm2QA","date":"Wed Nov 10 21:18:16 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was great to meet Idannia, who came to my office for help with an I-601 waiver for her husband after a mistake in his initial interview. We contacted USCIS on her behalf to request a new interview with the U.S. Consulate in Ciudad Juarez, &amp; Idannia &amp; her husband were reunited! https://t.co/NFSPEC89Kb","date":"Wed Nov 10 03:37:10 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Sampling a nutritious meal like the one served to the students in #RUSD. Thank you to @rialtonutrition for the delicious pozole, salad, and fruit. https://t.co/pcwDHpo9Zx","date":"Wed Nov 10 00:19:41 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you @ABMillerHS for having me today as a keynote speaker to share my story as the only Central American serving in Congress. I always enjoy connecting with students in #CA35 and seeing first-hand how civically-engaged they are! https://t.co/5eIbfbdQ4K","date":"Tue Nov 09 21:54:13 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I had a great start to my day visiting Kelley Elementary’s Garden. Thank you for teaching the students at Kelley Elementary how to grow fresh fruits and vegetables. https://t.co/q8D5ZAv1zc","date":"Tue Nov 09 20:21:05 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Free flu vaccines and Pfizer #COVID19Boosters will be available tomorrow in the @CityofMontclair. Stop by the Montclair Community Center located at 5111 Benito Street from 10 a.m. – 2 p.m. to receive your vaccines to protect yourself and your loved ones!","date":"Tue Nov 09 04:49:15 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"On #NationalSTEMDay, we encourage students to explore career options in the fields of science, technology, engineering, and math! STEM occupations account for nearly 7% of all U.S jobs, and they play an important role in innovation and technology.","date":"Tue Nov 09 03:41:34 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It is inspiring to see #DREAMers achieve great things – Congratulations to Jocelyn Rivas for being the youngest person ever to complete 100 marathons!","date":"Tue Nov 09 01:30:25 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I love to see #CA35 youth enjoy public parks. \n\nCongratulations Discovery Park at The Preserves for your grand opening in the @CityofChinoGov. https://t.co/C5ZhPCM5z2","date":"Mon Nov 08 23:24:52 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Specialist Enrique Roman-Martinez was a hero, and we cannot let him be forgotten. His family deserves justice. https://t.co/t3qkw1QvqW","date":"Mon Nov 08 23:10:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Starting today in Los Angeles County, proof of vaccination is required to enter many businesses, venues, and other indoor spaces. You can get a digital copy of your vaccination record at https://t.co/JJcrPJBzv3.","date":"Mon Nov 08 21:21:36 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"After years without an ambassador, I’m thrilled to see @POTUS name a strong, experienced leader to represent the U.S. in Honduras. I’m looking forward to working with Ambassador Dogu.","date":"Mon Nov 08 19:03:09 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was great to attend Tradición Dance Company’s 11th Year Anniversary Celebration in Pomona today. Thank you to all the dancers and teachers for sharing Mexican dance and culture with the City of Pomona. https://t.co/a2PaPAj7bS","date":"Mon Nov 08 01:20:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you American Cancer Society for hosting the #RelayforLife in Fontana, uniting our community to remember those who have lost their battle to cancer and for supporting those currently fighting against cancer. https://t.co/H3cgRMBgCJ","date":"Sun Nov 07 23:13:41 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Happy Diwali to the BAPS in Chino Valley! https://t.co/FxNmvrfG5u","date":"Sun Nov 07 21:57:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @LACareHealth and Blue Shield for hosting a free Flu Shot Clinic for over 400 families. Your commitment to the health and well-being of the residents of the City of Pomona is to be commended. https://t.co/5S32ztLheH","date":"Sun Nov 07 18:12:39 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m proud to deliver this much-needed support to #CA35, and I look forward to the growth and development in the Inland Empire that will come as a result of this investment. Our communities and our country are stronger when we take care of our workers.","date":"Sat Nov 06 03:33:48 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#BIF includes money to protect against extreme weather, which people in #CA35 are all too familiar with. $3.5B for FEMA flood mitigation &amp; $3.4B+ for wildfire risk reduction will go toward protecting communities from the increasingly dangerous effects of climate change.","date":"Sat Nov 06 03:33:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"These funds will provide much-needed assistance for the thousands of people in the Inland Empire who are looking for work by connecting them to good jobs &amp; opportunities. They will also upgrade our roads &amp; bridges, &amp; expand transit options to make commuting safer &amp; easier.","date":"Sat Nov 06 03:32:40 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"A long-term, sustainable recovery from the coronavirus pandemic requires a strong economic foundation. The Bipartisan Infrastructure Bill establishes exactly that by prioritizing American workers and making historic investments in U.S. industry.","date":"Sat Nov 06 03:32:17 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Mr. Levin from Chino contacted my office for assistance because his tax refund was delayed. He received it promptly after my staff contacted the IRS on his behalf. If you need assistance with any federal agency, please call my office at (909) 481-6474. #CaseworkSuccessFriday","date":"Sat Nov 06 02:47:59 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My staff attended the groundbreaking ceremony for Ayres Hotel in Rialto today – I am excited to see the contributions that this development will bring in to the hospitality industry in #CA35. https://t.co/cHEEPrF8rE","date":"Sat Nov 06 00:49:57 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@HouseDemocrats @SenateDems there’s only one @POTUS and he’s it @JoeBiden. Keep the promise #AmericanJobs","date":"Fri Nov 05 20:19:45 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Hugely important initiative from @USAID. I have long advocated for our foreign assistance in the Northern Triangle to work directly with communities and local leaders. I look forward to continuing to partner with USAID on these efforts.","date":"Fri Nov 05 16:01:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"We've always known that's nonsense - people want to get back to work, but they need opportunities and access to education, training, and childcare. When we look out for our workers, America is stronger.","date":"Fri Nov 05 14:15:30 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"But according to Republicans, Americans don't want to work. https://t.co/u3V2ZMu4qC","date":"Fri Nov 05 14:15:06 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My staff assisted Fontana firefighters apply for their #VeteranIDCard today! If you’re a veteran in #CA35, and you need your #VIC, call my office at (909) 481-6474 to schedule an appointment. https://t.co/CUo7br5hSy","date":"Fri Nov 05 00:44:01 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Had a great meeting with Deputy Assistant Secretary of Defense for Western Hemisphere Affairs Daniel Erikson today to discuss bolstering regional security and express my concerns that our aid not be used against the people or to undermine our interests. https://t.co/1Q1VdHvR4K","date":"Thu Nov 04 23:49:32 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Prediabetes is a serious health condition affecting more than 1 in 3 U.S. adults. This #NationalDiabetesMonth, learn how to prevent and manage diabetes with the help of health professionals, family, friends, and community.\nhttps://t.co/TvRIiUucB7","date":"Thu Nov 04 23:21:35 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Only 16% of 3- and 4-year-olds in California have access to public pre-school. #BuildBackBetter will make high-quality pre-k available to nearly 850,000 kids, preparing them for future success in their education and allowing parents to get back to work.","date":"Thu Nov 04 22:19:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"After months of rigorous review, the pediatric #COVID19 vaccine has been approved for children ages 5-11. Starting TODAY, children can get vaccinated at @SBCounty sites. Visit https://t.co/SNA3nVjaG1 to schedule an appointment or call 909-387-3911.","date":"Thu Nov 04 21:45:32 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Welcome HASCO Outlet to the beautiful City of Montclair! It is great to see new businesses invest in our communities. https://t.co/JJWModcTPC","date":"Thu Nov 04 21:17:26 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I’m proud of @ChaffeyCollege for their perseverance through the #COVID19 pandemic – they were able to provide 3,100 computers to students, 1,000 Wi-Fi hotspots, and 3,866 degrees and certificates. #ReporttotheCommunity","date":"Thu Nov 04 20:45:39 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Wishing a happy &amp; safe Diwali to those celebrating in #CA35 &amp; around the world. The Festival of Lights is a time to celebrate light over darkness &amp; triumph over despair. As we celebrate, let us share light &amp; goodness with those around us, and look to the future with renewed hope.","date":"Thu Nov 04 19:30:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @OMSD_omsd for serving students in #CA35 USDA-approved nutritious &amp; delicious food!","date":"Thu Nov 04 18:41:14 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Un número récord de californianos tienen cobertura de salud, pero se estima que más de un millón no tienen seguro y son elegibles para recibir asistencia financiera. Vea sus opciones y aprenda cómo puede beneficiarse a través de @CoveredCA en https://t.co/hVbeC6ZgDT.","date":"Thu Nov 04 18:30:30 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"A record-high number of Californians have health coverage, but an estimated 1.1 million are still uninsured and eligible for financial assistance. Check your options and learn about how you can benefit through @CoveredCA at https://t.co/hVbeC6ZgDT. #GetCovered","date":"Thu Nov 04 18:29:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".Citizens want their vote to be counted! @LeaderMcConnell  stop vacillating and pass the #JohnLewisVotingRightsAct","date":"Thu Nov 04 18:06:34 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was great catching up yesterday with my friend and fellow Guatemalan, Ambassador Arreaga. https://t.co/CNUNQi0QFg","date":"Thu Nov 04 13:21:52 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s more important than ever to get your flu shot this season. I will be partnering with @LACareHealth this Saturday for a free Drive-thru Flu Shot Clinic – stop by Palomares Park in Pomona from 10am – 2pm to receive a flu shot and free gifts! https://t.co/y1D2OFaDUO","date":"Thu Nov 04 03:29:33 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to Dr. Shannon, Superintendent/President of @chaffeycollege, for being awarded the Distinguished Citizen Award from the California Inland Empire Council, Old Baldy District. Thank you Dr. Shannon for supporting our future generation of leaders. https://t.co/3rkpg2YMzS","date":"Thu Nov 04 02:20:44 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The average California family of four would save more than $27,000 annually in childcare costs under #BuildBackBetter. This investment is crucial to getting Americans back to work and getting our economy back on track.","date":"Thu Nov 04 01:37:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".@RialtoUSD hosted a great event yesterday to celebrate #DiaDeMuertos – they showcased cultural, spiritual and colorful traditions. Thank you to Dr. Delgado and the organizing committee at the Chavez-Huerta Center in Rialto for hosting a fun event for the kids! https://t.co/BZdZzE8WtL","date":"Thu Nov 04 00:51:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Children ages 5 to 11 can now start receiving the pediatric Pfizer vaccine – which is one-third of the dose given to adults, and has proven to be as safe and effective. https://t.co/Z3ZVXwkewX","date":"Wed Nov 03 21:38:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our democracy promises that everyone gets a vote, and every vote counts. The House has already passed the John Lewis Voting Rights Act to restore the protections of the VRA. Now the Senate needs to get it done.","date":"Wed Nov 03 18:17:18 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Since 2013 when the Supreme Court gutted the Voting Rights Act, we’ve seen states enact discriminatory voting restrictions to prevent some Americans - particularly minorities - from making their voices heard at the ballot box.","date":"Wed Nov 03 17:55:52 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".this from an accused sex trafficker. A #Disgusting individual who pays to have sex with little girls. Now speaking for #GOP #MoralValues","date":"Wed Nov 03 15:03:14 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great news: @CDCgov has officially announced the Pfizer vaccine is safe for children age 5 to 11. https://t.co/TTXNEyH9DB","date":"Wed Nov 03 14:46:18 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"On #VeteransDay, many businesses are giving back to those who served with free or discounted meals, services, and products. Visit https://t.co/XigSAcazGY for an up-to-date list.","date":"Wed Nov 03 01:15:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"A #VeteranIDCard is a form of photo ID #Veterans can use to get discounts without having to carry around their military discharge papers. My staff can assist veterans obtain their #VIC – RSVP for an appointment. \n\nhttps://t.co/fAwZJAwqXI https://t.co/DY4HUaSPcp","date":"Wed Nov 03 00:45:12 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"In four months, #CA35 has received $42M in #ChildTaxCredits - these advanced payments are crucial for families in the #InlandEmpire and I will continue working to make the #CTC permanent!","date":"Tue Nov 02 23:51:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Yo celebro el #DiaDeMuertos haciendo un altar con fotos de mis seres queridos para honrar su memoria.","date":"Tue Nov 02 22:25:04 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I celebrate #DayoftheDead by setting up an altar with pictures of my loved ones that have passed to honor their memories. https://t.co/yboM9AsNBX","date":"Tue Nov 02 22:25:03 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"No one should have to forgo life-saving medication because they can't afford it. I'm glad to hear we have an agreement to finally lower prescription drug costs and put patients before corporate profits.","date":"Tue Nov 02 21:23:38 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"VETERANS: The @valomalinda is now offering booster #COVID19 vaccines for Veterans, spouses, caregivers, CHAMP VA recipients, and employees. Call 909-825-7084 ext.6212 to schedule an appointment.","date":"Tue Nov 02 20:52:43 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".@FEMA has granted over $126M to help cover funeral costs to more than 19,000 California families who have lost a loved one to #COVID19. To apply for COVID-19 Funeral Assistance call (844) 684-6333, or visit https://t.co/Tk64C9wd4U for more information.","date":"Tue Nov 02 19:33:36 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@CoveredCA ❗El período de inscripción abierta de @CoveredCA para el 2022 ha comenzado. Para obtener información sobre las opciones y encontrar la cobertura adecuada para usted, visite https://t.co/hVbeC6ZgDT.","date":"Tue Nov 02 18:45:39 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"❗@CoveredCA's open enrollment period for 2022 has begun. To learn about options and find the coverage that's right for you, visit https://t.co/hVbeC6ZgDT. #GetCovered","date":"Tue Nov 02 18:44:59 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Operating our ports 24/7 without additional planning won't solve our supply chain issue, it will just shift the problems elsewhere. I'm working with state, local, &amp; federal partners to address these challenges now being faced by workers in our communities. https://t.co/gTlTLhPH66","date":"Tue Nov 02 16:58:53 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Es un dia para recorder y celebrar la vida nuestros seres queridos que nos han dejado. Como celebra usted el #DiadeLosMuertos?","date":"Tue Nov 02 16:25:53 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"A day to celebrate and honor the lives of our loved ones who have passed. How do you celebrate #DiadeLosMuertos? https://t.co/Eeu4fl9MeS","date":"Tue Nov 02 16:25:52 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to New-Indy Ontario for receiving a @ForestandPaper Sustainability Award. Thank you for your community leadership and commitment to protecting our planet.","date":"Tue Nov 02 01:17:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"With domestic travel at a new high and more international visitors, we can rest assured that our local economic growth will exceed pre-COVID expectations with our strong tourism, hospitality, and entertainment industries. https://t.co/h1LRtRzpzg","date":"Tue Nov 02 01:08:39 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Michael Krouse, CEO of the Greater Ontario Convention Center, announced exciting news of our booming tourism industry in the #InlandEmpired during their quarterly business report.","date":"Tue Nov 02 01:08:37 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"ATTENTION: Families can now update their income information using the Child Tax Credit Update Portal from the @IRS. Changes submitted by midnight tonight will be reflected in November payments. Visit the portal at https://t.co/cXkLTVSEFc.","date":"Mon Nov 01 23:51:52 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Such a heartbreaking milestone – 5 million people lost due to #COVID19 globally in less than two years. Get vaccinated, wear your mask, and social distance so we can finally end this devastating pandemic.\n\nhttps://t.co/Uoix1mzY4C","date":"Mon Nov 01 23:20:56 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"ICYMI: I wrote a letter to @FAANews asking them not to route additional air traffic over our communities, which are already subject to significant aircraft noise and pollution. https://t.co/QvxRkH3xEX","date":"Mon Nov 01 23:11:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you Young Visionaries and Shiek Shoes for hosting a Harvest Festival and Resource Fair in the @CityofOntario! We look forward to continuing to provide essential community programs and the #COVID19 vaccine. https://t.co/23Bqi21lIB","date":"Mon Nov 01 22:29:29 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Abortion bans are dangerous, unconstitutional, and a direct attack on reproductive freedom. SCOTUS must block #SB8, and the Senate must pass the Women's Health Protection Act to codify the rights guaranteed by #RoevWade.","date":"Mon Nov 01 19:50:04 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"📱\n909-204-3773\n1-866-4-USWAGE\n(1-866-487-9243)\n💻\nhttps://t.co/k4VPDihjGO","date":"Mon Nov 01 14:12:06 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"All workers should be fairly paid and safe on the job. If you work in #Ontario and have a labor violation to report, contact our local @USDOL:\n \nU.S. Department of Labor\nWage and Hour Division\n3350 Shelby Street\nSuite 340\nOntario, CA 91789-4884","date":"Mon Nov 01 14:11:45 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It is amazing to see Latina-owned businesses thrive in the #InlandEmpire. Thank you for your leadership and resilience as Latina Entrepreneurs – I wish you continued success. Congratulations to all of tonight’s awardees! https://t.co/3ACpgfV22N","date":"Sat Oct 30 03:02:08 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you Tracy Williams, CEO of Ontario Christian Center, for providing my staff such a warm welcome during the Women’s Conference! I look forward to continuing our partnership to elevate amazing women leaders in #CA35. https://t.co/UOF3LCiNnz","date":"Fri Oct 29 22:55:17 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My office is available to assist constituents in #CA35 with any federal agency – if you have any questions, call my office at (909) 481-6474 or visit my website at https://t.co/EnFuJichun.\n#CaseworkSuccessFriday https://t.co/9mGdfIdfJl","date":"Fri Oct 29 22:01:49 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Parents who file tax returns with ITINs may also be eligible to receive the advance #CTC for an eligible child with a valid social security number.","date":"Fri Oct 29 18:04:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #ChildTaxCredit is available to eligible families even if they do not have any income. If you did not file your 2019 and 2020 tax return, you can still receive the advance #CTC. Visit https://t.co/qhqm5zIXoE","date":"Fri Oct 29 18:04:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#CA35 STUDENTS: The deadline to apply for a nomination to a U.S. Service Academy through my office is Monday, November 1 @ 5 p.m. Apply for an opportunity to attend one of the most prestigious academic institutions tuition-free while serving our country.\nhttps://t.co/myb57KW30t","date":"Fri Oct 29 16:15:57 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @SeaIF for your steadfast commitment to the people of Central America. We need all hands on deck to heal, rebuild, and deliver the support Central Americans deserve, and I know we will rise to the occasion. #CADF2021","date":"Fri Oct 29 15:09:49 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#BossLadies #TeamTorres #Infrastructureweek https://t.co/iLRqrA9Ztz","date":"Fri Oct 29 02:18:38 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My staff joined the president of SEIU 2015, April Verrette, to hear more about their initiative to ensure a livable wage for care workers. https://t.co/qrd4iJl1bZ","date":"Fri Oct 29 01:22:26 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to all of the first responders who dedicate their lives to serving our communities – we honor your bravery and sacrifice especially during the #COVID19 pandemic.\nHappy #NationalFirstRespondersDay!","date":"Thu Oct 28 23:09:14 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@Ilhan @RepCarbajal @USMC @tedlieu @usairforce @RepMalinowski In 2004, @RepSires was recognized as Mayor of the Year by the New Jersey State Bar Association. In Congress, he is a member of the House Gun Violence Prevention Task Force, promoting comprehensive policy principles to reduce gun violence. https://t.co/SnVuuQcIq1","date":"Thu Oct 28 21:18:46 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@Ilhan @RepCarbajal @USMC @tedlieu @usairforce Under President Obama, @RepMalinowski served as Assistant Secretary of State for Democracy, Human Rights, and Labor to address global corruption. In Congress, he sponsored the Combating Global Corruption Act of 2021 to tackle corruption around the world. https://t.co/MgXmhfrS2Y","date":"Thu Oct 28 20:58:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@Ilhan @RepCarbajal @USMC Rep. @tedlieu served in the @usairforce and currently serves as a Colonel in the Reserves. In Congress, he is a leader in combating ethnic and racial profiling, and he authored the first-in-the-nation ban on gay conversion therapy for children. https://t.co/ZFBnBXCN7s","date":"Thu Oct 28 20:46:05 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@Ilhan .@RepCarbajal served 8 years in the @USMC Reserve, including active duty during the Gulf War in 1992. In Congress, he has secured $1 million for the Santa Barbara Veterans Treatment Courts and introduced legislation to combat veteran homelessness. https://t.co/iaDgZGk42n","date":"Thu Oct 28 20:19:44 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congresswoman @Ilhan Omar, who fled civil war in Somalia as a child, is working for investments in education, fair wages, a just immigration system, and solutions to climate change. https://t.co/C9ovmr5nmE","date":"Thu Oct 28 20:09:44 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@RepEspaillat @CongressmanRaja @RepJayapal In college, @RepChuyGarcia organized for workers' rights and inclusive city services. Now in Congress he is fighting to expand access to quality education, affordable housing, and economic opportunity for hard-working Americans. https://t.co/9WQfbjOxS1","date":"Thu Oct 28 19:59:57 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@RepEspaillat @CongressmanRaja .@RepJayapal worked for 20+ years in global public health and development before being elected to Congress. Now she serves on the House Judiciary Committee and chairs the Congressional Progressive Caucus. https://t.co/rKFLPuVirH","date":"Thu Oct 28 19:40:47 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".@RulesDemocrats are meeting now to discuss #BuildBackBetter – tune in here: https://t.co/yKdqOZ72bG","date":"Thu Oct 28 19:01:16 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@RepEspaillat Prior to being elected, @CongressmanRaja served as the Vice-Chair of the Illinois Innovation Council. In Congress, he founded and chairs both the bipartisan Caucus to End the Youth Vaping Epidemic and the bipartisan Solar Caucus. https://t.co/PJUsdAIT92","date":"Thu Oct 28 18:54:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".@RepEspaillat is the first Dominican American to serve in Congress, where he's fighting to defend access to affordable health care, lower prescription drug costs, respond to #COVID19, invest in our nation’s infrastructure, &amp; support policies for job creation &amp; economic growth. https://t.co/eBd0p4xW5k","date":"Thu Oct 28 18:44:49 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"As the only member of Congress from Central America, I know well the violence &amp; instability those who live in the #NorthernTriangle face every day. I am working to combat the rampant corruption in these countries &amp; ensure the U.S. provides essential support to people who need it. https://t.co/UT2UVIp1wI","date":"Thu Oct 28 18:40:49 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"To celebrate #NationalImmigrantsDay, we’re recognizing the great accomplishments of the members of the #NewAmericansCaucus. Immigrants make our country stronger, and this perspective is an important one to have in Congress.","date":"Thu Oct 28 18:33:39 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#BuildBackBetter means historic investments in childcare, higher education, affordable housing, and job training as we recover from the #COVID19 crisis. We need to get it done.","date":"Thu Oct 28 17:07:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to the honorees at @RialtoUSD!","date":"Thu Oct 28 16:34:21 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My constituents are already subject to excessive aircraft noise and poor air quality. I led a letter to @FAAnews asking them not to exacerbate these issues by routing additional LAX air traffic over our communities in #CA35. https://t.co/QvxRkH3xEX","date":"Thu Oct 28 16:31:16 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Learn more about the democratic process, local issues, and how you can help your community – my office is currently accepting internship applications! Call my office at (909) 481-6474 to learn more, or visit my website to apply https://t.co/BRHApabhJ4.","date":"Thu Oct 28 03:06:38 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the @CityofMontclair for brightening up the days of our seniors with a drive-thru birthday celebration. My office was delighted to deliver birthday cards to these great members of our community. https://t.co/zlDwGXUyaO","date":"Thu Oct 28 01:29:07 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great joining the @scicoalition to discuss support for research and STEM. Funding research spurs innovation, creates jobs, and grows opportunities for our communities.","date":"Thu Oct 28 00:48:05 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Always a pleasure to meet with @HelenMackCh, a fierce advocate for justice and rule of law. Thank you for your unwavering commitment and unbreakable spirit. https://t.co/pyGv0FBDEc","date":"Wed Oct 27 19:52:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Respiratory therapists have been critical in our fight against #COVID19 – your commitment, dedication, and resilience have helped save many lives. Thank you for being our heroes and for all your hard work, especially during a global pandemic! Happy #RCWEEK21!","date":"Wed Oct 27 19:34:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"FONTANA RESIDENTS: The @CityofFontana will be hosting a free #COVID19 and #Flu Vaccination event TODAY! #StoptheSpread and stay safe this flu season – visit the Fontana Community Senior Center to receive a vaccine from 11 am - 3 pm at 16710 Ceres Ave.","date":"Wed Oct 27 16:15:33 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@cnahonduras @camillerimj Con ataques contra el estado de derecho, Centroamérica necesita voces valientes para defenderse y decir la verdad al poder ahora mas que nunca.","date":"Wed Oct 27 15:57:28 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Gracias @cnahonduras por organizar esta importante conversación con @camillerimj sobre el papel de la sociedad civil en la lucha contra la corrupción.","date":"Wed Oct 27 15:57:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you @cnahonduras for hosting this important conversation with @camillerimj on the role of civil society in anti-corruption. With rampant attacks against rule of law, Central America needs brave voices to fight back &amp; speak truth to power now more than ever.","date":"Wed Oct 27 15:28:13 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @McGruffatNCPC, the @CapitolPolice, and all my colleagues who came yesterday to support #NationalCrimePreventionMonth and #911Saves. https://t.co/PZZVDAZLZF","date":"Wed Oct 27 13:30:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Help is still available for eligible renters who have been financially affected by the #COVID19 pandemic – if you have received an eviction notice, you have 15 business days to apply for rent relief &amp; notify your landlord. Apply at https://t.co/34QPuhTKh2 or call (833) 430-2122.","date":"Wed Oct 27 02:39:37 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"For more flood safety information and resources, go to https://t.co/NQf3Plxp6E.","date":"Tue Oct 26 21:53:36 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Recent floods in California are a grave reminder we don’t have time to wait – we need #ClimateActionNow. https://t.co/ktPRUBNLVL","date":"Tue Oct 26 21:53:23 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The California Venues Grant Program will open their application period this Friday! Live event venues in #CA that have been affected by the #COVID19 pandemic can apply for the grant. Learn more at: https://t.co/g5hn6LjIt7","date":"Tue Oct 26 21:19:27 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Proveedores médicos y farmacias en @SBCounty comenzaran a administrar vacunas de refuerzo contra el #COVID19 a los residentes elegibles. Visite https://t.co/sY7cN6TQv9 para obtener más información.","date":"Tue Oct 26 20:15:44 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".Congratulations Jessica, thanks again for visiting my 911 center @911LAPD","date":"Tue Oct 26 19:19:23 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I commend @POTUS and @VP for their efforts to reverse the cruel &amp; xenophobic policies put in place by their predecessors. I'm committed to working with the administration to continue to implement safe, humane immigration policies. https://t.co/QYHu5qpzlk","date":"Tue Oct 26 16:16:12 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Starting today, @SBCounty healthcare providers and pharmacies will begin administering Moderna and Johnson &amp; Johnson booster #COVID19 vaccines to eligible residents. Visit https://t.co/sY7cN6TQv9 for additional information.","date":"Tue Oct 26 01:59:11 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Sandbag locations: \n\nCity of Rialto: \nRialto Fire Station 203\n1550 N Ayala Ave\n\nCity of Fontana: \n16489 Orange Way \n\nCity of Ontario: \nAny Ontario Fire Station \n\nCity of Montclair: \nMontclair City Yard \n10835 Monte Vista Ave \n\nCity of Chino:\nFire Station #7\n5980 Riverside Drive","date":"Tue Oct 26 01:10:27 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"If you live in a recent burn area, please keep the following in mind:\n•Obtain sandbags from your local authorities\n•Stay away from flood channels and waterways\n•Avoid flooded areas and do not enter moving water on foot or by vehicle","date":"Tue Oct 26 01:10:27 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"City of Pomona: \nFire Station #187\n3325 W Temple Ave \n\nhttps://t.co/ued5wYe1dM","date":"Tue Oct 26 01:10:27 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"There will be periods of heavy rain today in #CA35. Please stay alert for any #flashflood warnings in your area and drive safely.","date":"Tue Oct 26 01:10:27 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"We must invest in infrastructure, education, and immigration in #CA35. Listen to my full interview this morning with @JDBalartMSNBC.","date":"Tue Oct 26 00:17:57 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Average American workers have a 99% tax compliance rate, but the wealthiest Americans can get away with up to 55% noncompliance. President Biden's IRS enforcement plan is about ensuring the top 1% pay their fair share. https://t.co/nsXHKbATLl","date":"Mon Oct 25 19:50:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Indigenous &amp; local communities are leading the global effort to fight climate change, often at great personal risk. I wrote a letter with @RepEscobar encouraging @SecBlinken &amp; @SecYellen to take decisive action to protect environmental defenders. https://t.co/eqaf7RAuc9","date":"Mon Oct 25 17:45:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Every member of Congress takes an oath to defend our Constitution against all enemies, foreign and domestic. Any member who helped plan or was complicit in the Jan. 6 insurrection violated that oath, and should be immediately removed from office.","date":"Mon Oct 25 16:32:37 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Mientras continuamos luchando contra la pandemia del #COVID19, es fundamental vacunarse contra la gripa! Me complace asociarme con @LACareHealth el sábado 6 de noviembre para ofrecer una clínica gratuita de vacunación contra la gripa. https://t.co/zJURPK3DHW","date":"Mon Oct 25 15:27:40 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Atmospheric River is the type of infrastructure we don’t want. That’s why we need a robust #BuildBackBetter bill that is focused on the current #ClimateCrisis https://t.co/GdJaZ8xvDL","date":"Mon Oct 25 14:59:30 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @JVSSoCal for hosting a job fair at the @CityofOntario to provide resources for our local veterans. My office continues to provide #VeteranIDCard assistance to veterans in #CA35 – call our office at (909) 481-6474. https://t.co/4NSH7hu0Vq","date":"Sat Oct 23 23:53:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The @SBCounty will start offering Moderna and Johnson &amp; Johnson booster shots to those who qualify. County vaccination sites offering a third dose can be found here: https://t.co/SP7BLxiIBM","date":"Fri Oct 22 23:37:01 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Mande una carta al Inspector General del Departamento de Defensa solicitando una revisión a la investigación del Army. Spc. Enrique Roman-Martinez merece justicia!\n\nhttps://t.co/NuyrJGJxgK","date":"Fri Oct 22 22:54:38 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Very classy Mr. Burns","date":"Fri Oct 22 22:35:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"We must #StoptheSpread globally - I’m happy to see the U.S. continue our leadership in providing #COVID19 vaccines around the world.","date":"Fri Oct 22 22:26:21 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"If you need any assistance with the VA, please contact my office at (909) 481-6474.","date":"Fri Oct 22 21:57:10 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I met with Mrs. Morano, a constituent from Chino and an Airforce veteran – my team helped her obtain her #DD214 that she needed to submit a VA benefit claim. We were also able to assist her with her claim and she received a disability rating of 10%. #CaseworkSuccessFriday https://t.co/Vg1vMlgFzP","date":"Fri Oct 22 21:57:10 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@JSandoval1982 @SoudiJimenez @latimesespanol Gracias a @JSandoval1982 por seguir hablando sobre la corrupción en Guatemala – siempre serás bienvenido aquí en el sur de California. Y gracias a @SoudiJimenezy @latimesespanol por dar cobertura a estas importantes historias. https://t.co/wyyYonYrqw","date":"Fri Oct 22 18:13:49 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @JSandoval1982 for continuing to speak out about corruption in Guatemala – you are always welcome here in Southern California! And to @SoudiJimenez &amp; @latimesespanol for giving coverage to these important stories. https://t.co/wyyYonYrqw","date":"Fri Oct 22 18:13:25 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Middle 💺 hell!","date":"Fri Oct 22 17:43:01 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".thank you @POTUS we must stay focused on ending the pipeline to prison. We can do that by ensuring families have the support they need to leave no child behind. #Childcare #CommunityCollege","date":"Fri Oct 22 17:33:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".🇺🇸 sigue salvando vidas. Donando vacunas para combatir #COVID19","date":"Fri Oct 22 17:02:08 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Millions of lawful permanent residents who are eligible for citizenship can't complete the process because they face significant barriers. I joined my colleagues @RepGraceMeng &amp; @RepChuyGarcia in calling on @DHSgov &amp; @USCIS to address these barriers. https://t.co/CqgIOJjtey","date":"Fri Oct 22 17:01:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"As we continue to battle the #COVID19 pandemic, it is critical to get your flu shot. I’m happy to partner with @LACareHealth on Saturday, November 6th for a free walk-up &amp; drive thru flu shot clinic. https://t.co/KGwJurnN2g","date":"Fri Oct 22 16:19:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Today marks how much longer Latinas must work – 294 days – to equal the pay earned by their white male counterparts last year. It's long past time we finally guaranteed equal pay for equal work. #LatinaEqualPayDay","date":"Fri Oct 22 01:20:32 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#DYK a #VeteranIDCard can be used to get discounts offered to Veterans at many stores, businesses, &amp; restaurants? If you do not have a #VIC, my staff would love to assist you – RSVP for an appointment Nov. 8-10 in Ontario. https://t.co/fAwZJAO2mi https://t.co/UtxTtbLeY5","date":"Fri Oct 22 01:03:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"One of my first jobs was in a male-dominated industry selling steel. I worked harder than my male colleagues and sold more. It didn’t matter that I had higher sales, bigger profits or that I sold internationally; I was still paid less. #LatinaEqualPayDay","date":"Fri Oct 22 00:47:24 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Great to meet with @CHIRLA, @TODEC1, and immigrants from the #InlandEmpire to discuss our efforts for a pathway to citizenship. Immigrants are essential to our economy and to our communities. #TheMomentIsNow https://t.co/wuH12tEjWg","date":"Thu Oct 21 21:45:03 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"La ciudadanía no debería de ser solo para aquellos que pueden pagarla, es por eso que presente la Ley de Eliminación de Barreras Financieras a la Inmigración y la Ciudadanía con mi colega @RepGraceMeng. https://t.co/UHxdtLmCjb","date":"Thu Oct 21 16:30:01 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s clear that Republicans like Jim Jordan and Matt Gaetz are trying to turn our critically important Jan. 6 investigation into political theatre. \n \nWe won’t let them. https://t.co/fueWyMFP19","date":"Thu Oct 21 15:31:46 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Registration opens Nov. 1 for @FAAGov’s student Airport Design Challenge! Participants will design their own @Minecraft-based airport with guidance from aerospace and engineering experts while learning about the aerospace industry. https://t.co/yNikBCbQLn","date":"Thu Oct 21 14:29:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Fue un honor presentar a @TRACODASV y @fundamyrnamack el #DemAward de @NEDemocracy. Su coraje y dedicación para enfrentar los desafíos en la región y luchar para un cambio positivo nos inspiran.","date":"Thu Oct 21 13:28:51 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was an honor to present @TRACODASV and @fundamyrnamack with the @NEDemocracy #DemAward last night. Your bravery and commitment to confronting the challenges in the region and fighting for change inspire hope. https://t.co/6CWTd45lwG","date":"Thu Oct 21 13:27:46 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to @IAPMO, based in Ontario, for being a 2021 recipient of @TradeGov’s Market Development Cooperator Program grant, which awards groups that create sustainable jobs and promote U.S. business in global markets. https://t.co/rP3CA62yjR","date":"Thu Oct 21 00:35:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"U.S. Citizenship should not be just for those who can afford it – that is why I proudly introduced the Remove Financial Barriers to Immigration and Citizenship Act with my colleague @RepGraceMeng. https://t.co/Irg7LQiWFo","date":"Wed Oct 20 21:26:44 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My bill, the Central American Women and Children Protection Act, will address violence against women and children in the Northern Triangle countries by strengthening criminal justice systems and creating and sustaining safe communities. https://t.co/NoQbG4MWzH","date":"Wed Oct 20 18:53:30 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"We must examine and address the fundamental issues that cause migrants to leave their home countries and make such a dangerous journey to reach the U.S. https://t.co/E2a1J3VYLE","date":"Wed Oct 20 18:50:56 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Happy Birthday to the first female Vice President, @VP Harris! Thank you for all your work and for your leadership that inspires young girls across the world. https://t.co/LqD2f3RnTS","date":"Wed Oct 20 15:22:57 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Vaccine mandates work.","date":"Wed Oct 20 14:06:42 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Yo tambien respaldo al Juez Pablo Xitumul de Paz.","date":"Wed Oct 20 13:08:35 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#LosDodgers #TonyBellinger 👏🏼👏🏼👏🏼","date":"Wed Oct 20 00:56:36 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"As we look forward to the holiday season, Spc. Roman-Martinez should be with his family. He should have been already discharged from the military and settling into his new life. Instead, his family has spent over 16 months painfully waiting for justice with no end in sight.","date":"Tue Oct 19 23:54:21 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"A devastating new study by @CDCgov shows 1 in 500 children have lost a caregiver due to #COVID19. We must all do our part to #StoptheSpread and end this pandemic. https://t.co/WH2M9NQ8aM","date":"Tue Oct 19 22:54:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@SBCounty .@SBCounty ya no esta aceptando solicitudes para su programa #RentReliefPartnership pero la asistencia de emergencia para el alquiler y los servicios públicos todavía esta disponible para aquellos que se han visto afectados financieramente por el #COVID19 https://t.co/u3zOJLdZEU","date":"Tue Oct 19 20:58:34 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".@SBCounty is no longer taking applications for their #RentReliefPartnership program, but emergency rental and utility assistance is still available for those who have been financially impacted by #COVID19. https://t.co/u3zOJLdZEU","date":"Tue Oct 19 20:53:44 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"SENIORS: @SBCounty is still offering #GrabandGo lunches for senior residents throughout #CA35. Find the list of locations with the days/hours below. https://t.co/rAIllC5RN1","date":"Tue Oct 19 17:08:52 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I wonder what he has to hide. https://t.co/kr7RVJeXfp","date":"Tue Oct 19 14:51:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"1 in 8 women will fight breast cancer at some point in her lifetime, and nearly 42,000 women lose that battle each year. This #BreastCancerAwarenessMonth let us recommit to bringing an end to this disease.","date":"Tue Oct 19 13:20:28 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#COVID19 has caused setbacks in screenings and early detection for breast cancer – we must continue to support women by providing education and screening access.","date":"Tue Oct 19 13:20:14 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Gen. Colin Powell's historic leadership paved the way for so many. His legacy will always live on in the generation of young Americans who were inspired to follow in his footsteps in service to our country.","date":"Mon Oct 18 22:22:04 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"U.S. service academies provide students with an opportunity to attend some of the most prestigious academic institutions tuition-free while serving our country. Apply for a nomination through my office by November 1, 2021 at 5 PM if you live in #CA35!\nhttps://t.co/QeSSxrCT1c","date":"Mon Oct 18 17:37:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Since July, the U.S. has delivered more than $61 billion in #ChildTaxCredit payments directly to families, thanks to the #AmericanRescuePlan.","date":"Mon Oct 18 15:35:45 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #WalktoEndAlz recognizes those who continue to fight a relentless disease and those who support them. I was honored to join @Alzassociation virtually for this year’s walk in the #InlandEmpire. https://t.co/YhQyG827yd","date":"Sat Oct 16 18:40:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Congratulations to The Bronco Space Club at @calpolypomona for being selected as a winner of @NASA_Technology’s \nTechLeap prize for their innovative Bronco Ember technology. https://t.co/09brsY2aVv","date":"Fri Oct 15 21:43:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":".The threat has always come from within! It’s disappointing to read about the behavior of one officer. He doesn’t represent the many brave officers that held the line, saved our lives &amp; democracy #January6thInsurrection","date":"Fri Oct 15 21:11:44 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Our furry friends need vaccines too! The @CityofRialto is hosting a Pet Vaccination Clinic with free rabies shots and microchipping for the first 200 pets. The event is this Saturday at 290 W Rialto Ave from 7 a.m. – 12 p.m. For more info call: (909) 421-4987.","date":"Fri Oct 15 19:38:00 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I joined @RepRaulGrijalva &amp; 15 of our House colleagues to call on the State Dept. to take immediate, forceful action to hold corrupt actors accountable &amp; support the brave individuals fighting to defend human rights &amp; the rule of law in Guatemala. https://t.co/rmUp4rUVHt","date":"Fri Oct 15 17:13:33 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Sorry to hear the sad news Fernando. 🙏🏼🙏🏼🙏🏼","date":"Fri Oct 15 16:28:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Yeah #LosDodgers 🎉👏🏼👏🏼👏🏼🎉","date":"Fri Oct 15 04:41:18 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s amazing to welcome a new small business to the @CityofRialto! Congratulations to West Coast Dental &amp; Orthodontics on their grand opening – small businesses are the backbone of our communities! https://t.co/jqDY4cUFjp","date":"Fri Oct 15 01:43:53 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"REMINDER: If you requested a tax filing extension, TOMORROW is the last day to file your 2020 taxes. Visit the #IRS website for more information. https://t.co/dQxNP0Bq7I","date":"Fri Oct 15 00:02:40 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to @ChinoValleyCC’s President, Zeb Welborn for hosting the annual Chino Business Awards. It was wonderful to see the business leaders in our community. Congratulations to the honorees!! https://t.co/XFLRjm9wIb","date":"Thu Oct 14 22:39:50 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Many of these individuals are my constituents &amp; I am concerned about the additional traffic, pollution, &amp; safety issues this will bring to our communities, &amp; the potential for worsening workplace conditions if regulations are loosened for this operation. \n\nhttps://t.co/fMSXLtjfLO","date":"Thu Oct 14 21:33:53 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Without appropriate planning, running our ports 24/7 will not solve the problem – it will just shift the burden down the road onto port and warehouse employees, truck drivers, and all the other workers who now have to take on longer hours.\n\nhttps://t.co/ODsdlPILC1","date":"Thu Oct 14 21:33:52 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"This pandemic has already taken far too many lives. Please get vaccinated.","date":"Thu Oct 14 19:07:01 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Steve Bannon must tell Congress what he knows. https://t.co/qKa5XHZRor","date":"Thu Oct 14 15:38:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The violent insurrection on Jan. 6 was a domestic terror attack on the seat of our Democracy. We must learn everything we possibly can about what happened that day so we can ensure it never happens again. https://t.co/CnyP12XYsK","date":"Thu Oct 14 15:35:18 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Happy birthday to our first @SecondGentleman! https://t.co/3gp2uDjdVq","date":"Thu Oct 14 02:16:45 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The #Dodgers have forced #NLDS Game 5!! Here is a throwback pic from their 2018 World Series run. Go @dodgers! #RepeatLA https://t.co/oWWEUyDPuB","date":"Thu Oct 14 00:19:05 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Wishing our @USNavy a Happy Birthday! Thank you to our brave Navy Service men and women.","date":"Thu Oct 14 00:07:28 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"The next round of child tax credit payments should arrive in your bank account this Friday. Double check the IRS portal to ensure all your information is up to date so you receive your payments on time: https://t.co/cXkLTVSEFc","date":"Wed Oct 13 21:32:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I met with Sheila Mason, Deputy Chief of Innovation &amp; Quality Division, and her staff at the USCIS Western Forms Office in Montclair. \n\n#DYK this facility stores a wide range of documents and materials, and prints appointment notices for interviews and requests for evidence. https://t.co/7KwBu2Q6pZ","date":"Wed Oct 13 19:47:41 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"@IATSE workers deserve #IASustainableWages – I stand with them as they fight for dignified working conditions. #IASolidarity\n\nhttps://t.co/XH4KMqgZKl","date":"Wed Oct 13 18:08:44 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It is heartwarming that our community was able to care for these children when they most needed it. But my ultimate goal is to address the root issues that compel people to risk their lives to migrate to the United States so that we no longer need facilities like this one.","date":"Wed Oct 13 17:22:38 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am glad all the children in this facility have been reunited with their families or placed in other secure living situations. Thank you to everyone in the community who helped create a safe and welcoming environment for these children.\n\nhttps://t.co/RkOC1SdSq1","date":"Wed Oct 13 17:22:37 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Learn about the legislative process and gain great professional experience! My office is currently accepting applications for internships – see below or visit my website for more information and to apply. https://t.co/BRHApabhJ4","date":"Wed Oct 13 00:57:01 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I applaud the Biden Administration for this decision – no one should have to go into work fearing arrest or deportation.\n\nhttps://t.co/1WxWkZR5Qj","date":"Wed Oct 13 00:48:57 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"I am thrilled our communities are continuing to benefit from this much-needed assistance in the #AmericanRescuePlan. Restaurants are an irreplaceable component of our local economy.\n\nhttps://t.co/DuCa7HInMP","date":"Tue Oct 12 23:26:28 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"So often these tragedies can be attributed to a lack of oversight. We must do more to ensure the companies operating on our coastlines are acting responsibly.","date":"Tue Oct 12 22:24:06 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Women have lost nearly 2.9 million jobs since the beginning of the pandemic. It's critical that we prioritize paid leave and child care now to ensure we #BuildBackBetter and more equitably as we recover from this crisis. \n\nhttps://t.co/6OdVeRDvU9","date":"Tue Oct 12 20:39:53 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you @MayorOfLA for recognizing the important contributions of Indigenous people to the city of Los Angeles. We must continue to not only recognize the spaces where Indigenous and native people have been overlooked, but also repair the damage done by that erasure.","date":"Tue Oct 12 17:53:27 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It is important to honor the true nature of our founding - that is why I proudly introduced legislation to establish Indigenous Peoples’ Day as a federal holiday.","date":"Mon Oct 11 22:46:42 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the Manzanares sisters for holding the 4th annual Indigenous Day event at Ganesha Park to pay homage to our native ancestors and for being an equitable voice in our communities! https://t.co/GNhklSGdKI","date":"Mon Oct 11 22:46:41 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"En el #DiadelosPueblosIndigenas deberíamos trabajar para admitir y corregir ese fracaso de reconocer nuestra historia y orígenes celebrando nuestras naciones tribales y pueblos indígenas, sus raíces, tradiciones y contribuciones culturales a nuestro país. \nhttps://t.co/fz1tHmR2eD","date":"Mon Oct 11 21:36:49 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It’s our responsibility to make our country a safe and fair place for our Indigenous communities, who inhabited this land long before us. I hope today serves as an opportunity for all of us to consider how we can work toward that end.","date":"Mon Oct 11 17:44:20 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Last year, my bill, the Indian Community Economic Enhancement Act , was signed into law to deliberately work to expand opportunities for Native American communities to grow and prosper. We must and will do better. \n\nhttps://t.co/VOMWORtsIq","date":"Mon Oct 11 17:27:39 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"We should also establish September 30th as a day of remembrance for Native American children who died attending boarding school, and a day to honor the survivors, their families, and communities. That’s why I am a cosponsor of H.Con.Rea.53 \n\nhttps://t.co/2CtBu4Ii2l","date":"Mon Oct 11 17:11:07 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"My bill, Savanna’s Act, was signed into law to address the increasing number of murdered and missing Native American women. The law creates new guidelines for these investigations and ensures law enforcement agencies abide by them. \n\nhttps://t.co/5MiaEoHEq4","date":"Mon Oct 11 16:17:06 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"For too long, our country has failed to acknowledge its true history and origins. On this day, we should work to admit and correct that failure by celebrating our tribal nations and Indigenous Peoples’, their roots, traditions, and cultural contributions to our country.","date":"Mon Oct 11 15:11:25 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"But that’s only the first step. We have so much more to do to ensure our nation’s Indigenous People are treated equitably and with respect. We can start by federally recognizing Indigenous Peoples’ Day – which I just introduced a bill to do. \n\nhttps://t.co/0rH6AnMGFZ","date":"Mon Oct 11 15:11:25 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Your mental health is a priority and taking care of it is as critically important as taking care of your physical health. On #WorldMentalHealthDay reach out and talk to a friend or a family member - you’re not alone. For more resources visit https://t.co/M7tRq1lFwn. https://t.co/6fuzyYLKxd","date":"Mon Oct 11 04:01:42 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"#LosDodgers 👏🏼🙌🏼🥳","date":"Sun Oct 10 03:17:48 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"👏🏼👏🏼👏🏼 Let’s go #Dodgers Let’s go 👏🏼👏🏼👏🏼","date":"Sun Oct 10 01:46:55 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Thank you to the city and to @MADDOnline for hosting this year’s walk in support of the Myles Edward Scott Act - legislation I introduced to require DHS to identify what states are currently doing to protect people from the dangers of illicit nitrous oxide use. https://t.co/IHJWk9R4uP","date":"Sun Oct 10 01:29:07 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"We can prevent families from experiencing the pain of burying a loved one due to drunk &amp; drugged driving. I joined the @CityofRialto for the Inland Empire’s #WalkLikeMADD 5k to raise awareness about the dangerous effects of driving under the influence.","date":"Sun Oct 10 01:29:04 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Fue un gran honor platicar con estas inspiradoras jóvenes – ellas están trabajando juntas por un futuro mejor para ellas y sus comunidades en Guatemala. https://t.co/nUiaIeqvLj","date":"Sat Oct 09 00:20:03 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"It was an honor to speak with these inspiring young women, working together for a better future for themselves and their communities in Guatemala.","date":"Sat Oct 09 00:20:02 +0000 2021","user_id":"236279233"},{"handle":"NormaJTorres","text":"Exciting to see the @Dodgers in the postseason again - good luck tonight in #NLDS Game 1! #RepeatLA","date":"Fri Oct 08 23:26:25 +0000 2021","user_id":"236279233"}]