[{"handle":"RepAuchincloss","text":"I spoke on the House Floor to celebrate #Pride month by recognizing a LGBTQ-owned local business, @TheGoodHound. \n\nWe must celebrate and protect the LGBTQ individuals we all know and love who are crucial parts of our communities, economy, and families. https://t.co/MceNSpwn9C","date":"Thu Jun 16 20:54:30 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you to the @UDBidenInst and @VBidenOwens for asking me to be part of your “All Politics is Personal” series. A fun interview where I got to share which Hootie and the Blowfish jam would be my walk out song. Keep an eye out for a clip in the coming months to see the answer… https://t.co/5MG0JY3sg7","date":"Wed Jun 15 21:59:30 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This deal can save lives, but it grants credence to the GOP's deranged focus on turning schools into fortresses. With tremendous frustration, I will vote yes if this makes it back to the House, and then I’ll continue to fight to get weapons of war off our streets.","date":"Sun Jun 12 15:50:40 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"After debating gun violence with the GOP all week, and holding up Massachusetts as an example, I am furious that orgs here at home would  put schools in harm's way. @MassAGO is right: this is unacceptable.","date":"Thu Jun 09 20:50:36 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The horrific shootings in Buffalo and Uvalde are a painful reminder that action to stop gun violence is long overdue – and that Republicans’ decades of stonewalling is an intentional decision to allow Americans, including children, to continue to be slaughtered. https://t.co/g17aqX5Rfz","date":"Thu Jun 09 16:32:25 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Boston BDS &amp; the Mapping Project are tapping into millennia-old antisemitic tropes. To name names &amp; keep lists, which has a sinister resonance to the targeting of Jews throughout history, is irresponsible. They need to take down the map &amp; apologize https://t.co/1Tcba3E0pM","date":"Thu Jun 09 12:28:19 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tune in to @MSNBC at 9:00 PM ET to watch me chat next steps on gun safety legislation with @AymanMSNBC","date":"Mon Jun 06 00:30:06 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It was a privilege to stand with @MomsDemand in Sharon this morning. Massachusetts gun safety laws work and we need to make them the national model. https://t.co/tTrF2LmDk0","date":"Fri Jun 03 17:37:33 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#WearOrange I’m not going to stop fighting until we have a federal assault weapons ban. https://t.co/jOGRe3H58Q","date":"Fri Jun 03 17:37:30 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The United States should not flinch because Russia flexes. Send the long-range rockets. https://t.co/JTcswyRlcj","date":"Tue May 31 14:49:09 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Semper fidelis. https://t.co/uDD9Qo1dIL","date":"Mon May 30 13:50:00 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Let us commit ourselves - as we honor those who protected our children’s freedom overseas - to protecting our children here at home as well. #MemorialDay https://t.co/bFiUnKqKaO","date":"Mon May 30 13:49:57 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The NRA is hosting a party in the backyard of a school shooting before 19 students and two teachers had even been laid to rest. Is this really an organization that people want to be a part of? https://t.co/0zrg1ATipL","date":"Sun May 29 17:33:13 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The NRA does not care about keeping kids safe in school. The NRA Cares about money. https://t.co/M6pJKBcY6c","date":"Sat May 28 22:21:29 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The GOP says that the answer to bad guys with a gun is good guys with a gun.\n\nThe good guys waited 40 minutes.","date":"Thu May 26 17:58:25 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We should come back now.","date":"Wed May 25 20:19:55 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This slaughter is a policy choice. https://t.co/RVm7vBhvaJ","date":"Wed May 25 01:55:00 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"\"@SecCardona focusing on mental health during a trip to Milford today with Congressman Jake Auchincloss. The two met with students about mental health resources. They also discussed the support being offered following the pandemic and disruptions to in-person learning.” https://t.co/Fs27uM7W39","date":"Sun May 22 21:00:43 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Carmela Martinelli, a Senior at Milford High School, was the overall winner. Her photograph, “A Dozen Roses” will be representing our District by hanging in the Capitol in DC for the next year. Congratulations to everyone who worked so hard to display the many talents of #MA04 ! https://t.co/2s2IbRkJoQ","date":"Sat May 21 18:22:14 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The people’s choice winner this year was Xinlei Hu, a Sophomore at Newton North High School. Her piece, “Masking” will hang in our Newton office for the next year. https://t.co/bZurCGArvI","date":"Sat May 21 18:22:12 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"🧵 Thank you to the @AttleboroMuseum for hosting the Fourth District Congressional Art Competition. We had amazing submissions from all over the district and you can watch the full award ceremony here: https://t.co/u0Hqes1Z3z https://t.co/ODizbedVaz","date":"Sat May 21 18:22:11 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you for visiting Milford, @SecCardona! It was great to show you the wonderful things our students are doing &amp; reaffirm our commitment to keeping schools open &amp; improving mental health. As you said, it’s not what you want to be when you grow up -it’s what you want to change.","date":"Fri May 20 23:36:38 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The federal government has a track record of trampling on civil rights and civil liberties in the name of security. We can have both security AND freedom. Thank you to @RepCori for your leadership on making the Domestic Terrorism Prevention Act something we could all support. https://t.co/QbZ9KfnxcH","date":"Thu May 19 17:35:05 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The Greek prime minister’s address was the best speech I’ve heard as a member of Congress.\n\nHe said that Greeks and Americans are custodians of democracy — we must stand up to disinformation and threats from within that cripple our institutions. https://t.co/cWNkq7viES","date":"Wed May 18 00:21:41 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Access to reproductive healthcare is a fundamental right. We in Congress need to codify Roe v. Wade.\n\nFrom the #BansOffOurBodies rally yesterday in Attleboro: https://t.co/kt7rp2PFpj","date":"Sun May 15 22:31:58 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This toxic blend of racism, conspiracism, and gun violence is domestic terrorism.","date":"Sat May 14 22:35:20 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Officer Borges died of COVID on Christmas Eve, 2020. His sister and his fellow officers are honoring his memory this weekend at the National Law Enforcement Officers Memorial.","date":"Fri May 13 19:35:23 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"🧵 Going into #PoliceAppreciationWeek, I was able to get Taunton police officers a tour of @WhiteHouse, and joined them at the gates to thank them for their service  and to reflect upon the sacrifice of officer John Borges https://t.co/nVH5bNfHwQ","date":"Fri May 13 19:35:23 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Never know who you’ll see in the Democratic Cloak Room… https://t.co/vW31ApHMUn","date":"Thu May 12 20:10:59 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Abolish the filibuster and protect women’s fundamental right to an abortion. https://t.co/HPpygyOrUK","date":"Wed May 11 21:16:08 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happy Mother’s Day to my mom, @LGlimcherMD, and wonderful grandma to Teddy and Grace. https://t.co/GMDFPem4d2","date":"Mon May 09 00:22:08 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"From deep-red WY to deep-blue MA, Republicans and Democrats must demonstrate to our allies &amp; our enemies alike that there are no half-measures on the front lines of the free world. My oped with @RepLizCheney on bipartisan unity around  victory for a free and democratic Ukraine 👇🏻","date":"Sat May 07 13:25:59 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Yesterday, I attended the 2022 National @SBA_MA Awards Ceremony. After two long years, there is no better time than now to celebrate small business owners across the Bay State. https://t.co/4azrSBn386","date":"Fri May 06 20:00:43 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This weekend, I look forward to celebrating Mother’s Day with my family.","date":"Fri May 06 20:00:43 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In Franklin, I stopped by Franklin High School and attended a Franklin City Council meeting. I spoke with students about the importance of civic engagement, and at the city council meeting, we discussed upcoming infrastructure projects. https://t.co/HNm0WhUap2","date":"Fri May 06 20:00:41 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Teddy and I joined Cabot Elementary first grade students and their families for Walk, Bike, &amp; Roll to School Day. Thank you to the many volunteers who kept our kids safe on the stroll! https://t.co/NgYBAeOMHx","date":"Fri May 06 20:00:39 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I later met with offshore wind stakeholders. Offshore wind energy can help us realize our emissions reduction goals, create thousands of good-paying jobs, and transform Massachusetts into a clean energy exporter. https://t.co/CVUGy6QNRJ","date":"Fri May 06 20:00:36 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Wednesday, I held office hours at French Press Bakery in Needham, where I heard from many of you about the issues that matter most. https://t.co/oGqQOWlVG5","date":"Fri May 06 20:00:35 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It was another busy week in the Fourth District. I started my week with a South Coast Rail tour. Phase 1 and Phase 2 will better connect our cities and towns with affordable and reliable transit. https://t.co/x3TpML7WeN","date":"Fri May 06 20:00:32 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Reproductive health care is a human right. Congress must protect abortion access, because regardless of the final ruling, we know that SCOTUS can't be relied upon to uphold Roe.","date":"Tue May 03 11:00:35 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just finished touring future stations on the South Coast Rail. Electrifying commuter rail in MA is a critical component of the transition to a clean energy economy. \n\nWe need to secure phase two funding for this project through the Bipartisan Infrastructure Law. https://t.co/cx0gAbZeU4","date":"Mon May 02 21:03:56 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"There’s nothing better than seeing students back on the Hill. \n\n@RepKClark and I welcomed Meadowbrook School 7th grade students to the Capitol, and we loved answering their questions about Congress. https://t.co/yvHo4RZJ0L","date":"Thu Apr 28 20:53:04 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Yom HaShoah, we remember the six million Jews, and millions of others, who had their lives stolen by the Nazi regime. \n\nWhen we remember the dead, we bring honor to their lives. With each story we tell, we recommit ourselves to our most important pledge: never again. https://t.co/rQHi1UTPGV","date":"Wed Apr 27 22:17:57 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“The last presidential election was a dry run for the next.”\n\nThe GOP made their playbook clear — they will use whatever coercive means necessary to steal the presidency, regardless of the will of the American people.\n\nWe must protect free and fair elections.","date":"Wed Apr 27 14:28:53 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happy #EarthDay from a Fall River clean-up! When neighbors come together for a common goal, we can make our community a better place.\n\nToday, and every day, I remain committed to fighting for climate action that will protect our planet. https://t.co/M1G1uoKAm8","date":"Fri Apr 22 18:56:05 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happening now: tune in to my conversation with @UnderSecPD and the @AtlanticCouncil to hear how the US can lead on global health and fight COVID-19 abroad. \n\nhttps://t.co/PWmfCZQgqq","date":"Wed Apr 20 18:00:19 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happy #MarathonMonday! As Hopkinton Select Board Chair Irfan Nasrullah said this morning, “It all starts here.” Michelle and I are excited to be out at the starting line with @TheTeamHoyt and so many others. A great start to #PatriotsDay. https://t.co/7d37eHpqQV","date":"Mon Apr 18 13:37:03 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Chag sameach! My family and I wish a happy Passover to those celebrating across the Fourth District and around the country.","date":"Fri Apr 15 21:41:31 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I joined farmers in Bristol County to discuss the farm bill reauthorization and to hear more about the issues that matter to them.\n\nOur farmers are resilient and unshakeable. They provide the Fourth District with so much, and I will ensure their work is supported in Congress. https://t.co/XYn46A9iux","date":"Tue Apr 12 21:59:29 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today’s historic confirmation is a testament to Judge Jackson’s exemplary qualifications. \n\nAs one of our nation’s sharpest legal minds, she will bring integrity and independence to the highest court in the land.\n\nThis is a proud day for our country. https://t.co/tZmVSi1B1d","date":"Thu Apr 07 18:17:45 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just voted to hold Peter Navarro and Dan Scavino in contempt of Congress. \n\nA subpoena isn’t a suggestion.","date":"Wed Apr 06 23:40:54 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Oil, gas, and coal provide hundreds of billions of dollars to fund Putin’s barbaric war machine. \n\nChina continues to insist that its friendship with the Kremlin knows no limits – it is on the wrong side of history and must enforce a blockade, or face significant consequences. https://t.co/MJCh4bsRZv","date":"Wed Apr 06 17:13:09 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"A bill to prevent and prepare for COVID surges that does not fund global vaccinations is... not a bill that prevents and prepares for COVID surges.","date":"Mon Apr 04 20:01:20 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My colleagues @RepJayapal, @CongressmanRaja, @RepMalinowski, and @MarkPocan joined me.","date":"Thu Mar 31 15:31:15 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The United States has a moral imperative to lead the world in vaccine diplomacy. Any cuts to the COVID aid package are unacceptable.\n\nI led the COVID-19 Global Vaccination Caucus Co-Chairs in support of funding for global COVID vaccinations and treatments. https://t.co/hpZ4Wf2SRI","date":"Thu Mar 31 15:31:14 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In two weeks, 11 innocent people have died in terrorist attacks on Israel. \n\nWe grieve with the Israeli people, and we stand firmly with our allies as they work to protect innocent life.","date":"Wed Mar 30 22:01:46 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“Tonight I voted with my district…I will also continue to vote my conscience and be beholden to no one but my constituents.”","date":"Tue Mar 29 22:57:54 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My statement on tonight's Coast Guard reauthorization Act of 2022 vote: https://t.co/wyAW1W3gnT","date":"Tue Mar 29 22:53:49 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Whether you are in favor of sending aid to Ukraine or you are ready to welcome refugees with open arms, your unwavering support of democracy makes me proud to represent the Fourth District. (2/2)","date":"Tue Mar 29 00:38:29 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This weekend, I held three town halls. I heard from many of you about a variety of issues, but what stood out to me is our shared commitment to supporting Ukraine. (1/2) https://t.co/RoGncq9D7y","date":"Tue Mar 29 00:38:28 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Putin’s cancel culture comments are the result of a deranged mind under pressure. \n\nIn one month, the Russian economy has taken a bigger hit than the US economy did during any year of the Great Depression.\n\nThere is panic on the streets of Russia. https://t.co/VjlHIiMTsT","date":"Mon Mar 28 13:59:24 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My third and final town hall of the weekend is starting now in Needham. Watch live: https://t.co/H049rkPWh0","date":"Sun Mar 27 20:09:24 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Live in Taunton now for our second town hall of the weekend: https://t.co/UMh8xedv8V","date":"Sat Mar 26 18:04:59 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m in Mansfield starting my first of three town hall’s this weekend. You can watch live here: https://t.co/xmEo9IIQBE","date":"Sat Mar 26 16:02:06 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you to everyone who came out in Newton tonight to stand in solidarity with Ukraine. We must continue to show up for as long as this crisis demands. We must be committed for the long haul to rebuilding a strong, a sovereign, a prosperous, and a democratic Ukraine. https://t.co/ZVgG05neTE","date":"Fri Mar 25 22:08:07 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, I visited Manet Community Health Center. My office secured $500k for Manet.\n\nIn the face of great adversity, Manet excelled in providing critical care to those in need — Manet deserves this funding to continue to make a positive impact on people’s lives. https://t.co/3qDSIZSUAK","date":"Thu Mar 24 23:20:56 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My office secured $1,475,000 for the Norton Water and Sewer Department for its Source Water Well Replacement Project. With this funding, Norton can complete its important work of ensuring that everyone has access to clean and clear water. https://t.co/DT488qnhAN","date":"Wed Mar 23 22:15:26 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Access to clean water is non-negotiable. With this funding, Medway can deliver clean water to residents across the town.\n\nThis #WorldWaterDay, I am working to ensure everyone in the Fourth District can turn on their taps without hesitation. https://t.co/AaDRyzqNnb","date":"Tue Mar 22 21:53:52 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Our message is simple: if you’re an oligarch, we’re coming for your assets, wherever you have them hidden. If you’re in Ukraine fighting on the frontlines of democracy, more help is on the way.","date":"Tue Mar 22 16:16:36 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My office secured $975,000 to improve the Somerset reservoir dam. This dam is the primary source of drinking water for the town, and it is in need of repair. With this funding, Somerset will have the resources needed to keep the dam safe and dependable. https://t.co/WQahDnfsY3","date":"Mon Mar 21 22:06:17 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My office secured $16.2 million for community project funding across the Fourth District. \n\nOver the next ten days, I will highlight each project to let you know how this funding will help cities and towns across the district. Follow along! https://t.co/p8hebYmted","date":"Sun Mar 20 23:21:13 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happy St. Paddy’s from our district intern Caleb! Caleb takes public transit every day to the Newton office (including the green line) and he’s an Urban Planning grad student at @BU_Tweets. https://t.co/ogmc8GsV6k","date":"Thu Mar 17 21:32:51 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This is phenomenal news. There is no one better suited to lead our COVID response than the Fourth District’s own Dr. @ashishkjha. Congratulations, my friend!","date":"Thu Mar 17 14:27:57 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In an act of xenophobia and misogyny, 8 lives were stolen one year ago today, including 6 Asian women. \n\nLet us stand united in our rejection of racism and bigotry and eradicate hate. #StopAsianHate","date":"Wed Mar 16 22:16:26 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The wage gap cannot be explained away. Regardless of experience or education, it persists across industry and occupation — systematically devaluing women and their labor. \n\nWe need paid family and medical leave to help close this gap. #EqualPayDay","date":"Tue Mar 15 22:10:14 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I joined @MarcRPacheco and @CarolDoherty13 to tour General Dynamics Mission System. General Dynamics employs hundreds in the Fourth District and is a leader in robotic innovation. \n\nAdvances in research and development will propel the Bay State forward. https://t.co/QaF1HrGyJr","date":"Mon Mar 14 20:18:43 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"lol","date":"Mon Mar 14 13:22:30 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"1 year ago, @POTUS signed the #AmericanRescuePlan into law. This historic legislation powered our job growth, allowed kids to return to the classroom, and provided shots in arms. \n\nWe will keep working to deliver for the people.","date":"Fri Mar 11 21:02:48 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The omnibus should be a slam dunk for Democrats. We shouldn't be stripping the $15B in Covid funding from the budget. My full statement is below: https://t.co/Hvl2ZAwfsv","date":"Wed Mar 09 20:24:31 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"10. Present an off-ramp for President Putin by indicating that (a) NATO will still engage in security talks with him and (b) on-the-ground progress towards a sovereign, secure, and democratic Ukraine will lead to calibrated sanctions relief.","date":"Wed Mar 09 18:58:09 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@TomBrady brought pride and 6 Super Bowl victories to my district and to the fans of New England. \n\nHe is the greatest player of all time, and teamwork was his top talent — the GOAT was always focused on the team, not himself.\n\nThank you for everything. https://t.co/XHw5Vg5uxB","date":"Wed Feb 09 23:57:04 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"7. Issue a statement from NATO clarifying the Russian actions that would trigger Article 5, to avoid inadvertent escalation.","date":"Wed Mar 09 18:58:08 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"8. Backchannel to the Kremlin that NATO would not wage cyber-attacks in the Russian homeland unless Russia cyberattacks NATO first.","date":"Wed Mar 09 18:58:08 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"9. Insist that all Ukrainian forces, whether organized or guerilla, be recognized as combatants and that atrocities against civilians will lead to prosecution against the Kremlin security elite, including the president, at The Hague.","date":"Wed Mar 09 18:58:08 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"4. Wage deniable, surgical cyber-attacks on Russian command and control and logistics nodes within Ukraine.","date":"Wed Mar 09 18:58:07 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"5. Expand information operations designed to demoralize Russian troops in Ukraine.","date":"Wed Mar 09 18:58:07 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"6. Plan with Ukraine, Poland, Hungary, Romania, and/or Slovakia to host Ukrainian training facilities and a government-in-exile if needed. Use Article 4 consultations to assuage their security concerns.","date":"Wed Mar 09 18:58:07 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"1. Coordinate a global embargo on Russian oil, while maximizing existing domestic and OPEC production to backfill supply.","date":"Wed Mar 09 18:58:06 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"3. Work with NATO allies to increase the supply of airplanes, drones, anti-tank, anti-aircraft, and anti-drone weapons and training to Ukrainian forces, for the duration of the conflict.","date":"Wed Mar 09 18:58:06 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"2. Increase diplomatic pressure on Beijing to distance itself from the Kremlin, including consideration of secondary sanctions on Sino-Russian financial &amp; commodities ties.","date":"Wed Mar 09 18:58:06 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@POTUS’ Russian oil and gas import ban is welcome but insufficient. Here are 10 actions the US can take to support Ukraine:\n\n🧵🧵🧵","date":"Wed Mar 09 18:58:05 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We should get airplanes, anti-tank, anti-air missiles, drones, and counter drone equipment to Ukraine through every format possible — including backfilling supplies from Poland, Romania, Hungary, Slovakia, and any other country that is willing to provide those MIGs to Ukraine. https://t.co/nz0g7PPHra","date":"Wed Mar 09 12:19:59 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Will be chatting the latest on Ukraine at 5:40 AM. Tune in!","date":"Wed Mar 09 02:21:16 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My staff and I joined Sully and @CapsPup in support of my bill with @PatrickMcHenry to provide recognition and training resources for service dogs.\n \nIn Afghanistan, my platoon dog was an instrumental part of my team. Our service dogs assist us in every mission, at home &amp; abroad. https://t.co/bVaNynMmuf","date":"Tue Mar 08 21:28:16 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This is an important step, but the energy sanctions must be global. Only an internationally coordinated ban on Russian oil packs the punch Vladimir Putin deserves.\n\nI urge our allies to join us. Together, we can backfill Russian oil and invest in clean energy.","date":"Tue Mar 08 17:50:20 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happening now: join my FB Live to discuss the youth mental health crisis with Elisabeth Jackson, CEO, and Peter Ducharme, Director of Clinical Affairs, of @BridgeOTW.\n\nhttps://t.co/6u4DUO0Wa0 https://t.co/d2xNFqHx5i","date":"Mon Mar 07 22:05:24 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In Congress, we’re putting pressure on the Biden administration to move on energy sanctions.\n\nI called for cutting off oil, coal, and natural gas, and we’re now seeing bipartisan movement on those sanctions in the Senate. https://t.co/USgTW1q8RR","date":"Mon Mar 07 14:08:56 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"What @RepBoebert did at the SOTU is despicable. \n\nThere are those in Congress who are performers and there are those who are policy makers. https://t.co/1O3dGKFB5W","date":"Sun Mar 06 19:07:51 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This afternoon, I joined our neighbors in Attleboro to stand in solidarity with Ukraine. The Ukrainian people are fighters and we’ll continue to support them and make this war a nightmare for Vladimir Putin. https://t.co/7sfWCEqQbK","date":"Sat Mar 05 23:49:14 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Ever wonder what it’s like to be a member of Congress at the #SOTU? 👇👇👇\n\nhttps://t.co/1i623kgLFf https://t.co/vAciXhDHJL","date":"Fri Mar 04 21:07:53 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Yesterday, I opposed the Graves amendment, which could slow the development of key offshore wind projects in Massachusetts.\n\nWe are in a new era of clean energy — now is not the time for needless delays. https://t.co/UO3TThyed1","date":"Thu Mar 03 20:44:03 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“Offshore wind energy can help us realize our emissions reduction goals, create thousands of good-paying jobs, and transform Massachusetts into a clean energy exporter.” \n\nWith offshore wind champions like @jeffroy and @RonMariano, Massachusetts is in good hands.","date":"Thu Mar 03 17:25:30 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The WH released a National COVID Preparedness Plan, but returning to school won’t end the youth mental health crisis. \n\nAs the youngest @HouseDemocrats dad, I am committed for the long haul to improving children’s socioemotional wellbeing. \n\nRead more: https://t.co/SBBTkSFld3","date":"Wed Mar 02 17:01:46 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Rep. Lewis called on Congress to defend at all hazards the right to vote. \n\n@POTUS is right. We must act and restore full voting rights and protections. #SOTU","date":"Wed Mar 02 02:57:00 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“Our schools are open. Let’s keep it that way. Our kids need to be in school.” #SOTU","date":"Wed Mar 02 02:50:02 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Pre-K for every 3- and 4-year-old. #sotu","date":"Wed Mar 02 02:37:53 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“Light will win over darkness.” Democracy will always prevail. #SOTU.","date":"Wed Mar 02 02:12:27 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"After a year of historic accomplishments, I hope to hear @POTUS address his plan for: \n\n✅ Putting Covid behind us\n✅ Strengthening our economy \n✅ Protecting democracy at home &amp; abroad\n\nI am confident that we will have a brighter year ahead. #SOTU https://t.co/t6BGrHUYgr","date":"Wed Mar 02 01:51:34 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@TommyVitolo was a key partner in helping get relief for essential workers, bringing attention to transportation projects, and supporting job growth. I am thrilled to have him as my #SOTU guest. https://t.co/r3FsQunhye","date":"Tue Mar 01 22:14:01 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m excited to have @TommyVitolo join me this evening as my #SOTU virtual guest. \n\nRep. Vitolo and I work together to deliver results with the Biden agenda for the Bay State. I look forward to previewing @POTUS’s speech during our FB Live at 5:30 pm: https://t.co/b0kAcyKSzj https://t.co/O5zCJIh0BE","date":"Tue Mar 01 18:17:03 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"These energy sanctions will rock the foundation of Vladimir Putin’s regime; they will accelerate our transition to a clean energy economy; and they will demonstrate the free world’s commitment to the Ukrainian cause.","date":"Mon Feb 28 23:36:25 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"If the outcome of upcoming talks between Ukraine and Russia are not conducive to a sovereign, secure, and democratic Ukraine, then the United States and its allies must impose energy sanctions on the Russian Federation.","date":"Mon Feb 28 23:36:24 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Russian coal should be banned immediately; while oil and gas should be phased out in consultation with OPEC and European allies, respectively.","date":"Mon Feb 28 23:36:24 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"While Trump and a wing of the GOP root for a maniacal dictator to invade a sovereign democracy, @POTUS is leading in times of crisis. \n\nHe is engaging in a politics of opportunity, not a politics of grievance. https://t.co/antdtFCAzb","date":"Sun Feb 27 23:56:24 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This is a historic, and long overdue, day for our nation.\n\nThere is no one more qualified than Judge Ketanji Brown Jackson, and she is an excellent choice to serve on the Supreme Court.","date":"Fri Feb 25 15:56:12 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The U.S. &amp; its allies must crush the Russian oil &amp; gas sector. Yes, that means sanctions &amp; OPEC cooperation. But clean energy is the only true &amp; lasting solution.","date":"Thu Feb 24 14:02:33 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I celebrated Black History Month at the Attleboro Arts Museum where I visited the “The Beloved Community Triptych” exhibit. The triptych was created by artist and art-educator Sandy Coleman and the Martin Luther King, Jr. Memorial Committee of Greater Attleboro. https://t.co/XIl0LPmtI6","date":"Wed Feb 23 23:38:59 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The triptych is meant to underscore the themes of unity and brotherhood.","date":"Wed Feb 23 23:38:59 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Recently, I met with Ukrainian citizens from across the Fourth District to hear more about the issues that matter to them, and their thoughts amidst the Russia-Ukraine crisis. https://t.co/GWmxUbTj0t","date":"Tue Feb 22 20:44:28 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I remain committed in Congress to supporting democracies and to standing with our NATO allies. This is a pivotal moment that requires a united front, or we risk the beginning of an era rife with conflict and tyranny.","date":"Tue Feb 22 20:44:28 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congress must invest President Biden with the leverage he needs to support Ukraine and keep NATO united in the face of Russian belligerance.","date":"Tue Feb 22 00:07:57 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I joined leaders from across the Bay State to celebrate the announcement of Massachusetts’ first offshore wind factory. \n\nOffshore wind creates good jobs and provides clean energy. Brayton Point is keystone infrastructure in Massachusetts' evolution to offshore wind powerhouse. https://t.co/hqy8iDjo9l","date":"Fri Feb 18 23:09:18 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The bipartisan infrastructure law will send Massachusetts more than $1B for clean water.\n\nI'm glad to work with state officials like @WalterFTimilty to help rid the 4th District of PFAS. https://t.co/cllHc6H6vI","date":"Fri Feb 18 21:06:30 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"President Obama’s Recovery Act laid the groundwork for President Biden’s climate agenda. \n\nPresident Biden’s climate plan is 5x larger, creating new jobs and building a clean energy economy. \n\nWe must pass @POTUS’s agenda — our planet can’t wait. https://t.co/Tq3kBvzbCz","date":"Thu Feb 17 21:21:56 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Four years ago, 17 lives were stolen. We will never forget:   \n  \nAlyssa  \nScott  \nMartin  \nNicholas  \nAaron  \nJaime  \nChris  \nLuke  \nCara  \nGina  \nJoaquin  \nAlaina  \nMeadow  \nHelena  \nAlex  \nCarmen  \nPeter  \n  \n#MSDstrong","date":"Mon Feb 14 21:16:51 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Too many of our neighbors lack fair and affordable housing, leading to more families experiencing homelessness and housing instability. \n\nWe can change this with $150b for housing included in the Build Back Better Act.\n\nLet’s #ShowHousingLove and #PassBuildBackBetter. https://t.co/1lybDIWB1m","date":"Mon Feb 14 17:07:55 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The HUB Folding Box company &amp; CMT - Engineered Syntactic Systems in the 4th District represent some of the best of American manufacturing &amp; innovation. \n\nBuilding back at home is critical for American competitiveness, which is why @HouseDemocrats passed the America COMPETES Act. https://t.co/jKmfYNX6Bx","date":"Sun Feb 13 16:37:25 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The America COMPETES Act makes transformational investments in research, innovation, and American manufacturing, ensuring that the next creators and innovators have the tools they need to succeed.","date":"Sun Feb 13 16:37:25 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Companies and organizations like @BioGen and @FoodforFree remind me why the Fourth District is a national leader in innovation. https://t.co/JUpf2H580w","date":"Fri Feb 11 23:12:57 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Recently, I visited @BioGen, and I learned more about the impact of the company on our community. \n\nWe discussed an array of issues — from the DEI initiatives BioGen implemented to train the next generation of scientists to the creation of their Alzheimer’s drug. https://t.co/32zOXL6tfh","date":"Fri Feb 11 23:12:55 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I also spoke with Sasha Purpura of @FoodforFree, which has an outpost on the ground floor of BioGen. Food for Free repurposes leftover meals to feed families in need while reducing food waste.","date":"Fri Feb 11 23:12:55 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"\"@POTUS is unequivocal in his support for The Good Friday Agreement, a historic achievement that must be protected to ensure peace and stability in Northern Ireland.\" \n\nExcited to see my friend @USAmbIreland take the helm.","date":"Thu Feb 10 23:16:41 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Massachusetts’ future is electric ⚡️\n\n@HouseDemocrats delivered over $9 million to invest in EV charging infrastructure in the Bay State. This will create jobs and support the environment. https://t.co/hJYaTm4e60","date":"Thu Feb 10 20:41:57 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@TomBrady brought pride and 6 Super Bowl victories to my district and to the fans of New England. \n\nHe is the greatest player of all time, and teamwork was his top talent — the GOAT was always focused on the team, not himself.\n\nThank you for everything. https://t.co/XHw5Vg5uxB","date":"Wed Feb 09 23:57:04 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Safe gun storage is just common sense. \n\nI joined @RepAndyLevin in support of the Protect Children Through Safe Gun Ownership Act. \n\nWe need to abolish the filibuster and send this legislation to @POTUS’s desk — protecting our kids can’t wait. https://t.co/afrBeWFrWt","date":"Wed Feb 09 20:52:50 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"3. Geo-economic. The USD must persist as the global reserve currency. That may not require a CBDC. Thoughtful research &amp; regulation of fintech, sound monetary policy, rule of law, strong capital markets, a growing economy – these are the critical drivers of USD reserve status.","date":"Wed Feb 09 18:29:25 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"2. Systemic risk. The FSOC should continue to monitor and report on systemic risk from stablecoins, given how fast the industry is growing, but right now it’s modest and does not justify red tape that could lead to regulatory capture of crypto by banks.","date":"Wed Feb 09 18:29:24 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"1. Prudential risk, in the form of run risk and payment-system risk. Registration, audit, and disclosure requirements for stablecoin issuers &amp; custodians are the clear and present next steps.","date":"Wed Feb 09 18:29:24 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The @FSCDems hearing yesterday on stablecoins crystallized three domains of risk that lawmakers must address:\n\n1. Prudential risk\n2. Systemic risk\n3. Geo-economic\n\n🧵 below ⬇️","date":"Wed Feb 09 18:29:23 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happening now! Join me on @YahooFinance to talk about stablecoins: https://t.co/lcsbHyLn0w https://t.co/DfhzGK0Rk0","date":"Wed Feb 09 17:32:06 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Instead of coming together to fund the government, Republicans are fixated on increasing our already bloated military budget. \n\nWhile Republicans are playing politics, Democrats are working to deliver a budget that’s for the people. https://t.co/m06rsp8gGr","date":"Tue Feb 08 21:55:14 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Now more than ever, we must cultivate a safer internet for our children.\n\nI’m joining @RepSusanWild in calling on @YouTube to take down deadly “How To Tie a Noose” videos and do their duty to combat the adolescent suicide crisis.\n\nIt’s time to #TakeThemDown. https://t.co/bWTSRTkfv4","date":"Tue Feb 08 19:28:41 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, I voted to pass @RepCheri’s legislation to #EndForcedArbitration so that survivors of sexual assault and harassment aren’t blocked from seeking justice.","date":"Tue Feb 08 01:21:56 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"No one should go without clean water.\n\nThat’s why I joined 120 @HouseDemocrats calling for the swift repeal of Trump’s #DirtyWaterRule. https://t.co/UoUDBXm2WP","date":"Mon Feb 07 18:59:35 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Great nations keep their word. \n\nWe must stand behind our promise to Ukraine to support its security as a sovereign nation, and work towards a resolution that ensures our allies’ safety, sovereignty, and democratic longevity. https://t.co/GEBLLmPtXd","date":"Mon Feb 07 18:08:25 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #BuildBackBetter agenda would lower healthcare costs, create social security for kids, and protect our planet. \n\nWe won’t stop working to build back better. https://t.co/3NSXfhwpPN","date":"Mon Feb 07 16:13:20 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"For many, Lunar New Year is the most important holiday of the year. I appreciated the opportunity to partake in and learn more about this special holiday. https://t.co/oIrPS13OAd","date":"Sun Feb 06 23:39:51 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Next, I headed to the Brookline Library to pick up a Lunar Year craft kit to take home to my family. At the library, I ran into my good friend, @TommyVitolo. https://t.co/DOeSCSdqZp","date":"Sun Feb 06 23:39:50 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Teddy enjoyed craft time — we made Chinese Red Couplets and tiger themed crafts to kick off the year of the tiger. We also watched martial art demonstrations. https://t.co/3QyTJCPcqz","date":"Sun Feb 06 23:39:47 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, Teddy and I attended a Lunar New Year celebration at Newton’s New Art Center, with New Art Executive Director Emily O’Neil. https://t.co/Z1zYKa1Ivw","date":"Sun Feb 06 23:39:41 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We just passed #AmericaCOMPETES! @HouseDemocrats delivered a generational investment in our economy, global competitiveness, and our young and growing workforce.\n\n📺 Watch to learn more about my four amendments included in the bill ⬇️ https://t.co/5CtHifnMgf","date":"Fri Feb 04 17:40:08 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I said what I said.","date":"Thu Feb 03 21:10:31 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Chesty XV is still number☝️in my office’s heart. https://t.co/fYBkAADFLz","date":"Thu Feb 03 17:02:08 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"At 7 pm, I’ll be participating in a town hall focused on our financial future organized by @connecting2cong.\n\nI hope you’ll join. https://t.co/IH7tPnglKV","date":"Wed Feb 02 23:56:55 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On-demand transit is a force multiplier for public transportation, a driver of lower costs, and a transformational power for youth, seniors, and people with disabilities. https://t.co/js6HPz1Hq8","date":"Wed Feb 02 21:18:34 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Everyone deserves access to sustainable, affordable, and reliable public transportation. \n\nWatch more from my @ridewithvia ride along here ⬇️ https://t.co/Ybr0wSXTxq https://t.co/EumeA9GP23","date":"Tue Feb 01 23:06:36 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It’s time for a new era in public transportation, and @ridewithvia is leading the way.\n\nNewMo offers affordable, accessible, and sustainable public transportation — increasing economic mobility, creating jobs, and reducing carbon emissions.\n\nI loved using their service! https://t.co/gj1p1xuCG1","date":"Mon Jan 31 20:51:55 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Right now, I am hosting a constituent services roundtable to share the ways that my office can support you. I hope you'll tune in: https://t.co/jyVUfJe5qh https://t.co/o62ZIgme92","date":"Fri Jan 28 17:04:27 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Holocaust Remembrance Day, we mourn the millions whose lives were stolen during one of the worst periods in our shared history. \n\nAs Elie Wiesel said, “to forget the dead would be akin to killing them a second time.” Never again, and we will never forget.","date":"Thu Jan 27 21:40:48 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happening now: I hope you’ll join my Chamber of Commerce Roundtable on Facebook https://t.co/dSHvFDyARa https://t.co/OqgVImM70u","date":"Thu Jan 27 17:02:55 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Donut and Teddy were watching from above. https://t.co/AAujJitJKv","date":"Thu Jan 27 01:28:51 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"At 7 pm, I’ll host a Facebook Live town hall to discuss my legislative priorities for the coming year and answer your questions. Will you join? https://t.co/hxRV3EMLgJ","date":"Wed Jan 26 23:38:43 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The clean energy sector is the fastest growing industry in America, and Massachusetts can and should be the leader in offshore wind energy. \n\nI hope you'll join my Facebook Live Offshore Wind Roundtable happening now: https://t.co/RxU9Lmft5G","date":"Wed Jan 26 20:05:42 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"With the #AmericaCOMPETES Act, the U.S. will once again lead on the global stage. We will have the tools needed to compete with China, secure our supply chains, and elevate our economic diplomacy.","date":"Wed Jan 26 18:29:30 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happening now: join my Facebook Live roundtable with educators from throughout the Fourth District to discuss student mental health during the pandemic. https://t.co/AmxA3FuwBG","date":"Mon Jan 24 20:35:47 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As the Vice-Chair of @FSCDems, I put forth bipartisan solutions to address inflation. \n\nMy Republican colleagues have played politics without contributing any policy proposals.\n\nWe need all hands on deck to lower costs for working families. https://t.co/WXzMXiG9Ed","date":"Sun Jan 23 19:18:25 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On the 49th anniversary of #RoeVWade, our fight for reproductive freedom is far from over.\n\nAbortion is health care. I won’t stop working to secure that right for everyone.","date":"Sat Jan 22 19:32:40 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The rising tide of antisemitism has forced Jewish organizations across the country to confront violence as a clear and present threat. We cannot allow this to be the new normal. We must all work towards a future free from antisemitism and faith-based violence.","date":"Fri Jan 21 01:18:43 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"America should be fixing bridges, not building walls – and now we are.","date":"Tue Jan 18 21:58:02 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We've already asked too much of our kids. It's time to put them first and that means keeping schools open and in-person. We need to lead with science - adjust the mask and testing policies -  if we're going to prioritize physical and mental health.","date":"Tue Jan 18 20:06:30 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On this day, I’m thinking not only of the proud legacy of Dr. King, Jr., but of his many partners in that long struggle, including Rep. John Lewis. \n\nRep. Lewis called on Congress to defend at all hazards the right to vote — we must deliver on that call to action. https://t.co/IjyPEyF96r","date":"Mon Jan 17 17:25:51 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In the midst of the pandemic, removing the security of the #ChildTaxCredit payments is crushing for families like Jennifer’s.\n\nWe cannot allow December’s monthly payment to be the last.\n\nThank you for sharing your story, Jennifer. https://t.co/e6t3ZhrnfS","date":"Fri Jan 14 18:32:13 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"🧵For Jennifer, a veteran in the Fourth District, the Child Tax Credit changed her daughter’s life.\n\nSaving the #ChildTaxCredit is everything for Jennifer’s family, and for families across the country. \n \nPlease RT &amp; share her story. We cannot let the CTC end. https://t.co/Mbt3szmLsH","date":"Fri Jan 14 18:32:12 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Passing the Freedom to Vote: John R. Lewis Act is the only way to protect our democracy. \n\nThe Senate must abolish the filibuster and send these bills to @POTUS’s desk. https://t.co/vO1I1C22rE","date":"Thu Jan 13 16:45:12 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"When Barry Goldwater, a staunch Republican, lost his presidential election, he conceded defeat. \n\nBecause that is the bulwark of American democracy — that you love your country more than you love power.\n\nThis is what Donald Trump and the insurrectionist mob never understood. https://t.co/PzdxYgFMe8","date":"Thu Jan 06 22:56:29 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It’s time for us to heal as a nation —but we cannot do that without first committing ourselves to protect our democracy and American ideals for generations to come.","date":"Thu Jan 06 18:01:16 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Monday, I attended inaugurations in Taunton and Fall River. \n\nAs we rebuild our economy so that it works for everyone, I am committed to working with the local leaders being sworn-in to ensure the Fourth District comes back stronger than ever. https://t.co/lHahUutEoK","date":"Wed Jan 05 23:49:29 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My New Year’s resolution? Protecting the franchise by restoring voting rights.","date":"Mon Jan 03 15:29:21 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I had the pleasure of kicking off the New Year at the Newton Inauguration for City Council, School Committee, and Mayor Ruthanne Fuller. I look forward to my continued partnership with Newton elected officials in 2022. https://t.co/At7ZKRquE2","date":"Sat Jan 01 22:23:00 +0000 2022","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I helped secure $154.8 million in Child Tax Credit tax cuts for over 76,000 families in the Fourth District, $89 million in restaurant grants for small businesses, and $1.8 billion to help K-12 schools reopen safely in MA.\n\n@HouseDemocrats deliver #ForThePeople. \n\nLearn more ⬇️","date":"Wed Dec 29 01:20:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Someone’s ready for Santa. https://t.co/reqjfe6gkb","date":"Sat Dec 25 02:51:08 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The focus has got to be on rolling out this booster shot and on ensuring that we can keep our schools and the economy open this winter. https://t.co/ouYfCp8ix1","date":"Wed Dec 22 19:40:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I led a letter with @SenMarkey urging the @USTreasury to reconsider revenue loss calculations so that MA cities and towns are not unfairly penalized.\n\nMassachusetts deserves to build back better using American Rescue Plan Act funds the way Congress intended. https://t.co/kyks2Ypd7o","date":"Tue Dec 21 23:08:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The president's agenda to build back better isn't dead. But it is stalled. We need to:\n\n• Pass voting rights before New Year's\n\n• Boost vaccinations as Omicron spreads this winter\n\n• Cut taxes for working families with kids, paid for by carbon pricing https://t.co/a6WOinQZ1Y","date":"Sun Dec 19 20:46:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Maith thú.","date":"Sat Dec 18 19:07:14 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I have called for the establishment of an independent commission to investigate the war in Afghanistan, and I am relieved to see this measure pass. It is a crucial steps towards ensuring we never engage in another failed forever war. https://t.co/kBoVOJJB9P","date":"Sat Dec 18 01:06:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In the midst of another wave, it is more important than ever that everyone gets vaccinated.\n\nYet companies like @PayPal allow users to spread covid &amp; vax disinfo while using their platforms. \n\nThese companies need to ask themselves whether they care more about profit or people. https://t.co/9ShoEGjPay","date":"Fri Dec 17 21:29:18 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This is my #CongressWrapped for 2021! https://t.co/MvSwhK8eHZ","date":"Thu Dec 16 21:44:26 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thanks to signers: @RepStephenLynch, @RepEBJ, @RepMcGovern, @RepAdamSchiff, @RepRaulGrijalva, @repcleaver, @RepHankJohnson, @repdinatitus, @RepSwalwell, @RepBrendanBoyle, @RepDeSaulnier, @RepTedLieu, @RepMoulton, @RepKimSchrier, @RepMondaire, @RepMarieNewman, &amp; @RepRitchie","date":"Wed Dec 15 22:20:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I led a letter urging @PayPal to ban users who disseminate vaccine disinformation and deactivate the accounts of the Disinformation Dozen. \n\nOver 800K Americans have died from COVID-19. PayPal needs to take action and stop people from profiting off their dangerous lies. https://t.co/QPUgxPeywd","date":"Wed Dec 15 22:20:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Nine years ago, we lost 26 lives in a depraved act of gun violence. \n\nThe school shooting was so horrific that, for a moment, I thought that momentum for gun safety legislation would be unstoppable. (1/2)","date":"Wed Dec 15 00:54:35 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Wrong. We can't have a good-faith debate about guns in this country. \n\nWe can't wait for Republicans or the NRA to come to their senses. \n\nWe must abolish the filibuster and pass gun safety legislation, now. (2/2)","date":"Wed Dec 15 00:54:35 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you to everyone who attended my Brookline Town Hall. I enjoyed your thoughtful questions and I’m grateful to represent a town so committed to protecting democracy. \n\nI look forward to my next town hall. https://t.co/SeHvnYZbGR","date":"Sat Dec 11 23:58:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"If you're unable to attend my Brookline Town Hall, you can watch the town hall here: https://t.co/e1zs2nULLA","date":"Sat Dec 11 19:13:16 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Please RSVP here: https://t.co/ym2rkHiUUP","date":"Fri Dec 10 21:49:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tomorrow at 2:00 PM, I'll be hosting an in-person town hall in Brookline. \n\nThis is an opportunity for you to come meet me, ask about issues important to you, and get updates on what I'm doing to serve our community. I hope to see you there!","date":"Fri Dec 10 21:49:35 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congress must provide clarity and predictability by statute, and I stand ready to work with both my Democratic and Republican colleagues to provide that. The rules of the road for Web3 can be a bipartisan initiative.","date":"Thu Dec 09 22:13:04 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The current enforcement-based regulatory system, in which entrepreneurs must negotiate with the SEC or the CFTC on a one-off basis, is not fair, efficient, or conducive to US-based innovation.","date":"Thu Dec 09 22:13:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This regulator should also work with a self-regulatory organization, as a counterpart in the private sector, to establish a rule book for:\n\n✅ Spot &amp; derivatives listings\n✅ Custody requirements\n✅ Token issuance\n✅ Asset servicing, amongst other categories.","date":"Thu Dec 09 22:13:02 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This primary crypto regulator should be tech &amp; market-structure neutral, and eventually fulfill 3 mandates:\n\n1. Compel disclosure and transparency\n2. Prevent fraud &amp; abuse\n3. Promote the efficiency and resilience of the market","date":"Thu Dec 09 22:13:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The best thing Congress can do to promote Web3 is to designate a primary regulator to audit stablecoins. \n\nThread ⬇️ https://t.co/FJiGr3IZaO","date":"Thu Dec 09 22:13:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Mazel tov, @GabbyGiffords!","date":"Wed Dec 08 02:58:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Instead of attempting to score political points, I urge my Republican colleagues to join Democrats in fighting inflation.\n\nInflation is a bipartisan problem that deserves bipartisan solutions. I hope Republicans will step up and join @HouseDemocrats in good-faith debate. https://t.co/LONMmG6kpu","date":"Tue Dec 07 20:27:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Vladimir Putin knows that @POTUS says what he means and means what he says. President Biden stood by the hard, high-integrity decision to leave Afghanistan, and he'll stand by any commitments he makes re: Ukraine.","date":"Tue Dec 07 18:24:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tonight, I’ll join the League of Women Voters of Brookline, Needham, Newton, Sharon-Stoughton, and Wellesley for a conversation about what I am working on in Congress, and I hope you’ll attend. \n\nSign up here: https://t.co/lTIKvxLlaH https://t.co/ExuKVWvY3A","date":"Mon Dec 06 15:55:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I had a great time at the Powisset Farms’ annual haybale lighting. I also met the famous Powisset pigs.\n\nHappy holidays! https://t.co/SUqQzS6k27","date":"Sat Dec 04 22:48:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Mississippi is asking SCOTUS to overturn Roe v. Wade — putting reproductive freedom across the country in jeopardy.\n\nIn the House, we passed the Women’s Health Protection Act, protecting the right to choose. Now, the Senate must do the same. #AbortionIsEssential. https://t.co/XcHMX9eInB","date":"Thu Dec 02 01:21:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"No parent should fear sending their kids to school. No student should fear going. Continuing to live in a world with gun violence is a choice we're making. No civilian should have access to automatic weapons, period.","date":"Tue Nov 30 22:30:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Republicans need to shake off their habit of scoring political points off economic issues. \n\nBuilding on the momentum of the Bipartisan Infrastructure Deal, Democrats and Republicans could tackle inflation next.\n\nHere’s how we do it: \n\nhttps://t.co/3c6OEDarw1","date":"Tue Nov 30 12:20:20 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tonight, we celebrate the first night of Hanukkah by lighting the menorah. Rabbi Hamilton shared that “a little bit of light can push back a lot of darkness”— a message that can resonate with all of us this holiday season. https://t.co/88eoOvhY2w","date":"Mon Nov 29 03:39:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It was great to be at Temple Kehillat Israel’s lighting ceremony, alongside @cindycreem, @TommyVitolo, and Brookline Select Board Members @JohnVanScoyoc, @SelectGreene, and @Miriam4Bkline. https://t.co/zJh7omQyap","date":"Mon Nov 29 00:35:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#SmallBusinessSaturday This holiday season I hope you’ll shop locally throughout your communities.\n\nHere’s a look back at some of my small business stops this week ⬇️","date":"Sun Nov 28 00:38:30 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Bigotry has no place in the halls of Congress. \n\nRep. Boebert’s Islamophobic comments about @Ilhan are despicable. It’s time for Minority Leader McCarthy to step up and punish this type of behavior in his Caucus.","date":"Sat Nov 27 18:43:33 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Despite the chilly day, I met so many thoughtful and kind volunteers at the Freetown food pantry. This food pantry services the entire surrounding region and provided folks in need with a warm Thanksgiving meal. https://t.co/kP9s81J3Hq","date":"Sat Nov 27 01:07:23 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"These kinds of programs complement federal programs for first responders to have recovery coaches on-site with them, which I am an advocate for including.","date":"Sat Nov 27 01:07:22 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I toured the @sstarinc facility in Fall River. SSTAR is an innovative program that helps youth avoid and overcome opioid, mental health, and substance abuse challenges. https://t.co/IDnWQkGPfL","date":"Sat Nov 27 01:07:21 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This week, I visited Johnson’s Roadside Farm Market and Almeida’s Vegetable Patch, two locally owned small businesses in Swansea. I had a great time visiting both, and I look forward to going back again soon. https://t.co/gIYQVKPUsW","date":"Sat Nov 27 01:07:20 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happy #Thanksgiving from Teddy’s first football game - Newton North vs. Brookline High School. What team are you rooting for this year? https://t.co/gzhQTolRiU","date":"Thu Nov 25 16:32:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Lastly, we had a great meal at the Catman Café, where we met Steve, the owner. I look forward to returning to Catman Café the next time I’m in Mansfield. https://t.co/VC4mjcAVRN","date":"Thu Nov 25 01:24:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Nadine is a new business owner in Mansfield, having opened up Nadia’s Boutique in August. She has created a business where customers feel like family when entering her store. I am excited to watch her business continue to succeed. https://t.co/jVnCIinHlz","date":"Thu Nov 25 01:24:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Kevin is the owner of family-owned and operated O-D Tool and Cutter Supply Co. His family founded their business in 1959, and their commitment to providing high-quality services to their customers has not wavered. https://t.co/tTe3EdalW5","date":"Thu Nov 25 01:24:04 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I visited small businesses in Mansfield with @RepAdamScanlon,  @PaulFeeneyMA, @jay_barrows, @TedPhilips, and the Mansfield Selectboard today.\n\nI hope you'll shop locally when possible this holiday season. It's a great way to support your neighbors, friends, and local economy. https://t.co/77tPPL5lEv","date":"Thu Nov 25 01:24:02 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I enjoyed meeting with the owners of O-D Tool and Cutter Supply Co., Nadia’s Boutique, and the Catman Cafe.","date":"Thu Nov 25 01:24:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I visited small businesses in Mansfield with @RepAdamScanlon,  @PaulFeeneyMA, @jay_barrows, @TedPhilips, and the Mansfield Selectboard today.\n\nI hope you'll shop locally when possible this holiday season. It's a great way to support your neighbors, friends, and local economy. https://t.co/77tPPL5lEv","date":"Thu Nov 25 01:24:02 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just walked off the House floor after passing the #BuildBackBetter Act.\n\n@HouseDemocrats delivered for our country by:\n\n1️⃣ lowering healthcare costs\n2️⃣ setting our children and families up for success\n3️⃣ investing in climate resilience &amp; clean energy.\n\nNow, the Senate must act. https://t.co/tGBjptf1m2","date":"Fri Nov 19 15:08:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Meet Jasper, a very good boy and  MA-04 office guest. \n\nHe’s waited patiently all week for us to #BuildBackBetter. Let’s pass it tonight and give him a treat! https://t.co/j02k7gQGMy","date":"Thu Nov 18 22:37:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@Teamsters stand up for essential workers.\n\nThey’ve highlighted the poor working conditions truck drivers experience, and it’s time we respond with comprehensive data collection to help solve these problems. \n\nListen to my full @TransportDems questions below ⬇️ https://t.co/uB1Jpb7zrt","date":"Thu Nov 18 21:57:26 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I introduced a resolution to create a “Marshall Plan” for vaccinations to ensure a global recovery from Covid-19, and today @POTUS took action. This is a major step that will save lives around the world. \n\nNow, we need to invest in developing nations’ distribution.","date":"Wed Nov 17 20:28:33 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As we build back better, we must ensure appropriate taxation and regulation of the #cryptocurrency industry.","date":"Wed Nov 17 15:39:52 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My final stop was Franklin’s Diwali celebration. Thank you to the organizers for hosting a wonderful event. https://t.co/aINKSltC6K","date":"Tue Nov 16 22:17:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I stopped by @unlikelybkstore, an independent bookstore in Plainville. Deb Sundian gave me an excellent tour. I look forward to bringing my family here in the future! https://t.co/GUIFmd6Tmn","date":"Tue Nov 16 22:17:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I held a meet and greet in Easton with @CarolDoherty13, Rep. Claire Cronin, and Town Manager Connor Read on Saturday. I heard from constituents about the importance of passing the Infrastructure Investment and Jobs Act — I love hearing from you about the issues that matter. https://t.co/hNHBgXHtZV","date":"Tue Nov 16 22:17:02 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We ended our day at Alice’s Last Stop diner, where we spoke about Dighton’s water infrastructure needs and plans for a regional bike trail. https://t.co/sKSrwIrHtW","date":"Tue Nov 16 22:16:59 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I spoke with Fire Chief Maguy and firefighters Jerry Santos and Eric Gagnon of Fire Station 1 about the conditions at the station and how federal, state, and local funds can be used to make necessary improvements. https://t.co/RZhk3uvSBN","date":"Tue Nov 16 22:16:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"At Spring Street Mill, I listened to business and town leaders share how they collaborate to bring new industry to the town. https://t.co/6jaruqzY4O","date":"Tue Nov 16 22:16:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Friday, I toured Dighton with @MarcRPacheco and @haddadpat4.  I heard about the community’s needs and how American Rescue Plan and Infrastructure Investment and Jobs Act funds can help modernize Dighton’s infrastructure. https://t.co/yWVCuJD8BB","date":"Tue Nov 16 22:16:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Before heading to Washington on Monday, I spent the last few days speaking to folks throughout the Fourth District, and I wanted to share some of my recent stops with you. \n\nThread ⬇️","date":"Tue Nov 16 22:16:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“We’ve accomplished what Washington has long promised but never done: a historic investment in this country’s infrastructure.” - @POTUS https://t.co/fAIsQjZNWH","date":"Mon Nov 15 21:24:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today’s the day. @POTUS will sign the Infrastructure Investment &amp; Jobs Act — making a historic investment in the future of our country. \n\n@RepAnnieKuster, @SenWarren, and I are thrilled to celebrate this victory at the White House for the signing ceremony. https://t.co/UN3ScmV3Dt","date":"Mon Nov 15 20:14:08 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We'll be discussing how local, state, and federal levels of government can work together to promote @StrongTowns across our region. \n\nI hope you'll join us. Watch here: https://t.co/eLor0qIRuA","date":"Mon Nov 15 14:43:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“What’s normal after combat? What’s normal after you’ve seen mortars, grenades, and IEDs?”\n\nShane Mark shared an important message during his story about PTSD and mental health at our Veterans Town Hall: “I want you to know that you can get help.” https://t.co/dvQssJtY7A","date":"Thu Nov 11 22:19:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"None of us have it all figured out. I don’t care how smart you think you are or what position you hold -- listen to the wisdom of others. \n\nBe thankful that the worst-case scenario can be avoided by listening to someone wiser than you.","date":"Thu Nov 11 18:03:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Then it came through from my Platoon Sergeant who had been in the lead vehicle -- no casualties. \n\nAnd second only to the birth of my children, it was the best feeling in the world.","date":"Thu Nov 11 18:03:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"That Lance Corporal is alive today because my Battalion Commander made a good decision.\n\nAnd Second Lieutenant Auchincloss thought that he was wiser.\n\nI think about that often. I try to embed that humility into how I approach questions big and small.","date":"Thu Nov 11 18:03:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I may have thought we sacrificed training, but my Marines showed me otherwise.\n\nI didn’t even have to give an order. They were sweeping. They were providing cover. They were evacuating the Marines.\n\nAnd there were about 45 seconds of radio silence.","date":"Thu Nov 11 18:03:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Immediately, I thought something wasn’t right. This is exactly what the Taliban wanted us to be doing. We needed to rethink this. \n\nBOOM! An IED struck our lead vehicle.","date":"Thu Nov 11 18:03:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’ll never forget that feeling; I can see it in my consciousness now. I could picture the driver of the lead vehicle. Lance Corporal. 19 years old. It was like every drop of blood was out of my body.","date":"Thu Nov 11 18:03:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"23-year-old Second Lieutenant Auchincloss thought that this Lieutenant Colonel did not know what he was doing. I thought it was going to hinder our offensive capabilities and really undermine our training. \n\nI believed this decision was a mistake.","date":"Thu Nov 11 18:03:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I commanded a forward patrol base. We were going out on daily patrols of Taliban-influenced villages. One day, there was a gunfight down at Helmand River and we were the closest platoon. \n\nI directed the platoon in single file down a narrow dirt road to the village.","date":"Thu Nov 11 18:03:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Right before we left, our Battalion Commander made a decision that we were going to switch out the vehicles that we were using, from light armored vehicles to IED resistant vehicles.\n\nThis came at a cost. It hindered our mobility, maintenance, and firepower.","date":"Thu Nov 11 18:03:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I graduated infantry in 2011 at 23 years old. Boy, was I confident. \n\nI knew the tactics. I did well in training. And upon deployment to Afghanistan, I thought I had it figured out.","date":"Thu Nov 11 18:03:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Veterans Day, I wanted to share a story with you about my own service. It’s a story of humility, and one of the most important lessons that I’ve learned. \n\nThread 👇","date":"Thu Nov 11 18:03:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This past weekend, I told a story from my time in the Marines at our Milford Veterans Town Hall. https://t.co/UMmWTRHDAp","date":"Thu Nov 11 17:55:44 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In Glasgow, @POTUS is reasserting American leadership on the climate crisis. We have an opportunity to #BuildBackBetter, at home and abroad. \n\nOur climate can’t wait — we need to take global action now.","date":"Tue Nov 09 18:54:17 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I held a roundtable with @massaflcio. We discussed the strong labor protections in the Bipartisan Infrastructure bill, which will create good union jobs across Massachusetts. \n\nOur next step: passing the Build Back Better Act. https://t.co/AoSOEuAppD","date":"Tue Nov 09 17:00:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m confident that we're going to pass the #BuildBackBetterAct. There are going to be twists and turns, but better policy comes out of vigorous debates. \n\nIt’s the opposite of the Republican Party, which governs as a cult of personality in lockstep with their leader's tweets. https://t.co/w0qIqNlqz7","date":"Mon Nov 08 18:20:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tune in tomorrow morning!","date":"Mon Nov 08 01:47:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The Burr School PTO hosted a wonderful Dia de los Muertos and Diwali event. I enjoyed speaking with students and parents who organized an exceptional cross-cultural celebration. https://t.co/sfsDNO0Hgy","date":"Sun Nov 07 22:25:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today’s Veterans Town Hall in Milford was a special opportunity for veterans to gather and share their stories, and for non veterans to listen and learn. I offer my sincerest thanks to those who spoke this afternoon. https://t.co/5rgOGqIdlL","date":"Sat Nov 06 20:44:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just walked off the house floor after passing the #bipartisaninfrastructurebill: \n\n✅ Historic investments in  clean energy and clean water\n\n✅ Major upgrades to high speed internet \n\n✅ Transformative improvement to public transit \n\nNext up: the #BuildBackBetterAct https://t.co/TVMRfPaLz6","date":"Sat Nov 06 04:32:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My Republican colleagues suggest these policies are a socialist takeover. \n\nNonsense. I'm a capitalist and I'm all in. \n\nThese policies make our economy grow faster &amp; work better for everyone.","date":"Fri Nov 05 18:27:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"And of course, infrastructure: ensuring clean water, improving transit, repairing roads &amp; bridges, expanding high-speed internet.","date":"Fri Nov 05 18:27:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Every 3 &amp; 4-year-old in this country is going to attend high-quality pre-K, for no cost. And childcare and good nutrition for kids will no longer be luxuries. By itself, this is a game-changer.","date":"Fri Nov 05 18:27:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Medicare can negotiate drug prices and offer hearing coverage. That + ACA &amp; Medicaid expansion = lower healthcare costs for seniors &amp; working families.","date":"Fri Nov 05 18:27:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"7 million undocumented immigrants will gain legal certainty and work authorization.","date":"Fri Nov 05 18:27:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We are going to build more affordable housing, fix up unsafe housing, and help first-time homebuyers &amp; renters.","date":"Fri Nov 05 18:27:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"America is finally going to get serious about climate change, investing $500+ billion over the next decade in clean energy and climate resilience.","date":"Fri Nov 05 18:27:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m in. \n\nHere’s why 👇 👇 👇","date":"Fri Nov 05 18:27:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I hope you’ll join me tomorrow at 1 pm for a Veterans Town Hall in Milford.\n\nVeterans are invited to share what their service means to them and non-veterans are invited to attend, listen, and learn. https://t.co/HrrYHKAwbw","date":"Fri Nov 05 16:45:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Our congressional interns should reflect the diversity of our country. By facilitating internships for historically marginalized communities, C2C is ensuring that offices better embody their constituencies and uphold one of our nation’s core values: creating opportunities for all","date":"Thu Nov 04 17:19:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Lowering out of pocket costs isn’t just popular, it’s a moral imperative. For too long, empowering Medicare to negotiate drug prices has been a hopeful talking point. With this plan, we’re finally taking action and securing a crucial win for patients.","date":"Thu Nov 04 12:25:26 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Investing in children is the best long-term investment our country can make.\n\nTo help as many families as soon as possible, we must immediately raise childcare provider wages to a living wage, ensuring families can benefit in year one when we pass the #BuildBackBetter Act. https://t.co/0ikwkNvgvN","date":"Wed Nov 03 21:48:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Wishing the @USMC a happy early birthday! Our office loved the cake and a visit from Lance Corporal Chesty, a very good bulldog. https://t.co/eiM6VCoDXd","date":"Tue Nov 02 17:40:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Scene: Teddy decides to dump rice on Donut instead of eating while Grace loudly objects in the background.\n\nHectic mornings aren’t unique. Access to childcare shouldn’t be either. Another reason why—though it’s hard to leave—I’m heading back to DC to make sure we #BuildBackBetter https://t.co/KOd6bE8lrC","date":"Mon Nov 01 15:18:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Celebrating Halloween early at the annual @wsymca gala. Newton is home to one of the oldest YMCA’s in the country and its continued success is a testament to the hard work and dedication of its leadership and staff. Thank you for all you do for our community! https://t.co/cZsU5OIV4e","date":"Sat Oct 30 22:59:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This afternoon, my district director and I toured Fall River with Sergeant Athan Parousis, a fellow Marine.\n\nWe discussed how the city has changed in his 16 years of service — from infrastructure to public safety, as well as community policing and mental health. \n\nSemper Fi, sir! https://t.co/kMQxuNgn4S","date":"Fri Oct 29 20:44:49 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Fall River residents know what is best for Fall River. \n\nIn Congress, we empowered our states and cities with American Rescue Plan funds to build back better in their communities.\n\nWe see these funds at work today with @MayorPaulCoogan’s ARPA projects announcement. https://t.co/CcHjvTdzrc","date":"Fri Oct 29 18:57:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Three years ago today, we lost eleven lives in a horrific attack on the Tree of Life Synagogue — the deadliest act of antisemitism in American history.\n\nLet us never stop working to eradicate gun violence, antisemitism, and white supremacy. There is no room for hate here.","date":"Wed Oct 27 15:38:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We must seize this once-in-a-generation opportunity to make healthcare affordable \n\nCracking down on exploitations of exclusivity could turbocharge new therapeutics and lower the price of old ones.\n\nI strongly support meaningful Medicare negotiation in the #BuildBackBetter Act. https://t.co/H5s8RTVPc3","date":"Tue Oct 26 19:59:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We need #Secure2100 to ensure that our generation and those that come after us fulfill our sacred trust.","date":"Tue Oct 26 17:17:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@FSCDems are fighting for affordable housing; this is governance. \n\nOur GOP colleagues are debating the veracity of QAnon, if 2020 was a free &amp; fair election, and whether vaccines implant chips in arms.\n\n@HouseGOP: let us know when you're ready to govern. https://t.co/7eTMv3xoPm","date":"Fri Oct 22 16:35:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@SenTedCruz introduced a xenophobic “border bill”, and I wrote him a letter in response.\n\nWhat he intends as a threat, we consider a promise.\n\nImmigrants make our communities safer, create new jobs, and make our country stronger — they are welcome in Massachusetts. https://t.co/dZeyrsbI7Y","date":"Thu Oct 21 22:15:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, I voted to authorize $1.7 billion for grants to states to fight the opioid epidemic.\n\nMassachusetts is especially hard hit by the opioid crisis, and these funds will help those struggling with addiction. https://t.co/2Hr0Ou9GWg","date":"Wed Oct 20 22:42:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #FreedomToVote Act protects the franchise and democracy. The Senate must pass this legislation to defend every American’s access to the ballot.","date":"Wed Oct 20 17:27:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Immigration reform is essential — it’s urgent and just. \n\n#TheMomentIsNow. It’s time we deliver on our promises.","date":"Wed Oct 20 15:21:04 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This morning, I’m speaking with high school students at @SEGL. We’re talking about what it means to be a millennial in Congress, Afghanistan, and how the next generation can make a difference. https://t.co/FHZxqrKJ8g","date":"Wed Oct 20 13:21:15 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happening now!","date":"Tue Oct 19 21:32:44 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#MassSTEMWeek is an opportunity to celebrate the incredible advancements of our STEM students. From pioneering vaccine development to creating the technologies of the future, these students are transforming lives and ways of thinking.","date":"Tue Oct 19 19:31:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Archita Nemalikanti, a Hopkinton High School student, founded @missionbindi and created World Bindi Day to celebrate her culture and Hinduism. \n\nJoin our Instagram Live tonight at 5:30 PM to learn more about her inspiring work. https://t.co/v51PePiLEr","date":"Tue Oct 19 15:01:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happening now! I hope you’ll tune in.","date":"Mon Oct 18 22:02:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“‘The number represents a meaningful attempt to fund housing at the level that is necessary’… Paring back now would be a ‘false choice. I’m not going to negotiate against myself.’”\n\nAs @FSCDems, we’re fighting to keep housing in the Build Back Better Act. https://t.co/VHS6d3Odkm","date":"Mon Oct 18 15:43:16 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tonight, State Senator @cindycreem and I will host a Climate and Sustainability Roundtable to talk about federal and state climate initiatives.\n\nWill you join our Facebook Live? https://t.co/xOaA6qKQi5 https://t.co/r8ZhwN98Um","date":"Mon Oct 18 13:47:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Presidents often say that sending troops into harm’s way is the hardest decision they make. It didn’t seem too difficult for the Bush administration. @POTUS made the actual tough call: he told the American people the hard truth about a war that we could not win.","date":"Mon Oct 18 00:14:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Perfect day to spend time with family and friends at the Newton Harvest Fair. https://t.co/2jR6HWHShb","date":"Sun Oct 17 18:05:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I enjoyed hearing more about Taunton’s history and contributions to the Bay State. https://t.co/SUPdYEjxkz","date":"Sat Oct 16 22:45:14 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today at the Taunton Harvest Festival I visited the Old Colony History Museum and I wanted to share with you what I learned. https://t.co/kAATiIxav9","date":"Sat Oct 16 22:45:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Running ports 24/7 is common-sense policy to help unclog supply chains and get goods to stores, faster.","date":"Thu Oct 14 13:26:02 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Some of my favorite stops are meeting small business owners in our district. It is motivating to meet such hardworking individuals, who care about their family and community.\n\nI look forward to visiting Kimochi again.","date":"Wed Oct 13 20:49:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"His wife runs the books, he manages the front of the house, his extended family helps out at the counter, and his kids are there every day.","date":"Wed Oct 13 20:49:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Damaso co-founded Kimochi. He shared that his children inspired the opening of the restaurant and that his business is a family effort. https://t.co/rE0lm5takR","date":"Wed Oct 13 20:49:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#HispanicHeritageMonth is an opportunity to celebrate the accomplishments and contributions of the Hispanic community.\n\nI recently visited Damaso Hernandez's business in our district and wanted to share his story with you. https://t.co/EYHxarratj","date":"Wed Oct 13 20:49:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Good #MarathonMonday morning from Hopkinton where Michelle and I are cheering on runners at the start of the #BostonMarathon https://t.co/vZpPCjB3oS","date":"Mon Oct 11 12:37:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you Director Vincent Ng, Dr. Susheela Subbarao, the medical director for the Women’s Health Program, and the VA staff for helping women veterans receive high quality medical care.","date":"Sun Oct 10 13:59:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This program offers a private space for women veterans in my district and the greater Boston area to get primary care, treatment, and preventative screenings from women providers. https://t.co/3OV4ZlDfDN","date":"Sun Oct 10 13:59:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I toured the Women Veterans Health Center and the Women’s Imaging Center at the Jamaica Plain VA hospital for #BreastCancerAwarenessMonth. https://t.co/zK94VSFRKI","date":"Sun Oct 10 13:59:21 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Massachusetts can lead the way in making on-demand transit a reality. That's why I've been partnering with @ridewithvia to bring infrastructure into the modern era. We have the talent &amp; tools to build a more fair &amp; prosperous economy. We need better infrastructure. Let's build it","date":"Sat Oct 09 20:00:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We reaffirmed our commitment to championing affordable housing in Congress. Rep. Torres and I know that housing is a human right, and we are working hard to make sure housing priorities are included in reconciliation.","date":"Thu Oct 07 22:34:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"After our tour, we had a discussion with attendees about what we are working on and heard how we can best uplift their voices in Congress. They shared with us the many ways they are working to make sure everyone in their communities has a home.","date":"Thu Oct 07 22:34:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Yesterday, we toured Newton Housing Authority’s Norumbega Gardens with affordable housing experts and stakeholders.","date":"Thu Oct 07 22:34:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My friend @RepRitchie and I believe that housing is infrastructure, and we are committed to creating a future where your wealth does not determine whether or not you are safely housed. https://t.co/F4lWx7IGyb","date":"Thu Oct 07 22:34:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My friend &amp; fellow @FSCDems member, @RepRitchie and I know housing is infrastructure. We’re hosting a discussion live now with the Newton Housing Authority about the $327 billion in recommendations on housing provisions in the #BuildBackBetter bill. WATCH: https://t.co/Rn4J6qiCj5","date":"Wed Oct 06 17:32:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This morning, Eagle Scout Brendan Kelley interviewed me for the Library of Congress’s Veteran History Project.\n\nBrendan is a Marine Corps recruit and leaves for training next week. We spoke about my experiences as a Marine as he prepares to serve our country. https://t.co/7dLgaYPuG7","date":"Wed Oct 06 14:51:17 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just walked off the House floor after voting for a temporary extension of funding for surface transportation programs. This ensures that as we continue to negotiate the Build Back Better Agenda there are no furloughs and capital improvements can proceed at pace. https://t.co/2uAfKGcjWM","date":"Sat Oct 02 00:02:16 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just left a meeting with @POTUS: we’re going to pass both bills. \n\nThe Build Back Better agenda is a test of our democracy. \n\nAutocratic leaders tell the president that they don’t think democracy works in the 21st century. \n\nWe’re going to prove them wrong. https://t.co/jF4XH9s1VZ","date":"Fri Oct 01 21:27:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"See you soon 👇👇👇","date":"Thu Sep 30 12:53:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@RepCawthorn does not understand armed service to one’s country. Today I rose to correct the record. \n\nStuart Scheller did not “stand up to incompetence” — he broke his oath. The same oath I took 11 years ago. \n\nHe’s not a martyr; he’s a liability to our national security. https://t.co/fhoBlys6Ys","date":"Wed Sep 29 18:18:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@HouseDemocrats have a historic opportunity to make transformative change.\n\nThis isn’t about winners and losers — Americans are going to remember the results, not the process. \n\nWe’re going to pass both the Build Back Better Act and the Bipartisan Infrastructure package. https://t.co/ssO8uiLUcg","date":"Tue Sep 28 20:52:32 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today is National Voter Registration Day and it’s more important than ever to make your voice heard.\n\nAre you registered to vote? https://t.co/DrX416l8vC https://t.co/PBZ0mpMRtz","date":"Tue Sep 28 15:38:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Teddy and I enjoyed spending our afternoon at Newtonville Village Day — especially our train ride. https://t.co/UXJhPYzWcu","date":"Sun Sep 26 22:23:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We are calling on @POTUS to establish the formation of an Afghan Refugee Resettlement Advisory Council, led by Afghans and refugee + veteran groups. \n\nAfghans and those groups already mobilized and doing the work must have their voices heard at the decision-making table.","date":"Fri Sep 24 22:30:22 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, I joined my pro-choice colleagues on the steps of Congress to celebrate the historic passage of the Women’s Health Protection Act. \n\nAbortion is healthcare. As @HouseDemocrats, we are committed to protecting the freedom to choose. #WHPA https://t.co/rkn5TYelra","date":"Fri Sep 24 18:13:26 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In order to help tenants stay housed, we must understand the discrepant impact of evictions in neighborhoods across the country. \n\nBy developing a comprehensive federal eviction database, we are taking the first step needed to ensure housing stability for everyone.","date":"Fri Sep 24 14:45:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"You don’t have to be a veteran to know that the defense budget is out of control. Unfortunately, this budget doesn’t reflect that reality. https://t.co/Hzoiwc7bni","date":"Fri Sep 24 00:39:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Catching up with @BarneyFrank in the cloakroom. https://t.co/2NAS1L6P3h","date":"Thu Sep 23 21:16:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"After advocating for additional flexibility for Coronavirus Capital Projects Fund allocation, I am happy to share that the Treasury Department agreed to these terms.\n\nThis is a win for early education and workforce development in Massachusetts. https://t.co/fH5BIREQCz","date":"Thu Sep 23 13:26:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It’s time to expand Medicaid and give domestic workers a long-overdue raise and vastly increase covered services for aging families. \n\nLet’s pass both the Build Back Better Act and bipartisan infrastructure bill to right this wrong https://t.co/03HI34V4XY","date":"Wed Sep 22 18:48:23 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Soon, we’ll vote in Congress on a budget resolution that includes funding to expand access to high-quality, affordable childcare and early education. \n\nAs @HouseDemocrats, we’re working to make sure all children and families have access to the care and education they deserve. https://t.co/bkGkpmz7u3","date":"Tue Sep 21 21:07:33 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The childcare services provided by Mother Hubbard should be available for children everywhere, but for too many families, childcare is unaffordable.","date":"Tue Sep 21 21:07:31 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The @SecondGentleman read “The Very Hungry Caterpillar,” by Massachusetts own’s Eric Carle. The children knew this book well, reciting their favorite lines alongside the Second Gentleman. https://t.co/AKlCYxPm7l","date":"Tue Sep 21 21:07:30 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We met Dorothy Vecchiolla, who founded the preschool in 1961, and Pamelia White, the center’s director of 40 years. They have offered a lifetime of care for our little ones. https://t.co/MSANJdbWer","date":"Tue Sep 21 21:07:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Yesterday, the @SecondGentleman and I visited the Mother Hubbard Pre-School Center. https://t.co/Su99IAParg","date":"Tue Sep 21 21:07:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Jessica shared the importance of treating our early educators with the same respect we give to K-12 teachers, and I completely agree.\n\nEarly educators deserve the same pay and benefits as our public school teachers.","date":"Mon Sep 20 22:31:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The @SecondGentleman and I know that 1) The Very Hungry Caterpillar is an excellent book and 2) every child deserves access to affordable early education and childcare. https://t.co/ns9pU7eXpU","date":"Mon Sep 20 16:31:14 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tour de Newton is a celebration of the best of Newton — a safe, environmentally-friendly way to enjoy the people and small businesses in our neighborhood.\n\nI remain committed to moving away from auto-centric cities, and working towards a sustainable future. https://t.co/SQW0mqzecl","date":"Sun Sep 19 18:49:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On my way to the start of Tour de Newton, I joined the Newton Senior Center Walk to End Alzheimer’s.\n\nAlzheimer’s and dementia have touched so many of our lives, and I appreciated hearing their stories and seeing their determination to end these diseases. https://t.co/vzSLWzSVS5","date":"Sun Sep 19 18:49:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Later, I attended the Brockton Greek Food Festival with Rep. Claire Cronin. https://t.co/evNv79mDMs","date":"Sun Sep 19 18:22:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Yesterday, @PaulFeeneyMA and I participated in the Afghan Refugee Donation Drive, hosted by the Attleboro Council on Human Rights \n\nLet’s do our part to ensure that refugees settling in our communities have the essentials they need to feel safe and comfortable in their new homes. https://t.co/lpJAfNalUE","date":"Sun Sep 19 18:22:02 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This morning, State Senator @PaulFeeneyMA and I hosted a constituent meet and greet in Foxborough.\n\nI love hearing from you about what’s on your mind. https://t.co/NaGeDJ4xzt","date":"Sat Sep 18 15:34:52 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Families and individuals seeking refuge in our country should have access to kosher and halal foods, and it’s time we meet their needs.","date":"Fri Sep 17 23:56:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Enjoying my maple walnut cone from @CabotsIceCream to celebrate National Small Business Week. https://t.co/B3vHtcUlqu","date":"Fri Sep 17 22:12:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Compare this hateful rhetoric to the people of Massachusetts opening up their hearts and homes to refugees. \n\nI hope you will join me in welcoming Afghans resettling here with the respect and kindness they deserve.","date":"Fri Sep 17 18:45:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This Citizenship Day, let’s celebrate that our country is immeasurably enriched by immigrants. \n\nThe Build Back Better Agenda offers the best chance for a pathway to citizenship in 35 years — we’re going to get it done. #WeAreHome https://t.co/stf5r22MsZ","date":"Fri Sep 17 16:59:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I am wishing those observing Yom Kippur a meaningful day of self-reflection and an easy fast.","date":"Wed Sep 15 23:01:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I hope you will join State Senator @PaulFeeneyMA and me on Saturday at 9:30 am for an outdoor meet and greet in Foxborough. I look forward to meeting you and hearing about the issues that matter to you. https://t.co/ydLOhi7p9C","date":"Wed Sep 15 17:05:21 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This National Small Business Week, I’d like to learn your favorite places to shop and eat locally. From Newton to Fall River, what are your favorite small businesses in our district?","date":"Tue Sep 14 21:56:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@SecBlinken knows we can't talk about the last 20 weeks without talking about the last 20 years. Counterinsurgencies are political initiatives – and there was no political endgame in Afghanistan. The military mission now returns to where it rightfully began: counter-terrorism.","date":"Mon Sep 13 19:12:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Each year, affordable housing becomes harder to find. @FSCDems are working to solve this crisis. \n\nToday, we are marking up legislation to make historic &amp; long-overdue investments in our housing infrastructure.\n\nWATCH today’s markup: https://t.co/i8PrsR5nkj","date":"Mon Sep 13 16:23:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I can still picture the images, remember the coverage, the sickening sense in your stomach. \n\nNational tragedies become imbued with so many other meanings, and my focus today is on the victims— the nearly 3,000 victims who lost their lives and what was taken from them. https://t.co/twh5kCmLjY","date":"Sat Sep 11 15:43:44 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Some state and local eviction moratoriums are still in place, and you can check if your area qualifies with this site. https://t.co/oqaxQLGmiE","date":"Wed Sep 08 14:40:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Lawyers are unaffordable for so many facing evictions, but there are resources to help. Find out if you qualify for free legal aid here: https://t.co/oEHzQAOgGi","date":"Wed Sep 08 14:31:44 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Know your rights if you are facing eviction: https://t.co/Aa5E2qMzpU","date":"Wed Sep 08 14:31:44 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Rental assistance is available. Find a rental assurance program for your state, tribe, or local area here: https://t.co/Gbl74NKQWa","date":"Wed Sep 08 14:31:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congress allocated millions in funding to help tenants stay in their homes, but these funds are not getting in the right hands. \n\nWe must do better. \n\nHere are resources for those facing eviction ⬇️ https://t.co/bU2dIsviEi","date":"Wed Sep 08 14:31:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Shana Tova to all who celebrate. May the new year bring health and harmony.","date":"Mon Sep 06 23:00:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you to the @GBLCBoston for the great event today and for tirelessly supporting and advocating for workers across our region. https://t.co/JktNVMR84H","date":"Mon Sep 06 18:56:26 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Labor Day, we are reminded of the hard-fought achievements of the labor movement. But the work is not over.\n\nThat’s why I voted to pass the PRO Act last March — the most substantial improvement for workers’ collective bargaining rights in 80 years. https://t.co/DyieIeMnP7","date":"Mon Sep 06 18:56:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The world needs America to lead. \n\nThe fight against Covid-19 is a transnational challenge that calls for vision and boldness, and the COVID-19 Global Vaccination Caucus is up to the task.","date":"Fri Sep 03 22:04:32 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Texas’s restrictive abortion ban denies the freedom of choice for millions. \n\nAbortion is health care and all people deserve the right to make decisions for their own bodies. \n\nCongressional Democrats are committed to defending reproductive freedom. This fight is not over.","date":"Wed Sep 01 17:39:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We lost more than 93,000 lives last year to overdose. \n\nOverdoses are preventable and we must do more, which is why I cosponsored the Mainstreaming Addiction Treatment Act. #EndOverdose https://t.co/pyxq5ZRPF0","date":"Tue Aug 31 21:34:52 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Personal accountability to the mission is what Joe Biden exemplified when he took office. In a war that was defined by Commanders-in-chiefs passing the buck to their successors, the buck stopped with Joe Biden. https://t.co/9pgZE0QEIM","date":"Tue Aug 31 17:22:44 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Looking forward to joining @SRuhle around 9:25 AM ET","date":"Tue Aug 31 12:47:08 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tens of thousands of Afghans and Americans died over the last 20 years in a counterinsurgency that had no political endgame. \n\nPresident Biden’s key insight was that we could win every battle but still lose the war. We had no choice but to leave. https://t.co/qkDhWMC9q0","date":"Tue Aug 31 00:39:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Teddy and I attended  “Family Food Fair” with @NewtonMAMayor to mark Newton’s first Food Insecurity Awareness Week. This was a great family-oriented even for the entire community to learn about combating food insecurity. Thanks to all who helped make it a success! https://t.co/LHqePxfQHF","date":"Sun Aug 29 14:22:59 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"58 years have passed since the #MarchOnWashington, and the fight to protect the franchise continues.\n\nThe Senate must abolish the filibuster and pass the John Lewis Voting Rights Advancement Act.\n\nThere’s nothing more critical than protecting the vote.","date":"Sat Aug 28 21:16:22 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As a veteran and a young member of Congress I feel a special responsibility that the next time a Bush-like president tries to blunder and bluster their way into an endless war like this, that we stop it. That we make sure @RepBarbaraLee has some support. https://t.co/CtqXZHehOf","date":"Sat Aug 28 20:10:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"A lecture from the party of Donald Trump on prudence in foreign policy is hard to stomach. This is the party that stood by while the former president tried to sell his office to the Russians. I am not going to countenance a lecture or condescension from @GOPLeader. https://t.co/5R606r2Du1","date":"Fri Aug 27 16:50:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tune in at 12:15!","date":"Fri Aug 27 16:01:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The terrorist attack on the Kabul airport is an atrocity and the deaths of more U.S. service-members a tragedy. It is further proof that the Biden administration must complete evacuations, quickly, and sustain a robust counter-terrorism mission in Afghanistan, indefinitely.","date":"Thu Aug 26 19:10:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tune in at 10:05 AM ET!","date":"Thu Aug 26 13:36:20 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@POTUS made the right decision. There’s no glory in it, but there is integrity. My generation, which fought this conflict, must now learn its lessons. And be ready to prevent another endless war. Read my @washingtonpost oped here:\n\nhttps://t.co/BDuqrsEcTR","date":"Wed Aug 25 21:07:22 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m back in Washington and just walked off the House floor where I urged my colleagues to pass both the Build Back Better Act and the bipartisan infrastructure bill. To fully deliver on our Democratic agenda we must pass both  to take the necessary steps to combat climate change. https://t.co/yicyZOes0M","date":"Mon Aug 23 21:52:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As I said this morning on @FCPwithGreta, Americans have never had a strong a strong political partner in Afghanistan. https://t.co/Wu5DBOK3Y3","date":"Sun Aug 22 22:26:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Focus has been put on Taliban horsepower. I think more salient is the lack of Afghan willpower. The idea that we had leverage with the Afghan military or with the Afghan central government has been pretty disproved by watching them cave in a matter of days.https://t.co/zWsUqmu3m4","date":"Sat Aug 21 21:54:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We made promises. We should keep them.","date":"Fri Aug 20 19:13:48 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I've spoken with White House national security officials. They have made clear that mission one, two, and three are evacuations for American personnel and Afghan allies. I'm going to be holding them to account for that. More from my @NewsHour interview with @JudyWoodruff 👇🏻 https://t.co/P9bD1w6IOZ","date":"Thu Aug 19 23:38:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The bipartisan infrastructure bill makes important investments, but we need to do more for climate resilience and getting to a carbon-neutral economy. \n\nPassing the reconciliation package is our best chance to protect the climate for future generations. https://t.co/M4s6kBy5pE","date":"Wed Aug 18 17:34:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Our office remains committed to doing everything we can to help you and your loved ones find safety.","date":"Tue Aug 17 19:53:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"For additional resources for those seeking refugee assistance, please visit the Refugee Processing Center's website at https://t.co/z0MqOjO3E7.","date":"Tue Aug 17 19:53:49 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Email MA04JACasework@mail.house.gov with the subject line “Urgent/Afghanistan” and our staff will help you as quickly as possible.\n\nYou can also DM my Twitter, Facebook, or Instagram, and our staff will assist you.","date":"Tue Aug 17 19:53:49 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"If you are or know of someone with an approved petition for a Special Immigrant Visa needing assistance, please contact the State Department directly by calling 1-603-334-0828 or emailing NVCSIV@state.gov.","date":"Tue Aug 17 19:53:49 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My great-grandparents fled Russian pogroms for America as refugees — the plight of the refugee is personal to my family, as it is for so many of you across our country.\n\nHere is a thread of resources for those needing to leave Afghanistan, and for their family and loved ones:","date":"Tue Aug 17 19:53:48 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"There’s been a continued sunk-cost bias over the last 20 years saying “more troops, more time, more treasure,” when we never had a viable partner in Kabul. \n\nThe Afghan president fleeing in the face of the Taliban is an exemplar of the partnership we’ve had for two decades. https://t.co/aHnteORssG","date":"Mon Aug 16 13:35:31 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"President Biden knew the realities of a Taliban takeover, as did his predecessors, but he made the decision to not continue a failing war. He knew that we could stay 6 months or 20 more years and our outcome would not change. \n\nWe could win every battle and still lose the war. https://t.co/TQxSLCNuxK","date":"Mon Aug 16 00:14:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“We finally have a commander-in-chief willing to speak with integrity about this failed forever war so I’m not interested in what chicken hawks and carnival barkers on the other side of the aisle have to say” https://t.co/ISRUt4khuu","date":"Fri Aug 13 21:12:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"@RepJayapal, @CongressmanRaja, @RepRoKhanna, @RepSaraJacobs, and @RepScottPeters.","date":"Fri Aug 13 19:01:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I led 21 members of Congress in introducing a resolution expressing support for the US Gov’t to be a guaranteed buyer of vaccines and for the US to develop a ‘‘Marshall Plan’’ for vaccinations to ensure a global recovery from COVID-19. \n\nEveryone deserves access to the vaccine.","date":"Fri Aug 13 19:01:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you for cosponsoring: \n@RepEspaillat, @RepDeborahRoss, @repdinatitus, @EleanorNorton, @RepBowman, @RepMcGovern, \n@RepChuyGarcia, @RepJoeNeguse, @RepJohnLarson, @RepJudyChu, @RepKahele, @repmarkpocan, @RepMarkTakano, @RepStricklandWA, @RepNikema, @WelchForVT (1/2)","date":"Fri Aug 13 19:01:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My daughter was just born, but when the House takes up the budget resolution I’ll be there to vote on it. It’s that important. \n\nWe’re going to pass a long-overdue infrastructure bill and reconciliation bill that will increase productivity and lower costs for working families.","date":"Thu Aug 12 14:58:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The Infrastructure Investment and Jobs Act will rebuild our failing bridges and roads and deliver clean water, all while creating jobs right here at home to get it done.","date":"Tue Aug 10 16:07:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"@TommyVitolo Thank you, @TommyVitolo!","date":"Tue Aug 10 00:39:33 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"@RepColinAllred Thank you, @RepColinAllred!","date":"Mon Aug 09 21:01:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I am excited to be spending some time with my family as we celebrate the birth of my daughter, Grace. https://t.co/KUCJj6WWSz","date":"Mon Aug 09 15:56:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"56 years later, and the #VotingRightsAct is still under attack. \n\n@HouseDemocrats are fighting to protect the ballot, and you can help.\n\nWatch my video with @RepNikema to learn how you can get involved 👇","date":"Fri Aug 06 15:03:32 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Richard Trumka was a force to be reckoned with — lifting up the voices of hardworking Americans and shaping Democratic politics for the better. \n\nHe will be sorely missed. My thoughts are with his family and loved ones at this time.","date":"Thu Aug 05 17:03:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Global coronavirus cases surpassed 200 million today.\n\nAs countries around the world are desperate for vaccines, too many Americans are making the choice to not get vaccinated.\n\nThis needs to change. Get vaccinated. Take care of yourself and your loved ones.","date":"Wed Aug 04 21:19:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#ExtendTheMoratorium","date":"Tue Aug 03 18:05:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Two years ago, 23 died in a domestic terrorist attack in El Paso — families and lives destroyed because of a senseless act of violence.\n\nSince then, tens of thousands have lost their lives to gun violence.\n\nGun reform can’t wait. Abolish the filibuster and #EndGunViolence.","date":"Tue Aug 03 16:07:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"For Massachusetts residents — the Mass Federal Emergency Rental Assistance Program (ERAP) can help you with rent and mortgage payments: https://t.co/l8QFd8NgOC","date":"Mon Aug 02 18:34:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Another tool for finding additional local rental assistance: https://t.co/G1IkLoiyXx","date":"Mon Aug 02 18:34:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congress needs to act on the eviction moratorium, and state and local governments must swiftly distribute the resources @HouseDemocrats passed for rental relief. \n\n👇Resources below for those in need 👇","date":"Mon Aug 02 18:34:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"To find emergency help with rent and utilities in your state, go here: https://t.co/Gbl74NKQWa","date":"Mon Aug 02 18:34:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"For Massachusetts residents — the Mass Federal Emergency Rental Assistance Program (ERAP) can help you with rent and mortgage payments: https://t.co/l8QFd8NgOC","date":"Mon Aug 02 18:31:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It’s easy to feel powerless as Republicans across the country pass voter suppression laws. \n\nBut don’t lose faith — our democracy needs your help.\n\nI spoke with my friend @RepNikema, a leader in the fight for voting rights, to share how you can protect the vote. https://t.co/7g9bZVyg1z","date":"Fri Jul 23 17:22:32 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"To find emergency help with rent and utilities in your state, go here: https://t.co/Gbl74NKQWa","date":"Mon Aug 02 18:31:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The Treasury Emergency Rental Assistance Dashboard is another useful tool to find rental assistance programs in your area. https://t.co/G1IkLoiyXx","date":"Mon Aug 02 18:31:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Are you or a loved one in need of the vaccine? The VaxBus will be in Attleboro this Wednesday from 1 pm to 7 pm. \n\nGet vaccinated and protect yourself and your community. https://t.co/mcQ69MTq18","date":"Mon Aug 02 13:40:48 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I am thrilled to see Dr. Deborah Lipstadt confirmed as the US Antisemitism Envoy. Her expertise is invaluable. \n\nI look forward to working with her to end antisemitism.","date":"Fri Jul 30 18:37:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"For the first time in nearly 50 years, @HouseDemocrats  passed a spending bill without the #HelmsAmendment, protecting reproductive freedom for women around the globe.","date":"Thu Jul 29 15:35:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"✅ Introduced my bill\n✅ Released by committee \n\nNext step: the House floor!","date":"Thu Jul 29 13:58:30 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"A big thank you to my thoughtful staff who surprised me with a card and gift for my soon-to-be born daughter! https://t.co/36cVcIeoHV","date":"Thu Jul 29 13:15:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Kristi Kirshe (@KirsheBar) of Franklin is a starter on the US women’s rugby sevens team. \n\nShe competes tonight at 9 pm ET in a matchup with China. Make sure to tune in and cheer Kristi on! #HometownHero","date":"Wed Jul 28 14:45:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Dr. Gevvie Stone (@gevgevs) is a rower from Newton and a 3x Olympian — winning the silver medal in the 2016 Summer Olympics. \n\nYesterday, she helped Team USA to a 5th place finish. \n\nIt wasn’t enough to be an Olympic medalist — she’s a physician, too!","date":"Wed Jul 28 14:45:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Meet the Olympians representing the Fourth District!\n\nYour tenacity and determination is an inspiration to us all, and we are proud to have you representing our country. https://t.co/c4ujRb6FdG","date":"Wed Jul 28 14:45:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Working families thrive when they have access to high quality, affordable childcare.\n\nThat’s why I voted for the @HouseDemocrats’ funding bill today to increase investments for child care and early learning programs. #ForThePeople","date":"Tue Jul 27 20:23:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"What happened on January 6th was personal for every American. We saw a traumatizing attack on our democracy. \n\nToday, we will begin to find answers and ensure that this never happens again.","date":"Tue Jul 27 15:01:44 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m chatting with The Establishment on Stephen Colbert Presents @tooningout this Wednesday. Toon in! https://t.co/ebEx7SG8ua","date":"Tue Jul 27 14:14:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"31 years ago, the Americans With Disabilities Act became law. \n\nThe ADA is a civil rights victory — protecting and empowering the 55 million Americans living with a disability, and creating a more equal future for all.","date":"Mon Jul 26 22:24:08 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My haircut has changed but the minimum wage hasn’t. \n\nIt’s time to raise the wage. #12YearChallenge https://t.co/hvYoowbG44","date":"Sun Jul 25 00:07:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As Congresswoman Williams said, we need you to call the Senate!\n\nTell Leader Schumer and your Senators that we need to abolish the filibuster and pass HR1 and the John Lewis Voting Rights Act. \n\n📞 CALL: 202-224-3121 📞","date":"Fri Jul 23 17:23:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It’s easy to feel powerless as Republicans across the country pass voter suppression laws. \n\nBut don’t lose faith — our democracy needs your help.\n\nI spoke with my friend @RepNikema, a leader in the fight for voting rights, to share how you can protect the vote. https://t.co/7g9bZVyg1z","date":"Fri Jul 23 17:22:32 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today’s community project is the Medway Water System Improvements. \n\nI advocated for $2.75 million in funding for improvements, which will enable economic development and ensure clean drinking water for generations to come. https://t.co/kDGCKk3Y8g","date":"Thu Jul 22 23:35:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m proud that we passed the ALLIES Act today. This bill will increase the Afghan SIV allotment by an additional 8,000 visas and expedite the visa process.\n\nWe made promises to those who stood by our side, and we’re going to keep our word. #TakeThemToo https://t.co/twoF7zJcIh","date":"Thu Jul 22 20:08:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@SpeakerPelosi reached out her hands to Republicans and said “let’s make this bipartisan,”… and the Republicans chose Trump over truth. \n\nNow they’re having a tantrum because the Speaker is insisting that this actually be an objective committee. \nhttps://t.co/x75mZtBMwz","date":"Wed Jul 21 22:33:21 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@TransportDems' #INVESTAct passed the House of Representatives, and now it's on the Senate to turn this bill into reality. (4/4)","date":"Tue Jul 20 23:10:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"These are infrastructure dollars at work to improve public safety and boost housing development. (3/4)","date":"Tue Jul 20 23:10:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I secured $1.5mil in funding as part of the #INVESTAct to transform this intersection into a safe location for drivers and pedestrians, as well as support the construction of 72 new housing units. (2/4)","date":"Tue Jul 20 23:10:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today’s transportation project is the West Street and Route 27 Intersection Improvements in Medfield.\n\nThis intersection is one of the most dangerous in our state — it's time for that to change. (1/4) https://t.co/aRFy6BfZoO","date":"Tue Jul 20 23:10:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I send my best wishes to those celebrating Eid al-Adha in Massachusetts and around the world. Eid Mubarak!","date":"Mon Jul 19 23:37:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I advanced legislation to grant $2,000,000 for Bristol Community College to develop the National Offshore Wind Institute, which will provide the training and tools needed to develop a strong offshore wind sector.","date":"Mon Jul 19 22:10:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Southeastern Mass should lead the offshore wind revolution, and this institute paves the way. This will be a generational investment in clean energy and economic development for Southeastern Bay Staters.","date":"Mon Jul 19 22:10:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"You can learn more about my community project funding requests here: https://t.co/2YUfub6JSH","date":"Mon Jul 19 22:10:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Each day this week, I’ll highlight a different community project funding request I advocated for in Congress. \n\nToday’s project is @BristolCC’s National Offshore Wind Institute. \n\nThread ⬇️⬇️⬇️ https://t.co/UBBd9dVRAI","date":"Mon Jul 19 22:10:04 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Massachusetts can and should lead the way with clean energy and offshore wind. It’s not an “either or,” it’s a “yes and,” when talking about creating jobs and fighting climate change. https://t.co/HKDgZMtBd3","date":"Mon Jul 19 14:41:15 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This callous ruling throws the futures of young people across our country into jeopardy.\n\nDreamers — you belong here and we will fight for you in Congress.","date":"Fri Jul 16 22:29:23 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I support @RepMaxineWaters’ #HousingIsInfrastructure Act because it will:\n\n✅ improve the affordability of housing \n✅ reduce the racial wealth gap \n✅ end housing discrimination","date":"Fri Jul 16 18:35:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We need everyone on board to reduce greenhouse gas emissions. \n\n@AmericanAir's commitment to setting a science-based target for reducing greenhouse gas emissions is an important step, and I hope the rest of the airline industry will take note.","date":"Fri Jul 16 16:49:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I toured @BarrettMedical to announce a $1.6mil grant from the @NIH to advance the Burt robotic system. \n\nBarrett represents the best in innovation. I’m proud to share that the NIH is investing in their groundbreaking work that will change lives for decades to come. https://t.co/YsWNPLerbN","date":"Fri Jul 16 15:56:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I visited a @YMCA in Newton to mark the first day of #ChildTaxCredit payments. \n\nFrom Lakeville to Brookline, the expanded child tax credit will help almost 60% of children in our district, and lift 3,800 children out of poverty. https://t.co/2UCCVQcjIu","date":"Thu Jul 15 20:04:15 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Nearly 39 million families will begin receiving their #ChildTaxCredit payments today.\n\nHow will this tax relief help your family?","date":"Thu Jul 15 18:38:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"TODAY is the day! Today marks the start of monthly #ChildTaxCredit payments. I am proud of the work @HouseDemocrats and @POTUS have done to get this much-needed aid to millions of Americans.","date":"Thu Jul 15 16:25:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Teddy and I had a great time at Festa this evening! We learned of one of the original Festa organizers from her daughter and granddaughter. https://t.co/M3l7ARPQB9","date":"Thu Jul 15 00:52:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Do you still have questions about the #ChildTaxCredit? You’re not alone. \n\nLearn the basics here 👇\nhttps://t.co/7Mrr2BnHuh","date":"Wed Jul 14 18:05:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Care workers are the cornerstone of the economy. \n\nI stand with @SEIU because we need to invest in our care infrastructure and create good union jobs to build back better. #CareIsEssential","date":"Tue Jul 13 17:35:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The expanded Child Tax Credit will cut child poverty in half and help us build an economy that works for everyone.\n\nNow, let’s make the expansion permanent. https://t.co/3lVClnN5gX","date":"Fri Jun 25 18:13:33 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Why do we need an expanded #ChildTaxCredit? Because 1 in 7 children in America experience poverty. \n\nThe Child Tax Credit would cut that rate in half.","date":"Tue Jul 13 16:59:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #INVESTAct included funding for 6 local projects that I advocated for and it passed the House. \n\nInfrastructure is another opportunity for the federal government to deliver for Massachusetts.\n\nRead more here 👇👇👇","date":"Tue Jul 13 16:17:02 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In just 3 days, millions of families will finally receive the support they need to help boost our economy and invest in a better future. #ChildTaxCredit","date":"Mon Jul 12 18:27:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The US Capitol is the People’s House.\n\nJournalists, advocates, constituents, and tax payers have every right to walk into the Capitol and talk to their representatives. \n\nTaking the fencing down this weekend was a welcome step. https://t.co/NyZC7sjmGD","date":"Sun Jul 11 21:59:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"See you at 12:25 pm ET!","date":"Fri Jul 09 16:18:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"3 months ago, President Biden signed the American Rescue Plan into law. I called on him to update us on how those funds are being used for international relief. \n\nOur return to normal will not keep up if the virus continues to mutate and ravage our international neighbors. https://t.co/4s1ny1yHii","date":"Thu Jul 08 21:26:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Just left the future site of the Taunton Bike Trail, a project I advanced funding for in the #INVEST Act.\n\nThrough greater connectivity, this trail will unlock economic development, boost public recreation, and knit together Taunton and Dighton’s communities. https://t.co/SOxYlcVJM4","date":"Thu Jul 08 19:04:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I joined @SenMarkey and @USRepKeating at @BristolCC’s future site of the National Offshore Wind Institute. \n\nSoutheastern Mass can and should be the center of the offshore wind revolution, and this institute paves the way forward. https://t.co/TQecToFQ16","date":"Thu Jul 08 17:09:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I made a promise to my Afghan interpreters, and our country did, too. It’s on us to keep our word.","date":"Thu Jul 08 14:00:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m advocating for $2.75 mil in funding for Medway Water System Improvements. These improvements will support expanded economic development and ensure clean drinking water for generations to come. https://t.co/LrKss4HFdF","date":"Wed Jul 07 23:31:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The Glen Brook affordable housing development is the future home to 90 units and a prime example of why we need to expand the Low Income Housing Tax Credit Program at the federal level.\n\nWhen we expand that program, we expand affordable housing for everyone. https://t.co/TP614ajxIW","date":"Wed Jul 07 23:26:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The West Street &amp; Route 27 Intersection is one of the most dangerous intersections in the state, with 3 accidents in the last 10 days. \n\nI secured $1.5 mil in funding through the #INVEST Act so that we can fix this intersection, improving public safety and traffic flow. https://t.co/YbLbSHcyIm","date":"Wed Jul 07 23:23:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you to the residents at the North Hill retirement community in Needham for hosting me this morning for a town hall. \n\nI got some of the best questions I’ve ever received about climate change, health care, and reforming Washington. https://t.co/NyXS9RxZMW","date":"Wed Jul 07 16:55:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I hosted community office hours at Morin’s in Attleboro with Rep. Jim Hawkins as my special guest. I heard from constituents about issues ranging from transportation to job creation. https://t.co/KJgojXSAOV","date":"Wed Jul 07 00:18:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I ended my day at the Plainville Water Dept., discussing the need for the $1.5 million in funding I requested in Congress to expand the water department, helping our community and ensuring everyone has access to safe &amp; clean water. https://t.co/12bKFsJdQq","date":"Wed Jul 07 00:03:13 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"After a week of voting and passing the #INVEST Act, it’s great to be back in the district. This morning, I passed out meals with volunteers at the @AttleboroAIC, which helps students in need while school is out for the summer. https://t.co/Zr7VEsTaKk","date":"Wed Jul 07 00:03:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Join @carsondomey and me on Thursday, July 8th, for a conversation about youth mental health. Carson is a high school student, mental health advocate, and a leader in student suicide prevention.\n\nWe’ll host a live Q&amp;A to answer your questions about improving mental health. https://t.co/pXyNyc3v76","date":"Tue Jul 06 21:36:26 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congratulations to Taunton’s softball team for winning their sixth state championship. Enjoy your well-deserved celebration, and know that you've made our district proud.","date":"Tue Jul 06 19:37:59 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I enjoyed visiting the North Attleboro Veterans 4th of July celebration. From meeting a 99-year-old WWII vet to speaking with others who served, these men and women defended the values we celebrate today: liberty, justice, and democracy. https://t.co/AKyDZI0baG","date":"Sun Jul 04 21:24:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"After missing last year, it’s a joy to spend this Fourth of July with neighbors and loved ones.\n\nGet vaccinated, stay safe, and enjoy the holiday weekend!","date":"Sun Jul 04 17:47:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Yesterday, we passed the @TransportDems’ #INVEST Act, a generational investment in American infrastructure.\n\nI’m thrilled that it passed for four big reasons: \n\n🌎 the environment\n🚊 transportation\n💪 jobs\n🔬R&amp;D. \n\nWatch to learn more. https://t.co/flBcbWBKqT","date":"Fri Jul 02 18:45:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We support Rabbi Noginski and we stand against antisemitism. This Fourth of July, I am reflecting on Jews as partners in justice in our country’s history, and committing that they – as all Americans – must be secure in life, liberty, and the pursuit of happiness. https://t.co/x3jtXCcdwp","date":"Fri Jul 02 17:02:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We’re working late passing amendments for the @TransportDems’ #INVESTAct, a generational investment to transform infrastructure. \n\nWe just passed my amendment, which will expand mobility-as-a-service — creating more sustainable transit options and less traffic and pollution. https://t.co/IPz2UOtGRE","date":"Thu Jul 01 02:06:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On the last day of Pride Month, I’d like to celebrate Councilor @HollyRyanMA, the first openly transgender woman to serve on a city council in Massachusetts. Thank you for your legacy of LGBTQ+ activism and change making. #LocalPrideHeroes https://t.co/knEb3Rp4Rg","date":"Wed Jun 30 22:14:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congress needs to deliver accountability and transparency — and that means establishing a select committee. \n\nAmericans deserve to know what happened in the People’s House on Jan. 6th.","date":"Wed Jun 30 00:47:20 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thanks to the #AmericanRescuePlan, over 3 million Bay Staters have received their stimulus checks. We’re putting money in pockets and building an economy that works for everyone.","date":"Tue Jun 29 23:03:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congress is passing an infrastructure bill, with or without Republican support. \n\nFrom fixing bridges and roads to ensuring that everyone has clean water, Democrats are going to pass the @TransportDems’ #INVESTAct and deliver what the American people want. https://t.co/9Vjqel12CR","date":"Tue Jun 29 20:30:59 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I was honored to speak at the first Hopkinton Pride parade today.\n\nWe’ve made transformative changes in the United States, but we still have so far to go to make sure that everyone is treated with the dignity and respect they deserve. https://t.co/42iC84FJTE","date":"Sat Jun 26 22:11:23 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Massachusetts has always led the way on progress, and my generation has an opportunity to help make more lasting change for the LGBTQ+ community. \n\nI’m committed to doing so in Congress. https://t.co/OmJRHl3prv","date":"Sat Jun 26 20:30:32 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happening now: join Rep @TommyVitolo and me for community office hours at Tatte Bakery and Café in Brookline. Let’s talk about the issues that matter to you. https://t.co/hIaFPpCDZc","date":"Sat Jun 26 15:01:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Restoring the Bridle Path will allow for new, accessible modes of transportation on Beacon Street. This in an opportunity for greater connectivty between neighbors, friends, and the community we love. \n\nLet’s pass the @TransportDems’ #INVEST Act and get this project funded. https://t.co/I9FzeW3lim","date":"Sat Jun 26 14:33:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Good morning from Coolidge Corner! \n\nI’m biking with Rep @TommyVitolo, \nSelect Board Chair Heather Hamilton, @T4MASS Director @cdempc, and friends as we head to the proposed Beacon Bridle Path location. https://t.co/3vkpZ4caNF","date":"Sat Jun 26 14:07:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The expanded Child Tax Credit will cut child poverty in half and help us build an economy that works for everyone.\n\nNow, let’s make the expansion permanent. https://t.co/3lVClnN5gX","date":"Fri Jun 25 18:13:33 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"8 years after the Supreme Court gutted the 1965 Voting Rights Act, GOP lawmakers are creating barriers to the ballot box to take power out of the hands of voters.\n\nEnough is enough. We must #RestoreTheVote.","date":"Fri Jun 25 17:09:02 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I support the #EqualAccess to Contraception for Veterans Act which will allow veterans access to co-pay free contraception. \n\nContraception should be a basic part of health care for every American.","date":"Thu Jun 24 19:01:35 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Take them too.","date":"Thu Jun 24 18:29:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congratulations to State Rep Claire Cronin for her nomination as ambassador to Ireland. It's Massachusetts' loss, but the nation's gain, to have such a talented public official represent us in the Emerald Isle.","date":"Thu Jun 24 01:22:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#InfrastructureIsCalling. Congress must answer with bold investments that create millions of American jobs. https://t.co/xwxlJmBvW7","date":"Wed Jun 23 15:27:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m proud to name Councilor @HollyRyanMA as one of Massachusetts’ #LocalPrideHeroes. She is the first openly transgender woman to serve on a city council in MA and is a veteran activist. \n\nHer work to advance LGBTQ+ legislation paved the way for a more equal future. Thank you! https://t.co/a6jFzOBKzJ","date":"Tue Jun 22 19:35:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We must invest in America’s workers, families, and middle class to create an economy that works for everyone. #BuildBackBetter","date":"Tue Jun 22 17:50:14 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I'm cosponsoring the Social Security Fairness Act because our dedicated public servants deserve access to their full Social Security benefits.","date":"Tue Jun 22 15:56:35 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@TransportDems’ #INVESTAct will make big, bold investments by \n\n🛣 Fixing roads and bridges\n🚉 Upgrading transit \n⚡️ Providing clean water &amp; clean energy\n\nWe’re re-imagining the future of infrastructure for every American. https://t.co/xbtkyrzIdG","date":"Mon Jun 21 21:50:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The American Rescue Plan expands the #ChildTaxCredit for working families — helping 90% of children and cutting child poverty in half. \n\nIt’s time to make the CTC permanent. https://t.co/NA8kaDWZb7","date":"Mon Jun 21 18:19:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Is there someone in your life who needs the vaccine? Bristol Community College will be hosting a family-centered, community vaccination clinic on June 22 from 2pm-6pm. This event will feature fun incentives for everyone receiving the COVID-19 vaccine. https://t.co/WaVJyhqNvg","date":"Mon Jun 21 13:47:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The war on terror has been with me my whole life. As a millennial, veteran, and member of Congress, I feel a special responsibility to prevent future failed forever wars, which is why I voted to repeal the AUMF. https://t.co/zpTnUBDZg6","date":"Sun Jun 20 22:41:04 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Juneteenth, let us remember those who paid the ultimate price fighting for their freedom, and reflect on the work we must do to achieve equality for everyone.","date":"Sat Jun 19 19:15:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We can’t pass an infrastructure bill that doesn’t #ActOnClimate.\n\n@TransportDems’ INVEST Act will:\n\n💪 Build the infrastructure of the future\n⬇️ Reduce CO2 pollution\n🏙 Protect communities from climate risks\n \nWe have no time for half measures.","date":"Fri Jun 18 18:55:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"“Our present leadership must help ensure that the Tree of Life Synagogue massacre, the murders at Chabad of Poway, and the recent scourge of violent attacks against Jews do not mark a sustained resurgence of antisemitism in the United States.” https://t.co/2i6J33FAtx","date":"Fri Jun 18 18:20:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Restoring the Bridle Path will allow for new, accessible modes of transportation on Beacon Street. \n\nThis is an opportunity for greater connectivity between neighbors, friends, and the community we love.","date":"Thu Jun 17 20:40:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Republicans tried to take away health care from 31 million people, but they lost. \n\nToday’s ruling is a victory for every American — the ACA is here to stay.","date":"Thu Jun 17 17:45:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just voted to repeal the 2002 AUMF. \n\nIt’s not normal or acceptable for service members to be fighting in a war that began before they were born. \n\nLet’s end the #FailedForeverWars.","date":"Thu Jun 17 15:43:14 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Earlier this week, I voted to advance legislation from @RepBarbaraLee that will repeal the 2002 Iraq AUMF. Tomorrow, after House passage, we will be one step closer to restoring Congressional authority. #StopEndlessWar https://t.co/clX33zpDqM","date":"Wed Jun 16 20:58:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Without comprehensive data, we can’t fully know how pervasive anti-LGBTQ violence is and we can’t take the right steps to fix it. We need @RepSeanMaloney’s LGBTQ #EssentialDataAct.","date":"Tue Jun 15 20:03:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On the anniversary of DACA, we must commit to delivering citizenship for millions of young people, TPS holders, and essential workers. It’s what the American people support and it’s the just thing to do. #HomeIsHere","date":"Tue Jun 15 17:01:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I joined other Members of Congress at the US Capitol tonight for a Moment of Silence for the 600,000 American lives lost to COVID-19.\n\nGet vaccinated and keep your loved ones and yourself safe.","date":"Tue Jun 15 00:58:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"By investing in the #CareEconomy we can help get Americans back to work, create good-paying jobs, and build an economy that works for everyone, while supporting children and families.","date":"Fri Jun 11 18:55:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Nothing can take away the pain of losing a child and no family should have to wait 11 years for answers.\n\nI hope this review brings much needed closure and accountability for the family of DJ Henry and the community of Easton.","date":"Fri Jun 11 01:22:26 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@POTUS Biden and Congress are committed to protecting and preserving the Good Friday Agreement.\n\nI joined @SkyNews to speak about President Biden’s historic visit to the UK. https://t.co/IKiPEuyx38","date":"Thu Jun 10 21:57:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The @TransportDems’s INVEST Act will help our communities prosper as we embrace modern infrastructure. \n\nWhen we tell our kids &amp; grandkids about this period we’ll say: America was in crisis. But then we built back better. #InfrastructureIsCalling https://t.co/fYww7hhHDz","date":"Thu Jun 10 17:07:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Nearly 5 years after the Pulse nightclub shooting, we are one step closer to designating the #PulseNationalMemorial because of today’s Senate vote. \n\nToday and everyday, we must honor the 49 lives that were stolen that night.","date":"Wed Jun 09 20:52:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@SenWarren and I believe that early educators deserve fair pay for their work. \n\nIn Massachusetts, early educators with a bachelor’s degree are paid 35.2% less than K-8 educators. This must change.\n\nCongressional Dems are fighting for #CareEconomy jobs and families. https://t.co/mrMFaG3IGS","date":"Wed Jun 09 18:03:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Abortion rights are under threat across the country, even though 85% of voters believe that everyone should have access to a full range of reproductive health care, including abortion.\n\nI promise to #ActForAbortionAccess and co-sponsor the Women’s Health Protection Act.","date":"Tue Jun 08 20:19:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In North Attleborough, the #AmericanRescuePlan provided funding for full-day, universal kindergarten, which wouldn’t have been possible without ARP funds. \n\nPres. Biden and Congressional Democrats are getting students back to class and parents back to work.","date":"Mon Jun 07 17:28:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@TransportDems’ #INVESTAct will:\n\n✅ upgrade our broadband &amp; transit\n✅ rebuild our bridges &amp; roads \n✅ fight the climate crisis\n✅ create good-paying jobs \n\nWe have a once-in-a-generation opportunity to transform our infrastructure. Let’s get to work!","date":"Fri Jun 04 19:01:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Gun Violence Awareness Day, I #WearOrange and call on the Senate to pass the House’s comprehensive gun safety legislation.\n\nBackground checks save lives — we must get deadly weapons off our streets and away from our schools. https://t.co/Lvw0kIUCg2","date":"Fri Jun 04 18:11:30 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I visited the Somerset Water Department this morning with Rep. Haddad.\n\nThe Somerset reservoir dam is the primary source for drinking water for the town, but it is in need of repair. I’m committed to working with the town to ensure the dam remains safe and reliable. https://t.co/K8WXUGftUO","date":"Thu Jun 03 22:35:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I wrote about the need for vaccine diplomacy in an Op-Ed here: https://t.co/2YsSqasWZO","date":"Thu Jun 03 17:44:20 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The US can take the lead on public health through vaccine diplomacy.\n\nBy donating unused vaccines, we will save lives while rebuilding our moral standing in the world post-Trump.","date":"Thu Jun 03 17:44:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I joined @SenWarren at the Triumph Early Learning Center in Taunton this morning. \n\nSen. Warren and I know that childcare is infrastructure, and we are committed to making sure that every family has access to high quality, affordable childcare and early education. https://t.co/gCfCYV0IoU","date":"Wed Jun 02 20:55:15 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Lastly, I toured downtown Attleboro, learning about future developments and speaking with business owners about their plans to revitalize their neighborhood. https://t.co/Y50VwxHWQD","date":"Tue Jun 01 23:15:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"To end the day, I toured the Reed &amp; Barton EPA site. This site has the potential for exceptional development, taking advantage of the beautiful natural scenery. https://t.co/6ZwDbWnx6I","date":"Tue Jun 01 23:15:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We’ve come a long way in our fight for equality, but we can’t forget that we still have so much to achieve. The first step is turning the Equality Act into law. https://t.co/4OU9YHIXdz","date":"Tue Jun 01 22:27:17 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"At my next stop, I visited the Norton Water Treatment Facility. I’m committed to helping Norton complete their important work of ensuring that everyone has access to clean and clear water. https://t.co/vBlG9Ke5eF","date":"Tue Jun 01 18:28:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"For my next visit, I toured two North Attleborough community project funding sites: the 10-mile dredging site and the bike and walking trail.\n\nThe passion surrounding these projects is deep — this is a community oriented town eager to improve climate resiliency and recreation. https://t.co/Wna3MtPeJv","date":"Tue Jun 01 16:21:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"For my first stop today, I visited @HockomockYMCA. Without hesitation, Hocokomock YMCA converted their facility to meet our community’s needs throughout the pandemic, distributing food, serving meals, and providing free and low cost childcare. https://t.co/ZJQyhfI2v5","date":"Tue Jun 01 14:30:16 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today I’m thinking especially of those who didn’t come home from our mission in Afghanistan - Americans and allies alike who made the ultimate sacrifice. Semper Fi. https://t.co/1k1bafXocq","date":"Tue Jun 01 00:41:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today marks 100 years since the Tulsa Race Massacre — one of the most horrific acts of racial violence in our nation’s history.\n\nIn condemning the massacre we must ensure this violence is not forgotten, and work towards a just future.","date":"Mon May 31 17:01:04 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"To the veterans who came before me who did not come home, I say to their loved ones that their country is grateful and their memory will live on, not only with their families but in their nation’s history. https://t.co/z9utogbOQh","date":"Sun May 30 22:28:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Our nation is built on an idea – all people are created equal, and the condition of their birth should not determine the outcome of their life.\n\nThat idea is powerful, but it is fragile. Let us remember the sacrifices of those who lost their lives for its protection this weekend. https://t.co/fHUhoPEOEW","date":"Sat May 29 22:40:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Becky, you are courageous and compassionate in sharing your story and fighting to cure this disease.","date":"Fri May 28 20:50:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In a display of cowardice, GOP senators denied Gladys Sicknick, and many others, justice and truth. \n\nThis vote is shameful — it is a betrayal of their oath of office and duty to our country.\nhttps://t.co/xSNNSS77fZ","date":"Fri May 28 17:06:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"By solving the climate crisis, we can create jobs and protect our planet’s future.\n\nThat’s why I’m advocating for federal funding for workforce development initiatives like Bristol Community College’s National Offshore Wind Institute — offshore wind can power the green economy.","date":"Fri May 28 14:39:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Jews in the United States have long been targeted by hate crimes, but antisemitism has surged in recent weeks.\n\nThis is unacceptable and un-American, and we’re going to take action to stop the spread of hate. #ActAgainstAntisemitism https://t.co/ktnVpiWumD","date":"Thu May 27 20:00:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We’re 21 weeks into the year and we’ve had over 200 mass shootings. This senseless violence must stop.  \n\nI remain committed to taking every action needed to end the gun violence epidemic, and I urge my colleagues to do the same.","date":"Wed May 26 17:18:21 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I am one of 80 members of Congress who called on the Senate to confirm David Chipman for @ATFHQ director.\n\nTo end gun violence, we need a qualified director to lead this agency and ensure the gun industry has proper oversight. \n\nLet’s #ConfirmChipman!","date":"Wed May 26 16:34:08 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I led a letter with 17 of my colleagues calling on @RepPeterDeFazio to invest in accessible, on-demand public transit.\n\nThis investment will:\n✅ advance equity\n✅ increase economic and social mobility\n✅ help combat the climate crisis\n✅ and make our communities safer for all https://t.co/lf09L29DHb","date":"Mon May 24 22:09:17 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you for signing: @RepDonBeyer\n@RepJudyChu\n@repjimcooper\n@RepStephenLynch\n@RepCheri\n@RepCicilline\n@RepHuffman\n@DorisMatsui\n@GKButterfield\n@RepCohen\n@RepKahele\n@RepMcEachin\n@RepMcGovern\n@RepTerriSewell\n@sethmoulton\n@repdinatitus","date":"Mon May 24 22:09:17 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congratulations to @TownofSeekonkMA for being awarded $500,000 from the EPA’s competitive Brownfields program.\n\nThis funding will allow the Town to revivify the contaminated wastewater lagoons, ensuring that this water will not pose a public health threat. https://t.co/esxUbFBMPJ","date":"Mon May 24 14:52:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"From a smashed window at a synagogue to assaulting a Jewish man in NYC, the rise in antisemitism around the world is deplorable.\n\nOur country should have zero tolerance for hate and we must all resolve to stand up and speak out. https://t.co/3zrO8Dx7pA","date":"Sun May 23 16:16:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"@NPS_Supt Thank you for having me — we’re getting shots in arms and making sure our kids can get back to class.","date":"Sat May 22 22:56:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"From national security to economic prosperity, the maritime industry is an essential American sector. \n\nOn National Maritime Day, I’d like to recognize the men and women of the maritime industry — their service keeps us safe, secure, and creates opportunities for so many.","date":"Sat May 22 17:01:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Driving into the weekend like: https://t.co/HjWYpFedke","date":"Fri May 21 19:42:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It was great meeting you, John!","date":"Fri May 21 18:58:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Agreed.\n\nWe could cut the Pentagon budget by 10% and still spend more than the next 10 largest militaries combined. \n\nWe should re-invest those funds into diplomacy, humanitarian aid, public health, and climate change.","date":"Fri May 21 17:47:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Best in Show, Computer Generated: “Midnight Stride” by Daniel D’Alleva (@HopkintonHS, Sophomore) (7/7) https://t.co/XNAeESkQJ9","date":"Fri May 21 15:35:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Best in Show, Drawing: “Tune and Tone” by Tatum Perry (@OAHSTigers, Senior) (6/7) https://t.co/aOPJjatLVp","date":"Fri May 21 15:35:18 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Best in Show, Mixed Media: “Evolution of Beauty” by Yutong Huang (Needham HS, Senior) (5/7) https://t.co/33zcHvEM2T","date":"Fri May 21 15:35:16 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Best in Show, Photography: “Fruit Basket” by Shayna Hanson (@HopkintonHS, Junior) (4/7) https://t.co/LFUndrLaPR","date":"Fri May 21 15:35:14 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Best in Show, Collage: “Covid Scene” by Mei Sutherland (@HopkintonHS, Senior) (3/7) https://t.co/DFlLKxodh3","date":"Fri May 21 15:35:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Best in Show, Painting: “Stop Asian Hate” by Dana Liu (Newton South HS, Sophomore) (2/7) https://t.co/Jo6MuaLWVc","date":"Fri May 21 15:35:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This week, we announced Aeden Marcus, a senior at @OAHSTigers, as our Congressional Art Competition winner for his piece, \"Room 126.\"\n\nThank you to the 67 talented young artists who participated— we are proud of your contributions! \n\nSee our finalists’ works below  (1/7)👇👇👇 https://t.co/vCarBjgc1U","date":"Fri May 21 15:35:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I hope you’ll join us today from 1-3 PM. See you soon!","date":"Fri May 21 14:11:22 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This Friday, I’ll be hosting community office hours in Franklin with State Rep. @jeffroy to hear about the issues that matter to you. \n\nWill we see you there? https://t.co/WHvXwEQsKc","date":"Thu May 20 14:39:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The January 6th insurrection was an attack on our democracy, and one of the darkest days in American history.\n\nThe House voted to form an independent commission to finally get to the truth of what transpired — and make sure it never happens again. https://t.co/PsEXlwSM8y","date":"Wed May 19 23:01:32 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I voted to #StopAsianHate by passing the #COVID19 Hate Crimes Act to improve hate crime reporting &amp; ensure more support for victims. \n\nEveryone deserves to feel safe and welcome in our country, and passing this bill adds teeth to that principle. https://t.co/gITFVzH0Lk","date":"Tue May 18 22:14:08 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The Insider Trading Prohibition Act reflects our shared American belief that everyone should play by the same rules. This bill will give confidence to everyday investors about the fairness and integrity of our capital markets. #StopInsiderTrading","date":"Tue May 18 16:32:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We have an opportunity to rebuild our economy so that it works for everyone, ensuring that the American economy is the most fair and productive in the world.\n\nI’m honored by the confidence of @RepMaxineWaters and the @FSCDems, and I’m ready to get to work.","date":"Tue May 18 00:34:35 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The expanded Child Tax Credit will transform the lives of families and children in Massachusetts. \n\nFrom Newton to Fall River, the CTC will help nearly 60% of children in Greater Boston and the South Coast, and it will lift 3,800 children out of poverty. https://t.co/QU9Dpoz44p","date":"Mon May 17 15:25:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The Fall River Memorial Wall provides a place for us to reflect on the sacrifices of our service members, to center ourselves on the true meaning of Memorial Day, and to make the phrase “thank you for your service” more than just a reflexive courtesy. https://t.co/t7ia0E2bJT","date":"Sat May 15 21:55:22 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you for your service, Major Batista! https://t.co/u6aHGZZiQW","date":"Fri May 14 18:57:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"He spoke highly of our district rep., sharing, “they provided the highest standards in professionalism, efficiency, diligence, and respect with a constituent that I could ever experience or expect. I am thankful to the Army and to the Congressman’s office for my commission.” https://t.co/FlrDEhapq2","date":"Fri May 14 18:57:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Major Batista decided to join the US Army Medical Corps to serve others and our country. He views this service as an opportunity to lead by example. He told us that his swearing-in was a realization of one of his greatest dreams. https://t.co/nxESlaeueI","date":"Fri May 14 18:56:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This week, we're celebrating helping Dr. Leonard Batista get his official commissioning date as an officer in the US Army Reserve Medical Crops. https://t.co/dvyA73DL8n","date":"Fri May 14 18:56:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #ChildTaxCredit will help nearly 60% of children in the Fourth District, and lift thousands out of poverty. \n\nWe must make the expanded Child Tax Credit permanent.","date":"Fri May 14 14:40:31 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The House just passed the Comprehensive Debt Collection Improvement Act, which included my first bill. \n\nWe can’t rebuild an economy that works for everyone without protecting consumers — borrowers must be treated with dignity and protected from harassment. https://t.co/UESNQnBmEn","date":"Thu May 13 21:40:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"How it started:                How it’s going: https://t.co/79MtQJXCki","date":"Thu May 13 20:50:02 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Transportation is about more than bridges and roads – it must fundamentally and easily connect people to jobs and services. \n\n@TransportDems and I are working to jumpstart our economy by upgrading the way people from all backgrounds and zip codes access jobs, goods, and services. https://t.co/VbiiH4US8j","date":"Thu May 13 17:02:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, I join @SenBooker, @RepJayapal, and @RepBarragan to reintroduce the #HEAL4Immigrants Act to remove barriers to health care for immigrants. \n\nEveryone deserves access to health care, regardless of where someone was born.","date":"Wed May 12 18:18:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Republicans just chose Trump over truth yet again.","date":"Wed May 12 13:19:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #AmericanRescuePlan is delivering over $68 million to colleges and universities in the Fourth District. \n\nThis funding will give our schools the tools they need to recover and succeed.","date":"Tue May 11 20:46:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"All violence and provocations must stop immediately. Rocket attacks, controversial evictions and demolitions, and violence from either side push the region further from a two-state solution and the prospect of a lasting peace.","date":"Tue May 11 00:29:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Earlier today, I met with the Israeli Consul General in Boston and expressed my concern for the violence unfolding in Jerusalem. I strongly condemn Hamas’ rocket attacks against Israel and affirm Israel’s right to defend itself and its citizens. https://t.co/73zQpTq61C","date":"Tue May 11 00:29:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Nearly 60% of children in the Fourth District will benefit from the #ChildTaxCredit.\n\nMake sure to file your taxes by May 17th to secure your monthly payments as soon as possible. https://t.co/7sOPX4XkRF https://t.co/jIAd0bcwDk","date":"Mon May 10 17:46:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Childcare is infrastructure. \n\nPresident Biden’s American Families Plan will ensure that our early educators make at least $15 an hour. \n\nIn Massachusetts, it must be more.","date":"Fri May 07 17:12:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I led a letter calling on the @USTreasury to allow maximum flexibility for the Coronavirus Capitol Projects Fund.\n\nMA could leverage the Fund to invest in early education and workforce training, which will create opportunities whose dividends will pay out for generations to come. https://t.co/fwWp7MISvE","date":"Thu May 06 21:35:35 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Join us tonight!","date":"Wed May 05 19:28:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Since the start of the year, the US has already suffered 165 mass shootings.  \n\n\nWe can be the generation that ends the gun violence epidemic, but we must #endthefilibuster.","date":"Wed May 05 15:10:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The death of Mikayla Miller is a tragedy, and I extend my deepest condolences to her family. I have spoken with District Attorney Ryan, and she has emphasized her intent to ascertain the facts and pursue justice in a transparent and expeditious manner. (1/2)","date":"Wed May 05 13:20:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As we wait for the investigation to unfold, I join our community in grieving and hope that we can help her family find the peace they deserve. (2/2)","date":"Wed May 05 13:20:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Join @RepRoKhanna and me tomorrow night for an IG Live about the Stop CHEATERS Act.\n\nToo often, the ultra wealthy underreport their incomes and fail to pay their due taxes. It’s time for that to change. https://t.co/HvP1QNDBE1","date":"Wed May 05 00:46:17 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"ATTN restaurant &amp; hospitality business owners: Applications for the #AmericanRescuePlan’s Restaurant Revitalization Fund opened today, May 3, 2021, at noon ET. https://t.co/AA3I8TuwPW","date":"Mon May 03 17:37:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Out of crisis comes opportunity.\n\n@POTUS Biden’s plans are forward-looking, bold, and ambitious.\n\nNow, the real work begins. https://t.co/DJyb9A8H5v","date":"Thu Apr 29 17:11:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@POTUS laid out a bold plan for how we’re going to build back better.\n\nWe’re going to:\n✔️ tackle climate change\n✔️ invest in physical + social infrastructure\n✔️ make an economy that works for everyone\n✔️ resume America’s moral leadership \n\n#JointAddress https://t.co/I3O0dVuzYn","date":"Thu Apr 29 03:04:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"What was your favorite part of @POTUS's speech? #JointAddress","date":"Thu Apr 29 02:30:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Out of crisis comes opportunity. We have a responsibility to build an economy that works for everyone\n\nMassachusetts will lead the way, from education to the life sciences to offshore wind, as we work to create a healthier, greener future for our kids. #JointAddress https://t.co/U24oGQUEqZ","date":"Thu Apr 29 02:15:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@POTUS “Don’t tell me it can’t be done. We did it before, and it worked.” \n\nWe must ban assault weapons. #JointAddress","date":"Thu Apr 29 02:04:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Since the start of the year, the US has already suffered 165 mass shootings. \n\n@HouseDemocrats passed comprehensive gun reform, and now it’s time for the Senate to follow the House and @POTUS Biden’s lead and take action.","date":"Thu Apr 29 02:01:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@POTUS is right.\n\nIt’s time to tax wealth, not work. #JointAddress","date":"Thu Apr 29 01:46:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Nearly 60% of children in the Fourth District will benefit from the Child Tax Credit, and it will lift 3,800 children out of poverty. We must #MakeCTCPermanent.","date":"Thu Apr 29 01:39:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It’s time to make historic investments into research and development. \n\nLet’s end cancer, cure Alzheimer’s, and solve the problems we once deemed impossible.","date":"Thu Apr 29 01:35:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The American Jobs Plan is an opportunity for us to reimagine America’s future and rebuild the middle class. #JointAddress","date":"Thu Apr 29 01:27:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Retweet if you agree that every American should have clean drinking water. #JointAddress","date":"Thu Apr 29 01:22:17 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@POTUS “America is on the move again.” \n\nThanks to President Biden's leadership in his first 100 days in office, we’ve gotten shots into arms, we’ve returned our kids to school, and Americans are getting back to work.","date":"Thu Apr 29 01:13:49 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Settling in for @POTUS’s speech. @RepStricklandWA and I ran into a few freshman senators, @SenatorWarnock, Sen. @ossoff, and Sen. @Hickenlooper. https://t.co/guONrtIopH","date":"Thu Apr 29 01:03:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m on my way over to the chamber for @POTUS’s speech.\n\nIn President Biden’s first 100 days, we’ve put:\n✅ shots in arms\n✅ people back to work\n✅ kids back to school \n\nThese first 100 days were a success. Stay tuned for what’s next. https://t.co/jvqxpFW8KE","date":"Thu Apr 29 00:46:15 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happening now! Join us here: https://t.co/pbohEt36du","date":"Wed Apr 28 21:34:04 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Before @POTUS's speech, join me tonight at 5:30 PM for a FB Live with @JeffreyJMarsden to discuss improvements to COVID-19 testing in schools and plans for getting kids back in class.\n\nWill you join us? https://t.co/fYhBzEUVAy https://t.co/j4z92tAS5N","date":"Wed Apr 28 16:44:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Before @POTUS's speech, join me tomorrow at 5:30 PM for a FB Live with @JeffreyJMarsden to reflect on improvements to COVID-19 testing in schools and discuss plans for getting kids back in class.\n\nWill you join us? https://t.co/fYhBzEUVAy","date":"Tue Apr 27 17:29:52 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#HelpIsHere for students and families across Massachusetts. Thanks to the #AmericanRescuePlan, more schools can follow Dr. Marsden’s lead and get students back in class. I'm excited to have him join me as a virtual guest for @POTUS's joint address to Congress tomorrow. https://t.co/m9ajQkw1sj","date":"Tue Apr 27 17:29:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #ChildTaxCredit will lift nearly 4 million children out of poverty, cutting child poverty in MA by 34.8%.\n\nMaking the expanded credit permanent shouldn’t be a question of if, but when.","date":"Tue Apr 27 15:15:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Two ways we can champion vaccines:\n\n1. Partnerships - working with state &amp; local governments, the private sector, and nonprofits can help us deliver vaccines.\n\n2. Vaccine Diplomacy - we have an opportunity to save lives while rebuilding our global moral standing. https://t.co/zI9NFmjIk1","date":"Sun Apr 25 22:13:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, @POTUS Biden took the necessary step of recognizing the Armenian Genocide.\n\nAs a member of the Congressional Armenian Caucus, I am committed to working with my colleagues to support the Armenian community. \n\nWatch more below ⬇️ https://t.co/PoNhUJVguG","date":"Sun Apr 25 00:36:04 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Lisa Nelson recently retired after 15 years of dedicated service to the Fourth District — she is a remarkable public servant.\n\nCongratulations on the Resolution of Thanks, Lisa! I can think of no one more deserving. https://t.co/CRa4ZgKvDE","date":"Fri Apr 23 20:22:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We just passed #DCStatehood in the House of Representatives. \n\nThe franchise is the bedrock of our democracy, and it’s time for the 712,000 DC residents to make their voices heard. \n\nNow we need the Senate to do the same.","date":"Thu Apr 22 17:34:22 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It’s being the generation to end the gun violence epidemic or it’s the filibuster. \n\nWe can’t have both.\n\n#EndTheFilibuster","date":"Thu Apr 22 14:13:44 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Congress must ensure that future commanders-in-chief can never again wage failed forever wars.\n\nThe generation that fought in this war must now govern in light of its mistakes. Let us resolve to learn from them https://t.co/089ZqQPm5S","date":"Wed Apr 21 21:07:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Maritime transportation is critical to job creation, climate resiliency, and trade.  \n\nThe maritime industry will be instrumental in offshore wind, a key priority for MA. I am honored to be named Vice Chair of this Subcommittee\n\n@TransportDems are going to build back better. https://t.co/S7jQ7NMyVg","date":"Wed Apr 21 17:52:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"\"Congress should listen too, and pass the George Floyd Justice in Policing Act.\"","date":"Tue Apr 20 21:27:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Infrastructure isn’t a partisan issue. It’s a millennial one.\n\n@TransportDems can build back better by: \n\n✅ upgrading our broadband &amp; transit\n✅ rebuilding our bridges &amp; roads \n✅ providing affordable housing\n\nLet’s make the US economy the most productive and fair in the world. https://t.co/E1qrTWXW7b","date":"Sat Apr 17 20:34:21 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today we woke up to another mass shooting as @RepKahele and I were planning our visit to the @GiffordsCourage Gun Violence Memorial. \n\nWe need the #CourageToAct on common sense gun reform—inaction has deadly consequences that affect every community in every part of our country. https://t.co/NaDXfdikvC","date":"Fri Apr 16 17:16:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In a few short months, we’ve taken massive strides towards economic recovery and prosperity. \n\nBut we’re just getting started. I will continue to fight for a better future for every American. Stay tuned!\n\nCheck out my first 100 days in 100 seconds ⬇️⬇️⬇️ https://t.co/JItvDhLxMl","date":"Thu Apr 15 21:39:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The time to leave is overdue, but the work required to permanently end failed forever wars is far from over.","date":"Thu Apr 15 17:42:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Last week, I toured @MedfieldHS and saw their COVID pool testing operation. \n\nThe Medfield model shows that we can keep students physically and mentally healthy, and I am pleased to see schools in my district leading the way. https://t.co/mq0ZcF4Cam","date":"Thu Apr 15 17:10:22 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I commend @POTUS Biden for withdrawing American troops, but now Congress must ensure that future commanders-in-chief can never again wage failed forever wars. https://t.co/4Bi0jgvzrJ","date":"Wed Apr 14 22:52:21 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just dropped my first bill into the hopper on my 100th day in Congress. \n\nThis bill will make sure borrowers are treated with dignity and protected from unwanted and unnecessary harassment.\n\nWe can’t rebuild an economy that works for everyone without protecting consumers. https://t.co/vgo67Qh55g","date":"Tue Apr 13 23:40:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tomorrow night I’m joining @masspeaceaction’s town hall with @EdstromErik to discuss ending the forever wars and military spending. \n\nI hope you’ll join us. You can register here: https://t.co/O3ZX9v5kx9","date":"Tue Apr 13 21:12:30 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"1️⃣ Cut the Pentagon’s bloated budget and invest instead in diplomacy, humanitarian aid, public health, and climate change.","date":"Tue Apr 13 17:09:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"2️⃣ Repeal &amp; replace the Authorization for Use of Military Force (AUMF) to strengthen congressional oversight of war-making.","date":"Tue Apr 13 17:09:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"3️⃣ Increase support for Israel and its burgeoning regional alliances as a stabilizing mechanism for the Middle East.","date":"Tue Apr 13 17:09:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Twenty years at war. Not only have we not succeeded, we can’t even define success. Why? Because “the American people have constantly been lied to,” according to a US Inspector General. How do we rebuild trust after the failed forever wars? Thread ⬇️","date":"Tue Apr 13 17:09:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Ramadan Mubarak to all who celebrate! #ramadanmubarak","date":"Mon Apr 12 21:13:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As the United States pivots away from the failed forever wars, our generation needs to lay down a marker for the Pentagon.\n\nWe can defend America and protect the global commons without increases to the budget.","date":"Fri Apr 09 20:54:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Final day of my #AmericanRescuePlan tour, attending the Blanche A. Ames Elementary School groundbreaking ceremony as we get kids back to school.\n\nBlanche was an artist, inventor, and suffragist. Her legacy is an inspiration to the countless children who will gather to learn here. https://t.co/0AJdb0sLVS","date":"Fri Apr 09 17:13:17 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #AmericanRescuePlan funds are going to allow the Medfield model to scale up so that we can get kids back to full-time in-person learning, which is critically important not just for their academic development, but for their mental health. https://t.co/KN31SkOGVQ","date":"Fri Apr 09 14:40:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today is Yom HaShoah, the Holocaust Days of Remembrance.  I honor the survivors, victims, and the liberators of the Holocaust. \n\nI resolve to take the lessons of the Holocaust with me into shaping public policy. We must always call out and stand up to hate and antisemitism. https://t.co/qwR1zGNGCy","date":"Thu Apr 08 23:26:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On the 3rd day of my #AmericanRescuePlan district tour, I visited the @MedfieldHS COVID-19 testing operation with @Ginkgo staff.\n\nThe Medfield testing model is an inspiration to The Commonwealth and the whole country. https://t.co/PgnZVypC0G","date":"Thu Apr 08 17:31:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"2. Airplanes in flight actually have high air quality –  about 30 air changes per hour. It’s boarding &amp; deplaning, when systems are powered down, that quality can deteriorate","date":"Wed Apr 07 19:02:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"3. No, those indoor plants don’t improve your air quality. At all. Get a MERV 13 filter instead!","date":"Wed Apr 07 19:02:40 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"1. Upgrading ventilation &amp; filtration for our schools &amp; offices improve health and cognition for kids &amp; employees.","date":"Wed Apr 07 19:02:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"For the next stop on my #AmericanRescuePlan district tour, I visited @eheinc. We discussed the role of ventilation and indoor air quality in providing safe environments in schools. \n\nThree takeaways from my visit to E&amp;HE, experts on air quality engineering: https://t.co/7MKHo0JI5H","date":"Wed Apr 07 19:02:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today is the #AmericanRescuePlan Day of Action. A year ago, hope was hard to imagine. Now, we’re getting: \n\n✅ shots in arms\n✅ kids back in class\n✅ money in pockets\n✅ people back to work \n\nThe future looks bright for America.","date":"Wed Apr 07 16:29:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I toured the center alongside Taunton Mayor @ShaunnaOconnell, Taunton City Councilor Phillip Duarte, Rev. Joseph Mumita, and Maribeth Ferreira, the Executive Director of Our Daily Bread Food &amp; Resource Center. https://t.co/1gsOBzPQ7J","date":"Tue Apr 06 18:10:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Next, I visited Our Daily Bread Food &amp; Resource Center. Their volunteers have tirelessly shown up and served the community throughout the pandemic, providing meals and services to those in need. https://t.co/xcY1qYGc9D","date":"Tue Apr 06 18:03:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The science is irrefutable: pre-K helps kids and families and improves life trajectories.\n\nWe need to pay our early educators more and make sure that every family in America has access to universal, high quality pre-K. https://t.co/67NmAbCRSO","date":"Tue Apr 06 17:03:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My first stop is Head Start in Taunton. Childcare is infrastructure — the American Rescue Plan includes nearly $40 billion for childcare. https://t.co/ImPG2GoFZb","date":"Tue Apr 06 16:44:44 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, I started my #AmericanRescuePlan district tour — we’re getting shots in arms, kids back to school, and Americans back to work.","date":"Tue Apr 06 16:44:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We need better infrastructure, and Democrats are ready to build it.\n\nRead more here: https://t.co/ryceEICQ8M\n(6/6)","date":"Mon Apr 05 20:41:20 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Spending money on infrastructure is good for our economy.\n\nThe multiplier effect on a dollar of infrastructure spending outweighs the multiplier effect on a tax cut for the wealthy. (5/6)","date":"Mon Apr 05 20:41:20 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Democrats will welcome bipartisan conversation, but we're not going to compromise when it comes to fixing our failing infrastructure. (4/6)","date":"Mon Apr 05 20:41:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Republicans inside the Beltway can either get on board, or they can watch Democrats pass one of the most monumental and important pieces of legislation on party-line votes. (3/6)","date":"Mon Apr 05 20:41:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Nearly 80% of Americans support an infrastructure overhaul — we have the opportunity to reimagine transportation in this country. (2/6)","date":"Mon Apr 05 20:41:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Millennials are on track to be the first generation in American history who are worse off than our parents, but the American Jobs Plan can be the turning point.\n\nWe can look to our kids and our grandkids and say America was in crisis, and then we built back better. (1/6)","date":"Mon Apr 05 20:41:18 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We’re going to pass an infrastructure bill, and it’s going to be popular with the American people. \n\nRepublicans can either get on board, or they can watch Democrats pass one of the most monumental and important pieces of legislation on a party-line vote. \nhttps://t.co/N7boPCEeyS","date":"Mon Apr 05 17:13:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Defending our democracy at home shouldn’t be more dangerous than defending our democracy abroad. \n\nKeeping this officer and their family in my thoughts.","date":"Fri Apr 02 19:24:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This was an inspirational tour for me. It was the opportunity to see the best of MA business and the best of the MA hospital system come together to help people.\n\nWe are in a race between vaccinations and variants, and enterprises like this help ensure that we win that race.","date":"Thu Apr 01 15:47:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"21st-century foreign policy is going to be built on countries that can tackle transnational challenges together — climate change and public health are the top two.\n\nThe US can take the lead on public health through vaccine diplomacy.\n\nWatch more from my talk w/ @AymanM here: https://t.co/1jGNMMNbda","date":"Thu Apr 01 14:26:12 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We are going to out-compete China. \n\nThe Chinese workforce is 8x bigger than America’s. So to win, we need to work 10x smarter. We will invest in the research, development, manufacturing, and logistics that make the American worker the most productive in the world. (3/4)","date":"Wed Mar 31 20:45:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"And as it always has in American history, Massachusetts is going to lead the way. \n\nFrom offshore wind to synthetic biology, the Bay State has the ideas and the talent. We need better infrastructure. \n\nNow, we’re building it. (4/4)","date":"Wed Mar 31 20:45:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We are going to create good jobs. \n\nBy fixing our bridges and ports, upgrading our transit and broadband, supporting affordable housing and home-care, and securing clean water and clean energy, we are building an economy that works for everyone. (2/4)","date":"Wed Mar 31 20:45:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Millennials are on track to be the first generation in American history worse off than our parents. Now is the turning point. When we tell our kids &amp; grandkids about this period, we’ll say: America was in crisis. We hit a low point. \n\nBut then we built back better. (1/4)","date":"Wed Mar 31 20:45:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I absolutely will go door to door talking about raising taxes on corporations and the ultra-wealthy in order to fund jobs and infrastructure programs.\n\nIf Republicans resort to opposition to infrastructure, they’ll lose the war of public opinion one more time.\n\n👇👇👇","date":"Wed Mar 31 15:01:59 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I joined the Franklin and Milford Fire Departments for a training exercise, which had State Rep. Roy, Town Councilor Dellorco, and me inside of a burning building.\n\nWe are committed to investing in public safety and protecting first responders at all levels of government. https://t.co/H2Ayin847M","date":"Tue Mar 30 20:49:15 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"With a positivity rate of under 1%, there is very little evidence of in-school transmission of COVID-19 in MA. \n\nThis is great news — our kids and teachers can safely return to schools. \n\nGetting our kids back in class is a matter of education, the economy, and equity.","date":"Tue Mar 30 16:43:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Are you a student in my district? Submit your artwork to the Congressional Art Competition! The deadline for entries is 4/30/2021.\n\nSubmit your work here: https://t.co/tbh2zYJ2Qa https://t.co/Xuud9VER9v","date":"Mon Mar 29 19:40:18 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The fight against Covid-19 is a transnational challenge that calls for vision and boldness.\n\nAfter Trump abased our country on the world stage for four years, the United States can reclaim moral leadership through a Marshall Plan for vaccines.\nhttps://t.co/pBXVfzTZZq","date":"Mon Mar 29 13:43:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happy Pesach! One of my best childhood memories is of a large Passover Seder with a close family friend in Newton.\n\nI remember doing “The Four Questions” as the youngest person there, and it was an important ritual for me. \n\nhttps://t.co/10HOhjqtf2","date":"Sat Mar 27 23:03:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We must all resolve to do better about speaking out when you hear words of hatred, whether those words come from a chief executive or from around your kitchen table. \n\nWe are going to embrace our diversity as a country, and no longer look the other way for hate or intolerance. https://t.co/oFMoGOetQa","date":"Sat Mar 27 17:48:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We must stand up and come together and make clear that hate is un-American and violence is unacceptable.\n\nWe will not tolerate violence or bigotry in our country. #StopAsianHate https://t.co/n5M2hzAiDE","date":"Sat Mar 27 16:12:14 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This morning, I took the Green Line to the #StopAsianHate rally in Boston Common. Demonstrators are lining the Boston marathon course, and I joined them in Brookline along the way. https://t.co/LGbBTzvc20","date":"Sat Mar 27 15:36:32 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"\"Working to get all children back to classrooms full-time is the right and urgent thing... we are proud to see our congressman prioritizing children’s learning and mental health, as well as teacher vaccination.\" https://t.co/pDP5P457jN","date":"Fri Mar 26 14:30:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@SecretaryPete and I share a belief in the power of local government, and we know that our cities and towns deserve a far better state of infrastructure. \n\n\nIt’s time to take bold action and pass an infrastructure package that rethinks our roads. \n\nListen to hear more 👇👇👇 https://t.co/6JoA9r6JUF","date":"Thu Mar 25 23:09:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I asked @SecretaryPete to explain how the Biden Administration intends to design an infrastructure plan to move us towards a complete streets future. Here's what he said:","date":"Thu Mar 25 20:07:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@SecretaryPete shared that he took steps to implement complete streets in South Bend — converting and reinvigorating streets to make them safer and more accessible. \n\nHe wants to make sure those gains are available across the country, and so do the @TransportDems.","date":"Thu Mar 25 20:07:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I strongly support @RepCohen’s Complete Streets Acts. Complete streets can accommodate 🚶🏽‍♀️, 🚴🏼‍♂️, and 🚎, not just cars and trains, providing safe and accessible transportation options for people of all ages and abilities.","date":"Thu Mar 25 20:07:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@SecretaryPete and I agree that it is time to move away from an “auto-centric” view. Our street design should allow cars, bikes, pedestrians, buses, and businesses to coexist in a positive way.","date":"Thu Mar 25 20:07:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Offshore wind can power our region and bring jobs &amp; economic recovery to the South Coast. \n\nThat’s why I’m cosponsoring legislation with @RepCicilline to establish a Southern New England regional commission.\n\nThis bill provides a path for renewable energy, like offshore wind.","date":"Thu Mar 25 15:49:49 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The gender wage gap hurts women, families, and the economy.\n\n@HouseDemocrats are determined to see a future with #EqualPay for equal work.\n\nhttps://t.co/cXjVoVCtIm","date":"Wed Mar 24 16:32:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"11 years ago, @HouseDems and President Obama made history by passing the Affordable Care Act. \n\nHealth care is a human right — every American should have access to high-quality, affordable care.","date":"Tue Mar 23 17:14:48 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Violence against AAPI people is unacceptable and un-American. \n\nI’ve cosponsored legislation to more deeply investigate hate crimes related to COVID-19.\n\nWe must #StopAsianHate","date":"Mon Mar 22 17:26:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On the road to violence, there are slurs and slights that compound and fester, and they become the currency of discrimination.\n\nWe have work to do to stem the tide — we're going to do that work. #StopAAPIHate https://t.co/Qa5jx2Lee2","date":"Mon Mar 22 01:05:38 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I will always stand with the AAPI community.\n\nWhether it's hate towards those of a different race, creed, or national origin, if we don't all lock arms together, then we are not truly standing together as Americans. #StopAsianHate https://t.co/RmLc6etLY5","date":"Sat Mar 20 19:30:52 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The United States has a moral obligation to be vaccinating the world.\n\nWe’re in a race right now between vaccinations and variants — it doesn’t help the United States if we win it domestically and lose it internationally. \n\nClick the link to learn more 👇👇👇","date":"Fri Mar 19 21:32:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Our seniors depend on reliable, high-quality Medicare services, which is why I voted this week to protect Medicare from sequestration cuts.","date":"Fri Mar 19 20:46:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Spending doesn't equal strength, @RepMikeRogersAL. A blank check for a bloated Pentagon budget won't help us outcompete the CCP. We win with:\n\n• Deterrence by denial\n• Stronger alliances\n• More investment in science\n• Moral leadership in a contest of ideologies","date":"Fri Mar 19 19:17:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It’s time to end the failed forever wars.\n\n\nRepealing the AUMF would re-assert Congress’s Article I power over declaring war, period.\n\nCongress alone can start a war. Congress alone can stop this recklessness.","date":"Fri Mar 19 16:41:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Being born in America doesn't give you a monopoly on the American promise: the condition of your birth should not determine the circumstances of your life. \n\nOur country is strongest when opportunities exist for all, which is why I voted to protect Dreamers and immigrants. https://t.co/ptDbYMUcSO","date":"Thu Mar 18 22:37:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Documentation is not indicative of dignity. \n\nThe workers who feed America deserve respect. I am voting to create a pathway for 1 million undocumented farm workers to apply for legal status. #HomeisHere","date":"Thu Mar 18 17:34:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The coronavirus crisis has forced women and victims of abuse to quarantine in unsafe environments, while the rise in anti-Asian hate incidents has disproportionately harmed AAPI women.\n\nIt is more important than ever to pass the Violence Against Women Reauthorization Act. https://t.co/XFltYPCBQm","date":"Thu Mar 18 01:21:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"There is no time limit on equality. The House just removed the arbitrary time limit for ratification of the ERA, paving the way for an #EqualFuture.","date":"Wed Mar 17 21:13:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #AmericanRescuePlan will: \n\n✔️Get shots in arms of teachers and school staff\n✔️ Fund HVAC upgrades\n✔️ Fund surveillance testing \n\nOur classrooms must open, and they must be safe for students and teachers alike. https://t.co/q1zFxHHkIS","date":"Wed Mar 17 15:38:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"You don’t have to be a veteran to know that the defense budget is out of control when you have a trillion-dollar fighter jet that can’t dogfight.","date":"Tue Mar 16 18:02:59 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@RepKClark’s #ChildCareisInfrastructureAct is a vital step towards rebuilding our country. \n\nThis comprehensive package makes essential investments into the child care sector — supporting our children, families, and child care educators.","date":"Tue Mar 16 17:48:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"HAPPENING NOW: join us here https://t.co/yXeMW6axdK","date":"Mon Mar 15 23:31:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Join me tonight at 7:30 for the third installment of Congress Clubhouse: Vaccine Diplomacy. @ldtimmerman, @oliviazetter, Christopher Viehbacher, Brett Leav, and I will discuss the global state of play on vaccine production and distribution.  \nhttps://t.co/yXeMW6axdK https://t.co/e14X3m3vmB","date":"Mon Mar 15 14:48:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Transit &amp; micro-mobility are like peanut butter &amp; jelly. As a member of the @TransportDems, I’ll be working to improve infrastructure for both so that more Americans have easy access to more jobs and services.","date":"Fri Mar 12 21:52:24 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@POTUS is absolutely right. The #AmericanRescuePlan will get shots in arms, students in class, people back to work, and by Independence Day we’ll be able to celebrate the holiday with our neighbors and loved ones.","date":"Fri Mar 12 01:46:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On Tuesday, @BarneyFrank, @joekennedy, and I joined the League of Women Voters of Newton to discuss what it means to represent the Fourth District. We shared stories, laughs, and our shared commitment to representing our constituents, then and now, to the best of our abilities. https://t.co/H1YtRJBiXN","date":"Thu Mar 11 13:11:21 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I voted for the #AmericanRescuePlan. This crucial legislation will accelerate vaccination efforts, lift millions out of poverty, beat the pandemic, and kickstart the recovery. https://t.co/PeajGPazWo","date":"Wed Mar 10 22:47:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, we’re sending the #AmericanRescuePlan to @POTUS Biden’s desk. We are going to beat the pandemic and revitalize our economy by getting:\n\n💉 Shots in arms,\n💲 Money in pockets,\n🎓 Kids in class, and\n💪 People back to work.","date":"Wed Mar 10 18:38:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I enjoy working with mayors and town managers throughout the district, and I am eager to hear our constituents' needs and how I can best serve them in Congress. \n\nThank you for the kind remarks, Mayor @ShaunnaOconnell. https://t.co/ZqiI71SQnc","date":"Wed Mar 10 17:09:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tonight at 7 PM ET, I will join @joekennedy and @BarneyFrank for a conversation with Newton’s League of Women Voters to discuss our experiences in Congress representing the Fourth District and how the district has changed over time. \n\nWill you join us? https://t.co/PAIbwn9VG7","date":"Tue Mar 09 22:02:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"HAPPENING NOW: Join us with the link below.","date":"Tue Mar 09 00:45:03 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I am grateful for @RepDavids' leadership on the @TransportDems Committee. \n\nWith leaders like her on the Future of Transportation Caucus, I trust we will deliver transportation infrastructure legislation that is equitable, accessible, and sustainable.","date":"Mon Mar 08 19:40:25 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The franchise is the bedrock of our democracy. As we remember Bloody Sunday, we honor the legacy of John Lewis and the 600 other advocates who fought for voting rights. The fight continues. #RestoreTheVRA https://t.co/QEn0VLsx0w","date":"Mon Mar 08 17:31:52 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We are going to pass the #AmericanRescuePlan because that is what the American people want, it's what they need, it's what they were promised, and it's what is required to get us to the other side of the pandemic.\n\nThanks @LindseyReiser and @kendisgibson for having me on. https://t.co/6uXzAj9ZlV","date":"Sun Mar 07 16:28:18 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Join me on Monday, 3/8, at 7:30 PM ET for the second installment of Congress Clubhouse: Transportation Priorities for Post-COVID Massachusetts. I’ll be speaking with @cdempc, and @stephanie_murr will moderate our conversation. \n\nSign up here: https://t.co/8uwccF375v https://t.co/imWYBYdIJd","date":"Fri Mar 05 00:30:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you, @protctdemocracy. \n\nThis amendment will empower our generation, and younger generations, to work together to tackle the challenges that will define our lifetimes.\n\nWe must ensure that anyone who can participate in our democracy has a chance.","date":"Thu Mar 04 19:10:04 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"No one should be able to purchase a gun without a background check. Period. \n\n#MoreThanThoughtsAndPrayers","date":"Thu Mar 04 18:01:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"H.R. 1, the #ForThePeople Act, just passed in the House. Fundamentally, this bill will protect and expand the right to vote and preserve the integrity of our elections. https://t.co/CwpZvD9evC","date":"Thu Mar 04 04:31:36 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Happy birthday, @CaroleFiola! No one fights harder for Fall River than you. https://t.co/H92MwUNtkN","date":"Wed Mar 03 21:01:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The freedom to vote is a fundamental American right. The #ForthePeople Act puts power back in the hands of the American people as it protects clean and fair elections. \n\nIt’s time to pass H.R. 1. — our democracy can’t wait. https://t.co/iMTH6OzyKc","date":"Wed Mar 03 17:52:31 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"@SenMarkey's Complete Streets Act would provide funding for better infrastructure for pedestrians, cyclists, scooters, buses, and motorists. It promotes:\n\n✅Safety\n✅Sustainability\n✅Access to jobs &amp; services","date":"Tue Mar 02 19:48:23 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Yesterday, @MassDOT announced that Attleboro and Newton are receiving needed funding for infrastructure and bike share improvements.\n\nWe need these investments across the country. @SenMarkey’s Complete Streets Act would improve mobility infrastructure everywhere.","date":"Tue Mar 02 19:46:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The second amendment would add “age” to the list of unlawful voter challenge arguments (which currently includes race, ethnicity, and national origin). No one should face discrimination at the polls.","date":"Tue Mar 02 17:00:48 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The first amendment would expand poll worker recruitment and training for young people. Younger generations deserve the opportunity to participate fully in the democratic process.","date":"Tue Mar 02 17:00:48 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, I put forth two amendments included in H.R. 1, the #ForthePeople Act. \n\nThe right to vote is the bedrock of our democracy, and my amendments will expand and protect this right for young Americans. https://t.co/dL8jjaJ4JC","date":"Tue Mar 02 17:00:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We’re live on Facebook. Bring your questions and join me here: https://t.co/VXSiYar1JT https://t.co/DHLovMiOfH","date":"Tue Mar 02 00:40:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As a Marine officer, I patrolled with an assault weapon for four years.\n\nAssault weapons have no place on our streets. We must take bold action to end the gun violence epidemic.","date":"Mon Mar 01 22:52:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Will you join me tonight at 7:30 pm on Facebook Live for a February legislative recap and audience Q&amp;A? Post your questions below ⬇️\n\nSign up here: https://t.co/VXSiYar1JT https://t.co/BnPol7fZ5E","date":"Mon Mar 01 21:28:22 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We must start evaluating projects not by what is shovel-ready but what is shovel-worthy for our next infrastructure bill. \n\nState and local officials are often best prepared to make decisions on these projects, and they must have a seat at the table.","date":"Mon Mar 01 18:19:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I hope you’ll join me tomorrow, 3/1, at 7:30 PM ET on Facebook Live for a legislative recap of what we accomplished in February and for a Q&amp;A session.\n\nSign up here: https://t.co/VXSiYar1JT","date":"Sun Feb 28 22:45:10 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It’s late but I’m energized and on my way to the floor to vote for the #AmericanRescuePlan. \n\n- More vaccines are coming \n\n- More relief is coming \n\n- A better summer is coming https://t.co/hqNSNrN87n","date":"Sat Feb 27 06:18:15 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Lecia Brooks, the COS for the ⁦⁦⁦@splcenter⁩ is absolutely right — there is a direct link between white nationalism, white supremacy, and anti-semitism. \n\nWe must stand united together to eradicate hate. https://t.co/L2ol1pwXZz","date":"Fri Feb 26 17:23:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #EqualityAct takes a massive step forward to advance our shared values, reflecting the tremendous progress forged by our generation and those who came before us.\n\nI’m proud to have voted “yes.” https://t.co/YfBmxoOIH7","date":"Thu Feb 25 21:26:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The #JusticeInPolicing Act is a comprehensive and necessary step towards holding police accountable and saving lives. It’s time to:\n\n▪️Ban chokeholds &amp; no-knock warrants;\n▪️Take weapons made for war out of our police departments. \n\nRetweet if you agree. https://t.co/hhB9qjzdTO","date":"Thu Feb 25 16:15:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"To defeat this pandemic and prevent another, we must enact the #AmericanRescuePlan and unlock its investment in life sciences research, development, and manufacturing here in the United States. https://t.co/enD9MiUymK","date":"Thu Feb 25 15:22:31 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"👇 @ashishkjha and I will discuss the Johnson &amp; Johnson developments tonight on Clubhouse. Join us at 7 pm ET to talk about the race between vaccines and variants, and the state of play in COVID-19.\n\nSign up here: https://t.co/PYdDDMHrYV","date":"Wed Feb 24 21:17:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"To make it happen, we must drop the 6-feet requirement, and we must ensure that all teachers have the opportunity to get vaccinated.","date":"Wed Feb 24 16:07:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I'm in support. Getting elementary students back to school in April - and everyone back to school soon after - is a matter of education, of the economy, and of equity.","date":"Wed Feb 24 16:07:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Join me tomorrow at 7 pm ET for the launch of my new series, “Congress Clubhouse.” @ashishkjha and I will discuss the race between vaccines and variants and the state of play in COVID-19. \n\nSign up here: https://t.co/PYdDDMHrYV","date":"Tue Feb 23 18:00:17 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"To mark the first day of #PublicSchoolWeek, I visited my 9th-grade physics teacher (and now vice-principal), Amy Winston, at Newton North High School, my alma mater. \n\nEducators like Ms. Winston work tirelessly to shape the minds of our youth, no matter the obstacle. https://t.co/v0KMQVjTv9","date":"Mon Feb 22 21:28:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Read more here: https://t.co/Qncjmm2bpv","date":"Sun Feb 21 23:16:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I called on the governor to develop a centralized, pre-registration vaccine system so that you know where and when you will get your vaccination. \n\nThis is 2021, we have the technology needed to implement an easily accessible vaccine system. https://t.co/JyzWS7NwSQ","date":"Sun Feb 21 23:16:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"@ariherzog I called on Gov. Baker to develop a centralized preregistration system. This is 2021 — vaccine scheduling should be seamless. \n\nWe must improve distribution and increase vaccination supply. We are taking needed steps— federal vaccine shipments increased by about 20% this week.","date":"Sat Feb 20 17:24:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"State Rep @jeffroy and I visited the Cold Chain Technologies headquarters in Franklin, MA, where we saw firsthand the company’s impressive effort to distribute vaccines to fight the COVID-19 pandemic. https://t.co/Ol4UkYtQQ8","date":"Sat Feb 20 17:07:30 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We are in a race between vaccines and variants, and we must expand access to vaccines as quickly and safely as possible. Massachusetts life sciences are once again leading the nation, and the world, in a time of crisis.","date":"Sat Feb 20 17:07:30 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"@KinniskaMakes I am happy to hear she was able to join the call this evening.","date":"Fri Feb 19 01:11:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Options are a complicated investment tool. Yes, they are a fast way to make money. They are also a fast way to lose money. Industry regulators require brokerages to vet customers who want to trade options. Robinhood, by contrast, pushes options onto its users.","date":"Thu Feb 18 22:32:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Gamifying day-trading, payment for order flow, and encouraging options trading prevent Robinhood from being a fiduciary to its customers, as required by Massachusetts law. Robinhood needs to make changes to protect its’ customers best interests.","date":"Thu Feb 18 22:32:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Due to the complexity of options trading, new or casual investors are destined to lose out to experienced options traders.\n \n68% of MA customers approved for options trading on @RobinhoodApp had limited to no investment experience.","date":"Thu Feb 18 22:32:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Payment for order flow is Robinhood’s primary source of revenue and the reason it can offer commission-free trading to customers.\n \nDoesn’t payment for order flow incentivize Robinhood to encourage customers to trade as often as possible regardless of their trade quality?","date":"Thu Feb 18 22:32:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Robinhood must explain how it can claim to comply with Massachusetts’ best-interest rule when it clearly incentivizes everyday people to become day traders.","date":"Thu Feb 18 22:32:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The vast majority of retail day traders, who try to pick individual stocks in competition with professional traders, lose money – and only about 1% consistently get better returns than low-cost index funds.","date":"Thu Feb 18 22:32:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Right now, half of US households have no stocks at all. Democratizing access to assets is an important objective – we *want* Main Street to own more of Wall Street. However, the best way to do that is through low-cost index funds, mutual funds, or ETFs.","date":"Thu Feb 18 22:32:57 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, the @FSCDems held a hearing on market volatility involving GameStop stock and other stocks in late Jan. I questioned the CEO of @RobinhoodApp about its trading practices, and I wanted to share my line of inquiry with you. Thread below:","date":"Thu Feb 18 22:32:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Black Americans are 3.6x more likely to be arrested for cannabis-related offenses than white Americans. This racial injustice must end.\n\nI’m joining @RepBlumenauer and @RepBarbaraLee in urging the Biden administration to pardon cannabis convictions.\n\nWe need #CannabisJusticeNOW.","date":"Thu Feb 18 20:06:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"There can be no room in our country to discriminate against LGBTQ+ folks. Everyone deserves the right to be who they are and love who they love, without fear of discrimination.\n\nPassing the #EqualityAct is an essential step towards a more equal future.","date":"Thu Feb 18 18:54:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We need an Operation Warp Speed for getting kids back to school. It’s a matter of education, of equity, of the economy.\n\nThe issue of physical distancing requirements (6 vs 3 vs 0 feet) will be the critical constraint, and science must be our guide. 2/2 \nhttps://t.co/vSWCgJS7vn","date":"Tue Feb 16 19:58:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@ProfEmilyOster gets it right. CDC guidance is welcome. We need to recognize, at the same time, that under current guidelines, at current trajectory, we are not getting kids back to full-time, in-person learning soon. And that’s just not acceptable. 1/2","date":"Tue Feb 16 19:58:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We need to make sure this worst president in American history does not have the power to hold office again. It’s a threat to national security.","date":"Mon Feb 15 16:11:18 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The majority of the GOP is still too scared to do what is right. You can't incite an insurrection against the United States Government. The #ImpeachmentTrial  has now carried through and we need to explore other options available to us. https://t.co/aXZQQUgru0","date":"Sun Feb 14 20:09:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#MSDStrong https://t.co/rtAtKe2EE0","date":"Sun Feb 14 16:11:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Republicans voted to acquit a man whose actions directly led to the murder of a police officer. Congress has paths in front of us and I am a strong supporter of using Section 3 of the 14th Amendment to prohibit Trump from holding office again. #Impeachment https://t.co/7m86vJ0c1A","date":"Sun Feb 14 00:36:31 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"VA Boston will be conducting a #Covid-19 Vaccine clinic to Veterans 65 and over this Saturday at Boston Police Post 1018 in Dorchester, MA. first-come-first-serve. Details below: https://t.co/zGrR7B3A1k","date":"Fri Feb 12 22:34:28 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"President Biden is pushing for a one-year expansion of the #ChildTaxCredit to give relief to families but we can do more. Millions are struggling because of the #COVID19 crisis and we must deliver direct payments to families, which is why I am supporting the #AmericanFamilyAct. https://t.co/PzLvZLHBuq","date":"Thu Feb 11 16:11:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"On @FSCDems we're leading key legislation on:\n\n-$25B for Rental assistance\n\n-$10B for Small business recovery\n\n-$5B for Homeless assistance\n\n-$10B for Homeowner assistance\n\nWatch the markup on the package now | https://t.co/F4dE3Ou8cp https://t.co/sapLAzVf0L","date":"Wed Feb 10 17:10:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We are in a race between vaccinations and variants. It is essential we go big and bold with a #COVID19 relief package. Read my letter to House and Senate leadership pushing our district priorities as we work to pass President Biden’s American Rescue Plan: https://t.co/VJTf7LZfZ2 https://t.co/q33bdP2jsC","date":"Wed Feb 10 15:09:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Thank you, @BeccaRauschMA - Attleboro and other Gateway Cities need more support for testing &amp; vaccinations. https://t.co/iabrKwA0uz","date":"Wed Feb 10 00:36:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"One of the best trial lawyers in Massachusetts just texted me: “@RepRaskin’s close was as powerful as I’ve ever seen.”\n\nProud to watch him, @RepJoeNeguse, and the rest of the impeachment managers protect and defend the Constitution.","date":"Tue Feb 09 20:00:45 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@TransportDems are making sure we’re protecting transportation workers and passengers amid #COVID. I’m participating in a hearing today focusing specifically on ways to support our nation’s maritime workers during the pandemic. Watch: https://t.co/uNS673CnOL https://t.co/N7h3rJf1wW","date":"Tue Feb 09 17:40:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"OTD: Massachusetts became the sixth state to join the union and we’ve been making history ever since! Enjoy this #LibraryOfCongress birthday graphic from the @librarycongress and respond with your favorite fact about the Bay State. https://t.co/dpfYKUsfiH","date":"Sat Feb 06 21:33:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Gun violence changes lives forever. This #GVSurvivorsWeek, @Everytown and @MomsDemand are sharing the stories of bravery and pain that help prove why we need to end the plague of gun violence that has haunted our country for too long.  https://t.co/GUc1TBtgcz","date":"Sat Feb 06 18:02:13 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The Coronavirus Containment Corps Act provides the resources to hire new contact tracers, including Americans who are unemployed. I’m proud to partner with @RepAndyLevin and @SenWarren to curb the spread of COVID-19 while putting Americans back to work! https://t.co/fhz5WJiASF","date":"Sat Feb 06 15:09:58 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"If we harness the power of renewable energy we can tackle the challenge of climate change and create jobs while doing it.","date":"Fri Feb 05 22:35:26 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"No one should be forced to choose between earning a paycheck &amp; taking care of themselves or a family member. Building an economy that works for everyone means passing the #FamilyAct and creating a comprehensive and inclusive national paid family and medical leave program. #FMLA28","date":"Fri Feb 05 18:05:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Veterans 65 and over: VA Boston will be conducting a #Covid_19 vaccine clinic this Saturday at Whitman VFW Post 68:  first come, first serve. See below for details: https://t.co/tQX5k1M61Y","date":"Fri Feb 05 14:58:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today, we’re holding a hearing with @FSCDems on President Biden’s plan to respond to the #COVID pandemic and rebuild the economy by boosting vaccinations, sending direct payments to Americans and local governments, and offering rental assistance. 📺 Watch: https://t.co/D7hsdM9fhC https://t.co/vu2T4d0p2R","date":"Thu Feb 04 15:36:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Without delay, Massachusetts must scale mass-testing for schools. Using COVID-19 surveillance testing to get students back to school so that they don’t continue to fall behind is our bridge over a hard winter. https://t.co/WWMbKWMOdF","date":"Wed Feb 03 21:08:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"There’s no rebuilding the economy without reopening schools. This must be a top priority as we work on the next #COVID relief package.","date":"Tue Feb 02 15:01:27 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"My friend @EricLesser is right – Massachusetts should be leading the way in vaccine distribution. Thank you for taking action as we work with @POTUS at the federal level to expedite #COVID vaccination supply #mapoli","date":"Tue Feb 02 00:49:06 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Americans, small businesses, and local governments are struggling right now and we need to get #COVID relief fast. This has become a matter of life and death as well as a matter of livelihoods and we just can't wait for the GOP to come around to what is so clearly necessary. https://t.co/wD1EHX5OgQ","date":"Sun Jan 31 18:44:55 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Perfectly put: “The proposal would diminish the building’s role as a symbol of American democracy.”","date":"Sat Jan 30 17:47:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Healthcare for all. Not ‘healthcare for those with a passport’ or ‘healthcare for those with a job’. Healthcare for all.","date":"Sat Jan 30 14:58:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I’m joining every single Democrat in Congress to support #PaycheckFairness. #EqualPay for women isn’t just about fairness – it’s about building an economy that works for everyone.","date":"Fri Jan 29 19:23:46 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The GOP knew what it was getting well before Marjorie Taylor Greene when it embraced Donald Trump in 2016 - that is really when a ticking time bomb began. GOP leaders own this issue and they all need to take ownership of removing this faction of white supremacy and extremism. https://t.co/mbZSeD4RwO","date":"Fri Jan 29 14:13:05 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It is a mistake to turn the home of our democracy into a fortress. The Capitol needs to be safely open for constituents, press, and visitors.","date":"Thu Jan 28 20:18:20 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Words have consequences. @RepMTG should resign. If she doesn't, Congress needs to expel her. If you don't understand that calling for the murder of political rivals is a threat to democracy, you shouldn't be allowed to represent one.","date":"Wed Jan 27 23:04:16 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@POTUS appointing the first @ClimateEnvoy is a strong first step to tackling some of the biggest challenges of our generation: climate change, American global leadership, and an economy that works for everyone. #SolvingtheClimateCrisis\n#EnvironmentalJusticeforAll https://t.co/hzRRVMxiff","date":"Wed Jan 27 20:42:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#IWalkForJustice because financial barriers should not stand between people and access to equal protection under the law @EqualJusticeMA. https://t.co/5FXCeLqdEd","date":"Wed Jan 27 17:22:31 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Affordable housing is the bedrock for an economy that works for everyone. @POTUS is off to a strong start by ending policies at HUD that have contributed to the racial wealth gap. https://t.co/IMPB5lp7Pw","date":"Tue Jan 26 23:14:09 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Transportation and infrastructure is at the intersection of jobs, climate change, and racial justice. I look forward to continuing the work I’ve done on the city council and in the private sector to build the foundation for an economy that works for everyone.","date":"Tue Jan 26 22:49:49 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Science is doing the impossible in helping to crush #COVID19. Now, @MassBioEd is recruiting for free training, professional mentoring, and a paid one-year life sciences\napprenticeship at pharmaceutical companies in Massachusetts:  https://t.co/53zEO42WXv","date":"Mon Jan 25 14:10:47 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"New president, new colleagues, renewed hope in America.","date":"Sun Jan 24 22:35:37 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"#ERANow!","date":"Sun Jan 24 15:58:50 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@USGAO is making the right call in listening to our demand to investigate the events of January 6th. We need accountability.","date":"Sat Jan 23 17:36:00 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As we celebrate 48 years of safe, legal abortion thanks to Roe v. Wade  let’s also recommit ourselves to a future where no barriers stand between people and their access to care. #ReimagineRoe #RoeAnniversary. https://t.co/I7Mut1Vk5z","date":"Fri Jan 22 19:00:56 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Joe Biden is not Donald Trump. Trump got a waiver because he needed adult supervision in the National Command Authority. @POTUS is getting a waiver because we’re facing a series of cascading crises. America has said they need Joe Biden and Joe Biden has said he needs Lloyd Austin https://t.co/dSCftY0giP","date":"Thu Jan 21 12:25:11 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Our economy, and our future, requires a nationwide commitment to solving the #ClimateCrisis. Today, @POTUS took the first important step by rejoining the #ParisAgreement. I’m proud to say #WeAreStillIn. https://t.co/XtLeeqXZvj","date":"Wed Jan 20 22:46:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Semper Fidelis.","date":"Wed Jan 20 19:51:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Michelle and I are leaving my office and heading over to the Capitol for the #Inauguration of @JoeBiden. It’s an honor to represent the Massachusetts fourth, witness history, and turn a new page. https://t.co/Xb98YvS14m","date":"Wed Jan 20 14:47:59 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As we prepare for #InaugurationDay, communities across the country are lighting up in honor of those we've lost to #COVID19. In rebuilding our nation, we can never forget those we’ve lost and the responsibility we have to prepare for another pandemic.","date":"Tue Jan 19 23:26:16 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Dr. King was able to have optimism about the future even at the lowest points in American history. Now more than ever, we must steel ourselves to answer his call of service, to show what true moral leadership looks like, and govern by example. #MLKDay https://t.co/gsPWSzkTgq","date":"Mon Jan 18 16:26:34 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Representative Brooks has repeatedly and baselessly blamed others, including unnamed fascists, rather than accept responsibility for the weight of his words as a leader. https://t.co/sg7OEIAoiK","date":"Sun Jan 17 23:01:52 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"There are significant issues with the structure and the command and control of the District of Columbia National Guard that must be addressed.","date":"Sun Jan 17 19:13:52 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Speaking with Secretary-designate @PeteButtigieg about the Future of Transportation Caucus’s principles of access, equity and sustainability. Buses are an environmental issue, a jobs issue, and a racial justice issue. Excited to work with him and @TransportDems. https://t.co/P1GEk9NUWr","date":"Fri Jan 15 21:11:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As veterans and Members of Congress, who have taken the Oath of Office twice over, we have sworn to protect the Constitution and hold accountable our fellow Americans who have served in uniform to the Oaths they themselves have sworn to our country.","date":"Thu Jan 14 21:01:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"As a Marine officer, I defended our democracy from foreign enemies. As a Member of Congress, I am solemnly resolved to defend it from domestic ones. With this vote, we strike a blow for moral leadership. https://t.co/4u5BVpBHyJ","date":"Wed Jan 13 21:06:35 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I don’t want to be unified with insurrectionist, @Jim_Jordan. Now is the time for moral leadership, not a locking of arms with conspiracy theorists storming the Capitol.","date":"Wed Jan 13 17:59:29 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just walked off the House floor. I'm calling on Vice President Pence to finally - after four years - display the moral courage of putting country and constitution first. If he fails to do so, we *will* impeach Donald Trump this week. https://t.co/uw1fJxAAmE","date":"Wed Jan 13 04:03:48 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"If you go to Congress and you take an oath to support and defend the Constitution of the United States, you cannot then in your next breath encourage people to overthrow the federal government. https://t.co/jVD7AAsHTe","date":"Wed Jan 13 01:16:39 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Proud to have my constituent write so lucidly in support of science and truth. Look forward to working with you, ⁦@RWalensky⁩!  https://t.co/uNnTsIokOc","date":"Tue Jan 12 20:56:32 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"President Trump is incapable of executing the duties of his office.","date":"Mon Jan 11 19:37:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Law enforcement was seemingly unprepared for the mob that descended on the Capitol despite the hundreds of thousands of posts spread about it publicly online. We’re demanding answers.","date":"Sun Jan 10 17:38:43 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"The Executive Branch is not permitted to incite insurrection against the Legislative Branch. That is an impeachable offense and Trump will be impeached for it. https://t.co/HdBcgGlr8I","date":"Sat Jan 09 17:00:18 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"In the aftermath of one of the darkest days in our nation’s history, we are forced to reconcile with difficult truths about failures of leadership and preparation. The failures of security are far more easily corrected than the failure to lead and the abuse of the public trust.","date":"Fri Jan 08 17:56:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Last night I said Trump must be removed from office immediately and held to account for inciting insurrection against our nation. As Pence lacks the moral courage to invoke the 25th amendment, I have signed on to the impeachment resolutions offered by @Ilhan and @RepCicilline 1/","date":"Fri Jan 08 00:22:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Yesterday’s events also proved we need a full investigation into our government’s failure to secure the Capitol. I’m joining @RepJasonCrow in demanding that we examine how domestic terrorists were able to disrupt yesterday’s joint session and overtake Congress. 2/","date":"Fri Jan 08 00:22:51 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":".@RepRitchie and I stand together to support the Constitution tonight - and to help this country rebuild in the days and years ahead. https://t.co/hVTOVVE4IO","date":"Thu Jan 07 06:02:19 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"I just walked off the House floor. This dark day will not define our democracy. We’re here, we’re voting, the electoral college will be certified. https://t.co/alpwsmytJA","date":"Thu Jan 07 03:50:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Agree.","date":"Thu Jan 07 00:57:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"This is a dark day for our democracy, but no mob will keep Congress from fulfilling its constitutional responsibility. We will certify @JoeBiden  &amp; @KamalaHarris as the next leaders of our country. https://t.co/R9Bhi9AdAo","date":"Wed Jan 06 21:59:01 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Tomorrow is when we can show the world that we’re better than this. With new leadership, we will end this pandemic. And with a rising generation of young voters and elected officials, we will tackle climate change and build an economy that works for everyone. Onwards. 4/","date":"Wed Jan 06 18:10:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It is disgraceful that with COVID raging and American lives and livelihoods on the line, a subset of Republicans are manufacturing a Constitutional crisis. 2/","date":"Wed Jan 06 18:10:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Today I am voting to certify the results of the #ElectoralCollege in what should be a symbolic process that showcases our nation's commitment to democracy and the peaceful transfer of power. 1/ \nhttps://t.co/hjeRUWeAnj","date":"Wed Jan 06 18:10:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Their lack of moral courage in the face of a temper tantrum from a defeated president has made this perhaps the most dismal day for democracy in our lifetimes. \n\nBut at the end of this dark day, the Constitution will prevail. 3/","date":"Wed Jan 06 18:10:41 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Along with Transportation &amp; Infrastructure, I’ll be serving on Financial Services next term.\n\nMy focus: building an economy that works for everyone.","date":"Wed Jan 06 01:10:07 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Yesterday, I hosted a virtual tour of my DC office, introduced some of my new team, and answered questions from constituents. In case you missed it, the whole virtual open house can be watched here: https://t.co/VP5DS1KJq7","date":"Tue Jan 05 17:26:54 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"\"I think this is an opportunity for the millennial generation to take on the challenges that are going to define the next decades\" https://t.co/qaHpREwI8P","date":"Tue Jan 05 01:50:42 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"It is the honor of a lifetime to represent the people of MA-04. We have a tremendous responsibility to end the #COVID19 pandemic and begin rebuilding an economy that works for everyone: working families, women, communities of color, and small businesses. https://t.co/5SlKGuu6uB","date":"Mon Jan 04 01:21:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"We also have a unique opportunity - with a new presidential administration - to move past the chaos and discord of the last four years and start tackling the challenges that will define my generation: climate change, racial injustice, and inequity in opportunity. #117thCongress","date":"Mon Jan 04 01:21:53 +0000 2021","user_id":"1330278736554582016"},{"handle":"RepAuchincloss","text":"Next stop, Washington DC! https://t.co/vkKeMeZpMr","date":"Sat Jan 02 19:46:02 +0000 2021","user_id":"1330278736554582016"}]