[{"handle":"RepAdams","text":"Today from 9:30 AM to 2:00 PM, the @HBCUCaucus hosts the 5th Annual Diversity in Tech Summit. Registration is free and open to everyone virtually. Join us as we create opportunities for #HBCU graduates and all students in the workforce.\n\nRegister here: https://t.co/3vslKoZEoN https://t.co/38W4GjRZCr","date":"Fri Jun 17 12:40:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Equity in financial services - basic necessities like access to credit - is long overdue. Proud to support this package. https://t.co/msjWMuxwfF","date":"Thu Jun 16 22:04:13 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"All of my Republican colleagues voted against legislation to give President Biden more power to crack down on gas company price gouging.\n\nHigh gas prices are politically convenient for them, so they do nothing.\n\nThey can afford it. You suffer at the pump.\n\nIt’s a GOP con game.","date":"Thu Jun 16 21:03:45 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"For years, small businesses have paid far too many excessive fees charged by ocean shipping companies. Those costs get passed on to consumers in the form of higher prices. The #OceanShippingReformAct will help change that.","date":"Thu Jun 16 20:00:32 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Tomorrow from 9:30 AM to 2:00 PM, the @HBCUCaucus hosts the 5th Annual Diversity in Tech Summit. Registration is free and open to everyone virtually. Join us as we create opportunities for #HBCU graduates and all students in the workforce.\n\nRegister here: https://t.co/AyCVUMyx0r https://t.co/nz0vl0PFxa","date":"Thu Jun 16 19:51:48 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The #LowerFoodAndFuelCostsAct is designed to reduce our dependence on foreign fertilizer production and help American farmers lower their costs through USDA funds and loan guarantees. Lower costs for farmers = lower costs for families.","date":"Thu Jun 16 19:30:34 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"For the first time in three decades, the Senate reached bipartisan agreement on a framework on gun violence prevention. Together we must #EndGunViolence.","date":"Thu Jun 16 19:01:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Our top priorities must include fighting inflation and lowering costs. House Democrats are #BuildingABetterAmerica by passing bipartisan legislation to lower food, fuel and shipping costs for the American people.","date":"Thu Jun 16 18:30:27 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"We can't stand by and let vital child nutrition programs expire on June 30th. https://t.co/g8SXCIoyW4","date":"Thu Jun 16 18:16:11 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Stunning work!","date":"Thu Jun 16 13:03:33 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Our children deserve reliable food sources. We can't let school nutrition waivers expire. No child should ever go hungry. https://t.co/48Rwk2m3MI","date":"Wed Jun 15 21:40:48 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I'll be speaking shortly on the floor of the US House about our child hunger crisis. https://t.co/YDZVIELKmY","date":"Wed Jun 15 20:30:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The Financial Services Racial Equity, Inclusion, and Economic Justice Act is a comprehensive and long overdue #RacialJusticePackage that addresses racial and ethnic disparities in employment, income, wealth, and access to affordable credit. #HR2543","date":"Wed Jun 15 19:41:49 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#HR2543 builds on ongoing work to advance racial &amp; economic justice. This includes the passage of #BBB, the bipartisan infrastructure law, and the COMPETES Act, which all directly address inflation, supply chain problems &amp; our nation’s housing crisis. https://t.co/v6kSXb0Q5w","date":"Wed Jun 15 19:08:15 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Did you know?: Black-owned businesses are twice as likely to be rejected for loans &amp; receive three times less in overall capital. That’s why the House is considering #HR2543 today—to level the playing field and to help minority businesses.","date":"Wed Jun 15 18:41:34 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"This week, @HouseDemocrats will pass the #LowerFoodAndFuelCostsAct, a package of bipartisan bills to lower prices for America’s families in the grocery aisle and at the gas pump by giving America’s farmers and ranchers the support they need to thrive. https://t.co/eKn9LVYSom","date":"Wed Jun 15 15:07:45 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I stand with the @HispanicCaucus to recognize the 10th Anniversary of DACA. Senate: It’s time to pass the Dream and Promise Act and create pathways to citizenship, including for DACA recipients. #NoSonOlvidados https://t.co/bIyVIr4J3z","date":"Wed Jun 15 14:20:42 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Abortion care providers are essential healthcare workers—they show up and adapt constantly to ensure all people can get the care they need. We must extend the same protections we offer the Supreme Court to our abortion providers. #HealthcareProvidersSafetyAct","date":"Tue Jun 14 17:57:12 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The 125% rise in instances of assault and battery against abortion providers is unacceptable. We need to ensure the safety of those who ensure the safety of those seeking essential procedures. #HealthcareProvidersSafetyAct https://t.co/U0rRXaXiTu","date":"Tue Jun 14 17:46:37 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Abortion providers courageously provide sexual and reproductive healthcare in the face of unrelenting threats, violence, and harassment by anti-abortion extremists. Protecting those who provide for us is the bare minimum. #HealthcareProvidersSafetyAct https://t.co/8vnO5x8ZgC","date":"Tue Jun 14 17:19:15 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Healthcare workers should not fear for their lives. It's time we protect them with the same level of importance as our Supreme Court Justices. #HealthcareProvidersSafetyAct","date":"Tue Jun 14 16:46:41 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Reports of arson, attempted bombings, vandalism, stalking, hate mail, and harassment against abortion care providers have skyrocketed in recent years. I’m proud to support the #HealthcareProvidersSafetyAct to ensure abortion clinics can afford the security they need and deserve https://t.co/HhlYvtM3u2","date":"Tue Jun 14 16:16:48 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, we celebrate our national flag and the core principles it represents: unity, diversity and integrity 🇺🇸. \n \n#FlagDay https://t.co/X2F0gqvDwa","date":"Tue Jun 14 15:57:40 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The US Army was created on this day 247 years ago. Today--and every day--I'm celebrating and thanking those who have honored our country by serving in the Army's uniform. https://t.co/RQLmGjQIKf","date":"Tue Jun 14 14:14:40 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"According to Fox News' news director, by the time they called Arizona, Trump would have had more luck winning Powerball than winning the 2020 election with a recount. #January6th","date":"Mon Jun 13 15:26:51 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us on Wednesday June 29 for our first-ever Men's Health Symposium! \n\nRegister Here: https://t.co/Tj0f6ZvlGe https://t.co/UqpnJBh7mS","date":"Mon Jun 13 15:16:15 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Watch Today's @January6thCmte Select Committee Hearing Live now: https://t.co/rZIl03KQAz via @YouTube","date":"Mon Jun 13 14:00:44 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Enough is Enough! #MarchForOurLives https://t.co/f3hbz5Sz5N","date":"Sun Jun 12 16:54:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"It’s been 6 years now. The survivors of the mass murder at #Pulse nightclub, as well as the families and friends of the victims as well as the entire #LGBTQ community, deserve better than inaction on gun violence.\n\n#HonorThemWithAction","date":"Sun Jun 12 14:18:34 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I didn't ask for a pardon.\n\nBut a certain President who \"engaged in insurrection or rebellion against the [United States], or given aid or comfort to the enemies thereof\" may need to ask both houses of Congress to restore their ability to hold office, per the 14th Amendment.","date":"Fri Jun 10 15:04:30 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Your daily reminder that instead of saying something transphobic or homophobic to a #LGBTQ student or neighbor, you could always just be quiet ...\n\n... or even better, an ally. \n\nEmpathy and basic human decency shouldn't be this hard.","date":"Fri Jun 10 14:50:13 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I’m proud to work with my Congressional colleagues, the Administration, and stakeholders like Attorney General @JoshStein_ to #CancelStudentDebt - especially debt from for-profit institutions that defrauded students and borrowers alike. https://t.co/KS8gdOJp3e","date":"Fri Jun 10 13:36:54 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Even Ivanka Trump knows the election wasn’t stolen. #January6th","date":"Fri Jun 10 00:38:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The @January6thCmte was formed to find the facts. The committee has conducted more than a thousand interviews and received more than 140,000 documents. Their findings are critical to ensure that nothing like January 6th ever happens again. #January6th","date":"Thu Jun 09 21:39:08 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"If we don't stand up to them, they'll try again. https://t.co/dj6v3mr4WI","date":"Thu Jun 09 21:13:44 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"El 6 de enero fue un ataque a nuestra democracia y la Constitución, y el pueblo estadounidense merece respuestas sobre lo que condujo a la violencia de ese día. #January6th","date":"Thu Jun 09 17:58:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Our democracy is endangered by those who attack the rule of law and amplify lies about the 2020 election. \n\nTonight, the Jan. 6 Committee will begin telling the American people the full story and set out recommendations so nothing like the January 6th attack ever happens again.","date":"Thu Jun 09 15:49:21 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you to all of the survivors of gun violence, especially the students of Uvalde, who are bravely speaking up.\n\nWe should live in a country where kids can enjoy their summer break instead of coming before Congress to testify about their trauma.\n\nI’m with you. Let’s act now.","date":"Wed Jun 08 21:35:35 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Many of the policies and legal theories used to separate the interests of the mother and a fetus are rooted in the evils of slavery. \n\nWe do not want our laws to reflect the horrors of that history. #RoeVWade https://t.co/O9NBR6aqTq","date":"Wed Jun 08 19:58:48 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"With no fewer than 247 mass shootings so far this year, the gun violence in our schools and our streets is worsening. \n\nWe must move forward to pass the #ProtectingOurKidsAct and stop this senseless carnage.","date":"Wed Jun 08 19:14:01 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today marks 3 years since 49 innocent people were killed at #Pulse nightclub in Orlando. Since then, we’ve lost too many more lives to gun violence. It’s time for the Senate to vote on the bipartisan gun control legislation the House passed. #HonorThemWithAction","date":"Wed Jun 12 18:39:11 +0000 2019","user_id":"2916086925"},{"handle":"RepAdams","text":"Senator Feinstein is the survivor of a double murder at her workplace. I hope Senator Manchin listens to what she has to say. #EndGunViolence","date":"Wed Jun 08 16:02:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today I remembered a champion for the people of Mecklenburg County; a trailblazer for Black women, especially those in public service; someone who always looked out for “the least of these;” the Honorable Ella Butler Scarborough. #MeckBOCC #CLTCC https://t.co/lX7lzsp9sM","date":"Wed Jun 08 14:54:03 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Please join me in remembering Commissioner Ella Scarborough this morning. I'm celebrating her life on the House Floor now. https://t.co/Y8GYn3Yx0H https://t.co/aJzqfUzang","date":"Wed Jun 08 14:08:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"President Trump approved $6.552 Trillion in spending for FY 2020 with a deficit of $3.132 Trillion, the largest in history and the largest as percentage of GDP since World War II.\n\n… but I don’t see you calling it Trumpflation.","date":"Tue Jun 07 21:23:32 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thinking of our friend and former colleague @Abby4Iowa as we introduce this legislation today.","date":"Tue Jun 07 20:33:28 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Saddened to hear of the passing of “Mother Margaret” Alexander, a stalwart leader in Charlotte’s civil rights movement. \n\nHer work deserves to be remembered.\n\nMy prayers are with her sons Kelly and Alfred, the entire Alexander family, and everyone who was blessed by her life.","date":"Tue Jun 07 14:21:46 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Some people are willing to trade our kids for their guns.\n\nWell, I’m not willing to live with this, and neither are you.\n\nThis week @HouseDemocrats are going to take action by passing common-sense gun reforms. Again.\n\nIt’s past time for the Senate and Republicans to join us. https://t.co/eEHpCICxL5","date":"Tue Jun 07 02:26:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy #Pride Charlotte! https://t.co/TUrVjVYNcC","date":"Mon Jun 06 20:29:07 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@CastroRoot @ChelseaCirruzzo @theobserver Welcome to Charlotte!","date":"Mon Jun 06 19:21:24 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"There were six murders in Charlotte last week.\n\nOver 75% of the murders committed in Charlotte so far this year involved a firearm.\n\nAt some point our country has to admit that the guns are the problem.","date":"Mon Jun 06 17:05:24 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"People around the world watch American TV and movies.\n\nThey play American video games. \n\nThey listen to our music. \n\nThey deal with mental illness and crime.\n\nThe time for excuses is over. It’s the guns and we know it. #WearOrange","date":"Sun Jun 05 20:08:23 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"My prayers are with the City of Brotherly Love this morning, as well as the victims, the survivors, and their families and friends.\n\nFor them and many others, I will vote for comprehensive measures to address our country’s gun violence epidemic this week. https://t.co/7OkQKhCPTt","date":"Sun Jun 05 12:56:05 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"In case you missed it, you can watch the replay of our Gun Violence Awareness Day virtual event here: https://t.co/mSXynksXnM via @YouTube","date":"Fri Jun 03 17:18:18 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Please join me, @CharMeckDA Spencer Merriweather, @MomsDemand Action Volunteer Leader Grace McLain, and many others at 11 AM today for a Gun Violence Awareness Day Event. #WearOrange \n\nhttps://t.co/FRDPd3kliG","date":"Fri Jun 03 13:21:21 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Amen.","date":"Thu Jun 02 21:47:53 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#CancelStudentDebt https://t.co/OfBib3k0cb","date":"Wed Jun 01 21:44:08 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm an original cosponsor of the Assault Weapons Ban Act since it was introduced on March 11th last year. #EnoughIsEnough","date":"Wed Jun 01 17:31:33 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Please join me this Friday and #WearOrange to stand up to gun violence in our schools, our towns, our places of worship, and across our county. https://t.co/CdyPhkS53g","date":"Wed Jun 01 17:11:46 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Some kids have two moms.\nSome kids have trans uncles.\nSome kids have nonbinary siblings.\n\nInstead of protecting them from gun violence, many state legislatures are telling these kids not to talk about their families or lives.\n\nIt's hateful, it's undue, and it's a brand-new #HB2.","date":"Wed Jun 01 17:07:14 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy Pride Month! https://t.co/Jh9DzxMDXk","date":"Wed Jun 01 15:40:51 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the last day of #AAPI History Month, and a good day for a reminder from @bts_bighit about the importance of ending all hate crimes, including those against the Asian American community.","date":"Tue May 31 20:22:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@RepChuyGarcia @BeeKamens Happy Birthday Evelyn!","date":"Tue May 31 18:15:26 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"On #MemorialDay, we salute all who have bravely served our country &amp; remember those who made the ultimate sacrifice in the name of freedom https://t.co/gE1Z0LAH3a","date":"Mon May 30 17:38:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"On #MemorialDay, we remember the brave men and women who gave their lives to defend our country against all enemies. \n\nI will continue to honor their sacrifice each and every day, and pray for the loved ones left behind. https://t.co/w0tomkQbwL","date":"Mon May 30 11:21:08 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"As Asian American and Pacific Islander Heritage Month comes to a close, I want to highlight the work we’re doing with @RepUnderwood and the @BMHCaucus to make sure every group that’s disproportionately affected by the maternal health crisis can look forward to a better future.","date":"Sat May 28 16:19:03 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"From Team Adams:\n\nPlease join us in wishing a very Happy Birthday to Congresswoman Alma S. Adams, PhD! https://t.co/AKJMPaAHag","date":"Fri May 27 09:27:14 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"As we mourn the lives lost in Uvalde, we also remember and honor the life of George Floyd whose life was taken too soon two years ago today. Thank you @POTUS  for signing this historical executive order to combat police brutality.","date":"Thu May 26 00:14:26 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Unfortunately, #NC12 is all too familiar with the effects of gun violence. #RileyHowell and #ReedParlier are two of the many lives taken way too soon due to gun violence. #StopGunViolence","date":"Wed May 25 20:18:18 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"May is #MentalHealthAwarenessMonth  and now more than ever, more Americans need access to affordable mental health care. We must make changes to keep guns from high-risk people through common-sense #GunViolencePrevention legislation.","date":"Wed May 25 20:14:28 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The House has already passed legislation to stop this senseless gun violence that would save lives in every community across the United States. I urge my colleagues in the Senate to bring this legislation to the floor. #StopGunViolence","date":"Wed May 25 20:09:51 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I am so sorry to hear of Commissioner Scarborough’s passing. She was an extraordinary public servant who loved her God, her constituents and served our community and state admirably for decades. \n\nMy prayers and thoughts will continue to be with her family. https://t.co/GFNSgNSB0J","date":"Wed May 25 13:21:43 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I am heartbroken by the shooting at Robb Elementary School in Uvalde, Texas. As a grandmother and mother, I pray for all the lives lost, injured, and the families who are affected. No parent should have to send their child to school in fear that they will never return.","date":"Tue May 24 22:29:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"One of the largest and oldest trees in the community fell across Dilworth. No one hurt. Be safe. #treedown #Charlotte https://t.co/OGReXEPXd9","date":"Tue May 24 20:01:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us tomorrow at Noon!\n\nRSVP Here: https://t.co/QUn1o2BoAs https://t.co/B7qwBuztT0","date":"Mon May 23 22:46:15 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy Birthday to our communications director Sam Spencer who was surprised last week with cupcakes from our District Office.\n\nHappy Birthday Big Sam! https://t.co/Ur2aDfB4oo","date":"Mon May 23 16:57:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Harvey Milk Day is a time - right before Pride Month - to celebrate decades of progress for the #LGBTQ community, and how far we still have to go. Thank you Harvey for your historic runs for office, and for opening closet doors across America and the world. https://t.co/LsZwkaOw9F","date":"Sun May 22 15:44:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"This Armed Forces Day, let's celebrate all who serve in uniform with honor. #ArmedForcesDay https://t.co/8ID0tMp5DR","date":"Sat May 21 14:00:02 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"On Armed Forces Day, we honor the women and men who heed the call defend our Constitution. The valiant members of our armed forces defend our country with bravery and honor. Today and every day, I appreciate their selfless work, and remain humbled by their sacrifices.","date":"Fri May 20 15:57:11 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#BikeToWorkDay is about more than just commuting—it's about ensuring biking, walking, and rolling are safe, comfortable, and accessible options for all—whether you’re 8 or 88.\n \nThat’s why the Bipartisan Infrastructure Law invests $12 billion to give everyone more options. https://t.co/DwQBK21Eph","date":"Fri May 20 15:12:04 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"In observance of Mental Health Awareness Month, join me for \"Let's Talk About Mental Health\" on Zoom, Tues., May 24 at 12noon.  https://t.co/1hySwaFJbd https://t.co/hdylISQtmf","date":"Thu May 19 17:32:01 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Good morning, Charlotte!","date":"Thu May 19 11:04:48 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"This week marks 68 years since the landmark Brown v. Board of Education #SCOTUS decision.\n\nUnfortunately, the follow-up decision ambiguously ordered schools to desegregate \"with all deliberate speed.\"\n\nIn Charlotte, Dorothy Counts integrated Harding High School three years later. https://t.co/X110TODvQq","date":"Wed May 18 15:21:24 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"My love and support goes out to all of our LGBTQ neighbors today. Your lives matter. #TransLivesMatter\n\nHate has no place in the halls of Congress, in North Carolina, or in our country, and I’m going to continue to work for a world without it. https://t.co/CvtncMW5J0","date":"Tue May 17 15:49:52 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"North Carolina, today is Election Day! The people we elect make decisions for and about us, so don’t let it be without us! \n\nPolls are open until 7:30 PM. Click here to find your polling place, and don’t forget to vote: https://t.co/bFRAVzp61z","date":"Tue May 17 11:38:15 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"My prayers go out to the victims of the horrific tragedy in Buffalo. For the lives lost, the injured and the families who morn, I pray for your healing and comfort. \n\nI pray also for Congress to find the courage to end gun violence and condemn the hate running rampant in the U.S.","date":"Mon May 16 22:55:34 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#NC12 deserves safe, complete streets.\n\nI hope Charlotte and our towns consider applying for the Bipartisan Infrastructure Law’s Safe Streets and Roads for All (SS4A) Grant Program so we can get closer to reaching our #VisionZero goals. \n\nhttps://t.co/ggEsHEG2YQ","date":"Mon May 16 17:15:46 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Free Infant Formula!","date":"Mon May 16 15:58:12 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Listen up, Charlotte!","date":"Mon May 16 15:13:53 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Get well soon, friend!","date":"Mon May 16 00:48:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Congratulations to #NC12’s own @StephenCurry30 on graduating from Davidson College!","date":"Sun May 15 19:15:36 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Congratulations to our Mayor who gave the commencement address at JCSU today, and received  the Honorary Doctorate of Humane Letters.\n\nCongratulations Dr @ViLyles on this outstanding achievement and your incredible work on behalf of our citizens.","date":"Sun May 15 18:22:19 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Honored to receive my 8th honorary doctorate from Virginia State University today! https://t.co/mNnWQcW2Gp","date":"Sat May 14 15:36:53 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"We must #ProtectRoe.\n\nThe SCOTUS draft ruling would:\n🚨 Limit our bodily autonomy\n🚨 Overturn the 49-year-old precedent of Roe v. Wade\n🚨 Undermine the Constitutional right to privacy\n🚨 End a woman's right to make intimate and personal decisions","date":"Fri May 13 18:43:43 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"North Carolina’s Democratic women are standing up for #RoeVWade. https://t.co/R2nn3aA8Le","date":"Fri May 13 15:53:08 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I could not be prouder of all of our amazing #HBCU graduates! \n\nI expect you to go on and do great things because you, my friends, are #HBCUStrong!","date":"Fri May 13 14:28:33 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is @PressSec's final presser ... good luck in all your future endeavors Jen!","date":"Fri May 13 14:07:29 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm encouraged to see President Biden take action to get infant formula back on store shelves quickly and safely.\n\nAdditionally, they're helping moms across the country by urging states to provide consumers flexibility on types of formula they can buy with WIC dollars.","date":"Thu May 12 20:52:18 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"\"My rallying cry to my fellow Realtors has been to encourage their sellers to sell their homes to people and not corporations. Our housing market is healthiest when humans own homes and not corporations.\" - @JonathanOsman \nhttps://t.co/1xxCiUlvKq","date":"Thu May 12 15:43:27 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I'm introducing the \"Security for Sale\" series from @theobserver into the Congressional Record. \n\nInstitutional investors purchased 40,000 NC homes in the past decade. They're one of many factors putting home ownership further out of reach. \n\nhttps://t.co/g15091jS5i https://t.co/MkgTmyUvtk","date":"Thu May 12 14:14:49 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Wage theft is robbery that hurts our most vulnerable workers. It’s past time we put our labor force before corporate greed.","date":"Wed May 11 14:30:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Every worker in America should have the right to organize for livable wages, decent benefits and better working conditions—and that includes right here in Congress. \n\nI voted to pass our resolution tonight and I’m proud to support congressional staff in their efforts to unionize.","date":"Wed May 11 00:57:42 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Justice Samuel Alito used Sir Matthew Hale's writings to justify his draft decision reversing #RoeVWade.\n\nAmong other things, Hale sentenced women to death for witchcraft.\n\nInstead of quoting a 17th century English jurist, Justice Alito should read the 13th Amendment.","date":"Tue May 10 18:50:58 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"If the Senate doesn't #EndTheFilibuster so we can finally pass the Women's Health Protection Act into law, politicians will take away our bodily autonomy and control women's health care decisions.","date":"Tue May 10 18:38:03 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Election Day is one week away, North Carolina! \n\nDon't forget to vote! Early Vote runs until Saturday, May 14 and Election Day is Tuesday, May 17.\n\nhttps://t.co/1vJtLCqHYA","date":"Tue May 10 17:22:03 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Dr. Amanda Stevenson at UC Boulder estimated that if abortion were banned &amp; all pregnant people were forced to carry to term, there would be a ~21% increase in the number of pregnancy-related deaths overall, and about a 33% increase among non-Hispanic black women. #RoeVWade","date":"Mon May 09 17:34:04 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Already, maternal mortality rates are unacceptable in the US. Black women are three times more likely to die in childbirth in the US than white non-Hispanic women.\n\nThe draft Dobbs decision reversing #RowVWade will undoubtedly make our nation’s maternal health crisis worse.","date":"Mon May 09 17:34:04 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"“To describe my mother would be to write about a hurricane in its perfect power. Or the climbing, falling colors of a rainbow.” - Maya Angelou \n\nBlessings and love to my Mom and all of the mothers on this #MothersDay. https://t.co/I1wyua3OBK","date":"Sun May 08 16:28:40 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm honored to be @HustonTillotson's 2022 Commencement Speaker. HT, you are #HBCUStrong!\n\nWatch the 2022 Commencement live from #ATX here:  https://t.co/68J2o87k9O","date":"Sat May 07 14:00:02 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Honored to join the HT community this weekend! #HBCUStrong","date":"Fri May 06 21:02:30 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Please see below and be safe, Mecklenburg!","date":"Fri May 06 17:58:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"There's still time! The deadline has been extended to apply for @TheBlackCaucus Spouses Education Scholarship.\n\nApply Below: https://t.co/eZT41V67LV https://t.co/a7rF039GWl","date":"Fri May 06 12:50:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The deadline has been extended to apply for @TheBlackCaucus Spouses Education Scholarship.\n\nApply Below: https://t.co/eZT41V67LV https://t.co/qaRhNrT50z","date":"Thu May 05 21:49:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you to @NEAToday for honoring me with the Friend of Higher Education Award! https://t.co/UKwUSLPa04","date":"Thu May 05 21:23:36 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy #TeacherAppreciationWeek to all of the educators who shape our next generation, and generations to come! https://t.co/oTwmaDNQHp","date":"Thu May 05 15:55:22 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Access to safe and legal abortion care is fundamental to personal and economic freedom. \n\nThe ability to control if and when to have a child has lifelong consequences not only for moms, but also their families and communities. #RoeVWade","date":"Thu May 05 14:50:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"As a small business owner myself, I’m recognizing all the small businesses that help make Charlotte and Mecklenburg County great.\nThese businesses are the foundation of our economy and the glue that holds our community together.\nHappy #SmallBusinessWeek! https://t.co/QPPrEFEBTD","date":"Thu May 05 14:42:26 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Get well soon, G. K.!","date":"Wed May 04 16:44:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"This is terrifying, and confirms what we already knew: that this extreme Supreme Court is hostile to women.\n\nBut just as important: abortion is still legal, it's still a right, and it's still available here in North Carolina.","date":"Tue May 03 12:30:16 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Motherhood is a gift to many women, including myself; but it should never be involuntary. Forcing women to carry a pregnancy to term deprives us of our autonomy and equality.\n\nDespite the horrid news, I will continue to fight to make our right to choose the law of the land.","date":"Tue May 03 12:28:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Best wishes to all during these holy days! 🌙 #EidMubarak https://t.co/fQp03s1Yp0","date":"Mon May 02 20:09:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @Fisk1866 for your hospitality and for honoring me with the Fisk University Presidential Medallion as an educator and an advocate. Congratulations to all of today's graduates. #HBCUProud #HBCUStrong https://t.co/bBHkO7pf1E","date":"Mon May 02 15:49:22 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The debt is too damn high.","date":"Mon May 02 15:19:10 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"If you live in Davidson, please participate!","date":"Mon May 02 15:16:36 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I'm speaking at the 2022 Spring Commencement of Fisk University. Watch now https://t.co/QVOVUqODz8 Congratulations to all! #HBCUStrong #hbcucaucus #HBCUProud","date":"Mon May 02 14:39:10 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today my thoughts are with the entire UNC Charlotte community; my prayers are with the survivors and the victims, Riley Howell and Reed Parlier, as well as their families and friends; and my actions in Congress continue to work for a future without gun violence. https://t.co/engsIH8I2C","date":"Sat Apr 30 14:42:28 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Welcome to the next President of @DavidsonCollege, Doug Hicks!","date":"Fri Apr 29 16:40:17 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"This #WorkersMemorialDay, we remember countless workers who lost their lives braving unsafe and unhealthy conditions. If a worker is essential, then their safety is essential.\n\nThe time is always right to protect the rights of workers and to speak up for safe jobs!","date":"Fri Apr 29 01:52:24 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@HustonTillotson Can’t wait to join you on campus!","date":"Wed Apr 27 20:40:46 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"It’s a perfect date to celebrate the 40th Anniversary of the @AmericanAir Hub at @CLTAirport!\n\nNot to hot and not too cold - all you need is a light jacket and a hat. https://t.co/D8WLoebcNZ","date":"Mon Apr 25 15:38:45 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy National Volunteer Week!  Volunteers make a huge impact in our communities. While I support volunteers every day of the year, this is a great opportunity to say thank you!  #NVW","date":"Fri Apr 22 19:57:41 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Climate change is an existential threat to the United States and humanity itself.\n\nThe consequences of this man-made disaster disproportionately affect communities of color and poor communities.\n\nThis is not a problem that should be left for the next generation. #EarthDay22","date":"Fri Apr 22 12:59:54 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The ability to secure safe, affordable housing is linked to better outcomes for every person in nearly every facet of life including:\n💵 Economic opportunity\n🎓 Educational attainment\n🌎 Environmental justice\n⚕️ Healthcare\n🏡 Living a healthy &amp; independent life\n#FairHousingMonth","date":"Tue Apr 19 18:39:35 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"“This could happen to anyone. Look at women like @Beyonce and @SerenaWilliams, who had these near misses because the doctors really didn’t pay the kind of attention that they should have.” #BlackMaternalHealth  https://t.co/ujpJFAkaUo","date":"Tue Apr 19 13:36:28 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"It’s #TaxDay.\n\nDon’t forget to file your taxes today - or file for an extension.\n\nAnswers to frequently asked tax filing questions are available here:\nhttps://t.co/BQFDCtT9mr","date":"Mon Apr 18 15:20:01 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"“He is not here. He is risen.”\n\nHappy #Easter","date":"Sun Apr 17 13:52:17 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"On #GoodFriday, we remember an innocent man, arrested and beaten and executed by a tyrannical government not because it was right, but because it was expedient.\n\nMay his love and sacrifice in the face of death deliver us all.","date":"Fri Apr 15 23:06:08 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"This week, across North Carolina, families will celebrate Passover. \n \nThis #Passover, I am inspired by the liberation of the Israelites from slavery, the exodus from Egypt, and the search for the promised land. \n \n#ChagSameach to all. https://t.co/n0ueXbUOeT","date":"Fri Apr 15 14:37:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@AngryBlackLady To all the people who can Quest like A Tribe does\nBefore this, did you really know what live was?","date":"Thu Apr 14 18:57:32 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Hey Charlotte, look who I found! https://t.co/PfPHGzIQ57","date":"Thu Apr 14 18:40:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"We must pass the #Momnibus. Our Mamas can't wait.\n https://t.co/aAXKCZxvur","date":"Thu Apr 14 18:21:16 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Along with my Congressional colleagues, I have been sanctioned by the Russian Federation and Vladimir Putin.\n\nIt is no surprise Putin is afraid of strong women, because it is the women of Ukraine and Russia who will clean up his mess.","date":"Wed Apr 13 21:12:57 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Busy day today. Honored to be invited to speak at the opening of the Charlotte Advanced Technology Collaboration Hub. \n\nWe’re creating great jobs here in Charlotte. https://t.co/8cR5N3U7mL","date":"Wed Apr 13 17:32:22 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"We’re live now! Join us!","date":"Wed Apr 13 16:03:19 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Love seeing North Carolina's own @RonnieChatterji working across the country!","date":"Wed Apr 13 13:57:36 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#BlackMaternalHealthWeek isn’t a week to celebrate. It’s a week to inform, and act.\n\nMaternal health outcomes in the US are unacceptable, and even worse for Black parents.\n\nIf a “close call” can happen to @Beyonce &amp; @serenawilliams, it can happen to anyone.\n\nWe must act. #BMHW22 https://t.co/3aGRqlWKg0","date":"Wed Apr 13 13:49:41 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Don't forget to join us at 12:00 Noon ET today for our #BlackMaternalHealth Forum! \n\nRegister Here: https://t.co/9n0hdSflmK https://t.co/v7GPPqXJ7K","date":"Wed Apr 13 13:28:19 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Getting my second booster today. Crushing #COVID19 requires all of us to be on top of our health. https://t.co/6u2WDYMI6z","date":"Tue Apr 12 18:10:13 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Even #COVID19 impacts #BlackMaternalHealth. https://t.co/f68TMgFG5j","date":"Tue Apr 12 12:20:32 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you to @SenBooker, my @BMHCaucus co-chair @RepUnderwood, and the over 110 cosponsors in the House and Senate who are supporting our 2022 Black Maternal Health Week Resolution.\n\nYour support says Black Mamas Matter! #BMHW22 \n\nhttps://t.co/We0CWIPb3t","date":"Mon Apr 11 18:58:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the first day of Black Maternal Health Week 2022. \n\nPlease join us in discussing the Black Maternal Health Crisis, finding solutions, and lifting the voices of Black Parents. #BMHW22 \n\nhttps://t.co/aAXKCZxvur","date":"Mon Apr 11 14:39:04 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Auntie Alma co-signs! What a moment of pride for us and our future leaders.","date":"Sat Apr 09 00:36:58 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Are you ready for Black Maternal Health Week next week? #BMHW22","date":"Fri Apr 08 20:06:07 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Register to join our #BMHW22 Panel at https://t.co/0caikAyTaf https://t.co/LmCLxQ1QEm","date":"Fri Apr 08 18:19:27 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"My statement on the historic confirmation of #KetanjiBrownJackson: https://t.co/RBF3bMxpAU","date":"Thu Apr 07 18:13:36 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"History.\n\nCongratulations Justice Jackson! https://t.co/vYMLpu2ksn","date":"Thu Apr 07 18:03:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Best wishes and prayers for my friend and colleague @SpeakerPelosi.","date":"Thu Apr 07 15:07:42 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is a great day to confirm a Supreme Court Justice.","date":"Thu Apr 07 11:34:07 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"From Diana Ross on stage to Ketanji Brown Jackson in court, #BlackWomenAreSupreme!","date":"Thu Apr 07 00:29:23 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today’s announcement is yet another example of how President Biden’s Bipartisan Infrastructure Law is continuing to help Charlotte and Mecklenburg County #BuildBackBetter. \nhttps://t.co/bcqadrWAQs","date":"Wed Apr 06 17:06:56 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#CancelStudentDebt","date":"Wed Apr 06 15:46:12 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The Debt is (still) too damn high, but this is the right response from President Biden. #CancelStudentDebt","date":"Wed Apr 06 14:38:40 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#CancelStudentDebt","date":"Tue Apr 05 21:19:41 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The debt is too damn high. That's why I'm working with my colleagues for #StudentDebtRelief. https://t.co/j31rD0RppA","date":"Tue Apr 05 16:44:24 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Americans need #StudentDebtRelief - not only from the crushing burden of debt itself, but also from the harm caused by the predatory practices of creditors.\n\nYour student loans shouldn’t prevent you from getting a mortgage and buying a house. https://t.co/iTEvoalrOl","date":"Tue Apr 05 14:47:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The debt is too damn high.\n\n#StudentDebtRelief","date":"Tue Apr 05 13:58:34 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"This morning, I'm proud to join my colleagues @RepNikema, @RepHaleyStevens, and @RepDeborahRoss to talk about the crushing burden of student debt, and legislation we've introduced together - the #CleanSlateSeries - to address this crisis. \n\n#StudentDebtRelief https://t.co/IW5oZh7pRC","date":"Tue Apr 05 13:34:06 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Media: this morning’s press conference on student debt relief will not be held outside the Capitol and instead will be at the rain location inside Rayburn. \n\nPlease DM us ASAP if you plan on attending.","date":"Tue Apr 05 12:35:04 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"54 years ago today, the world lost MLK.\n\nThe night before, he said, \"I've seen the Promised Land. I may not get there with you, but I want you to know tonight that we as a people will get to the Promised Land.\"\n\nI continue to hope we get there soon.\n\nhttps://t.co/3w3C2zxCMu","date":"Mon Apr 04 13:37:18 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Whether you went to Duke or UNC, all of us can agree to #CancelStudentDebt.","date":"Sun Apr 03 04:01:59 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Tonight, the evening of April 1, 2022 is the beginning of #Ramadan. \n\nMuslims in North Carolina around the world take time during the month of Ramadan to reflect upon their faith and to strive for deeper compassion and charity.\n\n#RamadanMubarak https://t.co/Vk2153UsRF","date":"Fri Apr 01 20:43:08 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@cynthiagibas Not an April Fools joke, though there may have been some humor to it. It passed the House earlier today; 424 total votes were cast. https://t.co/735MGyTmYT","date":"Fri Apr 01 17:34:25 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@heatherwritesss @itshullabalulu Great question. We’ve sent multiple COVID relief and COVID response funding bills to the Senate. We’re currently negotiating on versions of legislation that can pass the Senate and the House. I am hopeful we will pass more relief and response funding soon.","date":"Fri Apr 01 16:39:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"In all seriousness, every 90 seconds, one person in this country is arrested for a minor marijuana crime.\n \nToday, I’m voting to finally put an end to the criminalization of marijuana in the U.S. and begin repairing the harm of decades of failed drug policy.\n \n#WeNeedMORE","date":"Fri Apr 01 14:55:54 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Update: HR 3617, the Marijuana Opportunity Reinvestment and Expungement #MOREAct is on a roll and is expected to pass the House today. At least 420 members are expected to cast votes.","date":"Fri Apr 01 14:55:54 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you to @SpeakerPelosi and her staff for joining us for #HBCUSTEAM Days of Action!\n\nOur schools are #HBCUStrong! https://t.co/ZV2nlgUSZn","date":"Thu Mar 31 19:23:21 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Great to see the Progress Pride Flag on our #HBCUSTEAM Days of Action Meetings during #TransDayOfVisibility! Thanks to #HBCU Partnership Challenge Member @BASFCorporation for representing!\n\n@ratemyskyperoom, I rate that a 10/10. https://t.co/scBZObvbCh","date":"Thu Mar 31 17:55:07 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today's the day! Join us at 12:00 Noon ET for a star-studded #HBCU Partnerships Panel with our schools, the @WhiteHouse, Members of Congress, corporate partners, and more!\n\nRegister here: https://t.co/zqgeNWeHQp https://t.co/8cuFFiBSTK","date":"Thu Mar 31 12:51:02 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, @HBCUCaucus members and partners are meeting with @PatrickMcHenry's staff about #HBCU and @FinancialCmte priorities as part of #HBCUSTEAM Days of Action! https://t.co/zJcVZG5smy","date":"Wed Mar 30 18:51:54 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Under President Biden, America is taking unprecedented steps to hold Russia accountable:\n✅ $13.6 billion in support for Ukraine\n✅ Revoke permanent normal trade relations from Russia\n✅ Reauthorize and strengthen the Global Magnitsky Human Rights Accountability Act","date":"Wed Mar 30 15:03:29 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Tuskegee University counted at least 100 lynchings in North Carolina between 1882 and 1968.\n\nDespite over 200 attempts, lynching has never been designated a federal hate crime. \n\n@RepBobbyRush’s Emmett Till #AntilynchingAct changes that — and today, @POTUS is signing it into law.","date":"Tue Mar 29 19:39:02 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Bringing #HBCUs and partners together today for #HBCUSTEAM Days of Action. Our first meeting today is with @HouseAgDems Chairman David Scott and we're having a great discussion about the 1890s Institutions. #HBCUStrong https://t.co/6DMDsHh4jK","date":"Tue Mar 29 17:51:58 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Looking for a Summer internship? Look no further! \n\nOur D.C. Office is seeking interns for the upcoming Summer of 2022. This internship is based in the Washington, DC office and is open to college students and recent graduates.\n\nhttps://t.co/fspFCYIq1O","date":"Mon Mar 28 15:00:59 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Madeleine Albright often said, “There is a special place in hell for women who don't help each other.” As a feminist, diplomat, scholar, and leader, she opened doors and paved the way for countless women. \n\nMy prayers are with her family and friends as they celebrate her life.","date":"Wed Mar 23 18:53:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Judge Ketanji Brown Jackson:\n\n✔️ Received a unanimous \"Well Qualified\" rating from the nonpartisan American Bar Association.\n\n✔️ Would be the only former public defender on the court.\n\n✔️ Will make history.\n\n✔️ Is the most qualified #SCOTUS nominee in years.","date":"Tue Mar 22 14:40:16 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"When I Grow Up is a virtual forum designed to inspire women and girls, but is open to all. Our panelists will share their life stories and the pivotal moments that inspired their career journeys. \nREGISTER HERE: https://t.co/sViH8rUptJ https://t.co/yyRlDtIVNU","date":"Mon Mar 21 20:59:02 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Ketanji Brown Jackson's parents, Ellery &amp; Johnny Brown, both graduated from #HBCUs - giving their daughter the opportunity to attend Harvard University for both her Bachelor's and Law degrees.","date":"Mon Mar 21 19:55:53 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Judge Ketanji Brown Jackson is the most qualified Supreme Court nominee in years. That alone should merit sincere consideration from all 100 Senators. She has my full support, and my best wishes for a speedy confirmation.","date":"Mon Mar 21 13:58:54 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I would like to send my deepest condolences to the family and friends of my colleague, Don Young. \n\nDon lived an incredible life of service that was appreciated by his constituents across Alaska. My prayers are with his family, many friends, colleagues, and the people of Alaska.","date":"Sat Mar 19 06:16:24 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Go Wildcats! #Believe","date":"Sat Mar 19 03:12:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to celebrate the passage of the #CROWNAct today! https://t.co/mTtmd0KzOs","date":"Fri Mar 18 15:39:28 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud to work for affordable housing in every zip code, from Charlotte to Davidson.\n\nThank you Mayor Knox and the @TownofDavidson for your leadership.","date":"Fri Mar 18 15:01:26 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"On National Public Defense Day, a good reminder from one of our local Judges that the Sixth Amendment to the Constitution guarantees the right to counsel. \n\n“In all criminal prosecutions, the accused shall enjoy the right…to have the Assistance of Counsel for his defence.”","date":"Fri Mar 18 12:53:06 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"If it’s March 17, you know what color hat I’m wearing. 👒\n\nHappy St. Patrick’s Day, Charlotte! ☘️ https://t.co/me6TsvsJdp","date":"Thu Mar 17 18:39:45 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Reminds me of one of Lincoln's greatest quotes: \"We are not enemies, but friends. We must not be enemies. Though passion may have strained, it must not break our bonds of affection.\"\n\nPutin's war is not the Russian people's war.","date":"Thu Mar 17 17:18:07 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I'm happy to announce Community Project Funding Investments. $11.1 Million in funding will help support local projects in Charlotte, Davidson, Pineville, and across Mecklenburg County.\n\nRead more here: https://t.co/05itPJUf9W https://t.co/knzSl9efqV","date":"Thu Mar 17 14:20:23 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"President Zelenskyy called on Congress to act this morning, specifically imploring us that ‘More packages of aggressive sanctions are needed every week until the Russian military machine stops.’ I’m proud to answer that call. #UkraineUnderAttack https://t.co/W2wwylzm7O","date":"Wed Mar 16 21:13:28 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Tomorrow, I'm joining @FSCDems and Committee Republicans to pass legislation to further isolate Russia and support President Zelenskyy and the people of Ukraine. https://t.co/twcDjYGnwR","date":"Wed Mar 16 18:07:39 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks for noticing! Unfortunately, it's 2022 and we're still debating the science of climate change and the need for an environmental justice lens in policy making.","date":"Wed Mar 16 15:45:43 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"March 15—#EqualPayDay—marks the day in 2022 when women finally catch up with what men were paid in 2021. The average woman is paid just 83 cents per $1 paid to the average man. It's time to take a stand against pay inequity &amp; discrimination! We need #EqualPay for women everywhere","date":"Tue Mar 15 19:23:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us at 1 PM on Friday for our Virtual Tax Information Event!\n\nRegister here: https://t.co/bCpQixFvIu https://t.co/8G6tNxKy3l","date":"Tue Mar 15 19:18:13 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is #EqualPayDay. It's not a day to celebrate.\n\nAccording to @NPWF, women lose an average of $13,000+ to the wage gap each year. It's even worse for women of color.\n\nWe need equal pay now. https://t.co/xXBP5ak7f8","date":"Tue Mar 15 16:01:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Congrats @DubCLions!","date":"Sat Mar 12 21:16:34 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Congratulations @DavidsonMBB for advancing to the semifinals of the #A10Tourney!","date":"Fri Mar 11 22:34:16 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Team Adams attended the 2022 State of the County address today - great job #MeckBOCC Chair George Dunlap! https://t.co/CBedzAgDum","date":"Fri Mar 11 15:52:21 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Two years ago today, I joined @VP, @RepUnderwood, and @BMHCaucus to introduce the Black Maternal Health #Momnibus Act to address our country’s maternal health crisis.\n\nSince the pandemic started the crisis got worse. We need action. Mamas can’t wait.\n\nhttps://t.co/D2c86xTdjt","date":"Thu Mar 10 20:34:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"23,500 babies are stillborn every year. I'm proud to introduce the bipartisan and bicameral Maternal and Child Health Stillbirth Prevention Act of 2022 with @SenJeffMerkley, @SenBillCassidy and @RepAshleyHinson. https://t.co/iXGnisRD7i","date":"Wed Mar 09 22:10:30 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Last night, Team Adams was honored to deliver greetings at the #InternationalWomensDay celebration at International House in Plaza Midwood! https://t.co/5r7MO5C3TX","date":"Wed Mar 09 17:34:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks @1A and @WAMU for the chance to talk about this important issue.\n\nBlack Mamas Can’t Wait!","date":"Wed Mar 09 15:58:41 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"At 10 AM, I’ll be on @1A on @WFAE to talk about the work of the Black Maternal Health Caucus (@BMHCaucus) and the serious issues parents face in childbirth.\n\nListen live at https://t.co/rYVipRRDO2 or wherever you listen to public radio!","date":"Wed Mar 09 14:10:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#HBCUs have always been agents of equity, access, and excellence in education, especially for Black students. That’s why I’m proud to introduce H. Con. Res. 70, a resolution a resolution that condemns the despicable, cowardly bomb threats to HBCUs. #HBCUStrong https://t.co/AfhCKfTP3Z","date":"Tue Mar 08 18:05:14 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Student loan borrowers deserve a clean slate. That's why I'm proud to join @RepHaleyStevens, @RepDeborahRoss, and @RepNikema in introducing the Clean Slate Through Consolidation Act to improve the credit history of borrowers with defaulted loans.\n\nhttps://t.co/WT2Tok0y1H","date":"Tue Mar 08 17:14:40 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@RepSaraJacobs Thank you, Sara, for uplifting her voice!","date":"Tue Mar 08 15:18:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"DID YOU KNOW: $36 Billion in #AmericanRescuePlan funding went to support students, colleges and universities, including $1.3 Billion for North Carolina! https://t.co/FR2f14dCap","date":"Mon Mar 07 20:37:24 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"My prayers are with everyone in Ukraine whose life was interrupted to fight for democracy and freedom. 🇺🇦 https://t.co/dk2jAxAEyd","date":"Sun Mar 06 03:47:36 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Excited for tomorrow! Good luck @CharlotteFC! #ForTheCrown https://t.co/NJLkXblBhL","date":"Fri Mar 04 22:50:37 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Great economic news out today. Still much more to do, but @POTUS has us on the right track. #BuildBackBetter","date":"Fri Mar 04 13:35:08 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"They're about power over people.\n\nWe're about power for the people.\n\nPeriod.","date":"Thu Mar 03 15:43:06 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Great to hear. Welcome back, Ben Ray!","date":"Thu Mar 03 15:21:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@jjmastermind #AggiePride!\n\nYou dropped this ... https://t.co/D504HROQsY","date":"Thu Mar 03 14:50:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Great job on @CharlotteTalks today @RepRoKhanna! While you're on @WFAE don't forget some of the most essential engines for diversity in tech: #HBCUs!\n\nhttps://t.co/xjGnDqDxBp","date":"Thu Mar 03 14:47:31 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@repmarkpocan Prayers with you and your family Mark as you celebrate an amazing life.","date":"Wed Mar 02 15:43:47 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@areck12 @SenBooker @RepUnderwood @BMHCaucus \"Today, a woman is twice as likely to die from complications of pregnancy and birth than her mother was a generation ago. Black and Indigenous women are 2-3 times more likely than white women to die from complications of pregnancy.\" https://t.co/8rmHnFncq3","date":"Wed Mar 02 15:40:27 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"When the carrot doesn't work, the Eagle must use the stick.\n\nPresident Putin, more is on the way until you choose peace. 🇺🇦","date":"Wed Mar 02 15:38:32 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Last week, Senate Republicans held up the nominations of President Biden's well qualified Federal Reserve Board of Governors nominees by refusing to show for a vote. \n\nIt's time for the Senate to end its games and confirm @POTUS's nominees to the Fed. https://t.co/PHofYoJcSW","date":"Wed Mar 02 15:20:58 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"For #WomensHistoryMonth I want to recognize Commissioner Ella Scarborough, a trailblazing leader for Mecklenburg County and the first Black woman to serve on the Charlotte City Council.\n\nMy thoughts and prayers are with Ella and her family at this time. https://t.co/CSx9GM5wSm","date":"Wed Mar 02 14:27:47 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I’ll be listening to @WHCOS Ron Klain after the #SOTU tonight. https://t.co/iVK4y16tj9","date":"Wed Mar 02 03:29:17 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you President Biden for committing to increase support for #HBCUs in the #SOTU. The quickest and best way to do this is to pass the bipartisan IGNITE HBCU and MSI Excellence Act, which already has 180 supporters from both houses of Congress - and both sides of the aisle.","date":"Wed Mar 02 03:11:45 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"President Biden is right - we have to address the maternal health crisis. \n\nI’m proud to work with @RepUnderwood, @SenBooker, and the @BMHCaucus to send the #Momnibus to his desk. #SOTU","date":"Wed Mar 02 03:03:30 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you President Biden for pledging your support for #LGBTQ Americans.","date":"Wed Mar 02 03:01:17 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#KetanjiBrownJackson is supremely qualified. I hope to see the Senate confirm her soon. #SOTU","date":"Wed Mar 02 02:59:44 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"“Let’s increase Pell Grants and increase our historic support of #HBCUs, and invest in what Jill—our First Lady who teaches full-time—calls America’s best-kept secret: community colleges.”\n\nAmen, Mr. President! #SOTU","date":"Wed Mar 02 02:45:32 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"We must lower the cost of child care for everyone, especially the families that pay up to $14,000 a year for child care per child. #SOTU","date":"Wed Mar 02 02:39:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"As chair of the Workforce Protections Subcommittee, I agree:\n\nLet’s lower costs, not wages. \n\n#SOTU","date":"Wed Mar 02 02:34:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"“Our economy created over 6.5 Million new jobs just last year, more jobs created in one year than ever before in the history of America. \n  \n“Our economy grew at a rate of 5.7% last year, the strongest growth in nearly 40 years.” #SOTU","date":"Wed Mar 02 02:24:16 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The American Rescue Plan “fueled our efforts to vaccinate the nation and combat COVID-19. It delivered immediate economic relief for tens of millions of Americans.  \n  \n“Helped put food on their table, keep a roof over their heads, and cut the cost of health insurance.” #SOTU","date":"Wed Mar 02 02:23:13 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"“Putin may circle Kyiv with tanks, but he will never gain the hearts and souls of the Ukrainian people. \n  \n“He will never extinguish their love of freedom. He will never weaken the resolve of the free world.” #SOTU","date":"Wed Mar 02 02:21:54 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The American people stand united behind the people of Ukraine and against Putin’s attempts to divide our country. As long as we stand together, dictators will never prevail. 🇺🇦 \n\nThank you President Biden for your leadership. #SOTU","date":"Wed Mar 02 02:14:37 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Tonight, all of us stand with Ukraine. 🇺🇦","date":"Wed Mar 02 02:12:21 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Tonight, Americans of all political stripes share in our nation’s unwavering resolve that freedom will always triumph over tyranny. #SOTU","date":"Wed Mar 02 02:09:59 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The American people stand united behind the people of Ukraine and against Putin’s attempts to divide our country. As long as we stand together, dictators will never prevail. #SOTU","date":"Tue Mar 01 22:37:49 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Tonight, @POTUS will address Putin’s premeditated and unprovoked war against Ukraine. \n\nPresident Biden is not only our Commander-in-Chief but also our Diplomat-in-Chief, and has united our allies against authoritarianism and in defense of freedom and democracy. #SOTU","date":"Tue Mar 01 22:37:48 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the first day of #WomensHistoryMonth, and to all the young women and girls out there, I want you to know that I can't wait to see you make history! https://t.co/clTtBPJCFe","date":"Tue Mar 01 20:39:04 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I'd love to hear @POTUS #CancelStudentDebt in the #StateOfTheUnion tonight!","date":"Tue Mar 01 20:35:39 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"It’s #MardiGras2022 which means it’s time for our District Office King Cake! https://t.co/NT4VwT1cUi","date":"Tue Mar 01 15:07:45 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to announce our guest for the State of the Union: @JCSUniversity President Clarence D. Armbrister! #HBCUStrong https://t.co/hMsDf7RIVH","date":"Mon Feb 28 22:27:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"On the last day of #BlackHistoryMonth, remember these two things:\n\nYou have the ability to go out and make history, and\n\nEvery month is Black History Month.","date":"Mon Feb 28 14:31:12 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Congrats Anna!","date":"Mon Feb 28 01:54:10 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"ICYMI: My Statement on Ketanji Brown Jackson’s nomination to the Supreme Court of the United States. #SCOTUS https://t.co/9iVgVL2JQD","date":"Sat Feb 26 14:36:11 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Vladimir Putin and the Russian military have launched an illegal war that has already claimed innocent lives. #Ukraine is a sovereign, democratic country and this aggression against their people is unprovoked. I support @POTUS’s actions to impose significant costs on Russia. https://t.co/jsEavzNPn6","date":"Thu Feb 24 17:49:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#StopRussianAggression \n\n#RussiaInvadedUkraine https://t.co/kSN5ZNBlZF","date":"Thu Feb 24 17:45:23 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@mwilliamsonart @MSNBC @MSNBCDaily Great job Megan! Mind if I share on my social media?","date":"Thu Feb 24 15:56:43 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us tomorrow for our virtual #BlackHistoryMonth Small Business Forum! https://t.co/a92sdBqDvG","date":"Thu Feb 24 14:46:42 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@Katvanzan @Sharrison_WFAE I really appreciate hearing that. Thank you for that, Katherine.","date":"Wed Feb 23 20:01:48 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm praying for peace, and for the people of Ukraine. 🇺🇦","date":"Wed Feb 23 15:29:21 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"This #BlackHistoryMonth, I’m proud to introduce the African American Burial Grounds Preservation Act with @RepMcEachin, @RepFitzpatrick &amp; @SenSherrodBrown. \n\nThis bill will provide federal support for historic burial grounds to ensure their preservation.\n\nhttps://t.co/xMQixc4RLt","date":"Tue Feb 22 22:32:17 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Congrats! Today is a great day for #EqualPay.","date":"Tue Feb 22 16:23:57 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#BlackHistoryMonth","date":"Fri Feb 18 20:11:56 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Condolences to the family, friends, and staff of @RepHagedorn, who passed away yesterday after a long battle with kidney cancer.","date":"Fri Feb 18 14:44:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"\"On Feb. 18, 2006, Shani Davis won a gold medal in men's 1,000-meter speedskating at the Winter Games in Torino, Italy, becoming the first Black athlete to win an individual gold medal at a winter Olympics.\" - @qcitymetro #BlackHistoryMonth https://t.co/wiPnSJar3B","date":"Fri Feb 18 14:23:56 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Join my office for our virtual #BlackHistoryMonth Small Business Forum next week.\n\nWe’ll share information that small businesses, and those thinking of starting a business, need to know.\n\n🗓: Friday, February 25th\n⏰: 12:00 PM ET - 1:00 PM ET\n🔗: https://t.co/CWnawW5L3n https://t.co/GQXLQRELNI","date":"Wed Feb 16 16:42:22 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Our hometown hero @HamiltonAnthony is representing well on #VERZUZ tonight!","date":"Wed Feb 16 03:01:01 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"As a proud 2x #HBCU grad of @NCATSuAggies and a former professor at @BennettCollege, I know for a fact that HBCUs can overcome anything. https://t.co/OXfKJQRolq","date":"Wed Feb 16 00:11:02 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"However, there’s no place on American college campuses for domestic terrorism. \n\nSwiftly bringing the perpetrators to justice will allow professors to return to teaching and students to return to focusing on academics.","date":"Wed Feb 16 00:11:02 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The 5th bomb threat against #HBCUs was delivered towards @HowardU today. \n\nThese deliberate threats are disruptive, painful, and costly to the staff, faculty, and students. \n\nI am expecting the @TheJusticeDept and @FBI to step up the investigations into these acts of terrorism.","date":"Mon Feb 14 22:56:14 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I extend the most sincere and warm #ValentinesDay wishes to our veterans, essential workers, teachers, and first responders for their unwavering commitment and service.\n\nWe thank you for your labor of love💘 https://t.co/CMixbJr6hH","date":"Mon Feb 14 18:01:25 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thankful for the good news and praying for a swift, full recovery @SenatorLujan!","date":"Sun Feb 13 16:54:40 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you, @RepFrenchHill, and many of my colleagues for joining with the @HBCUCaucus to stand up to the recent threats against our campuses #HBCUStrong \n\n🔗 to the resolution: https://t.co/vgTp6An1cW https://t.co/1uttTGS7wt","date":"Thu Feb 10 21:40:34 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"President Biden's Infrastructure Bill is #ElectrifyingAmerica - including our home state of North Carolina: https://t.co/EREfINtK1z","date":"Thu Feb 10 18:05:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"“Like many others around the world, I owe our HBCUs a debt that can never be repaid,” Adams said in an emailed statement. “That is why I continue to pray for our institutions, and the souls of those who cannot or will not honor them.” #HBCUStrong\n\nhttps://t.co/gu2FmrRxOY","date":"Wed Feb 09 16:12:06 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The provisions included in the bipartisan #PostalServiceReformAct are critical to helping @USPS remain financially viable and ensuring my constituents get their mail on time.\n\nHere are my thoughts on Postal Service reform from 2000: https://t.co/XgRxi6D7kw","date":"Tue Feb 08 16:42:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Together, we can live up to the true meaning and intention of #BlackHistoryMonth. Let us make every month going forward one in which Black communities are safe and respected. https://t.co/E771YBjtj8","date":"Mon Feb 07 22:06:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks to @HouseDemocrats and @POTUS:\n✅ GDP grew last year at 5.7%\n✅ We created 6.6 million jobs\n✅ The unemployment rate dropped from 6.4% when Democrats took office to around 4%","date":"Mon Feb 07 17:41:21 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"According to @HIVGov, 42% of all new HIV diagnoses are among Black Americans. \n\nToday, on #NBHAAD, I urge my community to continue taking preventative measures to keep safe. Engage in safe, consensual sex and get tested regularly. Health is wealth! We can #StopHIVTogether https://t.co/FtVQg1cpHs","date":"Mon Feb 07 16:26:31 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today’s decision is a victory for free and fair elections. The NC Supreme Court recognized these legislative maps are an unconstitutional gerrymander that will disenfranchise voters. We deserve to be governed by representatives elected by competitive, democratic elections. #NCPol","date":"Fri Feb 04 23:16:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"We celebrate #TransitEquityDay on February 4, Rosa Parks’ birthday. \n\nMs. Parks played a key role in the Montgomery Bus Boycott and the end of segregation. To continue her work, we must make sure all communities have safe and reliable access to the transit options they need. https://t.co/wRMBqpvPwN","date":"Fri Feb 04 18:57:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, on #ThankAMailCarrierDay, we extend our sincerest gratitude to @USPS and its letter carriers and postal workers.\n\nSo much of American life depends on their dedication to delivering the mail, especially during #COVID. Thank you! https://t.co/c5YEcGF2bK","date":"Fri Feb 04 13:52:05 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Despite her steadfast views on politics and justice, she was respected by people across communities and across partisan lines for her candor and her genuine nature. I will miss my friend dearly, and I ask for your prayers today as we celebrate her homegoing. #BlackHistoryMonth","date":"Thu Feb 03 15:07:19 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Guilford County Commissioner Coleman was called by the Lord to do this work, and never abandoned that spirit of activism. Indeed, we were arrested together protesting for fair wages. She fought tirelessly for her constituents and always made sure they had a voice. https://t.co/vFBPOk8tZc","date":"Thu Feb 03 15:07:18 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I am joining a devastated community in paying our final respects to my dear friend Carolyn Coleman. In many ways, her activism and service to the community started 62-years-ago this week, as she was inspired by the A&amp;T Four who started the sit-in movement for civil rights.","date":"Thu Feb 03 15:07:16 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Joining @ZerlinaMaxwell right now on @peacockTV. #HBCUStrong https://t.co/agxiFlwupP","date":"Wed Feb 02 23:31:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Get well soon, Sara!","date":"Wed Feb 02 20:02:34 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Coach Flores' words are an important reminder that #BlackHistoryMonth isn't only about learning and studying history; it can be about making it, too.","date":"Wed Feb 02 18:39:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you Rachel @Maddow for giving me the chance to speak about the importance of #HBCUs and our resilience to any crisis. https://t.co/bQQ1Bgmljx","date":"Wed Feb 02 18:23:15 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The theme of #BlackHistoryMonth 2022 is \"Black Health and Wellness.\"\n\nAs co-chair of the @BMHCaucus, I work with co-chair @RepUnderwood and our colleagues to close the maternal mortality gap for Black women and all parents. \n\nLearn more here: https://t.co/eE4a7D5Fnn","date":"Wed Feb 02 15:22:35 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Completely agree. @morganpres is an excellent ambassador for @MorganStateU. #HBCUStrong","date":"Wed Feb 02 14:45:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm honored to join @MorganStateU President David Wilson (@morganpres) on @maddow tonight to talk about the despicable threats made to our #HBCUs. \n\nOur faculty, staff, and most of all our students are #HBCUStrong, even in the face of these hate crimes.","date":"Tue Feb 01 23:41:39 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Full release: https://t.co/4nghsLNHo0","date":"Tue Feb 01 22:17:06 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Below is a statement from @SpeakerPelosi, @RepBeatty, and myself on the despicable bomb threats against #HBCUs.\n\nTerrorism and racism have no place on college campuses or anywhere in our nation. https://t.co/VQBQTAu6At","date":"Tue Feb 01 22:15:52 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Wishing you a Happy Lunar New Year 🎉🧧\n\nMay this new transition bring more love, happiness, and prosperity to you and your loved ones #ChineseNewYear #YearOfTheTiger https://t.co/CHEE6E7sr7","date":"Tue Feb 01 22:05:29 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Since the 1999 Columbine High School massacre, over 292,000 students were harmed by gun violence at their schools.\n\nThat’s over 292,000 survivors. \n\nKeeping our students safe at school is common sense. It's time to save lives and end gun violence. \n\n#GVSurvivorsWeek https://t.co/qine5CsUid","date":"Tue Feb 01 19:43:46 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The A&amp;T Four and every American who joined the sit-in movement to protest the racism of the Jim Crow South eventually changed public policy. Nonviolent protests against injustice led to civil rights and voting rights for Black Americans. #BlackHistoryMonth","date":"Tue Feb 01 13:32:22 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"We, as a nation, have a responsibility to learn from our past and work diligently to carry on the legacy of these four men by ensuring equal rights for all people, and by protecting the civil rights they fought so hard to win. #BlackHistoryMonth","date":"Tue Feb 01 13:32:22 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Sixty-two years ago, four courageous Black students from North Carolina Agricultural and Technical College sat down at a whites-only lunch counter and asked to be served. In doing so, the Greensboro Four changed the United States forever. #BlackHistoryMonth https://t.co/663tgt0d5c","date":"Tue Feb 01 13:32:21 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Check out my video from last week's State of the District Address about how we're fighting for infrastructure and funding for critical projects in Charlotte, Mecklenburg County, and across North Carolina. https://t.co/45azuwUFAg","date":"Mon Jan 31 22:44:18 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"82 years ago, Ida May Fuller received the very first #SocialSecurity check. I am proud to be fighting for your benefits by cosponsoring Social Security 2100: A Sacred Trust. Together, we will ensure this program continues to serve our country for years to come! #Secure2100 https://t.co/JclXVzQKk8","date":"Mon Jan 31 19:13:19 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Please see the below statement from myself and @HBCUCaucus Co-Chair @RepFrenchHill on today's bomb threats on #HBCU campuses. Solving these crimes and bringing those responsible to justice should be a top priority for federal law enforcement.\n\nhttps://t.co/ERbgpHjH19","date":"Mon Jan 31 18:18:48 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"May she rest in peace.\n\nLife can be overwhelming at times, especially during a global pandemic. \n\nIf you or someone you love is struggling with mental health, please seek help from the @afspnational at (800) 273-8255. There is neither shame nor honor in suffering.","date":"Mon Jan 31 16:08:19 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I am deeply saddened to learn of Cheslie Kryst's passing. \n\nCheslie spent her formative years in Charlotte, and earned her graduate degrees from @WakeForest in Raleigh. \n\nShe represented us well as our 👑Miss North Carolina USA, ultimately winning the title of 👑Miss USA. https://t.co/M54DUoEizA","date":"Mon Jan 31 16:05:43 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#AggiePride https://t.co/XobqmtIydr","date":"Mon Jan 31 13:53:15 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"If you doubt voting rights are important, we can respectfully disagree, but only if you make an effort to see the issue through the eyes of us who fought and died for this right;\n\nBecause too many times, the price of the right to vote was paid in blood. https://t.co/kNu9UiYdIi","date":"Fri Jan 28 21:14:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Voting Rights is a Veterans issue, too.","date":"Fri Jan 28 17:08:00 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Behind the scenes at our State of the District Day events … https://t.co/ug5S0HIu1x","date":"Fri Jan 28 16:09:40 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @rabbijudy for leading us in prayer on #HolocaustMemorialDay. May we never forget the humanity of our neighbors, and may we never be silent in the face of evil. https://t.co/agVz2e2KiR","date":"Fri Jan 28 04:56:03 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I’m about to speak at the State of the District!\n\nYou can tune in on Zoom or Facebook here: https://t.co/jWuPrjjPQY https://t.co/OCeg7lWXwD","date":"Thu Jan 27 23:51:07 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The skyline looks beautiful from @cpcc tonight! https://t.co/GBgMMpNIXH","date":"Thu Jan 27 23:09:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Less than an hour until we start!","date":"Thu Jan 27 22:42:10 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Though our State of the District Address will be a little different this year, I hope you can make it (virtually) tonight at 6:30 PM.\n\nRegister Here: https://t.co/0agTJ8xCM5","date":"Thu Jan 27 21:24:26 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Don’t forget to register for our State of the District address tonight at 6:30 PM!\n\nRegister here: https://t.co/jWuPrjjPQY","date":"Thu Jan 27 18:51:50 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Though our State of the District Day will be a little different this year, I hope you can make it (virtually) tomorrow.\n\nRegister Here: https://t.co/0agTJ8xCM5 https://t.co/pF1IIXztHb","date":"Wed Jan 26 13:45:51 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"My statement on concerns about mail delivery in Mint Hill: https://t.co/6uQjwFbBkc","date":"Wed Jan 26 00:21:04 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@1PantherPlace Thanks for posting, John!","date":"Tue Jan 25 22:35:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Have you RSVPed for our State of the District Day yet? \n\nDETAILS: https://t.co/0agTJ8xCM5 https://t.co/XnMEgUUKrl","date":"Tue Jan 25 17:52:01 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Abortion is Healthcare.\n\n#RoeAnniversary","date":"Sat Jan 22 18:41:30 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"If you’re thinking of going out in this weather, turn around, take off your hat, sit down, and watch Netflix. \n\nStay safe tonight and enjoy the snow tomorrow! ❄️","date":"Sat Jan 22 03:51:33 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"The new Bipartisan Infrastructure Law means: \n⏰ Less time on congested roads \n💸 Fewer costly repairs \n🚲More and safer alternatives to driving \n🚌 More frequent transit \n✨ Better access to opportunities\n🚧 Millions of good-paying jobs\nTogether, we will #BuildBackBetter. https://t.co/gSg5cromcv","date":"Fri Jan 21 19:06:14 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Our State of the District Day has gone virtual due to the ongoing pandemic and the Omicron variant.\n\nLearn more here: https://t.co/25lcPYyWVz","date":"Thu Jan 20 23:06:22 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Nothing wrong with making some Good Trouble, @RepBowman! https://t.co/eY256Ir9es","date":"Thu Jan 20 18:32:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us virtually for State of the District Day on January 27: sign up here: https://t.co/0agTJ8xCM5","date":"Thu Jan 20 17:14:30 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Amen, Reverend. #EndTheFilibuster","date":"Thu Jan 20 00:44:27 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I can't imagine walking across the Edmund Pettus Bridge in Selma with John Lewis, experiencing the history of Bloody Sunday firsthand, and then turning around and blocking voting rights legislation.\n\nUnfortunately, there are some Senate Republicans who will do just that tonight.","date":"Wed Jan 19 23:01:33 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Condolences and prayers for André Leon Talley and his family and friends. Few people are in and of themselves a revolution in their field; André absolutely was in the world of fashion.","date":"Wed Jan 19 14:31:06 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#Jobs","date":"Tue Jan 18 19:24:49 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"🚨 Need a COVID-19 Test? 🚨\n\nFree at-home COVID tests can now be ordered through @USPS here:\n\nhttps://t.co/Wpz9nt7FF1","date":"Tue Jan 18 17:23:27 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Tomorrow is a snow day for @CharMeckSchools. https://t.co/6SL5bBMwnk","date":"Mon Jan 17 22:44:22 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy Birthday @MichelleObama! https://t.co/Cm9lZYk0Zn","date":"Mon Jan 17 17:27:29 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Dr. Martin Luther King, Jr. Day is about action. We can’t stand by and let injustice happen. We have a moral obligation to act. #MLKDay https://t.co/4YxGo3ASX4","date":"Mon Jan 17 15:28:56 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"North Carolina: please think of our first responders today and stay home unless you absolutely have to. 🌨🌨🌨","date":"Sun Jan 16 18:36:28 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"https://t.co/VuWlAhtkjq","date":"Sun Jan 16 03:30:41 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"https://t.co/HyYpUQF0b9","date":"Sun Jan 16 03:30:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"https://t.co/sS90Hcqbit","date":"Sun Jan 16 03:30:31 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"https://t.co/tG57D3mk9D","date":"Sun Jan 16 03:30:24 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"https://t.co/oDBgo7B01t","date":"Sun Jan 16 03:30:13 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"🧵 Winter weather is headed our way tonight, North Carolina ❄️\n\nUnless absolutely necessary, please consider staying home. Winter weather can be unpredictable.\n\nPlease be safe and make sure you and your family are prepared. https://t.co/apVA06KKtq","date":"Sun Jan 16 03:30:03 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"On #NationalHatDay, I'm proud to nominate Carolina @Panthers legend @CameronNewton for the Order of the Long Leaf Pine and the Order of the Palmetto, the highest awards given by the governors of the Carolinas.\n\nThanks Cam for all you've done for Charlotte and the Carolinas. https://t.co/p9jWx8vxl5","date":"Sat Jan 15 20:43:04 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, in 1908, on the campus of @HowardU, Alpha Kappa Alpha Sorority, Inc. was founded as the first sorority for Black women. By culture and by merit, we are proudly celebrating 114 years of sisterhood and service. We thank our Founders for their vision. https://t.co/RYbq86gwdy","date":"Sat Jan 15 15:37:07 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Senate Voting Rights 48/2/50\n\n#EndTheFilibuster\n\n🟩🟩🟩🟩🟩\n🟩🟩🟩🟩🟩\n🟩🟩🟩🟩🟩\n🟩🟩🟩🟩🟩\n🟩🟩🟩🟩🟩\n🟩🟩🟩🟩🟩\n🟩🟩🟩🟩🟩\n🟩🟩🟩🟩🟩\n🟩🟩🟩🟩🟩\n🟩🟩🟩🟨🟨\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜\n⬜⬜⬜⬜⬜","date":"Fri Jan 14 16:40:42 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy 109th Founder’s Day to the women of Delta Sigma Theta, Inc. ❤️🐘🤍\n\nI extend love to sisters near and far, especially the Deltas who serve in Congress #DST109 https://t.co/M1khaqjMwP","date":"Fri Jan 14 02:23:06 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"As someone who was born in the Jim Crow South, I can tell you that opposing voting rights legislation not only puts you on the side of Jim Crow, it puts you on the side of the folks who attacked our Capitol and tried to overthrow our democratically elected leadership.","date":"Thu Jan 13 17:12:14 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Let’s move forward: let’s pass the Freedom to Vote: John R. Lewis Act and give the power to hold politicians accountable back to the people. https://t.co/WxbdBxv9UC","date":"Thu Jan 13 16:54:47 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"As we’ve seen with the attacks on the Capitol and democracy itself, extremists are willing to ignore the results of free and fair elections. \n\nThat’s why it’s more important than ever that we secure voting rights now and for future generations.","date":"Thu Jan 13 16:54:46 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Gerrymandering cracks and packs the political power of minority voters, and unfair election laws target us with surgical precision.","date":"Thu Jan 13 16:54:46 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Our sacred right to vote is the right from which every other right in a democracy follows. It’s the most basic way to hold our policy makers accountable, because sometimes you can’t change policy without changing policy makers.\nHowever, that right is under attack. https://t.co/IV1shZqmD2","date":"Thu Jan 13 16:52:23 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, @HouseDemocrats are going to take another historic stand for voting rights. I stand with all of my colleagues from @TheBlackCaucus who know how sacred - and hard-won - the right to vote is. https://t.co/PDUqEMtai1","date":"Thu Jan 13 15:03:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"\"This is a coup attempt.\" - @RepKinzinger (R-IL)\n\n\"This should be treated as a coup led by a president that will not be peacefully removed from power.\" - Former Congressman @WillHurd (R-TX)\n\n\"an insurrection, incited by the President of the United States,” @SenatorRomney (R-UT)","date":"Wed Jan 12 19:38:46 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Yesterday, I joined @RepDavidEPrice, @GKButterfield, @RepDeborahRoss, and @RepKManning, the Democratic members of NC’s congressional delegation, in issuing a joint statement on the #redistricting ruling.\n\nThese unconstitutional maps must not stand.\n\nhttps://t.co/thh2mLdnrB","date":"Wed Jan 12 14:43:34 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Democracy thrives when voters choose their representatives &amp; withers when politicians choose their voters. I’m disappointed by today's decision to disenfranchise NC voters, but I’m hopeful for an appeal to the NC Supreme Court.\n\nThese unconstitutional maps must not stand.","date":"Tue Jan 11 23:27:20 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@Call_Me_Dutch Get well soon, Dutch!","date":"Tue Jan 11 15:36:45 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"#HumanTrafficking is a complex system that operates in the darkest shadows of society. That's why when we see something, we need to say something. \n\nOn #WearBlueDay, I pause to acknowledge the countless lives affected by these inhuman practices, &amp; show my support for survivors. https://t.co/BuExdchnYe","date":"Tue Jan 11 15:35:11 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"From 1917 to 1994, half of the bills that were successfully filibustered in the Senate were Civil Rights legislation.\n\nThat's the legacy of the filibuster.","date":"Tue Jan 11 14:51:42 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Out today: the first US quarter to ever feature a Black woman.  🪙 🙌🏾\n \nAs a leader in the civil rights movement, poet laureate, college professor, and actress, Maya Angelou's example of class, empowerment, and humility will continue to inspire Americans for centuries. https://t.co/FbIs4FhYh8","date":"Mon Jan 10 18:07:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Special thanks to the @CapitolPolice who guard our democracy, as well as our @CMPD officers and @NCSHP State Troopers who are currently mourning devastating losses.\n\nThank you for your sacrifices and your service.","date":"Mon Jan 10 17:13:42 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"@yenergy @MeckCounty Thanks for reaching out Yen. Let me ask my friends at @StarMedCare @NovantHealth @AtriumHealth if they can help.","date":"Mon Jan 10 16:59:21 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Get well soon, Alex!","date":"Sun Jan 09 23:53:55 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy 108th Founder’s Day to the men of Phi Beta Sigma Fraternity, Inc. 💙🤍\n\nWe extend love to brothers near and far, especially the Sigmas who serve in Congress. We’re especially missing our former colleagues Reps. John Lewis and Elijah Cummings today #Sigma108 https://t.co/DsUdyNZjw0","date":"Sun Jan 09 18:13:16 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Team Adams reports a very fast-moving line right now as well.\n\nGet your free rapid tests!","date":"Sat Jan 08 17:28:36 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"We still have a long way to go to recover from the pandemic. We still haven't regained all the jobs we lost since 2020.\n\nHowever, imagine where we would be without @HouseDemocrats and @POTUS working together to create 6.4 million jobs and #BuildBackBetter.","date":"Fri Jan 07 17:40:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"As the first Black “Best Actor” winner at the Academy Awards, he paved a path for future winners including Denzel Washington, Jamie Foxx, and Forest Whitaker. I am devastated by his loss, and my prayers are with his family and friends in the Bahamas, the US, and across the world.","date":"Fri Jan 07 15:37:10 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Sir Sidney Poitier opened doors for countless Black actors and artists. From “A Raisin in the Sun” to “Guess Who's Coming to Dinner” to Best Picture-winner “In the Heat of the Night,” Poitier was one of the first Hollywood actors to tackle issues of race head-on. https://t.co/LM1za434Gz","date":"Fri Jan 07 15:37:09 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"As we mark one year since the deadly assault on our Capitol, our Country and our Constitution, we must not allow anyone to rewrite history or whitewash the gravity of what took place.  #January6th\n\nhttps://t.co/K7ValeI9CZ","date":"Thu Jan 06 18:36:51 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Earlier today, President Biden told us \"the way forward is to recognize the truth and live by it.\" We must honor and tell the truth, even when it makes us uncomfortable. \n\nMy statement on the anniversary of #January6th: https://t.co/K7ValeI9CZ","date":"Thu Jan 06 17:15:23 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Let's go to the tape.\n\nSen. Graham after the attack on the Capitol on 1/6/21: “Trump and I, we’ve had a hell of a journey. I hate it to end this way... All I can say is a count me out. Enough is enough.”","date":"Thu Jan 06 14:51:13 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"I'll be speaking to @KaciONTV of @FOX46News immediately after President Biden's speech.\n\nPlease tune in as we remember the terrible events of the Capitol attack, and how we move forward.","date":"Thu Jan 06 14:35:51 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"There is so much to say about that terrible day when the Capitol was attacked, but I remain thankful that our 12th District staff wasn’t hurt, and that we came together after the attacks to do our job: certifying the election of President Biden and Vice President Harris.","date":"Thu Jan 06 14:05:30 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"From @FoxBusiness: Companies added 807,000 jobs last month, blowing past the 400,000-job gain that economists [had predicted] and the revised 505,000 positions added by companies in November. https://t.co/lk5afzCtT0","date":"Wed Jan 05 21:22:38 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"1950s &amp; 1960s: The filibuster was used to derail voting rights legislation.\n\n2020s: The filibuster IS being used used to derail voting rights legislation.\n\n#EndTheFilibuster","date":"Tue Jan 04 17:07:46 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"In case you missed it during the holidays: the Biden Administration has extended the pause on federal student loan repayment.\n\nDetails: https://t.co/uuzl7HC0Co https://t.co/hZAxBXJFPU","date":"Tue Jan 04 16:30:29 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy New Year from my family to yours, and best wishes for a prosperous, healthy 2022! https://t.co/70aPQLSX3o","date":"Sun Jan 02 03:40:39 +0000 2022","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, we are joining the entire community in paying our respects to fallen CMPD officer Mia Goodwin. Our condolences and prayers are with her family, friends, coworkers, and every member of the Charlotte community. https://t.co/FEofKvXxrY","date":"Wed Dec 29 15:03:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"My statement on the passing of Senator Harry Reid: https://t.co/AB50cSQVUW","date":"Wed Dec 29 04:08:03 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Saddened to hear of the passing of Archbishop Desmond Tutu. \n\nThe statement by @POTUS Joe Biden and @FLOTUS Jill Biden on the passing of Archbishop Tutu is below; I join them in celebrating his amazing life. https://t.co/8NgIeSVIEO","date":"Sun Dec 26 20:01:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Wishing you a happy first day of #Kwanzaa!\n \nToday's principle is #Umoja which translates to unity. When we unify together despite our differences, there is nothing we can't accomplish. https://t.co/CIqOHrJVDr","date":"Sun Dec 26 16:58:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Merry Christmas to all! https://t.co/byJiR3MVYz","date":"Sat Dec 25 12:57:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@Christine_CLT Fourth Ward","date":"Wed Dec 22 18:55:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Student loan borrowers deserve an extension (and cancellation). #CancelStudentDebt","date":"Wed Dec 22 17:25:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Save the Date! Our #NC12 State of the District Address will take place on Thursday, January 27. Sign up for updates here: https://t.co/25lcPYyWVz https://t.co/uvFNNtBLgf","date":"Wed Dec 22 16:19:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I am praying for Officer Goodwin's family, her coworkers, and the entire community mourning her loss.","date":"Wed Dec 22 15:35:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our friends at @MeckCounty are providing free #COVID19 test kits at libraries and other county buildings. If you need a FREE rapid test, there's no reason to wait. https://t.co/ZFCRrIDnI4","date":"Tue Dec 21 18:24:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"💉 Vaccines are safe, free, and effective. They keep our families and loved ones safe, and are essential for putting #COVID19 behind us. 🦠\n\nGet your shot at life:\nSearch https://t.co/uutXZUMAHU \nText your ZIP code to 438829 \nCall 1-800-232-0233","date":"Tue Dec 21 16:39:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Since January 2019, when House Democrats regained the Majority, we have been fighting For The People.  \n\nThis year, @HouseDemocrats passed landmark bills that address issues of concern to every American. https://t.co/hHj34OynoN","date":"Mon Dec 20 23:14:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The House should return to Washington to pass an extension of the Child Tax Credit tax cut, and the Senate should return to take up this legislation. Millions of families across the country are counting on us to act. #BuildBackBetter https://t.co/UU0quGRSD0","date":"Mon Dec 20 20:35:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@SydniElise_ Aggie Pride!","date":"Mon Dec 20 16:45:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Merry Christmas and Happy Holidays from my family to yours! https://t.co/KhMU5pPzBv","date":"Sun Dec 19 21:03:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, members of my district office participated in our yearly Adams Hunger Initiative day of action, delivering fresh, canned, and frozen food to University Park Creative Arts Elementary School’s growing food pantry for hungry students over winter break. https://t.co/y0zuP28jAg","date":"Fri Dec 17 17:13:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We're going to keep building a better @CLTAirport! I'm proud to announce that the Bipartisan Infrastructure Law includes over $200 million for our airport over the next five years. https://t.co/izjN9qdzeI","date":"Thu Dec 16 21:08:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Save the Date for HBCU STEAM Days of Action during the week of March 7, 2022.\n\nIt's never too early to start the conversation about the future of #HBCUs and strengthening the pipeline between HBCUs and the 21st Century workforce!\n\nSign up for updates here: https://t.co/IzVxGenXcs https://t.co/H7nvsaX1rF","date":"Thu Dec 16 17:34:55 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Without the #BuildBackBetter Act, NC families will lose the #ChildTaxCredit tax cut in 2022.\n\nWithout the #BuildBackBetter Act, NC families will lose the #ChildTaxCredit tax cut in 2022.\n\nWithout the #BuildBackBetter Act, NC families will lose the #ChildTaxCredit tax cut in 2022. https://t.co/IObDlelyMG","date":"Thu Dec 16 15:05:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We can't #BuildBackBetter without #HBCUs!","date":"Wed Dec 15 20:37:17 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The military justice reforms in the #FY22NDAA are the most significant since the creation of the Uniform Code of Military Justice.\n\nThis is a watershed moment for survivors &amp; a giant leap forward in ensuring transparency, independence &amp; accountability. \n\nhttps://t.co/5c8oErkKpu","date":"Wed Dec 15 20:15:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @rweingarten &amp; @AFTunion for supporting the EDUCATORS for America Act! #ChampionEDUCATORS","date":"Wed Dec 15 14:16:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"It’s time for a comprehensive national investment in our educators.\n\nThank you to all of the organizations supporting the EDUCATORS for America Act! #ChampionEducators\n\nhttps://t.co/JlDHeCKwBf","date":"Tue Dec 14 21:51:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"https://t.co/v6ZNgkEHnN","date":"Tue Dec 14 19:06:37 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The EDUCATORS for America Act is endorsed by dozens of education leaders and educator-led organizations, including @AASCU, @AACTE, @NothernIowa, @NASSP, and @AFTUnion.\n\nThank you to ALL of our supporting organizations that commit to #ChampionEDUCATORS https://t.co/daSxonvb9c","date":"Tue Dec 14 19:06:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"CMS Students: you have an important vote to cast! Please see below.","date":"Tue Dec 14 17:03:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The quality of the education our students receive is enhanced by prepared education professionals, including principals and guidance counselors.\n\nIf we want good schools and high-performing students, we must #ChampionEDUCATORS 🍎\nhttps://t.co/q6rBqg5aVO","date":"Tue Dec 14 15:43:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #BuildBackBetter Act will save lives.\n\nhttps://t.co/UQF5xRt3Xm","date":"Mon Dec 13 21:17:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’d also like to thank my colleagues, @RepMGS, @RepTerriSewell, @RepConorLamb, @RepSires, @RepTeresaLF, and @GuamCongressman for their early sponsorship. https://t.co/0bZwxGE7u6","date":"Fri Dec 10 18:52:29 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you, @RepCindyAxne, @RepJahanaHayes, and @RepRubenGallego for co-leading this with me in the House.\n\nThank you, @SenJackReed and @SenBobCasey for co-leading with us in the Senate.","date":"Fri Dec 10 18:45:29 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, my colleagues &amp; I introduced the EDUCATORS for America Act—Urgently-needed legislation that addresses teacher shortages worsened by the COVID-19 pandemic.\n\nEducators are struggling. We can no longer afford to neglect the educators pipeline. It’s time to #ChampionEDUCATORS https://t.co/KZw3Kek7Th","date":"Fri Dec 10 18:40:55 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@Clint_GrantNC @NCInsuranceDept @ncdhhs @JeffJacksonNC @WBTV_News @wsoctv @wcnc @SpecNews1CLT Clint, please DM me.","date":"Fri Dec 10 05:46:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Good boy!","date":"Thu Dec 09 20:55:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’ll have a grande, sugar-free hazelnut  skim milk latte and some good Union jobs to go! #1U","date":"Thu Dec 09 20:23:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @thebump for all you do to empower and educate Black parents!","date":"Thu Dec 09 18:39:43 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#BidenBoom","date":"Thu Dec 09 16:27:29 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The work of strengthening our democracy and democratic governments across the world is important if we want to continue to move in the direction of freedom, liberty, and justice. #SummitForDemocracy","date":"Thu Dec 09 12:34:04 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We strongly support the decision of the state Supreme Court to delay the 2022 Primary Election. The right to vote is the most fundamental right in a democracy, but this sacred right requires fair, free and just elections. https://t.co/inck4NxmvU https://t.co/PkFbjupmOM","date":"Wed Dec 08 23:50:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"It's time to pass H.R.4, the John R. Lewis Voting Rights Advancement Act of 2021. #GoodTrouble https://t.co/VUWExOqlYU","date":"Wed Dec 08 21:48:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud to have delivered $266M in #ChildTaxCredit tax cuts for over 100,000 North Carolina families.\n\nNow, it's time for us to pass the #BuildBackBetter Act and extend these tax cuts. https://t.co/3OJRZhdbcV","date":"Wed Dec 08 21:06:03 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the last day to apply for our spring internships!\n\nCheck out the job descriptions below and send in your application before the close of business today. Both opportunities are in our Washington, D.C. office.\n\nhttps://t.co/BSKQEDNLgq","date":"Wed Dec 08 16:21:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"From tonight’s @TheBlackCaucus vigil.\n\nJohn Lewis said, “The vote is precious. It is the most powerful non-violent tool we have in a democratic society, and we must use it.” Let’s pass the John R. Lewis Voting Rights Advancement Act and grant our people the power to be heard. https://t.co/zxdDtAsnxH","date":"Wed Dec 08 01:05:03 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"80 years ago today, our country was forever changed when 2,300 Americans perished in the attack on Pearl Harbor.\n\nWe remember the lives lost on December 7, 1941 and honor the valor and sacrifice of those who fought for our country in the years that followed. https://t.co/9S1VwgahdD","date":"Tue Dec 07 22:33:50 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"Thanks in large part to @VP Kamala Harris, the #BuildBackBetter Act also includes all eligible provisions of the Black Maternal Health Momnibus Act to address our country’s maternal health crisis.\"\n\nhttps://t.co/waTnpcKyGZ","date":"Tue Dec 07 16:40:12 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Passing the #BuildBackBetter Act will save lives.\n\nPassing the #BuildBackBetter Act will save lives.\n\nPassing the #BuildBackBetter Act will save lives.\n\nPassing the #BuildBackBetter Act will save lives.\n\nPassing the #BuildBackBetter Act will save lives.\n\nhttps://t.co/waTnpcKyGZ","date":"Tue Dec 07 16:06:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Evergreen Tweet. #BuildBackBetter","date":"Tue Dec 07 15:52:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happening now: join us for a @WhiteHouse Maternal Health Day of Action, including a special appearance from @unccharlotte's own Dr. Ann Newman. #BuildBackBetter https://t.co/IIO5Xd4Iis","date":"Tue Dec 07 15:50:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"6) 60,000 US women suffer pregnancy-related complications that are near fatal every year.\n\nWe can address the maternal health crisis by passing the #BuildBackBetter Act with its Momnibus provisions. https://t.co/8q8vVmStx0","date":"Tue Dec 07 15:27:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"5) 148,327 women in the United States contracted COVID-19 while pregnant. Pregnant women were at significantly higher risk for severe outcomes. #BuildBackBetter https://t.co/dEI480GSZd https://t.co/7MNHFnDz5Z","date":"Tue Dec 07 15:27:45 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"4) Up to 80% of health outcomes are driven by social determinants such as the conditions where people live, learn, work, and play. #BuildBackBetter https://t.co/8zETohq4ga","date":"Tue Dec 07 15:27:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"3) 45% of non-elderly adults —approximately 87\nmillion people — are inadequately insured. #BuildBackBetter https://t.co/JSUeGen4Sw","date":"Tue Dec 07 15:27:43 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"2) Over 60% of maternal deaths in the United States are preventable. #BuildBackBetter https://t.co/m6QPihinTO","date":"Tue Dec 07 15:27:42 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Honored to join today's Maternal Health Day of Action Summit with @VP Kamala Harris.\n\nThere are so many reasons why maternal health is a crisis in our country, and why we need to pass the #BuildBackBetter Act:\n\n1) 35% of counties in the US lack access to maternity care. https://t.co/ZFPnhnfTxE","date":"Tue Dec 07 15:27:41 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Don't forget @VP @KamalaHarris. She has always been a champion for the #Momnibus, and because of her work to make sure it's included in the bill, #BuildBackBetter will save lives.","date":"Wed Nov 17 18:37:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud to join @VP Kamala Harris and the @WhiteHouse for today's Black Maternal Health Day of Action Summit. #BuildBackBetter https://t.co/fMQTzPN0Pr","date":"Tue Dec 07 13:13:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@CLTgov @704Shop It'd look good in the office.","date":"Tue Dec 07 13:05:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you missed our children’s vaccination event this past weekend, @NovantHealth is hosting another public vaccination event on Saturday, December 11th from 9:00 AM-3:00 PM.\n\nYou can register through the links provided on the flyers. #StopTheSpread and get  #Vaccinated. https://t.co/OO8n3AvVbv","date":"Mon Dec 06 19:07:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Maternal health in the United States is in a crisis, but there's a lot we can do about it - including passing the #BuildBackBetter Act with its #Momnibus provisions.\n\nCheck out my interview with @SCClemons of @TheHill here:\n\nhttps://t.co/l6mlLz1Pqg","date":"Mon Dec 06 17:21:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"May his memory be a blessing. https://t.co/nE3Kek9Hzy","date":"Sun Dec 05 16:13:05 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"For some of our patients, the #COVID19 vaccine is only the second best part about today! https://t.co/uUcMEHPONH","date":"Sat Dec 04 15:51:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Vaccines are going great today! \n\nThere’s still time to get your shot at Winterfield Elementary in East Charlotte. We’ll be here until at least noon for adults, #COVID19 boosters, and pediatric shots. https://t.co/4FNBGqpC6S","date":"Sat Dec 04 15:40:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We’re here at Winterfield Elementary School until noon! Come get your shot and/or get your kids vaccinated against #COVID19. \n\nWalk-ins welcome! https://t.co/pNEVUCsvfg","date":"Sat Dec 04 14:41:54 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us today at Winterfield Elementary (3100 Winterfield Place, Charlotte, NC 28205) and get your shot! We’ll be here until 12 PM.\n\nWalk-ins welcome! https://t.co/65sOQHiNoS","date":"Sat Dec 04 13:26:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our NC Democratic delegation’s joint statement on today’s #redistricting ruling in Wake County Superior Court: https://t.co/P4tBzVcdhe","date":"Sat Dec 04 02:39:37 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On International Day of Persons with Disabilities, I agree with my colleague @SenDuckworth:\n\nDisability rights are human rights.","date":"Fri Dec 03 21:45:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In case you missed it, yesterday was an exciting day for Charlotte with @VP Kamala Harris and @SecretaryPete Buttigieg in town! #BuildBackBetter https://t.co/7j2MzgxfgB","date":"Fri Dec 03 19:04:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Please join us for a children's vaccination event tomorrow!\n\nChildren age 5 to 11 should sign up here: https://t.co/pu1VcXKf1e https://t.co/ZY6Z2T8eFI","date":"Fri Dec 03 14:58:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Don’t forget: intern applications are due next week! https://t.co/BSKQEDNLgq","date":"Fri Dec 03 13:57:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Islamophobia and racism have no place in Congress, or anywhere else in our Country. \n\n@RepBoebert has decided to conduct herself in a manner unbecoming of a Member of Congress. She doesn't need to be on the committees where serious lawmaking happens.","date":"Thu Dec 02 22:22:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Charlotte, it’s time to #BuildBackBetter with better roads, bridges, broadband, water systems, and transit. https://t.co/T7Xtg2mQWw","date":"Thu Dec 02 17:16:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks for coming to Charlotte @SecretaryPete! #BuildBackBetter https://t.co/Q4ImfVa4Rf","date":"Thu Dec 02 16:41:41 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Great to see some 100% Battery Electric Buses with @VP Kamala Harris and @SecretaryPete today. #BuildBackBetter https://t.co/zPcalZ9fgf","date":"Thu Dec 02 16:22:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Touring @CATSRideTransit with @VP, @SecretaryPete, @CLTMayor Vi Lyles &amp; @NC_Governor Roy Cooper today! #BuildBackBetter https://t.co/nWld8832ca","date":"Thu Dec 02 16:09:20 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Leaving Air Force 2 this morning with @SecretaryPete. #BuildBackBetter https://t.co/Vj3Q7gyfoy","date":"Thu Dec 02 15:54:53 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Good morning, Charlotte! https://t.co/5MZCyn0Owc","date":"Thu Dec 02 15:35:52 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I’m joining @VP Kamala Harris and @SecretaryPete to talk about how important the Infrastructure Investment and Jobs Act is for Charlotte - and the American people.\n\nLet’s work together to #BuildBackBetter from the pandemic. https://t.co/hd1K28XUvS","date":"Thu Dec 02 14:22:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Come intern in our office during the spring semester!\n\nhttps://t.co/30rzPMYVP9","date":"Wed Dec 01 23:32:54 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The first Black Maternal Health #Momnibus bill became law yesterday.\n\nThank you President Biden, @VP Harris, @SenDuckworth, @RepUnderwood and everyone who made this possible.\n\nNow, lets pass the #BuildBackBetter Act which includes key Momnibus provisions!\n\nhttps://t.co/x0qYiRzBce","date":"Wed Dec 01 16:31:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"It’s time to get your shot (or booster)! \n\nJoin us this Saturday for a Children’s Vaccination 💉 event with shots for children age 5+ (and adults) provided by @NovantHealth.\n\nLearn more: https://t.co/NKopbpfOEF https://t.co/h3P1dizes0","date":"Wed Dec 01 14:32:08 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today we remember Congresswoman Shirley Chisholm, one of my early inspirations. As she once said, \"If they don't give you a seat at the table, bring a folding chair.\"\n\nToday would have been her 97th Birthday. Rest in Power, Congresswoman. https://t.co/ZSnqJfe7jS","date":"Tue Nov 30 21:44:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Mandy Cohen is a tremendous asset to the State of North Carolina and I'm sad we're losing her. @SecMandyCohen, thank you for your leadership throughout the pandemic. https://t.co/mI7t8MnqmM","date":"Tue Nov 30 17:41:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to join my @BMHCaucus co-chair @RepUnderwood, @POTUS, and @VP at the @WhiteHouse as we get the first Black Maternal Health Momnibus bill signed into law.\n\nNow let’s pass the #BuildBackBetter Act with its Momnibus provisions. \n\nBlack mamas can’t wait! https://t.co/VhEynGYDHU","date":"Tue Nov 30 16:38:52 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In a few minutes, I'll join @POTUS Biden at the @WhiteHouse for the signing of the Protecting Moms Who Served Act. \n\nThe legislation is the first bill from the Black Maternal Health Momnibus to pass both houses of Congress and become law. \nhttps://t.co/US7iXXl5Bm","date":"Tue Nov 30 15:28:42 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The Biden Harris Administration’s bipartisan infrastructure bill will create jobs and improve mobility across the United States, including in Charlotte. I’m honored to host @VP Harris and @SecretaryPete as we work together to #BuildBackBetter from the pandemic.","date":"Tue Nov 30 00:25:45 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Whether you’re going North or South, our transportation network should connect you to opportunities.\n\nI voted for the Infrastructure Investment and Jobs Act because it will invest approximately $911 Million in North Carolina’s public transit systems. #BuildBackBetter https://t.co/K1TLaaOaoW","date":"Mon Nov 29 17:00:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":".@CATSRideTransit connects different modes of travel. From this light rail station, you can walk to a @Hornets game, grab a scooter, or take an express bus to Cornelius.\n\nBy investing in mobility infrastructure, we’re going to create jobs and new opportunities. #BuildBackBetter https://t.co/CdwUVehLR6","date":"Mon Nov 29 15:59:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Whether you call it Uptown, or you’re old enough to remember when it was called Downtown, it’s the center of our city.\n\nTransit is key to economic mobility and giving all of our neighbors the opportunity to succeed. That’s why we must invest in the future. #BuildBackBetter https://t.co/xsVWNITax0","date":"Mon Nov 29 15:29:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Remember, a mask 😷 is still required on all @CATSRideTransit services.\n\nHats are optional. 🎩🧢👒🎓 https://t.co/7BPhjfH9OH","date":"Mon Nov 29 15:17:19 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"You can ride all day on @CATSRideTransit for $6.60, students and seniors ride for less. The CityLynx Gold Line is currently free.\n\nHaving a mobility network that works for all of Charlotte and Mecklenburg County is important to me. That’s why we have to #BuildBackBetter. https://t.co/1ciJaRDtFu","date":"Mon Nov 29 15:10:52 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I love the new CityLynx Gold Line Streetcar stop at Johnson C. Smith University! \n\nThanks to the Infrastructure Investment &amp; Jobs Act, we’re going to be able to do a lot more to invest in the transit systems of the future. #BuildBackBetter https://t.co/xdYqltztTy","date":"Mon Nov 29 14:43:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Hanukkah sameach! May the glow of Menorah candles fill your home. \n\nWishing you and your loved ones a warm and wonderful Festival of Lights for all eight nights! #HappyHanukkah https://t.co/VMnnojAPqh","date":"Sun Nov 28 22:49:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Good morning, Charlotte! I’ll be on @MSNBC with @AliVelshi bright and early at 8 AM.","date":"Sun Nov 28 12:54:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"One of my neighborhood restaurants, Mama’s Caribbean Grill, will be serving the community free meals from 11 a.m. to 3 p.m. today on Thanksgiving Day.\n\nThey’re located at 1504 Central Ave. in Charlotte’s Plaza Midwood neighborhood if you need a bite to eat. #Thanksgiving2021","date":"Thu Nov 25 16:14:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy Thanksgiving! \n\nToday, we celebrate family, friends, and fellowship. I hope the beginning of your holiday season is full of love. https://t.co/bud5gT1Ekc","date":"Thu Nov 25 13:39:05 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Tomorrow Is the International Day for the Elimination of Violence Against Women. \n\nReports of domestic violence have increased during the pandemic, and an estimated 1 in 3 women will experience this crisis. \n\nThat’s why telling our stories is so important.","date":"Wed Nov 24 19:39:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I voted for the bipartisan Infrastructure Investment &amp; Jobs Act because it will help solve the supply chain crisis and lower the cost of goods for American families.\n\nThe next time a politician brings up inflation &amp; rising prices, ask them how they voted. #BuildBackBetter","date":"Tue Nov 23 16:12:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Last night, I was honored to join members of North Carolina’s Congressional delegation to serve a Thanksgiving dinner to our service members at Fort Bragg. Thank you @POTUS Joe Biden and @FLOTUS Dr. Jill Biden for joining us. https://t.co/ICN3Rgl9IL","date":"Tue Nov 23 14:13:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @JulieEiselt for your service to our city, especially in your role as Mayor Pro Tem and as chair of the Transportation Planning &amp; Environment Committee. Your leadership will be hard to match on future councils. #cltcc","date":"Mon Nov 22 13:50:45 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"“This bill is going to build futures and address the climate situation.” with @YasminV on @MSNBC #BuildBackBetter","date":"Sun Nov 21 21:25:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’ll be on @MSNBC this hour to talk about how the #BuildBackBetter Act saves lives, creates jobs, lowers the cost of healthcare, grows the middle class, invests in green jobs to stop climate change, caps insulin costs, cuts childcare costs, makes PreK universal, invests in #HBCUs","date":"Sun Nov 21 21:01:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’m sharing my domestic violence story so we can work towards a day when no one else has to.\n\n“He attempted to attack my son, and I got in the middle of it and got hurt myself. My jaw was dislocated, and I fell.”\n\nhttps://t.co/Q79YQSnfFO","date":"Sun Nov 21 19:35:41 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Welcome home, @CameronNewton! #KeepPounding https://t.co/v6YA7DdW08","date":"Sun Nov 21 18:10:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The skyrocketing cost of childcare is on the mind of many young parents.\n\nYesterday, @HouseDemocrats did something about it by drastically reducing childcare costs for working families. #BuildBackBetter","date":"Sat Nov 20 21:54:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today we recognize #TransDayOfRemembrance and remember the people, family, and friends we lost this year to transphobia and violence. https://t.co/0EFsxv7oIa","date":"Sat Nov 20 19:08:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I was always so inspired by her genuine courage. From our initial meeting, in spite of her illness and pain she always had a positive, comforting word. As we sat together in church one Sunday, I thought “she’s an angel whose faith is incredibly strong.”\n\nhttps://t.co/MRSXQIOxlQ","date":"Sat Nov 20 14:56:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Pass all three —&gt; Rejoice! 🙌🏾","date":"Fri Nov 19 18:56:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #BuildBackBetter Act includes a $555 billion investment in clean energy and climate. \n\nBBB will be the largest investment in clean energy in American history and will make enormous progress towards a cleaner, healthier future at a pivotal moment. #BuildBackSavesLives","date":"Fri Nov 19 15:38:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to join my partners from @TheBlackCaucus to #BuildBackBetter with historic investments in #HBCUs and #BlackMaternalHealth. https://t.co/N08qJB2CfF","date":"Fri Nov 19 15:06:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to have voted to pass the #BuildBackBetter Act this morning!\n\nhttps://t.co/EpxvaPFjOe https://t.co/ZktwOIMCN2","date":"Fri Nov 19 14:47:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #BuildBackBetter Act extends the Child Tax Credit tax cut, continuing to cut child poverty in half.\n\nOh, and it reduces the deficit and grows the economy. https://t.co/lxlSLcMDjb","date":"Fri Nov 19 13:15:52 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Check out all of the @BMHCaucus #Momnibus provisions in #BuildBackBetter. The BBB Act is a lifeline for moms.\n\n#BuildBackSavesLives https://t.co/5wXmp1UmuY","date":"Fri Nov 19 04:28:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Reply with one of your favorite parts of the #BuildBackBetter Act.\n\nI’ll start: because of provisions that cut the cost of childcare, reduce the cost of elder care, and guarantee universal Pre-K, parents and caregivers can go back to work without worrying about their family.","date":"Fri Nov 19 04:15:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #BuildBackBetter Act invests in 1890s Land-Grant #HBCUs to make sure we’re able to produce healthy, sustainable food in every community. https://t.co/9w8RGnJgkr","date":"Fri Nov 19 03:34:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’m on team #BuildBackBetter because it closes the Medicaid gap, which will bring health insurance to millions and save up to 7,000 lives every year.\n\n#BuildBackSavesLives https://t.co/ZSCATUWpwR","date":"Fri Nov 19 03:12:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #BuildBackBetter Act is the largest investment ever in ending the maternal mortality crisis and the Black maternal health crisis. This bill means healthy moms, healthy babies, and better outcomes for every new parent.\n\n#BuildBackSavesLives","date":"Fri Nov 19 03:02:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #BuildBackBetter Act caps insulin copays at $35 per month for Medicare beneficiaries.\n\n#BuildBackSavesLives","date":"Fri Nov 19 02:48:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We secured $10 billion for #HBCUs and #MSIs in the #BuildBackBetter Act.\n \nThat's the largest single investment in our schools ... ever.\n \nBuild Back Better is a victory for #HBCUs. Period.","date":"Fri Nov 19 00:16:37 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #BuildBackBetter Act will save lives by including Medicaid expansion and other important provisions of the #Momnibus that address our maternal health crisis. \n\nIt will reduce child hunger and poverty.\n\nWe can't wait for to Build Back Better! https://t.co/rr3Mynh6TG","date":"Thu Nov 18 19:53:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Immigration reform in the #BuildBackBetterAct would improve the lives of millions of undocumented immigrants while increasing tax revenue by billions of dollars. \n\nCongress must deliver for immigrant families by passing #ImmigrationReformNow. https://t.co/Tr0zKfteKs","date":"Thu Nov 18 19:48:31 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’m proud to support the #BuildBackBetterAct because this bill will save lives, including up to 7,000 lives every year by closing the Medicaid gap. #BuildBackSaveLives \n\nhttps://t.co/3byXrXRoBq https://t.co/2jnGlIOwlu","date":"Thu Nov 18 17:43:17 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"My subcommittee, Workforce Protections, can’t ensure a safe work environment for all Americans if we don’t address workplace harassment in our own House. Censure was the right vote today, regardless of your party.","date":"Wed Nov 17 21:15:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"tl;dr - If you harass or abuse a fellow legislator, you don’t belong in the people’s House. Period.","date":"Wed Nov 17 21:15:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Also, I want to extend my deepest admiration and appreciation to my colleague, @RepAOC. She’s been harassed and threatened by her coworkers: other Members of Congress. @AOC demonstrates admirable resolve and composure in the face of childish antics from her peers every day.","date":"Wed Nov 17 21:15:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I voted to censure Rep. Gosar. The US Congress is a workplace, and we are sent here to do the people’s work. Mr. Gosar’s actions would get him reprimanded and possibly terminated at any Fortune 500 company, so why should Congress be any different?","date":"Wed Nov 17 21:15:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"No one should experience harassment or threats in their workplace. After the attacks on January 6, which terrorized our Capitol Police, Congressional staff, and us Members as well, Rep. Gosar’s actions are even more unconscionable.","date":"Wed Nov 17 21:15:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Don't forget @VP @KamalaHarris. She has always been a champion for the #Momnibus, and because of her work to make sure it's included in the bill, #BuildBackBetter will save lives.","date":"Wed Nov 17 18:37:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy 110th Founder’s Day to the men of Omega Psi Phi Fraternity, Inc. - the first fraternity founded at an #HBCU!💜💛\n\nI extend love to brothers near and far, especially the Ques I serve with in Congress. #OmegaFoundersDay #OmegaPsiPhi https://t.co/ltJGiCZqPq","date":"Wed Nov 17 17:41:05 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I’m celebrating the passage of the Protecting Moms Who Served Act of 2021. \n\nThe legislation is the first bill from the Black Maternal Health #Momnibus to pass both houses of Congress and head to @POTUS Biden’s desk. https://t.co/iIdjFZf29x","date":"Tue Nov 16 22:41:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Earlier today, I spoke with @ReubenJones1 about my experience as a domestic violence survivor and my work to end the DV crisis. \n\nIn 2020, NC lost 91 people to intimate partner violence. We must do more to end DV, and that’s why I’ll always stand up and speak up for survivors. https://t.co/sIOlVbdozp","date":"Tue Nov 16 16:49:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The bipartisan Infrastructure Investment and Jobs Act is an investment in the future:\n\n🌉 New &amp; rebuilt roads &amp; bridges\n🚰 Clean drinking water\n🚝 Better public transit &amp; rail\n📶 High-speed broadband\n💰 Jobs to grow the middle class\n\n#BuildBackBetter","date":"Mon Nov 15 23:30:08 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Honored to join my @TheBlackCaucus colleagues today as we celebrate the passage of the infrastructure bill. #BuildBackBetter https://t.co/39wvsClRDI","date":"Mon Nov 15 22:56:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Honored to join President Biden, Vice President Harris, and many of my colleagues today as we celebrate the passage of the Infrastructure Investment and Jobs Act. #BuildBackBetter https://t.co/AnqtB3Onvl","date":"Mon Nov 15 22:08:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#BuildBackBetter","date":"Mon Nov 15 21:48:31 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In the US, more than 506,000 good jobs are directly and indirectly supported by #recycling. #AmericaRecyclesDay #RecyclingIsEssential https://t.co/CjETEBtSu3","date":"Mon Nov 15 19:23:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Speaking with @emma_withrow of @FOX46News this morning on topics ranging from my 4H issues (Healthcare, Housing, Hunger, and Higher Ed), to the return of @CameronNewton to Charlotte. https://t.co/yM7qzPsi7z","date":"Fri Nov 12 14:43:04 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I was honored to visit with scores of women and men who served our country at @Carrier Charlotte’s 3rd Annual #VeteransDay Luncheon. Thank you all for your service and your sacrifice. https://t.co/6bIhfc0WWM","date":"Thu Nov 11 20:00:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"To all of our Veterans: thank you for your service and your sacrifices in defense of our country. #VeteransDay https://t.co/ernHdeJEv9","date":"Thu Nov 11 14:00:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy 246th birthday to the United States Marine Corps! \n\nAs we observe #VeteransDay tomorrow, remember: \"Once a Marine, Always a Marine.\"\n\nPlease join me in honoring the Marines of @USMC. https://t.co/kUPhKwDhaZ","date":"Wed Nov 10 22:30:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you missed our Virtual Coffee on the Infrastructure Bill and the #BuildBackBetter agenda, you can watch the entire event on YouTube here: https://t.co/l4qZ4xgYSd","date":"Wed Nov 10 20:47:31 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The bipartisan infrastructure bill delivers big time for NC. Here's how it will help us #BuildBackBetter:\n\n🛣️$7.2B for roads\n🚇$911m for public transit\n🖥️$100m for broadband\n🌉$457m for bridges\n🚰$440m for clean water\n🚗$109m for EV charging stations\n🛫$460m for airports","date":"Wed Nov 10 18:49:19 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join me in my Space! https://t.co/oCrbmdHcGF","date":"Wed Nov 10 15:59:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We’ll be trying out Twitter Spaces for our Virtual Coffee as well. #BuildBackBetter https://t.co/oCrbmdHcGF","date":"Wed Nov 10 15:06:31 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Don’t forget to join us at 11 AM ET today as we talk infrastructure and the #BuildBackBetter agenda. \n\nRegister here: https://t.co/F22FkWL7on https://t.co/bPQxDJrSw9","date":"Wed Nov 10 13:30:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Don't forget to join us tomorrow as we talk infrastructure and #BuildBackBetter during our virtual coffee.\n\nRegister here: https://t.co/F22FkWL7on https://t.co/qnaPaY9jDQ","date":"Tue Nov 09 20:28:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#VeteransDay is this Thursday, and many national and local businesses are offering discounts for active-duty service members and Veterans.\n\nCheck it out: https://t.co/NUt98m9est","date":"Tue Nov 09 19:11:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Minority communities disproportionately suffer from a changing environment and increased natural disasters. #ClimateJustice must be a focal point of the conversations at this week’s #COP26 Climate Conference in Glasgow, and as we #BuildBackBetter at home. https://t.co/WDSnASkHub","date":"Tue Nov 09 18:04:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Please join us on Wednesday at 11 AM ET for our #BuildBackBetter Virtual Coffee ☕️! https://t.co/F22FkWL7on","date":"Tue Nov 09 12:43:31 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us on Wednesday as we talk about the importance of the Infrastructure Bill and passing the rest of the #BuildBackBetter agenda! https://t.co/VFH32oEii5","date":"Mon Nov 08 23:10:53 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"As an Art Professor, I know arts education is especially important for unlocking creativity in STEAM students. I will continue to work in Congress to give more students the opportunity to succeed in these fields. STEAM enriches the mind and opens the door to great careers. https://t.co/kZLj2pUwRz","date":"Mon Nov 08 21:50:47 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud to have supported our Bipartisan Infrastructure Bill and to have voted for this key piece of the #BuildBackBetter agenda.","date":"Mon Nov 08 20:22:21 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"From paid family leave and Universal Pre-K to investments in maternal health and higher education, the #BuildBackBetter Act is an investment in our families. Parents will save thousands of dollars per year on child care and receive an extension of the Child Tax Credit tax cut.","date":"Sat Nov 06 04:18:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I look forward to voting for final passage of the #BuildBackBetter Act, which will make robust investments in #HBCUs &amp; MSIs, expand the safety net for working families, and make a historic investment in fighting climate change.\n\nThe American people are counting on us to act NOW.","date":"Sat Nov 06 04:18:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The Bipartisan Infrastructure Framework invests in infrastructure and creates jobs.\n\nThese investments include improving and expanding the Charlotte Area Transportation System and Lynx Light Rail, and providing all CMS students with the broadband connection they need to succeed.","date":"Sat Nov 06 04:18:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Tonight, I voted to pass the Bipartisan Infrastructure Bill and advance the #BuildBackBetter Act. These votes will create jobs, improve our infrastructure, and set the stage for Democrats to make a solid investment in the future of our families and our recovery from COVID-19.","date":"Sat Nov 06 04:18:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"May the Festival of Lights inspire us to lift up our communities, live with hope instead of despair and stand up for what’s right! \n\n#HappyDiwali to everyone celebrating this week. https://t.co/J5lHLKQZeg","date":"Fri Nov 05 19:22:42 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today in 1968, Shirley Chisholm became the first Black woman elected to Congress.\n\nLike me, Rep. Chisholm was a career educator who served on the @EdLaborCmte.\n \nSince then, 50 more Black women brought their “folding chairs” to Congress. Thank you Shirley for opening the door. https://t.co/ZR5oDQqrAq","date":"Fri Nov 05 17:45:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm in. #BuildBackBetter","date":"Fri Nov 05 16:16:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Need help going through the process to #GetCovered? Don’t worry – free help is available at the https://t.co/U7NI6Bh4mu Call Center, 1-800-318-2596 https://t.co/Tvr6PZcTIN","date":"Fri Nov 05 14:32:54 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"531,000 jobs were added in October, and we just found out the last two months of job growth were better than we thought.\n\nThe United States has now added 5.5 million jobs since President Biden took office less than a year ago.\n\nBiden's economic plan is working. #BuildBackBetter","date":"Fri Nov 05 13:32:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"After almost two years of work, we've scored another victory against #COVID19 in the workplace.\n\nMake no mistake: today's new rules from the @WhiteHouse and @OSHA_DOL will save lives.\n\nhttps://t.co/Nrmezf7sQe","date":"Thu Nov 04 19:38:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Honored to join the dedication of the HBCU National Center yesterday.\n\nThe Center awards each participating college at least one $5,600 housing grant per semester, assists in placing their students in an internship and connects them with a local alumni mentor. #HBCUStrong https://t.co/rYQritmKBL","date":"Thu Nov 04 13:20:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Paid family and medical leave, including maternity leave, is a lifeline for parents in the workforce. That's why I'm proud to support keeping paid leave in the #BuildBackBetter Act. #PaidLeaveForAll https://t.co/X3gnBpbkjY","date":"Wed Nov 03 16:43:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Last night, I delivered remarks on President Biden's #BuildBackBetter agenda, which will be nothing short of transformational for Black America. https://t.co/rr3Mynh6TG","date":"Tue Nov 02 15:49:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #BuildBackBetter framework includes approximately $10 BILLION for #HBCUs and other minority-serving institutions. https://t.co/i1MHTo1Wlq","date":"Tue Nov 02 15:34:19 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is #ElectionDay for Cornelius, Davidson, Huntersville, Matthews, Mint Hill, and Pineville. Don’t forget to VOTE!\n\nPolls are open until 7:30 PM. For more info, visit https://t.co/T0k0EwGuAI\n\nRemember, Charlotte doesn't vote this year! #CLTCC Elections will be held in 2022. https://t.co/AmjtxPJAfK","date":"Tue Nov 02 12:12:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today begins the two-day Mexican celebration of fondly remembering beloved ancestors and honoring their legacies. \n\nHappy #DayOfTheDead and Feliz #DiaDeMuertos to all of our #CLT and Mecklenburg County neighbors! I am thinking of you as you celebrate the lives of your loved ones. https://t.co/8csPf4nWVK","date":"Mon Nov 01 21:22:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Abortion is essential health care. #SCOTUS #SB8","date":"Mon Nov 01 14:31:54 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Mecklenburg County, it's time to vote! \n\nDon't forget this year's town elections. You can vote today, tomorrow, or Tuesday (#ElectionDay).\n\nTown boards determine your property taxes, funding for first responders, zoning, local priorities, and so much more.\n\nDon't forget to vote! https://t.co/owT88V5Sin","date":"Fri Oct 29 14:50:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#NC12, early voting for Cornelius, Davidson, Huntersville, Matthews, Mint Hill, and Pineville is live now through Saturday.\n\nFor polling sites and times, visit https://t.co/T0k0EwGuAI\n\n#ElectionDay is Tuesday, November 2nd. \n\nRemember, Charlotte doesn't vote this year! https://t.co/tDRBm1FK4x","date":"Fri Oct 29 13:51:19 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@deelanier Dee, do you mind if we use your tweet in our October newsletter?","date":"Thu Oct 28 20:58:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks for the shout out!\n\nIf you're having passport problems, read our helpful FAQ and reach out to our office: https://t.co/nJb7dbz2c6","date":"Thu Oct 28 17:27:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"With the inclusion of the vast majority of our landmark @BMHCaucus #Momnibus legislation, the Biden-Harris Adminstration’s #BuildBackBetter framework makes historic investments in the health and care of moms, babies, and Black parents. https://t.co/cG9IkhmRIr","date":"Thu Oct 28 17:16:54 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We can't handle state-level issues but our office would be happy to connect you. Please DM me.","date":"Thu Oct 28 15:11:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"AJC just released its #AntisemitismReport, featuring the largest-ever surveys of American Jews and the general public on antisemitism in America. The report's findings are deeply disturbing. We must do more to fight rising antisemitism in America.\nhttps://t.co/OIfTihPMG9","date":"Wed Oct 27 20:54:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I’m standing with @RepBeatty as we share how @TheBlackCaucus members have made the #BuildBackBetter agenda even better. https://t.co/Es2iObqFrD","date":"Wed Oct 27 14:45:40 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today marks the third anniversary of the shooting at #TreeofLife Synagogue. \n\nTogether, we remember Joyce Fienberg, Richard Gottfried, Rose Mallinger, Jerry Rabinowitz, Cecil Rosenthal, David Rosenthal, Bernice Simon, Sylvan Simon, Melvin Wax, Daniel Stein, and Irving Younger. https://t.co/RyD4e13vqb","date":"Wed Oct 27 13:11:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, as both a survivor of domestic violence and your representative, I voted to reauthorize the Family Violence Prevention and Services Improvement Act.\n \nFVPSA supports survivors and their children, and helps local service providers prevent violence. #SupportSurvivors https://t.co/NiRKeZeAS7","date":"Tue Oct 26 20:38:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We must include critical maternal health equity investments like the #Momnibus in the final #BuildBackBetter reconciliation package.\n\nBlack parents - and their babies - can't wait. https://t.co/1luCB4rpv9","date":"Tue Oct 26 15:22:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In just one day in 2020, domestic violence programs couldn't meet 11,047 requests from survivors of domestic violence for shelter and/or supportive services. \n\nThis is unacceptable. Today I'm voting to #SupportSurvivors and stop domestic violence. https://t.co/qEx02xinCg","date":"Tue Oct 26 15:10:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the last day to turn in US Military Service Academy application materials to our office. \n\nApply: https://t.co/fQyyxb0FB8 https://t.co/RF8DBvKMqI","date":"Mon Oct 25 16:59:03 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"No surprise my @ncatsuaggies are the #1 #HBCU band ... and since I’m giving greetings to @BenedictEDU’s alumni association tonight and this is great news to carry with me! \n\nCongrats to the Benedict College Marching Tiger Band of Distinction!","date":"Fri Oct 22 17:51:55 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Students who are interested in an appointment from our office should act immediately. The deadline to apply is Monday, October 25th. https://t.co/8a9lKCzSD9","date":"Thu Oct 21 20:15:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Each year, our office nominates high school students from the district to be appointed to a military service academy. As we approach this year's deadline, I want to highlight some of our accomplished 2020 Nominees. https://t.co/lU9XNAJoSv","date":"Thu Oct 21 20:15:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is #LatinaEqualPayDay: the day that Latinas’ average pay catches up to what white men made LAST YEAR.\n\nHoy es #LatinaEqualPayDay: el día en cual el salario promedio de las Latinas se pone a la par con lo que hombres blancos hicieron EL AÑO PASADO.","date":"Thu Oct 21 20:11:37 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #BuildBackBetter Agenda will provide one of the biggest middle class tax cuts in history – paid for by making those at the top pay their fair share. And no one making under $400,000 will pay a penny more in taxes. https://t.co/GVVZhgIjfC","date":"Wed Oct 20 20:03:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Did you know: 20% of 12th District residents were born outside the US?\n\nImmigrants are essential — to our economy, and to our recovery from COVID-19.\n\nIt's past time we deliver real immigration reform, and #TheMomentIsNow. https://t.co/TVHZOeaNAr","date":"Wed Oct 20 16:02:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The Select Committee on the 1/6 Attack determined Steve Bannon \"has shown disregard for our institution, disregard for the rule of law, and an outright defiance toward complying with any request for information.\"\n\nI support their decision to hold him in contempt of Congress.","date":"Wed Oct 20 15:03:45 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our friends at Charlotte Water are working around the clock to fix the problem. Follow @CLTWater and @CLTgov for updates, and please take this boil advisory seriously if you’re in the affected area (see below). https://t.co/MUxNv8QAds","date":"Tue Oct 19 14:18:12 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Much of the City of Charlotte and Mecklenburg County are under a boil advisory for the next 36 hours. Here’s why: https://t.co/ByfGOGldSH","date":"Tue Oct 19 14:18:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@Bentnews Congrats to you and Brad!","date":"Tue Oct 19 12:15:05 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The Tar Heel State delegation has big shoes to fill. I wish @RepDavidEPrice the best in retirement, and thank him for both his friendship and his decades of service to our state. https://t.co/DJBid5sWXi","date":"Mon Oct 18 17:38:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"As the first Black Secretary of State and only the second Black O-10 in the Army, Colin Powell was a trailblazer for all Americans. My prayers are with his wife Alma, his family, and all of the soldiers who looked up to him as a leader and commander.","date":"Mon Oct 18 17:12:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"148 years ago, @BennettCollege was founded. I served 40 years as a professor of art at Bennett, and as an elected official, I continue to advocate for education and #HBCUs like Bennett. Happy Founders Day, Bennett College! https://t.co/N4DoemUg9h","date":"Mon Oct 18 00:47:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, during #NationalWildlifeRefugeWeek, I introduced the Public Safety and Wildlife Protection Act, which would prohibit interstate shipment of steel-jaw leghold and Conibear traps. https://t.co/SLafuuz7pn","date":"Fri Oct 15 18:23:40 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"Ensuring that girls can reach their full potential is not just a moral imperative, it is a strategic one as well.\" #DayOfTheGirl\n\nhttps://t.co/28ttwElsVP","date":"Fri Oct 15 15:52:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our deadline for US military service academy nominations is 9 days away. \n\nThis is a great opportunity to answer the call to serve your country and our community. \n\nThe application deadline is October 25.\n\nLearn more: https://t.co/pxlRl4wv4b https://t.co/XJHPHLhpNS","date":"Fri Oct 15 15:34:03 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On the final day of #HispanicHeritageMonth, we honor and celebrate Hispanic trailblazers who carved out opportunities for future generations, such as Olma Echeverri, former President of the Democratic Women and Hispanic Dems, who sadly passed away Sunday. #InspiringLocalFigures https://t.co/ZwPNccfajD","date":"Fri Oct 15 14:15:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm honored to nominate our best and brightest students to US military service academies. This is a great opportunity to answer the call to serve your country and our community. \n\nThe application deadline is October 25.\n\nhttps://t.co/F6qJR5khgY https://t.co/vf8hPw7kLs","date":"Thu Oct 14 20:22:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Nearly ONE IN THREE Americans experienced a weather disaster this summer.\n\nWe need #ClimateActionNow — which is why I'm fighting with @HouseDemocrats and @AppropsDems to invest in clean energy, American innovation, and resilient communities. https://t.co/qdOQtzTLCA","date":"Wed Oct 13 18:58:29 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy Birthday to the @USNavy! If you're interested in serving as a naval officer, don't forget to fill out your application for a nomination to one of our US Military Service Academies: https://t.co/F6qJR5khgY https://t.co/RKuDWs2pnj","date":"Wed Oct 13 18:48:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In 2021, Americans have already experienced:\n🌡 The hottest summer on record\n🔥 Monster wildfires and brutal heat waves\n🌨 Over $100 billion in damage from extreme weather events\nThat's why I'm fighting for #ClimateActionNow!","date":"Wed Oct 13 15:54:20 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm honored to nominate our best and brightest students to attend a United States military service academy. This is a great opportunity to answer the call to serve your country and our community. \n\nThe deadline to apply is Monday, October 25. https://t.co/F6qJR5khgY","date":"Tue Oct 12 17:23:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@CanaansDad1969 It hasn't gone through yet; you can also email our office here: https://t.co/mIDbc8hAZo","date":"Tue Oct 12 16:59:55 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@CanaansDad1969 Scott, I'm sorry to hear that. Please feel free to send me a DM so I can give you the best email to reach my team.","date":"Tue Oct 12 16:04:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I couldn’t have said it better than Chief Hoskin. #IndigenousPeoplesDay","date":"Mon Oct 11 12:58:41 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @RepHaleyStevens for yielding time to me today to ask critical questions about #HBCUs in our @EdLaborCmte hearing. Honored to count you as a colleague.","date":"Wed Oct 06 18:29:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’ll be speaking today at the @EdLaborCmte “Homecoming: The Historical Roots and Continued Contributions of HBCUs” subcommittee hearing as we work to #FullyFundHBCUs. https://t.co/3C8eieABYG","date":"Wed Oct 06 15:57:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Sharing this #WorldTeachersDay note from one of my favorite educators, ⁦@FLOTUS⁩ ⁦@DrBiden⁩. https://t.co/4jiI9j385i","date":"Tue Oct 05 17:22:05 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks for the invite, French! #HBCUStrong","date":"Mon Oct 04 21:32:43 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We’re here until 6PM at the Park Expo today to provide help with Emergency Rental Assistance (ERA) applications.\n\nWe’re also working with @StarMedCare to hold a vaccine clinic until 4 PM. https://t.co/nenVUyZC8T","date":"Fri Oct 01 16:01:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our Emergency Rental Assistance Application Pop-Up &amp; Vaccination Clinic is about to begin. It runs from 11:00 AM to 6:00 PM at the Park Expo and Conference Center in Charlotte. RAMP CLT staff will be on-site to assist constituents with emergency rental assistance applications. https://t.co/mRMiDNQNi4","date":"Fri Oct 01 14:47:40 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Folks are lining up for our Emergency Rental Assistance application event. We’ll be here at the Park Expo off Independence Blvd. in Charlotte until 6PM, so please come by if you need help from @DreamKeyOrg with your RAMP CLT application. #OneMeck https://t.co/KDP8judVEH","date":"Fri Oct 01 14:20:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you need help with Emergency Rental Assistance, don't forget to join us on Friday! https://t.co/I44ooCWXhB","date":"Thu Sep 30 00:41:05 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"97% of the USA's sovereign debt was incurred under previous administrations. \n\nStill, every @SenateGOP Republican voted to default.  \n\nDemocrats asked for an up-or-down vote to avoid default because the consequences of default would be catastrophic.\n\nMitch McConnell blocked it.","date":"Wed Sep 29 19:44:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Need help with rental assistance applications? \n\nPlease share the details about our emergency rental assistance application pop-up (&amp; #COVID19 Vaccination Clinic) on social media. \n\n#RAMPCLT staff from @DreamKeyOrg will be there to help.\n\nhttps://t.co/D79qUH2HeI https://t.co/xmT5UhqbvK","date":"Wed Sep 29 17:27:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I’m celebrating @POTUS Joe Biden’s historic nomination of Dena King to serve as US Attorney for the Western District of North Carolina. https://t.co/yTLZHkhi5R","date":"Wed Sep 29 13:04:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is #NationalVoterRegistrationDay! Registering to vote and updating your voter registration information are the first steps to making your voice heard in upcoming elections. Register to vote at https://t.co/UMvzh310me https://t.co/UAcILdN2ga","date":"Tue Sep 28 18:54:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Annually, there are more than 35 million unsafe abortions worldwide that lead to millions of injuries and tens of thousands of preventable maternal deaths. The Helms amendment exacerbates this crisis and needs to go. #RepealHelms https://t.co/yY1ikIzkHE","date":"Tue Sep 28 18:05:58 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Transformative legislation that invests in the American people and helps us #BuildBackBetter must invest in our strongest engines of upward mobility: our #HBCUs.\n\nHistorically Black Colleges and Universities are having a moment – the time is NOW for Congress to meet that moment.","date":"Tue Sep 28 17:01:08 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you want to learn more about what the @BMHCaucus and other Black maternal health organizations are up to, listen to today's episode of @TheTakeaway at 2:00 PM on @WFAE or wherever you listen to public radio. https://t.co/k43jm7ZLlm","date":"Tue Sep 28 16:33:04 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy Birthday @CLTMayor @ViLyles!","date":"Tue Sep 28 14:37:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"This is why the work of the @BMHCaucus is so important, and why we must pass the #Momnibus.","date":"Tue Sep 28 14:03:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Black women in the US are 3-4 times more likely to die in childbirth than white women.\n\nWhen you compare that with other countries, we’re further behind. A Black woman in America is 30-40 times more likely to die in childbirth than the average woman in Poland, Italy, or Norway.","date":"Tue Sep 28 13:46:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy #NationalVoterRegistrationDay!\n\nAre you registered?","date":"Tue Sep 28 12:52:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Taking the debt hostage and playing games with the full faith and credit of the United States is reckless, dangerous and unacceptable. Period.\n\nhttps://t.co/dWztytCdkM","date":"Mon Sep 27 17:35:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I got the first shot.\n\nI got the second shot.\n\nI got the booster.\n\nI still wear a mask.\n\nI do all of this not only because I want to be around to see my grandchildren grow up, but also so I'm less likely to spread #COVID19 to others.\n\nPlease get the shot. https://t.co/j4r0IlxAEO","date":"Mon Sep 27 15:00:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’m on now!","date":"Sat Sep 25 21:33:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’ll be joining @TheRevAl on @PoliticsNation at 5:30 PM this hour to talk about #HBCUs, my @akasorority1908 sisters, and the Haitian refugee crisis.","date":"Sat Sep 25 21:03:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you to @RepFrenchHill, @ChrisCoons, @SenatorTimScott, and the over 100 Congressional cosponsors of the IGNITE #HBCUExcellence Act! https://t.co/XrhOB7R8bU","date":"Fri Sep 24 20:15:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Protecting access to abortion care is about protecting the healthcare of Black women, girls, and parents. I’m voting to pass the #WHPA to stand up for the constitutional right to abortion access &amp; ensure that no more restrictive state laws can be passed. https://t.co/3fBkk3nb4Q","date":"Fri Sep 24 14:53:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Amen.","date":"Thu Sep 23 18:54:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"This year’s defense budget doubles down on investments in diversity and innovation that will make our country even more competitive. #FY22NDAA https://t.co/FtjK8pWuvk","date":"Wed Sep 22 17:56:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On #HispanicNursesDay, we take the time to honor and commend the more than 135,000 Hispanic nurses who are risking their lives on the front lines every day to keep our communities safe. \n  \n¡Mil gracias por su dedicación! https://t.co/3plSa9d6ld","date":"Wed Sep 22 16:04:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Working families count on the federal government to help provide the vital services they need, especially during emergencies. That’s why I am proud to support @HouseDemocrats’ bill to continue investments in housing, public education and child care. #ForThePeople https://t.co/Y0HfQV1VSM","date":"Tue Sep 21 20:03:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm thankful to @Franchising411 and many of its members for taking the @HBCUCaucus Partnership Challenge. \n\nIf your organization or business believes the power of partnerships with #HBCUs can transform futures, reach out to my office.\n\nhttps://t.co/M3S00dyqRI","date":"Tue Sep 21 18:31:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"https://t.co/Oln7wMZILv","date":"Tue Sep 21 13:13:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"Absent the right to access safe and legal abortion care, and the ability of 'the woman to retain the ultimate control over her destiny and her body,' women’s sports would not be the enormous success they are today.\"\n\nThanks to these elite athletes for their brief to #SCOTUS. https://t.co/K83WskhtSO","date":"Mon Sep 20 20:58:03 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"President Trump added nearly 8 trillion dollars to the national debt. If the U.S. defaults, it will harm every single American. @HouseDemocrats will work raise the debt ceiling and avoid causing irreparable harm to our recovering economy.","date":"Mon Sep 20 18:41:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"As chair of the Workforce Protections Subcommittee, I applaud the Biden Administration's commitment to addressing extreme heat on the job and at home. We must ensure our workplaces have safe and healthy conditions, and provide cooling assistance to families in their homes.","date":"Mon Sep 20 14:38:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"What I’m looking for in the #BuildBackBetter Act is educational equity in higher education. We can’t have that without investing in our #HBCUs and addressing their infrastructure needs. https://t.co/wZCAvwfDiv","date":"Thu Sep 16 19:17:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I cannot stress this enough: we can’t #BuildBackBetter without #HBCUs.","date":"Thu Sep 16 18:53:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I taught for three decades at an #HBCU before I finally got air conditioning in my classroom.\n\nWe’re sick and tired of being sick and tired. \n\nThe #BuildBackBetter act should keep @JoeBiden’s promise to invest in HBCU infrastructure.","date":"Thu Sep 16 18:22:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"300,000 #HBCU students and thousands of faculty and staff at Historically Black Colleges and Universities deserve the same opportunities as their counterparts at predominately white institutions. Let’s fix that in the #BuildBackBetter Act.","date":"Thu Sep 16 18:19:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"HBCUs have a unique history of overcoming systemic challenges and providing an unequalled return on investment.\n\nThe best way the #BuildBackBetter Act can invest in higher education is to invest in #HBCUs. https://t.co/XOGzSB8RYS","date":"Thu Sep 16 17:25:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#HBCUs have over $25 BILLION in deferred maintenance needs.\n\nIt’s a crisis caused by a history of structural racism, systematic neglect, and public policy.\n\nThe #BuildBackBetter Act MUST address this crisis, and Congress MUST pass the IGNITE #HBCUExcellence Act. https://t.co/UWqpygSC6R","date":"Thu Sep 16 16:45:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"President Biden ran on a platform that included a historic investment in #HBCUs. Congress must make sure that promise is kept in the #BuildBackBetter Act AND pass the IGNITE #HBCUExcellence Act.","date":"Thu Sep 16 16:30:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"It’s time to pass the IGNITE #HBCUExcellence Act and level the playing field for #HBCUs. We can’t leave Historically Black Colleges and Universities behind as we #BuildBackBetter. https://t.co/NQWu5VlhlL","date":"Thu Sep 16 16:01:19 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"46% of facilities on #HBCU Campuses need repair or replacement. We can’t #BuildBackBetter unless the final reconciliation package includes billions of dollars in dedicated funding to repair, replace, and enhance infrastructure at Historically Black Colleges and Universities.","date":"Thu Sep 16 15:49:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our @POTUS and @VP made a promise on the campaign trail to invest tens of billions of dollars in #HBCUs. Our #BuildBackBetter legislation in the House should reflect that.","date":"Thu Sep 16 15:15:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"L’shanah Tovah!\n\nWe hope that those observing #YomKippur have an easy and meaningful fast. https://t.co/kO6yvnh1cf","date":"Wed Sep 15 19:24:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We need to #BuildBackBetter, but in doing so we need to build our #HBCUs back better as well.","date":"Wed Sep 15 18:41:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is a giant step forward for Black Maternal Health.\n\n@FrankPallone &amp; @EnergyCommerce just approved #BuildBackBetter Act legislation that includes historic investments from @BMHCaucus' #Momnibus legislation! \n\nLearn more here: https://t.co/1UbMSRiH6B","date":"Wed Sep 15 18:16:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#HispanicHeritageMonth is an important moment for Americans to come together and recognize the rich contributions and influence Hispanics have made to the history, culture, and achievements of the United States. https://t.co/3ckKXv5Lrm","date":"Wed Sep 15 17:43:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":".@Arrival, @BASF, @Covanta, @TheCW, @HiltonHotels, @NetApp, @Walgreens, @AlaskaAir, and @AmericanAir are all coming together to support our #HBCUs. I applaud all our private partners for joining the @HBCUCaucus Partnership Challenge. https://t.co/bCcZGyKI9I","date":"Wed Sep 15 13:08:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud to welcome @AmericanAir to the @HBCUCaucus Partnership Challenge! #HBCUStrong https://t.co/u1gybLWpC2","date":"Tue Sep 14 20:14:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The people who make movie magic deserve a safe, fair workplace. Let’s pass the #PROAct. #1u","date":"Tue Sep 14 18:44:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Working together, #HBCUs, their students, industry, and Congress can:\n\n✔️ Create opportunity for students of color for generations\n\n✔️ Level the playing field and strengthen our economy\n\n✔️ work to advance diversity, equity, access, and inclusion for everyone.\n\n#HBCUStrong","date":"Tue Sep 14 16:51:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"High-quality infrastructure facilitates better instruction, improves student outcomes, and reduces dropout rates, among other benefits.\n\nThe time is now to correct historic injustices that created a $25 billion deferred maintenance backlog on #HBCU campuses. #HBCUStrong","date":"Tue Sep 14 16:15:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If Congress is going to invest trillions into our nation’s infrastructure, a portion of that must be dedicated to the institutions most concerned with uplifting those communities that are most underserved. #HBCUStrong #PowerOfPartnerships","date":"Tue Sep 14 16:13:40 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join now!\n\nClick here to join the HBCU Virtual Partnership Luncheon: https://t.co/TxqfbBziAT\n\n#HBCUStrong https://t.co/8sjLfxDRId","date":"Tue Sep 14 16:01:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join the @HBCUCaucus at Noon (in 30 minutes)!\n\nClick here to join the HBCU Virtual Partnership Luncheon: https://t.co/qE5sFzxmx3\n\n#HBCUStrong https://t.co/FeyWlXLzjg","date":"Tue Sep 14 15:34:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"This you @HouseAgGOP? Your members found creative ways to attend virtual meetings too, you know.\n\nMaybe if y’all had an actual plan to #BuildBackBetter you wouldn’t have to resort to these childish antics. https://t.co/byVp8jNA1Q","date":"Mon Sep 13 22:29:31 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Ending hunger in the United States is one of my most important priorities. Since 2016, I have championed the Closing the Meal Gap Act, which increases benefits by 30% and eliminates barriers for millions. I am proud to see much of that work realized today. https://t.co/658AfvGLn9","date":"Mon Sep 13 16:24:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"My statement on the 20th Anniversary of 9/11: https://t.co/vytbHGKySS","date":"Sat Sep 11 13:12:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Source: @thisisinsider https://t.co/EKjZ6KMzfP","date":"Fri Sep 10 15:49:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Not so long ago, folks opposed a seat belt mandate. Life-saving measures aren’t always popular, there may be opposition, but the right thing to do is the right thing to do.\n\nGet vaccinated for yourself and for others - it’s the only way we’re going to #BuildBackBetter together. https://t.co/C6I3Y4xTqA","date":"Fri Sep 10 15:49:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @AlaskaAir for joining the @HBCUCaucus Partnership Challenge! #HBCUStrong https://t.co/Jq822tAb3K","date":"Tue Sep 07 19:04:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Please get vaccinated. It's your shot at life, and our shot to thrive. #HBCUStrong https://t.co/m2DPdfqHyi","date":"Tue Sep 07 17:38:17 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"L'shana tova! Happy New Year! https://t.co/ElVLhfJRhZ","date":"Mon Sep 06 19:25:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On #LaborDay, we are reminded that American workers are the backbone of our country. \n\nI'm fighting to make sure every American has a safe workplace, essential benefits, and good-paying jobs that provide a better life for themselves and their families. #1u https://t.co/3iiy1sV7ui","date":"Mon Sep 06 12:00:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Unaffordable child care hurts our economy. Millions of women left the workforce during the pandemic due to the lack of child care options. We must learn from this—so our economy can recover—and make it easier for families to afford child care. #BuildBackBetter https://t.co/5hz7NIN0pc","date":"Fri Sep 03 16:54:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The Delta variant is still holding our economy back, but the economy still created 235,000 jobs this month. Despite the economic anxiety created by a pandemic of the unvaccinated, the economy still created jobs.\n\nImagine how fast we can #BuildBackBetter if we all get vaccinated.","date":"Fri Sep 03 14:49:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm about to join @onwurd to talk about 1890s #HBCUs. Listen live here: https://t.co/7xlgf55xx2","date":"Thu Sep 02 15:05:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I got my COVID booster and my flu shot yesterday. \nIf you haven't already, get your #COVID19 vaccine, get your flu shot, and make sure you're protecting yourself, our loved ones, and millions of unvaccinated children. https://t.co/j4r0IlxAEO","date":"Thu Sep 02 14:14:04 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"ICYMI, Texas' unconstitutional abortion ban, and the Supreme Court's failure to act, means women will be will be treated as second-class citizens by the court.","date":"Thu Sep 02 13:49:53 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Charlotte and Mecklenburg County lost more unvaccinated residents to the #COVID19 pandemic this week.\n\nIt doesn’t have to be like this. Get vaccinated today.","date":"Wed Sep 01 17:47:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We’ll be here at Lawyers Square in Mint Hill until 2, so come get your shot! https://t.co/71yED8tnK1","date":"Wed Sep 01 17:14:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"So happy to get my #COVID19 booster today that we’ve started dancing! https://t.co/YwsFb1MdNc","date":"Wed Sep 01 17:12:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Just got my #COVID19 booster shot! https://t.co/thW88nDauK","date":"Wed Sep 01 14:37:57 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"You can join us in Mint Hill now to get the #COVID19 vaccine!\n\nThe mobile vaccination clinic will be here at Lawyers Square Shopping Center until 2PM, 9229 Lawyers Rd, Mint Hill, NC 28227. https://t.co/QMeloq2On3","date":"Wed Sep 01 13:49:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Don’t forget: you can join us in Mint Hill today to get the #COVID19 vaccine.\n\nThe mobile vaccination clinic will be from 11am - 2 pm at Lawyers Square Shopping Center in Mint Hill, 9229 Lawyers Rd, Mint Hill, NC 28227.\n\nhttps://t.co/5rCc7idCse","date":"Wed Sep 01 12:15:21 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you haven't had a chance to get your vaccine yet, if you need a #COVID test, or if you're able to get your booster shot, please join us in Mint Hill tomorrow at 11 AM at the Lawyers Square Shopping Center. https://t.co/sa4oVVEnx4","date":"Tue Aug 31 18:43:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Honored to speak with the #NC10 conference at @JCSUniversity today. Great to see Golden Bulls, @ncatsuaggies, @BennettCollege Belles, and so many others today. https://t.co/vC1gXqu5sY","date":"Tue Aug 31 16:50:47 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"One of North Carolina’s most valuable assets is our 10 Historically Black Colleges and Universities. #HBCUStrong","date":"Tue Aug 31 16:17:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"1890s Land Grant Universities, like all #HBCUs, have opened doors of opportunity for millions of students. As a proud @ncatsuaggies graduate, I am honored to introduce this resolution celebrating the 131st anniversary of our dear universities. #HBCUStrong https://t.co/1KOlf6RXxZ","date":"Tue Aug 31 13:08:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Please join us to get your shot this Wednesday! https://t.co/Hepzprh0rB","date":"Mon Aug 30 23:53:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The climate crisis is at our doorstep and there’s no time to waste. That’s why @HouseDemocrats’ FY22 budget resolution makes the climate investments we need. #BuildBackBetter #ActOnClimate","date":"Fri Aug 27 17:45:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"With the passage of the FY22 budget resolution, @HouseDemocrats have a path to advance President Biden’s historic #BuildBackBetter agenda. This legislation is essential to making transformational, life-changing investments for America’s families. https://t.co/z6p5IOlWo8","date":"Fri Aug 27 17:30:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Democrats’ FY22 budget resolution will help us #BuildBackBetter by making targeted, visionary investments our economy needs to remain globally competitive. That’s a huge win for small businesses, workers, and America’s families. https://t.co/SkDxaNhTwo","date":"Fri Aug 27 17:10:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Democrats’ FY 2022 budget resolution will:\n\n✔️ Create good-paying jobs\n✔️ Cut taxes for hard-working Americans\n✔️ Lower costs for families\n\nThis is how we will #BuildBackBetter.","date":"Fri Aug 27 17:00:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"My heart breaks for our service members, the civilians, their families, and everyone hurt or killed by today’s terrorist attack in Kabul. I am praying for safety for everyone in Afghanistan ...","date":"Thu Aug 26 20:03:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"... and reiterating my call for the US government to continue this historic airlift until every member of our armed forces, every US citizen, every interpreter and support staffer, and every Afghan refugee has a chance to leave.","date":"Thu Aug 26 20:03:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"and reiterating my call for the US government to continue this historic airlift until every member of our armed forces, every US citizen, every interpreter and support staffer, and every Afghan refugee has a chance to leave.","date":"Thu Aug 26 20:02:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@CamenischJul Thank you for your reply. From the statement: \"I will continue to call on our government to welcome with open arms every woman and girl from Afghanistan who seeks equality under the law and freedom from tyranny.\"","date":"Thu Aug 26 17:27:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I will continue to fight for the American woman in the workplace, in the classroom, and any place where a decision is being made for her and about her, but without her. #WomensEqualityDay https://t.co/oeT5YaAyC7","date":"Thu Aug 26 16:22:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Because of #COVID19, unacceptable Black maternal mortality and morbidity rates are a crisis within a crisis.\n\nWe must continue the work of the @BMHCaucus, pass the #Momnibus, and make sure this life-saving legislation reaches President Biden's desk.\n\nhttps://t.co/iQUBc9dzsx","date":"Wed Aug 25 16:37:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"As North Carolina begins a new school year, it’s critical districts like @CharMeckSchools have the support they need to reopen and stay open safely to make up for lost time in the classroom. \n \nThanks to the #AmericanRescuePlan, we are helping schools rise to the challenge. https://t.co/uqq5W3up2V","date":"Wed Aug 25 15:46:47 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"ICYMI: I was proud to vote for the John R. Lewis Voting Rights Advancement Act last night. #HR4 #RestoreTheVote https://t.co/pbakpN3OJD","date":"Wed Aug 25 13:06:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy First Day of School to @CharMeckSchools and all of the students, teachers and staff!\n\nPlease be safe as you start your learning journey this year.","date":"Wed Aug 25 11:37:37 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our colleague and friend—Congressman John Lewis—fought and bled for voting rights; he led the charge for voting rights! We should honor him by passing the bill drafted in his name. #HR4 https://t.co/SaGOv5Adz8","date":"Tue Aug 24 22:20:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Due to the pandemic, hundreds of thousands of women have left the workforce. It’s one of the many reasons we need the #BuildBackBetter Act, which will create more jobs, cut middle- and working-class taxes, and extend the Biden Child Tax Credit.","date":"Tue Aug 24 20:21:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"As your Congresswoman, I’ve delivered policies that helped the economy create 4 million jobs and grow at the fastest rate in nearly 40 years! Now, it’s time to build on today's vote that forges ahead with our historic agenda to #BuildBackBetter!","date":"Tue Aug 24 20:18:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@jeffclau @MittRomney @BenSasse @sethmoulton Thanks for your message.  https://t.co/YeHFCzpe8x","date":"Mon Aug 23 21:13:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"ICYMI, below is my statement on the situation in Afghanistan: https://t.co/bx2JMKxyJM","date":"Mon Aug 23 21:13:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"As the proud graduate of an 1890 Land Grant #HBCU, I'm looking forward to listening to today's episode of the @HBCUCaucus Podcast on @ApplePodcasts. https://t.co/jcOnWMwxI0","date":"Fri Aug 20 17:42:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Capitol Police should be commended for ending yesterday's  situation peacefully. I am thankful they continue to work every day to protect our democracy from attacks by violent extremists. Our entire office is safe and continuing to work for Charlotte and #NC12.","date":"Fri Aug 20 14:10:57 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our country has an obligation to the people of #Afghanistan. Afghans fleeing the Taliban due to fear of persecution should have a home here in the US if they so choose. \n\nI, for one, will lift my lamp beside the golden door. https://t.co/NKeRjjaGnR","date":"Thu Aug 19 16:56:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Tornado watch in effect for Charlotte until 2 AM. Be careful out there; if at any point the watch becomes a tornado warning, please seek safe shelter immediately.\n\nAnd in case you’re wondering about the difference ...","date":"Tue Aug 17 22:29:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Congress has the power and the duty to act and restore protections against racial discrimination in voting. That’s why I’m proud to be co-sponsoring #HR4, the John R. Lewis Voting Rights Advancement Act. It’s time to #RestoreTheVote. https://t.co/MHT0b09QOS","date":"Tue Aug 17 21:15:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In many cases, vaccination can help you prevent cancer. \nThe #hepB vaccine can prevent many cases of #LiverCancer and the #HPV vaccine can protect against the virus that can cause #CervicalCancer and at least 5 other types of cancer. \n#NationalImmunizationAwarenessMonth https://t.co/8gG0VTFVJ5","date":"Thu Aug 12 17:06:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Ever wanted to intern on Capitol Hill? Apply today! https://t.co/eK8vzNG1fm","date":"Wed Aug 11 15:55:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you missed our TeleTown Hall last night, here are some good answers to frequently asked questions: https://t.co/IEeJbksXQa","date":"Wed Aug 11 14:22:20 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’ll be on @FOX46News at 7:35 AM this morning to talk about the infrastructure bill that just passed the Senate.\n\nYou can watch live here: https://t.co/4ig8fDPPC5","date":"Wed Aug 11 11:21:58 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Don't forget: join us at 7:00 PM tonight for our TeleTown Hall on the Pandemic Housing Crisis.\n\nYou can join the call by calling (855) 756-7520 Ext. 75247# at 7:00 PM ET. The call is toll free and open to the public. We will take your questions live!\n\nhttps://t.co/eSIyNgRmhz","date":"Tue Aug 10 19:19:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Are you facing eviction or foreclosure?\n\nDon't forget to join us at 7:00 PM tonight for our TeleTown Hall on the #COVID19 Housing Crisis.\n\nYou can join the call by calling (855) 756-7520 Ext. 75247# at 7:00 PM ET. The call is toll free and open to the public. #NC12 https://t.co/Mm5q0uctC3","date":"Tue Aug 10 15:10:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Human behavior has altered the climate of this planet for centuries. Now we have the knowledge and technology to mitigate the damage, but we’re running out of time. Congress must #ActOnClimate now, before it’s too late. https://t.co/E5FpUeeyrH","date":"Mon Aug 09 21:01:29 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you to everyone standing up for #Equality in Charlotte today. https://t.co/A5Q7TgG818","date":"Mon Aug 09 20:22:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Student debt is holding back millions of Americans from financial security and growing our post-pandemic economy.","date":"Mon Aug 09 17:04:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join me at 1 PM ET today for an on the record conversation with @qcitymetro. Tune in here: https://t.co/x4HEkgNGaa","date":"Mon Aug 09 16:20:58 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Yesterday I worshipped with the congregations of St. Paul Baptist Church and New Hope MBC and spread the word about housing resources that are available to our community.\n\n“Whatever you did for one of the least of these brothers and sisters of mine, you did for me.” Matt 25:40 https://t.co/LcHYtBRk9J","date":"Mon Aug 09 14:16:03 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Prayers for the wounded, their families, and those who are gone but not forgotten. #PurpleHeartDay","date":"Sat Aug 07 19:29:20 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Aggies make history. #AggiePride","date":"Sat Aug 07 19:25:47 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On Monday, I'm taking your questions with @GlennBurkins from @QCityMetro. We'll go live at 1 PM! https://t.co/x4HEkgNGaa","date":"Fri Aug 06 20:26:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I couldn't agree more. It's time for Equality for our #LGBTQ siblings at the local, state, and federal level. #CLTCC","date":"Fri Aug 06 19:39:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks for the compliment... there’s a lot more where that came from! https://t.co/CxBZgcAfwb","date":"Fri Aug 06 16:13:05 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#BuildingBackBetter https://t.co/7EeatM0MaI","date":"Fri Aug 06 14:29:26 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"“Your vote matters. If it didn’t, why would some people keep trying to take it away.” ― Representative John Lewis\n\n56 years ago today, President Lyndon B. Johnson signed the #VotingRightsAct to remind us of our democracy’s fundamental promise. https://t.co/CBHdnmLftI","date":"Fri Aug 06 14:05:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"My office will host a TeleTown Hall at 7:00 PM on Tuesday to connect you with programs that can provide help and support during the pandemic housing crisis.\n \nJoin the call by calling (855) 756-7520 Ext. 75247# at 7:00 PM on Tuesday. The call is toll free, questions welcome! https://t.co/v3DGOQmKzM","date":"Thu Aug 05 20:20:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’m praying for his family and the millions of union members mourning his loss.","date":"Thu Aug 05 17:05:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"As a lifetime supporter of labor and the right to organize, I am deeply saddened by the passing of AFL-CIO President Richard Trumka. He made workplaces safer and more inclusive, and fought tirelessly for the health and dignity of workers and their families.","date":"Thu Aug 05 17:05:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I'm proud to join @RepDavidTrone and @RepMarieNewman in introducing the Emergency Child &amp; Adult Nutrition Assistance Act of 2021.\n\nWe must make sure nutrition assistance isn't left behind during the #COVID19 pandemic.\n\nhttps://t.co/hksvScFqXE https://t.co/okP0f1q1ep","date":"Wed Aug 04 17:15:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Currently, the eviction moratorium applies to every NC county except Bertie, Hertford, Hyde, and Warren. Check your county here: https://t.co/7DKhxNE7Us https://t.co/Zv8KBPa3n2","date":"Wed Aug 04 15:26:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Read more to learn if you are protected under the new eviction ban. Currently, all #NC12 residents (Mecklenburg County) are covered, as well as North Carolinians in 96 of our 100 counties. https://t.co/DyS17wAfjY","date":"Wed Aug 04 15:19:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Shooting hoops in Hidden Valley during #NationalNightOut. Still got it! https://t.co/kEmw18Unip","date":"Tue Aug 03 22:41:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"┏┓\n┃┃╱╲ \n┃╱╱╲╲ in this\n╱╱╭╮╲╲  house\n▔▏┗┛▕▔          we\n╱▔▔▔▔▔▔▔▔▔▔╲\n       don't evict families \n╱╱┏┳┓╭╮┏┳┓ ╲╲\n▔▏┗┻┛┃┃┗┻┛▕▔\n    #ExtendTheMoratorium","date":"Tue Aug 03 18:46:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"580,000+ people are experiencing homelessness in the U.S.\n\nAs children go back to school this month, we can't put more families on the street. Whether at the local, state, or federal level we must #ExtendTheMoratorium to prevent the #EvictionEmergency. https://t.co/bh2TvGwTPj","date":"Tue Aug 03 18:45:21 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud to introduce the #BlackWomensEqualPay Day Resolution with @SenatorWarnock and over 70 of my House colleagues today.\n\nBlack women shouldn't have to settle for 63 cents on the dollar in wages, today or any other day.\n\nhttps://t.co/nc1m90yctw","date":"Tue Aug 03 17:29:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We don’t celebrate #BlackWomensEqualPay Day, but we do highlight it to make sure we close the gap and level the playing field for Black women.\n\nWe can’t settle for 63 cents on the dollar. Proud to be joined by my dear friend @SenatorWarnock to introduce legislation today. https://t.co/WZ7yE4G5kv","date":"Tue Aug 03 14:51:20 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is Black Women's #EqualPay Day. Lower wages rob us of an equal life: the ability to pay for education, for health insurance, for food, and for housing. My family lived this struggle, so I know how important it is to close the wage gap. https://t.co/rOqXqRbBeb","date":"Tue Aug 03 13:16:50 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Sometimes #TeamUSA gives it their all and we still come up short, but I couldn't be prouder of Megan Rapinoe and all of our amazing #USWNT soccer players.\n\nThank you for continuing to inspire women and girls around the world. #Olympics https://t.co/NapFUTvO4z","date":"Mon Aug 02 18:14:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Below is information about the Dispute Settlement Program for Charlotte and Mecklenburg County. Call the Landlord Tenant Line at 704.336.5330 for more information.\n\nYou can find this information and more at out #NC12 Housing Resources page: https://t.co/go58WBNJo1 https://t.co/deVS10jwfg","date":"Mon Aug 02 15:41:58 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I am disappointed the House did not consider the Protecting Renters from Evictions Act of 2021 before the eviction moratorium expired.\n\nIt is clear to me – and anyone paying attention - that the #COVID19 Pandemic is about to create a housing crisis. https://t.co/bh2TvGwTPj","date":"Mon Aug 02 14:44:52 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Charlotte’s own Anna Cockrell just finished second in the last women’s 400m hurdles semifinal heat at the #Olympics, which means she’s in the final! \n\nGo Anna and go #TeamUSA!","date":"Mon Aug 02 12:05:54 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We updated the housing resources page on our website. In addition to voting for federal relief to renters, landlords, and homeowners, I’ve been working with our community stakeholders to provide critical resources to anyone facing foreclosure or eviction: https://t.co/go58WBNJo1","date":"Sun Aug 01 18:10:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I am deeply disappointed with last night’s objection to extending the COVID-19 eviction moratorium. No children should be evicted the month they’re supposed to go back to school. https://t.co/bh2TvGwTPj","date":"Sat Jul 31 13:59:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I am deeply disappointed in House and Senate Republicans blocking relief for our most vulnerable citizens. We must now look locally to extend the eviction moratorium. My remarks: https://t.co/cRyJUnkD1k","date":"Sat Jul 31 02:09:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Watching Charlotte’s own Anna Cockrell in the women’s 400m hurdles! Go #TeamUSA #Olympics","date":"Sat Jul 31 00:03:26 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Here are the #HBCUs with flags traveling to space:\n\n@CAU\n@Morehouse\n@SpelmanCollege\n@aamuedu\n@TuskegeeUniv\n@FAMU_1887\n@HowardU\n@MorganStateU\n@ncatsuaggies\n@PVAMU \n@SouthernU_BR\n@SCSTATE1896\n@TSUedu","date":"Fri Jul 30 18:28:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Godspeed to the flags of our #HBCUs departing for space within the hour. Yet another example of how our students and our institutions are #HBCUStrong. https://t.co/66w0rg3r8C","date":"Fri Jul 30 18:28:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Yesterday, we passed Appropriations legislation that included robust funding for federal programs to reduce maternal mortality, morbidity, &amp; disparities. Read more from my office and my @BMHCaucus Co-Chair @RepUnderwood about these critical investments! https://t.co/DhEBtrTTRl","date":"Fri Jul 30 14:14:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"With a resurgent pandemic, we can’t put millions of our neighbors and their children out on the street (including an estimated 200,000 NC families).\n\nI’m proud to cosponsor the Protecting Renters from Evictions Act of 2021, and I will vote to extend the eviction moratorium.","date":"Fri Jul 30 12:51:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud to cosponsor the Protecting Renters from Evictions Act of 2021. With an estimated 6 million Americans behind on rent, now is not the time to throw families and children out on the street. https://t.co/Y6tEXWJDYc","date":"Thu Jul 29 23:26:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our own Diamond Weekes is a rising junior, Sociology major/Legal Comms minor at @HowardU. She is a current Summer Congressional Intern with the Congressional Black Caucus Foundation, and her interests include public policy, law, and being a voice for others! #NationalInternDay https://t.co/OLFHKeFOxD","date":"Thu Jul 29 21:34:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The House is going to consider legislation to extend the CDC moratorium on residential evictions.\n\nI am proud to be a cosponsor of this legislation, and I intend to vote for it. 28,000 Mecklenburg County households still need help - we can’t kick them out as COVID surges.","date":"Thu Jul 29 20:24:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Every American deserves to live in a place that is safe from hazards like lead paint &amp; radon. That’s why I’m supporting a @HouseDemocrats bill today that invests in capital maintenance of public housing. #ForThePeople https://t.co/kG1ESdl7yj","date":"Thu Jul 29 17:47:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#12YearChallenge The last time Congress increased the federal minimum wage, I was a North Carolina state representative who had just passed an increase in our state minimum wage.\n\nI also had fewer hats. \n\nNeedless to say, 12 years is too long. It's time to #RaiseTheWage! https://t.co/yNMxj8G8ct","date":"Wed Jul 28 14:44:58 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@madysonkamille Congrats!","date":"Wed Jul 28 13:58:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#SimoneBiles is one of the strongest people I know of. Go #TeamUSA.","date":"Wed Jul 28 13:57:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In case you missed it, here's video from my appearance on @cspan's Washington Journal this morning. Thanks @gretabrawner for having me on. https://t.co/I3fABSmoKs","date":"Wed Jul 28 13:49:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'll see you shortly!","date":"Wed Jul 28 12:04:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today’s meeting of the Bipartisan January 6th Select Committee gave voice to the heroes who defended the United States Capitol from a violent, deadly attack earlier this year. My heart goes out to the four brave officers who testified today. #January6th https://t.co/WhcLCqIRYx","date":"Tue Jul 27 19:34:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Last night I spoke about the urgent need to continue our work on voting rights. While we have made amazing strides over the past century, the promise of one person, one vote continues to be abridged by state legislatures across the country. https://t.co/3IDlr46ky5","date":"Tue Jul 27 15:00:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@HBCUFoundation JCSU and NC A&amp;T. #HBCUStrong","date":"Mon Jul 26 20:14:12 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#January6th was not only an attack on Congress, but also on our American democracy. \n\nIt was an attack on our core values, and our Constitution.\n\nIt is imperative that we find the truth of that day and ensure that such an assault on our Capitol and Democracy cannot again happen. https://t.co/RdnqRoOgRl","date":"Mon Jul 26 14:57:03 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to celebrate all of our North Carolina members of @TeamUSA representing us at the Tokyo #Olympics! https://t.co/CDvAOUGdbR","date":"Mon Jul 26 14:05:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"Adams, the founder and co-chair of the bipartisan Congressional HBCU Caucus, as well as a professor for four decades at Bennett College, released a statement applauding the accreditation of @BennettCollege.\" #HBCUStrong https://t.co/PAwppopGsO","date":"Sat Jul 24 15:42:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The @HBCUCaucus Podcast is now available on @ApplePodcasts! Check out our first two episodes today. #HBCUStrong https://t.co/B2DJvlEFmb","date":"Fri Jul 23 18:07:31 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"It's been 12 years since the last time the #MinimumWage increased.\n\nIn honor of the #Olympics, here's how young (and talented) @Simone_Biles was then. #12yearchallenge\n\nhttps://t.co/NPH450zJBq","date":"Fri Jul 23 15:21:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Strong.\nResilient.\nDetermined.\n\n@HouseDemocrats proudly support #TeamUSA at the #Olympics, and over the next two weeks I'll be proudly supporting and highlighting our #NC12 and North Carolina Olympians! 🇺🇸","date":"Fri Jul 23 13:11:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"My legislation, the #STARAct, is essential legislation for placemaking along transit corridors. Thank you to everyone who supported this legislation to promote culture and keep our public spaces beautiful.","date":"Fri Jul 23 13:00:43 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Passing the ALLIES Act is an urgent step to help Afghans and their families escape violence. I'm proud to vote for this bipartisan legislation to save innocent lives and repay our debt for the sacrifice of those who stood with our troops in Afghanistan.\n\nhttps://t.co/bfxHjz4bma","date":"Thu Jul 22 17:31:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"ICYMI: \"U.S. Rep. Alma Adams is calling on local officials to halt evictions in Mecklenburg County as federal protections are set to expire, according to a letter she shared with @Axios.\" https://t.co/mVK2qkG42o","date":"Thu Jul 22 16:21:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Putting Reps. Jordan &amp; Banks on the 1/6 Committee is like giving Al Capone an office next to Elliot Ness. \n\nThis committee is about patriotism and the truth, and Speaker Pelosi made the right decision in the pursuit of both.","date":"Wed Jul 21 20:44:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"We hope leaders in Congress will move swiftly to ensure the passage of this critical legislation, and we look forward to playing our part to bring the promise of IGNITE #HBCUExcellence into reality.\"\n\n- @WellsFargo CEO Charlie Scharf, @UNCF &amp; @tmcf_hbcu https://t.co/Bdbq0EBm28","date":"Wed Jul 21 18:49:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@StephanieRade18 @Cleavon_MD @BMHCaucus Thanks for asking. Here's more information about my bill in the @BMHCaucus #Momnibus, the Kira Johnson Act, named in honor of @4kira4moms. https://t.co/c0bppagHuC","date":"Wed Jul 21 17:37:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In Case You Missed it: @HuntersvilleGOV was shorted millions in American Rescue Plan money. @NatashaMarcusNC and I sent a letter to #NCGA leadership asking them to honor @NC_Governor Roy Cooper's request to increase Huntersville's funding. https://t.co/hM2XULeUo0 via @YouTube","date":"Wed Jul 21 17:14:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"2.2. million US women live in maternity care deserts. This is one of the many reasons our work with the @BMHCaucus is so important. #BumpDay https://t.co/GFJmyAt8kk","date":"Wed Jul 21 16:58:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"This week marks #200Days of this Congress and 200 days of House Democrats delivering #ForThePeople. \n\nDemocrats have taken decisive action to: \n🩹 crush the coronavirus \n💵 defeat the economic crisis\n🚨 pass the American Rescue Plan https://t.co/1ZqOB0ADpr","date":"Wed Jul 21 16:47:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Shelter is a fundamental human right. After speaking with our non-profit organizations on the front lines of Charlotte and Mecklenburg County's housing crisis, I'm asking our courts for another month to protect our most at-risk families.  https://t.co/mVK2qkG42o","date":"Wed Jul 21 15:54:29 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We've never faced a challenge as great as the public health emergency and economic devastation caused by the pandemic. Unfortunately, @HuntersvilleGOV was shortchanged during the recovery. The #NCGA should make sure Huntersville gets equitable funding.\n\nhttps://t.co/5j8gy5aQ5b","date":"Tue Jul 20 21:27:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Need help getting the #ChildTaxCredit? This Saturday, July 24th from 9am to 6pm at the Charlotte Taxpayer Assistance Center, Charlotte's taxpayer advocate is here to help:\n\nhttps://t.co/zPZ9YarmLi","date":"Tue Jul 20 14:32:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Eid Mubarak! #EidAlAdha","date":"Mon Jul 19 22:44:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"ICYMI: The first episode of the @HBCUCaucus Podcast is now on @Spotify!\n\nThanks to our #HBCUStrong guests from @BennettCollege &amp; @JCSUniversity. https://t.co/z43v8WoLZY","date":"Mon Jul 19 18:42:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Earlier this year, I introduced a bill to make \"housing, health care, education, and nutrition\" Constitutional rights.\n\nAs hundreds of thousands of Americans face eviction on August 1, it's even more important we recognize shelter as a fundamental right. https://t.co/DKoJ4VWTR2","date":"Mon Jul 19 16:16:42 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Remembering John Lewis today. https://t.co/RaGj7AThXR","date":"Sat Jul 17 19:53:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Far-right judicial appointees aren’t interested in justice, they’re interested in “just us” - excluding and demagoguing everyone else.\n\nDreamers are already home - right here in the United States of America.","date":"Sat Jul 17 02:38:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Parents, this year the expanded Biden #ChildTaxCredit will put MORE money in your pocket.\n\nGo to https://t.co/WOOfjYsZz9 to find out more.","date":"Fri Jul 16 17:24:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Education Matters ep. 181 Highlight: U.S. Rep. Alma Adams https://t.co/oEa8BspruN via @YouTube","date":"Fri Jul 16 14:02:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’m listening to Episode 1 of the @HBCUCaucus Podcast with #HBCU Presidents @BennettPres_SEW from @BennettCollege and Clay Armbrister from @JCSUniversity.  https://t.co/BZjf0Oycp9","date":"Fri Jul 16 12:57:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"DID YOU KNOW: Low-income families with children are eligible for the #ChildTaxCredit – including those who have not made enough money to be required to file taxes. Learn more: https://t.co/WOOfjYsZz9 https://t.co/3Hd1OjMzr8","date":"Thu Jul 15 15:28:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you woke up to your #ChildTaxCredit in your bank account, please let me know!","date":"Thu Jul 15 13:35:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks for your question. The Trump Administration's high tariffs on Canadian lumber drove prices higher. Supply chain disruptions due to the pandemic compounded the problem and drove prices even higher.\n\nNot the right approach to take during a housing affordability crisis.","date":"Wed Jul 14 18:05:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @SecCardona for joining us in Charlotte this week as our schools work to #BuildBackBetter https://t.co/jGEQkCg95H","date":"Wed Jul 14 14:44:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Housing prices in Charlotte are skyrocketing. Our naturally occurring affordable housing is crumbling, threatening the health, safety, &amp; security of our neighbors.\n\nCongress' plan must include bold investments in affordable housing. It's critical infrastructure. #BuildBackBetter","date":"Tue Jul 13 18:57:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"DID YOU KNOW: the #ChildTaxCredit has expanded to $3,000 per child ages 6-17 and $3,600 per child under the age of 6?\n\nLearn more at https://t.co/WOOfjYsZz9.\n🔁 Retweet to help spread the word!","date":"Tue Jul 13 15:47:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"For working families with children, this tax cut sends a clear message: Help is here.\" - President Biden #BuildBackBetter https://t.co/bWx4M6eNQY","date":"Tue Jul 13 12:47:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you for a wonderful day and a wonderful dinner, @SecCardona. Proud to be working with you, @POTUS, and our entire team to #BuildBackBetter. https://t.co/np6IbU7vZl","date":"Mon Jul 12 22:42:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Nothing is more important than seeing our next generation succeed. https://t.co/AuSaobNtuY","date":"Mon Jul 12 21:29:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Lucky to be able to take some time out at @PawCreekElem to hear from our parents and educators. \n\nEven though our parents rose to the challenge of COVID-19 and became teachers, nothing replaces in-person instruction.\n\nAll of us must work together so our schools #BuildBackBetter. https://t.co/QzFIqnG5pc","date":"Mon Jul 12 20:46:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @PawCreekElem for the warm welcome to @SecCardona and I today! Go Panthers! https://t.co/0L7V6htj1K","date":"Mon Jul 12 20:24:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#NC12 families, mark your calendars for Thursday, July 15th!\n\nHouse Democrats know caring for children is hard work and must be valued and rewarded.\n\nEligible working families will begin to receive their monthly #ChildTaxCredit payments via direct deposit or mail. https://t.co/uyFfCvsaaE","date":"Mon Jul 12 19:09:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #AmericanFamiliesPlan increases the value of Pell Grants. Over 70% of @JCSUniversity students are Pell eligible. \n\nIf we want to #BuildBackBetter, we have to invest in our students. https://t.co/34jLsxsMLx","date":"Mon Jul 12 19:05:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"You can’t #BuildBackBetter without #HBCUs. https://t.co/oG86ATjXFx","date":"Mon Jul 12 18:56:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Honored to join @JCSUniversity President Clarence Armbrister and @SecCardona at today’s roundtable. #HBCUExcellence https://t.co/AMjKW51Jc0","date":"Mon Jul 12 18:51:29 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy to welcome @SecCardona to @JCSUniversity today! #HBCUExcellence https://t.co/OzEQVLA2sD","date":"Mon Jul 12 18:24:41 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today would be a great day to #CancelStudentDebt.","date":"Fri Jul 09 17:23:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#HBCUStrong","date":"Fri Jul 09 12:39:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @SecBecerra for joining us in Charlotte yesterday to encourage folks to take their shot and help North Carolina and our country #BuildBackBetter. https://t.co/8Qd8258qER","date":"Thu Jul 08 15:25:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @SecBecerra for joining stakeholders from across the Carolinas to talk about the Black maternal health crisis, the @BMHCaucus, and the importance of passing the #Momnibus. https://t.co/zVh0bx0X9s","date":"Wed Jul 07 19:57:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"All of us are here because the message is clear:\n\nYou have a spot, so take your shot! https://t.co/OeuLmIZPmT","date":"Wed Jul 07 18:28:21 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Honored to host @SecBecerra in Charlotte today. We can’t #BuildBackBetter unless we crush COVID.\n\nGet your shot! https://t.co/cIAduG8zoH","date":"Wed Jul 07 16:59:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The violent attacks on @TbilisiPride and the #LGBTQ community in Georgia are unacceptable. We must stand together against hate in all countries.","date":"Wed Jul 07 15:01:54 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#HBCUStrong","date":"Tue Jul 06 14:08:04 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Life.\nLiberty.\nPursuit of Happiness.\n \nHouse Democrats are dedicated to making the vision of our Declaration of Independence a reality for ALL.\n \n#IndependenceDay https://t.co/XoBUo7Wfqi","date":"Sun Jul 04 16:31:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"57 years ago, the #CivilRightsAct struck a historic blow against discrimination and segregation based on race, religion, sex or national origin. \n \nToday, we recognize the progress made toward ending racism. House Democrats will continue working to stamp out hatred of any kind. https://t.co/sgIzvjPQoc","date":"Fri Jul 02 16:23:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @RepPeterDeFazio for standing up for my STAR Act language that makes sure that public art is part of public infrastructure!","date":"Wed Jun 30 22:14:55 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#SafetyIs is investing in the communities that have long been underserved and underfunded.\n \nWe need the People’s Response Act. https://t.co/cgpZL50nHx","date":"Wed Jun 30 17:01:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#InfrastructureIsCalling and the answer should be about people, not politics.\n\nIt’s time to create good-paying jobs in urban and rural places alike by rebuilding our #HBCU infrastructure with the IGNITE #HBCUExcellence Act.\n\nLet's invest in our communities and our future. https://t.co/PDRZEvExNi","date":"Tue Jun 29 16:22:58 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"Democrats, including Sen. Elizabeth Warren (D., Mass.), Reps. Ilhan Omar (D., Minn.), Ayanna Pressley (D., Mass.), Alma Adams (D., N.C.) and Mondaire Jones (D., N.Y.) have also called for $50,000 in debt relief.\" https://t.co/XzNB8NrfqP","date":"Tue Jun 29 14:45:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Last night, I spoke on the House floor about the urgent infrastructure needs of our #HBCUs, and how the IGNITE #HBCUExcellence Act will make a historic investment in our institutions and our students. https://t.co/FEqpWpkMuP","date":"Tue Jun 29 13:42:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @SenGillibrand, @RepJahanaHayes, @NydiaVelazquez, and @RepBarbaraLee for joining me in introducing the Closing the Meal Gap Act. https://t.co/ps97KCqGtl via @edvotes","date":"Mon Jun 28 14:20:57 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The Voting Rights Act of 1965 prevented states from discriminating against voters based on race or background. But 8 years ago today, the Supreme Court gutted it, allowing extremist politicians to erect barriers to voting all over the country.\n \nIt's time to #RestoreTheVote. 🗳","date":"Fri Jun 25 18:16:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Learn more about the #ClosingTheMealGap Act here: https://t.co/xl0tguZFYO https://t.co/Cn5WgUjKhw","date":"Thu Jun 24 17:51:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Older workers need specific protections under the law! As we look ahead to a stronger economy and upcoming legislation, I urge my colleagues to remember the importance of older workers to our economy, workforce, and our families. https://t.co/mlgUg4LhWm","date":"Thu Jun 24 15:22:12 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud to announce the introduction of the #ClosingtheMealGap Act of 2021. This transformative legislation removes barriers to SNAP benefits for our most vulnerable communities, and increases the minimum benefit to keep up with the rising cost of food.\n\nhttps://t.co/XN4VczHA6J","date":"Thu Jun 24 12:23:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Age discrimination has no place in our workforce. I was proud to vote for the bipartisan Protecting Older Workers Against Discrimination Act today. https://t.co/gXmS88KwuI","date":"Wed Jun 23 21:25:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"ICYMI, here's my House Floor Speech on #LGBTQ #Pride Month https://t.co/FjRMx33AXc via @YouTube","date":"Wed Jun 23 17:44:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Specifically, the $8 million investment in Charlotte street lighting in the #INVESTAct will help the City of Charlotte reach its Vision Zero goal to eliminate traffic-related driver, passenger, and pedestrian fatalities by 2030. #BuildBackBetter https://t.co/QUzyqY57nA","date":"Wed Jun 23 15:10:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Fulfilling @POTUS’ vision for the American Jobs Plan begins with passing @TransportDems’ #INVESTAct. The bill provides good-paying jobs and will invest critical resources to improve infrastructure in Charlotte and Mecklenburg County. #BuildBackBetter https://t.co/RvgUoKoVVr","date":"Wed Jun 23 15:07:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"For #Pride Month, I took to the floor of the United States House of Representatives to honor some of the trailblazing #LGBTQ elected officials in our Charlotte and Mecklenburg County community. https://t.co/8ZekgPR0pu","date":"Wed Jun 23 12:28:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We need to pass a bill that will:\n🗳️  Protect our freedom to vote\n💸 Stop billionaires from buying elections\n❌  End partisan gerrymandering\n💰  Stop corruption and conflicts of interest\nLet’s get it done #ForThePeople. https://t.co/XsCxV200fS","date":"Tue Jun 22 16:46:46 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The child tax credit will provide direct payments for working and low-income families with kids. \n\nThis will give families the support they need to get back to work to help boost the economy and build better lives. \n\nFind out more at https://t.co/WOOfjYsZz9. https://t.co/BFWRb7c1Jo","date":"Mon Jun 21 18:02:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Wishing all the dads out there a happy #FathersDay! https://t.co/BJe8DrMRmJ","date":"Sun Jun 20 15:07:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"My thoughts on this week's important #Juneteenth news, and what the road ahead looks like. https://t.co/qFrF6jszPZ","date":"Thu Jun 17 17:18:55 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"This morning, we’re celebrating the passage of legislation making #Juneteenth a federal holiday!\n\nHowever, the work doesn’t stop here - the fight for secure voting rights, equality under the law, and equitable treatment continues. https://t.co/uh55U4rVmW","date":"Thu Jun 17 13:42:33 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"This #Juneteenth, we reflect on the long walk to freedom, from sea to shining sea. \n\nWe’ve travelled a long way, but that walk continues today; and we cannot take one step back for every two steps forward.\n\nWe must secure our right to the ballot, to equality, and to opportunity.","date":"Thu Jun 17 01:12:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"For nearly two decades, the 2002 Iraq AUMF has been used to justify military action without Congressional approval. It’s time to repeal the 2002 AUMF and end forever wars. #StopEndlessWar","date":"Wed Jun 16 20:11:45 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’ll be on @TheTakeaway on 90.7 FM @WFAE at 2:00 PM ET today. I’m speaking with @MHarrisPerry about the recent court ruling that has halted the economic recovery for Black farmers.\n\nYou can listen on your radio or at https://t.co/rYVipRRDO2.","date":"Wed Jun 16 17:47:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Watch our #DiversityInTech panel on #HBCUs &amp; broadband live on YouTube right now: https://t.co/UkpmFnfwc0","date":"Wed Jun 16 16:28:40 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us today at 12:30 PM ET for our #DiversityInTech Summit panel discussion with Acting FCC Chairwoman @JRosenworcel! \n\nRegister here: https://t.co/5yr67u2Vys","date":"Wed Jun 16 15:53:37 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the day! Join us for the 4th Annual #DiversityInTech Summit. https://t.co/Apbh4Xsg0O","date":"Wed Jun 16 13:23:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":".@UNCF estimates #HBCU graduates can expect 56% more than they could expect to earn without their college credentials.\n\nEven when compared to Black students who graduate from non-HBCUs, it is HBCU graduates that have better economic mobility. #DiversityInTech #HBCUStrong","date":"Wed Jun 16 13:20:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Well Drew, I got bad news for you - I'm not allowed to wear them on the floor.","date":"Wed Jun 16 13:00:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I am overjoyed the United States Senate voted unanimously to make Juneteenth a federal holiday. The long March to freedom - and the work we still have to do - is something all Americans should celebrate and reflect on. I look forward to voting for this legislation in the House.","date":"Tue Jun 15 21:21:40 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Approximately 1 in 5 #NC12 residents was born somewhere other than the United States. \n\nToday, on #DACADay, we celebrate the resilience and tenacity of immigrant youth who won DACA. They deserve better than deferred action - they deserve a path to citizenship. https://t.co/6r6K4l9ycf","date":"Tue Jun 15 17:44:47 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On June 14th, 1777, our nation’s flag was adopted as a symbol of valor, independence and perseverance. #FlagDay https://t.co/edbM5MEaJP","date":"Mon Jun 14 16:40:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud of our Davidson Wildcats! #OneMeck #NC12","date":"Mon Jun 14 14:08:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"By building our care infrastructure, we will enable parents and caregivers – a group that’s predominately women – to reenter the workforce and help the entire economy recover. Congress needs to pass a jobs plan and a families plan to help make this happen. https://t.co/BYkOPP6BK1","date":"Mon Jun 14 12:27:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Wages are up, and jobless claims are down! @HouseDemocrats continue to deliver for working Americans! #BuildBackBetter https://t.co/EW5SUEu2VV","date":"Fri Jun 11 18:20:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@lo_repnc My DMs are open, feel free to reach out.","date":"Thu Jun 10 20:23:08 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Based on today’s wage gap, a woman who worked full-time, year-round would lose over $400,000 over a 40-year career. \n\nFulfilling the promise of #EqualPay is a moral imperative that will boost women’s financial security. https://t.co/XzCxJBBHq9","date":"Thu Jun 10 19:57:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"“The idea of infrastructure has always evolved to meet the aspirations of the American people and their needs.\" - @POTUS Joe Biden #CareEconomy","date":"Wed Jun 09 19:32:37 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’m very proud of the work #CLTCC and #MeckBOCC are doing on Source of Income Discrimination (SOID). Only one out of 3 voucher holders nationwide are protected by SOID regulations. #EndHomelessness","date":"Wed Jun 09 18:53:47 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"A study conducted by @Columbia showed a universal voucher program would lift 9 million people out of poverty, reduce child poverty by 36%, and decrease racial disparities in poverty rates among White and Black households. #EndHomelessness","date":"Wed Jun 09 18:37:20 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We passed a $39B down payment to keep child care providers open safely, keep workers on payroll, &amp; lower costs for hardworking families, but our work is far from over. Nearly 1 in 7 child care jobs haven't returned &amp; House Dems will keep fighting for #CareEconomy jobs &amp; families. https://t.co/2fqyEDb02Y","date":"Wed Jun 09 18:24:37 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Tune in now to our @FSCDems committee meeting on Universal Vouchers and Ending Homelessness and Expanding Economic Opportunity in America. #EndHomelessness https://t.co/3JhV2zvL4w","date":"Wed Jun 09 16:26:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"There are over 110,000 people experiencing chronic homelessness nationwide. It's time to #EndHomelessness. https://t.co/g4HnWZuwdh","date":"Wed Jun 09 16:16:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"That means the available resources for victims of violent crimes such as domestic violence and human trafficking in our state will continue to decline unless the Senate takes action and passes the #VOCAFix. https://t.co/n4frCd3quw","date":"Tue Jun 08 19:26:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Federal grants to victim services through the Victims of Crime Act have steadily declined for the past three years in North Carolina.","date":"Tue Jun 08 19:26:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, on #WorldFoodSafetyDay, I continue to press OSHA for standardized protections to not only keep consumers safe, but also the skilled workers handling our food before it makes it to our plates.","date":"Mon Jun 07 20:11:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"As Vice Chair of @HouseAgDems and Chair of the @EdLaborCmte Subcommittee on Workforce Protections, I know safe food starts with safe working conditions.","date":"Mon Jun 07 20:11:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"North Carolina is 1 of only 22 states that require a background check for firearm purchases. \n\nAs of June 2021, there have already been over 200+ mass shootings in the United States!\n\n#EnoughIsEnough! We CAN prevent this. We CAN #EndGunViolence! https://t.co/ORfSyHUp5l","date":"Fri Jun 04 16:06:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":".@sunrisemvmtCLT, I signed on to the THRIVE Act as a cosponsor in April 2021 to ensure not only economic growth, but also economic, environment, and gender equity for historically underserved communities.","date":"Thu Jun 03 18:42:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy Birthday to my fellow Gemini, sister in higher education leadership, and our @FLOTUS, @DrBiden 🥳♊️\n\n#FLOTUS #HappyBirthday #Gemini #TBT https://t.co/iNNX2F1uyY","date":"Thu Jun 03 14:16:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Currently, 8 HBCUs in North Carolina have accounting programs that prepare low-income students of color for careers at places like @Deloitte.\n\n#HBCUs are key to diversifying industries like accounting!","date":"Wed Jun 02 22:26:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy First #FirstLadiesDay to my friend, our powerhouse @FLOTUS, @DrBiden!\n\nOur nation didn’t just gain a simple First Lady in you, but a leader in education who is also an author, and the first First Lady to have earned a doctorate degree. https://t.co/6M8NMwPljN","date":"Wed Jun 02 22:13:42 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy #Pride Month to all the LGBTQ+ and Two-Spirit communities near and far, especially those in #NC12. \n\nPride Month is the perfect time to highlight our uniqueness and diversity, reminding the world that loving out loud is revolutionary, for there is no room for hate. https://t.co/966AkBaG3O","date":"Tue Jun 01 19:45:53 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On this #MemorialDay, we pause to remember the brave men and women who gave their lives fulfilling their sacred oath to serve and defend our country from threats, both foreign &amp; domestic. \n\nWe honor their sacrifice each and every day, and pray for their loved ones left behind ❤️ https://t.co/uA1GbV8scx","date":"Mon May 31 15:00:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":".@RepFrenchHill and I are proud to announce a bipartisan list of 25 new cosponsors of the IGNITE #HBCUExcellence Act. https://t.co/VicetQ2aED","date":"Thu May 27 16:31:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"For Older Americans Month, I'm hosting a Virtual Seniors and Caregivers Resource Fair TONIGHT at 6 PM ET. We will share Information regarding resources to help enhance the quality of life for our elders.\n\nRegister here: https://t.co/uMvB1sZVqV https://t.co/N6vFLLjUUN","date":"Wed May 26 21:55:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"231 mass shootings in 2021 is 231 mass shootings too many.\n\nMy prayers are with everyone in San Jose, especially the victims, survivors, and their families.\n\nI will continue to work for every shooting victim and shooting survivor with my votes and actions in Congress.","date":"Wed May 26 21:44:40 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, the Ed &amp; Labor Committee took a big step towards breaking down the barriers that hold women back from the best possible health outcomes. I'm proud to support the PUMP for Nursing Mothers Act. https://t.co/kDbjY1qlz1","date":"Wed May 26 20:23:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Don't forget to join us at 6:00 PM ET tonight for our virtual Seniors and Caregivers resource fair! https://t.co/uMvB1sZVqV https://t.co/GRwLK3RGJV","date":"Wed May 26 19:40:05 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The bipartisan PUMP for Nursing Mothers Act expands and strengthens legal protections for nursing mothers so they have the time and privacy to pump at work.\n\nI'm proud to be an original sponsor of this legislation. https://t.co/Ae6kNHZOa5","date":"Wed May 26 15:25:45 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Please join us tonight for our virtual Seniors &amp; Caregivers Resource Fair! https://t.co/uMvB1sZVqV https://t.co/dwjfQ4fy5G","date":"Wed May 26 13:25:20 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#BlackLivesMatter and we can’t sit on the sidelines. We must pass the George Floyd Justice in Policing Act. https://t.co/QGwup58uHz","date":"Tue May 25 22:58:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, we remember the day that George Floyd was brutally murdered at the hands of Derek Chauvin. We must continue the fight for #JusticeinPolicing and create a future where no one loses their lives to preventable police violence. #BlackLivesMatter https://t.co/aTD1c4cdv5","date":"Tue May 25 12:29:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Congratulations, Senator! #Momnibus","date":"Tue May 25 01:04:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Many local groups are remembering George Floyd tomorrow. Here’s one of the ways you can participate. #BlackLivesMatter https://t.co/s5s0MLlmbs","date":"Mon May 24 16:46:08 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Investing in our #HBCUs is a great way to #BuildBackBetter. Let's pass the IGNITE #HBCUExcellence Act! https://t.co/kkf1TRLC3q","date":"Sun May 23 20:42:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks for the opportunity to talk about IGNITE #HBCUExcellence - always good to catch up with a @HowardU grad! https://t.co/zeOsREKINj","date":"Sun May 23 19:00:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Looking forward to joining @FWhitfield on @CNN at the bottom of this hour to talk about the IGNITE #HBCUExcellence Act!","date":"Sun May 23 18:08:53 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#HBCUExcellence","date":"Sun May 23 15:50:40 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"ICYMI: Adams, @ChrisCoons, @RepFrenchHill, @SenatorTimScott, and Colleagues Announce Introduction of Landmark Bill, the IGNITE #HBCUExcellence Act. https://t.co/gydp94Nbbt","date":"Thu May 20 20:57:21 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#HBCUExcellence News: @HBCUCaucus MembersIntroduce Legislation to Invest in HBCUs https://t.co/QcxDtVgPwr","date":"Thu May 20 17:45:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On #MentalHealthAction Day, we join together to break through stigma, express compassion for those who struggle with mental health issues and draw attention to the proven methods that can help change their lives for the better. https://t.co/0blcCftzD9","date":"Thu May 20 16:40:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"ICYMI: A bipartisan group in Congress is working to improve the country’s more than 100 historically Black colleges and universities. #HBCUExcellence https://t.co/aFrr5ui2yq","date":"Thu May 20 16:36:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The IGNITE #HBCUExcellence Act is a game changer for Historically Black Colleges and Universities.\n\nImagine what #HBCUs can accomplish with equitable investment. https://t.co/eNVpk2evyz","date":"Wed May 19 17:07:04 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you're at the Capitol today, please join us for the official announcement of the bipartisan IGNITE #HBCUExcellence Act at 2:00 PM - an infrastructure bill that will make historic investments in our #HBCUs. https://t.co/2zy3nJ6bJ2","date":"Wed May 19 11:59:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the International Day Against Homophobia, Transphobia and Biphobia.\n\nHate has no place in this world. Love always wins. #IDAHTB","date":"Mon May 17 16:50:55 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@dee_ray1977 Just messaged you.","date":"Mon May 17 16:23:54 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@dee_ray1977 Please DM me and I'll connect you with our team.","date":"Mon May 17 16:18:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Friendly reminder: file your taxes today so you're eligible for the expanded #ChildTaxCredit. https://t.co/Te9SLb1ckP","date":"Mon May 17 13:46:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @SpelmanCollege for honoring me with your 2021 National Community Service Award today.\n\nI can’t wait to see what this amazing graduating class of Spelman women accomplishes! #SpelmanGrad21 https://t.co/gxdtgXBnRk","date":"Sun May 16 19:48:31 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Amen, @DanaiGurira. Proud to be with you and the amazing women of @SpelmanCollege today! #HBCUs","date":"Sun May 16 18:45:42 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @JCSUniversity! Proud to celebrate our #GoldenBullGrads today. #HBCUGrad https://t.co/yuYSkvk9HO","date":"Sun May 16 15:54:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Watch @JCSUniversity’s Commencement 2021 live: https://t.co/jVCuNtw5qr via @YouTube #HBCU","date":"Sun May 16 14:53:58 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to be here with our 2020 and 2021 #GoldenBullGrads!","date":"Sun May 16 13:20:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Congratulations to all of the new @unccharlotte graduates!","date":"Fri May 14 23:09:17 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"No Black woman should ever be told, much less by health professionals, to give up on a child because “you can get pregnant again because that’s what you people do.” Thank you for your powerful testimony @RepCori. #BMHMothersDay","date":"Fri May 14 15:40:50 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We'll be hearing from @RepCori shortly! \n\nBlack Maternal Health Mother's Day 2021 https://t.co/0cTgmrIIag via @YouTube #BMHMothersDay","date":"Fri May 14 15:29:50 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Beyond the 700–900 women who suffer from pregnancy complications that result in death, an additional 60,000 women suffer pregnancy-related complications that are near fatal. #BMHMothersDay https://t.co/auLNRyGne8","date":"Fri May 14 15:22:53 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Research from the Robert Wood Johnson Foundation found that these social determinants “can drive as much as 80 percent of health outcomes.” #BMHMothersDay https://t.co/meT1Mr9848","date":"Fri May 14 15:21:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"According to the Centers for Disease Control and Prevention (CDC), social determinants of health are the conditions where people live, learn, work, and play – conditions that affect a wide range of health risks and outcomes. #BMHMothersDay https://t.co/AabzELgHNc","date":"Fri May 14 15:20:29 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Maternity care access is limited in both rural and urban communities: more than one million American women live in maternity care deserts located in large metropolitan areas or urban settings. #BMHMothersDay https://t.co/z8Ljj90GlO","date":"Fri May 14 15:19:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Although the passing of the ACA has expanded coverage to millions of Americans, especially for Black Americans, 45 percent of non-elderly adults—approximately 87 million people—are inadequately insured. #BMHMothersDay https://t.co/5vFv6t26VJ","date":"Fri May 14 15:18:54 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We have a Black maternal health crisis - but we also have solutions. #BMHMothersDay https://t.co/wAAk5AiTFA","date":"Fri May 14 15:16:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Black Maternal Health #BMHMothersDay with myself, @RepUnderwood, @RepCori, and many others is about to start!\n\nWatch live on @YouTube: https://t.co/INU57H5jW5","date":"Fri May 14 14:59:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Don't miss our #BMHMothersDay video, today at 11 AM ET!\n\nWatch live on @YouTube: https://t.co/INU57H5jW5\n\nWatch live on @Facebook: https://t.co/GR4TyrN7DG https://t.co/B6OrFZSpdp","date":"Fri May 14 13:49:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us at 11:00 AM ET for the premiere of our first ever Black Maternal Health Mother's Day video! #BMHMothersDay https://t.co/INU57H5jW5","date":"Fri May 14 13:34:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you’re not used to seeing me without a hat - they’re not allowed on the House floor - I’m between @BobbyScott &amp; @JacksonLeeTX18.","date":"Fri May 14 11:58:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Even if you don’t normally file taxes or were laid off during the pandemic, make sure to file your taxes for free before May 17th to secure your new monthly #ChildTaxCredit payments from the American Rescue Plan! https://t.co/wleEFBTz9s https://t.co/QT4owGevIW","date":"Thu May 13 16:20:32 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#EidMubarak from my office to your family. May love and peace be with you. https://t.co/mDg5IQhN6B","date":"Thu May 13 14:43:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, alongside @RepDeborahRoss, I led members of the North Carolina delegation to request a full investigation into the May 7th cyber-attack on Colonial Pipeline. https://t.co/xZP7KqddfV","date":"Wed May 12 22:04:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Congratulations to the @BMHCaucus, @RepUnderwood, and everyone who worked to pass the first #Momnibus Bill in the House.\n\nNow, let’s make sure we send the Protecting Moms Who Serve act to President Biden’s desk, and pass the rest of the Momnibus as well.\n\nBlack mamas can’t wait! https://t.co/QiTyPHDzHR","date":"Wed May 12 18:32:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Due to the ongoing Colonial Pipeline situation, buses and light rail are operating for free in Charlotte and Mecklenburg County.\n\nPlease share - your ride is free today if you take @CATSRideTransit! https://t.co/h7FNobyBBX","date":"Wed May 12 17:51:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Historically Black Colleges and Universities are infrastructure. If we invest in #HBCUs, we’re investing in the jobs of today - and of the future. #InfrastructureIsCalling https://t.co/UODP2em091","date":"Wed May 12 17:44:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"By closing an unintended loophole, the PUMP for Nursing Mothers Act provides protection and support to an additional 9 million working moms who have been forced to choose between breastfeeding and earning a paycheck.\n\nhttps://t.co/UR4IAeUZ5U","date":"Wed May 12 13:55:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#InfrastructureIsCalling and we have the opportunity to create jobs today and in the future by investing in our #HBCUs. https://t.co/bevC2B0SYx","date":"Wed May 12 12:47:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The colleges and universities in North Carolina’s 12th District receiving funding under the American Rescue Plan are:\n\n@cpcc : $ 39,145,958\n@DavidsonCollege : $ 3,107,477\n@JCSUniversity : $ 7,489,402\n@QueensUniv : $ 4,336,336\n@unccharlotte : $ 69,490,756","date":"Tue May 11 19:05:04 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks to the #AmericanRescuePlan Act, our local colleges and universities will continue to provide a high quality education to our students. I'm proud to announce over $123 million in funding for these institutions.\n\nhttps://t.co/GFOIpQqztv","date":"Tue May 11 19:05:03 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Help is Here! The #AmericanRescuePlan’s #ChildTaxCredit payments set children up for success &amp; put money in working parents’ pockets for childcare and gas so they can go to work &amp; fuel our economy. \n\nSecure your payment by filing your taxes for free today: https://t.co/wleEFBTz9s https://t.co/GbGkp53TPK","date":"Tue May 11 16:06:40 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #ChildTaxCredit is a life line for families that are still struggling due to the pandemic. The average 12th District family that receives the benefit will get $2,900. \n\nMake sure you're eligible by filing your taxes on or before May 17. https://t.co/FGUru8E4LS","date":"Tue May 11 12:56:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In spite of the recent news, Colonial Pipeline’s number-one priority must remain cleaning up their spill in Huntersville. I hope Colonial resolves this cyber threat quickly so their focus can remain on clean-up and remediation efforts in Huntersville. https://t.co/eyR4ycpnAw","date":"Tue May 11 03:41:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Even if you don’t normally file taxes or were laid off during the pandemic, make sure to file your taxes for free before May 17th to secure your new monthly #ChildTaxCredit payments from the American Rescue Plan! https://t.co/wleEFBTz9s https://t.co/Wp566kD7Ni","date":"Mon May 10 15:56:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"North Carolinians sixteen years or older can now input their ZIP code at https://t.co/wyHiDyoFOr / https://t.co/yfQp9dqbzN or text their ZIP code to GETVAX (438829) / VACUNA (822862) to get help making a vaccine appointment at a nearby location.\n\nYou have a spot, take your shot!","date":"Mon May 10 13:17:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"“To describe my mother would be to write about a hurricane in its perfect power. Or the climbing, falling colors of a rainbow.” - Maya Angelou #MothersDay https://t.co/ZdrOsuI3Qy","date":"Sun May 09 14:42:01 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy #MothersDay to my Mom and all of the mothers who have made the world a better place. https://t.co/kSp0bBb2ui","date":"Sun May 09 14:19:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Watch the @AllenUniv Commencement live here: https://t.co/p0jzbNSiJO","date":"Sat May 08 15:47:58 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy #NationalNursesWeek to everyone on the front lines. Please know you are loved and appreciated for your selfless work. https://t.co/wC4ZX7rPzk","date":"Fri May 07 23:00:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"A third of Americans are now fully vaccinated. Let's keep it up!","date":"Fri May 07 16:46:35 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm proud to officially announce the #IGNITEHBCU Excellence Act today. Please watch and share our video - and support our #HBCUs. https://t.co/StiUadNO8W","date":"Fri May 07 15:25:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #IGNITEHBCU Excellence Act is the most transformative legislation for Historically Black Colleges and Universities in history. #HBCUs https://t.co/PxoXNxlMu5","date":"Fri May 07 14:20:50 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#HBCUs have always been agents of excellence in education for students of color. That's why @SenatorTimScott and I are cosponsoring the #IGNITEHBCU Excellence Act. \n https://t.co/sok9Zgx6KE","date":"Thu May 06 22:14:50 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Did you know the filibuster is NOT written into the Constitution?\n\nIt’s a racist and arcane tool that came about in the Jim Crow Era.\n\nIf we want to pass bold, progressive, and transformative bills – we must #EliminateTheFilibuster. https://t.co/h8HrTQAoGC","date":"Thu May 06 21:40:45 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happening Now: Please join me for a @OversightDems committee meeting on the Black maternal health crisis. https://t.co/iNh2R8OcGU","date":"Thu May 06 15:10:31 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Teachers can’t help but teach!","date":"Thu May 06 13:42:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We can’t educate the leaders of the future if our colleges and universities don’t have the infrastructure they need. \n\nI’m proud to introduce the #IGNITEHBCU Excellence Act to help our #HBCUs build great facilities for great students.\n\nhttps://t.co/rosCMaEmXp","date":"Thu May 06 13:07:53 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you want to know more about my story and how I'm working for you in Congress, tune in to @theconvopodshow at 8 PM ET tonight!\n\nhttps://t.co/KnhvlGAFKW","date":"Wed May 05 23:46:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you to @SenatorTimScott, @RepFrenchHill, and @ChrisCoons for joining me in leading the #IGNITEHBCU Excellence Act.\n\n#HBCUs are essential infrastructure.\n\nhttps://t.co/HR10StyFWW","date":"Wed May 05 23:00:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Our #HBCUs deserve a level of investment and engagement reflective of their multi-billion dollar economic impact, and their collective impact on the minds of millions of our nation’s future leaders.\n\nThat's why we need the #IGNITEHBCU Excellence Act. https://t.co/z13ePl7Ith","date":"Wed May 05 20:58:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Great to see @NC_Governor &amp; @JCSUniversity President Clay Armbrister today - and great job showing your #HBCU colors, Roy! https://t.co/z2y0CfvmYX","date":"Wed May 05 19:25:57 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to be at @JCSUniversity today ... we are #HBCUStrong! https://t.co/W93HYuwwVx","date":"Wed May 05 19:11:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Given the challenges our #HBCUs continue to face, it is crucial that we support @JCSUniversity and institutions like it that are focused on advancing minority communities. I applaud @WellsFargo for being a strong partner with our HBCU community and their $1 million gift to JCSU.","date":"Wed May 05 18:44:00 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"At @JCSUniversity today with @NC_Governor &amp; @CLTMayor for a major #HBCU partnership announcement from @WellsFargo. #PowerOfPartnerships https://t.co/D08QqRsTuy","date":"Wed May 05 18:37:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you, Dr. Biden, for inspiring current and future educators across our country. #TeacherAppreciationDay","date":"Tue May 04 19:43:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #FreedomRiders sought to test the Supreme Court decision that banned segregation in interstate travel.\n \nDespite an overwhelming amount of violence and opposition, they remained steadfast in their mission. #FreedomRiders \n \nToday, we honor their fight and uplift their legacy. https://t.co/MKU37MZ0YJ","date":"Tue May 04 18:35:26 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I don’t know who made this, but this hat is definitely not in my collection. #MayThe4thBeWithYou https://t.co/A8NmGRGNXP","date":"Tue May 04 16:04:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the first day of Asian American Pacific Islander Heritage Month.\n\nAbove all else, we must stand against racially-motivated violence and #StopAsianHate .\n\nPlease join me in honoring the culture and history of the #AAPI community.","date":"Sun May 02 02:58:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Take your shot! https://t.co/DYo8NugSWo","date":"Sat May 01 16:34:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":".@RepCheri, I have been honored to serve with you in the House, and our caucus is going to miss your leadership next Congress. \n\nI know your work isn’t done, and I look forward to continuing to work with you in the 117th! https://t.co/JXaLruTMuE","date":"Fri Apr 30 20:11:55 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"An important read on the struggles parents face in our country - and why the #AmericanFamiliesPlan is so important. https://t.co/lqRITbTm8p","date":"Fri Apr 30 18:19:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"What the Hell would we do without our #HBCUs?\" https://t.co/VRGCwXCnki","date":"Fri Apr 30 15:45:53 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, I am honored to address the graduating students of @aamuedu. You can watch live here at 10 AM CT/11 AM ET: https://t.co/novR4arJdD","date":"Fri Apr 30 14:57:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today my thoughts are with the entire @unccharlotte community; my prayers are with the victims and their families and friends; and my actions in Congress continue to work for a future without gun violence. https://t.co/4TQvHBeJHL","date":"Fri Apr 30 13:21:41 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The #Momnibus is essential legislation for ensuring #MaternalJustice","date":"Thu Apr 29 23:53:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"What did you appreciate most about @POTUS's first #100days?","date":"Thu Apr 29 22:18:20 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"@Lauren_Peaker @MrCooper https://t.co/XhVLFF9Tul","date":"Thu Apr 29 20:52:17 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you are a victim of the erroneous mortgage payment incident involving loans serviced by @MrCooper, I'd like to hear about it. My DMs are open.\n\nIf you're a North Carolina resident, you can also file a complaint with @NCAGO: https://t.co/Zi911shQnU\n\nhttps://t.co/x0DGDX66zt","date":"Thu Apr 29 20:34:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"No one in our country should go hungry - especially during a pandemic. Glad to see this level of support for our SNAP recipients.","date":"Thu Apr 29 18:02:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join us tonight at 8pm ET for a convo about the #Momnibus with @MomsRising, @SisterSong_WOC, @everymomcounts, @MMHLA2, @WomanProjectHQ, @colorlatina, @MamasConPoder! There's a place for every person inside of the package. Where do you fit in? Follow #MaternalJustice to find out.","date":"Thu Apr 29 17:30:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I want to thank my dear friend @FLOTUS Jill Biden for her work on higher education. I know she has been an advocate for #HBCUs, and I look forward to her continued leadership within the Biden-Harris Administration. #JointAddress https://t.co/M3UgvoFJfU","date":"Thu Apr 29 13:02:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I look forward to working with the Biden-Harris Administration and my Congressional colleagues to continue our recovery from the coronavirus. I am confident that, together, we will be able to build our country back better. #JointAddress https://t.co/htmJgny21h","date":"Thu Apr 29 02:14:09 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Children shouldn’t be in poverty.\n\nThey shouldn’t be hungry, they shouldn’t be homeless.\n\nWe should get this done. #JointAddress","date":"Thu Apr 29 01:44:53 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"we will increase Pell Grants and investment in Historically Black Colleges and Universities, Tribal colleges, and minority-serving institutions.\"\n\nThank you @POTUS for acknowledging the importance of our #HBCUs! I'm ready to work with you to #BuildBackBetter.","date":"Thu Apr 29 01:35:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"It's way past time to raise the minimum wage to $15 an hour. #JointAddress","date":"Thu Apr 29 01:28:18 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We all can use a little breathing room after the past year. #JointAddress","date":"Thu Apr 29 01:26:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We're going to cut child poverty in half. That's something everyone in Congress should clap for. #JointAddress","date":"Thu Apr 29 01:23:36 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"President Biden is standing in front of two history-making women tonight.\n\nHow far we have come. #PresidentialAddress","date":"Thu Apr 29 01:21:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Great shoutout from @POTUS for Community Health Centers. I’m proud my  #PresidentialAddress guest is Debra Weeks, the CEO of the CW Williams Community Health Center - they’re doing amazing work to fight the pandemic and provide essential health services.","date":"Thu Apr 29 01:16:43 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"Madam Speaker, the President of the United States ...\"","date":"Thu Apr 29 01:05:05 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Tonight, @POTUS will remind Americans of the challenges we’ve endured over the past year and how we’ve united since January 20th to face them head-on. #HelpIsHere https://t.co/60L9H7XycY","date":"Thu Apr 29 00:00:22 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"It is clear to me that the General Assembly must repeal laws that make the truth more elusive, including the law that makes it harder for local law enforcement agencies to release body-camera footage.","date":"Wed Apr 28 17:19:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"These videos are terrible, and shake my heart to the core whenever I see them, but their timely release is part of reforms that are essential to building trust between law enforcement agencies and the communities they serve. #BlackLivesMatter","date":"Wed Apr 28 17:19:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I do not believe the Superior Court Judge’s decision to delay the release of the body-camera footage showing the fatal shooing of Andrew Brown Jr. is in the interest of justice. The people of Elizabeth City and of North Carolina deserve to know the truth.","date":"Wed Apr 28 17:19:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Debra Weeks will be my guest for the #PresidentialAddress to Congress. Debra has a servant’s heart, and the work she does every day exemplifies the leadership our Charlotte Mecklenburg community has shown during the #COVID19 pandemic. #BuildBackBetter https://t.co/uH3zwKYA7Z","date":"Tue Apr 27 21:43:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Earlier today, I spoke to the Tuesday Morning Breakfast Forum for the first time since the start of the pandemic. \n\nIn September, I was honored to speak about TMBF co-founder Sarah Stevenson - and all of her contributions to Charlotte - on the House floor. https://t.co/KiKCggYjU1","date":"Tue Apr 27 13:30:20 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy to join Charlotte’s Tuesday Morning Breakfast Forum this morning - virtually of course. https://t.co/ea14rgkEGk","date":"Tue Apr 27 13:12:27 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In case you missed it, here's my speech during @LeaderHoyer's #BlackMaternalHealth roundtable today. \n\nLet's save lives and save moms: pass the #Momnibus!\nhttps://t.co/cSm7ZFt8Nc via @YouTube","date":"Mon Apr 26 21:49:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Join me live with @LeaderHoyer, @RepUnderwood, @RepAnthonyBrown, and many others as we talk Black Maternal Health. https://t.co/xtPPwGwJrg","date":"Mon Apr 26 14:37:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you @milwcouriernews for giving me the opportunity to write about the importance of #BlackMaternalHealthWeek and our #Momnibus legislation. https://t.co/t3Q5xIqeJC","date":"Mon Apr 26 13:57:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"If you can't join @LeaderHoyer, @RepUnderwood, @RepAnthonyBrown, and myself on Zoom, you can watch live on Facebook at 10:30 AM ET: \n\nhttps://t.co/JMFoGsatZp","date":"Mon Apr 26 13:53:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thanks to @TheRevAl for having me on today to talk about the Black maternal health crisis. We don't want another mommy to go home without her child, or another child to go home without her mom. https://t.co/dBXEKrkyqT","date":"Sun Apr 25 22:08:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I’ll be on @MSNBC at 5:30 PM talking with @TheRevAl about the Black Maternal Health #Momnibus and the Biden-Harris Administration’s plans to #BuildBackBetter","date":"Sun Apr 25 21:22:08 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"There are currently seven deputies on leave, but no answers for the community. \n\nThe body camera footage should be made available immediately so that the community can know the facts and hopefully begin to heal. My prayers and grief are with Mr. Brown’s family and community.","date":"Sat Apr 24 20:53:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I am deeply troubled and saddened by the recent police shooting in Eastern North Carolina. I stand with the people of Elizabeth City, including Mayor Bettie Parker, in their call for more transparency about the Pasquotank County Sheriff’s Office shooting of Andrew Brown.","date":"Sat Apr 24 20:53:49 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"In today's @NYAmNews: \"Our time on this Earth is short; our time in Congress is even shorter. We can use it wisely by passing bills such as the #Momnibus that address the root cause of disparities and inequities—racism—not just the symptoms.\"\nhttps://t.co/RZKDD9EtsP","date":"Thu Apr 22 19:30:47 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"This #EarthDay, I’m joining @RepBobbyRush to honor #HazelMJohnson, the mother of the #environmentaljustice movement. Her legacy is carried on by activists across the country who are fighting against environmental injustice in their communities. https://t.co/YMEHnapTcJ","date":"Thu Apr 22 18:46:52 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I work &amp; vote to protect our home on #EarthDay &amp; every day. What are you grateful for? https://t.co/YDZcblMXKa","date":"Thu Apr 22 17:38:04 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"🚨 FYI: Charlotte Mecklenburg is having issues with 911 operations. 🚨\n\nThe alternative numbers for help are 704-336-7911 or 704-336-3237.","date":"Thu Apr 22 16:24:51 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Black environmental activists are often overlooked, even though climate change &amp; pollution disproportionately affect low-income communities and communities of color. That’s I’m honoring the mother of #EnvironmentalJustice, #HazelMJohnson, this #EarthDay . #ActOnClimate https://t.co/cx3iEgs4mr","date":"Thu Apr 22 15:55:41 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Happy #EarthDay! Today we want to share our appreciation for our farmers, ranchers, and foresters, who protect and preserve our natural resources. https://t.co/GouqUS3s4t","date":"Thu Apr 22 15:42:41 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Alcee was a compassionate Congressman and a leader with conviction and purpose. I admired both his courage and his unique ability to bring reason and deep thought to the many conversations we shared. He was a friend and mentor we all respected.\n\nhttps://t.co/y10ydoUSkJ","date":"Wed Apr 21 14:41:42 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Swann v. Charlotte-Mecklenburg Board of Education - the case that integrated our local schools - was decided 50 years ago today.\n\nThe work never stops. #BlackLivesMatter","date":"Tue Apr 20 23:33:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Thank you to the judge, the jurors, and the officers of the court for your work. However, in spite of today’s verdict, our work continues.","date":"Tue Apr 20 22:05:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The Senate must pass the George Floyd Justice in Policing Act to ensure that no other father, mother, son, daughter, aunt, uncle, sister, brother or loved one again dies at the hands of the police without accountability.","date":"Tue Apr 20 22:05:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Without passing the bill that bears his name, true justice for George Floyd and countless other victims still remains to be served. #BlackLivesMatter","date":"Tue Apr 20 22:05:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Justice was served today, and while that will not bring back George Floyd or the countless thousands lost to state-sanctioned violence, it means the millions of Americans struggling, fighting to breathe free are closer to living in a just, beloved community. #BlackLivesMatter","date":"Tue Apr 20 22:05:55 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Praying for the continued presence of justice in our country and our communities. #BlackLivesMatter https://t.co/EghW5l26h3","date":"Tue Apr 20 21:33:58 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today, @RepFrenchHill and I announced that @TMobile has joined the @HBCUCaucus #HBCU Partnership Challenge.\n\nI applaud our partners for taking the pledge at such a critical time, and leaning in to create 21st century opportunities for students and grads.\n\nhttps://t.co/bSUCHuHjL1","date":"Tue Apr 20 16:05:15 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Help Is Here! Americans overwhelmingly support the #AmericanRescuePlan to put:\n🩹 Shots in arms\n💵 Money in pockets\n🏫 Children in schools\n🛠 People in jobs\nand\n🎓 Invest in #HBCU and Higher Ed Infrastructure","date":"Tue Apr 20 14:56:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I pulled out my pink Chuck Taylors for @VP @KamalaHarris’ visit to North Carolina yesterday. https://t.co/jaJswGVZsz","date":"Tue Apr 20 13:17:10 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Walter Mondale was a stalwart champion of progressive values. As a candidate for President, he supported the Equal Rights Amendment &amp; made history when he chose Geraldine Ferraro as his running mate. My prayers are with his family and all of the DFLers mourning his loss tonight.","date":"Tue Apr 20 01:50:16 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Below is my statement on @VP @KamalaHarris' visit to North Carolina today. Together, we're going to pass the #AmericanJobsPlan, create good jobs for American workers and #BuildBackBetter.\n\nhttps://t.co/WnxZpkFFdN","date":"Mon Apr 19 16:55:44 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"\"One good job should be enough. At a good job, you shouldn’t have to worry about your safety at work. At a good job, you shouldn’t have to go into debt for a diploma that promises a decent paycheck. A good job allows people the freedom to build the life you want.\"\n- @VP Harris","date":"Mon Apr 19 16:20:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Millions of workers are out of a job while our infrastructure is in desperate need of investment. North Carolina needs new investment in our roads, transit, schools, #HBCUs, broadband, and more. \nLooking forward to talking with @VP Harris today about how we can #BuildBackBetter!","date":"Mon Apr 19 15:27:14 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Looking forward to welcoming my Alpha Kappa Alpha soror and our @VP Kamala Harris to North Carolina today!\n\n(From an appropriate social distance, of course) https://t.co/IJwHVPv5f7","date":"Mon Apr 19 12:54:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On the last day of #BlackMaternalHealthWeek, I'm announcing two vital pieces of legislation I'm leading with @SenGillibrand: the Modernizing Obstetric Medicine Standards (MOMS) Act and the Maternal Care Access &amp; Reducing Emergencies (CARE) Act.\nhttps://t.co/a8ucOQHhPa","date":"Sat Apr 17 19:02:13 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"On the last day of #BlackMaternalHealthWeek, I'm announcing two vital pieces of legislation I'm leading with @SenGillibrand: The Modernizing Obstetric Medicine Standards (MOMS) Act and the Maternal Care Access &amp; Reducing Emergencies (CARE) Act.\nhttps://t.co/a8ucOQHhPa","date":"Sat Apr 17 18:57:30 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the first day of #NationalParkWeek! Which one is your favorite? Let me know in the comments below.\nhttps://t.co/roZnoUi8LW","date":"Sat Apr 17 14:46:17 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"#BlackMaternalHealthWeek","date":"Fri Apr 16 21:42:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today is the final day to submit a work for our 12th District Congressional Art Competition. The competition is open to any student who lives in #NC12 or attends school in the district.\n\nLearn more here and submit your piece before midnight!\nhttps://t.co/4I6M8ayHUd","date":"Fri Apr 16 15:59:50 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"This #BlackMaternalHealthWeek and every other week, let’s ensure women have what they need to not only survive, but to thrive — before, during and after pregnancy. \n\nLet’s make the health and well-being of Black women a priority. Black mamas can’t wait, and neither should we.","date":"Fri Apr 16 11:37:38 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"We the people deserve to know if the leader of the free world has business dealings anywhere else in the world. The TRUST in Elections Act makes sure that our President and Vice President are working for us – not anybody else. https://t.co/zGXxIL33lp","date":"Thu Apr 15 21:41:07 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"13 years old. Unarmed. A child.\n\nI am heartbroken for Adam Toledo's family. We should never become numb to the fact that this should never happen. #BlackLivesMatter","date":"Thu Apr 15 21:37:06 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to vote to pass #EqualPay in the House today!","date":"Thu Apr 15 21:24:28 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Proud to stand with @rosadelauro and my colleagues as we call on the Senate to pass the Paycheck Fairness Act.\n\nWe cannot continue to rob women of the wages they deserve, nor force them to work harder to be paid fairly.\n \nThis is an issue of fairness and an issue of justice. https://t.co/yhVuc7cSGK","date":"Thu Apr 15 19:13:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"The Black Maternal Health #Momnibus Act of 2021 – a package of 12 bills – will comprehensively address every dimension of the maternal health crisis in America to save lives and end racial and ethnic disparities in maternal health outcomes. #BMHW21 https://t.co/zwsBc6CzHf","date":"Thu Apr 15 16:51:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I'm on the floor of the US House right now to speak about #BlackMaternalHealthWeek.\n\n60% of Black maternal deaths are preventable. We have no excuse for inaction. #PassTheMomnibus https://t.co/Zbv8kwog9b","date":"Thu Apr 15 16:18:02 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"It's time for North Carolina to #BuildBackBetter. Let's make historic investments in infrastructure and job creation - not to mention #HBCUs - by passing the #AmericanJobsPlan. \n\nhttps://t.co/DLz9EthwkE","date":"Thu Apr 15 15:30:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"It's time to pass the #Momnibus. Black Mamas can't wait. #BMHW21 https://t.co/K0qIYV8lly","date":"Thu Apr 15 15:07:25 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"You can watch our #BlackMaternalHealthWeek Fireside Chat live here: https://t.co/GFC1qPLtml","date":"Wed Apr 14 18:03:23 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Let’s pass the Momnibus — in Washington, in Raleigh, and in Sacramento — and address the Black Maternal Health crisis. Our mamas can’t wait. #BMHW21\n\nhttps://t.co/1Q4rEkJ3t4","date":"Wed Apr 14 13:15:48 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"For @CharMeckSchools students who are still learning remotely, as well as preschoolers and students at non-CMS schools, here is the new list of meal bundle pick-up sites: https://t.co/i3csKQxnNs","date":"Tue Apr 13 19:38:24 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Prayers to their entire family.","date":"Tue Apr 13 19:31:39 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Unfortunately, we all have stories. If it wasn't us, it was our daughter or mother or auntie. #BMHW21","date":"Tue Apr 13 16:41:56 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Today at 12:30, @VP Harris will hold a #BlackMaternalHealthWeek roundtable with women who will share their experiences with complications from pregnancy, highlighting the disparities that Black women face in maternal health. Watch here: https://t.co/7T0hr9itv1","date":"Tue Apr 13 16:00:04 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"Congrats to Charlotte’s own @StephenCurry30!","date":"Tue Apr 13 14:03:34 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"This #BlackMaternalHealthWeek, you can join us in spreading the word about the maternal mortality and morbidity crisis, and the steps we can take to solve it.\n\nCheck out our #BMHW21 advocacy kit here: https://t.co/fQDtw7Ihkw","date":"Tue Apr 13 13:38:11 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"True justice for #DaunteWright means never again.","date":"Mon Apr 12 23:30:52 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"April 11-17 is #BlackMaternalHealthWeek, a week where we center Black lives and Black bodies as we work to end the maternal health crisis.\n\n#BlackLivesMatter, this week and every week.","date":"Mon Apr 12 19:30:59 +0000 2021","user_id":"2916086925"},{"handle":"RepAdams","text":"I am proud to introduce the 4th Annual Black Maternal Health Week resolution with @CoryBooker, @RepUnderwood, and over 75 of our colleagues.\n\nThis #BlackMaternalHealthWeek, the message is clear: Black mamas can't wait. https://t.co/SUo0SIIDkn","date":"Mon Apr 12 19:21:20 +0000 2021","user_id":"2916086925"}]