[{"handle":"RepAndyHarrisMD","text":"Unfortunately, the Biden-Pelosi American  ̶R̶e̶s̶c̶u̶e̶ ̶ Inflation Plan is making history for all the wrong reasons.  https://t.co/uCKDjnXG0e","date":"Thu Jun 16 19:41:36 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Last night, as Deputy Sheriff Glenn Hilliard pursued a wanted criminal, he was killed in the line of duty. This senseless death should not have happened. The entire family of this fallen hero as well as the Wicomico community are in the prayers of Nicole and me.","date":"Mon Jun 13 20:46:26 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"In just over 500 days, the record accomplishments of this administration are on full display.\n\n✅8.6% inflation \n✅$5.00 gas prices\n✅Grocery prices through the roof \n\nThis is what the prime time and televised hearings should be about.","date":"Fri Jun 10 17:59:18 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My colleague, and fellow physician and veteran, Dr. Mark Green addresses what the majority in Congress should really be looking at if we really wanted to save the lives of American children, instead of using the horrible Uvalde tragedy for political gain.","date":"Fri Jun 10 11:51:01 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This was a shameful assassination attempt against Justice Kavanaugh. I hope my colleagues on the Left will join me in condemning this violence.","date":"Wed Jun 08 20:21:23 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Hard-working American families cannot continue to afford this.","date":"Mon Jun 06 22:27:50 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Emily Alt from Kent Island High School for winning the 2022 Congressional Art Competition for Maryland’s First District. Her work is titled, “Only the Music.” https://t.co/HOR8cu72tx","date":"Tue May 31 21:07:32 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was great attending the Crisfield Watermen Induction Ceremony over the weekend and seeing Director Thompson, Delegate Otto, Sheriff Howard, Councilman Laird, and so many others. Congratulations to the inductees. Also, the soft crab sandwich was amazing! https://t.co/VQpDp6iBWu","date":"Tue May 31 16:11:11 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"A greater love has no one than this, that one would lay down their life for another. - John 15:13 \nToday, we honor the brave men and women who have fought so our country can stay free. https://t.co/NaA4zCD3nx","date":"Mon May 30 12:34:12 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Court got it right, especially as fentanyl flows openly over our southern border and kills so many. https://t.co/mb4gzdcj9D","date":"Fri May 20 22:19:33 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We don't need another Ministry of Truth; our First Amendment right already gives us the freedom to speak. There is no need to just \"pause\" this disinformation board, it should be ended once and for all. https://t.co/BPGDNEaJ1p","date":"Thu May 19 22:29:16 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Gas prices are on the rise again—the price Americans paid at the pump increased by 15 cents, setting yet another record. Americans cannot continue to be the victims of Biden's war on energy. https://t.co/PhvINPdF06","date":"Wed May 18 21:21:23 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The latest CDC data shows a tragic new record in overdose deaths with a 15% increase between 2020 and 2021 largely due to the unchecked flow of fentanyl across our southern border. The Biden Administration must extend Title 42 to cover opioids.\nhttps://t.co/V5NWIFZsoQ","date":"Thu May 12 20:28:52 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Biden’s dystopian “disinformation board” runs counter to our Constitutional and American values. We can’t let this happen in a free country. https://t.co/OcAyJ9LAxg","date":"Thu May 05 17:52:15 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Honored to receive @ACUConservative’s Award for Conservative Excellence, their highest rating! https://t.co/orJqAHNCti","date":"Wed Apr 27 00:06:58 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As more and more details emerge about the level of involvement President Biden had in his son's business dealings, we must appoint a special counsel to independently investigate, and if appropriate, prosecute. https://t.co/Lr7tiLtuLS","date":"Mon Apr 25 20:19:20 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"No one is fooled when the President tries to blame the decades high inflation on Vladimir Putin. The print and spend policies of this Administration and liberals in Congress are truly to blame. https://t.co/CpOVVjEj31","date":"Wed Apr 20 15:56:32 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to attend the ribbon cutting for a new home for Harriett’s House in Hurlock this A.M., and to catch up with Gov. Hogan while there! Harriett’s House is an organization dedicated to helping women who are victims of human trafficking. Learn more here: https://t.co/gC033RCcNl https://t.co/OvYJdE3bPo","date":"Tue Apr 19 20:38:06 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"He is risen! Happy Easter to you and your family. https://t.co/knJqSxVBpS","date":"Sun Apr 17 15:50:03 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My parents fled the very same totalitarian regime in Eastern Europe that now is waging war on sovereign Ukraine. It is truly a badge of honor for me to be sanctioned by the Russian government. https://t.co/UDftiUr2ZC","date":"Thu Apr 14 15:27:20 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Yet another four decade high this month for inflation. The borrow/print and spend agenda of President Biden and liberals in Congress is killing hardworking Americans. #inflationistaxation https://t.co/xjb9JlDxVo","date":"Wed Apr 13 16:45:05 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am very optimistic that we will get this legislation over the finish line so that we can finally cut through the red tape and encourage quality research on the real-world health effects of marijuana, good or bad. (2/2)","date":"Wed Apr 06 17:49:26 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Far too much of the mainstream discussion on marijuana, from both sides, is based on anecdotal evidence, not on rigorous and reliable empirical data or studies. (1/2) https://t.co/SaL7rxm2fy","date":"Wed Apr 06 17:49:25 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"When polling consistently shows that a majority of taxpayers oppose taxpayer funded abortion, it is incumbent upon us as a legislative branch to cut ties with businesses that will explicitly fund employee travel to receive an abortion. https://t.co/zz6EHqggft","date":"Tue Apr 05 21:39:19 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This is what happens when you have the teachers union writing CDC guidance.","date":"Fri Apr 01 22:14:10 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to meet with @USDA_APHIS Admin. Shea this afternoon to talk the confirmed outbreaks of highly pathogenic avian flu in MD and nationwide, which pose significant danger to our poultry industry. I am appreciative of their efforts and look forward to our continued collaboration https://t.co/f7zPXcWROf","date":"Fri Apr 01 21:22:04 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will continue to fight to ensure that doctors and nurses are not forced to participate in abortion, gender reassignment surgery, and other procedures that violate their deeply held beliefs. (2/2)","date":"Thu Mar 31 16:56:09 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The HHS Office of Civil Rights must enforce the law and protect providers’ rights of conscience. Instead, OCR is shirking its responsibilities in favor of furthering the Biden Administration’s support of cancel culture and its attack on health provider conscience rights. (1/2) https://t.co/3mszFh722r","date":"Thu Mar 31 16:55:57 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our thoughts go out to the sailor lost late last night. Please join me in praying for his family and for the recovery of the survivors. I will continue to monitor this situation as more information comes to light. https://t.co/jR1SMPP5pJ","date":"Thu Mar 31 13:56:33 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"An extra $5200 a year for a family to buy the same usual goods? Liberal tax and spend policies are killing hard-working families and ballooning our national debt. And to think now they want to raise taxes...\n\n#InflationisTaxation","date":"Wed Mar 30 14:50:27 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we honor all those who served and sacrificed in #Vietnam. As a veteran myself, thank you for all you have done for our country. https://t.co/CQGITgCDuI","date":"Tue Mar 29 18:43:11 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This administration continues to be a day late and a dollar short @newsmax https://t.co/VkcqJ4J9NZ","date":"Fri Mar 25 20:52:43 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Maryland Day!","date":"Fri Mar 25 15:21:04 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Proud to represent rural America!","date":"Tue Mar 22 15:07:19 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It’s time to create separate leagues for individuals whose gender preference doesn’t match their biological sex.","date":"Fri Mar 18 19:00:26 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Guess who should have won but got second place instead-an Olympic Silver Medalist! I feel so bad for all the young women athletes who train for years, only to be defeated by a biological male. (1/2)","date":"Fri Mar 18 18:59:50 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to join @C4WBAL and @BryanNehman on @wbalradio this morning to talk gas prices and the war in Ukraine.  Watch more here: https://t.co/7mbZpsh6iH","date":"Fri Mar 11 19:58:41 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Another new record for inflation this month. Too bad that didn’t stop Speaker Pelosi from increasing non-defense spending last night by over 6%.","date":"Thu Mar 10 16:46:00 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Proud of this daughter of Dorchester County.","date":"Tue Mar 08 19:47:03 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to speak with local officials and members of the Somerset County community this afternoon at the American Legion, Stanley Cochrane Post #16, in Crisfield. I look forward to our continued efforts to expand economic opportunity and development here on the Lower Shore. https://t.co/3cPkodfrRU","date":"Fri Mar 04 23:01:31 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Please join me in celebrating the bicentennial birthday of American hero Harriet Tubman. More info about all of the great events being held this month can be found here: https://t.co/d9IMMlXmVs https://t.co/0872oVHYFh","date":"Thu Mar 03 17:27:03 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My latest on Ukraine: https://t.co/4gVSmVR2CZ","date":"Tue Mar 01 22:29:29 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Rising costs are a direct result of this administration’s radical policies and are causing undue hardship on hardworking families.","date":"Mon Feb 28 21:25:59 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to join the Cecil Pregnancy &amp; Family Resource Center this morning to celebrate their new ultrasound machine, which was funded by the @KofC. This technology truly paints a picture of humanity in the womb. More info about their work can be found here: https://t.co/OvI3hiQVNE https://t.co/rEJY9hWpNB","date":"Mon Feb 28 18:29:14 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Inflation is taxation!","date":"Mon Feb 28 00:43:04 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I joined Reps. Latta and @MikeKellyPA on this letter, because it’s well beyond time Speaker Pelosi reopened the House of Representatives to the American People.","date":"Mon Feb 21 21:21:52 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy President’s Day!","date":"Mon Feb 21 16:34:41 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We need to get answers as to how much it cost taxpayers to transport illegal aliens across the country, and how many have been released into our communities. https://t.co/jgMgf3xrYw","date":"Thu Feb 17 19:08:33 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Please donate blood today!","date":"Wed Feb 16 18:00:40 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to join Vince Coglianese yesterday to discuss the concerns my colleagues and I have over reports that DHS is transporting illegal aliens across the country at taxpayer expense. https://t.co/0rciFu970Y","date":"Wed Feb 16 15:22:53 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@RepRutherfordFL @RepAshleyHinson @CongPalazzo @Robert_Aderholt @RepBenCline @MarkAmodeiNV2 @RepDavidValadao @rep_stevewomack @CongMikeSimpson @RepMikeGarcia for signing on! (3/3)","date":"Mon Feb 14 23:10:05 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks to @RepChuck for leading with me, and to @KenCalvert @RepNewhouse @RepHalRogers @JudgeCarter @RepMoolenaar @GReschenthaler @RepTonyGonzales (2/3)...","date":"Mon Feb 14 23:09:47 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My constituents deserve a full accounting of the number of illegal aliens released into their neighborhoods after these alarming reports came to light. We must know the costs associated with transporting these aliens across the country at taxpayer expense. https://t.co/Wcs1S6GnCi","date":"Mon Feb 14 23:06:13 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I applaud this move by the  Archdiocese of Baltimore that should have been done long ago - however they should allow it even where liberal jurisdictions try to intervene, as this is a matter of religious liberty. Now it’s time for Maryland to do this statewide!","date":"Fri Feb 11 19:12:53 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"A four decade high! The liberal tax and spend agenda must be stopped otherwise inflation will continue to soar. #inflationistaxation","date":"Thu Feb 10 21:11:09 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Sadly, in this epidemic of drug overdoses in America, President Biden’s porous southern border policies have led to countless additional fentanyl overdoses and deaths.  We owe it to our children to secure the southern border and stop the flow of illegal fentanyl NOW. https://t.co/EcFvdEneP7","date":"Thu Feb 10 00:50:47 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Inflation is taxation! https://t.co/UtNOwOjETE","date":"Tue Feb 08 23:17:17 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"(2/2)...after a German U-boat torpedoed their transport vessel in the Atlantic. More on this incredible story can be found here: https://t.co/6v2VEZwZk3","date":"Mon Feb 07 19:23:46 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a veteran, it was an honor to attend the American Legion Posts 70 and 77 Four Chaplains Memorial Service in Easton. This annual service honors the leadership and sacrifice of four Army chaplains of different faiths who tragically perished in 1943...(1/2) https://t.co/o90ILbhgtK","date":"Mon Feb 07 19:23:10 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It’s time to recognize natural immunity as at least as good as vaccination, and end the mandates.","date":"Fri Feb 04 20:33:42 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Fund students, not failing systems.","date":"Thu Feb 03 21:29:58 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...like increased suicides, opioid overdoses, and children now two years behind in learning. We should never have locked down, but at least we should open everything up now (2/2)","date":"Thu Feb 03 20:44:46 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The data now clearly confirms what many suspected from the beginning - that the COVID-19 lockdowns and restrictions did nothing to reduce pandemic deaths but instead had devastating effects on society...(1/2)\nhttps://t.co/pkoDpiQSXR","date":"Thu Feb 03 20:43:34 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our national debt has now eclipsed $30 trillion. Sadly this debt will be paid by our children and grandchildren. Congress must work to reduce spending, and thank goodness President Biden's Build Back Bankrupt bill didn't pass. https://t.co/jwfmce5Vq1","date":"Wed Feb 02 20:09:51 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was an honor to again received the Friend of the Farm Bureau award from the @FarmBureau at the Cecil County Farm Bureau legislative priorities breakfast yesterday. I am proud to represent rural MD and will continue to work to ensure they are well represented in Congress. https://t.co/XaFA3gWf8Q","date":"Tue Feb 01 17:26:13 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Senator (Dr.) Marshall raises great points here. https://t.co/h5B1EA1HXc","date":"Fri Jan 28 01:13:54 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Education is key to success, and this pandemic has opened the eyes of parents to the failures of the public education system, largely due to the demands of teachers unions. I'm proud to support school choice in Congress, so every child has a chance to succeed #iloveschoolchoice https://t.co/2edxqjJqZT","date":"Wed Jan 26 17:32:21 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Inflation is taxation!","date":"Wed Jan 26 14:25:41 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"After nearly 50 years and over 60 million lives lost, we pray that Roe’s days are numbered #marchforlife #equalitybeginsinthewomb https://t.co/DWnMkYE9I3","date":"Sat Jan 22 17:37:43 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Especially today, it is an honor to receive an A+ rating from the Susan B. Anthony List for my commitment to pro-life policy in Congress. #marchforlife #EqualityBeginsInTheWomb https://t.co/OElNytXmuu","date":"Fri Jan 21 19:05:54 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Grocery and meat shelves are almost empty in some stores. And when you can find things, the prices are much higher. We need a new direction for the country. #inflationistaxation https://t.co/cA2AzbXhNc","date":"Tue Jan 18 23:55:59 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today, when some are once again trying to divide us based on identity, we must remember the wise words of Dr. Martin Luther King, Jr.: “Not by the color of their skin, but by the content of their character.” https://t.co/BFyvVnxLVd","date":"Mon Jan 17 15:16:15 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great news for our nation as we fight dueling supply chain and inflation crises!","date":"Thu Jan 13 21:00:34 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Inflation is taxation!","date":"Wed Jan 12 17:49:12 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The removal of these common sense prescribing requirements on abortion pills will only endanger women and fuel the abortion on demand industry in this country.","date":"Wed Jan 12 15:20:32 +0000 2022","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Merry Christmas from my family to yours! https://t.co/QIZlXAozxV","date":"Sat Dec 25 20:28:15 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to be out last night at the Wicomico Eastside Chamber of Commerce Christmas Parade in Willards with Senator Carozza and Delegate Hartman! https://t.co/58ARBGmcSH","date":"Sun Dec 19 20:15:23 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to join Cambridge City Council President Lajan Cephas yesterday afternoon to read \"House Mouse, Senate Mouse\" to the children of the New Beginnings Youth and Family Services. This organization is doing a great job preparing these children to succeed! https://t.co/Qw2IatfNBe","date":"Fri Dec 17 00:48:58 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Well done by the brave men of the Harford County Sheriff's Office!","date":"Tue Dec 14 21:08:39 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a Navy veteran, go Navy, beat Army!","date":"Sat Dec 11 18:33:20 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Inflation is taxation!","date":"Fri Dec 10 19:03:45 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to panel with @MartyMakary last night on @FoxBusiness to discuss vaccine mandates and the new variant. https://t.co/lhvgyZ4avv","date":"Wed Dec 08 16:40:05 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we should all pause to remember all those brave men and women of the greatest generation.","date":"Tue Dec 07 15:27:52 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to meet up with the @FarmBureauMD President and some of the Eastern Shore county presidents at their annual convention reception last night. Looking forward to continuing our work together for Maryland's agriculture industry so important to the First District. https://t.co/2wadmX1aw3","date":"Mon Dec 06 16:44:15 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"In my decades practicing medicine I helped deliver thousands of babies, and it is incumbent upon all of us to protect those who have no voice.","date":"Wed Dec 01 17:41:28 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#HappyHanukkah to all celebrating the Festival of Lights! https://t.co/Uwxa2Fy0Yi","date":"Mon Nov 29 16:02:10 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Thanksgiving. Hoping everyone has a great day spent with family and friends! https://t.co/nbMpFBvWnD","date":"Thu Nov 25 18:57:32 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@GReschenthaler @RepPatFallon @RepDonBacon @MarioDB @RepMGriffith @RepTrey @RepMikeJohnson","date":"Fri Nov 19 19:12:33 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@RepJuliaLetlow @RepBryanSteil @RepJoeWilson @RepStefanik @RepLisaMcClain @RepJimBanks @RepTomRice @RepAdrianSmith @RepFitzgerald @RepFranklin @RepTimBurchett @RepWebster @CongMikeSimpson @brettguthrie @RandyFeenstra @RepMichaelGuest @RepGregSteube @Rep_Clyde @RepDanCrenshaw","date":"Fri Nov 19 19:11:33 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@RepRosendale @RepLarryBucshon @RepLoudermilk @RepHuizenga @RepJerryCarl @RepHartzler @michaelcburgess @RepGregPence @RepRickAllen @RepDavidKustoff @RepJackBergman @TomColeOK04 @RepWalorski @RepFredKeller @RepBost @RepDLesko @RepRonnyJackson @RepSamGraves @WarrenDavidson","date":"Fri Nov 19 19:08:08 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@RepMMM @RepBobGood @RepChipRoy @RepBarryMoore @RepBlaine @JakeLaTurner @boblatta @Lancegooden @RepSmucker @RepBradWenstrup @RepLaHood @RepGarretGraves @RepRickCrawford @RepRutherfordFL @RepDavidRouzer @CongressmanGT @RepMoolenaar @repkevinhern @RepMeijer @RepBenCline","date":"Fri Nov 19 19:05:34 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@RepAlexMooney @RepHerrell @RepThomasMassie @RepBlakeMoore @RepBuddyCarter @JeffFortenberry @RepBoebert @RodneyDavis @USRepGaryPalmer @virginiafoxx @RepBrianMast @RepRWilliams @RepAshleyHinson @RepWalberg @RepMcKinley @RepMikeRogersAL @DougLaMalfa @TXRandy14 @replouiegohmert","date":"Fri Nov 19 19:01:14 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks to the following members for their support: @RepBrianBabin @RepKatCammack @RepRichHudson @RepGrothman @RepJeffDuncan @Robert_Aderholt @congbillposey @RepTimmons @RepDLamborn @RepRalphNorman @CongressmanHice @RepTedBudd @RepAndyBiggsAZ @RepMaryMiller @RepSteveChabot","date":"Fri Nov 19 18:58:24 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Defending the conscience rights of healthcare providers should be of great interest to all Americans, and is of grave importance to me as a physician, especially in light of recent failures to do so by the Biden Administration. https://t.co/RIUMyx3zXx","date":"Fri Nov 19 18:52:45 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My full statement on this morning's vote: https://t.co/1A2Kxtfm00","date":"Fri Nov 19 17:38:44 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It will only add to inflation that's already a huge problem.","date":"Tue Nov 16 20:42:39 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congrats to my friend and neighbor, Gen. @RepScottPerry, on being elected the next Chair of @freedomcaucus. Under his leadership we will continue to work to cut spending, secure the border, curb inflation, fund our police, defend individual liberties, and DO WHAT WE SAID WE WOULD","date":"Tue Nov 16 17:24:05 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Inflation is taxation!","date":"Fri Nov 12 16:54:50 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Veterans Day to all who have served our nation in uniform. It was truly an honor to serve in the Naval Reserve for 17 years. Take time to thank a veteran for their service today. https://t.co/hT1hyXHNiz","date":"Thu Nov 11 17:08:03 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy birthday to the United States Marine Corps! https://t.co/qd7JAGA9Zu","date":"Wed Nov 10 17:53:07 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Inflation is taxation!","date":"Wed Nov 10 16:16:52 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Inflation is taxation!","date":"Tue Nov 09 15:03:01 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Inflation is taxation!","date":"Mon Nov 08 16:18:37 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We need infrastructure - but we also need to pay for it. Yesterday's infrastructure bill added hundreds of billions of dollars to the federal debt. We have to stop spending our children and grandchildren's money.","date":"Sat Nov 06 18:17:00 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"While Americans are paying the most at the pump in seven years, the Energy Secretary finds it comical to increase American oil production? She must forget that this administration is killing our net energy exporter status, AND they’re not done killing energy jobs just yet. https://t.co/4tlL4slMXP","date":"Fri Nov 05 15:22:48 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"From Maryland's First Congressional District nonetheless!","date":"Thu Nov 04 15:37:46 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to chat with the folks at @MidAtFarmCredit yesterday afternoon. They do a great job providing loans and other financial services to farmers and rural America. https://t.co/ShmOd8GkEG","date":"Thu Nov 04 12:00:51 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks to @RepRonnyJackson @RepMTG @RepCawthorn @RepJeffDuncan for joining me on this letter.","date":"Wed Nov 03 21:25:32 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Read my full letter here: https://t.co/K5ZdmXcZq8","date":"Wed Nov 03 21:24:42 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Vaccine mandates are jeopardizing workforce capacity nationwide, worsening the supply chain crisis, boosting already rampant inflation, and threatening the ability of emergency services to adequately respond to calls. Accommodations must be made. https://t.co/e4Luwjz2AI","date":"Wed Nov 03 21:23:50 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"\"It is an honor to be named Ranking Member of the Ag subcommittee. Agriculture is the economic backbone of MD’s First District, and I am very excited to work with this large constituency for both my district and across the country...\" @HouseAppropsGOP  https://t.co/F2Fab2cINa","date":"Wed Nov 03 19:55:47 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Gas at 7 year highs and possibly the most expensive Thanksgiving on record, but they want to spend more??? #inflationistaxation https://t.co/CxYrcpzmZx","date":"Tue Nov 02 16:21:02 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It's time to stop reckless spending, stop talking about raising taxes on our employers, and bring down the price of gas. https://t.co/g1USEsJkUF","date":"Thu Oct 28 16:00:50 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Proud to lead my @GOPDoctors colleagues in urging this administration to revise their vaccine mandate. It will lead to further supply crunches and short staffing issues in all sectors, most alarmingly healthcare.","date":"Tue Oct 26 19:35:39 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Research shows that a majority of people who misused a prescription medication obtained it from a family member or friend.\n\nTomorrow, join Americans nationwide in clearing out homes of unneeded medication and bring it to a collection site near you. https://t.co/h7XOwrg79N","date":"Fri Oct 22 16:21:04 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"246 years of honor, courage, and commitment to defending America’s interests on the high seas. As a Navy veteran myself, happy birthday to all my shipmates who have served or are now! https://t.co/97vAHDR1z9","date":"Wed Oct 13 16:29:35 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today on National Farmers Day, say thank you to all the men and women who put food on our tables, including the countless across Maryland’s First District. https://t.co/QwxIerpBgT","date":"Wed Oct 13 01:51:59 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The tax and spend Biden agenda is standing in the way of our economic recovery #inflationistaxation https://t.co/2Y0Sy5Bj0O","date":"Sat Oct 09 16:40:39 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"A win-win for the Lower Shore, Hardwire, and the American taxpayer! https://t.co/WZZOwQqdtJ","date":"Thu Sep 30 17:09:08 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank goodness school resource officers were present to quickly intervene, despite Democrat attempts to defund the police and ban school resource officers here in Maryland earlier this year.","date":"Wed Sep 29 20:34:43 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Last year, over 93,000 Americans lost their lives to drug overdoses - that's unprecedented and in part due to COVID-19 lockdowns. This #RecoveryMonth I'm standing with my colleagues in Congress to spread awareness and support those in recovery. https://t.co/dcD0zqD39o","date":"Tue Sep 28 19:16:12 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Promoting regular commercial and recreational harvest of these invasive species is a critical component of mitigating their spread in the Chesapeake Bay.","date":"Wed Sep 22 15:35:04 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Constitution Day! I am proud to defend our Constitutional rights and support our republican form of government here in Congress. https://t.co/qKZJt0Vc5V","date":"Fri Sep 17 18:34:57 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Big business is not the friend of everyday Americans, but is aligned with the liberal majority now. The @mdchamber didn’t invite the only Republican in the delegation to their federal congressional roundup. Pretty interesting, huh?","date":"Wed Sep 15 01:31:45 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My full statement on the 20th anniversary of the 9/11 terrorist attacks #NeverForget https://t.co/cgOb2nBwJd","date":"Sat Sep 11 12:37:43 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My full statement in reaction to President Biden’s speech last night: https://t.co/zhXcUFyoQR","date":"Fri Sep 10 18:25:29 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Stay safe out there!","date":"Wed Sep 01 02:56:25 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"\"Secretary Blinken’s complete and utter failure of managing this avoidable catastrophe makes him unfit for leadership, and I hope my colleagues will join me in pushing for his removal.\"\n\nMy full statement and details can be found here: https://t.co/Uyk5Zs3KFS","date":"Fri Aug 27 16:32:11 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Instead of making sure Americans and our troops are safe in Afghanistan, the President spent countless hours this week twisting Congressional arms to vote for his $5 trillion tax and spend plans. Unbelievable. Resign.","date":"Fri Aug 27 01:09:34 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"While Congress foolishly debates spending trillions of dollars here in Washington, hear what I had to say last week to the Dorchester County BoE about ensuring that dangerous and divisive critical race theory is not instituted in our local public schools. https://t.co/DWTbaz4nN1","date":"Tue Aug 24 21:35:32 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"\"I thank all the men and women in uniform who served and sacrificed in Afghanistan for freedom over the past two decades...\"\n\nMy full statement below:\n\nIf you are a veteran in crisis, help is available.  Call 1-800-273-8255 and press 1; or text at 838255. https://t.co/4G7AEq4Kea","date":"Tue Aug 17 13:52:02 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Georgia Mercer of Rising Sun High School for winning the 2021 Congressional Art Competition for Maryland’s First Congressional District. Her work is entitled “Angelfish.” https://t.co/SgVpV9WJCj","date":"Tue Aug 03 14:19:42 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great take away for those at risk or who live with those at risk. The House GOP Doctors Caucus had the opportunity to sit down with Dr. Makary yesterday. It was very informative and I highly recommend his recent piece in the Wall Street Journal.","date":"Fri Jul 30 13:17:01 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Pelosi mask policy lacks peer reviewed scientific backing and is a joke.","date":"Thu Jul 29 19:59:15 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Stay up to date with your local weather and stay safe!","date":"Thu Jul 29 18:37:06 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The House majority continues to block our amendments to their radical spending agenda. Hear what my Virginia colleague @RepBenCline and I had to say earlier this week with Congressman @RepAndyBiggsAZ below: https://t.co/zN3pk4KBmg","date":"Wed Jul 28 18:49:01 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Chase Kalisz of Harford County and Maryland’s First District for winning the first gold medal for the United States in the Olympic Games! https://t.co/jl71yQ3OSP","date":"Sun Jul 25 22:40:57 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We will once again try to restore these vital protections on the House floor next week. #HydeSavesLives","date":"Fri Jul 23 20:36:24 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I’m proud to have joined @RepTenney on an amicus brief to SCOTUS to overturn the NY restrictive concealed carry law. A successful ruling in this case could very well overturn the impossibly restrictive “good cause” requirements to obtain a CC license in many states including MD. https://t.co/qogvv8xenh","date":"Fri Jul 23 14:52:40 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a physician, I am proud to defend taxpayers and healthcare providers from being forced to violate their conscience. We must retain Hyde and Weldon in our appropriations funding.","date":"Wed Jul 21 17:04:02 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to @huskiespatmill and @QACPSMD QAC High School for winning their respective high school softball state championships! It was great to meet them last night and chat with both teams about their undefeated seasons. Way to go! Thanks @Nationals https://t.co/9bvfWd8IMc","date":"Wed Jul 21 16:27:09 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...they have to actually stop crime and criminals if they choose to get those grants.  Defunding the police is why Baltimore is on track for another record-breaking murder rate. (2/2)","date":"Fri Jul 16 00:30:39 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today, once again the majority on the House Appropriations Committee is defunding the police by placing very expensive requirements on our law enforcement agencies that receive important federal law enforcement grants - which will actually reduce the amount of money...(1/2)","date":"Fri Jul 16 00:30:26 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Democrats have broken 45 years of bipartisan compromise by stripping preventions for using taxpayer funds for abortion, and by removing conscience protection for health providers. We must push back on this radical pro-abortion agenda. #hydesaveslives https://t.co/RXeffg416S","date":"Thu Jul 15 19:49:19 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a son of parents who fled communism, I heard many stories about the basic human rights violations. The calls for freedom by the Cuban people are inspiring - and I stand with them in their quest to escape the evils of communism. https://t.co/XD3xKJPo75","date":"Mon Jul 12 18:27:22 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Stay alert on the Middle and Lower Shore!","date":"Thu Jul 08 11:25:23 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Wishing everyone a safe and pleasant Independence Day! https://t.co/zuSg6SeP5S","date":"Sun Jul 04 14:51:46 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"That's right, because one is healthcare related and the other is a deadly procedure resulting in 100% mortality for the baby.","date":"Thu Jul 01 16:46:42 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Especially in low risks populations, the decision to get vaccinated should be left to patients in consultation with their physicians, not mandated by a university bureaucrat. @newsmax https://t.co/jkI1QfUwSf","date":"Tue Jun 29 14:58:10 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Students, their parents, and their physicians should be deciding whether the risks of vaccines outweigh the benefits – not a university bureaucrat or a government public health official. (2/2)","date":"Fri Jun 25 17:14:22 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Since the Governor hasn’t stopped college student vaccine mandates following the latest scientific developments and warnings from the CDC on myocarditis, I sent this letter today to the chancellor of @Univ_System_MD...(1/2) https://t.co/goFLBMEFrN","date":"Fri Jun 25 17:13:58 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Once again I am calling on the Hogan Administration to suspend vaccine mandates on higher education campuses given the CDC investigation of over 1200 cases of myocarditis/pericarditis in vaccinated youth. https://t.co/QUt3lS1nRW","date":"Thu Jun 24 14:22:43 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We need to get to the bottom of what the Chinese were hiding with COVID-19.","date":"Thu Jun 24 13:25:00 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Last night, I called for the immediate consideration of the No Taxpayer Funding for Abortion Act. At a time when Joe Biden and pro-abortion Democrats want federal dollars to directly fund abortion for the first time in nearly 50 years, it’s critical that we pass this legislation. https://t.co/m4DpSJIpYA","date":"Wed Jun 23 13:59:08 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Father’s Day to all the amazing dads out there! https://t.co/fdzlnpm3Z4","date":"Sun Jun 20 14:44:19 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"🚨🚨🚨\n\n9-0. \n\nToday’s decision makes clear once again that the government has no right to discriminate against or infringe upon the rights of religious organizations because of their beliefs or practices.","date":"Thu Jun 17 14:46:39 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Maryland should suspend vaccine mandates on higher education campuses until the myocarditis data can be further evaluated and reviewed by the CDC. https://t.co/HUiR5jZnqe","date":"Tue Jun 15 17:03:18 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Flag Day!","date":"Mon Jun 14 18:46:41 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great footwork and way to finish @MarvenlyF. Awesome to hear that Wicomico High School will receive a $1500 equipment grant from USA Football in recognition of your play.","date":"Tue Jun 08 14:57:52 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Attention high schoolers in Maryland’s First District, I will be holding a military service academy information session June 15th. More details and how to rsvp here: https://t.co/NmDc4insG7","date":"Fri Jun 04 20:49:00 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a true honor to be the keynote speaker at the American Legion Post 91 Memorial Day celebration in Cambridge today. We will never forget those who have laid their life down in service to our great nation. https://t.co/Ff3l4r1wzB","date":"Mon May 31 19:34:07 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we honor all those who have laid their life down in service to our nation. May God bless those patriots and their families for their ultimate sacrifice. 🇺🇸 https://t.co/aZ6XWzzeaS","date":"Mon May 31 12:56:19 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"So the Wuhan Institute of Virology may indeed have been doing gain-of-function research, and hundreds of thousands of NIH dollars went to the WIV.  https://t.co/PFUv086r06","date":"Wed May 26 13:39:58 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Just follow the science, please.","date":"Fri May 21 00:51:06 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'm proud to stand with Israel!","date":"Thu May 20 14:41:44 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The last thing we need right now is another partisan stunt from Speaker Pelosi. Multiple investigations into January 6th are already taking place. https://t.co/1YJBuIB77h","date":"Wed May 19 23:25:57 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Go figure. President Biden is rubber stamping a Russian pipeline after shutting down American pipelines that promote our nation’s energy independence...","date":"Wed May 19 19:19:02 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'm proud to be co-leading this resolution. Continuing mask mandates in the House denies scientific reality and hurts public confidence in the safety and efficacy of the vaccines. We must be allowed to return to life as normal.","date":"Wed May 19 17:25:52 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I stand with Israel 🇮🇱 and support their right to defend themselves. President Biden’s weak leadership and soft attitude toward Iran are only emboldening the terrorists hellbent on wiping Israel off the map. (2/2)","date":"Tue May 18 20:16:23 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Statements that rewrite history after the myriad successes under President Trump in resolving the long-standing Israeli-Arab states conflict are disingenuous and failing to address the current crisis in the Middle East. (1/2)","date":"Tue May 18 20:15:13 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks to Governor Hogan for his decision to remove the statewide mask mandates, which we requested yesterday. Today’s announcement makes even more sense than the CDC guidance.","date":"Fri May 14 23:07:59 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Removing any incentive not to seek work is the number one priority of businesses across my district and the state, as they are still struggling to hire when potential employees can make as much or even more not working with no strings attached. (2/2)","date":"Fri May 14 16:58:49 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My thanks to @GovLarryHogan for reinstating this requirement. Mandating that collecting unemployment benefits requires an individual to actively search for a job is critical to getting people back to work. (1/2) https://t.co/RyY1QvgQO0","date":"Fri May 14 16:58:36 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I urged @GovLarryHogan to swiftly relax the government restrictions on mask wearing for vaccinated Marylanders. https://t.co/nXt4IQLK9J","date":"Thu May 13 21:02:20 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It's about time @CDC started following the science, now it's time for state and local jurisdictions to do the same. This will be great for our local economy.","date":"Thu May 13 19:18:51 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was fitting that we honored the life and sacrifice of Cpl. Heacook during National Police Week. Please join me in praying for his family during this challenging time. https://t.co/ik15MgmcIS","date":"Thu May 13 15:21:37 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It’s disappointing that cancel culture is alive and well at Salisbury University, where an opposing political viewpoint was defaced. As Americans, we MUST be able to agree to disagree, especially at academic institutions. https://t.co/cM9VaTuBYr","date":"Tue May 11 18:19:12 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Yesterday we honored the life and sacrifice of a dedicated public servant. God bless Corporal Keith Heacook and his family. EOW: April 28, 2021. https://t.co/XmLU8UpcVl","date":"Tue May 11 14:05:00 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Mother’s Day to all the moms out there who gave us life and love us unconditionally! https://t.co/lBWrrnSVqr","date":"Sun May 09 19:24:34 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Sec. Cardona made clear today that this Administration supports a nationwide change in policy to allow biological males to compete in female sports. This is a slap in the face to Title IX and to all the young women around the country who deserve equal opportunities in athletics. https://t.co/6Jbt5kaKYf","date":"Wed May 05 20:34:16 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks very much to the dedicated health staff at the clinic as well as members of the local volunteer fire department and @MDNG for their work. Also it was great to chat with Mayor Marion, County Executive Hornberger, and other local officials while there. (2/2)","date":"Mon May 03 19:59:52 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was great to join the Cecil County Health Department in Rising Sun today to administer COVID-19 vaccines. Every individual 16 and older is eligible and I encourage folks to register and get vaccinated, especially our most vulnerable... (1/2) https://t.co/iGxMmmqZRg","date":"Mon May 03 19:59:07 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Corporal Heacook, a dedicated Delmar police officer, died today. Too bad the President didn’t reject defunding the police tonight, and condemn the violence that’s occurring on America’s streets against our brave men and women in blue.","date":"Thu Apr 29 02:38:17 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My prayers are with the family of Cpl. Heacook tonight. He has sadly passed away after being viscously beaten while responding to a call. He laid his life down in service to Delmar and Wicomico/Sussex County-God bless he and his family for their sacrifice. https://t.co/GlY7d91aZU","date":"Thu Apr 29 00:06:51 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On this date in 1788, Maryland ratified the Constitution and was admitted to the union. I am proud to serve this incredible state. https://t.co/DNdeKRPy3Q","date":"Wed Apr 28 21:30:17 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I've administered many COVID-19 vaccines and after studying the data and following Operation Warp Speed closely, I'm confident these vaccines are safe and effective. Every Marylander over 16 is eligible, so please register or walk up where available. https://t.co/p4UT1BstuH","date":"Tue Apr 27 21:53:57 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Caz Kenny and the folks at @BlackwatersEdge know everything about snakehead fishing. The bite is getting hot and remember, DNR encourages anglers to kill and harvest these invasive species. https://t.co/ya634jskwj","date":"Tue Apr 27 14:20:17 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It's been a pleasure lending a hand to help get Marylanders vaccinated. I encourage individuals, especially those most vulnerable, to get vaccinated as soon as they are able to.","date":"Tue Apr 20 19:20:59 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...I will continue to work to ensure that my local seasonal businesses and the many American workers they employ are able to bring in the temporary foreign workers they need to meet their seasonal labor demands. (2/2)","date":"Tue Apr 20 16:43:47 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"While I appreciate the Secretary acting on my request and providing some relief, I am concerned that this number will be insufficient to meet the full demand of our seasonal employers as we come off the pandemic. (1/2) https://t.co/KHSesDlpIy","date":"Tue Apr 20 16:43:24 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"They said it wasn’t their goal on the campaign trail, but in less than a week President Biden has commissioned a study and Congress has introduced direct legislation to pack the Supreme Court. https://t.co/QIWVcG6r2L","date":"Thu Apr 15 22:41:37 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...I look forward to formally resolving this issue soon so we can start to control this invasive species while helping our watermen by creating a viable market in the Chesapeake region. (2/2)","date":"Thu Apr 15 15:25:22 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I've had productive discussions with @USDA regarding the burdensome and inefficient blue catfish processing inspection requirements. (1/2) https://t.co/y3mPSB3MAH","date":"Thu Apr 15 15:24:57 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@SBAList @SteveScalise @Kat_Cammack @RepAnnWagner Proud to sign on!","date":"Wed Apr 14 20:42:15 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was great to lend a hand this morning at the Talbot Community Center. I encourage all those elderly and at high risk to register and get vaccinated, as we are turning the corner on this pandemic. Thanks to the County Health Dept. and members of the @MDNG for their efforts! https://t.co/Iok1YPA1zr","date":"Fri Apr 09 18:56:18 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This is worrisome.","date":"Wed Apr 07 19:56:08 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Calling all high school artists across Maryland’s First District, there are three weeks remaining to submit artwork for this year’s Congressional Art Competition. Details can be found below: https://t.co/q7s0i4uM7u","date":"Tue Apr 06 19:33:43 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...here in MD didn’t stop it, and it wasn’t an “assault rifle.” Maybe we should just enforce our current gun laws.","date":"Mon Apr 05 14:52:37 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Mass shooting in Baltimore City yesterday-but no national news reporting about it. I guess some of the nation’s strictest gun laws (including universal background checks) https://t.co/4oDs1rwMYl","date":"Mon Apr 05 14:52:23 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Easter to all, He is risen! https://t.co/oFrteK8bZ4","date":"Sun Apr 04 15:34:20 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I appreciate Governor Hogan’s support for my appropriations amendment which gives @DHSgov the authority to release additional H-2B visas when the need is there for a strictly enforced temporary foreign worker.","date":"Fri Apr 02 16:34:23 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a pleasure to lend a hand for the day and I look forward to next time! In the meantime I encourage all Marylanders to get pre-registered and get vaccinated once eligible. https://t.co/bdQHYCH5CD","date":"Thu Apr 01 16:24:50 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...as more and more vaccine is available for distribution each day. Register here: https://t.co/5IxHTJkUbp OR 1-855-MD-GOVAX","date":"Wed Mar 31 21:01:38 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was great to join the hard-working and dedicated staff administering COVID vaccines at the Wicomico Youth and Civic Center today. Thanks to all of them for their efforts. For everyone on the Shore and across Maryland, please get pre-registered online or over the phone... https://t.co/P94Se5MfOv","date":"Wed Mar 31 21:01:15 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Attn. Mid and Lower Shore residents, I’m at the Wicomico Civic Ctr. today giving vaccines at the mass vax site. Are you pre-registered? Appointments are available for today, so get pre-registered, and you will be contacted with an appt. https://t.co/5IxHTJCvzZ OR 1-855-MD-GOVAX","date":"Wed Mar 31 15:00:07 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to all Vietnam Veterans on this day! https://t.co/7QZSdFlQ8I","date":"Mon Mar 29 18:50:57 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...has “no public safety value.”  Instead of essentially nullifying state law on her own accord, the Baltimore City State’s Attorney should be doubling down rather than encouraging any crime in one of America’s most dangerous cities. We have to restore the rule of law.","date":"Mon Mar 29 12:51:11 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"After a one year trial run, which laughably resulted in less arrests (of course), Baltimore’s top prosecutor (who also is under federal investigation) announced formal action to no longer prosecute drug possession crimes, prostitution, and trespassing because prosecuting those...","date":"Mon Mar 29 12:50:35 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy #MarylandDay","date":"Thu Mar 25 21:02:05 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"From the corn and soy growers to the poultry farmers - and everywhere in between, say thanks to our Maryland farmers on National Agriculture Day. https://t.co/nPZUVAv5q4","date":"Tue Mar 23 19:38:15 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This is why our southern border must be secured!","date":"Mon Mar 22 21:59:47 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Regardless of what this congregation did, the government has no right to just shut them down. Anything along that line is a clear and gross violation of a First Amendment freedom. https://t.co/bmmbva7l6B","date":"Mon Mar 22 16:35:59 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We have many heroes protecting us on the thin blue line - Amy Caprio was truly one of them. https://t.co/KzdN73me7M","date":"Mon Mar 22 14:10:56 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Earmarks are the gateway drug to more spending and bad policies.  We certainly don’t need that in Congress.","date":"Thu Mar 18 20:24:10 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks to Operation Warp Speed, at the unofficial one year mark since this pandemic suddenly changed our lives, tens of millions of Americans are vaccinated and we are well on the way to turning the page and declaring victory.","date":"Tue Mar 16 21:04:04 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a pleasure to join the Harford County Health Department in administering COVID-19 vaccines to individuals today. https://t.co/xGfdYPMbHb","date":"Tue Mar 16 21:03:41 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@RobWittman and I are urging the Department of Homeland Security to use the legal authority granted to them to quickly release additional H-2B visas to support our struggling seafood processors in the Chesapeake region as we approach the high season. https://t.co/bC3gbbW9qA","date":"Fri Mar 12 20:42:43 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on yesterday's progressive bailout https://t.co/JgbfiQ6bxX","date":"Thu Mar 11 15:23:26 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we honor the life of an extraordinary American patriot. Here’s some great info on her amazing life and the National Park bearing her name in the heart of Maryland’s Eastern Shore #HarrietTubmanDay https://t.co/bl2Xcpcc8z","date":"Wed Mar 10 15:37:05 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The crisis on our border is growing by the day, and President Biden and his catch and release policies are endangering American health and rewarding those who break the law and cut the line. https://t.co/TvRYQw7vl0","date":"Tue Mar 09 18:32:51 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Bureaucracy cannot get in the way, the mountains of evidence support a delayed second dose to allow for a maximum number of vaccine recipients. HHS must untie the hands of governors. @RepGregMurphy @RepMMM https://t.co/2G00dD8TIB","date":"Sun Mar 07 18:41:30 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I join Sheriff Lewis in supporting the Second Amendment rights of the First Congressional District https://t.co/Daw8mNvDJ0","date":"Thu Mar 04 17:20:25 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Proud to have served in the Navy Reserve for nearly 17 years. Happy birthday shipmates, serving our nation alongside you was a true honor! https://t.co/lqd0ykNPqx","date":"Wed Mar 03 18:28:07 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the COVID “relief” bill: https://t.co/7F4MVVvnS1","date":"Sun Feb 28 00:15:41 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"WRONG https://t.co/SUtxgO8ZHd","date":"Fri Feb 26 17:32:33 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Three Connecticut girls are suing after losing their chance at a state championship to biological boys. The so-called Equality Act would enshrine this unscientific doctrine nationwide. The former Psychiatric head at Johns Hopkins summarized it best: https://t.co/9O6v8YlRFx","date":"Thu Feb 25 17:58:19 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will never support earmarks!","date":"Wed Feb 24 20:10:49 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Pres. Biden: “What would they have me cut?” How about we start with the $100 million rail project in Nancy Pelosi’s backyard? #pork https://t.co/9unpJWMjAv","date":"Wed Feb 24 19:31:47 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Given the newly confirmed data, Maryland should immediately move to a single dose vaccine regimen to maximize the number of people getting vaccinated. https://t.co/j7glVkbqA3","date":"Fri Feb 19 20:55:13 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Proud to support this legislation, which would give parents the option to redirect school funds towards the option they think is best for their children.","date":"Thu Feb 18 21:23:57 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I’m glad the Senate show trial is over early. The outcome was never in doubt, and the Senate time would have been much better spent on helping unemployed Americans, our suffering small businesses, getting more vaccines, and getting our children back in schools.","date":"Sun Feb 14 02:04:40 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I call on all counties in the First Congressional District to immediately reopen and resume in-person instruction. https://t.co/qqs9wjH1u9","date":"Fri Feb 12 21:42:24 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"One day a week is a paltry attempt to satisfy the unions - parents are at the breaking point and our children are suffering. The science says schools can reopen safely.\n\nhttps://t.co/cSl14CmoTA","date":"Wed Feb 10 19:15:44 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Proud to support this legislation that will make Maryland jurisdictions think twice about becoming sanctuaries for illegal immigrants.","date":"Mon Feb 08 22:44:39 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today my colleagues and I sent letters to multiple postal district managers serving Maryland, including the Baltimore district manager. We must uncover specific answers to the recent delays in mail delivery that effect so many residents in the First District. https://t.co/h9WaoMXNaR","date":"Thu Feb 04 22:38:40 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"President Biden’s CDC Director highlights data suggesting schools can safely go back without teacher vaccinations. It’s time Maryland counties immediately re-open schools. https://t.co/dIkXOPNrOG","date":"Wed Feb 03 21:13:19 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"While pro-abortion extremists in DC attack the Hyde amendment, a majority of Americans (58%) across the political spectrum oppose using taxpayer money to fund abortions in the United States. I am proud to stand for life.","date":"Fri Jan 29 20:45:05 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to hear bars and restaurants are now allowed to remain open beyond the previous 10pm curfew! Science clearly showed they, like schools, are not the dangerous places of spread.\n\nhttps://t.co/YAxOccqSqL","date":"Thu Jan 28 23:59:55 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am proud to co-sponsor this resolution honoring our National Guardsmen. Especially in light of how they had been treated, they need and deserve our support. https://t.co/j6yQFtzBYt","date":"Thu Jan 28 19:32:46 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we remember the millions persecuted for their faith during World War II. We will never forget. https://t.co/X4LVzzN1mk","date":"Wed Jan 27 20:06:38 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a veteran, I’m glad to see this was resolved. However, this was a disgrace that should’ve never happened in the first place. https://t.co/KfUnOJA4tV","date":"Fri Jan 22 20:47:19 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On this sad day, the anniversary of Roe v. Wade, we reflect on the countless lives lost to abortion. I am proud to defend life in Congress and remain committed to ensuring every life is cherished and respected, and will fight to end abortion. https://t.co/FgiCOi89uo","date":"Fri Jan 22 19:16:57 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@councilmanavj I will not resign. It's hypocritical of you to say I should when you didn't say so in 2017 to other members of Maryland's delegation. The \"tolerant\" left is at it again with their cancel culture politics. https://t.co/OLf1j9ZLuv","date":"Thu Jan 21 23:58:39 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"State Senator and former State Senate President Mike Miller dedicated his career to his Southern Maryland constituents and the people of Maryland. I’m saddened to hear of his passing today.  My and Nicole’s condolences to his family.","date":"Sat Jan 16 00:35:51 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"https://t.co/sLbbh5WbkR","date":"Wed Jan 13 21:49:23 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The men and women of the United States Capitol Police are true professionals and do a tremendous job keeping us safe. I am committed to ensuring this perpetrator is caught and faces the full brunt of the criminal justice system.","date":"Fri Jan 08 21:09:13 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am devastated to hear of the passing of Officer Brian Sicknick. His entire family is in Nicole and I’s prayers.","date":"Fri Jan 08 21:08:56 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@Reporterroblang @mapgirl18 No fist fight, no violence - just the news getting it wrong again https://t.co/pQi7mrWCtR","date":"Thu Jan 07 19:50:51 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on yesterday's Electoral College vote count and mob violence in the Capitol Building: https://t.co/aoXFITra0A","date":"Thu Jan 07 18:35:46 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Looking forward to working with @RepBradWenstrup to formulate patient-centered healthcare policy this Congress!","date":"Tue Jan 05 19:37:21 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Nicole and I send our sincerest condolences to @RepRaskin and his entire family with the loss of their beloved son. I understand he was a bright and passionate young man, and the Raskin family is in my prayers during this difficult time.","date":"Fri Jan 01 18:57:08 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I wish everyone a happy, healthy, and blessed new year! https://t.co/YwKGM34lCC","date":"Fri Jan 01 16:51:02 +0000 2021","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Merry Christmas to all from my family to yours! https://t.co/USXCjW502k","date":"Fri Dec 25 18:06:50 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"https://t.co/c3PnnQWlDd","date":"Tue Dec 22 03:09:23 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The science says restaurants are not significant contributors of COVID spread. Shutting them down is wrong and I’m glad to see Maryland judges are starting to agree. \n\nhttps://t.co/6O2UwVxaPA https://t.co/ABBvHEejGk","date":"Wed Dec 16 21:33:54 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Attention watermen: CARES Act funding is available for those in the fishing industry negatively impacted by the pandemic.  The application, administered by DNR, is below:\n\nhttps://t.co/9fR8LgMg9U","date":"Wed Dec 16 18:36:19 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Army West Point on their victory. Now on to bigger things for all the seniors who played tonight 🇺🇸","date":"Sun Dec 13 00:04:09 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"May the best team win! #beatarmy https://t.co/Ommnivz2QZ","date":"Sat Dec 12 20:04:00 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Hanukkah to all! https://t.co/tAlJxl1xXz","date":"Sat Dec 12 01:26:22 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...Our bill will allow for rigorous and reputable clinical research on the efficacy of medical marijuana, as well as other potential uses.  It’s critical we do the research first, because as a physician, anything that’s scientifically proven useful I want for my patients.","date":"Wed Dec 09 20:36:57 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today’s passage of the Medical Marijuana Research Act is a far better approach than last week’s marijuana legislation that would legalize this substance across the U.S. - despite the multiple serious issues clearly and consistently highlighted by Dr. Volkow and @NIDAnews https://t.co/TRJJ5IeFIx","date":"Wed Dec 09 20:36:30 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"https://t.co/55oumgjYLx","date":"Mon Dec 07 23:47:16 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Speaker Pelosi today admitted that she held up COVID relief until after the election. And yet even after, her priorities in the House this week were legal marijuana and Tiger King bills??? #Shameful #doyourjob","date":"Fri Dec 04 20:49:42 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Well said Senator Carozza, natural gas is a win for Somerset County, lower Delmarva, and the environment.","date":"Mon Nov 30 14:58:10 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Thanksgiving to all! https://t.co/T2krUxOWuy","date":"Thu Nov 26 15:00:08 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a former Naval officer, I wish a happy Veteran’s Day to all current and former members of the United States military. Your service and sacrifice has made us the most powerful and prosperous nation the world has ever known. God bless you for your service and dedication!","date":"Wed Nov 11 14:50:20 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Attention watermen: CARES Act relief funding for the fishing industry is now available through the DNR. Info can be found here:\n\nhttps://t.co/mAtWngOjBc","date":"Thu Nov 05 22:41:30 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Justice Barrett on her confirmation to serve on our nation’s highest court. Her skill and demeanor throughout this process was unparalleled, and I am confident that she will serve our nation well for decades to come. https://t.co/OI3gBvS9d5","date":"Tue Oct 27 01:12:08 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Even the liberal New York Times is now saying children are not significant spreaders of COVID-19. Its about time we open all of Maryland’s schools - anything less is harming our children and kowtowing to the teachers’ unions. https://t.co/o1I0oIGprO","date":"Fri Oct 23 17:29:40 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Second stop was at The Coastal Salt Restaurant on the Boardwalk to discuss J1 temporary worker visas, how the proposed offshore wind project could adversely affect horshoe crabs, and PPP loans with local business leaders. Thanks to Senator Carozza and Del. Hartman for joining! https://t.co/FQ2lef6h1y","date":"Sat Oct 17 17:56:09 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to be on the lower shore yesterday! Started out at the OC commercial fishing harbor to discuss federal regulation of the seafood industry and the importance of horshoe crabs for developing a safe COVID vaccine with local watermen. Thanks to Sea Born Seafood for hosting! https://t.co/UV0BT4EQjM","date":"Sat Oct 17 17:55:22 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to see Drug-Free Communities Cecil getting national recognition from First Lady Melania Trump for their years of great work in preventing substance-abuse on the upper shore. Congratulations!","date":"Fri Oct 16 19:32:18 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Hand washing is a very effective way to stop the spread of viruses. Especially during this pandemic, let's be sure to practice good hygiene for the protection of ourselves and others. #KeepHandsClean \n\nhttps://t.co/f8ZtNnn1EI","date":"Thu Oct 15 18:31:08 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Anchors aweigh!","date":"Tue Oct 13 14:43:52 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great opportunity for our local fire companies to receive supplemental funds to use in service to our communities. My office is happy to assist as well!\n\nhttps://t.co/ulWcxQ5Nts","date":"Tue Oct 06 17:16:21 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great news in Maryland, no COVID deaths in the last 24 hours. As the data keeps coming in it grows ever more clear that it's time to open schools and all businesses.\n\nhttps://t.co/uO41HBrsir","date":"Thu Oct 01 16:53:26 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to my constituent Madison Grimes for being awarded the Lifesaving Medal of Honor by the Girl Scouts of America. Recently, while on vacation, Madison saved a young boy from drowning in a pool. Well done! \n\nhttps://t.co/zNVj64N8EY","date":"Mon Sep 28 17:49:13 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on President Trump’s nomination of Judge Amy Coney Barrett to serve on the Supreme Court: https://t.co/xRm88q3uw4","date":"Sat Sep 26 22:13:18 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"After a virtual visit with the NIH today, it’s clear that Operation Warp Speed harnesses all the great advances we have made at the NIH to get us a safe, effective vaccine in record time.","date":"Fri Sep 25 21:02:54 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Bayside Elementary in Queen Anne's County and Hampstead Elementary in Carroll County, both in the First Congressional District, for being named 2020 Blue Ribbon schools by @usedgov \n\nWell Deserved!\n\nhttps://t.co/CuFaU3tGrZ","date":"Thu Sep 24 18:39:15 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks to President Trump and #OperationWarpSpeed we have dramatically reduced the fatality rate of COVID-19.","date":"Thu Sep 24 01:08:26 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"With all the work Congress should be doing, taking valuable time to legalize a gateway drug to opioid use would not have been a good idea.","date":"Thu Sep 17 18:26:46 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Constitution Day! https://t.co/gBcYjOef2Y","date":"Thu Sep 17 16:14:59 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Trump Administration is leading the charge with #OperationWarpSpeed. As doctors, @DrPhilRoe @RepBradWenstrup @RepLarryBucshon and I are confident America is on the cusp of a medical breakthrough. \n\nhttps://t.co/gxsRCoquxA","date":"Wed Sep 16 21:33:21 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Outdated or expired prescription drugs are a danger to youth in the home, please dispose of them properly and responsibly.","date":"Wed Sep 16 16:52:45 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations Trooper Ramsay!","date":"Wed Sep 16 14:23:28 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As doctors serving in Congress, we know and trust and #OperationWarpSpeed is critical to resuming our daily lives. This ultimate public private partnership has our nation on the cusp of a medical miracle, and once approved, millions of doses will be available immediately. https://t.co/GalXQcxlku","date":"Wed Sep 16 12:41:22 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Once healthcare workers and high risk populations get the vaccine #IWILLTAKEIT\n\n#OWS skips no steps-rather billions in federal investment are allowing all required trials to take place at the same time, in addition to producing millions of doses of a potential vaccine in advance. https://t.co/TNu6dzYNCh","date":"Wed Sep 16 00:13:39 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On top of vaccine development, #OperationWarpSpeed is enabling the rapid roll out of safe and effective treatments for COVID-19, and already two are FDA authorized. Thanks to #OWS we have drastically cut the COVID-19 mortality rate and are improving outcomes across the board. https://t.co/4QUsvwvpz2","date":"Tue Sep 15 22:38:20 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Trump Administration's #OperationWarpSpeed is harnessing the power of science and American ingenuity to produce a safe and effective COVID-19 vaccine in record time. https://t.co/wfDexkdMup","date":"Tue Sep 15 19:56:43 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we remember the 3000 lives senselessly taken in an act of terror. This was attack on all we stand for-the liberties and institutions we have defended for centuries. The sacrifices made by so many that day represent the best of America. Today we again pledge to #neverforget https://t.co/RiEjNgZcQ1","date":"Fri Sep 11 17:30:55 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Labor Day!","date":"Mon Sep 07 15:57:14 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"FACT: Every 15 minutes, a person dies from an accidental opioid overdose. Talk to your doctor. Talk to your pharmacist. Talk to your loved ones. Get overdose reversal medicines. Take a Stand. Learn more at https://t.co/SG9ElyYzvV #IOAD2020 #CutOutOverdoses","date":"Mon Aug 31 19:15:16 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to join the Taylor's Island Volunteer Fire Company yesterday for their new fire engine pit beef fundraiser. While there I had the opportunity to present John Butz a Congressional Citation for his steadfast support for the fire company and community at large. https://t.co/lO8nJP4Y4s","date":"Mon Aug 31 17:15:11 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our NATO ally Hungary’s commitment to increasing defense spending and capabilities is strengthening the alliance. President Trump is successfully pushing our allies to pay their share, instead of the hard-working American taxpayer.","date":"Mon Aug 24 20:11:43 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Any talk of legalizing recreational marijuana is a bad idea, especially in the midst of an opioid abuse and addiction crisis, worsened by COVID.","date":"Fri Aug 21 17:24:37 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We must continue our efforts to prevent substance abuse during this pandemic.\n\nhttps://t.co/TXfWCjfj7w","date":"Thu Aug 20 19:43:29 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Yet another reason recreational use of marijuana should not be allowed.\n\nhttps://t.co/p7IeAfiCA3","date":"Tue Aug 11 16:16:08 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great to hear that Mrs. Bhaskaran of @wcboejmb has been selected to receive a Presidential Award for Excellence in Math and Science Teaching! Congratulations on the award and hope to meet you at the TBD awards ceremony in the future!","date":"Wed Aug 05 20:42:35 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Normally it takes years and years for a vaccine - with the administration’s Operation Warp Speed we may have a vaccine approved and hundreds of millions of doses ready just a few months from now #WarpSpeed","date":"Tue Aug 04 20:29:28 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks to the Governor for realizing the importance of private education in Maryland.","date":"Mon Aug 03 22:50:28 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I believe our schools can, and should rise to the occasion of re-opening for in-person education this fall. The education of our children is essential, and the science says it can be done safely, in accordance with CDC guidelines. https://t.co/6JKUT4e3fo","date":"Mon Aug 03 19:16:10 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"According to the NIH, the WHO, and the American Lung Assoc., marijuana is MORE dangerous with COVID - it is NOT a treatment. Yet Speaker Pelosi insists on marijuana provisions in a COVID bill for the American people?","date":"Mon Aug 03 15:42:36 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Proud to be an original co-sponsor of this resolution to support our nation's law enforcement!","date":"Fri Jul 31 14:53:08 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The judge is playing politics by removing the FDA REMS safety restriction for a potent abortion drug that is 100% fatal to the baby during a medical abortion - the only one removed from the REMS restriction list among dozens of other dangerous medications. @stevefda must appeal!","date":"Mon Jul 20 16:37:55 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@EleanorNorton The process of educating Congress about how dangerous this initiative is has begun. DC has enough of a drug abuse problem without becoming the drug capital of the country. \"Warrioronthehill\" should be fighting AGAINST drug use, not FOR it.","date":"Wed Jul 15 19:12:53 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...in dealing with the federal government, and I always encourage those having issues to reach out!  Regarding Eastern Neck, the job opening and description are below:\n\nhttps://t.co/2apV5Nu6mZ","date":"Tue Jul 14 20:07:41 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"After nearly two years, I am pleased that we were finally able to secure a full time staff position for Eastern Neck National Wildlife Refuge in Kent County.  My staff and I are always here to serve the constituents of the First Congressional District...","date":"Tue Jul 14 20:07:29 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Just a reminder that tax filling and payments are now due this Wednesday, July 15th, as a result of the Treasury Department and IRS deferring the deadline from the typical April date. More info can be found here:\n\nhttps://t.co/BextnW5TrE","date":"Mon Jul 13 16:28:00 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...for snakehead eradication efforts in the Chesapeake Bay watershed.","date":"Fri Jul 10 15:50:50 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I’m pleased that today the House Appropriations Committee adopted my amendment to the Interior Appropriations bill, which supports using $250,000 for continued collaborative efforts between the Fish and Wildlife Service, the Maryland DNR, and NOAA...","date":"Fri Jul 10 15:50:28 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We should not be using hardworking taxpayer dollars to pay a UN agency to support abortion overseas, especially the coercive \"one child\" Communist Chinese forced abortion policy when it was in place. https://t.co/TGhEXAyWXh","date":"Thu Jul 09 18:58:53 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...That’s why this is purely an unconstitutional partisan power play that steals what should rightfully be returned to Maryland, just like Congress returned DC land back to Virginia in 1847. GIVE IT BACK!!","date":"Fri Jun 26 15:44:01 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The purely political ploy of the DC statehood bill today is exposed.  If this were really about voting rights, then the majority would support giving Maryland’s land back. But none of the majority does... https://t.co/Cq2cH2OwB6","date":"Fri Jun 26 15:43:45 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I thank the Trump Administration for sparing seafood processors from this moratorium. These workers support countless American jobs and businesses in the First District.\n\nhttps://t.co/9cTBsh1X8Z","date":"Tue Jun 23 15:33:23 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks to Amanda and Edward for making sure members of our Lower Shore communities are counted this census.","date":"Mon Jun 22 21:04:58 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...These businesses are the lifeblood of our Main Street Maryland communities and I remain committed to helping them get through this pandemic.","date":"Wed Jun 10 23:06:34 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Glad to hear that Governor Hogan has heeded the pleas of countless businesses across the First District and entire state of Maryland to allow indoor dining at 50% capacity and outdoor amusements with safe social distancing...","date":"Wed Jun 10 23:06:00 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As co-chair of the House Hungarian Caucus I add my thanks as well!","date":"Mon Jun 08 20:57:02 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"76 years ago the allied forces stormed France to begin the invasion of Europe. Their bravery in the face of danger defined a generation, and helped bring an end to tyranny. God bless them for their courage and sacrifice!","date":"Sat Jun 06 20:41:13 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Marylanders should never delay getting needed medical care, as it could lead to complications or long-term health problems. Our hospitals have seen declines in COVID admissions, and are safe, ready, and waiting to address all of Marylanders’ medical care needs now #donotdelaycare","date":"Tue Jun 02 15:56:29 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we pause to honor all of those who have made the ultimate sacrifice for our nation. Happy Memorial Day! https://t.co/L0lJVecyHM","date":"Mon May 25 13:55:11 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Glad to be there!","date":"Tue May 12 16:04:45 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Mother’s Day to all those incredible women who have given us life, past and present. I hope all mothers have an amazing day, spent with family in person or virtually!","date":"Sun May 10 22:34:13 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...including freedom of religion and right to assemble. Our Constitution is not suspended in times of crisis.","date":"Tue Apr 28 19:50:13 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On this date 232 years ago, Maryland ratified the Constitution and was the 7th state admitted to the Union. It is critical that our state, established to protect those suffering religious persecution, continue to protect the rights of the people... https://t.co/yGC8wFKpKR","date":"Tue Apr 28 19:49:27 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"What a shame that Congress is not in DC working like a legislature should be to solve the problems of America’s small businesses. Only two members present for a 2 minute “pro forma” session. https://t.co/LPzXEZkg4d","date":"Tue Apr 28 13:29:19 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great opportunity for small businesses out there to learn about the funding opportunities available to them via the CARES Act. This no fee webinar is being held tomorrow, RSVP below:\n\nhttps://t.co/lrDm670LEl","date":"Mon Apr 27 21:25:40 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The IRS's online tool for tracking your economic impact payments has been significantly enhanced.  More info can be found here: \n\nhttps://t.co/mKjhI2YytD","date":"Mon Apr 27 17:03:49 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great news for seasonal businesses!\n\nhttps://t.co/FxSDd2NTMn","date":"Fri Apr 24 17:01:29 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This program is available for those who are self-employed, independent contractors, gig workers, and sole proprietors.  More info can be found here:\n\nhttps://t.co/LCUeaguyzC","date":"Thu Apr 23 15:50:27 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great news, starting tomorrow, the Maryland Labor Department will begin accepting applications for the new Federal Pandemic Unemployment Assistance Program...","date":"Thu Apr 23 15:50:10 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"For Social Security beneficiaries that do not normally file a tax return and have a minor dependent, the deadline is TODAY to register for a full CARES Act check.","date":"Wed Apr 22 18:37:22 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@RepPeteAguilar I’m not sure why my colleague from California sought the job of representing his district in Congress if he didn’t want to travel to Washington. And a pro tip to Mr. Aguilar-predecessors had to travel to Washington by stagecoach and rail for days-not just a few hour flight...","date":"Wed Apr 22 11:42:18 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"In areas like the Eastern Shore, where the COVID threat is much lower, we should move expeditiously to re-open the economy.","date":"Fri Apr 17 17:10:02 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great news for Wicomico County and the City of Salisbury! Chesapeake Shipbuilding will receive an $830K grant to expand their operation and improve efficiency.\n\nhttps://t.co/PyxAEQZpXV","date":"Wed Apr 15 20:31:24 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Another American innovation approved in the fight against COVID-19. American innovation will defeat the Wuhan virus. https://t.co/mYn57Qsefc","date":"Fri Apr 10 22:43:30 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...While there we discussed their partnership for keeping all employees safe. #stopthespread","date":"Fri Apr 10 17:54:24 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a pleasure to join the folks at both Hardwire and Lowe’s in Pocomoke today. Hardwire typically manufactures body armor for our military and law enforcement, but have switched to face shields during the current crisis... https://t.co/nQmC1ZLcfM","date":"Fri Apr 10 17:54:01 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Here's some links to amazing educational resources for students and teachers alike via the Smithsonian Institution and the Library of Congress:\n\nhttps://t.co/qE2pjXk8wQ\n\nhttps://t.co/6PKZGFcmCO","date":"Thu Apr 09 22:41:00 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our watermen are critical to the economy in the First Congressional District.  Here are great resources for the commercial fishing industry:\n\nhttps://t.co/PJ6Qt5lmRr","date":"Wed Apr 08 17:31:41 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great resources for various small businesses out there!\n\nhttps://t.co/IE4OjGspgF https://t.co/7XHqOqABTT","date":"Fri Apr 03 18:40:48 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...to seniors from the Treasury) to make payments to seniors. You will get a direct deposit if there is a bank account on file, otherwise a check in the mail.","date":"Thu Apr 02 14:54:08 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Good news! The Administration has announced that Social Security recipients do not need to take any action or file a tax return to receive their stimulus check. IRS officials will use information on existing 1099 forms (the forms that are normally mailed every year","date":"Thu Apr 02 14:53:49 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Maryland has announced a special health insurance enrollment period for uninsured individuals to help cover Coronavirus treatment costs. People can enroll until April 15th. More info can be found here:\n\nhttps://t.co/mOW1Vq5qIM","date":"Tue Mar 31 19:25:02 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Many have reached out about receiving payments under the recent Phase 3 Coronavirus bill. More info can be found here:\n\nhttps://t.co/i3sAwBOW2E","date":"Tue Mar 31 15:40:01 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy National Doctors Day to all my colleagues on the front lines during this public health crisis. God bless you and keep you safe.","date":"Mon Mar 30 20:28:28 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...and especially for legislation in crisis. We need to learn to #skipthepork and stop using a crisis for pet projects that we can't get passed otherwise.","date":"Fri Mar 27 16:45:51 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As I sit on the floor of the House today listening to colleague after colleague say \"this bill is not perfect\" and \"I'll support this bill because of the crisis,  but it has many flaws\" - I again urge my colleagues to consider #singleissuebills for all future legislation","date":"Fri Mar 27 16:45:25 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Debate continues on the House floor.  Thank you to all our frontline healthcare workers! https://t.co/A7ygGIcfzR","date":"Fri Mar 27 16:15:32 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"$88 million in the Senate “emergency” Coronavirus bill for the Peace Corps-to last until September 2022??? #skipthepork #singleissuebills https://t.co/LTvrO6ST3P","date":"Thu Mar 26 17:51:22 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Senate “emergency” bill allows sanctuary cities to receive Justice Department grants that were stopped by the Trump administration. Sanctuary jurisdictions should not get federal money-and this is NOT related to the Coronavirus economic crisis.  #singleissuebills #skipthepork https://t.co/r7hzmFtlGh","date":"Thu Mar 26 12:19:29 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Senate bill gives $75 million in “emergency” funding to the Corporation for Public Broadcasting-funding which lasts til September 2021. Give me a break!! #skipthepork #singleissuebills https://t.co/qerxrVuzXA","date":"Wed Mar 25 22:51:35 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Over $1 billion for Amtrak in the Senate “emergency” bill? #skipthepork This is why we need #singleissuebills https://t.co/NB86YFknZH","date":"Wed Mar 25 21:32:48 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Senate decided to include $25 million in “emergency funding” for the Kennedy Performing Arts Center...even though it remains closed until at least May 10th. Really?? #skipthepork #singleissuebills https://t.co/TgLeYEEyD5","date":"Wed Mar 25 19:55:46 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Many constituents have reached out me with questions as to whether or not their business is allowed to remain open during this crisis.  See below for more detailed info on critical infrastructure during COVID-19:\n\nhttps://t.co/9cH0JExCW3","date":"Wed Mar 25 19:10:46 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Speaker Pelosi knows that we should be debating the merits of a corporate minimum wage and employee selected board memberships in a separate bill.  This is not related to an emergency Coronavirus response #singleissuebills https://t.co/a5fLaEME7v","date":"Tue Mar 24 21:33:55 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"In Speaker Pelosi’s bill, only two colleges (out of thousands, both just happening to be in DC, and both private) were named to get a $20 million handout. Neither associated with COVID more than any other college. Thats the definition of an earmark. #singleissuebills #skipthepork https://t.co/8y7C0KMJaS","date":"Tue Mar 24 15:27:12 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"A totally new program to spend millions on expensive “renewable” jet fuel??? Only another $200 million under Speaker Pelosi’s “emergency” coronavirus bill. #skipthepork #singleissuebills https://t.co/Ka4OWellIA","date":"Tue Mar 24 01:07:46 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This is really unbelievable. It’s on page 803 of the Speaker’s bill.  If Speaker Pelosi destroys the economy, she won’t have to worry about getting the airline emissions part of the Green New Deal into the COVID-19 bill. That’s why we need #singleissuebills https://t.co/wBjYAOdX4I","date":"Mon Mar 23 22:34:42 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Requiring each bill to be on a single issue will be the only way to stop pork and let every member be able to tell their constituents what they truly support or don’t support. #skipthepork #singleissuebills","date":"Mon Mar 23 21:43:39 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I’m all for helping hard-working Americans and restarting the economy asap, but we need to change how bills are written and passed so they are simplified,  transparent, and accountable. #skipthepork #singleissuebills","date":"Mon Mar 23 21:42:55 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"What does nullifying the President’s exec order on federal employee union issues have to do with COVID-19?  We have small businesses going out of business, and this is a priority for the coronavirus crisis? It’s on page 737 of Speaker Pelosi’s bill! #singleissuebills #skipthepork https://t.co/9diWCMyZVu","date":"Mon Mar 23 21:41:16 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This is why we need #singleissuebills!!  What does selling spectrum on page 996 of the Speaker Pelosi bill have to do with coronavirus?? #skipthepork https://t.co/flaqi59MaX","date":"Mon Mar 23 21:00:52 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"No voter ID to get a ballot, and anonymous “ballot harvesting”...why is that hidden in Speaker Pelosi’s coronavirus bill? These are issues that shouldn’t be addressed at this time. #singleissuebills https://t.co/SjV2V15Qeu","date":"Mon Mar 23 19:57:36 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"From Pelosi’s 1,119 page COVID-19 Bill - what does forcing all states to have early voting have to do with coronavirus? #singleissuebills https://t.co/12AGe8n1bQ","date":"Mon Mar 23 18:27:13 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#singleissuebills #skipthepork","date":"Mon Mar 23 17:40:07 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I still have serious concerns with the Senate bailout bill being considered-and now its possible that if the bill comes to the House there may not even be debate on a $2 trillion package!  Not the way to do the nation’s business. Why not break up such a large bill? #skipthepork","date":"Mon Mar 23 00:40:58 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I hope @RussVought45 is quickly confirmed by the Senate to serve as Director of the Office of Management and Budget. Under his leadership we are draining the swamp and saving billions in burdensome regulatory costs.","date":"Thu Mar 19 02:05:28 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'm pleased that the Administration will extend the deadline for tax payments for people's 2019 tax return to July 15th. However, please note that the filing deadline will remain April 15th.\n\nhttps://t.co/ZGmbHmXp5g","date":"Thu Mar 19 01:51:44 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Coronavirus will be defeated – here's how Americans, together, will do it:\n\nhttps://t.co/u2XjiDBGnL","date":"Tue Mar 17 15:45:20 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Lots of valuable information for small business owners during this difficult time.\n\nhttps://t.co/eEc4Z85Isb","date":"Tue Mar 17 10:19:44 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This is a critical moment for the US. While the Coronavirus bill tonight is not perfect, I plan to vote for it. Now is the time to stand with @realDonaldTrump and work together without partisanship to limit the coronavirus and its harmful effects on our economy and way of life.","date":"Sat Mar 14 01:45:05 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@RogerMarshallMD @RepBuddyCarter @michaelcburgess @RepBrianBabin @RepJohnJoyce @RepGregMurphy @RepJohnJoyce @DrNealDunnFL2","date":"Fri Mar 13 01:40:14 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Precautionary tips about stopping the spread of Coronavirus from the medical practitioners in Congress #gopdoctorscaucus https://t.co/QhTkYMFz0q","date":"Fri Mar 13 01:32:09 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@IAFFTreg @capitalgazette @baltimoresun @ABC7News @wusa9 @WMAR2News @WTOP @fox5dc @nbcwashington @wbaltv11 Thanks for your opinion, but Jacksonville, Florida is a little bit out of the First Congressional District of Maryland.","date":"Tue Mar 10 22:02:53 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@IAFFTreg @capitalgazette @baltimoresun @ABC7News @wusa9 @WMAR2News @WTOP @fox5dc @nbcwashington @wbaltv11 @IAFFTreg Fake news.  Not sure why you want to mislead people.  They met with staff for 20 minutes.  We have their literature and cards for proof if anyone wants to see them.","date":"Tue Mar 10 21:20:55 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I joined my Maryland Congressional colleagues on a call with @MDHealthDept Secretary Robert Neall regarding the extensive preparations the State of Maryland is undertaking to deal with the #coronavirus outbreak. https://t.co/NLJ5BtnuQ2","date":"Tue Mar 10 18:05:53 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@LowerShoreProg @LowerShoreProg False attacks on my family contribute nothing. Socialism is bad for America. I understand that the Lower Shore Progressive Caucus supports socialist policies - I disagree with them, but that is not a basis for false ad hominem attacks.","date":"Tue Mar 10 02:13:21 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My parents fled communist Eastern Europe. Their experience, and the suffering and repression of millions like them, are why I never want to see America become a socialist country. Hear my chat with @CongressmanHice about socialism on the Freedom Caucus Podcast. LIBERTY&gt;SOCIALISM","date":"Tue Mar 10 01:48:10 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I thank the administration for releasing these additional visas and am committed to finding a permanent solution to this chronic issue here in Congress.\n\nhttps://t.co/8P2YuXu097","date":"Thu Mar 05 18:02:15 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The economy under the Trump administration continues to boom, and I welcome this good news on the Mid-Shore.","date":"Fri Feb 21 01:45:19 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We need temporary foreign workers to make sure our crab industry can thrive on the Eastern Shore. https://t.co/5PHxNOzLyw","date":"Tue Feb 11 21:33:44 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on President Trump’s acquittal: https://t.co/cokXuGfGZ8","date":"Wed Feb 05 21:49:00 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"H-2B Visa Update - my statement and the letter sent: https://t.co/WIWRuDLVRq","date":"Mon Jan 27 17:21:42 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we remember the legacy and sacrifice of Dr. Martin Luther King. His unfailing love for his fellow Americans was a tremendous example for all, and his efforts to ensure equal rights for all have made us a more perfect union.","date":"Mon Jan 20 13:21:57 +0000 2020","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@DanRodricks Thank you!!","date":"Thu Dec 19 16:27:23 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@DanRodricks Fake news!","date":"Thu Dec 19 15:49:54 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@DanRodricks I’m sure you’re proud of thinking that up all by yourself, Dan. Ad hominem attacks are all liberal socialists fall back on when they have no facts.","date":"Thu Dec 19 03:54:19 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"https://t.co/IVYYylT2uu","date":"Thu Dec 19 01:38:42 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This partisan impeachment is truly a hoax and a sham! https://t.co/9Me6q125tQ","date":"Thu Dec 19 01:01:12 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The results are in. With 60% of the vote, Maryland’s 1st District opposes impeaching President Trump. Proud to stand for my constituents and to defend the President! https://t.co/A5MmUXJYLE","date":"Thu Dec 19 00:15:02 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"After Soviet-style secret proceedings, Judiciary hearings where the rights of the minority weren’t recognized, and after hearing from thousands of my constituents, it remains clear to me that Democrats' impeachment of President Trump is a partisan sham! https://t.co/6hlt0NPC36","date":"Wed Dec 18 23:59:45 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Please complete this official survey to let me know your thoughts on impeaching President Trump to remove him from office:\n \nhttps://t.co/s0lJOd9IjY","date":"Sat Dec 14 20:17:16 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#Shamimpeachment https://t.co/wJxwlQIHQz","date":"Tue Dec 10 21:47:28 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Just got briefed by Maryland’s Transportation Secretary Rahn, and he assured me that every effort is being made to finish the work on the Bay Bridge ASAP and reopen closed lanes by early May.  Great news for the Eastern Shore! #BayBridgeWork","date":"Thu Dec 05 22:20:25 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"https://t.co/gI3RyygVtt","date":"Wed Dec 04 19:39:47 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I hope everyone has a happy Thanksgiving spent with family and friends! We are blessed with so much to be thankful for in this amazing nation!","date":"Thu Nov 28 13:11:51 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"To my fellow veterans, thank you for your service and dedication to duty on this Veteran’s Day. The sacrifice of American servicemen and servicewomen over the centuries has made America great - the land of the free because of the brave.","date":"Mon Nov 11 14:58:13 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Despite the sham vote in the House last week, the American people deserve to see all documents related to impeachment. Due process and transparency are rights afforded to all Americans, including @realDonaldTrump https://t.co/el1QvyEyxs","date":"Wed Nov 06 12:21:15 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"https://t.co/wabbCbofgX","date":"Thu Oct 31 20:00:37 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#openupthewindows @realDonaldTrump https://t.co/x020jTOhsf","date":"Fri Oct 18 14:53:33 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"https://t.co/ksfXo7dscO","date":"Thu Oct 17 13:43:01 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Holding these impeachment hearings behind closed doors, at the insistence of Chairman Schiff, is unacceptable.  Soviet-style secret trials should never be acceptable in America. https://t.co/BKNu9l5G92","date":"Wed Oct 16 21:15:41 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On this day of remembrance we have to renew our resolve to fight radical Islamic terrorism wherever it threatens our civilization. We can never let our guard down. #September11","date":"Wed Sep 11 14:24:02 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This issue is bipartisan: newborns who survive an abortion deserve lifesaving treatment.\n\nIt’s time for Nancy Pelosi and the House majority to #LetUsVote #ProtectLife #EndInfanticide https://t.co/pPIGA19eLv","date":"Tue Sep 10 18:08:38 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I understand the importance of economic growth in rural America and I support our local communities. I welcome this investment in the Eastern Shore to support our hardworking small business owners, employees, and farmers.\n\nRead more:\n\nhttps://t.co/NyeTNGzX1a","date":"Tue Aug 27 18:21:20 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a physician, I understand the importance of health care services to our local communities. These are important investments in the health and well-being of Maryland families, and I applaud the HHS for their awards to these health centers. \n\nFor more:\n\nhttps://t.co/052A1SxlNF","date":"Thu Aug 22 19:10:13 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This is a great step forward in ensuring that federal tax dollars are not used to promote abortion.\n\nhttps://t.co/rk84RB6vZ4","date":"Wed Aug 21 18:48:56 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you all for a wonderful Teletown Hall tonight with over 5,700 participants! I am looking forward to more so we can discuss important issues relevant to the First District.","date":"Thu Aug 15 00:11:19 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I applaud USACE for taking necessary steps to get dredging of the Ocean City Inlet underway. The fishing and maritime industry is critical to our local economy and community. This dredging is a high priority, and I am glad the Corps is getting the job done\nhttps://t.co/pg4iDpiBPw","date":"Tue Aug 06 19:59:29 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Six months ago today, the #BornAliveAct was introduced in Congress. For six months, Speaker Pelosi has blocked the vote. #EndInfanticide https://t.co/UR5E5IA07j","date":"Mon Aug 05 17:50:05 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Also, congratulations to Jeff Wright, who broke the Atlantic Division fishing record for a mahi mahi at 72.8 pounds off the coast of Ocean City!","date":"Tue Jul 30 21:57:05 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Waterfowl hunting permits for Somerset County sites are now available! See here for more on applications for annual permit-only waterfowl hunting days on Deal Island and Fairmount wildlife management area impoundments (applications due September 9th): \n\nhttps://t.co/AspXhxb0bg","date":"Tue Jul 30 21:56:32 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today the House finally took action to crack down on ‘robocalls’ by penalizing scammers who flood Americans with unwanted phone calls.\n\nMy full statement on the robocall bill: https://t.co/jQpyUQBzhQ","date":"Thu Jul 25 00:12:32 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The spending and budget “deal” announced today is a very bad idea.\n\nRead my full statement on why: https://t.co/viU0hrWzEW","date":"Wed Jul 24 02:18:02 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the TPS vote today —&gt; https://t.co/6yqSbr7J3R","date":"Wed Jul 24 02:17:04 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"School libraries are an important part of our educational system in the First District. I am excited to see these funds awarded to local school libraries to benefit our community and students in Worcester County:\n\nhttps://t.co/cE591pKdMN","date":"Tue Jul 23 19:17:29 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It is beyond dispute that the barriers to marijuana research inhibit this nation’s ability to both thoroughly evaluate the benefits and risks associated with increased marijuana use and craft responsible policy governing such use. @repblumenauer \n\nhttps://t.co/U17f4Nb4t2","date":"Thu Jul 18 13:28:45 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I and Reps. Blumenauer, Lofgren, Griffith, Dingell, and Bishop introduced the Medical Marijuana Research Act of 2019:\n\nhttps://t.co/NCqZoZTCau","date":"Wed Jul 17 21:59:55 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My office has worked with Bloosurf for a number of years. Since 2015, we have worked to help rural communities improve access to broadband services. Today, we see that Bloosurf is continuing to provide service with additional funds from the FCC:\n\nhttps://t.co/YZ30LYJRw8","date":"Mon Jul 15 21:05:25 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Restoring the citizenship question on the census just makes sense. I support @realDonaldTrump, and will continue to support efforts to include citizenship among the 2020 census questions in any way I can.\n\nhttps://t.co/kZcnVyNRWz “","date":"Thu Jul 11 16:31:51 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you Major General Linda Singh for your service as head of the Maryland National Guard. Maj. Gen. Singh has served for 36 years and is retiring at the end of the summer.\n\nhttps://t.co/y6JkOr8qrG","date":"Wed Jul 10 19:48:07 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"USMCA is a big win for American ranchers, farmers, businesses, and workers. With Canada and Mexico as our first and second largest export markets for US goods, we need #USMCANow https://t.co/TL38PF7YIt","date":"Wed Jul 10 13:36:52 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We live in an exceptional country — we are blessed with individual liberty, the rule of law, the opportunity to succeed, and the American spirit of innovation. Happy Fourth of July! https://t.co/jVXtCmzk2X","date":"Thu Jul 04 14:33:05 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a physician who practices at a local hospital, I understand the importance of recruiting and retaining health professionals in medically underserved areas on the Eastern Shore. I congratulate AHEC on the award of this federal grant of more than $500,000\nhttps://t.co/FY6F4rbEcI","date":"Tue Jul 02 20:41:38 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the Supreme Court’s #gerrymandering decision today: https://t.co/90mdnPb72O","date":"Thu Jun 27 14:50:03 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"... And, with federal subsidies, we're going to have American taxpayer dollars profiling foreign companies who own these offshore wind farms.","date":"Wed Jun 26 15:26:57 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Offshore wind has many unresovled issues, and is one of the most expensive ways to generate electricity. It could threaten American defense from offshore foreign threats in the mid-Atlantic...\n\n@TuckerCarlson https://t.co/uSwCLKnJFo","date":"Wed Jun 26 15:26:55 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Talking drug pricing and #Obamacare with @CongressmanHice for the @freedomcaucus podcast https://t.co/mfHSDCZYWm","date":"Fri Jun 21 13:07:54 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to all who joined the tele-town hall tonight from Carroll, Baltimore, and Harford counties! I'm looking forward to talking with more constituents over the next few weeks. We had great conversations tonight!","date":"Fri Jun 21 00:30:30 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I understand they’ve paid the price to defend our freedoms. They’ve earned it.","date":"Thu Jun 20 14:53:19 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I support the Supreme Court’s decision today to uphold the Peace Cross at the World War I memorial in Bladensburg. The American Legion has the right to freedom of religion, and as a veteran...\n\nhttps://t.co/N1HgvsJkOu","date":"Thu Jun 20 14:53:09 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Blackwater National Wildlife Refuge is an integral part of Maryland’s First District and provides essential habitat for waterfowl on the Eastern Shore. I applaud the Department of Interior for their consideration and funding of the refuge --&gt;\n\nhttps://t.co/s7TL4L4COI","date":"Wed Jun 19 19:53:14 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Northrop Grumman employees in Elkton, Maryland for their participation in a partnership with Raytheon to develop a hypersonic weapon for the U.S. military. \n\nhttps://t.co/q5tLPJAM8h","date":"Tue Jun 18 22:33:49 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"So... what then? https://t.co/J7HfmGEk0y","date":"Tue Jun 18 13:15:37 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Father’s Day to all the fathers out there! We’re so blessed to have dads we can look up to and cherish. #FathersDay","date":"Mon Jun 17 00:40:02 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy #FlagDay! 🇺🇸 https://t.co/5ZyIgdYn2p","date":"Fri Jun 14 16:59:44 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy birthday @POTUS! Thank you for your strong leadership of this country.","date":"Fri Jun 14 15:20:37 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy 244th birthday, @USArmy","date":"Fri Jun 14 14:11:21 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a physician, I believe we should always make the determination of whether or not a medical research project involving humans is ethical. https://t.co/CU4iVBIkBb","date":"Thu Jun 13 20:56:14 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'm proud to announce Title I educational funding awards for counties in Maryland’s First Congressional District\n\nhttps://t.co/oLXjrx7ZiB","date":"Thu Jun 13 19:01:07 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"If the majority party really wants to take care of children at the border, they would have included funds to take care of those children in this bill: https://t.co/7tHW7Sad0p","date":"Thu Jun 13 15:52:06 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"More than 12 hours.\n\nThat’s how long we debated this disastrous spending bill. We need to secure our border. We need to have the right science, supported by facts and research. We need to protect the vulnerable.\n\n12 hours now, but the consequences will last a long time.","date":"Thu Jun 13 15:37:45 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Dear Majority\n\n“Political” science? I am a medical doctor. I have been for a while. I find it unusual that someone would criticize my opinion as such, and dismiss it. But, we live in a strange world, and that’s why many question what is going on in Congress today.","date":"Thu Jun 13 15:36:57 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We have to #DoWhatWeSaid along our southern border. #EndBorderCrisisNow","date":"Wed Jun 12 19:11:03 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As the father of a female athlete, the big win yesterday by our U.S. soccer team at the 2019 Women’s World Cup against Thailand was an amazing victory.","date":"Wed Jun 12 18:39:00 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great news for Maryland as fatal opioid overdoses fall for the first time in ten years.\n\nhttps://t.co/m3YT59Lnqv","date":"Wed Jun 12 15:30:23 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"https://t.co/FTRqNTFf3J","date":"Tue Jun 11 23:06:11 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"These past few months I have worked hard to increase the cap for guest workers, and the committee action today is a good start to helping provide an adequate number of temporary workers for the next year. But, more needs to be done as the legislative process unfolds.","date":"Tue Jun 11 23:06:06 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'm proud to announce a nearly $1 million grant to the Maryland Department of Natural Resources that supports clean Chesapeake waterways and sustains the sport and commercial fishing industries important to the Eastern Shore economy and way of life.\n\nhttps://t.co/NJmF1wUftr","date":"Tue Jun 11 21:11:14 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Birthday to Vice President Mike Pence, @VP! Thank you for all you do for this country.","date":"Fri Jun 07 18:29:51 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"D-Day is a testament to the strength, courage, and sacrifice our country makes to keep us free. We will always remember what happened at Normandy on June 6th, 1944, and we will forever be grateful.","date":"Thu Jun 06 13:54:20 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"https://t.co/RUJ7KBfxP9","date":"Wed Jun 05 20:54:59 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I fully support the decision to end federal contracts, paid with taxpayer dollars that inappropriately use aborted human fetal tissue for testing protocols and research. It is an abuse of taxpayer monies when we commercialize the use of fetal tissue from abortions --&gt;","date":"Wed Jun 05 20:54:53 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on H.R. 6: https://t.co/XB6oLB2a5G","date":"Tue Jun 04 22:28:15 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am proud to announce that the University of Maryland Center for Environmental Science in Cambridge, Maryland was awarded $1.24 million in grant funds through the National Oceanic and Atmospheric Administration (NOAA).\n\nRead my full statement: https://t.co/Xi0nomDiqe","date":"Tue Jun 04 20:49:58 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I applaud the House Appropriations Committee for including my provision that will highlight potential hazards created by the impact of offshore wind turbines on air traffic radar. We must ensure the safety of aviation near offshore wind turbines.\n\nhttps://t.co/CCgZPLBpTO","date":"Tue Jun 04 20:15:01 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"ICYMI: Maryland Blue Crabs in the Chesapeake Bay are showing up in huge numbers. This is great news for our seafood industry in Maryland’s First District!\n\nhttps://t.co/4WCdQ9zXcD","date":"Mon Jun 03 15:05:29 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"... which is vital to employers in the First District of Maryland. This bipartisan progress is proof that Republicans and Democrats can partner together to get important work done.","date":"Thu May 30 20:24:11 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I’ve worked hard in Congress to continue funding to protect and clean-up the Chesapeake Bay and eliminate the threat from snakeheads, and to increase the H-2B visa cap... \n\nhttps://t.co/hJ2aC9a25b","date":"Thu May 30 20:23:38 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The USMCA trade agreement creates more jobs. Let’s pass a bipartisan agreement on #USMCA to deliver a win for American farmers, ranchers, businesses, and workers. https://t.co/B21acf8i01","date":"Wed May 29 00:29:15 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This Memorial Day we remember those who served our country to protect the freedoms we hold so dear. God bless those Americans who served, those who have fallen, their friends, and their families.","date":"Mon May 27 15:49:20 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This is why sanctuary cities must end! @realdonaldtrump is right, sanctuary cities are dangerous to our safety and security. These MS13 members were released by Prince George’s County after ICE placed a detainer on them. https://t.co/DQNXZflnNF","date":"Tue May 21 21:39:35 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a veteran, happy Armed Forces Day to all our veterans, past and present. God bless all those willing to put their life on the line for the many freedoms we all enjoy!","date":"Sun May 19 01:52:21 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@realdonaldtrump is right, we need to secure our border.  Maryland continues to be a haven for MS-13. #buildthewall https://t.co/44fDDHP3v8","date":"Sat May 18 21:47:01 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I oppose increasing spending by busting the budget caps.  I agree with President Trump that we must get our deficits under control.  We must address this national security threat for the sake of our children and grandchildren.  #HoldToTheCaps","date":"Thu May 09 18:33:40 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our economy is booming, per the April jobs report from the Department of Labor. We are currently in a 49-year low of the unemployment rate, the lowest since 1969, at 3.6%. In April there were 263,000 new hires, which beat Wall Street expectations.\n\nhttps://t.co/pS5a669Bhm","date":"Fri May 03 17:09:01 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As the sponsor of the Conscience Protection Act, I applaud the announcement by @POTUS at the National Day of Prayer today about “new protections of conscience rights for physicians, pharmacists, nurses, teachers, students, and faith-based charities.”","date":"Thu May 02 16:12:40 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We support the people of Venezuela and their pursuit of freedom and democracy.","date":"Tue Apr 30 18:07:15 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The House is holding its first ever hearing today on #MedicareForAll, which we all know provides Medicare-for-None, and it looks like this:\n-New taxes costing trillions\n-Losing your private insurance (even if you like it)\n-Long waits &amp; rationed care from doctors you didn't choose","date":"Tue Apr 30 14:40:34 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Beautiful photos of the groundbreaking of St. Mary’s Star of the Sea in Ocean City today.\n\nhttps://t.co/Snox2VE1lg","date":"Mon Apr 29 20:27:30 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This week is #ChesapeakeBayAwarenessWeek in Maryland. While we’ve made much progress in restoring the Bay, we must continue to do our part to preserve the Bay for future generations.\n\nhttps://t.co/CrHJElUp3g","date":"Thu Apr 25 14:03:01 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Allowing criminals like the Boston bomber to vote? Creating executive orders to confiscate guns — tearing away our Second Amendment rights? Is this really the future that the left wants? Because it’s certainly un-American. Let’s get back on the right track.","date":"Wed Apr 24 18:51:44 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today, AG Will Barr held a press conference on the release of the Mueller report. Here is my statement on his findings: https://t.co/ZKsL0gWSaM","date":"Thu Apr 18 14:36:05 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Reminder that tomorrow is the deadline for 2019 Congressional Art Competition submissions! Visit https://t.co/TxHqkyMucC for more information.","date":"Wed Apr 17 14:14:16 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I stand with the Ocean City community opposing construction of a large wind farm in sight from the beach. I wrote to the Coast Guard and Department of Defense to address the impact of 1000-foot tall turbine towers on radar and the implications for safety and national security.","date":"Mon Apr 15 14:17:56 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We’ve had #100DaysOfDems so far in Congress, and this is all we’ve gotten: \n \n- Failure to secure our borders\n- Harassing @POTUS and his administration \n- Failure to protect the right to life\n- Support for failed economic policies such as the “green new deal”","date":"Thu Apr 11 17:08:16 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Because of the majority’s inability to pass a budget, they attempted to sneak in a major spending increase through a rule today. However, I voted against the majority’s attempt to increase discretionary spending levels to an outrageous $1.3 trillion.","date":"Tue Apr 09 22:08:09 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Read of the day: Federal Move Could Bring More Crab Pickers to Maryland's Eastern Shore\n\nhttps://t.co/LARTckexmx","date":"Tue Apr 09 16:50:46 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My heart and prayers go out to the family of Michael Busch, Maryland’s longest-serving Speaker of the House of Delegates. He passed away at 72. Rest In Peace.","date":"Mon Apr 08 12:08:10 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The 2019 Congressional Art Competition is open for submissions. The competition recognizes talented high school artists from around the country, and is supported by the entirety of the U.S. House of Representatives. The deadline for submissions is April 18 https://t.co/gXTUJi45bP","date":"Thu Apr 04 14:57:40 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I support the Department of Homeland Security’s decision to increase the number of H-2B visas by 30,000 this summer season. Read my full statement here: https://t.co/lh5e4zo3vn","date":"Wed Apr 03 21:24:25 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Born Alive Abortion Survivors Protection Act is a demand to #EndInfanticide. As a cosponsor, I am proud to have signed the discharge petition today, which would require Members of Congress to vote on protecting infants who survive abortion.","date":"Tue Apr 02 18:57:56 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I and 80 other members of Congress introduced the Conscience Protection Act to protect the freedom of religion and conscience for health care providers that do not participate in the highly controversial practice of abortion. Read our statement:\n\nhttps://t.co/U5tjXJT39h","date":"Mon Apr 01 21:57:59 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Birthday to Maryland’s Lt. Governor, @BoydKRutherford!","date":"Mon Apr 01 19:13:24 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we honor those who died fighting for our country abroad in Vietnam on National Vietnam War Veterans Memorial Day. https://t.co/MCtBmDVWkW","date":"Fri Mar 29 20:00:57 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":".@DOIDepSec David Bernhardt is a great nominee for Secretary of the Department of @Interior and serves the interests of Americans nationwide. His long history, knowledge, and experience in working with natural resources and federal policy will serve him well in our country.","date":"Thu Mar 28 18:09:34 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My heart goes out to the family and friends of Somerset County Sherriff’s Office Lt. Miles, who lost a battle with cancer this week. Rest in Peace, Lt. Miles.\n\nhttps://t.co/0zXUiG1l8U","date":"Wed Mar 27 21:17:13 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"MS-13 gang violence, illegal smuggling of deadly drugs, and human trafficking are serious threats we need to address by securing our border...\n\nRead my full statement on the House’ failed veto override: https://t.co/3n76SNqB3w","date":"Tue Mar 26 20:26:59 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a fellow veteran and a physician, it was great to meet with @DeptVetAffairs Secretary @SecWilkie today to discuss veterans’ healthcare issues as well as efforts made to make the VA work better for all our veterans. https://t.co/tYKn265lew","date":"Tue Mar 26 17:01:15 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy 385th Maryland Day to the our beautiful state! #LoveMD https://t.co/bSf3ZDebTH","date":"Mon Mar 25 20:14:02 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"No collusion, no obstruction. Let’s move on. \n\nWhat a waste of $25 million.","date":"Sun Mar 24 22:05:32 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I’m with the governor on this!","date":"Thu Mar 21 18:47:25 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great seeing that the tax reform we worked on in the last Congress is now rolling over to benefit many Marylanders in jobs and bonuses. Looking forward to more job growth in the 1st District as businesses open up and workers receive higher take-home pay--&gt; https://t.co/CQ2zpdRRKp","date":"Thu Mar 21 18:19:56 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My third town hall this week will take place tonight at the Grasonville VFW from 6-7 pm in Queen Anne’s County!\n\nAll residents of Maryland’s First District are welcome to attend.","date":"Wed Mar 20 17:50:06 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to all who came to our town hall at the Joppa-Magnolia Volunteer Fire Company in Harford County! I’m glad to have heard your concerns and to have answered your wide-ranging questions. https://t.co/JtFGUl7pQp","date":"Wed Mar 20 00:33:30 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be holding a town hall at the Joppa-Magnolia Volunteer Fire Company from 5:30 to 6:30 pm, and residents of Maryland’s First Congressional District are welcome to attend.","date":"Tue Mar 19 20:08:38 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you for your thoughtful questions at our Fruitland town hall! We had a great turnout. https://t.co/u3CXPjIjfC","date":"Tue Mar 19 00:01:20 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Residents of the First District are welcome to join me at my town hall in Fruitland from 5:30 to 6:30 pm as I discuss what I’ve been doing in Congress for our community in Maryland.","date":"Mon Mar 18 20:26:18 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am truly saddened to hear of the terror attacks in New Zealand. Religious intolerance and persecution should be condemned wherever and whenever it occurs. #Christchurch","date":"Fri Mar 15 19:17:38 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy #NationalAgDay! Thank you to all those who work hard in the agricultural industry, especially those farmers and  growers that are the foundation of the economy and culture of Maryland’s First District. #AgDay19","date":"Thu Mar 14 22:04:38 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"One of our very own U.S. Merchant Marine Academy (USMMA) nominees from Maryland’s First District, Kimberly Palace from Grasonville, is a part of the USMMA women’s basketball team that will take part in conference championships.\n\nhttps://t.co/RCqSh2fMXu","date":"Tue Mar 12 20:53:43 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My position on H.R. 1 —&gt; https://t.co/xKozbxBM4X","date":"Fri Mar 08 19:35:40 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"“Nothing works over time when it’s not a bipartisan plan, and the ACA was clearly not a bipartisan plan.” Live with @conversations #CWC116 #MedicareForAll","date":"Wed Mar 06 17:22:30 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"“#MedicareForAll is not patient driven — it’s bureaucrat driven... If you like the DMV, you’ll like government-controlled healthcare.” #Live with @conversations #CWC116","date":"Wed Mar 06 17:14:05 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We are LIVE with with @conservatives discussing the impact of #MedicareForAll on our health care system. Watch:","date":"Wed Mar 06 17:09:14 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Business is moving into Maryland’s First District! With tax cuts in place and other employer incentives, jobs are moving in — including Northrop Grumman planning to add 175 new jobs in Elkton. \n\nhttps://t.co/EjMxEYQ05S","date":"Wed Mar 06 16:14:26 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I’ll be discussing the impact of #MedicareForAll on our health care system with @DesJarlaisTN04 @RepGosar and @RepMarkGreen on Conversations with Conservatives at noon tomorrow","date":"Tue Mar 05 21:57:29 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"“Background checks would not have prevented recent tragedies, but they would make it a crime to loan a firearm to a family member. Under this bill, a parent loaning a firearm to their daughter could cost them a year in prison and a $100,000 fine...”\n\nMy full statement on H.R. 8: https://t.co/vZ3MXAtuee","date":"Wed Feb 27 21:02:21 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"“It’s a shame that the new House majority, instead of fully funding border security, a few minutes ago actually passed House Resolution 46 which would reverse the president’s emergency declaration, that he signed two weeks ago, that secures our border.” https://t.co/ZFOpcDEf77","date":"Wed Feb 27 00:54:13 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on H.J. Res. 46, an attempt to overturn President Trump’s declaration of a national emergency along the U.S. southern border:\n\nhttps://t.co/XituMweklz https://t.co/xN1vkqWOO4","date":"Tue Feb 26 23:52:56 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Many people will gather today to remember the atrocities forced upon #Hungary by communist authorities in the 20th century.\n\nHungarian survivors, including my family, must remain vigilant in our vow to remember and never repeat the horrors of communism.","date":"Mon Feb 25 21:05:12 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today, I joined 64 Members of Congress on a letter to Agriculture Secretary Sonny Perdue supporting a proposed rule that would restore integrity to SNAP, or the \"food stamp\" program, through work or training requirements for able-bodied adults without children. Read it here: https://t.co/aRhCA0lNNo","date":"Tue Feb 19 22:15:51 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"\"I support the president’s efforts to fully fund comprehensive border security by re-allocating unused funds from other programs, such as counter-narcotics programs directly related to the flow of illegal drugs...\" \n\nMy full statement on @POTUS emergency declaration: https://t.co/OqpWLuHflL","date":"Fri Feb 15 17:13:51 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Coming up on the @benshapiro show at 5 pm","date":"Thu Feb 14 21:52:44 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I support the president’s efforts to fully fund comprehensive border security by re-allocating unused funds from other programs... — My statement on the Consolidated Appropriations Act of 2019: https://t.co/7OMGyH6Bkz","date":"Thu Feb 14 21:46:41 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Met with @Habitat_org today— we discussed the means for financing facilities and projects for low-income families. I’m excited for their housing projects to be built in the 1st District. Can’t wait to get out and swing a hammer with these guys to build housing projects in March. https://t.co/6wWLEVf29A","date":"Wed Feb 13 22:46:06 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"A one-week CR gives Congress enough time to fully negotiate an appropriate funding bill that includes border security and wall funding in order to keep America safe.","date":"Wed Feb 13 20:49:40 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was encouraging to visit @CBP in Baltimore today with @VP, who addressed the importance of stopping the flow of illegal drugs into and throughout our country, the necessity of protecting our borders, and saving American lives. I agree that we must support these efforts. https://t.co/XIjjn2Rz0o","date":"Fri Feb 08 23:33:19 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We have to end this barbaric practice.","date":"Wed Feb 06 18:11:30 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"“Let us work together to build a culture that cherishes innocent life.” @POTUS is absolutely right on this — we must protect children, born and unborn, and we have to start now.","date":"Wed Feb 06 03:05:57 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"“Simply put: walls work, and walls save lives.” — @POTUS \n\nI agree, Mr. President. And we should continue to work toward supporting our border, and building a wall to protect national security.","date":"Wed Feb 06 02:48:11 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"What will @POTUS main message be during #SOTU? Catch me discussing the State of the Union tonight, including the president’s theme of choosing greatness and working together to help all Americans. https://t.co/YRcVm99SnT","date":"Wed Feb 06 00:15:03 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Jobs are growing at an all-time high rate, with last month marking the 100th consecutive month of job growth. We’ve got to come together to protect American workers and protect our border, and we should make the president’s address tonight a starting point. #SOTU https://t.co/8TGRQA0iYD","date":"Tue Feb 05 16:56:50 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"... comprehensive border security and the wall where needed so we can keep these drugs out of the U.S.","date":"Mon Feb 04 21:08:14 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Baltimore Field Office of Customs and Border Patrol (CBP) seized more than 3,500 pounds of illegally smuggled drugs in FY 2018, including fentanyl, opium, and heroin. We absolutely have a problem along our border – and we must make sure we support and fund...","date":"Mon Feb 04 21:08:00 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This afternoon I met with Talbot County Sheriff Joe Gamble to discuss the opioid crisis in America and it’s impact on Maryland’s First District. We talked about the partnership solutions between the federal and local governments to save lives and to bring an end to the epidemic. https://t.co/q4HP6UUuIM","date":"Fri Feb 01 22:05:32 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Ms. Becky Smith of Cecilton is 104 years old and almost getting along better than I am. Her secret to life: keep moving, and don’t ever give up. \n\nI had a pleasant discussion with Becky today about her life, family, the Town of Cecilton, and local and national politics. https://t.co/YcDhGLYAkG","date":"Fri Feb 01 19:20:33 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The January jobs report surpassed everyone’s expectations with 304K jobs added to our economy — twice the amount expected. Good to see that despite the limited government shutdown last month, there are more jobs and higher salaries for American workers.","date":"Fri Feb 01 17:17:18 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in now to the C4 Show on WBAL to hear me discuss border security and American jobs. https://t.co/cs3En2z5VV","date":"Fri Feb 01 15:18:59 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It is obviously immoral to leave a baby to die after birth, and I can’t understand how anyone could lightly brush off this topic like Gov. Northam.\n\nhttps://t.co/LYY5o2bxWI","date":"Wed Jan 30 20:43:24 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I visited with and briefly spoke at the Southern States Cooperative annual meeting yesterday at the Preston Volunteer Fire Hall. Farmers and the farming industry are huge foundations of Maryland’s First District, and it was great to attend their meeting! https://t.co/l5G3assFeE","date":"Wed Jan 30 19:02:30 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"HR 1 will:\n\n-Spread California-style election fraud nationwide \n-Use taxpayer $ to fund partisan campaigns\n-Yank voting authority from the states\n-Increase voter fraud by limiting voter verification/forcing same-day voter registration\n\nNeedless to say, HR 1 is a disastrous move.","date":"Tue Jan 29 16:33:35 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I sat down with Andrew Langer live for WBAL Radio. We discussed the government reopening and the importance of the next three weeks for negotiation over border security. https://t.co/5hKRIqAg2C","date":"Sat Jan 26 19:10:27 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on President Trump negotiating to reopen the government: https://t.co/DzWZAaJzxf","date":"Fri Jan 25 20:27:12 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I and 123 bipartisan Members of Congress, including @SenAngusKing and @RepJackBergman, urged leadership to find a permanent solution to the shortage of temporary workers allowed under the H-2B program, which is so important for workers in Maryland’s First District. https://t.co/sglAS9nCvv","date":"Wed Jan 23 21:21:01 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we remember the life and legacy of an American hero, Dr. Martin Luther King Jr. https://t.co/8b0Ugooapj","date":"Mon Jan 21 15:10:12 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This weekend I visited the Elks Club in Cambridge for their “Queen of Hearts” night. The pot of money was over $100,000, and the crowd was huge - but there was no winner. Glad to have had my picture taken with the officers of the Club. https://t.co/yagdfP2zfF","date":"Sun Jan 20 16:46:38 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on @POTUS offer to reopen the government today: https://t.co/VXsRghqsWM","date":"Sat Jan 19 22:00:55 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I met with constituents at our Kent Island office. We discussed the need for prescription payment assistance; Americans should be able to buy prescriptions at an affordable cost. We also discussed Career Technology Education and Workforce Development in the First District. https://t.co/nO4tZrV9wX","date":"Fri Jan 18 22:03:06 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The #MarchForLife was one of the biggest I’ve ever seen in years. It’s my honor and privilege to be a part of a movement that protects the lives of unborn children, and I am proud to have stood among my fellow pro-life Members of Congress in support. #MarchForLife2019 https://t.co/kBywrcCaO3","date":"Fri Jan 18 18:21:59 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I’ll be addressing the #ProLifeCon at 9:30 am ET on the pro-life movement in the digital age today! Tune-in!","date":"Fri Jan 18 14:18:16 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"“You can’t negotiate, you can’t compromise if you’re not here.” \n\n #GovtShutdown @trish_regan @FoxBusiness","date":"Fri Jan 18 02:51:26 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Looking forward to speaking at the #ProLifeCon tomorrow at 9:30 am as Americans from across the nation gather to march on the anniversary of Roe v. Wade","date":"Thu Jan 17 14:54:16 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"... and affordable dental and health care to our community.","date":"Tue Jan 15 23:33:23 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am proud to announce the West Cecil Health Center will receive will receive a grant of $1,178,358 by the Department of Health and Human Services as a community health center. Thank you to the West Cecil Health Center for all your hard work providing quality...","date":"Tue Jan 15 23:33:11 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"We must do everything we can to secure our borders as failure is not an option.\n\n@CongPalazzo and I firmly believe the American people are wiling to put our country's best interests ahead of politics, which is why we sponsored the Border Bonds bill.\n\nhttps://t.co/30e7AjUwRX","date":"Tue Jan 15 19:59:27 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This is truly tough news to hear. I am wishing Maryland Senate President Mike Miller well, and I know his courage and strength will carry him through this battle. He and his family are in our prayers.\n\nhttps://t.co/2GP0GeBkd4”","date":"Fri Jan 11 15:26:01 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"And they will all get paid eventually — when Speaker Pelosi and Minority Leader Schumer stop playing games and start negotiating seriously to stop MS-13, heroin, and human trafficking at our borders....","date":"Thu Jan 10 21:03:49 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thanks @Acosta for reporting that #WallsWork @POTUS","date":"Thu Jan 10 19:24:51 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"... workers and their families. \n \nDemocrats must come to the table and stop holding these government workers hostage over their dangerous pursuit of open borders and amnesty.","date":"Wed Jan 09 21:41:46 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As the partial government shutdown drags on, I’d like to highlight some resources available to federal workers negatively affected by Democrats’ failure to compromise. Several credit unions, banks, and utilities are offering interest free loans or reduced fees to help impacted...","date":"Wed Jan 09 21:41:34 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I agree with Rep. Gabbard — Religious freedom is part of the bedrock of America’s foundations, and we cannot let it crumble. Article 6 of the Constitution has purpose, and religious bigotry has no place in American politics.\n\nhttps://t.co/B0sKbMIS1x","date":"Wed Jan 09 20:00:45 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"During his address to the nation, President Trump cited the horrific actions of MS-13 in the State of Maryland. This is the time we must act to strengthen border security. Congress must act now to work with this administration and protect the American people.","date":"Wed Jan 09 02:36:45 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"... to express those differences. It is great to see young students engaged and interested in their government!","date":"Fri Jan 04 18:33:51 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I had the pleasure of meeting students from The Gunston School in Queen Anne’s County. We discussed the prospects of the 116th Congress, the rules for swearing in the new speaker, and differences of opinion and the freedom in America... https://t.co/aW9BHUX6ZY","date":"Fri Jan 04 18:33:26 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on electing Nancy Pelosi as Speaker of the House: https://t.co/KI56XM3ojD","date":"Thu Jan 03 21:55:06 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Wishing everyone a Happy New Year, and I’m looking forward to working hard for Maryland’s First District in 2019!","date":"Tue Jan 01 18:29:29 +0000 2019","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"May your family and loved ones be blessed this holiday season. Merry Christmas! \n\n“Behold, a virgin shall be with child, and shall bring forth a son, and they shall call his name Emmanuel, which being interpreted is, God with us.”\n\nMatthew 1:23 https://t.co/p7nHuhlfxb","date":"Tue Dec 25 23:02:38 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I applaud President Trump on his selection of @MickMulvaneyOMB  as Acting Chief of Staff.   Congratulations to my former House Freedom Caucus colleague--I know you will continue to serve this Administration and country well!","date":"Sat Dec 15 19:38:25 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Opportunity Zones like the ones we have in Maryland create jobs and investment incentives for businesses and communities alike. Thank you President Trump and HUD Sec Ben Carson for supporting Opportunity Zones like those in MD01 with the WH Opportunity and Revitalization Council.","date":"Wed Dec 12 21:31:02 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Be advised and be aware of recent fraudulent activity regarding impersonation schemes exploiting the Social Security Administration, as advised by the Office of Inspector General. Constituents of Maryland’s First District can read more here: https://t.co/JOBWAEGBdU","date":"Mon Dec 10 21:55:52 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On this day 77 years ago, many Americans lost their lives at the attacks on Pearl Harbor. We remember that treacherous day, and we honor and remember their lives and those veterans who made great sacrifices in World War II to protect our country. #RememberingPearlHarbor https://t.co/0Sana0VSRR","date":"Fri Dec 07 16:30:43 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the $20 million BUILD infrastructure grant for the new I-95 interchange in Cecil County: https://t.co/QEmzDLheHd","date":"Thu Dec 06 22:17:23 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement announcing an Economic Development Administration (EDA) grant to the City of Salisbury to study a Wicomico port: https://t.co/QDpB5xTE4z","date":"Wed Dec 05 21:47:27 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"... Bush family during their time of mourning.","date":"Wed Dec 05 19:36:11 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The eulogy today by former president George W. Bush in honor of his father’s passing was a beautiful reminder of former president George H. W. Bush’s public life and accomplishments. Our 41st president was a man of honor and a beloved man of God, and we are praying for the...","date":"Wed Dec 05 19:35:50 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"What’s National Cookie Day without a few old-fashioned chocolate chip cookies? #HappyNationalCookieDay https://t.co/SxygJbmvja","date":"Tue Dec 04 22:01:19 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am saddened to hear of the passing of the 41st President of the United States, George H. W. Bush. He was a man of honor and courage, and he cared deeply for his family and his country. Rest in peace.","date":"Sat Dec 01 17:32:29 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Following the European Parliament’s recent decision to punish Hungary for exercising their rights as a sovereign nation, I and several of my colleagues sent a letter of support to Hungarian Prime Minister Viktor Orbán and his democratically elected government. https://t.co/RC1UGUpcps","date":"Thu Nov 29 21:14:58 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"... I support your efforts in promoting and expanding school choice programs to ensure families and students receive the best education available to them.","date":"Thu Nov 29 19:40:14 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you Secretary DeVos for the important discussion about advancing school choice. It’s our responsibility in Congress to make sure students receive the high quality education they deserve... https://t.co/Yek0NQ4rCR","date":"Thu Nov 29 19:38:40 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"To the friends and family of Master Police Officer Aaron “Bull” Hudson, we recognize your grief and loss. Hudson was a 27 year Salisbury Police Department veteran, and he passed unexpectedly last Monday. \n\nRest in Peace, Aaron \"Bull\" Hudson.\n\nhttps://t.co/6dFtiuwKkt","date":"Tue Nov 27 15:03:51 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My fellow co-chairs of the Congressional Ukraine Caucus and I issued a joint statement on the aggressive Russian naval attack against Ukraine: https://t.co/cTiGtrmwzd","date":"Mon Nov 26 22:09:46 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to the brave border patrol officers who remain along the border and keep our country safe.","date":"Mon Nov 26 17:40:53 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The action along our southern border with the migrant caravan storming border patrol and points of entry must be stopped. We must secure our border and keep our national security interests at the forefront of the discussion surrounding the migrant crisis...","date":"Mon Nov 26 17:40:45 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#HappyThanksgiving! From my family to yours, we are wishing you a full day of thankfulness, and we remember all those who have sacrificed their lives for our freedom to celebrate. We are truly blessed to live in a free and bountiful country. 🦃🍽 https://t.co/Djce7bzEqD","date":"Thu Nov 22 16:35:05 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"After years of searching for information on his father’s service and awards, we were able to give Francis Gaskill III the information and honor his father deserved. Thank you, Gaskill family, for your service to this country. We will always be grateful for your sacrifice.","date":"Tue Nov 13 19:19:39 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was truly an honor to present Francis Gaskill III with a Purple Heart and a European-African-Middle Eastern Campaign Medal with three stars on behalf of his late father, Francis Gaskill Jr., who served in World War II.... https://t.co/m7Gor3XIQo","date":"Tue Nov 13 19:18:11 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Veterans Day! We are honored to remember those who served in our armed forces so that we can remain free 🇺🇸","date":"Mon Nov 12 15:58:36 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you, Attorney General Sessions, for your work and service to the United States. Your dedication to our country and it’s safety served the American people well.","date":"Fri Nov 09 00:33:38 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Praying for a fast recovery for Justice Ginsburg after hearing of her fall last night.","date":"Thu Nov 08 14:37:49 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Maryland State Park Passes are now available for 2019! We have so many beautiful parks and places to visit in our state. Read more about it here: https://t.co/nWoHnfKUAn","date":"Wed Oct 31 17:29:41 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on @realDonaldTrump signing the SUPPORT for Patients and Communities Act into law: https://t.co/iHkojzgNDF","date":"Wed Oct 24 20:49:39 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulation to the Audubon Chesapeake Exploration project with Wicomico County Public Schools, which received $112,652 today as part of the NOAA Chesapeake Bay Watershed Education and Training Grant Programs. The project will be focused on science and outdoor exploration.","date":"Fri Oct 19 17:21:32 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tomorrow afternoon I will visit the Easton Airport, which is one of the busiest general aviation facilities in Maryland today. I look forward to discussing general aviation issues and the importance of the Easton Airport to the local economy with the airport's new manager.","date":"Mon Oct 15 20:14:29 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a Navy veteran, I am proud to be a part of the strong U.S. Navy legacy. Always powerful and always courageous — happy 243rd birthday, Navy! #243NavyBday","date":"Sat Oct 13 16:53:15 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Had an amazing visit with the Queen Anne's County Economic Development Council, followed by a great trip to Cult Classic Brewery in Stevensville! https://t.co/zS4vj6spbv","date":"Thu Oct 11 13:32:49 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Yesterday I had the amazing honor of visiting Mr. Charles Brown, a WWII Veteran and former Lockheed P-38 fighter pilot, and his family for his 100th birthday in Queen Anne's County. What an amazing life and story -- thank you for your service, and happy birthday Mr. Brown! https://t.co/md5oVO7CHk","date":"Wed Oct 10 15:54:47 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am proud of my colleagues in the Senate for their decision to confirm Judge Brett Kavanaugh to be the next associate justice on the United States Supreme Court. Congratulations, Judge Kavanaugh.","date":"Sat Oct 06 21:14:12 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you, Economic Development Committee of Ocean City, for the great discussion on the status of wind turbines in the region! https://t.co/bPvU9gxHw9","date":"Thu Oct 04 15:27:48 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"What happened on Tuesday at my office was shocking. American political discourse must return to civility — we must be able to share opinions without criminal violence and aggression.\n\nThe need for civil discourse is greater now than it has ever been.\n\nhttps://t.co/zf0OpnBTZv","date":"Thu Oct 04 12:39:31 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I visited the Lower Shore Opportunity Zone and stopped by a few businesses including the Alibi Room and Willey Wielding. I talked with Alibi Room owner Shannon Tippett, who told me about her future business ventures including a $5 million remodeling plan. An amazing venue! https://t.co/4BOrsW9HCy","date":"Wed Oct 03 16:16:37 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you @FederalResGroup for showing me your amazing company, and for the experience of your facilities in Stevensville. We are proud to have businesses like Federal Resources operating right here in the First District of Maryland. https://t.co/iURWB5RBsb","date":"Tue Oct 02 15:56:22 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Rep. Andy Harris Announces Justice Department Grant to Combat Sex Offenders in Maryland\n\nhttps://t.co/mNhPkUW4eN","date":"Fri Sep 28 20:53:24 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Harris Supports House Bills on Tax Cuts and Combating the Opioid Crisis\n\nhttps://t.co/z21omp5SMG","date":"Fri Sep 28 19:50:18 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to the National Taxpayers’ Union @NTU for an A-rating. I am honored to have received the ‘Taxpayers’ Friend Award.’ I will continue to support lower taxes so hard working American individuals, businesses, and families keep more of their money. https://t.co/vjtZQO1FEw","date":"Thu Sep 27 20:01:17 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"USTR Protects Local Maryland Business Following Harris Request\n\nhttps://t.co/DSnj48TnsC","date":"Thu Sep 27 13:40:18 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you @NFIB for the Guardian of Small Business Award! I am committed and will continue to support efforts to reduce the tax and regulatory burdens faced by our small business employers. https://t.co/ypa3GDeH6V","date":"Wed Sep 26 19:57:31 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Harris Sponsors Border Security Amendment to Cromnibus\n\nhttps://t.co/7MgtNmMMTi","date":"Wed Sep 26 16:26:28 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to to the Town of Easton for receiving the Investment Award from the Economic Development Administration! The EDA awarded Easton more than $2.2 mil for an industrial park complex that will support business expansion. Excited to see this grant at work in Easton!","date":"Tue Sep 25 16:41:40 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I had the privilege of celebrating Third Friday with our community in Salisbury over the weekend. From checking out “Signs By Tomorrow” owner Jerry McClymont’s Delorian to listening to prize-winning poetry about the Constitution, I had an amazing time celebrating the community. https://t.co/eyk3COJY3R","date":"Mon Sep 24 17:37:56 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am excited to welcome @SenatorTimScott (SC) to Maryland's First District for an Opportunity Zone tour this afternoon. We will visit two businesses in the Opportunity Zone: Clene Nanomedicine and Operative Experiences.\n\nhttps://t.co/pyYT2ib7Ge","date":"Mon Sep 24 15:26:13 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congressman Andy Harris Welcomes Senator Tim Scott for Joint Opportunity Zone Tour\n\nhttps://t.co/pyYT2ib7Ge","date":"Fri Sep 21 20:19:00 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we remember the sacrifice of those who served our country on POW/MIA Recognition Day. We honor the service they gave and the lives they lost for our country, and we will not forget the sacrifice of their families and friends.","date":"Fri Sep 21 18:30:19 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My sympathies go out to the victims, families, and friends of the shooting today in Aberdeen, MD. We are praying for your well-being and are extremely heartbroken by this tragic event.","date":"Thu Sep 20 17:18:43 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congressman Andy Harris Supports Providing $1 Billion Toward Opioid Crisis\n\nhttps://t.co/P6amhF73ta","date":"Wed Sep 19 19:54:13 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I visited the Maintaining Active Citizens (MAC) center in Salisbury to tour the facility and learn more about the care they provide to seniors in our community. Thank you to the whole team at MAC for the work you do and support you have for our Eastern Shore seniors. https://t.co/P757diwxKQ","date":"Wed Sep 19 16:36:23 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you National Retail Federation for the 2018 Hero of Main Street Award! It is truly an honor to receive this award. The retail industry is important to Maryland’s First District, and I will continue to support retail workers and companies in Congress. https://t.co/KprnKao0qp","date":"Tue Sep 18 13:26:14 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today on #ConstitutionDay, I presided over Congress for a pro forma session. On Sep. 17, 1787, Constitutional Convention delegates ratified the United States Constitution. We must continue to uphold the timeless principles and rights this document gives to the American people. https://t.co/uLiREBeIgz","date":"Mon Sep 17 18:37:50 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you @NFIB for the Guardian of Small Business Award. For many people, owning their own business is part of the American Dream. I will continue to support efforts to reduce the tax and regulatory burdens faced by our small employers. It is an honor to receive this award!","date":"Mon Sep 17 14:45:13 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to our USDA Rural Development Grant recipients in Maryland's First District! \n\nThe Fiber Arts Center of the Eastern Shore (FACES) , Cambridge Main Street, Inc., and Tri-County Council Foundation, Inc. are recipients of the USDA Rural Development Grant!","date":"Fri Sep 14 19:56:30 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today, the U.S. House of Representatives passed H.R. 4913, authored by Congressman Andy Harris (MD-01), to rename a United States Postal facility in Salisbury, MD in honor of the deceased Sgt. Maj. Wardell B. Turner as the ‘‘Sgt. Maj. Wardell B. Turner Post Office Building’’.","date":"Thu Sep 13 20:52:04 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Visited a few businesses yesterday in Maryland's First District, including one of our Wicomico County businesses that supplies our important poultry industry with a feed supplement.\n\nI am excited to see how Marylanders are improving and expanding their businesses! https://t.co/otn0zpGDoN","date":"Wed Sep 12 15:23:56 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"FEMA has important resources for Hurricane Florence preparation. If you need further storm assistance, please check out the @fema app for weather alerts, hurricane preparation tips, shelter locations, and FEMA claim application information. Also, check out https://t.co/Q69cypcnwc https://t.co/NOlslVqVXN","date":"Wed Sep 12 13:29:57 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I visited the wonderful team at The Cricket Center of Worcester County, MD. They do an absolutely outstanding job of protecting children who are subject to various traumatic experiences. Thank you for all that you do to protect Maryland’s children. https://t.co/w0xTMWZQJt","date":"Tue Sep 11 17:32:51 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Let us never forget September 11, 2001 -- 17 years ago today. We remember those who lost their lives on that tragic day in our country. But in true American spirit, we have and will continue forward in strength, dignity, and courage. #NeverForget #September11 https://t.co/LdtXhuaNsO","date":"Tue Sep 11 13:14:34 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy to hear that Blackwater National Wildlife Refuge will receive $833K  to acquire almost 500 new acres of habitat @secretaryzinke. Also glad to report that Blackwater NWR will receive a $100K @USFWS grant with $234K match from @ducksunlimited to restore critical wetlands. https://t.co/yiRQqrPkgO","date":"Fri Sep 07 17:44:29 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great discussion this morning with fellow physician and @NIHDirector Francis Collins about work on cures for #cancer and #Alzheimers. https://t.co/iRZm5Zyp3j","date":"Wed Sep 05 14:28:31 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to all of the recipients who recently received grants from USDA for Rural Development! \n\nThese grants ranged from more than $26,000 to $30,000 and spanned across the state of Maryland, with many recipients in Maryland's First District!","date":"Wed Aug 29 20:42:05 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Saturday, September 1.","date":"Mon Aug 27 18:08:04 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"will be open to the public for a viewing from 1:00 to 8:00 pm on Friday, August 31. Those interested should enter the Capitol through the Capitol Visitors Center. All tours will be closed at the Capitol and the Capitol Visitors Center on Friday, August 31 and until 1:00 pm...","date":"Mon Aug 27 18:07:50 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"\"... Naval officer Senator John McCain passed away. I know Marylanders are mourning over his passing. Our hearts and prayers go out to family and friends of the late Senator McCain, and he will be honored by a viewing in the U.S. Capitol Rotunda.”\n\nThe U.S. Capitol Rotunda...","date":"Mon Aug 27 18:07:16 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congressman Andy Harris, M.D. (MD-01) issued the following statement on the passing of late Senator John McCain and the following viewing details:\n\n“On Saturday, I received the incredibly heartbreaking news that the widely respected former Presidential candidate and fellow...\"","date":"Mon Aug 27 18:06:23 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our thoughts and prayers are with the family and friends of John McCain. Rest In Peace.","date":"Sun Aug 26 00:39:29 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to the City of Salisbury Fire Department! They received a grant from the Fiscal Year 2018 Port Security Grant Program for more than $42,500.\n\nThis award showcases the outstanding work of our firefighters in Maryland's First District. Well done!","date":"Fri Aug 24 19:42:37 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our thoughts and prayers are with the family and friends of Mollie Tibbetts. Rest In Peace.","date":"Thu Aug 23 16:47:42 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Joppa Magnolia Volunteer Fire Company was recently granted an Assistance to Firefighters Grant, and will receive more than $350,000 in assistance to their firefighting program. What an amazing award for all of their hard work. Congrats, @jmvfc8 !","date":"Tue Aug 14 17:07:03 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I had the privilege of presenting Michaela Kyburz with the Bronze and Silver Congressional Awards medals.\n\nCongrats, Michaela! Thank you for all of your dedication and hard work. https://t.co/BHXHmMwaH1","date":"Mon Aug 13 20:56:17 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tonight I will be hosting my 69th brick-and-mortar town hall at the Black Diamond Lodge in Wicomico County from 7 - 8 pm! Residents of MD’s First District are welcome to attend the town hall to ask questions and voice their concerns about issues under consideration in Congress.","date":"Fri Aug 10 16:33:35 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tonight we have not ONE, not TWO, but THREE tele-town halls for Maryland’s Eastern Shore residents! The times are: 5:30 PM, 6:45 PM, and 8:00 PM. Join in via livestream if you are not on the call. You can listen and ask questions online here: \n\nhttps://t.co/fkocA5mbig","date":"Mon Aug 06 19:01:40 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I had the privilege of attending the Blessing of the Combines festival in Snow Hill, MD. Thank you for such a wonderful time of community gathering and blessing! https://t.co/hsB2r1cHg1","date":"Sat Aug 04 18:52:22 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today, ⁦@HouseAppropsGOP⁩ passed my amendment to repair the #H2B visa program. The seafood processing industry and other employers on the Eastern Shore depend on H-2B workers when they are unable to hire Americans, and this year’s shortage is hurting small businesses. https://t.co/JT1eie5y1j","date":"Wed Jul 25 17:48:30 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This morning, ⁦@HouseAppropsGOP⁩ approved my language to protect maritime travel off the coast of Ocean City. My statement here: https://t.co/3SHZ04u7xy","date":"Wed Jul 25 17:04:58 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@POTUS⁩ and ⁦⁦@SecretaryAcosta⁩ are issuing a $2 million grant to implement job training programs in Maryland rehab facilities. This funding will play a key role in prevent relapse and fighting the opioid epidemic. https://t.co/pjqdU3FszF","date":"Tue Jul 24 21:48:42 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This year, the Easton Airport celebrates its 75th anniversary. Congratulations, and cheers to another 75 years! https://t.co/Zr0m3PqtXy","date":"Tue Jul 24 19:56:25 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Met some bright young minds today at Caroline County’s Day of Discovery 💡 After-school and summer programs for kids are valuable assets in our communities that allow children to learn and have fun when school isn’t in session. https://t.co/JnuXGemufj","date":"Fri Jul 20 19:20:03 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to the Easton Airport on 75 years of service to the Talbot County community! I had the pleasure of meeting some members of the Naval Air Station Patuxent River Search and Rescue Unit at the airport’s anniversary celebration today. https://t.co/bF3L6jBbmK","date":"Fri Jul 20 17:27:55 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today, the House of Representatives voted to protect the Chesapeake Bay. Here’s my statement on ⁦@HouseGOP⁩ passing the FY19 Interior and Environment Appropriations bill: https://t.co/2eegMhjaQa","date":"Thu Jul 19 15:44:23 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today at 11:00, I will participate in the July edition of @Conversations with Conservatives. Join the conversation here: https://t.co/3QVeEOlFie","date":"Tue Jul 17 14:53:02 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Join me tonight @ 6:30 for my ninth tele-town hall of 2018. You can listen online and subscribe to my tele-town hall series here: https://t.co/fkocA54AqI","date":"Tue Jul 17 14:11:44 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This morning, the GOP Doctors Caucus met with @SecAzar at HHS to discuss prescription drug prices and the cost of health insurance. We are committed to lowering the cost of health care for the American people. https://t.co/8womODp1tf","date":"Fri Jul 13 16:50:02 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in now to Bold TV to hear the latest update on the immigration debate: https://t.co/LePi57zt8F","date":"Fri Jul 13 14:17:33 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This morning @ 9:30 - tune in to @C4Show on @WBALNewsNow to hear my thoughts on yesterday's Peter Strzok hearing. Listen live here: https://t.co/2LRWO1A2aW","date":"Fri Jul 13 13:13:04 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to the hardworking staff at Ashley Addiction Treatment for allowing me to tour your inpatient facility in Havre de Grace, and for a constructive conversation about how we can best treat and prevent substance abuse. https://t.co/3DJGROYuns","date":"Wed Jul 11 20:51:53 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Eastern Shore’s own Lindy’s Seafood stopped by Capitol Hill today to rally support for the. #H2B visa program! The temporary guest workers that come to the U.S. through the H-2B program are an important part of the #MD01 economy. https://t.co/eMLbCUPTyh","date":"Wed Jul 11 16:16:37 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tonight at 5:30: I am hosting my eighth tele-town hall of 2018. Join the conversation here: https://t.co/fkocA54AqI","date":"Tue Jul 10 21:26:21 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on ⁦President Trump’s #SCOTUS nominee, Judge Brett Kavanaugh: https://t.co/eX5XA5cXi1","date":"Tue Jul 10 01:31:41 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This year's U.S. Military Service Academies nomination application for #MD01 students is now available! The deadline to apply for a nomination is October 22, 2018. All qualified MD01 students are encouraged to apply. Visit my website for more info:  https://t.co/YMSm8yvaqL","date":"Thu Jul 05 13:52:26 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Independence Day! May God continue to bless America, and the brave men and women who protect our great nation. https://t.co/qRPYbV8Ojh","date":"Wed Jul 04 17:56:57 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am deeply saddened by reports of a shooting at the Capital Gazette's office building. I am praying for the victims and first responders, and I thank Anne Arundel County's law enforcement officials for swiftly apprehending the shooter.","date":"Thu Jun 28 19:23:28 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I had the privilege of meeting Nora Gast from Kent Island High School. Nora is the First District's winner of the 2018 Congressional Art Competition, and her watercolor painting, \"Small Things with Great Love\" is now hanging in the U.S. Capitol. Congratulations, Nora! https://t.co/uPoix2TyYz","date":"Wed Jun 27 17:34:24 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Yesterday, I sent a bipartisan letter, signed by 82 members of Congress, to @SecNielsen urging DHS to issue additional H-2B guest workers visas, in response to historically high demand for visas this year. Read my full statement and the letter here: https://t.co/BCP9L3baQY","date":"Wed Jun 27 14:00:03 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the Supreme Court’s #NIFLA v. Becerra ruling: https://t.co/05Cw74aVFD","date":"Tue Jun 26 15:58:50 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the Supreme Court’s #TravelBan ruling: https://t.co/KTyEjz0OrD","date":"Tue Jun 26 15:56:48 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The House of Representatives just passed the bipartisan SUPPORT for Patients and Communities Act. My statement on how this legislation will combat the #opioidcrisis : https://t.co/LCRAJxEIRD","date":"Fri Jun 22 16:08:32 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the passage of the #FarmBill : https://t.co/iy1HMz142l","date":"Thu Jun 21 20:24:59 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Discussing immigration, foreign policy, and the Justice Department this morning at Conversations with Conservatives. Watch live here: https://t.co/SOf1KS9cak #CWC","date":"Thu Jun 21 15:06:18 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today @ 10:00, @HouseAppropsGOP will mark up the FY19 State and Foreign Operations Appropriations bill. You can watch the full markup online here: https://t.co/0OZBZdVSsL","date":"Wed Jun 20 12:53:33 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@POTUS' decision to expand access to Association Health Plans is a win for small businesses. This rule increases access to more affordable health plans for millions of Americans priced out of the expensive, failing ACA exchanges, and protects patients with preexisting conditions.","date":"Tue Jun 19 15:30:02 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Great turnout this weekend at the Talbot Goes Purple event in Easton! Overcoming substance abuse is a long, difficult process, but with the right resources, recovery is possible. https://t.co/UXPjNwIBJV","date":"Mon Jun 18 20:06:04 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Fatherhood has brought me more joy than words can describe, and I am so grateful for all of my kids and grandkids. Happy Father’s Day to all of Maryland’s dads! https://t.co/U7Vgza4lqV","date":"Sun Jun 17 23:41:09 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Last night, the House of Representatives passed the Securing the International Mail Against Opioids Act. You can find my floor speech supporting this legislation here:  https://t.co/fVEhLjj5Wr","date":"Fri Jun 15 15:08:44 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy 243rd birthday to our nation’s oldest military branch, the United States Army! Thank you to all who have served for your unmatched service and dedication. https://t.co/rX9n8CDu0G","date":"Thu Jun 14 16:26:46 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy birthday, @POTUS! I hope your birthday is as great as America 🇺🇸🎂 https://t.co/0tCDTEbYSJ","date":"Thu Jun 14 16:23:59 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"⁦@HouseAppropsGOP⁩ still going strong in markup. Currently marking up the FY19 Financial Services and General Government approps bill. https://t.co/QEZDQVXVkQ","date":"Wed Jun 13 20:14:43 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today @ noon: @HouseAppropsGOP will mark up the FY19 Defense and Financial Services Appropriations bills. You can watch the markup live here: https://t.co/2rvcIHtoDT","date":"Wed Jun 13 15:55:36 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This morning I had the pleasure of meeting with students from the Choptank Electric Cooperative Youth Tour. These students are extremely well-informed, and we had a thoughtful discussion about education funding, the possibility of a new Bay Bridge, and cleaning up the Bay. https://t.co/LPsGrRHALH","date":"Wed Jun 13 14:59:01 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":".⁦@GovLarryHogan⁩ stopped by my office’s booth at the #MMLConference in Ocean City! Stop by to learn more about my work in Congress, and how my office can help you navigate federal bureaucracy: https://t.co/oUH6dCR1BU https://t.co/lLkoudLwil","date":"Tue Jun 12 19:46:08 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on ⁦@POTUS⁩’ summit in Singapore with Kim Jong Un: https://t.co/rNpMGBrUpV","date":"Tue Jun 12 16:30:18 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to the @C4Show at 10:30 this morning to hear my thoughts on the Singapore Summit: https://t.co/2LRWO1A2aW","date":"Tue Jun 12 14:26:31 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"And unemployment is at a historically low 3.8%. #TaxReform works! https://t.co/p9ELU7j5cf","date":"Fri Jun 08 15:40:27 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Wishing the happiest of birthdays to my good friends @VP Pence and @RepAlexMooney ! May the next year be filled with success and happiness for both of you 🎂🎉","date":"Thu Jun 07 21:21:40 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Last night, ⁦@HouseAppropsGOP⁩ voted to provide $73 million in funding for the Chesapeake Bay Program in FY2019. The success of #MD01 depends on a healthy Bay, and I am thankful for my colleagues’ continued support of the Chesapeake Bay Program. https://t.co/NVLDlyrKiF","date":"Thu Jun 07 14:43:47 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you @POTUS for signing into law the VA MISSION Act - a law that will expand access to quality, affordable health care for America's veterans! https://t.co/1DBqwI1Rus","date":"Wed Jun 06 16:38:55 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#OTD in 1944, the liberation of Europe began with the largest sea assault in military history. On #DDay, we honor the 156,000 Allied troops who stormed the beaches of Normandy to free Europe from the tyranny of the Nazis. https://t.co/BlZaI2UUmV","date":"Wed Jun 06 15:52:44 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On Friday, I met with leaders of the First District's agriculture and crop insurance industries to discuss the 2018 farm bill. This year's farm bill must ensure our farmers can thrive, while controlling costs for consumers. https://t.co/cLsf4dEo35","date":"Mon Jun 04 20:13:56 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The #SCOTUS ruling today is a victory for religious liberty. The Colorado Civil Rights Commission openly mistreated Mr. Phillips, and today’s ruling affirms that the government cannot discriminate against individuals based on their religious beliefs. https://t.co/uNOzP9NpAZ","date":"Mon Jun 04 16:59:43 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Some students from North East High School’s AP Gov class stopped by my office before their tour of the U.S. Capitol! If you’re interested in visiting DC this summer,  visit my website to schedule tours of the Capitol, White House, and other DC landmarks: https://t.co/utVdFMcEAK https://t.co/iyueHcMdEN","date":"Mon Jun 04 15:05:01 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This afternoon I met with some #MD01 veterans to discuss VA health care, improving mental health services for veterans, and ending veteran homelessness. The House has passed several bills this year to improve outcomes for veterans, including the VA MISSION Act. https://t.co/UzDkBEHtqG","date":"Fri Jun 01 20:06:40 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This afternoon I met with leaders of Maryland’s seafood processing industry. We discussed the current shortage of H-2B visas and long-term policy solutions to accommodate growing demand for seasonal workers. https://t.co/4oXDnUv5vi","date":"Wed May 30 18:33:37 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"No family should be subjected to the financial stress and emotional strain that was placed on the Taylors by the IRS. I am privileged to serve the people of #MD01, and I'm glad I was able to help the Taylors recover their legal, hard-earned money. https://t.co/ePRXtuSZU9","date":"Tue May 29 17:10:04 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On #MemorialDay, we give thanks to the brave men and women who sacrificed their lives to protect the United States. Let us never forget that freedom isn’t free. Yesterday, I honored our fallen heroes at the American Legion Post 64 Memorial Day Ceremony with @SecAzar https://t.co/wy7k36PyFQ","date":"Mon May 28 17:55:56 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to @SecNielsen for her assistance in addressing the current labor shortage on Maryland’s Eastern Shore. Now Congress must find a long-term solution to reform the H-2B visa program. https://t.co/RLMJW2SXom","date":"Fri May 25 21:43:24 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement regarding @DHSgov’s decision to release 15,000 additional H-2B visas: https://t.co/Rt4OmPoCYM","date":"Fri May 25 21:41:40 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you Jenna Signorelli for inviting me to Bel Air High School's Biomedical Sciences Capstone Ceremony last night! These young scientists are incredibly bright, and all of their capstone projects reflected a strong work ethic and passion for learning. https://t.co/jPUOvmjR99","date":"Fri May 25 16:42:04 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on @HouseGOP passing the #NDAA : https://t.co/yT574mPnL3","date":"Thu May 24 15:16:55 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I applaud the Trump Administration's proposal to update #TitleX rules to exclude programs where abortion is a method of family planning. @POTUS is keeping his #ProLife promises and ensuring that Title X funding is used to provide quality family planning to low-income families. https://t.co/oUzghIjvKr","date":"Wed May 23 16:35:19 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the House passing the bipartisan FIRST STEP Act: https://t.co/3CTRwfw2DT","date":"Tue May 22 21:36:03 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The #RightToTry Act is now on its way to @POTUS’ desk ✅ My statement below: https://t.co/tqphv9FHvC","date":"Tue May 22 21:31:09 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today, Maryland lost a hero. Nicole and I grieve for Baltimore County's fallen police officer, her family, and her loved ones. @BACOPoliceFire and @MDSP are still searching for the suspect. Maryland's law enforcement officers have our full support. https://t.co/uP3OrhAo3q","date":"Mon May 21 20:50:08 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on today’s #FarmBill vote: https://t.co/PBMcV9U35s","date":"Fri May 18 16:33:23 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to the #MD01 winner of the Congressional Art Competition: Nora Gast from Kent Island High School! Nora's portrait of Saint Teresa of Calcutta, entitled \"Small Things with Great Love\" blew me away this year. https://t.co/q006VCQbvP","date":"Thu May 17 21:19:39 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Just now: @HouseAppropsGOP passed my amendment to facilitate medical marijuana research --&gt; https://t.co/E1TCADYfje","date":"Thu May 17 19:07:56 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today @ 10:00: @HouseAppropsGOP will mark up the FY19 Commerce, Justice, and Science Appropriations Bill. Watch live here: https://t.co/NrcFgnqTJB","date":"Thu May 17 13:54:33 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today @ 10:00: @HouseAppropsGOP will mark up the FY19 Agriculture approps bill and the Energy and Water approps bill. Watch live here: https://t.co/dAyoXRvfJd","date":"Wed May 16 13:58:06 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"WATCH LIVE: I am giving a lecture on the NIFLA v. Becerra case at @FRCdc https://t.co/nm8LXeETD7","date":"Tue May 15 16:07:18 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy #NationalPoliceWeek to the brave men and women who comprise the #ThinBlueLine in Maryland's First District. Your bravery and service are not taken for granted. https://t.co/jGapUGOf18","date":"Mon May 14 19:16:59 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Mother's Day to all of Maryland's moms! Your endless love and strength empower all of us to be our best selves. 🌷🌹 https://t.co/Ep1vqcYwQv","date":"Sun May 13 15:12:27 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Nicole and I are deeply saddened by the passing of Baltimore County Executive Kevin Kamenetz. We extend our deepest sympathies to Kevin's family and friends.","date":"Thu May 10 12:33:15 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on @POTUS's decision to seek a new #IranDeal: https://t.co/hNWq6S1OAS","date":"Tue May 08 18:37:44 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today @ 10:00, @HouseAppropsGOP will mark up the FY19 MilCon-VA and Legislative Branch appropriations bills. Watch the markup online here: https://t.co/BFwvXGau5B","date":"Tue May 08 13:05:32 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"(2/2) However, replacing this marker is only a temporary fix, as the Honga River and Tar Bay Channel are in urgent need of dredging. I will continue working with @USACEHQ to see this dredging project completed.","date":"Mon May 07 15:11:43 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"(1/2) I am glad to see the Honga River beacon marker replaced after it was taken down last year. This marker is critical for all boats navigating around the Honga River and the Tar Bay Channel. \nhttps://t.co/o6CuFlZkBY","date":"Mon May 07 15:11:28 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The unemployment rate has fallen to 3.9% - it's lowest level since December 2000. @POTUS's #AmericaFirst agenda is helping American workers! https://t.co/vUtUzKNaKK","date":"Fri May 04 16:17:27 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tonight at 6:00, my Bel Air district office will host an info session for students interested in attending a military service academy. Details here: https://t.co/WqomJp5Oah","date":"Tue May 01 13:39:01 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The House of Representatives just passed a five year FAA reauthorization with a massive bipartisan majority. H.R. 4 will keep our skies safe  ✈️ https://t.co/MIeIxi0Tka","date":"Fri Apr 27 16:09:05 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to our new Secretary of State, Mike Pompeo! I know Mike will honorably serve the American people in this position, just as he did in Congress and as CIA director.","date":"Thu Apr 26 19:17:06 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to @USACEHQ for completing the dredging of Knapps Narrows. The people and small businesses in #MD01 who rely on Knapps Narrows for transporting goods and fishing will be able to conduct their business without interruption. https://t.co/dOWKWHw59s","date":"Tue Apr 24 15:45:53 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Some students from Bohemia Manor High School in Cecil County stopped by my office before taking a tour of the U.S. Capitol today! It's so uplifting to see young Marylanders interested in government and history.  #MD01 https://t.co/xaAMRnw8YW","date":"Fri Apr 20 16:57:48 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Listening to @SecretarySonny discuss USDA's budget priorities for FY19. You can watch the hearing live here: https://t.co/vWRPPBv3Zw https://t.co/vBzAJySdgs","date":"Wed Apr 18 18:01:38 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happening now: @SecretarySonny testifies before the @HouseAppropsGOP #Agriculture Subcommittee on the FY19 budget for @USDA. https://t.co/vWRPPBv3Zw","date":"Wed Apr 18 17:31:44 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happening now: The @HouseAppropsGOP LHHS Subcommittee holds a hearing on @HHSGov's #Biodefense budget for FY19. https://t.co/Z4ho8rxKs1","date":"Wed Apr 18 14:05:49 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our nation mourns the passing of former First Lady Barbara Bush. Mrs. Bush leaves behind a legacy of public service, and the American people will be forever thankful for her commitment to children's literacy, helping others, and above all, her family.","date":"Wed Apr 18 13:12:02 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#TaxDay https://t.co/tPwKMAs3W6","date":"Tue Apr 17 17:25:37 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Out with the old and in with the new! #TaxDay 2018 is the last time Americans will file their taxes under the old, outdated system. From now on, we'll file under the new system that will save the average Maryland family more than $2,000 per year. #MD01 https://t.co/oX7WUDGRhM","date":"Tue Apr 17 17:11:10 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happening now: The @HouseAppropsGOP LHHS Subcommittee holds the FY19 Member Day hearing. Watch live here: https://t.co/SMHpdFwSFD","date":"Tue Apr 17 14:05:00 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happening now: The @HouseAppropsGOP Subcommittee on Homeland Security is holding a hearing on the FY19 budget request for the U.S. Coast Guard. Watch live here: https://t.co/L47c0cq9iS","date":"Tue Apr 17 14:02:29 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@SenKamalaHarris this was dropped off at my office today... is my mail getting delivered to your office too? https://t.co/2L7tUnFbhq","date":"Fri Apr 13 16:07:28 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the House of Representatives’ rejection of the Balanced Budget Amendment: https://t.co/uAZx41s8H7","date":"Thu Apr 12 21:35:32 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Maryland’s First Lady, Yumi Hogan, on her appointment to the General Richard G. Stilwell Korean War Veterans Memorial Foundation! https://t.co/1PG4sKIzzN","date":"Thu Apr 12 20:47:59 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Met with @SecretarySonny today to discuss issues facing the agriculture and poultry industries in #MD01 https://t.co/TP32Q7cap7","date":"Thu Apr 12 20:35:18 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on @SpeakerRyan’s decision to retire from Congress: https://t.co/F41xPyqYd1","date":"Wed Apr 11 15:02:56 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"There's still time for #MD01 high school artists to submit their artwork to the Congressional Art Competition! Deadline for submissions is April 26. Visit my website for full competition guidelines: https://t.co/q7s0i4uM7u","date":"Tue Apr 10 15:27:44 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a pleasure to meet so many Marylanders this Saturday on Smith Island - thanks to everyone who attended the town hall meeting!\n\nhttps://t.co/gMUULu0vNL https://t.co/eeoZlNDE20","date":"Mon Apr 09 16:15:59 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on @POTUS’ decision to send the National Guard to our southern border: https://t.co/nqeV1I2vmQ","date":"Thu Apr 05 13:46:20 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This Saturday at 2:00 PM I will host my 68th brick-and-mortar town hall meeting at the Smith Island Recreation Center (3990 Smith Island Road, Ewell, MD 21824). I hope to see you there!","date":"Mon Apr 02 20:06:02 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Passover to all who celebrate! https://t.co/6Yi2W6N2vD","date":"Fri Mar 30 16:32:40 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"More excellent news for Maryland workers. @mccormickspices is sharing its #TaxReform savings with its workers through bonuses and hourly wage increases. https://t.co/zT8DkSxLM5","date":"Wed Mar 28 16:32:49 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"In October, @SpeakerRyan, @JayTimmonsNAM, and I discussed the importance of #taxreform with the workers of Dixon Valve &amp; Coupling in Kent County. Thanks to the Tax Cuts and Jobs Act, those workers just received tax reform bonuses.\n https://t.co/G4T9px2Kgx","date":"Wed Mar 28 16:27:59 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Join me this Wednesday in Carroll County for my third brick-and-mortar town hall of 2018. The event will take place at the Hampstead Volunteer Fire Company and begin at 7:00 PM. For more info: https://t.co/2mZJk30lQL","date":"Mon Mar 26 18:12:14 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement regarding @POTUS’ policy regarding transgender individuals serving in the military: https://t.co/sgYu80yINd","date":"Sat Mar 24 23:52:56 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a pleasure to attend the Grand Opening of the Amazon Fulfillment Center in Cecil County this morning, and great to see @GovLarryHogan! #MD01 https://t.co/GAT4DrF1oU","date":"Fri Mar 23 15:18:45 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Honored to have received the Lajos Kossuth Award with @RepMarcyKaptur last night. Thank you to @AmerikaiMagyar for working with us to promote U.S.-Hungarian relations! https://t.co/S01S3MxgoU","date":"Thu Mar 22 20:48:06 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I voted ‘no’ on the Omnibus today. This bill does not serve the interests of #MD-01, and it is irresponsible to rush a 2,232 page bill to a vote the day after the bill text is released. https://t.co/rNLGDoabiT","date":"Thu Mar 22 17:11:05 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Event alert: I will hold my 67th brick-and-mortar town hall next Wednesday in Carroll County https://t.co/2mZJk30lQL","date":"Thu Mar 22 12:50:04 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Discussing the ways we can prevent gun violence in schools live on @ABC7News https://t.co/qfmjbJWNCL","date":"Wed Mar 21 23:34:56 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"A little bit of ❄️ isn’t going to keep me out of the office. The House of Representatives is open for business today. Stay safe on the roads, Maryland! https://t.co/XjTAuzKhsC","date":"Wed Mar 21 14:20:49 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"TONIGHT @ 5:30: I am hosting a tele-town hall for residents of Baltimore, Carroll, Cecil, and Harford Counties. Sign up online to join the conversation: https://t.co/tBfGOFW3aw","date":"Mon Mar 19 14:59:37 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Maryland student athletes are making history this March Madness! Go #UMBC! https://t.co/w8pmYuJnl0","date":"Sat Mar 17 03:52:31 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#MD01 ‘s town hall at Stephen Decatur Middle School is well underway! https://t.co/h0xTv9mLnE","date":"Fri Mar 16 23:05:17 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"TONIGHT at 6:30 - Join me for a town hall meeting at Stephen Decatur Middle School in Berlin, MD! https://t.co/gMqRsw41JY","date":"Fri Mar 16 18:53:51 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am saddened by the news of Congresswoman Louise Slaughter's passing. She will be greatly missed on Capitol Hill, and I pray for her family and staff to proceed with strength during this difficult time.","date":"Fri Mar 16 15:18:39 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I commend the Trump Administration’s decision to impose new sanctions against Russian individuals and businesses. Russia has interfered in foreign elections for decades, and has now attempted an attack on our nation’s energy grid. Russia must be held accountable for these crimes.","date":"Thu Mar 15 18:52:32 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"ICYMI: Last night I led a Special Order in support of pro-life pregnancy centers. California is trying to infringe upon these private centers' right to free speech by forcing the centers to advertise abortion - a procedure they do not offer or believe in. https://t.co/PSvBVmette","date":"Thu Mar 15 15:55:16 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tonight after votes I will speak on the House floor in support of pro-life pregnancy centers in the @NIFLA v. Becerra case. You can watch the full Special Order live here: https://t.co/mFbn7c4JpR","date":"Wed Mar 14 21:36:30 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#MD01 depends on temporary workers for our seafood processing, tourism, and landscaping industries. I’m proud to support visa programs like H-2B. https://t.co/IkatfYACba","date":"Wed Mar 14 18:20:11 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Lower Shore residents - Join me this Friday at 6:30 for a town hall meeting at Stephen Decatur Middle School. https://t.co/DwwhyxXXms","date":"Tue Mar 13 13:34:43 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The 2018 Congressional Art Competition is now open! High school artists in #MD01 can submit a piece of artwork for the opportunity to have it hung in the U.S. Capitol. Visit my website for more info: https://t.co/q7s0i4uM7u","date":"Mon Mar 12 18:07:57 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to all of the Marylanders who attended my town hall in Joppa last week! If you were unable to attend, you can also subscribe to my tele-town hall series. The next event is TONIGHT at 5:30. Subscribe here: https://t.co/tBfGOFW3aw","date":"Mon Mar 05 14:58:55 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am deeply saddened by the passing of Senator Wayne Norman. Maryland has lost a great public servant, and I will keep the Norman family in my prayers during this difficult time.","date":"Sun Mar 04 20:49:32 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happening Now: Tune in to the @C4Show for a recap of last night’s town hall in Joppa. Thanks to everyone who participated last night! https://t.co/2LRWO1A2aW","date":"Fri Mar 02 16:04:55 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My town hall in Joppa is well underway! Great to see so many Marylanders come out tonight. https://t.co/g2ptyLsa8b","date":"Thu Mar 01 23:44:00 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you #VOAonTheHill for hosting such an important discussion on our nation’s opioid epidemic. https://t.co/1NwX2qgaAs","date":"Thu Mar 01 19:13:48 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Stopped by a briefing in the Capitol to discuss solutions to curb our nation’s opioid crisis. Substance abuse is a disease, and relief is possible. https://t.co/IYEVLEBzIO","date":"Thu Mar 01 16:39:16 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@Andrew_Cybulska Hi Andrew, I am hosting an in-person town hall this Thursday at 6:30 PM. I hope you can make it! https://t.co/dwa9o5gBfl","date":"Tue Feb 27 14:51:39 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On last night's tele-town hall, I was able to connect with more than 2,400 #MD01 residents. On the call were a few members of the U.S. Air Force. John and Hollie - thank you for participating last night, and thank you for your service! https://t.co/MPfExaLU83","date":"Tue Feb 27 14:26:14 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@petercwfl Hey Peter, I'm on the case! H2B discussions are underway, and I'm advocating for the #MD01 businesses that rely on seasonal workers.","date":"Mon Feb 26 20:44:06 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#MD01 Veterans: The VA Maryland Health Care System is hosting a Virtual Enrollment Fair tomorrow at 3:00 PM. You can participate here: https://t.co/hNOP9ouohq","date":"Mon Feb 26 16:28:18 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On March 1, I'm hosting an immigration town hall meeting at the Joppa-Magnolia VFC. All #MD01 residents are welcome to attend: https://t.co/dwa9o5gBfl","date":"Wed Feb 21 15:46:31 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today’s indictments should stand as a message to the Russians: the U.S. will not tolerate their attempts to sow chaos in our country. Moscow has unlawfully meddled in foreign elections for decades, and we will not accept the Russian efforts to undermine our election system.","date":"Fri Feb 16 21:19:50 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Celebrating the birth of an American hero with @SpeakerRyan and Sylvia Quinton at the Capitol. I’m honored to serve on the Frederick Douglass Bicentennial Commission this year. #FrederickDouglass200 #BlackHistoryMonth2018 https://t.co/nluI5izWVe","date":"Wed Feb 14 23:13:59 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tomorrow at 5:30, I will host my fourth tele-town hall of 2018. My office will call out to 50,000 Eastern Shore households. Sign up here to join the conversation: https://t.co/tBfGOFW3aw","date":"Mon Feb 12 19:44:20 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The stock market figured out how bad this deal is. We should pass a one week clean CR and re-open negotiations.","date":"Thu Feb 08 21:53:35 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am very concerned that not only does this deal increase non-defense discretionary spending by over $200B, it continues the accounting gimmick of classifying tens of billions of dollars of new spending as 'emergency' spending that doesn't even fall under the new budget caps.","date":"Wed Feb 07 21:14:43 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"200k jobs added in January. Wages are rising. Millions of American workers have received bonuses. All because of the Tax Cuts and Jobs Act. And yet Nancy Pelosi mocks this economic growth as \"crumbs\". Really?\nhttps://t.co/FYdtZJKvBl https://t.co/QOqtrDBDUU","date":"Fri Feb 02 19:27:13 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The memo can be read here: https://t.co/7xP6r4QG7c","date":"Fri Feb 02 19:08:11 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"...intelligence system was manipulated to benefit Hillary Clinton’s campaign. I thank my colleagues on the Intelligence Committee and President Trump for agreeing to release the document, so we can now work to rebuild the American people’s trust in our government.","date":"Fri Feb 02 19:07:47 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The memo prepared by the House Intelligence Committee has been declassified and is now available for public review. In the interest of transparency, I thoroughly encourage the people of MD to read through the memo, and see firsthand the extent to which our nation’s...","date":"Fri Feb 02 19:07:03 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Atlanta Fed is projecting 5.4% economic growth in the first quarter, which would make this the strongest quarter for the United States since 2009. @POTUS’s pro-growth policies and tax reform are making our nation’s economy stronger every day. https://t.co/FF1fWsgJjP","date":"Thu Feb 01 22:23:25 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#CheckYourCheck https://t.co/XztxrPt2tR","date":"Thu Feb 01 21:29:48 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am appalled by Mr. Burbey’s decision to mock yesterday’s train crash that resulted in Christopher Foley’s death. This type of toxic, blindly partisan rhetoric is counter-productive and hateful, and it has no place in our educational system. Mr. Burbey should resign immediately. https://t.co/GGFhrN1ApM","date":"Thu Feb 01 17:57:51 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Praying for my colleagues and all involved in the train accident in West Virginia today. I was not on board, but I am thankful that some of my fellow MDs are there to tend to the injured.","date":"Wed Jan 31 17:28:44 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"TONIGHT at 5:30 - I will hold my second tele-town hall of 2018 for residents of Maryland's Eastern Shore. You can sign up to receive a call, or listen to a live stream of the event, here --&gt; https://t.co/fkocA54AqI","date":"Mon Jan 29 14:24:48 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Eastern Shore residents - join me on Monday, 1/29 at 5:30 for my second telephone town hall of 2018. To receive a call, sign up here --&gt; https://t.co/fkocA54AqI","date":"Thu Jan 25 14:34:40 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you, @cathymcmorris ! 🎂 🎉 https://t.co/aelKpvTaqm","date":"Thu Jan 25 14:27:19 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I just voted to end the #SchumerShutdown, because the American people expect Congress to govern. The House passed its FY18 spending bills LAST SEPTEMBER. Sen. Schumer needs to stop holding those bills hostage so we can stop passing these short-term funding patches.","date":"Mon Jan 22 23:15:53 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am proud to use my voice in Congress to fight for our nation’s unborn babies. Every life is sacred. #SanctityOfLifeDay https://t.co/VdYwl1kGtX","date":"Mon Jan 22 21:11:18 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Senator Schumer objected to and stopped a 10pm vote to end the shutdown. He owns this. #SchumerShutdown goes into day 3","date":"Mon Jan 22 02:57:12 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Since the #SchumerShutdown vote by the Democrats occurred on the day of the March For Life, I will be donating my pay to pregnancy centers in Maryland’s First District during the shutdown.","date":"Sat Jan 20 19:52:55 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Senator Schumer is not interested in governing, only obstructing those who are. We wouldn’t need to pass short-term spending bills if Mr. Schumer would allow the Senate to debate the appropriations bills that the House passed last September. https://t.co/BnSQe3X2jO","date":"Sat Jan 20 15:28:35 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Senate Dems want to shut down the federal government and deny health insurance to children across America over an arbitrary DACA deadline. Call your Senators and tell them you don't want a #SchumerShutdown.","date":"Fri Jan 19 16:55:35 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The American people need to know the extent to which the FBI and Department of Justice colluded for the political gain of Hillary Clinton. The committee must vote to #ReleaseTheMemo immediately.","date":"Fri Jan 19 16:08:08 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The memo prepared by the House Permanent Select Committee on Intelligence must be declassified and released to the public. Our government was built on the principle of transparency. Releasing the memo is vital to maintaining the American people’s trust in our government.","date":"Fri Jan 19 16:07:51 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Senate Dems to need to stop playing political games and start governing. https://t.co/L12dN5T0Yv","date":"Fri Jan 19 15:36:11 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The House of Representatives passed a freestanding 5-year reauthorization of CHIP on November 3, which all seven of Maryland’s Congressional Democrats opposed, and it is now dying in the Senate because of liberal obstruction. Hopefully the Senate will reauthorize CHIP this time.","date":"Fri Jan 19 00:53:20 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Once again, the Democrats in the House have demonstrated that they care more about political games than actually governing. 186 Democrats just voted against a bill that reauthorizes the Children’s Health Insurance Program for six years and keeps the government open.","date":"Fri Jan 19 00:52:57 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@MEPFuller Actually there were three - one was full and I was recycling the other two","date":"Thu Jan 18 21:45:42 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"20,000 new American jobs, a new U.S. campus, and enhanced job training programs. Further evidence that #TaxReform works. https://t.co/TgNy5CjqyT","date":"Wed Jan 17 19:46:37 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On this day in 1786, the Virginia General Assembly passed the Virginia Statute for Religious Freedom, laying the groundwork for the #ReligiousFreedom guaranteed to all Americans by the First Amendment of the Constitution. Happy #ReligiousFreedomDay, America! https://t.co/c1xqI8Eddz","date":"Tue Jan 16 18:20:11 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tonight at 5:30, I will begin my 2018 tele-town hall series. To participate in this call and future calls, you can sign up through this link. You can also listen to a livestream of the event and ask questions from your computer. https://t.co/fkocA54AqI","date":"Tue Jan 16 16:33:43 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today we celebrate the legacy of a man who understood the power of love and peace in times of adversity, and changed the lives of millions of Americans. Thank you, Dr. Martin Luther King Jr., for the sacrifices you made for the American people. #MLKDay https://t.co/BEXcHRZ4Za","date":"Mon Jan 15 19:28:20 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am thrilled to see so many American businesses giving their tax breaks back to their employees, and now one of the largest private employers as joined that list. The Tax Cuts and Jobs Act is improving the lives of hardworking Americans. https://t.co/uGLkP4j1OE","date":"Thu Jan 11 17:17:46 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My prayers are with Congresswoman Marjorie Holt and her family. Congresswoman Holt was a trailblazer for Maryland women, and Maryland is grateful for her service. May she rest in peace. https://t.co/kWWWh5gRct","date":"Wed Jan 10 17:33:32 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@usdaRD is accepting applications for the 2018 Rural Business Development Grant Program. Letter of intent due 2/5, full application due 4/20. For more info: https://t.co/0wKVBdyT59","date":"Wed Jan 10 16:11:45 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Wearing blue today for #LawEnforcementAppreciationDay. Thank you to all of the men and women in uniform who form the #ThinBlueLine that keeps our country safe. https://t.co/nvqucpicIr","date":"Tue Jan 09 21:17:58 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Best of luck @SteveScalise! You have demonstrated remarkable strength and perseverance throughout this journey. https://t.co/yh3xZgu6yX","date":"Tue Jan 09 20:46:47 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The second session of the 115th Congress is underway. Join me on my first tele-town hall of 2018 next Tuesday @ 5:30. I want to hear your ideas for Congress' to-do list this year. #MD01 residents can sign up for the call here: https://t.co/fkocA54AqI","date":"Tue Jan 09 20:32:27 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Tax Cuts and Jobs Act is already lighting a fire under our economy. So far more than 100 companies across the country are giving bonuses to employees, increasing their charitable contributions, and reinvesting in their own operations. https://t.co/N3SU1tFmFl","date":"Fri Jan 05 16:18:57 +0000 2018","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Merry Christmas, Maryland 🎄 https://t.co/A5hfCQXnv2","date":"Mon Dec 25 20:49:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@WeAreSinclair- a Maryland based company - has announced that it will pay $1,000 bonuses to 9,000 employees, excluding senior execs. @POTUS just signed our #TaxReform plan into law this morning, and Marylanders are already seeing positive results.","date":"Fri Dec 22 16:42:41 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@senorrinhatch is absolutely correct - @POTUS is one heck of a leader. https://t.co/KeHiAm7Tw5","date":"Thu Dec 21 20:42:11 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On Dec. 26, @fema will open its application for the Assistance to Firefighters Grant Program. For more info on eligibility and the application click here: https://t.co/10fL0fcY74","date":"Thu Dec 21 18:12:10 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Major U.S. job creators are already pledging to invest more in their operations AND their employees, thanks to our historic #TaxReform plan.\nhttps://t.co/ayAOhALPAk","date":"Wed Dec 20 21:15:39 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"America isn't as divided as the pundits on TV might lead you to believe. Thank you @heathermizeur for hosting me on the #soulforcepolitics podcast to discuss protecting the Second Amendment while preventing violent crime. https://t.co/L495KZ8UUg","date":"Wed Dec 20 18:22:00 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Was able to get my copy of the Tax Cuts and Jobs Act signed by both  @VP and @SpeakerRyan, to commemorate the House's passage of the first major tax reform since 1986. https://t.co/GPLb8e1OJo","date":"Tue Dec 19 21:30:05 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tax Reform ✅✅✅ https://t.co/TUnMpz2KEk","date":"Tue Dec 19 19:36:34 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you @USACEBaltimore for your attention to the erosion and shoaling affecting Smith Island. Your navigation improvement project will tremendously benefit the Marylanders living on the island.  https://t.co/vooNQMuRfj","date":"Tue Dec 19 17:24:28 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you @heathermizeur for hosting me on your podcast, MizMaryland: Soul Force Politics. Between our nation's two major political parties there is a lot of common ground that many Americans do not see. Discussions like the one we had today are key to finding that common ground. https://t.co/1UrqkGHX3C","date":"Tue Dec 12 19:39:47 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Hanukkah to all celebrating in Maryland! https://t.co/fgvS0d5Cdw","date":"Tue Dec 12 14:09:10 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My seventh tele-town hall of 2017 starts tonight at 5:25 PM. If you're not on the call, you'll be able to listen to a live stream and ask questions online here: https://t.co/fkocA54AqI","date":"Mon Dec 11 16:47:20 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Join me at 5:25 PM next Monday for my seventh tele-town hall of the year: https://t.co/fkocA54AqI","date":"Fri Dec 08 20:38:25 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"December 7, 1941 - A day which will live in infamy, but awoke a sleeping giant. #PearlHarborDay https://t.co/NlDSvFPZOk","date":"Thu Dec 07 17:31:39 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The #ConcealedCarryReciprocityAct is common sense legislation. The Second Amendment helps keep Americans safe. It’s time for our federal government to secure the Constitutional right of law-abiding citizens to conceal carry across state lines. https://t.co/0dJxmFsgVn","date":"Wed Dec 06 22:09:22 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Nicole and I are spending the evening at the White House for the Congressional Ball. We love the Christmas decorations, @FLOTUS and @POTUS 🎄 https://t.co/ZfSxZgtq2F","date":"Tue Dec 05 22:49:13 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Discussing my trip to Israel and the state of Israel-U.S. relations with @AviAbelow. https://t.co/cvrWruesMy","date":"Tue Dec 05 19:49:02 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Join me tonight @ 5:40 PM for a tele-town hall with the citizens of Maryland'e First District: https://t.co/fkocA54AqI","date":"Mon Dec 04 19:37:58 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This verdict reminds us that the only way to keep Americans secure, especially in 'sanctuary' jurisdictions, is by strict enforcement of immigration laws. It's time to build the wall and end 'catch and release'. https://t.co/RDAtGJglbs","date":"Fri Dec 01 14:25:56 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Discussing Maryland's spending priorities with my fellow MD reps, making sure Congress is spending your tax dollars efficiently. https://t.co/4GEFv6esvw","date":"Thu Nov 30 21:38:57 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy Thanksgiving, MD-01! https://t.co/ZGdKcNspRy","date":"Thu Nov 23 15:39:01 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Baltimore City has lost a true hero. Thank you Governor @LarryHogan for supporting Maryland's law enforcement and first responders. https://t.co/spJyrnAsMq","date":"Thu Nov 16 21:48:00 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I voted for the Tax Cuts and Jobs Act today, because the American people deserve a tax break. https://t.co/AddIcjuVQe","date":"Thu Nov 16 19:15:18 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"These are the real American businesses that will be able to flourish and create new jobs for Americans under the Tax Cuts and Jobs Act #taxreform https://t.co/M0rqjWLS1q","date":"Tue Nov 14 16:43:22 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to the Taney Corporation, Flowserve, Sauder's Eggs, and Fuchs North America for your hospitality last week in Carroll County! https://t.co/wMbT21TPWF","date":"Tue Nov 14 16:40:45 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@POTUS @HHSGov Mr. Azar knows the Department of Health and Human Services inside and out, and will work with Congress as we continue the efforts to repeal and replace Obamacare and lower the cost of healthcare for hardworking Americans.","date":"Mon Nov 13 16:00:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@POTUS has selected an excellent, highly-qualified candidate for Secretary of @HHSGov who hails from MD’s Eastern Shore.  Mr. Azar has already served as General Counsel and Deputy Secretary for HHS, and was confirmed by voice vote in the Senate twice.","date":"Mon Nov 13 16:00:21 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today @ 4:00 I am hosting a town hall meeting at Wicomico High School in Salisbury. I hope to see you there! More info here: https://t.co/pZnXYoCfKo","date":"Sat Nov 11 14:59:03 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to all of the brave men and women selflessly serving in our nation's military. May God bless our #veterans and their families.  #VeteransDay https://t.co/Xahu6GIa3S","date":"Sat Nov 11 14:53:14 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy 242nd birthday to @USMC. Thank you for your service and sacrifice #USMC24 #SemperFi https://t.co/JGe6FKopGR","date":"Fri Nov 10 18:06:56 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you @USDA for your commitment to rural development, and for helping Port Deposit fund this project! https://t.co/jiXEySExWX","date":"Thu Nov 09 15:23:43 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The Oct. 2017 Take Back Day was a success - 912,305 lbs. of Rx drugs were collected. Thanks to all who participated! https://t.co/h7XOwrg79N https://t.co/fm9m7EH3e9","date":"Tue Nov 07 18:55:49 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'll be on @jimmymathisshow on @wbalradio at 11:30 to talk #TaxReform. Listen live here: https://t.co/2LRWO1A2aW","date":"Sat Nov 04 15:22:59 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@DonnaGCollier I'm holding a town hall in Salisbury next Saturday - hope to see you there! https://t.co/pZnXYoCfKo","date":"Fri Nov 03 17:46:36 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Join me in Salisbury on 11/11 for a town hall meeting on #TaxReform. All #MD01 residents are welcome! More info: https://t.co/pZnXYoCfKo","date":"Fri Nov 03 17:21:40 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This morning @HouseGOP voted to re-authorize #CHIP for five more years. https://t.co/qsv1XIYRy6","date":"Fri Nov 03 16:28:16 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"At 7:50 I'll be on @wbalradio to give more details on #TaxReform. Listen live here: https://t.co/2LRWO1A2aW","date":"Fri Nov 03 11:40:59 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @WCBM680 this morning at 7:05 for more info on @HouseGOP's plan for #TaxReform https://t.co/I6VPVD0aFZ","date":"Fri Nov 03 10:55:46 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you @POTUS for supporting H.R. 2989, the Frederick Douglass Bicentennial Commission Act! https://t.co/rCdQms6giv","date":"Thu Nov 02 21:25:36 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"\"Any Democrat who spread this claim should delete their tweets...\" 👏🏼👏🏼👏🏼 https://t.co/0XzFEjmUim https://t.co/oe8lyA5DrP","date":"Thu Nov 02 18:28:30 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It's a beautiful day for #taxreform. See how the Tax Cuts and Jobs Act will help your family: https://t.co/xnKGT4QKRv","date":"Thu Nov 02 18:17:14 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to all who came out to #PrescriptionDrugTakeBackDay in Elkton on Saturday! We all must do our part to make Cecil County drug free. https://t.co/xsVRjWtmsb","date":"Mon Oct 30 15:10:22 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today is the last day for #MD01 students to submit service academy apps to my Kent Island office! More info here: https://t.co/YMSm8yvaqL","date":"Mon Oct 30 15:08:16 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tomorrow is Prescription Drug Take Back Day. Find a local collection site to drop off your expired and unused meds: https://t.co/g0sLAhXCJK","date":"Fri Oct 27 15:27:51 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @C4Show on @wbalradio at 10:30 for the latest update on how Congress is going to deliver #TaxReform https://t.co/2LRWO1A2aW","date":"Fri Oct 27 14:28:44 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I applaud @POTUS for declaring the opioid epidemic a Public Health Emergency. His leadership in this crisis will help save lives.","date":"Thu Oct 26 19:03:50 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Education, prevention, and treatment are all critical factors in preventing the further spread of this terrible epidemic.","date":"Thu Oct 26 19:01:55 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"In 2016 89% of all intoxication deaths in MD were linked to opioids, and the frequency of opioid-related deaths quadrupled from 2010 to 2016","date":"Thu Oct 26 19:01:33 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Now that the budget is passed, @HouseGOP is focused on reforming the U.S. tax code to create jobs and increase wages. https://t.co/aTheNSP5lb","date":"Thu Oct 26 15:57:22 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Monday, October 30 is the deadline for #MD01 students to submit their military service academy applications! https://t.co/YMSm8yvaqL","date":"Wed Oct 25 17:32:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Small businesses in parts of the Lower Shore hit by this summer's heavy rain are eligible for SBA loans. Learn more: https://t.co/AgZm584UxR","date":"Thu Oct 19 19:26:50 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"If you have information on the suspect, please call 1-800-CallFBI. https://t.co/mz9B8CaLxB","date":"Wed Oct 18 16:47:29 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Marylanders: Avoid the Emmorton Business Park area until law enforcement has confirmed it is safe. https://t.co/6jE1DI6UQc","date":"Wed Oct 18 14:18:04 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Don't forget: the Military Service Academy application deadline for #MD01 students is Oct. 30. Apply here: https://t.co/YMSm8yvaqL","date":"Mon Oct 16 20:26:38 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy 242nd Birthday to @USNavy ! Thank you to all of our men and women who serve! https://t.co/fxD1QWw7tt","date":"Fri Oct 13 17:00:12 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"ICYMI: Yesterday, the House passed H.R. 2989, the Frederick Douglass Bicentennial Commission Act https://t.co/jS9cxH9Jxi","date":"Thu Oct 12 13:18:41 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#MD01 students, educators, and parents: The deadline for military service academy nominations is October 30. https://t.co/YMSm8yvaqL","date":"Tue Oct 10 16:41:50 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@VP I personally will not be attending any NFL games until this disrespect ends.","date":"Mon Oct 09 22:48:06 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a veteran, I support the decision of @VP to leave yesterday's Colts game after the disrespect players showed to our flag and nat'l anthem","date":"Mon Oct 09 22:47:34 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Celebrated #manufacturingday yesterday with @SpeakerRyan at Dixon Valve &amp; Coupling - a local MD biz that's grown into a worldwide enterprise https://t.co/ZU2tGSND2t","date":"Fri Oct 06 16:59:39 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I showed @SpeakerRyan how we do business on the Eastern Shore. Thank you Dixon Valve &amp; Coupling for welcoming us into your facility! https://t.co/tTAz5P62LN","date":"Thu Oct 05 20:30:12 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The U.S. tax code has not been reformed since 1986, and Congress owes the American people a long-overdue tax break. https://t.co/Ifq4lnzdmo","date":"Fri Sep 29 13:45:37 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Welcome back, @SteveScalise ! #GeauxScalise https://t.co/D1lR7YCuZI","date":"Thu Sep 28 15:38:45 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our nation’s tax code has not seen major reform since 1986, and this plan will bring long-overdue relief to families and to small businesses","date":"Wed Sep 27 17:30:18 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The #taxreform plan outlined today will bring jobs back to the U.S. and let  Americans keep more of their paychecks. https://t.co/FiAgtHZWrj","date":"Wed Sep 27 17:29:32 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @conversation with Conservatives now to hear the latest on tax reform, budget, and immigration: https://t.co/3QVeEOlFie #CWC115","date":"Tue Sep 26 15:05:41 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On Saturday, the Town of Ridgely celebrated it 150th anniversary. I had a blast participating in the day's festivities! https://t.co/LVK9GrD4QA","date":"Mon Sep 25 14:22:12 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"PSA for Marylanders currently utilizing or applying for VA benefits: https://t.co/El4RC46a5x","date":"Fri Sep 22 14:52:21 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy new year to all of our Jewish friends in #MD01! #RoshHashanah https://t.co/TzjMIDs2tz","date":"Wed Sep 20 20:20:55 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My office will be hosting an info session tomorrow for HS students interested in the service academies. Learn more: https://t.co/7wcfKELs1p","date":"Tue Sep 19 18:04:47 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today, this day symbolizes our nation's strength. As we honor the fallen, let us also thank our first responders for their service.","date":"Mon Sep 11 13:04:06 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On #September11th 2001, terrorists launched an attack on the United States that claimed nearly 3,000 lives. https://t.co/NEn903l7J9","date":"Mon Sep 11 13:02:13 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"At 5:30 I'll be calling in to Washington Watch with @tperkins to discuss the debt ceiling. Listen live here: https://t.co/XRyI7x4sq6","date":"Thu Sep 07 21:23:32 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @WGMDRadio at 8:20 to hear the latest update on Hurricane Harvey relief funding and DACA: https://t.co/RRwU9DTD7b","date":"Thu Sep 07 12:09:35 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congress is back in session! Tune in to @C4Show @wbalradio at 10:05, when I'll call in to discuss the fall agenda: https://t.co/2LRWO1A2aW","date":"Tue Sep 05 13:26:55 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to my team of caseworkers for their hard work, and thank you for the opportunity to serve #MD01 in Congress! https://t.co/wFd3O9QfSN","date":"Mon Aug 28 16:03:21 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My office just completed its 10,000th case. Over the years, we've helped Marylanders with issues related to the VA, IRS,  and other agencies https://t.co/aWOhEpkwmv","date":"Mon Aug 28 16:01:58 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I applaud Border Patrol and @DHSgov for their hard work in reducing illegal immigration, and I support increased funding for border security","date":"Tue Aug 22 16:14:52 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"In the first seven months of 2017, U.S. Border Patrol saw a 46% decrease in illegal border crossing attempts + apprehensions from last year.","date":"Tue Aug 22 16:11:44 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @wbalradio at 7:50 to hear my thoughts on President Trump's strategy for Afghanistan: https://t.co/2LRWO1A2aW","date":"Tue Aug 22 11:21:50 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to the Cambridge Rotary Club for hosting me at your meeting to discuss our country's need for tax reform: https://t.co/iVMiHl1EhD","date":"Wed Aug 16 16:23:25 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to @HoopersIsland for the tour of your facility last week! The oyster industry is incredibly important to the #MD01 economy. https://t.co/TZdp2F3Fpj","date":"Tue Aug 15 13:54:09 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I strongly condemn the hatred and racism of white supremacists in Charlottesville. They have no place in a great nation like America.","date":"Mon Aug 14 17:16:19 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I had a blast at the Blessing of the Combines this weekend. It was great to see nearly 2,000 Marylanders come out for the event! https://t.co/VY4dZ61zpF","date":"Mon Aug 07 16:55:47 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a pleasure meeting with #MD01 Choice Hotels franchisees today in Kent Island! https://t.co/Iab9mLIK87","date":"Wed Aug 02 15:24:51 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a pleasure speaking with small business owners and my fellow Members today on how we can help local businesses thrive #SaveLocalBiz https://t.co/elkxh9vx4f","date":"Thu Jul 27 15:03:16 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This afternoon, I introduced bipartisan legislation to facilitate medical marijuana research: https://t.co/hGNrysTX9E","date":"Tue Jul 25 19:56:51 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This week, I stand with @POTUS to celebrate American Heroes Week https://t.co/4hgvBkyTmK","date":"Tue Jul 25 19:10:05 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @WGMDRadio with Mike Bradley today at 8:20 to hear my take on #Obamacare #repeal","date":"Tue Jul 25 12:13:24 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"FYI - You can watch @HouseAppropsGOP mark up its FY18 Homeland Security and Interior approps bills today at 11:00: https://t.co/Zdnwu4FP5s","date":"Tue Jul 18 13:24:42 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tonight @ 7:00, @HouseAppropsGOP will markup the FY18 Transportation, HUD approps bill. Watch the markup live here: https://t.co/G6nk0lpJId","date":"Mon Jul 17 21:34:22 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Watch @HouseAppropsGOP markup its FY18 CJS and FSGG bills this morning: https://t.co/arnkrk8Zqh","date":"Thu Jul 13 14:00:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy #4thofJuly to all! May God bless #America 🇺🇸 https://t.co/GFrDMFlYn8","date":"Tue Jul 04 12:36:20 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in tonight at 8:00! https://t.co/JiT3vDlH5C","date":"Thu Jun 29 23:52:28 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The House of Representatives just passed #KatesLaw and the No Sanctuary for Criminals Act - two bills that will #SaveAmericanLives https://t.co/sHKQ8HY2Ph","date":"Thu Jun 29 21:35:50 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today I met the talented #MD01 winner of the Congressional Art Competition, Laura Marsh from Crisfield! Congratulations, Laura! https://t.co/flc0QOchaw","date":"Thu Jun 29 21:25:04 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Meeting with my MD colleagues to discuss how we can keep the Chesapeake Bay healthy while helping our economy grow. https://t.co/YgunvmH6iD","date":"Wed Jun 28 20:36:28 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This morning @ 8:20 I'll be on @WGMDRadio with Mike Bradley discussing health care and immigration. Listen live at https://t.co/P406KFZppG!","date":"Tue Jun 27 12:10:48 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Is your family planning a trip to DC this summer? My office can help you set up tours around DC: https://t.co/utVdFMcEAK","date":"Mon Jun 26 15:30:19 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Interested in learning more about what the House is voting on this week? See our weekly schedule here: https://t.co/i62rWWfTPM","date":"Mon Jun 26 14:38:12 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today @POTUS will sign bipartisan VA reform into law. Learn more about how this legislation will help our veterans: https://t.co/JlzX2SmWSL","date":"Fri Jun 23 15:19:04 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to the @C4Show at 11:05 today to learn more about the Senate's #Obamacare repeal bill: https://t.co/2LRWO1A2aW","date":"Fri Jun 23 14:18:19 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This morning @ 8:05 I will be on @WCBM680 with Sean and Frank discussing #Obamacare repeal. Listen live here: https://t.co/0r8pZoQrnv","date":"Fri Jun 23 11:51:46 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The #MD01 tele-town hall is underway! Submit questions online here: https://t.co/fkocA54AqI https://t.co/AUKbTqJj2J","date":"Tue Jun 20 21:51:59 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Join me tomorrow @ 5:30 for my fifth tele-town hall of the year! For more info, visit https://t.co/fkocA54AqI","date":"Mon Jun 19 15:17:44 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be on @wbalradio with @jimmymathisshow tomorrow at 7:45 AM discussing U.S./Cuba relations. Listen live here: https://t.co/2LRWO1A2aW","date":"Fri Jun 16 22:07:51 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My next tele-town hall will be this Tuesday, June 20 @ 5:30 PM. Follow this link to be added to the call list: https://t.co/fkocA54AqI","date":"Fri Jun 16 19:56:06 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My prayers are with @SteveScalise and all of the victims of this morning's shooting in Virginia.","date":"Wed Jun 14 12:21:12 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Our veterans deserve the best medical care and most efficient delivery of benefits possible. Proud to support S. 1094 #VAAccountability https://t.co/XiJ2F6vQoz","date":"Tue Jun 13 21:18:42 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"ICYMI: This week, the EPA awarded more than $4.2 million in grants supporting the health of the Chesapeake Bay: https://t.co/qlPc2iDM0l","date":"Tue Jun 13 17:59:55 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"This week's tele-town hall was a tremendous success, and I'm looking forward to having another on June 20! https://t.co/ZJERnln8jn","date":"Fri Jun 09 16:40:37 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"No financial institution should be too big to fail. Wall Street must be held accountable, which is why I voted for the #FinancialCHOICEact https://t.co/cKwPT19ATc","date":"Thu Jun 08 20:46:10 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was great to discuss this issue with @statnews. We can fund thousands more research projects if @NIH changes the way it uses its funds. https://t.co/fVFlvZ3kak","date":"Thu Jun 08 18:04:35 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#TeamHarris is back in full swing for a month in session. Today's project: mailing letters to the constituents of #MD01 https://t.co/XEbh2SgmtW","date":"Tue Jun 06 17:52:55 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be holding a tele-town hall TONIGHT at 5:30. If you would like to participate, you can sign up here: https://t.co/fkocA54AqI","date":"Tue Jun 06 15:31:08 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"#OTD in 1944, the Allied Powers stormed the beaches of Normandy. Today, we honor the sacrifices made by those heroes. #DDay https://t.co/99kdZec8L5","date":"Tue Jun 06 14:09:18 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Don't forget that my next tele-town hall will be TOMORROW at 5:30 PM. Call my DC office for more details: https://t.co/8eAMNwuNVi","date":"Mon Jun 05 13:11:42 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The U.S. is a nation of innovators, and we need a tax code that can keep up. https://t.co/J7cfaHgJzc","date":"Fri Jun 02 18:48:09 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I applaud @HHSGov and @SecPriceMD for opening new grants to combat the opioid crisis. Learn more here: https://t.co/FLTMMLalYk","date":"Fri Jun 02 14:57:11 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Next Tuesday, June 6 at 5:30 PM, I will be holding another tele-town hall. For more info: https://t.co/8eAMNwuNVi","date":"Wed May 31 20:38:34 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Laura Marsh, the #MD01 winner of the 2017 Congressional Art Competition! https://t.co/BfkUE28WD9","date":"Tue May 30 15:11:04 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be calling in to @WGMDRadio with Mike Bradley this morning at 8:20. Listen live here: https://t.co/f1coTQSbXY","date":"Tue May 30 12:07:49 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Let us never forget that freedom is not free. Honoring our fallen heroes at the Ocean Pines #MemorialDay Ceremony. https://t.co/jOSgTiW7M6","date":"Mon May 29 17:39:04 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'm pleased to see @USACEHQ working with Ocean City to replenish #MD01 beaches, and proud to support this project: https://t.co/4JfCaMVaql","date":"Fri May 26 17:27:22 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"As a veteran, I'm proud to have voted for H.R. 2052. This common-sense legislation will keep our service members safe and accountable. https://t.co/4vCouQBITW","date":"Thu May 25 16:56:25 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Parents should decide how to best educate their children, not the federal government. https://t.co/USSP8pdfhW","date":"Thu May 25 14:11:40 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be on @wbalradio again at 2:05 today to discuss @POTUS's FY18 budget plan with @KathyforMD. Listen live here: https://t.co/2LRWO1A2aW","date":"Wed May 24 17:41:35 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The 2017 Governor's Service Awards are now open for nominations. Deadline is 5 PM on June 2. Learn more here: https://t.co/u6oramCRS6.","date":"Wed May 24 16:08:17 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"At 11:05 AM I will be calling in to the @C4Show on @wbalradio to discuss @POTUS's budget proposal. Listen live here: https://t.co/2LRWO1A2aW","date":"Wed May 24 14:00:36 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be on @WGMDRadio this morning with Mike Bradley. Listen live here: https://t.co/f1coTQSbXY","date":"Tue May 23 12:16:32 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy #ArmedForcesDay to the brave men and women protecting our nation. #MD01 is grateful for your service. https://t.co/YLeW2I7WvD","date":"Sat May 20 12:45:07 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"ICYMI: Here's my questioning from yesterday's @HouseAppropsGOP hearing on advances in biomedical research https://t.co/BGUxXcTOEX","date":"Thu May 18 16:08:37 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My statement on the appointment of Special Counsel Mueller: https://t.co/cjZuTfgxPi","date":"Thu May 18 13:56:37 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a pleasure speaking at #ASAWLC this morning! https://t.co/3LgTL0tgBY","date":"Tue May 16 13:44:49 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy #NationalPoliceWeek to all of the brave men and women protecting our communities. #MD01 is grateful for your service. https://t.co/xu1zIKZO0b","date":"Mon May 15 16:12:35 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was great to meet with @DelMBCarozza and leaders in the fishing industry today in Ocean City https://t.co/RSNtRdFMdc","date":"Thu May 11 20:53:35 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Further proof that #Obamacare is collapsing. https://t.co/kwj0RdYl7N","date":"Thu May 11 17:26:27 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Mr. Rosenstein presented a thoughtful and bipartisan critique of Mr. Comey in his recommendation for termination. https://t.co/EnR38e56AC","date":"Thu May 11 16:24:27 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Helpful answers to FAQs on #AHCA and pre-existing conditions https://t.co/zfW8ewV0lZ","date":"Fri May 05 20:03:51 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am proud to have voted for #AHCA today. https://t.co/bzH1r1bFRV","date":"Thu May 04 18:42:36 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Excited to be participating in @Conversations with Conservatives today. Visit their Facebook page now to watch the discussion.","date":"Wed May 03 18:46:35 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"At 10:35 I will be on the @C4Show on @wbalradio discussing the AHCA. You can listen live here: https://t.co/2LRWO1A2aW","date":"Wed May 03 13:42:24 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"At 6:35 I will be on @WMALDC discussing the omnibus. You can listen live at https://t.co/sIOzCGvsfB","date":"Wed May 03 10:14:21 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be on @ABC7News tonight recapping @POTUS's first 100 days in office. Tune in at 7:00 PM","date":"Tue May 02 21:58:56 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @FoxBusiness today at 3:30 - I'll be discussing health care and government spending.","date":"Tue May 02 19:05:05 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'll be on Washington Watch with @tperkins at 5:20 discussing the omnibus bill. Listen live here: https://t.co/jMZWn7b7Ab","date":"Mon May 01 21:19:03 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Small businesses represent 99.9% of all businesses with employees in the U.S. I applaud all of the small business owners in MD-01! https://t.co/PAs8XvU3Bs","date":"Mon May 01 15:09:49 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"On April 28, 1788, Maryland became the seventh state to join the Union. Happy birthday to our great state!","date":"Fri Apr 28 14:57:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Yesterday on @cspanwj I answered Americans' questions about the future of health care. See the full interview here: https://t.co/eMpnZu7H5c","date":"Fri Apr 28 14:46:59 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My Salisbury district office is hosting a Military Service Academy info session TONIGHT. Call for details - 443-944-8624","date":"Thu Apr 27 16:31:52 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Excited to be on @cspanwj this morning! https://t.co/9UPQp6tz5G","date":"Thu Apr 27 12:04:09 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Listen in to @wbalradio at 12:15 - I'll be on the @C4Show discussing government funding and health care reform https://t.co/2LRWO1A2aW","date":"Tue Apr 25 15:52:12 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My Salisbury office is hosting a Military Service Academy info session this Thursday at Wicomico HS. For more info: https://t.co/RKw52nwVwZ","date":"Mon Apr 24 15:49:20 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today is the last day for high school students to enter the #CongressionalArtCompetition! For more info, visit https://t.co/ALfCtw7vII","date":"Mon Apr 24 14:44:26 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am incredibly saddened by the passing of Lawrence Hogan Sr. My thoughts and prayers are with Governor @LarryHogan and his family.","date":"Fri Apr 21 13:04:49 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"My Bel Air office is hosting a Military Service Academy info session TONIGHT at 6:00 at Bel Air HS. Call my office to RSVP: 410-588-5670","date":"Thu Apr 20 15:07:51 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"There is still time for #MD01 high school students to submit their artwork in the Congressional Art Competition: https://t.co/ALfCtw7vII","date":"Wed Apr 19 20:26:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It is an honor to serve so many of Maryland's farmers! https://t.co/V1Cq543Y6h","date":"Wed Apr 19 18:58:42 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Thank you to all of the #MD01 residents who attended my office hours in Salisbury this morning! https://t.co/JqANWMvzWR","date":"Wed Apr 19 18:53:25 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Pleased to see @POTUS sign on to extend the Veterans Choice Program today. All of our nation's #veterans deserve access to quality care!","date":"Wed Apr 19 18:45:14 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be hosting office hours in my Salisbury office next Wednesday, April 19. Details can be found on my website: https://t.co/6KJUi6akiS","date":"Fri Apr 14 13:32:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Coming up at 10:00, I'll be on @WCBM680 with Bruce Elliott. Listen live here: https://t.co/I6VPVD0aFZ","date":"Thu Apr 13 13:49:30 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be on @wbalradio with @derekahunter during the 2:00 hour. You can listen live here: https://t.co/2LRWO1A2aW","date":"Wed Apr 12 17:55:23 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be on the @C4Show on @wbalradio at 10:00, you can listen live here: https://t.co/2LRWO1A2aW","date":"Mon Apr 10 13:41:08 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Congratulations to Judge Neil Gorsuch on his confirmation to #SCOTUS !","date":"Fri Apr 07 16:30:08 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Listen to @wbalradio at 7:05 to hear my thoughts on Syria's chemical weapons attack. Listen live here: https://t.co/2LRWO1A2aW","date":"Fri Apr 07 11:00:34 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I am holding a town hall TONIGHT at Chesapeake College, I hope to see you there! https://t.co/9dJD8RRKqs","date":"Fri Mar 31 14:01:30 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Today at 11:05 I will be on the @C4Show . Listen live here: https://t.co/2LRWO1iqMm","date":"Thu Mar 30 14:31:39 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Coming up at 8:20, I'll be on @WGMDRadio with Mike Bradley.","date":"Tue Mar 28 11:59:26 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'll be on @FoxBusiness with @DrPhilRoe at 3:00, tune in!","date":"Mon Mar 27 18:57:18 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be on the @derekahunter show on @wbalradio this afternoon to discuss the #AmericanHealthCareAct. Tune in at 2:30!","date":"Fri Mar 24 18:12:05 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @WCBM680 at 7:30 to hear my thoughts on recent changes to the #AmericanHealthCareAct","date":"Fri Mar 24 11:11:17 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be on the @C4Show on @wbalradio radio this morning, tune in at 10:30!","date":"Thu Mar 23 14:30:07 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"USDA is now accepting applications for its 2017 farmers market season. You can apply here: https://t.co/st3uNyVM4t","date":"Wed Mar 15 17:42:22 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The ticket lottery for the 139th White House Easter Egg Roll is open now! https://t.co/pGKjLq1LT2","date":"Wed Mar 15 17:40:33 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Listen live at 11:30 here: https://t.co/I6VPVD0aFZ https://t.co/eGoY7Usrtb","date":"Fri Mar 10 15:11:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The 2017 Congressional Art Competition is now open for submissions! Visit my website (https://t.co/WaWX5B7vzY) for details.","date":"Fri Mar 10 15:10:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Happy #InternationalWomensDay to my exceptional, hardworking daughters. I am incredibly proud of you! https://t.co/AkWSwLSJmr","date":"Wed Mar 08 16:51:32 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I'll be on @CNBC today during the 4:00 hour to discuss Obamacare repeal and replacement, make sure you tune in!","date":"Tue Mar 07 20:39:41 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @wbalradio at 9:15 to catch me on the @C4Show !","date":"Tue Mar 07 14:10:57 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @FoxBusiness tonight at 6:00 to catch my discussion of ObamaCare repeal and replacement with @cvpayne !","date":"Mon Mar 06 22:02:15 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I congratulate Dr. Ben Carson on his confirmation as Secretary of the Department of Housing and Urban Development!","date":"Thu Mar 02 15:55:52 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Heading over to the Capitol, we're excited to hear @POTUS speak tonight at 9! https://t.co/BRwAB8oyQP","date":"Wed Mar 01 00:08:30 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Ready to get started on my third tele-town hall of the year! https://t.co/AqrpCfcS6Y","date":"Tue Feb 28 23:00:35 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be holding another tele-town hall tonight at 6:00 PM, you can listen and submit questions online: https://t.co/fkocA54AqI","date":"Tue Feb 28 17:53:31 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@KLETCO Carroll was called during my last tele-town hall on Feb. 16th. Visit https://t.co/gnfvmd96Mb for the full audio recording.","date":"Mon Feb 27 18:30:50 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"TONIGHT: Tele-town hall - Caroline, Kent, Queen Anne's, &amp; Talbot - 5:30pm! We'll be calling you &amp; look forward to answering your questions.","date":"Mon Feb 27 17:59:00 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be holding two tele-town halls next week and a brick-and-mortar town hall in Easton on March 31, visit my Facebook for details!","date":"Fri Feb 24 16:02:21 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"The full recording of my Teletown Hall is now available! I am planning another Teletown Hall for next week, as well https://t.co/gnfvmd96Mb","date":"Tue Feb 21 19:41:14 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"@ConnorsTheresa I am planning more teletown halls that will be for the Eastern Shore! More details to follow.","date":"Fri Feb 17 20:25:45 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Last night's teletown hall was great, and I'm looking forward to having more in the coming weeks! Follow my Twitter and FB to get updates! https://t.co/mQYYn7lLoG","date":"Fri Feb 17 18:08:18 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @wbalradio @WBALNewsNow at 6:50 to hear my recap of last night's teletown hall!","date":"Fri Feb 17 11:44:15 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"If you'd like to listen live to my teletown hall, you can do so here: https://t.co/fkocA54AqI","date":"Thu Feb 16 22:24:30 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Constituents: Tonight's teletown hall is being pushed to 5:20. Please be near your phones at this time, I am eager to hear your thoughts!","date":"Thu Feb 16 21:34:53 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"It was a pleasure to speak with @EWTN today and discuss how the GOP wants to rebuild America's health care system! https://t.co/aiDNt1T1bx","date":"Thu Feb 16 15:53:14 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"I will be resuming my usual teletown halls tomorrow at 5:00pm, check out my Facebook page for more information! https://t.co/ysvDmmaLrh","date":"Wed Feb 15 22:26:52 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Planning a Spring Break trip to Washington DC? Visit my website to request a tour of the U.S. Capitol! https://t.co/wD865I31kp","date":"Mon Feb 13 22:14:32 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Judge Gorsuch is a perfect fit for President Trump’s promise to appoint someone ‘in the mold of Antonin Scalia.’ https://t.co/Oumuo2aYnK.","date":"Wed Feb 01 22:57:58 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Tune in to @WBOC tonight at 6pm! I'll be on discussing Obamacare.","date":"Wed Jan 04 22:32:47 +0000 2017","user_id":"960962340"},{"handle":"RepAndyHarrisMD","text":"Be sure to head over to @fox5DC at 5&amp;6! I'll be talking with @fitzfox5dc about Obamacare.","date":"Wed Jan 04 22:19:32 +0000 2017","user_id":"960962340"}]