[{"handle":"RepBeatty","text":"#DACA is a lifeline, but it's a temporary solution to a long term problem.\n\nOn its 10th anniversary, we recognize the resilience of #DREAMers and reiterate our calls for a clear pathway to citizenship &amp; ensure that all DACA recipients know that #HomeIsHere. https://t.co/nFgZ3rlyEr","date":"Wed Jun 15 22:04:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to have voted YES on today's #RacialJusticePackage!\n\nThe bill included several #TeamBeatty bills and, if signed into law, will get us one step closer to closing the wealth gap and ending financial disparities that hold back our communities. https://t.co/3J3znpKtCy","date":"Wed Jun 15 20:18:11 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"247 years ago our United States Army was established. Today we continue to honor our brave troops and veterans and thank them for their dedication to our security.","date":"Wed Jun 15 00:11:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"As our region deals with storm-related power outages, my office is in close contact with local agencies and will remain engaged until all of OH-03 has service restored. \n\nStay safe, stay inside, and exercise caution if using open flames or generators. https://t.co/OeHuSKRCj6","date":"Tue Jun 14 20:54:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy #614Day to the City of Columbus! https://t.co/QyMTE4OQFL","date":"Tue Jun 14 20:31:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today is World Blood Donor Day! Did you know each blood donation can save up to 3 lives? https://t.co/4ITtXUelI8","date":"Tue Jun 14 16:32:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"As we #CelebratePrideMonth we have to recognize the transformative work of Queer Black Activists. \n\nRead more about 5 Black trailblazers in LGBTQ+ history here:\nhttps://t.co/GZqZpE4xbi","date":"Tue Jun 14 01:30:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"On June 12, 1963, Medgar Evers, the first NAACP field secretary in Mississippi, was assassinated by a white supremacist. 59 years later, Evers’ legacy lives on as we continue his march for civil rights!","date":"Sun Jun 12 23:07:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In 1967, Mildred Jeter and Richard Loving were sentenced to jail time because of their interracial marriage. Their love persevered, and eventually led to laws banning interracial marriage to be declared unconstitutional by #SCOTUS. #LoveIsLove https://t.co/Fk4M1Eaivz","date":"Sun Jun 12 21:21:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus, an early and consistent leader in gun violence prevention, is pleased to see a bipartisan group of Senators reach a historic deal on major gun violence prevention legislation with broad support among gun violence activists  and organizations. (1/2)","date":"Sun Jun 12 19:36:31 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"It is Congress’ duty to deliver the will of the American people, and it would be a mistake to let progress slip out of our hands after decades of inaction. \n\nAs the process moves forward, the CBC and House Democrats will push to make this the best bill possible. (2/2)","date":"Sun Jun 12 19:36:31 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"6 years ago today, 49 people were killed and 53 were wounded in a shooting at gay nightclub, Pulse, in Orlando, Florida. As we honor the lives of these victims we need to continue to fight against violence against the LGBTQ+ community! https://t.co/FdquhdUJf9","date":"Sun Jun 12 19:28:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"It's an honor to represent #OH03 and @TheBlackCaucus at the ninth Summit of the Americas and to reaffirm our commitments to security, prosperity, and democracy in the Western Hemisphere. https://t.co/TdllEpXw4G","date":"Fri Jun 10 18:24:22 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#OnThisDay in 1963, President Kennedy signed the Equal Pay Act into law. https://t.co/5Q7q2OcUzq","date":"Fri Jun 10 16:45:27 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Looking to celebrate pride in Central Ohio? Check out the Hillard Pride and Westerville Pride both on Saturday, June 11th as well as the Dublin Pride Walk Sunday, June 12th. Get out and show your pride!🏳️‍🌈","date":"Thu Jun 09 20:50:03 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s an honor to execute the will of the American people by passing these sensible policies that will reduce gun violence.","date":"Thu Jun 09 18:26:18 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The Protect Our Kids Act will build on proven programs to ensure dangerous people can’t get a weapon in the first place. Our children live in fear, wondering if their school will be the site of the next American tragedy. But, it doesn't have to be this way. https://t.co/bWHqdHIhu5","date":"Thu Jun 09 18:26:17 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Before Uvalde, threatening posts were made. Before Parkland, Sandy Hook &amp; Columbine, there were violent threats. In most cases of school violence, we see warning signs. That’s why I voted to establish federal ‘red flag’ laws to remove guns from troubled people BEFORE an attack. https://t.co/7awo08lom9","date":"Thu Jun 09 18:26:16 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This week, the House passed two bills to fight back against the plague of gun violence ravaging our nation’s children and families. Gun violence is the leading cause of death among American kids, and it’s past time to do something about it. https://t.co/kexvrdXmrZ","date":"Thu Jun 09 18:26:15 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In far too many shootings, there were warning signs where a ‘red flag’ law could have intervened.\n\nThat’s why I'm voting YES on the Federal Extreme Risk Protection Order Act, so that our children and parents don’t have to fear what the school day might bring. #EndGunViolence","date":"Thu Jun 09 14:39:18 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today is #WorldOceanDay! If we want to protect our planet, we need to work together to protect our world's oceans and sea life. Together we can make a change. https://t.co/JvB0123R75","date":"Wed Jun 08 20:50:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today is Caribbean American HIV/AIDS Awareness Day! HIV doesn’t discriminate, so it’s vital we continue to bring awareness and treatment to every community!","date":"Wed Jun 08 20:34:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Stronger gun laws can save lives.\n\nThe Protecting Our Kids Act will:\n\n🔞 Raise the purchasing age for semi-automatic rifles from 18 to 21\n✏️ Ensure all firearms are traceable\n⬇️ Reduce gun trafficking\n🔒 Promote safe storage\n✅ Expand background checks\n\nhttps://t.co/sfWGsaFRqs","date":"Wed Jun 08 14:30:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The trauma and fear of gun violence that our children face is unacceptable. They’re done with our thoughts and prayers, and so are we. This week, @HouseDemocrats will act on key legislation to close loopholes, restrict access to military-style weapons, and keep our children safe. https://t.co/c7Olc1qROP","date":"Tue Jun 07 20:19:03 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today we congratulate Brittan Alexander for their piece, “Empowerment” which will represent Ohio’s 3rd Congressional District in this year's Congressional Art Competition. #Photography #ArtForCongress https://t.co/NQpfGrZcVJ","date":"Tue Jun 07 16:28:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$850,000 to YWCA Columbus for safety renovations and improvements to amenities at the emergency homeless shelter, which serves approximately 500 families annually. https://t.co/MD4rcPANsx","date":"Mon Jun 06 20:27:17 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$450,000 to the Columbus Urban League for the redevelopment and alignment of office space to provide critical business support services and improve access to capital for Black and minority-owned companies in Central Ohio. https://t.co/Xoyh4chy4w","date":"Mon Jun 06 20:27:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$150,000 to Equitas Health to purchase a Mobile Outreach Vehicle like the one I toured at their Columbus location. https://t.co/oyaR25pFBP","date":"Mon Jun 06 20:26:51 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"🧵We are still hard at work promoting the lifechanging funds secured through Community Project Funding.\n\nIn FY22, I was able to secure $5+ million, including...","date":"Mon Jun 06 20:26:36 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"78 years ago, more than 160,000 Allied troop stormed the beach of Normandy, France to fight Nazi Germany. Today we celebrate their achievement and honor the lives lost that day.","date":"Mon Jun 06 14:38:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today would have been Breonna Taylor’s 29th birthday. As we honor her life, we must continue our push for nationwide police reform, including a full federal ban on no-knock warrants. https://t.co/DaRjWtggNo","date":"Sun Jun 05 19:53:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"103 years ago today, the US Senate passed the 19th Amendment, the result of years of activism from American suffragettes that included everything from marches to protests to provocative art. This stamp, from 1915, was a small part of that important chapter in our history. https://t.co/ENxnCQR59D","date":"Sat Jun 04 21:11:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"On this day in 2016, we lost one of the most influential athletes of all time, Muhammad Ali. Ali was a 3 time heavyweight title winning boxer and one of the most iconic sports figures of the 20th century. #MuhammadAli","date":"Fri Jun 03 22:52:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Wishing the happiest of happy birthdays to our First Lady, Dr. Jill Biden! https://t.co/ra2Ce2dgMT","date":"Fri Jun 03 16:00:35 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In 2013, Hadiya Pendleton was shot and killed on a playground in Chicago. \n\nToday we #WearOrange to honor her and the countless lives cut too short. It’s time to take action and work to #EndGunViolence. https://t.co/nsRvX0q5od","date":"Fri Jun 03 14:00:39 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In 2022, there have already been over 200 mass shootings in the United States.\n\nDuring Gun Violence Awareness Month, we recognize the heartbreaking toll that gun violence takes on our communities and recommit to end gun violence. https://t.co/7xtP8hE5EW","date":"Thu Jun 02 21:01:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Congratulations to Ohio’s own Adm. Linda Fagan on her historic ascension to Commandant of the Coast Guard! Thank you for your commitment to upholding the safety of our communities and dedication to protecting our nation. https://t.co/Fn5rFy9LuE","date":"Thu Jun 02 15:37:56 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy #PrideMonth!\n\nThis month, we recognize, honor, and celebrate the history of pride and protest that’s defined America’s LGBTQ+ communities. https://t.co/o4QO0s57pr","date":"Wed Jun 01 16:25:51 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"ICYMI: President Biden’s policing executive order\n❌ Bans unnecessary chokeholds and carotid restraints\n🚪 Restricts the use of no-knock entries\n📸 Mandates usage of body cameras\n🖥️ Creates a national law enforcement accountability database https://t.co/rwS4cPu3xy","date":"Tue May 31 16:48:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"On behalf of a grateful nation and all Americans, I say the two most powerful words. Thank you. #HonorTheFallen #MemorialDay https://t.co/NyY9YZ31Vf","date":"Mon May 30 14:21:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"On this day in 1851, the famous “Ain’t I A Woman” speech was delivered by Sojourner Truth at the Women's Rights Convention in Akron, Ohio. Over 170 years later, I am proud to walk in her footsteps, continuing her legacy of fighting for equal rights for all. https://t.co/JMoBTGLOCy","date":"Sun May 29 19:26:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, we celebrate the life and legacy of the legendary Dr. Maya Angelou. Her words and wisdom continue to inspire us all. #MayaAngelou https://t.co/njKkcLOUj3","date":"Sat May 28 21:05:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$150,000 to @EquitasHealth to purchase a Mobile Outreach Vehicle (MOVe) to meet the needs of those who often do not or cannot seek out health services in an office setting. https://t.co/BpczMnInpz","date":"Fri May 27 20:47:55 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$500,000 to Franklin County for the Franklin County Mental Health and Addiction Crisis Center, which will support the wellness of adults experiencing, or at risk of experiencing, a crisis associated with their mental health and/or substance abuse disorder. https://t.co/NnSsTHEr36","date":"Fri May 27 20:47:53 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$500,000 to @PASTFoundation to provide students with an interdisciplinary, project-based summer experience that enables youth to take on the roles of STEM professionals as they close gaps in mathematics and English language arts. https://t.co/Dm0vFlUJJE","date":"Fri May 27 20:47:50 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$610,000 for @Huck_House to provide services to young people experiencing homelessness, helping build connections to stabilizing resources, such as housing, physical and mental health care, employment, and supportive relationships. https://t.co/jhXQT6IJdR","date":"Fri May 27 20:47:48 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$850,000 to @YWCAColumbus for safety renovations and improvements to amenities at the emergency homeless shelter, which serves  ~500 families annually. https://t.co/dvs1syGGXL","date":"Fri May 27 20:47:46 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"🧵This week, I toured #CBus to celebrate the funding I was able to secure for impactful projects throughout our community.\n\nIn FY22, I was able to secure $5+ million, including...","date":"Fri May 27 20:47:44 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"On this day in 2011, we lost legendary soul and jazz poet, musician, and author, Gil Scott-Heron. #RestInPower https://t.co/EnTi6UDLYY","date":"Fri May 27 15:00:35 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Safety should belong in the hands of our community members. Yesterday's executive order gives power back to the American people by investing federal resources into community-based crisis response and promoting criminal justice reform. https://t.co/WCn1YcxK99","date":"Thu May 26 17:29:09 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Gun violence is the leading cause of death among children. \n\nIf you aren't outraged, read that again. #StopGunViolence","date":"Wed May 25 20:09:28 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"We are thankful for the President and for this executive order, and we look forward to continuing our work with him in the future.","date":"Wed May 25 17:03:19 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This order comes after countless hours of consultation between the CBC and the Administration, and we are confident this will begin to bring Americans transparency and accountability without sacrificing justice or safety. (2/2)","date":"Wed May 25 16:21:59 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, on the second anniversary of George Floyd's murder, I will lead @TheBlackCaucus to the White House as @POTUS signs a historic executive order to combat police brutality.\n\nThis is progress, and a meaningful next step on our march to nationwide policing reform. (1/2)","date":"Wed May 25 16:21:59 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s devastating that nearly a decade after Sandy Hook, 14 students have been killed in their Elementary school.\nThis shouldn’t have to be the reality for American students &amp; families. Every politician must have the political courage to stand up to extremists &amp; #EndGunViolence.","date":"Tue May 24 23:28:36 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"People with disabilities have a higher rate of being unbanked and are at higher risk of financial abuse.  \n\nJoin me LIVE at noon as I lead @FSCDems in discussing the challenges people with disabilities (including invisible disabilities) face. \nhttps://t.co/gCySAbYBHx","date":"Tue May 24 14:00:34 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"WE’RE LIVE for the 2022 Congressional Art Competition Virtual Reception, featuring Tracy Townsend Enders, Darlene Taylor, &amp; Roger Brackins, live from the Aminah Robinson House!\n\nhttps://t.co/9R1iDAcVmt","date":"Mon May 23 22:41:23 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Voting is still open for my #CongressionalArtCompetition Viewers' Choice Award!🎨\n\nTo cast your vote, browse the submissions below and “like” your favorite(s). The winner will be announced LIVE on Facebook at 6:30 tonight.\n\nhttps://t.co/3OblYQPPIo https://t.co/QvS5P6bT8z","date":"Mon May 23 18:20:51 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Canceling student loan debt is one of the most impactful ways to address ongoing economic &amp; racial inequities in our nation. \n\nAs representatives of more than 17 million Black Americans &amp; 80 million Americans, the urgency of this moment requires we move with intention. (3/4)","date":"Fri May 20 16:22:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In order to reduce the racial wealth gap and advance a just and equitable economic recovery for all, we must alleviate the burden of student debt. \n\nNothing is off the table, except inaction. (4/4)","date":"Fri May 20 16:22:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The $1.7 trillion student loan debt crisis is a racial &amp; economic justice issue disproportionately impacting Black communities nationwide. \n\n@TheBlackCaucus is calling on the Biden Administration to implement broad-based student loan debt cancellation by executive action. 🧵","date":"Fri May 20 16:22:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"We are committed to working with the Administration to explore all options and we are requesting to meet with the President. \n\nThis is a crisis created through policy decisions, and we have a responsibility to address it head-on. (2/4)","date":"Fri May 20 16:22:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"From Charleston to Pittsburgh to El Paso to Atlanta to Buffalo to Dallas, we are seeing the pipeline from racist rhetoric to racist violence.\n\nThe \"great replacement\" theory is a hateful lie rooted in old school colorism and eugenics. \n\nWe must call it out at every opportunity. https://t.co/XQEO38hV8B","date":"Thu May 19 20:46:44 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"TUNE IN LIVE: We are gathered on the steps of the Capitol to discuss the #RacistReplacementRampage that took place in Buffalo and are calling for action! \n\nThoughts and prayers are not enough. Laws must be passed.\nhttps://t.co/Iwy4k4Szkt","date":"Thu May 19 16:46:28 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"On this day in 1954, #BrownvBoard set the stage for desegregation in America. While we celebrate the progress made, we must also recognize that we still have work to do to make quality public education a reality for everyone. https://t.co/1hG5xzCAzf","date":"Tue May 17 20:35:19 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This weekend, we lost ten innocent souls in another horrific mass shooting. For their families, thoughts and prayers are not enough. \n\nWe need to abolish the filibuster if we want any hope of getting accountability for hate, true criminal justice reform, &amp; common-sense gun laws. https://t.co/W5IB4vBXXi","date":"Tue May 17 15:25:40 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Everyone deserves the safety and security of a roof over their head, and this five year plan will take us one step closer to achieving that goal.","date":"Mon May 16 19:50:36 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Affordable housing in our communities should be a right, not a privilege. Today, I had the honor of joining @SecFudge @SenSherrodBrown @SecRaimondo and @MayorGinther for the announcement of @POTUS’s Housing Supply Action Plan. https://t.co/6skR1KEdcF","date":"Mon May 16 19:50:36 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Again, we witness a barbaric mass shooting fueled by bigotry. There must be accountability for hate, there must be criminal justice reform, and there must be common-sense gun reform. I pray for the families who now feel our gun violence crisis personally. \nhttps://t.co/5yanziehim","date":"Sun May 15 16:29:27 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Voting is open for my #CongressionalArtCompetition Viewers' Choice Award!\n\nThere are a few frontrunners, but it's still anyone's game.\n\nVote by browsing the album &amp; liking you favorite(s).\n\nThe winner will be announced LIVE on Facebook on Monday, May 23.\n\nhttps://t.co/GqMEd63LyH","date":"Thu May 12 19:12:18 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"As Putin desperately accelerates his brutality in Ukraine, the House passed a $40 billion bipartisan, bicameral supplemental funding bill to #SupportUkraine: \n 🇺🇦 Military aid\n 🇺🇦 Support for the Ukrainian economy\n 🇺🇦 Humanitarian assistance https://t.co/2XuRL1DhAp","date":"Wed May 11 19:39:33 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"My #FairHiringInBanking Act is scheduled to pass the House this week!\n\nFor 78 million justice-involved individuals and our understaffed financial services institutions, this bipartisan bill is a gamechanger. Keep your eyes peeled for a full floor vote in the days to come. https://t.co/m2sOJ1ocup","date":"Tue May 10 21:05:18 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The Biden Administration is increasing speeds and lowering prices for high speed internet. \n\nVisit https://t.co/BNhDg0MWD5 to see if you qualify for fast, reliable internet at no cost to you.","date":"Mon May 09 19:27:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"To all the moms in #OH03 and around the world, #HappyMothersDay! https://t.co/vObrGAvPpw","date":"Sun May 08 13:29:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Abortion bans will not stop abortions. They will just stop women from getting the safe healthcare they need.\nhttps://t.co/9yCBCu6J26","date":"Sat May 07 21:37:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Under President Biden, we are experiencing a #SmallBusinessBoom!\n\nNew business applications hit a RECORD high with over 5 million applications submitted in 2021 alone! https://t.co/IKy1Sn72fb","date":"Fri May 06 23:05:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Congratulations @KJP46!","date":"Thu May 05 20:42:08 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy #JewishAmericanHeritageMonth! \n\nThis May, join me in celebrating the extraordinary contributions of Jewish Americans and working to combat antisemitism. #JAHM2022 https://t.co/fr3gOAPfzR","date":"Thu May 05 20:03:09 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This week, I paid a visit to the 8th graders of Blendon Middle School (Go Bulldogs!) to talk about my role in Congress and their role in shaping the future of America. \n\nI also got to wish a happy #TeacherAppreciationWeek to the educators who make it all possible. https://t.co/H0uiPqBNvR","date":"Wed May 04 15:59:52 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"If, in fact, this opinion is issued, it will have tragic, far reaching impacts on American women, particularly women of color. \n\nA woman’s right to govern her body is a fundamental human right, which must be enshrined in law. #RoeVWade \nhttps://t.co/OdWCXPqDIR","date":"Tue May 03 14:30:33 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tomorrow is #ElectionDay in Ohio!\n\nPolls are open 6:30AM-7:30PM. Find your polling location and make your voice heard! https://t.co/kHUHsBMCMz","date":"Mon May 02 18:44:28 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I voted YES on the Asset Seizure for Ukraine Reconstruction Act, because it will seize &amp; sell assets of Putin’s cronies to help Ukraine. It’s time to #SanctionPutinsCronies. https://t.co/l9Mi4Qs1Ud","date":"Fri Apr 29 14:21:10 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Have any old Rxs in the cabinet that are expired or just not needed? \n\nThis Saturday is National Prescription Drug Take Back Day. Help keep your community safe by finding a drop off site near you.\n\nhttps://t.co/nCJ1KZQzra","date":"Thu Apr 28 15:10:14 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#DidYouKnow You have a right under federal law to a free copy of your credit report every 12 months. \n\nThe 3 nationwide credit bureaus have a centralized website, toll-free phone number, &amp; mailing address. \n💻: https://t.co/gERQf6ijki \n☎️: 1-877-322-8228\n#FinancialLiteracyMonth","date":"Wed Apr 27 17:54:56 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"My Congressional website just got a facelift.\n\nGo take a look 👇🏾\nhttps://t.co/MsUXxQXrUF","date":"Tue Apr 26 14:30:31 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus #ThingsYouShouldNeverMessWith https://t.co/KKsgFLbPSz","date":"Tue Apr 26 13:39:55 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy Earth Day! While we celebrate our environment, we must make serious changes to combat the devastating impacts of climate change and invest in our planet for future generations. By tackling the climate crisis head on, we can build a stronger, healthier, and fairer America. https://t.co/U1Erog5NVr","date":"Fri Apr 22 14:20:03 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"April is #FairHousingMonth! The federal #FairHousingAct prohibits housing discrimination, including setting different terms and conditions for housing opportunities based on:\n\n✊🏿race\n👧🏾color\n♀️sex\n🇸🇴 national origin\n👩‍👦familial status\n👩🏽‍🦽disability\n🕍religion\n#KnowYourRights https://t.co/2EHLA1T2g0","date":"Tue Apr 19 17:58:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"If none of these catch your eye, keep looking, there are even more opportunities here: https://t.co/aejWBCNEg0\n\nHowever you choose to give back, just get out there and do it! Your community needs your help! (7/7)","date":"Tue Apr 19 15:26:06 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Joining the Litter Clean-Up Competition in Franklinton. (6/7) https://t.co/fkUW5NRM58","date":"Tue Apr 19 15:26:05 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Getting in touch with your creative side and helping @FurnBankCOH in the furniture woodshop. (4/7) https://t.co/WS7E0TWRyM","date":"Tue Apr 19 15:26:05 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Getting in the weeds by helping @SSCH1919 with their urban farm. (5/7) https://t.co/aepXgI8BQM","date":"Tue Apr 19 15:26:05 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Sorting donations for homeless youth with @StarHouseCbus. (3/7) https://t.co/qMEFLrWGuS","date":"Tue Apr 19 15:26:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"🧵 Calling all OH-03 residents! It's #NationalVolunteerWeek, and what better way to spend it than giving back to our Central Ohio community? \n\nYou can give back by... (1/7)","date":"Tue Apr 19 15:26:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Packing and sorting food with @mofcollective. (2/7) https://t.co/xZgw3ZK8Er","date":"Tue Apr 19 15:26:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"As part of the #AmericanRescuePlan, Democrats expanded the #ChildTaxCredit.  \n\nFor every $1 invested, the #CTC provides $10 in economic benefits. \nhttps://t.co/1zEEX5tk6q","date":"Mon Apr 18 15:18:12 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨ACTION NEEDED🚨\n\nRemember to file your taxes by TOMORROW, April 18th! Don’t leave any money on the table! https://t.co/wVEqL34Uw2","date":"Sun Apr 17 23:25:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"May the miracle of Easter bring you blessings, love, and joy! Happy Easter! https://t.co/FYMM3Sst2M","date":"Sun Apr 17 12:00:30 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Chag pesach sameach to everyone observing Passover! May your seders be a joyous celebration of freedom, faith, and perseverance in the face of overwhelming adversity. https://t.co/JOoAdb9c3y","date":"Fri Apr 15 21:00:08 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"For all those celebrating, may this blessed Good Friday bring you mercy, peace, and love. https://t.co/V7lTLRQyfM","date":"Fri Apr 15 14:00:33 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"⌛Time is running out⏳\n\nMake sure to file your taxes by April 18th to get your refund as quickly as possible. Learn more about free filing software here 👇🏾 https://t.co/wVEqL34Uw2","date":"Wed Apr 13 20:40:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"During #BlackMaternalHealthWeek, we recognize all the efforts of everyone who has spoken out and taken action to address the heart-wrenching Black maternal health crisis in our country.\n#BMHW22 https://t.co/HA3w1VtKIX","date":"Wed Apr 13 15:14:32 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"We know the facts.\n\nBlack mothers are nearly 3x as likely to die in childbirth.\n\nInfant mortality is nearly 2x as high in Black communities.\n\nWe need the #Momnibus Act to invest in communities and give Black mamas &amp; babies the care they deserve.\n\n#BlackMaternalHealthWeek #BMHW22","date":"Mon Apr 11 15:54:28 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Have you filed your taxes? April 18th is the LAST day you can file. Don’t wait and stress about the process. File today and get your refunds sooner! https://t.co/wVEqL34Uw2","date":"Sun Apr 10 23:09:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to join some of my congressional colleagues to witness history at the @WhiteHouse today. #JusticeKetanjiBrownJackson https://t.co/34HTp3iU4C","date":"Fri Apr 08 18:31:06 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"You know @TheBlackCaucus will be there to celebrate!","date":"Fri Apr 08 14:11:47 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus has stood with #JudgeKetanjiBrownJackson since the beginning and we’ll be standing with her when she takes the bench later this year. \n\nToday’s vote has shattered another glass ceiling.\n\n#JusticeKetanjiBrownJackson https://t.co/7njyhK2MeW","date":"Fri Apr 08 01:44:52 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"“My parents taught me that, unlike the many barriers that they had to face growing up, my path was clearer—such that if I worked hard and believed in myself, in America I could do anything or be anything I wanted to be.”\n\n-#JusticeKetanjiBrownJackson https://t.co/d5f95kYUBd","date":"Thu Apr 07 18:38:27 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today is the day.\n\nJudge Ketanji Brown Jackson will be our next #SCOTUS justice.","date":"Thu Apr 07 15:18:25 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"At today's @FSCDems hearing, I asked @SecYellen for the latest news on Ukraine refugee aid and the #Tubman20. Watch it all here 👇🏾 https://t.co/ynV8cdyExT","date":"Wed Apr 06 20:05:38 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"While Big Oil companies are reaping record profits, Americans are suffering at the pump. \n\n@HouseDemocrats are demanding answers. It’s time for Big Oil to explain why they’re #RippingOffAmericans. https://t.co/xNfN1bs4pr","date":"Wed Apr 06 16:29:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Early voting for Ohio primary elections has officially begun! \n\nNow is the time to request your absentee ballot, learn more about the candidate and races, and make your voice heard!\nhttps://t.co/XcDkhLjMuO","date":"Tue Apr 05 16:32:50 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@HouseDemocrats are taking strong action to lower costs for American families with the Affordable Insulin Now Act – bipartisan legislation to cap families’ out-of-pocket costs for insulin at $35/month.\n\nhttps://t.co/tBqRY76Rly","date":"Tue Apr 05 15:49:31 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"54 years ago today, Dr. Martin Luther King Jr. was murdered in Memphis, Tennessee.\n\nTonight, I joined together with @OfficialMLK3 and the King family at the King Memorial for a candlelight vigil in remembrance of Dr. King. https://t.co/RhotAsxPzc","date":"Tue Apr 05 02:40:59 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#KetanjiBrownJackson is making HISTORY! \n\nJoin @MishaCollins and I LIVE on Instagram @ 5:30PM to learn more about this historic moment.\n\n#ConfirmJudgeJackson #WinWithBlackWomen https://t.co/WmoWs21xz7","date":"Mon Apr 04 16:16:05 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨ACTION NEEDED🚨 \n\nOhio, TOMORROW is the LAST day you can register to vote in the May primaries. Voting is the first step in making a change, and it’s important to show your power while voting rights are under attack. Register now! https://t.co/6be1Y7WNGL","date":"Sun Apr 03 23:01:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Calling all OH-03 residents! \n\nToday is Community Day at the Franklin Park Conservatory and Botanical Gardens! Bring your Columbus or Franklin County ID to receive free general admission to the gardens, collections, and exhibits. This is a day you don’t want to miss!","date":"Sun Apr 03 15:30:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ramadan Mubarak! For all those celebrating, may this Ramadan bring you prosperity and joy! https://t.co/eLKpHUbWIn","date":"Sat Apr 02 22:00:05 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Everyone’s favorite time of the year is here. Tax season can be overwhelming, but the IRS is setting out to make this task easier. Learn more about the IRS’s free filing options for Americans who make less than $73,000 a year here 👇🏾 https://t.co/wVEqL34Uw2","date":"Sat Apr 02 21:35:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"105 years ago, Jeannette Rankin was sworn in as the first woman in Congress. Throughout her tenure, Rankin fought for women’s suffrage, labor workers, and better healthcare for women and children. Thank you Rep. Rankin for opening the doors for women to hold national office. https://t.co/E8KkGJp1x6","date":"Sat Apr 02 20:44:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The new #JobsData shows MASSIVE economic growth under @POTUS Biden:\n\n⏫431,000 jobs added in March\n\n⏬Unemployment rate fell to 3.6%\n\n🚀An average of 565,000 jobs added a month under President Biden https://t.co/iZFHIXajl7","date":"Fri Apr 01 16:17:08 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#BidenBoom","date":"Fri Apr 01 14:41:55 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"26% of Americans with diabetes ration their insulin at least once a year.\n\nNo one should put themselves at grave risk because of the cost of their meds. \n\nThat’s why I’m voting to pass the #AffordableInsulinNow Act to cap the cost of insulin at $35/month. https://t.co/7AVZ0JkQzv","date":"Thu Mar 31 16:40:05 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to support @RepAdams and the @HBCUCaucus for the 5th Annual #HBCUSTEAM Day of Action! HBCUs make up more than 1/3 of Black STEM degrees, and the #HBCUPartnershipChallenge is forging sustainable partnerships to create more jobs and resources for our HBCU students.","date":"Thu Mar 31 15:41:14 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, on Transgender Day of Visibility, we celebrate and support trans people everywhere. Trans people exist and deserve to live their lives authentically without the fear of discrimination, and our laws must reflect this. #TransDayOfVisibility https://t.co/o62zdnQDt0 https://t.co/5AVwndzRfd","date":"Thu Mar 31 14:44:47 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Yesterday marked the first Ohio Tuskegee Airmen Day!\n\nThese heroic Black men bravely and skillfully defended our nation while facing discrimination at home.\n\nI was proud to honor their sacrifices and uplift their legacies on the House floor. https://t.co/RvXIFAoBYK","date":"Wed Mar 30 15:24:56 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In 1955, the lynching of 14-year-old Emmett Till sent shockwaves through the country and ignited the civil rights movement. \n\nToday, @POTUS is finally making lynching a federal hate crime by signing @RepBobbyRush’s #AntilynchingAct into law. https://t.co/M0tV3DWdCb","date":"Tue Mar 29 20:15:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #BidenBudget takes historic steps to combat the Climate Crisis, including:\n🔋 Investing in clean energy infrastructure\n🌊  Strengthening climate resilience\n🌎Advancing equity &amp; environmental justice\n💰 Putting $11 billion toward international climate finance","date":"Tue Mar 29 17:01:41 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"HAPPENING NOW: @FSCDems are holding a hearing to discuss how discrimination in home appraisals disproportionately harms communities of color. \n\n📺WATCH LIVE📺\nhttps://t.co/LC5f9BS4Eh","date":"Tue Mar 29 14:07:48 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"While there are multiple factors to this issue, bias in the home valuation process is a barrier for communities of color. The appraisal industry lacks diversity and has shifted from independent appraisers to automatic processes. (3/5)","date":"Mon Mar 28 19:15:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The current bias in the appraisal process has harmed communities of color for far too long. Join @FSCDems tomorrow as we investigate this problem and discuss solutions. (5/5)","date":"Mon Mar 28 19:15:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This shift has not eliminated bias in appraising. In 2018, homes in neighborhoods where 50% of residents are Black are valued 50% less than areas with no Black residents. In most Black neighborhoods, Black owned houses are undervalued on average by $48,000 per home. (4/5)","date":"Mon Mar 28 19:15:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In 2019, homeownership increased, and during the pandemic, equity rose by over 29%. However, communities of color were consistently locked out of the benefits of this housing boom. According to one study, homeownership makes up ~27% of the Black-White wealth gap. (2/5)","date":"Mon Mar 28 19:15:06 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Housing is a human right. Period. \n\nTomorrow, @FSCDems are holding a hearing to learn more about how bias in the housing appraisal process hurts homeowners and disproportionately affects people of color. (1/5) https://t.co/929gUzo9Ra","date":"Mon Mar 28 19:15:06 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"📆MARK YOUR CALENDARS📆\n\nThe tax filing deadline is April 18th this year. Make sure to file your taxes to get your return as soon as possible! https://t.co/wVEqL34Uw2","date":"Fri Mar 25 22:28:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Sitting before the Senate Judiciary Committee today, it felt more real than it ever has before. \n\nWe are going to have a Black woman on the Supreme Court. https://t.co/5uXngEaDt3","date":"Thu Mar 24 22:38:50 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I want to be crystal clear, Judge Ketanji Brown Jackson will be a judge that will serve all of America, a judge who all Americans can be proud of, and she has the full support of @TheBlackCaucus. #SheWillRise https://t.co/MtdZIRmpak","date":"Thu Mar 24 20:19:11 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Judge Jackson is an exceptionally qualified jurist of unimpeachable character. \n\nIt's an honor to support her as our next #SupremeCourt Justice. https://t.co/F1A8jkSOqx","date":"Thu Mar 24 14:19:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I'm testifying on behalf of #JudgeKetanjiBrownJackson at this Morning's Senate Judiciary hearing!\n\nTune in now 👇🏾\n\nhttps://t.co/RmWVzzbOtr","date":"Thu Mar 24 13:42:16 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tomorrow I have the honor of speaking to the Senate Judiciary Committee on behalf of #JudgeKetanjiBrownJackson during the fourth day of her confirmation hearings. \n\nTune in here tomorrow at 9 AM to watch it all live👇🏿\nhttps://t.co/f288MOQeMR","date":"Wed Mar 23 19:28:11 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy 12th birthday to the #ACA! \n\n12 years ago, President @BarackObama signed the Affordable Care Act into law. Now, 786K+ Ohioans and 31+ million Americans have affordable health care coverage through the landmark bill. \n\nRT with your ACA story! #ACAHereToStay","date":"Wed Mar 23 15:24:34 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Want to talk resumes? \n\nJudge Jackson has served as a:\n✅Federal appellate judge\n✅Federal district court judge\n✅Member of the U.S. Sentencing Commission\n✅Private Practice attorney\n✅Federal public defender\n\n#SheWillRise \nhttps://t.co/23LWHnPBol","date":"Tue Mar 22 13:18:18 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"They believed they could, so they did! \n\nCongrats to @OhioStateWHKY on their FIRST national championship in program history! Here’s to many more! #GoBucks https://t.co/FXJQVv7m3M","date":"Mon Mar 21 17:26:38 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today is the day #SheWillRise — Judge  Ketanji Brown Jackson, we stand with you. https://t.co/IgJBAJSK9h","date":"Mon Mar 21 14:22:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"We can help Americans AND cut the deficit, and we’ve got the data to back it up. We are already on track to cut the deficit by over $1 trillion, the largest 1 year reduction in history! https://t.co/IZSWVOe3Vm","date":"Sun Mar 20 23:21:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Putin’s war of choice is already driving up cost of living for Americans, but Democrats are fighting back. To stand up to the #PutinPriceHike, we’re releasing strategic oil reserves and investing in an American-made future.","date":"Sat Mar 19 23:15:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"After a crushing pandemic, small businesses are roaring back under President Biden. Since January 2021, 5.4+ million new small businesses have opened their doors, and more are opening every single day. https://t.co/9WS9YzfBkS","date":"Sat Mar 19 20:47:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"We are not backing down from our support for Ukraine. Beyond $13.6 billion in direct aid to Ukraine, Congress and POTUS are continuing to isolate Russia from the global economy and making Putin pay for his war of choice.","date":"Fri Mar 18 22:27:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Black women and girls deserve to wear their hair with pride wherever they go — especially school and the workplace. \n \nThat’s why I just voted YES to pass the #CROWNAct. Now on to the Senate!","date":"Fri Mar 18 15:06:32 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"With 6.6+ million new jobs, we are building the economy from the bottom up, not the top down. More manufacturing jobs were created in any year since 1994, with even more to come. https://t.co/4cNj3lN96e","date":"Fri Mar 18 04:13:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to preside over the House Floor while we vote to suspend normal trade relations with Russia and Belarus and prohibit forced arbitration in contracts involving consumer, employment, antitrust, and civil rights disputes. \n\nJust another day on Capitol Hill! https://t.co/EZusSkMwVw","date":"Thu Mar 17 20:29:24 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"As we celebrate #WomensHistoryMonth, I'm proud the latest funding bill supports pay raises, increased allowable parental leave, and codified reforms to the Uniform Code of Military Justice. When we support women who wear the uniform, we're investing in America's national security https://t.co/sTNsg6eh4N","date":"Thu Mar 17 19:00:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@RepBobbyRush’s Emmett Till #AntilynchingAct is officially heading to @POTUS’ desk. \n\nAfter generations of fighting, we are just one signature away from lynching being designated a federal hate crime. https://t.co/kiqG9Wp37W","date":"Wed Mar 16 20:55:42 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am thankful for the years of work from colleagues and advocates that made this law a reality. With this new law, we can begin to dismantle the housing barriers that can make people vulnerable to this heinous crime in the first place.","date":"Tue Mar 15 20:55:18 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am beyond proud to see my Trafficking Survivors Housing Act signed into law as part of the #VAWA reauthorization. Trafficking survivors deserve the chance to rebuild their lives through access to safe and affordable housing. \nhttps://t.co/4Xsws2kKjN","date":"Tue Mar 15 20:55:17 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, women make $0.83 for every $1 a man makes. \n\nThe pay gap isn’t just a women’s issue, it’s a problem for all working families, but still every GOP Senator has voted against equal pay legislation.\n\nThis #EqualPayDay, we must push to completely close the gender pay gap.","date":"Tue Mar 15 16:23:28 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"👀","date":"Mon Mar 14 23:54:06 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Russia must be held responsible for Putin’s war of choice. Sanctions are vital, and must be used strategically to avoid harming American families. The American people will not be caught in the crosshairs of this war.","date":"Sun Mar 13 19:40:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"When Putin launched his premeditated war on the people of Ukraine, he made a grave error. He believed his actions would divide the US from our European allies, but his aggression has united the world against authoritarian thugishness.","date":"Sat Mar 12 22:57:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"@RepHankJohnson @rolandsmartin @instagram @TheBlackCaucus @bma_coalition @blackvoices @Mvmnt4BlkLives @BlackVotersMtr @WeDemandJustice @FixTheCourt @HouseDemocrats @HouseDPCC @angela_rye Thanks for taking the lead on standing up for Black media— the CBC is proud to join you","date":"Sat Mar 12 20:27:22 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Democrats are rebuilding our economy from the ground up. Since Biden took office we’ve seen\n\n🧰 Greatest year in job growth\n📈 Fastest economic growth since the 80s\n📉 Largest drop in unemployment\n\nWe know people are struggling and we are making sure the recovery helps everyone.","date":"Fri Mar 11 22:08:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This is #DeltaLove! Always an honor to celebrate with @DSTinc1913 Sorors. \n\n#DDNC2022 #DST1913","date":"Fri Mar 11 20:32:36 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Over the past year, my office has worked closely with community stakeholders to determine where investment would be maximized across Franklin County, and today that work finally bears fruit. \n\nThese funds are proof that Democrats don’t just promise, we deliver.","date":"Thu Mar 10 04:22:34 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"•$450,000 to the Columbus Urban League for the redevelopment and alignment of office space to provide critical business support services and improve access to capital for Black and minority-owned companies in Central Ohio.","date":"Thu Mar 10 04:14:09 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"•$150,000 to Equitas Health to purchase a Mobile Outreach Vehicle (MOVe) to meet the needs of those who often do not or cannot seek out services in an office setting, including telehealth visits, STI/HIV treatment and prevention, vaccine distribution, and linkage to care.","date":"Thu Mar 10 04:14:09 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"•$475,000 to The Ohio State University to establish the RAISE Institute focused the interdisciplinary nature of scholarship on racial inequality and social policy in order to advance policies that will support more socially equitable outcomes for people of all races.","date":"Thu Mar 10 04:14:09 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$500,000 to the Research Institute at Nationwide Children’s Hospital to support the purchase of equipment at the Institute for Genomic Medicine to accelerate clinical &amp; research capabilities by analyzing the genomes of patients w/ cancer and infections (like COVID).","date":"Thu Mar 10 04:14:08 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$500,000 to PAST Foundation to provide students with a summer experience that enables youth to take on the roles of STEM professionals. Plus, over 150 teachers will be trained to design pathway-aligned curriculum, problem-based learning, and connections to STEM professionals.","date":"Thu Mar 10 04:14:08 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"•$500,000 to Franklin County for the construction of the Franklin County Mental Health and Addiction Crisis Center, which will support the wellness of adults in Franklin County.","date":"Thu Mar 10 04:14:08 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"•$500,000 to Columbus Neighborhood Health Center, Inc. to support the establishment of a new health center to provide health care services to low-income, underserved, and uninsured patients.","date":"Thu Mar 10 04:14:08 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"•$750,000 to CHOICES for Victims of Domestic Violence, the only domestic violence shelter in Franklin County, to operate a new wing, adding 24 more beds and living space.","date":"Thu Mar 10 04:14:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"•$610,000 for Huckleberry House, Inc, in partnership with Star House and the Kaleidoscope Youth Center to provide services to young people experiencing homelessness.","date":"Thu Mar 10 04:14:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"•$850,000 to YWCA Columbus for safety renovations and improvements to amenities at the emergency homeless shelter, which serves approximately 500 families annually.","date":"Thu Mar 10 04:14:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"🧵 NEW: Tonight, the House passed over $5 million in funding for community projects in Franklin County!\n \nI am tremendously proud to have secured these key federal dollars to directly benefit the people of #OH03. What’s included:","date":"Thu Mar 10 04:14:06 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s amazing when the stars align and I get to celebrate #InternationalWomensDay with \n@DSTInc1913 \nNational President Elsie Cooke-Holmes and the women of Delta Sigma Theta! #DDNC2022 #DST1913 https://t.co/pVY8vdLNVr","date":"Tue Mar 08 20:16:10 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Amid global and national crises, @POTUS Biden and @VP Harris have been unwavering allies to @TheBlackCaucus and the Black community as a whole.  (1/2) https://t.co/G8cLreJxgD","date":"Tue Mar 08 17:55:57 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Yesterday’s meeting at the White House saw tremendous steps on everything from voting rights to HBCU bomb threats to Africans in Ukraine, and we’re looking forward to more discussion in the days and weeks to come. (2/2)","date":"Tue Mar 08 17:55:57 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@FSCDems recognize that inflation is real and it’s squeezing American families. Join us LIVE as we talk about how we can address inflation &amp; the economy while we #BuildABetterAmerica .   https://t.co/2lnL253Hcs","date":"Tue Mar 08 15:48:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"When the GOP says they want to take away your healthcare, believe them. https://t.co/XmbrrSdvzl","date":"Mon Mar 07 20:21:28 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I was so proud to join civil rights leaders from across the nation in Selma on the 57th anniversary of Bloody Sunday.\n\nWe marched the same streets which saw bloodshed not six decades ago, and will continue to arch until we see the full restoration of the #VotingRightsAct of 1965. https://t.co/fKy7dhmjfQ","date":"Mon Mar 07 00:30:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"President Biden and @HouseDemocrats are #BuildingABetterAmerica by fixing supply chains, boosting competition, strengthening US manufacturing, and lowering costs for all Americans. Together, we have achieved the fastest economic growth in almost 40 years! https://t.co/JL0jSJjV1o","date":"Sun Mar 06 19:38:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Only the GOP would make working parents and seniors the target of tax hikes. Under the new Republican agenda, American families would pay thousands more per year while wealthy corporations would STILL pay next to nothing. Disgraceful. https://t.co/dsq9BX9Vlc","date":"Sat Mar 05 23:17:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thrilled to say the #EndForcedArbitration Act is now law! \n\nEvery survivor deserves justice and the right to tell their story. I’m proud to have helped deliver this vital legislation to the president’s desk.","date":"Thu Mar 03 23:00:23 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Her words, actions, and readiness clearly demonstrate that she has been preparing for this moment her entire life. Beyond her impressive resume and decades of experience, she exhibited a personal, human touch that is too often lacking in America’s legal system. (3/4)","date":"Thu Mar 03 18:37:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am fully confident that she will thrive on the bench and embrace the solemn duty that comes with this lifetime appointment. (4/4)","date":"Thu Mar 03 18:37:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"She had a grounded energy that I have seen in few other judicial nominees. We spoke not only about the history she will make as the first Black woman to sit on the Supreme Court, but of the legacy she will leave for second, third, and beyond. (2/x)","date":"Thu Mar 03 18:37:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"🧵Today I had the pleasure of speaking with our next #SCOTUS Justice, Judge Ketanji Brown Jackson. Within moments of speaking to Judge Jackson, it was clear why @POTUS Biden chose her as his first nominee to our nation’s highest court. (1/x) https://t.co/mo5fHAkGUu","date":"Thu Mar 03 18:37:03 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#TBT to 2015 when I had the opportunity to hear our second female SCOTUS Justice, the late, great RBG, speak about #WomensHistoryMonth. Now, we are poised to confirm our next female SCOTUS Justice, Judge Ketanji Brown Jackson! https://t.co/UFfwRuXPjg","date":"Thu Mar 03 15:05:06 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#OnThisDay in 1955, 9 months before Rosa Parks’ arrest, 15 year old Claudette Colvin was arrested for not giving up her bus seat in Montgomery, Alabama. Her bravery and activism made the Civil Rights movement possible, and we recognize her as the icon she is. #WomensHistoryMonth https://t.co/1JdUzCuo5B","date":"Wed Mar 02 20:57:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, I met with Intel CEO @PGelsinger to discuss the company’s historic investment in Central Ohio after he joined @POTUS as a guest during last night's State of the Union. (1/2) https://t.co/HCZS0Rhw6x","date":"Wed Mar 02 19:42:30 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I was pleased to learn that Intel is ready to increase their investment beyond the $20 billion for their semiconductor mega site and make Columbus home to one of the biggest manufacturing investments in American history. (2/2)","date":"Wed Mar 02 19:42:30 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Last night, I heard @POTUS outline the path to a stronger, healthier, and more united America. \n\nThere is so much more that unites us than divides us. Now we must build on our progress to shore up our democracy, grow our economy, and build a better America for us all! #SOTU https://t.co/8rVPFCldsi","date":"Wed Mar 02 17:43:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tonight, President Biden laid out a clear message for every American: We are building a better America, and the state of our union is strong. #SOTU2022 https://t.co/WfXeq1ADO5","date":"Wed Mar 02 03:35:40 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ahead of the #SOTU @StarJonesEsq, Bishop @LeahDaughtry, @CoalitionBuildr, @FinneyK, @JotakaEaddy, @DonnaBrazile, and Black women across the country are standing together in support of our nation and our next Supreme Court Justice, Judge Ketanji Brown Jackson! https://t.co/uE3M476xps","date":"Wed Mar 02 01:09:30 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I'm proud to stand alongside my colleagues from both sides of the aisle to make it clear: America stands with the people of Ukraine 🇺🇦 https://t.co/J3vntWMiOI","date":"Tue Mar 01 21:39:11 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"For #WomensHistoryMonth, I’m highlighting hometown hero Letha Pugh, the history-making owner of @BakeMeHappyGF!\n\nLetha will be also be my virtual guest at tonight’s #SOTU, where @POTUS Biden will highlight how he is speeding up economic recovery for small businesses nationwide. https://t.co/Z4RbYx32c2","date":"Tue Mar 01 19:55:22 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tonight, @POTUS Biden will deliver his first #SOTU!\n\nThe last year has seen historic growth and recovery amid a global pandemic and economic stress felt by every country on Earth.\n\nI am eager to hear our President speak about it all!","date":"Tue Mar 01 16:17:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Discrimination against Black hair is discrimination based on race and ought to be illegal. Period.\n\nWe need @RepBonnie's #CROWNAct!","date":"Mon Feb 28 21:34:23 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#BlackHistoryMonth may be coming to a close, but I am always #FightingForJustice! https://t.co/klXqQcbGjN","date":"Mon Feb 28 21:00:09 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Despite more than 200 attempts, the act of lynching has NEVER been designated a federal crime.\n\n@RepBobbyRush’s Emmett Till #AntilynchingAct will change that — and I’ll be voting for it on the House floor tonight. https://t.co/RMyrY4zlME","date":"Mon Feb 28 19:00:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"As the GOP asks the Supreme Court to gut the #CleanAirAct, I stand with over 190 congressional Democrats who support clean air for every American - and oppose this shameful attack on our health.\n\nClean air shouldn't be a partisan issue.\nhttps://t.co/Ls7n5gB1OF","date":"Mon Feb 28 15:44:51 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Judge Jackson has my full faith and support ahead of her Senate confirmation hearing, which must  proceed without delay. (3/3)","date":"Fri Feb 25 15:36:37 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"From her work on the US Court of Appeals, to her years spent as a federal trial court judge, to her early days as a public defender, Judge Ketanji Brown Jackson is poised to be the most historic and impactful SCOTUS Justice of the 21st century. 🧵 (1/3) https://t.co/qp4ILsjJlg","date":"Fri Feb 25 15:36:37 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Judge Jackson also brings with her the lifetime of learning and perspective of a Black woman, something our nation’s highest court has never seen, making the bench look more like the makeup of our nation. (2/3)","date":"Fri Feb 25 15:36:37 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Putin’s premeditated actions have already brought catastrophe to the people of Ukraine. \n\nWe know full well Russia is responsible for the death and destruction this war will bring. (1/2)","date":"Thu Feb 24 21:34:58 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I stand with @POTUS Biden and our international allies in support of Ukraine. \n\nWith key sanctions and financial restrictions, Russia will pay dearly for the unprovoked violence. (2/2)","date":"Thu Feb 24 21:34:58 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"While the typical Black household’s income has risen since the 1970s, Black households still earn just 62 cents for every dollar earned by white households – a difference of ~$30,000 per year.  #JECxCBC\nhttps://t.co/m7d2O9Qaq1 https://t.co/J7zSncmdQi","date":"Wed Feb 23 17:07:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Recently, I spoke with @Tennis about my love for the sport and its effect on my life. To me, tennis is more than a game, it is a never ending lesson about life. https://t.co/5I8Sbp0Y3H","date":"Tue Feb 22 21:25:54 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tomorrow marks two years since Ahmaud Arbery was lynched in cold blood. \n \nNothing can bring Ahmaud back, but this verdict is a historic victory for justice. #BlackLivesMatter https://t.co/EFsep9BXMf","date":"Tue Feb 22 17:37:27 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Putin’s aggression toward Ukraine is an attack on freedom and democracy. \n\nWe must continue to stand up for democracy at home and abroad and hold autocrats like Putin accountable. https://t.co/mBdlN2aZRH","date":"Tue Feb 22 15:33:17 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy President’s Day! This year, let’s reaffirm our commitment to ensuring ALL Americans can vote for their President in free and fair elections. https://t.co/fU2I8Bqb0A","date":"Mon Feb 21 13:34:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#DidYouKnow In 1967, Ohio made history with the election of Mayor Carl Stokes, the first Black man to serve as mayor of a major American city. #Trailblazer #BlackHistoryMonth https://t.co/aTOgnsTx94","date":"Sun Feb 20 19:32:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"80 years ago today, America authorizing the construction of internment camps  used to forcibly intern 120,000+ innocent people, predominantly Asian Americans. \n\nWe pray for the families scarred by this horrific chapter of our history. May their stories be remembered forever.","date":"Sat Feb 19 19:47:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"\"Oppressive language does more than represent violence, it is violence; does more than represent the limits of knowledge, it limits knowledge.\" -Toni Morrison. #BlackHistoryMonth https://t.co/tXpPJ57Kti","date":"Fri Feb 18 16:37:39 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@HouseDemocrats are electrifying our futures! Thanks to the Bipartisan Infrastructure Bill, Ohio will receive over $20 million to invest in EV charging infrastructure and create great jobs. One step at a time, we are #ElectrifyingAmerica.","date":"Thu Feb 17 14:13:21 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thanks to the #BipartisanInfrastructureLaw, over 10 million families are now enrolled in  the nation’s largest ever broadband affordability program! . See if you’re eligible here: https://t.co/r4ACEtnZEY .","date":"Wed Feb 16 20:57:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This #BlackHistoryMonth, learn the true story of Olaudah Equiano a young boy enslaved in the 18th century who later became a free man and played a critical role in ending England’s enslavement of African people. Launched exclusively on Instagram TODAY! https://t.co/88mrihFZl4 https://t.co/FLSl62GEai","date":"Wed Feb 16 19:37:47 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In 1968, Tommie Smith and John Carlos brought the Black Power movement to the Olympics, standing up against hate and bigotry on a global stage. They made themselves seen when the world refused to listen. We applaud you. #BlackHistoryMonth https://t.co/2gzcLvsfkx","date":"Wed Feb 16 19:25:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"No Black woman has EVER served on the FED Board of Governors. \n\nDr. Lisa Cook is a more than qualified candidate, and the halt on her nomination prevents her from working on our economy’s pressing issues. \n\nToday, I call on the Senate to confirm Dr. Cook. Delay is not an option. https://t.co/LH1g1eW6ct","date":"Wed Feb 16 16:45:06 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I'm LIVE with @CapehartJ to discuss the immeasurable impact Black women have made on US History. Tune in now!","date":"Wed Feb 16 15:49:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"From the Olympic Rings to an engagement ring! Congratulations to gymnastics’ #GOAT @Simone_Biles!","date":"Tue Feb 15 20:01:14 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Roses are red,\nViolets are blue,\nHappy #ValentinesDay,\nAnd Happy #HeartMonth to you! https://t.co/xVzI3PGtny","date":"Mon Feb 14 19:16:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"These are my #Valentines today! ❤️ #BlackHistoryMonth #LearnLiveMakeBlackHistory","date":"Mon Feb 14 17:50:03 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#DidYouKnow Edward R. Dudley was the United States’ first Black Ambassador? He served as Ambassador to Liberia while pushing back on racial barriers back home. #BlackHistoryMonth https://t.co/VZcqS8hOoK","date":"Sun Feb 13 19:54:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Let’s go @Bengals! https://t.co/YTKA5OdUpp","date":"Sun Feb 13 15:39:15 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#OnThisDay in 1909 the NAACP was founded in New York City. For over a century, NAACP has worked to secure civil rights across the nation and continues to fight for Black Americans to this day. Remember, when we fight, we win. #BlackHistoryMonth","date":"Sat Feb 12 20:03:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Republicans Obstruct. Democrats Deliver. https://t.co/Nfa8WBdQtW","date":"Fri Feb 11 19:49:22 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#DidYouKnow @CentralState87, my Alma Mater and the only public HBCU in Ohio, was founded in 1887. CSU has fostered an atmosphere of scholarship and growth for Black students for over 130 years and continues to engage communities and transform lives every day!  #BlackHistoryMonth https://t.co/apBzhvJfvc","date":"Thu Feb 10 16:23:18 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@RepHalRogers, when you are ready to grow up and apologize for your behavior, you know where to find me. (3/3)","date":"Tue Feb 08 19:58:13 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This is the kind of disrespect we have been fighting for years, and indicative of the larger issue we have with GOP Members flaunting health and safety mandates designed to keep us and our staff safe. (2/3)","date":"Tue Feb 08 19:58:12 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"🧵 Today, while heading to the House floor for votes, I respectfully asked my colleague @RepHalRogers to put on a mask while boarding the train. He then poked my back, demanding I get on the train. When I asked him not to touch me, he responded, “kiss my ass.” (1/3)","date":"Tue Feb 08 19:58:12 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #PostalServiceReformAct will:\n\n📪 Ensure USPS is finally on a sustainable financial footing.\n📪 Require USPS to deliver both mail &amp; packages at least 6 days per week.\n📪 Develop an online system to track performance &amp; promote accountability.\n\nI'm voting YES on its passage. https://t.co/LPGIll3lDO","date":"Tue Feb 08 19:53:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Congresswoman Shirley Chisholm’s story is more than her legacy; it’s our future. \n\nShe opened the doors of Congress for Black girls everywhere who dream of standing up for justice. \n\nShe was #Unbought and #Unbossed, and @TheBlackCaucus thanks her. https://t.co/6mc1Ipdl7X","date":"Tue Feb 08 16:31:07 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Strong. Honored. Beloved.\n\nJust a few words to describe the legacy of Ohio's own Toni Morrison.\n\nYours, mine, ours, we are Black History. Pass it on. #LearnLiveMakeBlackHistory.  #BlackHistoryMonth https://t.co/eZkVADByUO","date":"Mon Feb 07 19:00:59 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thank you to Ms. Culpepper, Ms. Miller, and all of the amazing school counselors throughout #OH03! \n\nSchool counselors are an invaluable resource who dedicate their careers to helping all students reach their full potential. Happy #NSCW22!","date":"Mon Feb 07 16:24:14 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Black communities have been hit harder by the HIV/AIDS crisis than any other racial or ethnic group in the United States. This #NBHAAD, let’s end the stigma surrounding this disease and work to #StopHIVTogether. #BlackHistoryMonth https://t.co/Gqg9LXQRqT","date":"Mon Feb 07 14:07:46 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy heavenly birthday to Rosa Parks. \n\nHer legacy lives on this #BlackHistoryMonth and every day we fight for justice. https://t.co/aIaWlomDX4","date":"Fri Feb 04 18:57:52 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"As a stroke survivor, I stand with @AmHeartOhio and @American_Heart to #GoRedForWomen during #HeartMonth! \n\nAdvocating for heart health will always be a personal priority, particularly for women of color, who face deadly inequities in access to care. #GoRedCbus https://t.co/jKTIW6teR0","date":"Fri Feb 04 16:23:25 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"So proud to represent @DSTInc1913 with the Honorable Cheryl Johnson today at the dedication of the Joseph H. Rainey Room! https://t.co/04tuNBohe5","date":"Thu Feb 03 20:19:42 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Time and time again, over-qualified Black women face smears and dog whistles from Republicans who do nothing but gatekeep positions of influence. \n\nWhat is it about powerful Black women that makes the GOP so nervous?\n\nhttps://t.co/RPmOFtl9Qr","date":"Thu Feb 03 19:54:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The impact of the #BipartisanInfrastructureLaw will be felt for generations to come. \n\nBut that impact will be even greater if an equitable share of the investment is made in minority and women-owned businesses.\n\nTune into my @FSCDems #DiversityandInclusion hearing to learn more!","date":"Thu Feb 03 15:01:41 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Everyone deserves a place to call home. \n\nBy creating vouchers for unhoused individuals and survivors of domestic violence and human trafficking, @HouseDemocrats are turning the corner in the effort to house the 580,000+ people who are homeless on any given night in America. https://t.co/zvXhwWnCHJ","date":"Wed Feb 02 23:58:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I believe in the #CancerMoonshot! \n\nThat’s why I’m calling for swift passage of H.R. 1946, the Medicare Multi-Cancer Early Detection Screening Coverage Act. \n\nEarly detection saves lives! https://t.co/cqCuCkVjU4","date":"Wed Feb 02 21:02:24 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"On March 7, 1965, a day we now call Bloody Sunday, civil rights protesters marching from Selma to Montgomery tried to cross the Edmund Pettus Bridge. They were met with unimaginable violence. While they did not cross the first time, they did not give up. #BlackHistoryMonth (1/2) https://t.co/xvdeC1z734","date":"Wed Feb 02 20:54:15 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This is a story of progress. These great men and women may have been terrorized, but they were not deterred in their fight for justice. Still today, we continue that fight. We will not stop our push until the right to vote is protected for ALL Americans. #BlackHistoryMonth (2/2)","date":"Wed Feb 02 20:54:15 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Cancer doesn't care who you are, where you're from, or who you voted for, so fighting it MUST be a bipartisan effort.\n\n@POTUS Biden's #CancerMoonshot will change the way Americans detect, fight, and eventually beat cancer.","date":"Wed Feb 02 19:13:44 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus is ready for a moonshot!\n\nTogether with @POTUS Biden, we will work to cut cancer deaths in HALF over the next 25 years. https://t.co/Ach9qyPzkA","date":"Wed Feb 02 19:06:24 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Yesterday, I had the honor of celebrating the new Maya Angelou quarter with my congressional colleagues. \n\nWe are proud to honor her story of resilience and hope this #BlackHistoryMonth! https://t.co/bY9pi7fOOi","date":"Wed Feb 02 17:02:29 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Housing is a human right. Period.\n\nTune in to the latest @FSCDems hearing to learn what @HouseDemocrats are doing to get more Americans in safe, secure, and affordable homes.\n\nhttps://t.co/0zPydtyfBB","date":"Wed Feb 02 15:33:27 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"This alarming string of bomb threats on the campuses of Historically Black Colleges and Universities is unacceptable. HBCU students deserve a safe place to further their education, without fearing for their lives. https://t.co/S5BS6xTUfF","date":"Tue Feb 01 16:31:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In that spirit, I will use my voice to continue speaking truth to power and remain committed to ensuring equal justice, equality, and equity for everyone—following in the footsteps of the trailblazers who boldly walked before us. That is #OurPowerOurMessage.","date":"Tue Feb 01 14:45:42 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"We know Black history is American history, so I hope all of our nation will join the Congressional Black Caucus in celebrating the storied history and significant contributions Black Americans have made and continue to make. #BlackHistoryMonth https://t.co/dnBZsO6T9r","date":"Tue Feb 01 14:45:41 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"A lot has changed in our country since the first #SocialSecurity check went out 82 years ago. \n\nI cosponsored @RepJohnLarson's Social Security 2100: A Sacred Trust Act because the vital program needs to meet the needs of a 21st Century America! #Secure2100 https://t.co/hBpdY3qHa3","date":"Mon Jan 31 19:15:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"4 former Ohio State Buckeyes are playing for a shot to win the Bengals 1st Super Bowl! I can’t wait to cheer them on at #SuperBowlLVI! #GoBucks #WhoDey #OhioAgainsttheWorld https://t.co/qhyFvf14VI","date":"Mon Jan 31 17:54:11 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thirteen years ago today, President Obama signed the Lilly Ledbetter Act into law, restoring the protection against pay discrimination that was stripped away by SCOTUS in Ledbetter v. Goodyear Tire &amp; Rubber Co. \n\nWhile we've made progress, more must be done to ensure #EqualPay. https://t.co/vXFxlSE1tk","date":"Sat Jan 29 14:47:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Congratulations to Laurie Leshin on being appointed the first woman to run @NASAJPL! #WomenInSTEM https://t.co/b3jYVePytr","date":"Fri Jan 28 18:21:38 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thank you @POTUS Biden for continuing to honor your word. \n\nIt’s time to see a Black woman on the SCOTUS bench.","date":"Thu Jan 27 18:45:41 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, on #HolocaustRemembranceDay, we mark 77 years since the liberation of Auschwitz. #WeRemember these horrors and continue to stand up to anti-Semitism and bigotry of all kinds. \n\nMy prayers are with victims, survivors, and families. We must #NeverForget. https://t.co/dgNeUOaHt6","date":"Thu Jan 27 16:06:20 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I’m so proud to see my husband Otto’s legacy of fighting for civil rights and social justice live on today. \n\nI know Walton + Brown will embrace the spirit and passion that Otto brought to his work every single day. \n\nhttps://t.co/LoafSrB0OX","date":"Wed Jan 26 19:54:38 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"As a longtime advocate for diversity &amp; inclusion, I'm looking forward to @POTUS following through on his commitment to appoint a highly-qualified &amp; experienced Black woman to SCOTUS.\n\nWe must not miss this opportunity to make our highest court better reflect our nation.","date":"Wed Jan 26 19:35:14 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"My beloved husband Otto would have celebrated his birthday, January 26th, with us today.\n\nWhile he's not with us on Earth, I know he's dancing with the angels or holding court.\n\nHe gave me strength, courage, and love to last a lifetime. I miss him dearly.\n\nHappy Birthday Otto. https://t.co/H2ZBwf4vQ2","date":"Wed Jan 26 17:01:45 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"On this day 50 years ago, Shirley Chisholm became the first woman &amp; African American to run for president—4 years after she became the first Black Congresswoman.\n \nMy career in public service rests on her contributions. Proud to honor her legacy this year. #ChisholmTrail✌🏿 https://t.co/rQ76DGEGI1","date":"Tue Jan 25 16:54:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s an honor to be listed among the likes of @TomHanks, @Cher, and Dr. Fauci as one of HelpAge USA’s 60 Over 60! https://t.co/3k5bL2q0IG","date":"Mon Jan 24 14:40:41 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"58 years ago today, the 24th Amendment was ratified.\n \nThe historic, bipartisan effort banned discriminatory poll taxes in the United States.\n \nToday, we face another rising tide of voter suppression.\n \nThe Senate must pass much-needed voter protection legislation.","date":"Sun Jan 23 14:16:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The time to protect #Roe is now, because reproductive rights are human rights! https://t.co/M5HN4J9Apw","date":"Sat Jan 22 14:28:01 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In just one year, @POTUS Biden and @VP Harris have delivered:\n💉 530+ million vaccines in arms\n📈 6.4+ million new jobs, outpacing China for the first time in 20 years\n🚂 $1.2 trillion to revitalize American infrastructure","date":"Thu Jan 20 23:11:50 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"It is with deep sorrow that I share my condolences on the passing of The National President of Delta Sigma Theta Sorority, Incorporated, Soror Cheryl A. Hickmon. A powerful leader, a force for social action, and a loving sister, we will uplift her legacy now and forever. https://t.co/fFpzivLfII","date":"Thu Jan 20 22:38:46 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Yesterday, I led the @TheBlackCaucus on a march to the Senate to demand swift passage of the Freedom to Vote: John R. Lewis Act. \n\nToday, the fight continues. https://t.co/Y7qIWO5Uns","date":"Thu Jan 20 22:25:14 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The silence from Mitch McConnell is deafening, so let's give him even more proof that Black Americans ARE Americans. #MitchPlease https://t.co/YzxVsjcw69","date":"Thu Jan 20 18:33:37 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#MitchPlease, I’m an American 365 days a year. https://t.co/2elPimBebY","date":"Thu Jan 20 15:45:25 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tonight, the Senate turned its back on the sacred right to vote. \n\nThis fight continues. We are not giving up.\nhttps://t.co/ZhZxI6X8KH","date":"Thu Jan 20 02:57:48 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"LIVE: I am leading a press conference on voting rights with @TheBlackCaucus members in front of the Senate Chambers. \n\nTune In: https://t.co/7pvUnMvMGu","date":"Wed Jan 19 19:27:41 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Last night, I had the honor of swearing in the newest member of the @TheBlackCaucus family, Congresswoman Sheila Cherfilus-McCormick from the great State of Florida. #OurPowerOurMessage https://t.co/RTZaqYkKmp","date":"Wed Jan 19 15:28:20 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thanks to @POTUS, Americans can now order FREE at-home COVID tests at https://t.co/jh3jQ60rs5!\n\nIt takes less than a minute, so order yours now!","date":"Tue Jan 18 19:48:32 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"We cannot be silent on the cowardly, un-American attacks on our right to vote.\n\nJust as federal voter protections overcame Jim Crow, we must beat back Jim Crow, 2.0. https://t.co/gmqF4Zja0f","date":"Tue Jan 18 17:48:57 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"#MLK knew that our right to vote defends our rights to life, liberty, and the pursuit of happiness. \n\nToday, we seize the opportunity for justice that lays before us and continue our push for voting rights protections for all Americans.  #MLKDay https://t.co/omokhmAx6F","date":"Mon Jan 17 18:38:02 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"LIVE: I am speaking with lawmakers and civil rights leaders on voting rights.","date":"Mon Jan 17 17:48:53 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"TUNE IN: I am honored to receive the MLK Day Lifetime of Excellence in Public Policy Award. Join us as we honor Dr. King’s legacy: https://t.co/M5CSKaxli9\n\n#NANMLKAwards2022","date":"Mon Jan 17 13:34:44 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"“Life’s most persistent and urgent question is, ‘What are you doing for others?'”\n\nWords to live by this #MLKDay. https://t.co/oELIkoxOCK","date":"Mon Jan 17 12:50:11 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am honored to be receiving the MLK Day Lifetime of Excellence in Public Policy Award from @NationalAction. Tune in tomorrow at 8:30AM as we honor Dr. King’s legacy: https://t.co/TLnOo67Sl0. \n\n#NANMLKAwards2022 https://t.co/PHvNVqIql4","date":"Mon Jan 17 02:49:11 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"$483.3 million to repair Ohio’s dangerous, deteriorating bridges. \n\nThis is what we mean when we say Democrats deliver. \n\nhttps://t.co/GysNCV9kO8","date":"Sat Jan 15 14:12:47 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@POTUS’ latest @FederalReserve Board nominations will bring the most diverse leadership the Fed has ever seen.\n \nCongratulations to Sarah Bloom Raskin, Lisa Cook, Philip Jefferson, and everyone working to make sure our government reflects the beautiful diversity of our nation.","date":"Fri Jan 14 20:11:34 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Having quality, affordable health insurance is more important than ever during the pandemic.\n\nVisit https://t.co/VGcAmlOY6N to #GetCovered before the deadline ends TOMORROW, Jan. 15th. https://t.co/nq29PteHGk","date":"Fri Jan 14 18:09:55 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"The Congresswomen of @dstinc1913 are here to represent! https://t.co/h3bTWyXhKQ","date":"Thu Jan 13 21:09:55 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"When Democrats vote, Democrats win. That’s why Republicans are doing everything they can to regulate, limit, and ultimately seize your right to vote. \n\nThey must be stopped. \n\nTo preserve democracy and the rule of law, we need the Freedom to Vote: John R. Lewis Act now. https://t.co/tYfFV9Fv7R","date":"Thu Jan 13 16:57:56 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today is Founders Day for @dstinc1913!\n\nDelta Sigma Theta Sorority, Incorporated's legacy of sisterhood, scholarship, service, &amp; social action was started on January 13, 1913 by 22 young women. \n\nIt continues today!\n\n#DST1913 #DST109 #LivingOurLegacy https://t.co/51kCChBv5D","date":"Thu Jan 13 15:03:37 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"@AprilDRyan Happy Anniversary my friend and thanks for always being out front for us—and standing with the CBC!","date":"Thu Jan 13 14:57:41 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, I hosted Martin Luther King III and his wife Arndrea Waters King at the US Capitol to discuss our fight to secure the rights that his father and countless other civil rights leaders bled to secure. #OurPowerOurMessage","date":"Thu Jan 13 01:20:05 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus has one message. The time is now. \n\nThe Senate must act to secure voting rights for all Americans. \n\n#OurPowerOurMessage https://t.co/rQkF9eHTai","date":"Thu Jan 13 01:08:52 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am here with @POTUS and @VP in Atlanta, Georgia to stand together in our calls for immediate action to secure the sacred right to vote.\n\nVoting rights are non-negotiable.\n\nhttps://t.co/ASiNTOAHjZ","date":"Tue Jan 11 21:24:00 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus is in Atlanta with @POTUS and the @VP to make our message clear: voting rights are essential and non-negotiable. #OurPowerOurMessage https://t.co/pDUREJXxdo","date":"Tue Jan 11 17:26:36 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"We’re all frustrated by stalled progress on voting rights legislation, that’s why I’m traveling to Atlanta today with @POTUS Biden and @VP Harris. \n\nWe cannot let Republican inaction strip us of the vote so many fought and died to secure. https://t.co/xpGx3zvTZw","date":"Tue Jan 11 15:35:22 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"In 2022, Maya Angelou has become the first Black woman to grace an American quarter!\n\nNow who's ready for the #TubmanTwenty?","date":"Mon Jan 10 18:26:57 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"I’m saddened to hear of the passing of Sidney Poitier, a barrier breaker on screen and off. Rest in power. https://t.co/Q2Ddwk0Fv3","date":"Fri Jan 07 18:44:17 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today we stand strong, renewing our commitment to Democracy and promoting racial equality in the face of opposition.\n\nJanuary 6th reminds us that even in the face of struggle and insurmountable barriers, our democracy must stand tall. https://t.co/pmLVbfx0t1","date":"Thu Jan 06 21:53:41 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s all about the shoes at the Rose Bowl!\n\nOur footwear — it’s kick off time! https://t.co/wksKXzRtR8","date":"Sat Jan 01 21:00:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy New Year! \n\nWho’s ready for 2022?","date":"Sat Jan 01 05:00:04 +0000 2022","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy Kwanzaa to everyone celebrating across the country! https://t.co/OH1HKvYI4f","date":"Sun Dec 26 15:35:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#MerryChristmas to everyone celebrating! https://t.co/tug3qWBGLz","date":"Sat Dec 25 15:35:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"As we wrap up 2021, I want to wish you the happiest holidays, the merriest Christmas, and the healthiest New Year! https://t.co/DzWuLsLw8F","date":"Fri Dec 24 16:30:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Every citizen is entitled to an equal opportunity to participate in our democracy.  \n\nThe Senate must reconvene to send meaningful voting rights legislation to @POTUS’s desk.","date":"Wed Dec 22 02:34:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#OH03 is home to some of the best holiday light displays on Ohio. Bundle up the kids, grab some cocoa, and enjoy the sights before the season ends! \nhttps://t.co/raJrWSKTgY","date":"Mon Dec 20 15:41:31 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FINALLY! After 66 years, Claudette Colvin’s courageous act of civil disobedience against racism and segregation will no longer be a stain on her criminal record. \n\nThe moral arc of the universe is long, but it bends towards justice.\nhttps://t.co/RFr5jSYBzj","date":"Thu Dec 16 18:22:40 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I was honored to be the keynote speaker at @CincyChamber and @FifthThird’s 2021 Diversity Leadership Symposium today. \n\nI was proud to meet with leaders from across Ohio committed to advancing diversity, equity, and inclusion in the workplace. https://t.co/ACSIQ4tWBG","date":"Wed Dec 15 22:42:14 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tonight, I joined a moment of silence at the U.S. Capitol for the 800,000 American lives lost to COVID-19. \n \nWe mourn every single life lost and join together to fight this pandemic. #GetVaccinated https://t.co/dTO9JNXwlq","date":"Wed Dec 15 04:24:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The expanded #ChildTaxCredit has pulled millions of families out of poverty.\n\nRT if you think the Senate should act to make it permanent!\nhttps://t.co/0rrgeqqaV6","date":"Tue Dec 14 21:34:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"There is no time to wait. \n\nThe Senate must act on voting rights. https://t.co/OO12zMn4qf","date":"Tue Dec 14 19:54:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The rule of law still matters. \n\nEveryone who plotted, executed, and enabled the January 6th insurrection needs to be prosecuted.","date":"Tue Dec 14 16:35:20 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"STARTING SOON: Tune in to The Power of One: You! A Statewide Tribute to Rosa Parks. \n\nClick here to watch live: https://t.co/fggKFgenoB https://t.co/exlrng6HeO","date":"Tue Dec 14 00:00:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy birthday, ⁦@USNationalGuard⁩! \n\nFrom COVID-19 response to disaster relief and much more, members of the National Guard continue to protect and support communities across America. https://t.co/FBIE3OWZYw","date":"Mon Dec 13 21:39:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Join me and special guests at 7 PM on Monday, December 13, for a salute to the immortal legacy and rich life of Rosa Parks. The event will premiere at 7 PM on Facebook and YouTube and will be archived for later viewing. (2/2)","date":"Sat Dec 11 14:56:46 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This year, to mark the 17th anniversary of Rosa Parks Day in Ohio, I’m premiering a new video special highlighting the #PowerOfOne’s enduring impact, and YOU are invited to the virtual premiere! (1/2) https://t.co/1Nsbj9XlOP","date":"Sat Dec 11 14:56:45 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I know that inflation is on the mind of many in Central Ohio. \n\nWhile Republicans in Congress play politics, my colleagues and I are taking action with #BuildBackBetter’s cost cutting measures to alleviate the strain of inflation on families: \n\nhttps://t.co/MJflu5g9Wz","date":"Fri Dec 10 20:32:18 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I witnessed this unnecessary force by police and was even pepper-sprayed during a protest. I will continue to fight at the federal level to make sure that those in Columbus and nationwide can march safely without fear of excessive force from police. https://t.co/6nVLdQOf1a","date":"Fri Dec 10 16:03:16 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy birthday to a modern day trailblazer!","date":"Thu Dec 09 17:47:25 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Despite America's increasing diversity, studies show investment firms are among the least diverse in the financial services industry. \n\nIt's time for that to change.\n\nTune in live as I lead @FSCDems in a review of D&amp;I at America’s large investment firms https://t.co/MCrVIrrRSZ","date":"Thu Dec 09 16:18:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Last night, @TheBlackCaucus stood in solemn repose and made our message clear: Our democracy is too precious to lose. The Senate must act swiftly to pass the John Lewis Voting Rights Advancement Act and secure our right to vote in free, fair elections. #OurPowerOurMessage https://t.co/OZKAILipyK","date":"Wed Dec 08 23:52:28 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus will not rest until our right to vote is secured.","date":"Wed Dec 08 18:04:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tonight, I will lead @TheBlackCaucus in the 2021 #VigilForJustice. \n\nThe Senate cannot continue to choose obstruction over action. It’s time to pass the John Lewis Voting Rights Advancement Act and send it to @POTUS’ desk.","date":"Tue Dec 07 16:07:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This Pearl Harbor Remembrance Day, we honor the lives that were heroically lost and remember the bravery and sacrifice of all those who came to the defense of our nation in the days that followed. https://t.co/UWhUonASBC","date":"Tue Dec 07 14:38:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"A new study supports the enormous cost-cutting investments for working families that @POTUS and Democrats will deliver in the #BuildBackBetter Act. The Senate must act now! https://t.co/0kqDg4BsQU","date":"Sun Dec 05 14:57:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#BuildBackBetter provisions are already saving families in every state thousands of dollars each year. Check out this interactive map to learn more: https://t.co/wJZj2cbYkN","date":"Sat Dec 04 20:51:15 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thanks to the American Rescue Plan, @POTUS and @HouseDemocrats have delivered tax cuts for families with kids. \n\nTax cuts and rising wages for families means an average of $100 more in your pockets each month compared to last year.\n\nThat’s what it means to fight #ForThePeople.","date":"Fri Dec 03 17:27:18 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Since @POTUS and @VP took office, the American people are getting back to work. \n\nUnemployment is down from 6.3% to 4.2% — a number experts thought would take THREE more years to reach. \n\nThat’s progress.","date":"Fri Dec 03 17:08:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Casey Goodson Jr.’s senseless murder last year put me at a loss for words. I was sickened to see another Black man, someone from our own community, gunned down by someone who was sworn to protect and serve. (1/2) https://t.co/wJE5WAB4nd","date":"Thu Dec 02 21:39:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"As I continue to closely monitor this case as it moves through the courts, I pray that Mr. Goodson’s family and our community will receive justice. (2/2)","date":"Thu Dec 02 21:39:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s been 66 years since Rosa Parks made history and helped kickstart the civil rights movement. \n\nOn December 13, Ohio will honor her legacy and sacrifice with “The #PowerOfOne: You!” \n\nStay tuned to my Facebook page to watch LIVE. https://t.co/1eBSzxgYAI","date":"Wed Dec 01 18:18:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Through her willingness to sit, #RosaParks stood up for what she believed in and helped spark a movement that still inspires me and so many Americans – and countless others around the world – all these years later. https://t.co/eYZCBcP9JR","date":"Wed Dec 01 14:35:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"History is made every day in #CBus!\nCongratulations to Bernita Reese, the first Black woman to lead the Columbus Department of Recreation and Parks!\nhttps://t.co/TtEpkXxsTe","date":"Tue Nov 30 21:04:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"\"The things we truly love stay with us always, locked in our hearts as long as life remains.\"\n\n- Josephine Baker.\nhttps://t.co/1IE4n4YAPb","date":"Tue Nov 30 15:02:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ahead of the holiday season, @USPS is hosting a weeklong hiring fair to fill immediate openings. \n\nCandidates can stop by 2323 Citygate Dr, Columbus, OH, between 11 am and 1 pm today through Friday.\n\nStarting salary is between $16.87 and $18.92 per hour.\nhttps://t.co/kI2SSyGwo2","date":"Mon Nov 29 15:28:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"By popular demand, the #PowerOfOne photo competition deadline has been extended to 11:59 PM on Sunday, November 28!\n\nLearn more and submit your photos here: https://t.co/2L1EMZASXj https://t.co/mWgK92vhwc","date":"Sat Nov 27 13:17:20 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today is the LAST DAY to submit your photos to my #PowerOfOne photo competition for Ohio's annual Rosa Parks Day celebrations. \n\nUse the form below to submit a photo that makes you feel the Power of One demonstrated by Rosa Parks. https://t.co/4IANCJM05r https://t.co/aCJtaRRQuQ","date":"Fri Nov 26 14:22:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy Thanksgiving to all celebrating! May this year’s gatherings be filled with blessings, gratitude, and love. https://t.co/pHFnEf6Z6d","date":"Thu Nov 25 13:55:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Justice has been served, but there is still much work to be done. I will continue to push for criminal justice reform and meaningful gun violence prevention measures. Vigilante justice has no place in our society. https://t.co/PvtfodCkKh","date":"Wed Nov 24 18:59:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"My 2021 #PowerOfOne Photo Competition is live! Visit my Facebook page to learn more and submit your photo(s)! https://t.co/Ccm92JtQ9M https://t.co/D6swM6n7eQ","date":"Tue Nov 23 17:00:52 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#DidYouKnow: November is #NativeAmericanHeritageMonth! \n\nThis month and year round, we celebrate the unique histories, cultures &amp; achievements of Native Americans in the United States, and uphold the U.S. government’s trust &amp; treaty obligations. https://t.co/psGA0Ncq7T","date":"Mon Nov 22 18:58:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy Birthday, @POTUS! \n\nAlways honored to join you in fighting #ForThePeople. https://t.co/NdyNLv6SRg","date":"Sat Nov 20 19:30:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Heading to #CBus with the @VP to discuss the ENORMOUS impact #BuildBackBetter will have on Central Ohio! https://t.co/P81J8IDxHU","date":"Fri Nov 19 17:10:14 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This is what it means to deliver #ForThePeople. \n\nhttps://t.co/fBrMnbvQp3","date":"Fri Nov 19 14:58:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"By empowering families with tax credits, child care, and universal pre-K, the #BuildBackBetter Act delivers once-in-a-generation action to lower the everyday costs that burden working families – from health care to child care – while also fighting inflation.","date":"Fri Nov 19 14:58:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, thanks to the tireless work of Democrats from across the ideological spectrum, we have delivered @POTUS’s #BuildBackBetter Agenda, just in time for the Thanksgiving holiday. \n\nI was proud to play an important role in negotiations that helped pave the way for this moment.","date":"Fri Nov 19 14:58:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Republican temper tantrums can’t stop progress. https://t.co/ZhnE4ZcBkI","date":"Fri Nov 19 14:07:08 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I just heard someone call this is a           Moron-athon listening to Kevin McCarthy tonight","date":"Fri Nov 19 07:20:58 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"How can Kevin McCarthy lecture us about fiscal responsibility with a straight face? \n\nThe GOP Tax Scam added approximately two trillion dollars to the national debt.\n\n#BuildBackBetter reduces the deficit and delivers #ForThePeople. \n\nSit down @GOPLeader.","date":"Fri Nov 19 02:41:16 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"READ IT HERE: The #BuildBackBetter Act lowers costs for working families, helps parents return to the workforce, and pays for itself.  \nhttps://t.co/QsqXBiSwyh","date":"Thu Nov 18 19:04:05 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"No American workplace would tolerate his behavior and the @GOP’s support of this kind of violent rhetoric can be deadly.  \n\nAccountability matters. Women of color will not be silenced. \nhttps://t.co/keOAnRqPv0","date":"Wed Nov 17 21:52:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Survivors of sexual harassment and assault shouldn't  suffer in silence. It is time to #EndForcedArbitration.","date":"Wed Nov 17 21:29:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: Regardless of why you use it, birth control is healthcare.  #ThxBirthControl","date":"Wed Nov 17 19:11:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The historic Bipartisan Infrastructure Bill will rebuild Ohio's roads and bridges, improve our public transportation system, and create good-paying union jobs.\n\nWe're laying the foundation for strong economic growth for decades to come. https://t.co/fBrxbci2Rc","date":"Wed Nov 17 14:41:53 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ahead of the holidays, tens of millions of families are benefiting from the Biden #ChildTaxCredit, thanks to @HouseDemocrats and @POTUS. #DemocratsDeliver https://t.co/OpxtQjz9ZM","date":"Tue Nov 16 22:12:50 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"My bill, #HR5911, the Fair Hiring in Banking Act, was just agreed to by VOICE VOTE! \n\nTune in now to watch the rest of today's @FSCDems markup.","date":"Tue Nov 16 16:02:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"America is on the move again!","date":"Mon Nov 15 21:22:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I’m at the @WhiteHouse to stand alongside @POTUS as he signs the historic Bipartisan Infrastructure Deal!\n\nWe are ready to deliver good union jobs, safer roads, reliable internet, clean water, and so much more #ForThePeople! https://t.co/5WB2lwMqvh","date":"Mon Nov 15 19:55:45 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"History is about to be made. #BidenDelivers https://t.co/fFqZtPdjzA","date":"Mon Nov 15 18:06:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus was key to passing the bipartisan infrastructure deal, and you know we'll be key in passing the #BuildBackBetter Act! https://t.co/TCYb7HtWRZ","date":"Sun Nov 14 18:34:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"For Ohio, the Bipartisan Infrastructure bill means \n\n🌉$9 billion for safe bridges &amp; highways\n🚌$1.2 billion for public transit\n⚡$140 million for electric vehicle charging stations\n🖥️Reliable internet for 259k+ Ohioans\n💧$1.4 billion for drinking water\nhttps://t.co/2iKFPOK9Jy","date":"Fri Nov 12 16:02:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#OH03 is home to the National Veterans Memorial and Museum (@NationalVMM). Stop by the next time you're in town to honor and learn more about Veterans from all eras of our nation’s military history. https://t.co/LRnsneeNyu","date":"Thu Nov 11 13:12:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#VeteransDay is more than just a chance to say \"thank you,\" it's an opportunity to celebrate the amazing veterans from all walks of life who sacrifice so much for this country. https://t.co/bHOo3m7K2r","date":"Thu Nov 11 13:06:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Nearly 1/3 of eligible Ohio families haven't claimed their #ChildTaxCredit yet. \n\nTo receive your payments in 2021, visit https://t.co/6nzXttvCJC and sign up before November 15. \n\n92% of Ohio families qualify!\n\nhttps://t.co/ac2TMxbFpX","date":"Wed Nov 10 19:10:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I couldn’t let today go by without wishing a happy birthday to the Senior Senator from the great state of Ohio, a strong Democrat who knows the dignity of a hard day’s work, my dear friend and colleague @SenSherrodBrown. https://t.co/arGcvfjGaj","date":"Wed Nov 10 02:23:31 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The climate emergency has no borders. \n\nI am proud to see @HouseDemocrats joining global leaders at the Climate Conference in Glasgow to reassert American leadership.\n\nOur commitment to prioritizing bold climate policy will save lives &amp; protect our planet. #ActOnClimateNow #COP26","date":"Tue Nov 09 19:24:28 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It's vital that we get more students in the STEM career pipeline, especially those who have been historically underrepresented, so we can create the larger, more diverse STEM talent pool that our nation needs.","date":"Tue Nov 09 18:19:46 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Yesterday, I celebrated #NationalSTEMDay with some of the brightest students at Metro Early College High School in #CBus. https://t.co/8F2w3GwlJe","date":"Tue Nov 09 18:19:45 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We're live talking economic inclusion for the #LGBT community. Listen in!","date":"Tue Nov 09 17:27:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Members of the LGBTQ+ community deserve full inclusion in the financial services industry. \n\nToday, I'll lead @FSCDems in examining discriminatory barriers in the financial services &amp; housing sectors and taking action to remedy them. \n\nTUNE IN @ NOON: https://t.co/XHhZhqe9Om","date":"Tue Nov 09 14:29:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The Bipartisan Infrastructure Deal will:\n-Invest in communities that are often left behind\n-Fight the climate crisis\n-Create good-paying union jobs\n-Grow our economy","date":"Mon Nov 08 20:13:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I will be joining MSNBC’s @MorningJoe at 8am. Tune in!","date":"Mon Nov 08 12:58:21 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"From lead-free water to high-speed internet, the historic infrastructure bill is a monumental step forward for the nation.\n\nhttps://t.co/hb0KHj5qot","date":"Sat Nov 06 18:22:28 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tonight, we also took an important step toward delivering what America needs to #BuildBackBetter. \n\nTogether, these bills will work to bring life-changing results for the people of Ohio’s third congressional district and families nationwide.","date":"Sat Nov 06 05:30:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"By empowering families with tax credits, child care, affordable housing, funding for HBCUs, Pell grants, and universal pre-K, the #BuildBackBetter Act will deliver a once-in-a-generation investment to lower the everyday costs that burden working families.","date":"Sat Nov 06 05:30:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tonight, I voted to send the #BipartisanInfrastructureBill directly to @POTUS to be signed into law. \n\nThis bill creates a foundation for strong economic growth so that communities in Ohio and nationwide can compete &amp; succeed in the 21st Century.","date":"Sat Nov 06 05:30:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"@Olivia_Beavers Met with CPC --","date":"Sat Nov 06 02:57:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Jobs! Jobs!  Jobs!\n \nThis is what #BuildBackBetter looks like!\nhttps://t.co/l0Zbp8JqSE","date":"Fri Nov 05 14:30:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Welcome to the team, @ShontelMBrown!","date":"Thu Nov 04 19:46:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today I joined some of the most inspiring Black women from on and off Capitol Hill to discuss the urgent need for #VotingRights legislation.\n\nWe MUST continue to fight for the John R. Lewis Voting Rights Advancement Act and defend our right to vote. #BlackWomenTakeAction https://t.co/YVS2Fr4snJ","date":"Thu Nov 04 18:44:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy #Diwali to all celebrating across the country! May the Festival of Lights inspire us to lift up our communities and live every day with hope. https://t.co/PwxVjErzQJ","date":"Thu Nov 04 18:34:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This betrayal by Senate Republicans comes amid the most coordinated state-level effort to restrict the right to vote in a generation. (2/4)","date":"Wed Nov 03 21:53:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"With today’s obstruction, Senate Republicans gave a blank check to partisans who are working to rewrite our voting laws to systematically disenfranchise vulnerable and underrepresented communities. (3/4)","date":"Wed Nov 03 21:53:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I continue to fight for the people to ensure that the John R. Lewis Voting Rights Advancement Act and the Freedom to Vote Act are enshrined into law. (4/4)","date":"Wed Nov 03 21:53:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, the @SenateGOP undermined the sacred right to vote by blocking the John R Lewis Voting Rights Advancement Act. I was proud to preside over debate on the bill in the House, which would restore common-sense bipartisan protections for all voters. (1/4)\nhttps://t.co/UdRhohddpH","date":"Wed Nov 03 21:53:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It's probably more affordable than you think to #GetCovered on https://t.co/yqnM3pYVrw. \n\nBe sure to sign up by December 15 for coverage starting January 1! https://t.co/ZiDlWK1tC8","date":"Wed Nov 03 19:48:21 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It's #ElectionDay in Ohio! \n\nFind your polling place and make your voice heard!\n\nPolls close at 7:30.\n\nhttps://t.co/LSq3UGmRdV","date":"Tue Nov 02 13:42:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #BuildBackBetter framework will give 160k+ Ohio children access to free, high quality preschool. \n\nRT if you support giving all children the proven benefits of an early education! https://t.co/ztP2Zj3N6F","date":"Mon Nov 01 17:28:34 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tune in at 10!","date":"Sat Oct 30 13:06:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Wishing the happiest of birthdays to my former Ohio delegation colleague and fellow Delta, @SecFudge! https://t.co/MJrEXuYUcY","date":"Fri Oct 29 20:26:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Between investments in housing, child care, climate, healthcare, and much more, the #BuildBackBetter agenda will benefit every corner of every community. \n\nThis is what working families need to compete and make it in America. Let’s get it done. https://t.co/216qUz71VF","date":"Fri Oct 29 15:19:07 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, thanks to the tireless work of @POTUS Biden, @VP Harris, @SpeakerPelosi, and Democrats from across the ideological spectrum, I am proud to support the  framework for the #BuildBackBetter agenda. https://t.co/aXD1yDsYbS","date":"Thu Oct 28 22:19:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thank to @POTUS, we have a #BuildBackBetter framework all Americans can get behind:\n\n✏️ Universal Pre-K\n💰 Extended &amp; expanded #ChildTaxCredit\n☀️ Green energy investments\n👂 Medicare hearing benefits\n🏘️ Historic housing investments\n💸 ZERO tax increases for anyone earning &lt;$400K","date":"Thu Oct 28 17:47:58 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, we honor the victims of the Tree of Life Synagogue shooting, the deadliest anti-Semitic attack in US history. May their memories be a blessing.\n\nI stand with the Jewish community in working every day to dismantle anti-Semitism, while supremacy, &amp; hatred in all its forms.","date":"Wed Oct 27 23:40:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Joyce Fienberg\nRichard Gottfried\nRose Mallinger\nJerry Rabinowitz\nCecil Rosenthal\nDavid Rosenthal\nBernice Simon\nSylvan Simon\nDaniel Stein\nMelvin Wax\nIrving Younger https://t.co/cI5e8wKI7y","date":"Wed Oct 27 23:40:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Whether it is $1.7 or $2 trillion,  it's a significant investment in our communities. With increased funding for housing &amp; vouchers, HBCU’s, &amp; expanded #ChildTaxCredit, we will #BuildBackBetter &amp; ensure  Black families have a seat at the table.\n \nhttps://t.co/NWOZotim3n","date":"Wed Oct 27 21:24:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We’re ready to #BuildBackBetter with\n\n🏘️Better housing vouchers\n👪Expanded #ChildTaxCredit\n🏫More funding for HBCUs https://t.co/eobDkbFuQn","date":"Wed Oct 27 16:28:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"LIVE: Tune in as @TheBlackCaucus holds a press conference on the Build Back Better agenda and the bipartisan infrastructure bill. https://t.co/24356gLyLu","date":"Wed Oct 27 14:30:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We are within striking distance of a transformative deal on America’s physical and human infrastructure. In the past several weeks alone, I have met with the @WhiteHouse more than five times to demand that Black families be prioritized in this final package. https://t.co/2BjOWHn8xW","date":"Tue Oct 26 20:24:16 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #BuildBackBetter agenda means lowers costs, lower taxes, and more job opportunities for American families. We are ready to deliver. https://t.co/TtZGxu9daO","date":"Tue Oct 26 17:08:28 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The @American_Heart Association is celebrating 40 years of dedicated advocacy tomorrow at 7 PM, featuring a special appearance from yours truly. RSVP now to watch !\nhttps://t.co/fbkqGzOple","date":"Mon Oct 25 15:33:40 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: Black women have a higher mortality rate &amp; are more likely to be diagnosed with late-stage breast cancer than any other racial group.\n\nEvery Fri in Oct, @TheBlackCaucus is wearing pink to raise awareness of the disparities in care Black women face every day.  #CBCPinkFriday https://t.co/qXax6CyDgN","date":"Sat Oct 23 14:58:10 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Did you know that the @OHDeptOfHealth Breast and Cervical Cancer Project offers no-cost breast and cervical cancer screenings and diagnostic testing?\n\nOhioans can call 1-844-430-BCCP for more information.","date":"Fri Oct 22 16:40:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus is here and celebrating 10 glorious years of the #MLK Memorial in Washington! https://t.co/UUlKbVHbge","date":"Thu Oct 21 16:13:52 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy birthday to our barrier breaking, history making @VP, Madam Vice President Kamala Harris! https://t.co/l4AaUha3ro","date":"Wed Oct 20 13:32:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Halloween season is already in full swing in #CBus! Don’t miss out on all the fun, and be sure to bring your mask.\nhttps://t.co/ychtmRK6d0","date":"Tue Oct 19 22:10:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I couldn't let today go by without wishing the happiest of birthdays to my congressional colleague and fellow Delta, the always lovely @RepLawrence! https://t.co/slmEKBw8sb","date":"Mon Oct 18 20:36:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The 1969 Cuyahoga River fire helped kickstart a wave of environmental action, including the Clean Water Act, which marks its 49th anniversary today. \n\nWe've made major progress, but we can't rest until EVERY community is guaranteed access to clean, potable water.  #CWA49 https://t.co/7gfbNcMEMr","date":"Mon Oct 18 19:14:29 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We must act. Funding for housing MUST be included in our #BuildBackBetter agenda.","date":"Mon Oct 18 16:44:34 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We can’t sugar coat it: America has a housing crisis.\n\nBetween soaring rents, exclusionary zoning laws, and a HUD waitlist that goes on for years, home ownership (or even finding stable, affordable rental units) has become near-impossible for many families. (1/2) https://t.co/7e9XOYH9pk","date":"Mon Oct 18 16:44:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I'm going LIVE at noon to discuss #VotingRights, #DiversityAndInclusion, @TheBlackCaucus and more with the John Mercer Langston Bar Association @JMLBA. \n\nTune in!","date":"Mon Oct 18 15:41:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Nearly 40% of Ohioans live in a child care desert. \n\nIt's critical we #BuildBackBetter, invest in the #CareEconomy, and make affordable childcare accessible to everyone.\n\nOur families deserve a fair shot. https://t.co/zPvs9UCIjJ","date":"Mon Oct 18 14:20:16 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"To close out #HispanicHeritageMonth, we honor and celebrate Hispanic trailblazers like Maria Cortez of @ycbus who works to empower, educate, develop and mentor women, Latinx, immigrant, New American and Refugee community members. #InspiringLocalFigures\nhttps://t.co/VnAuVICofh","date":"Fri Oct 15 18:35:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s National Mammography Day!\n\nFor nearly two years, COVID has caused many Americans put their own healthcare on hold, but preventative care is still vital.\n\nIf you’re a women 40 or up, take today to schedule your next exam, it may prove lifesaving. #BreastCancerAwarenessMonth https://t.co/uG0jS17fUZ","date":"Fri Oct 15 15:24:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The Nov. 2 election is just around the corner! Make sure your voice is heard and find your polling place today. #OurPowerOurMessage\nhttps://t.co/UD6X3FqrA5","date":"Thu Oct 14 17:37:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Clean energy creates good-paying American jobs and helps solve the devastating impacts of climate change. \n\n@HouseDemocrats are taking #ClimateActionNow by investing in transformative clean energy technologies and environmental protection efforts. https://t.co/t9fq2PnxvC","date":"Wed Oct 13 18:34:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The @SenateGOP is doing more work to ensure the Federal Reserve shares the same lack of diversity as the Senate Republican Caucus than they did to stop a historic credit default. https://t.co/0A5sNpidPD","date":"Wed Oct 13 16:46:18 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Keep your eyes peeled: the October #ChildTaxCredit hits bank accounts this Friday!\n\nThese credits have been transformative for American families, and @HouseDemocrats are fighting to make them permanent so we can all #BuildBackBetter. https://t.co/wwwm6rKSbU","date":"Tue Oct 12 19:39:16 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We need to fund housing infrastructure in the #BuildBackBetter Act to:\n🌎 Combat climate change \n🏠 Improve health outcomes \n📈 Recover a more stable &amp; inclusive economy \n#HousingIsInfrastructure https://t.co/lsh86l2ecq","date":"Fri Oct 08 16:39:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy 80th birthday to the one and only Rev. Jesse Jackson! \n\nThank you for being an unrelenting ally and leader in the fight for a better, more just nation! https://t.co/cWsjM3Gb3N","date":"Fri Oct 08 14:53:29 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thanks to @JoeBiden, 550k+ teachers, firefighters, &amp; other public servants will have some or all of their student loan debt erased.\n\nBut we can do more.\n\nIt’s time to create pathways to affordable, debt-free education to train the workforce of tomorrow &amp; help us #BuildBackBetter.","date":"Thu Oct 07 19:39:37 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Regardless of your age, losing a parent is devastating. \n \nMy heart breaks for the 120k+ children who lost their caregivers during the pandemic. \n \nIf you need another reason to #GetVaccinated, do it for them.\nhttps://t.co/9VWo1aAYBQ","date":"Thu Oct 07 16:29:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“If I fall, I'll fall five feet four inches forward in the fight for freedom.” – Fannie Lou Hamer (1917-1977)\n\nHappy Birthday to the legendary civil rights &amp; women’s rights activist Fannie Lou Hamer. #BecauseofYouWeCan https://t.co/5I8rAQwysu","date":"Wed Oct 06 17:14:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Good news for anyone following the Tubman Twenty saga: Last week, @SecYellen gave her full endorsement to making the abolitionist icon the new face of America’s most used bill! #RepresentationMatters https://t.co/XhJvNSN3XT","date":"Tue Oct 05 20:49:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This #WorldTeachersDay, we celebrate the incredible impacts teachers and educators make on young minds across our nation. Take the opportunity to thank a teacher in your life for everything they do.","date":"Tue Oct 05 18:49:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"In less than a year, the expanded #ChildTaxCredit has transformed the lives of countless children and given more parents the opportunity to return to the workforce. It’s time to make it permanent and #BuildBackBetter.\nhttps://t.co/92QwUilAiY","date":"Tue Oct 05 14:59:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Since Facebook and Instagram are still down, I’m just going to leave this here. \nhttps://t.co/CfhPzXmL0N","date":"Mon Oct 04 21:00:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Last week, I paid my respects at a haunting memorial to the now 700,000+ Americans lost to COVID-19. The pain will linger with us for years, but it’s on all of us to put an end to this pandemic. #GetVaccinated https://t.co/sZgj36WdxU","date":"Mon Oct 04 17:23:40 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Wishing a happy birthday to my friend @TheRevAl. Thank you for your tireless leadership in promoting civil rights, justice and equality for all! https://t.co/zH3n576gwR","date":"Sun Oct 03 22:22:20 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This week, I got my COVID-19 booster shot. I encourage those eligible for the booster and those who have not yet received the vaccine to #GetVaccinated.  \n \nYou can make an appointment to #GetTheShot at https://t.co/jKfgEucOfo https://t.co/XerE3VYf0k","date":"Sun Oct 03 17:12:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I joined @GMA this morning to discuss our work in Congress to pass President @JoeBiden’s #BuildBackBetter Agenda and Bipartisan Infrastructure Deal. We are going to deliver #ForThePeople. https://t.co/i9VCeznfQg","date":"Sat Oct 02 23:36:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I'm going LIVE on @GMA at 7 AM today to talk infrastructure, debt ceiling, and the latest news from Capitol Hill. Tune in!","date":"Sat Oct 02 09:52:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#FlashbackFriday to 2017 and everyone’s favorite @NBC4i anchor, @ColleenNBC4. I sat down with Colleen today to discuss how I’m bringing #OH03 to federal infrastructure negotiations. Tune in @ 6 tonight to watch. https://t.co/TisATG8ybB","date":"Fri Oct 01 21:55:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to have pushed Fed Chair Powell to redouble efforts to find diverse leaders for not one but two high-profile openings at the central bank. We can’t succeed unless we have a seat at the table. \nhttps://t.co/D5i9K1t6gc","date":"Fri Oct 01 21:37:37 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Working families count on the federal government to help provide the vital services they need. That’s why I am proud to have supported @HouseDemocrats’ bill to continue investments in housing, public education and child care funding #ForThePeople. https://t.co/wRGe9N2eaJ","date":"Thu Sep 30 20:41:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The GOP continues to abdicate their responsibility to govern. Every @SenateGOP Republican voted to allow a historic, catastrophic default. Taking the debt hostage and playing games with the full faith and credit of the United States is reckless, dangerous &amp; unacceptable. Period. https://t.co/HYk1vaeVZ7","date":"Thu Sep 30 19:10:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to see a true son of Columbus recognized as the genius he is. Congrats to @NifMuhammad on this monumental achievement.","date":"Wed Sep 29 18:37:53 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Approximately 100,000 Americans are affected by sickle cell disease. This #SickleCellAwarenessMonth, I encourage everyone to donate blood and learn more about donating stem cells, so you can be the lifeline that someone has been dreaming of. https://t.co/MKlPyE6OYl","date":"Wed Sep 29 13:32:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The FDA and CDC recommend people age 65+, people at high-risk of severe COVID, and frontline workers get a COVID booster at least six months after their second dose of the Pfizer vaccine. To find a vax site near you, visit https://t.co/jKfgEtVcQO.","date":"Tue Sep 28 19:59:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Expanding access to the ballot box isn’t optional, it’s existential. This #NationalVoterRegistrationDay, I encourage everyone to get registered, help their loved ones register, and update their voter registration information, because by election day, it may be too late. https://t.co/iTJEdKgXT1","date":"Tue Sep 28 16:15:55 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The deadline to register or update your voter registration is next Monday, October 4th for Ohio’s General Election. This #NationalVoterRegistrationDay, take a few minutes to get registered: https://t.co/6be1Y7WNGL","date":"Tue Sep 28 16:15:55 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Justice-involved individuals also have limited access to financial education, financial products and services. It's time for that to change. Watch my opening remarks at today's @FSCDems hearing LIVE now! https://t.co/hzTKdp4JDF","date":"Tue Sep 28 14:16:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Justice-involved individuals face impossibly-high hurdles, especially when accessing financial services. \n\nTUNE IN @ 10 AM as I discuss the need to eliminate barriers &amp; increase economic opportunity for justice-involved individuals at today's D&amp;I hearing. https://t.co/hzTKdp4JDF","date":"Tue Sep 28 13:14:52 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Justice-involved individuals too often face impossibly-high hurdles, especially when trying to access financial services. \n\nTune in tomorrow @ 10 AM to learn about the need to eliminate barriers &amp; increase economic opportunities for these communities. \nhttps://t.co/hzTKdp4JDF","date":"Mon Sep 27 22:16:07 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Far too many in our communities still suffer from the racist disparities of America’s war on drugs. Today I will proudly vote to pass the  EQUAL Act and #EndTheDisparity between crack and powder cocaine sentencing.\nhttps://t.co/9zQpYjt7ol","date":"Mon Sep 27 17:29:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus is leading the fight to ensure fair and humane treatment of Haitian migrants, and we aren’t backing down. \n\nThanks @TheRevAl for having me on last night to discuss our how we demanded accountability for the mistreatment of Haitian migrants at the Texas border. https://t.co/mm5YB72cPO","date":"Mon Sep 27 16:33:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"SCOTUS has greenlit the most restrictive ban on abortion we've ever seen, banning abortions before many people even know they’re pregnant. \n\nI'm proud to have helped pass the Women's Health Protection Act to defend abortion access throughout the United States. #WHPA https://t.co/tc5VYedHoH","date":"Fri Sep 24 17:37:07 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"By taking the debt hostage, Republicans are playing an unacceptable game with the faith and credit of the United States. \n\nA default would cause irreparable economic harm, with American families bearing the consequences. The @SenateGOP must do its job and raise the debt ceiling.","date":"Thu Sep 23 20:32:05 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus won't abide abuse of Haitian migrants. Chasing down and whipping refugees like cattle is beyond unacceptable. \n\nWe demand new policies. There must be an investigation and those responsible must be terminated. https://t.co/XqvXru86dF","date":"Thu Sep 23 19:38:30 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"TUNE IN: I will be live with ⁦@KateBolduan⁩ on @CNN to discuss recent developments regarding the treatment of Haitian migrants and on the latest on the #BuildBackBetter agenda on Capitol Hill. https://t.co/cotfJehZDZ","date":"Thu Sep 23 15:38:55 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Yesterday I led a delegation of @TheBlackCaucus Members to the @WhiteHouse to demand accountability for the mistreatment of Haitian migrants at the Texas border. \n\nWe pledge our support to the people of Haiti. \n\nThis treatment will not be tolerated. https://t.co/mcw1bINoyd","date":"Thu Sep 23 14:26:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This week, we've witnessed some of the most deplorable, unspeakable abuses of Haitian migrants seeking asylum at our border. @TheBlackCaucus is demanding answers &amp; policy changes to ensure America remains a beacon of hope for refugees. Asylum is and always will be a human right. https://t.co/6lhcNXFuui","date":"Wed Sep 22 19:47:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The Congressional Black Caucus is actively monitoring developments and we are prepared to travel to the border to observe this situation ourselves. Treatment like this cannot be tolerated. (4/4)","date":"Tue Sep 21 21:41:40 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This sort of mistreatment is an affront to the very conscience of this nation, and it is absolutely unacceptable. @TheBlackCaucus has a long history of supporting our brothers and sisters across the Diaspora and we have pledged our support for the people of Haiti. (2/4)","date":"Tue Sep 21 21:41:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"To that end, I have called for an investigation into the actions of CBP and call on DHS Secretary Mayorkas to ensure that mistreatment and violence like this never happen again. (3/4)","date":"Tue Sep 21 21:41:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The images that we’ve seen over the last 24 hours are horrific and I share the outrage being expressed by Americans across the country. (1/4)\nhttps://t.co/vkUlfYJukT https://t.co/NK6ELnvFKZ","date":"Tue Sep 21 21:41:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thanks again to @PunchbowlNews @apalmerdc and @JakeSherman for an amazing discussion this morning! https://t.co/2Wzn9qPaia","date":"Tue Sep 21 21:36:07 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I’m live with @PunchbowlNews. Tune in now to hear the latest on how Congress is fighting to help black-owned small businesses through the #COVID recovery: https://t.co/PQXmoE4i3g https://t.co/hf3Z1SKgT5","date":"Tue Sep 21 13:11:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"There’s still time to register to watch my interview with @PunchbowlNews tomorrow. Don’t miss out, RSVP today: \nhttps://t.co/PQXmoE4i3g https://t.co/UEjNNoccWP","date":"Mon Sep 20 21:28:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I have contacted @SecMayorkas to request that he immediately travel to the border to assess the situation and ensure that humanitarian assistance, including lavatory facilities, food, and water, is being provided to those being processed, especially children. (4/5)","date":"Mon Sep 20 18:37:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I have further requested that he provide a comprehensive briefing to the Congressional Black Caucus on the status of Haitian migrants and on whether alternatives exist for their relocation. (5/5)","date":"Mon Sep 20 18:37:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"My heart aches for the people of Haiti, who are currently experiencing unimaginable political and economic upheaval. As we address the current surge of Haitian people, it is critical that we approach the situation focused on fairness and the safety of all involved. (2/5)","date":"Mon Sep 20 18:37:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I want to express my concern regarding reports of an urgent humanitarian crisis for tens of thousands of displaced Haitians at our Southern border. I want to be clear that we are a nation of humanity and rule of law. (1/5) https://t.co/KA10ogP1dk","date":"Mon Sep 20 18:37:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I will continue to fight to see that refugees are welcome in America, regardless of race or country of origin. (3/5)","date":"Mon Sep 20 18:37:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Universal #PaidLeave has the potential to save jobs and boost our economy. To #BuildBackBetter, we need to seize this once-in-a-generation opportunity and guarantee #PaidLeaveForAll! https://t.co/psnY4Gvf5r","date":"Mon Sep 20 16:11:57 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"As we close out #SmallBusinessWeek, I'm thrilled to share that I'll be joining two Ohio #SmallBiz owners next Tuesday for a LIVE interview with @PunchbowlNews' @apalmerdc and @JakeSherman. RSVP now to watch: https://t.co/PQXmoDMHbI https://t.co/75Joy6ixtJ","date":"Fri Sep 17 17:13:46 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"ICYMI: Last week I sat down with @NBC4i’s @Matt_NBC4 and @ARobbinsTV to go in depth on @TheBlackCaucus and our ongoing to fight to #ProtectTheVote! https://t.co/vVt7DqxMg9","date":"Thu Sep 16 20:22:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Wishing everyone observing #YomKippur an easy, meaningful fast on this blessed holy day. https://t.co/juSywCTwmI","date":"Thu Sep 16 17:57:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thrilled to be at @NorfolkState University today to help honor President Javaune Adams-Gaston and celebrate the strength and power of America’s HBCUs. Go Spartans! #BEHOLD #HBCULove https://t.co/P3NcuDLWM5","date":"Thu Sep 16 17:50:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I join fellow D&amp;I Subcommittee members in congratulating @FDICgov. Minority-owned banks and Community Development Financial Institutions help provide ALL Americans the necessary resources to start a business, achieve their dreams of homeownership, and save for retirement.","date":"Thu Sep 16 17:42:52 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tune in now as I deliver remarks at the Investiture Ceremony of the 7th President of Norfolk State University, Dr. Javaune Adams-Gaston. https://t.co/9hYzeI3wrm","date":"Thu Sep 16 15:09:34 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today marks the beginning of #HispanicHeritageMonth, which gives all of us the opportunity to celebrate the rich culture and vibrant diversity of America’s Latino communities and recognize the immense impacts they make to improve our nation every day! https://t.co/ONfL8UCUsD","date":"Wed Sep 15 19:17:40 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"TW // abuse\n\nThis testimony from @Simone_Biles is a masterclass in bravery, heroism, and strength for survivors everywhere.","date":"Wed Sep 15 16:09:28 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"On this day in 1963, four school-aged girls were killed when the 16th Street Baptist Church in Birmingham, Alabama, was bombed by white-supremacist domestic terrorists.\n\nCarol Denise McNair. Carole Robertson. Addie Mae Collins. Cynthia Wesley. \n\nSay their names &amp; never forget. https://t.co/cxCr5nOJL7","date":"Wed Sep 15 14:47:55 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to Chair @TheBlackCaucus on its 50th anniversary! I am excited to continue pushing for progress as the conscience of Congress. #CBC50 #OurPowerOurMessage https://t.co/GpTp2wRmNE","date":"Tue Sep 14 20:38:50 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tune in today at 12:30 ET to celebrate #NationalSmallBusinessWeek! I sat down with @Axios to go in-depth on the state of Black-owned small businesses in the #COVID recovery. https://t.co/8tAfswWjz7","date":"Tue Sep 14 14:08:05 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s #NationalSmallBusinessWeek, and @HouseDemocrats are committed to keeping America’s small businesses open as we get through the pandemic! #CBus restaurants alone received $130 million from the #AmericanRescuePlan to help us all #BuildBackBetter. https://t.co/SXb1XqfH88","date":"Mon Sep 13 16:49:10 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Our promise to ‘Never Forget’ continues, as does our commitment to working together in solidarity to protect our nation, our values, and each other. (2/2)","date":"Sat Sep 11 12:07:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"20 years after our nation suffered a terrible blow, I join with the #OH03 constituents &amp; all Americans in honoring the victims, survivors, families, service members, veterans, allies, &amp; countless Americans whose lives have been forever changed by the 9/11 terror attacks. (1/2) https://t.co/QAsjHSfYZP","date":"Sat Sep 11 12:07:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Congratulations to Loop Capital on this accomplishment and the FHLB system for their leadership.","date":"Fri Sep 10 16:53:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"In a historic first, a minority-owned diverse broker-dealer firm was selected as a lead manager on a $1 billion deal. This is the progress we hoped for when we launched the @FSCDems D&amp;I subcommittee. https://t.co/ayIOCnWAI7","date":"Fri Sep 10 16:53:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We know one investigation will not solve the deeply ingrained issues in the department, so we must continue to push for the policy, cultural, and systemic solutions needed to address this crisis. (2/2)","date":"Thu Sep 09 19:54:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This announcement is a vital first step towards building a justice system that supports Central Ohio residents, especially Black Americans. Far too many Black members of our community have lost their lives at the hands of police or been victims of unwarranted use of force. (1/2)","date":"Thu Sep 09 19:54:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Our need to march, to fight, to find a way to get in the way has never been greater. \n \nThe Senate needs to act on #HR4 now. Defending democracy from these blatant, racist power grabs isn’t optional, it’s existential. \nhttps://t.co/xJNB4WFlGn","date":"Thu Sep 09 16:55:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Shana Tova to everyone celebrating Rosh Hashanah. May this sweet new year bring us determination, kindness, courage, and strength. https://t.co/Czy4v3QXpZ","date":"Tue Sep 07 13:33:09 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"On this #LaborDay, I honor the countless achievements made by American workers by continuing to support the #PROAct. When workers have the power to stand together and form a union, they have\n✅Bigger paychecks\n✅Better benefits\n✅Safer working conditions https://t.co/TdyQrhJlC5","date":"Mon Sep 06 10:00:21 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@HouseDemocrats’ FY 2022 budget resolution will:\n\n✔️ Lower costs for families\n✔️ Create good-paying jobs\n✔️ Cut taxes for hard-working Americans\n\nThat’s how we #BuildBackBetter. https://t.co/0CExJrMVRa","date":"Sat Sep 04 13:29:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"If you’re a Franklin County resident struggling to cover rent, mortgage, or utility payments, help is available. Submit the application below to see if you qualify.\nhttps://t.co/8QualLrlld","date":"Fri Sep 03 12:42:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I remain committed to protecting a woman’s right to choose and will work with my congressional colleagues and the Biden Administration to defend it. (4/4)","date":"Wed Sep 01 19:22:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The draconian law attempts to weaponize our courts, pits neighbors against each other, and will deliberately and disproportionately harm low-income communities and communities of color. (3/4)","date":"Wed Sep 01 19:22:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Texas’ latest legislative embarrassment flagrantly violates the constitutional protection of reproductive care established under Roe v. Wade, protections that have been upheld as precedent for nearly half a century.  (2/4)","date":"Wed Sep 01 19:22:43 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today is a dark day for anyone who values women’s health or personal liberties. (1/4) https://t.co/u94ObRm21D","date":"Wed Sep 01 19:22:43 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to help honor some of America’s long-neglected Black freedom fighters. #BlackHistory is American History! https://t.co/hBkjRyOBv3","date":"Wed Sep 01 13:45:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ran in to some familiar faces at this weekend’s #VotingRightsMarch. See anyone you recognize? https://t.co/XfVKfIDDI8","date":"Mon Aug 30 20:15:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"America needs to know that we will stand up and fight for democracy. By marching, protesting, and making our voices heard, we have the power to #RestoreTheVote. https://t.co/HgpyQmGE2K","date":"Sat Aug 28 20:58:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#BlackLivesMatter at today’s #VotingRightsMarch! https://t.co/kw4OCzzwVz","date":"Sat Aug 28 16:02:30 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, we stand on the shoulders of giants like Dr. King, John Lewis, Rosa Parks, and Shirley Chisholm by marching and demanding the swift passage of #HR4. Democracy depends on it.  #VotingRightsMarch (2/2)","date":"Sat Aug 28 11:29:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"On this day in 1963, hundreds of thousands of Americans marched on Washington to demand equal civil and economic rights for all Americans, including the right to vote. Nearly six decades later, we’re still marching for the same thing. (1/2) https://t.co/ALrYKpKLpi","date":"Sat Aug 28 11:29:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I join Ohioans and all Americans in mourning the loss of Navy Hospital Corpsman Max Soviak, a hero who was taken far before his time. (1/2)  https://t.co/4MHwhOAYmQ","date":"Fri Aug 27 20:05:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"His sacrifice, and the sacrifices made by all those who have served in Afghanistan, will not be forgotten. His mission to protect Americans and our Afghan allies will not be abandoned. My prayers are with his family. (2/2)","date":"Fri Aug 27 20:05:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"If we want to keep our kids safe, we all need to #VaxUp.\nhttps://t.co/LYI1ZSJF7v","date":"Fri Aug 27 16:59:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The news out of Kabul is devastating. My prayers are with those impacted, those seeking refuge &amp; the brave servicemembers fighting to protect them. The horrific attack is a painful reminder that we must do everything possible to get Americans &amp; our Afghan allies out of harm’s way","date":"Thu Aug 26 20:14:14 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#ThrowbackThursday to January 2019. This was very first group photo featuring ALL of the Democratic women of the 116th Congress. It was hard to fit so many of us into just one shot! #WomensEqualityDay https://t.co/uqpsdo29aG","date":"Thu Aug 26 16:33:46 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"What we do at this moment will determine the course of our democracy for decades to come. For voters today, voters tomorrow, &amp; all those who sacrificed, I proudly voted to make some #GoodTrouble and #RestoreTheVote. https://t.co/aFKll0hrdL","date":"Wed Aug 25 15:52:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Honored to join my colleagues in passing #HR4, the John R. Lewis Voting Rights Advancement Act.\n \nGenerations of brave, patriotic Americans  fought, marched, and shed blood to safeguard the right to vote.\n \nNow it’s time for the Senate to make some #GoodTrouble. #RestoreTheVote https://t.co/aJQUD7mcgx","date":"Tue Aug 24 23:14:52 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Honored to join my colleagues in passing #HR4, the John R. Lewis Voting Rights Advancement Act.\n \nGenerations of brave, patriotic Americans  fought, marched, and shed blood to safeguard the right to vote.\n \nNow it’s time for the Senate to make some #GoodTrouble. #RestoreTheVote https://t.co/iWYt2Diuk3","date":"Tue Aug 24 23:14:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It is my honor and privilege to preside over floor debate on passage of #HR4, the John R. Lewis Voting Rights Advancement Act. \n\nToday, we get into #GoodTrouble by keeping the promise of democracy alive for generations to come. #RestoreTheVote https://t.co/DKdE3Dy5Qq","date":"Tue Aug 24 20:54:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TeamUSA is ready to bring home the gold at the #TokyoParalympics. Shoutout to @_brittnnii, @gracenormantri, @JennaFesemyer, @sblakehaxton, @taylorf53346499 and every other Buckeye making America proud!","date":"Tue Aug 24 16:59:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“The right to vote is precious, almost sacred. It is the most powerful nonviolent tool or instrument in a democratic society.” – John Lewis\n \n30 statewide voter suppression laws have passed in 18 states since the 2020 election alone.\n \n#HR4 can’t wait. #GoodTrouble https://t.co/SnAXal0LpQ","date":"Tue Aug 24 15:02:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"56 years ago, heroes like John Lewis shed blood on the Edmund Pettus Bridge for the right of all Americans to vote. This week, as that right comes under attack once again, we honor their legacy by passing #HR4, the John R. Lewis Voting Rights Advancement Act. #RestoreTheVote https://t.co/P4zFnnEYrI","date":"Mon Aug 23 21:58:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"To do your part to protect yourself and your neighbors TODAY, visit https://t.co/88tDjUWyE5 or text your zip code to GETVAX (438829) to find a FREE vaccination site near you. (2/2)","date":"Mon Aug 23 20:25:34 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"BIG NEWS: The FDA has granted FULL APPROVAL for the Pfizer #COVID shot for everyone 16 and up. COVID-19 vaccines are safe, free, and highly effective but this long-awaited approval provides added confidence for those who may be reluctant. (1/2)\nhttps://t.co/exqrzyacSc","date":"Mon Aug 23 20:25:34 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"My office is monitoring the situation, and our hearts are with the Capitol Police and law enforcement as they work to deescalate the situation. Thankfully, all of my staff is safe and accounted for. \nhttps://t.co/ecQVSaMFGd","date":"Thu Aug 19 18:28:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s been 101 years since the #19thAmendment gave women the right to vote, but it wouldn’t be until 1965 that all women-including women of color-saw full suffrage. It took decades of fighting to get there, and the fight for equal ballot access continues today. #HR4 https://t.co/Dgy08g4VuH","date":"Wed Aug 18 16:10:10 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"If you’re immunocompromised, the FDA recommends a COVID booster shot to help your body fight the new strain of the virus. #VaxUp today and stay healthy tomorrow! https://t.co/zVDkj8P2H3","date":"Wed Aug 18 15:05:40 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The right to vote is the very foundation of our democracy. With #HR4, we honor our promises to safeguard that right for generations to come. #RestoreTheVote","date":"Tue Aug 17 17:15:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"but the responsibility to secure Afghanistan ultimately lies with the Afghan security forces. As we move into the next stage, it is vital that we as a nation ensure the safety of U.S. personnel and those Afghans who aided our efforts over the past two decades. (3/3)","date":"Mon Aug 16 16:46:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am beyond grateful to the hundreds of thousands of heroic servicemembers who successfully diminished the global threat of Al-Qaeda and who have provided security and stability in the nation, (2/3)","date":"Mon Aug 16 16:46:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The rapid deterioration seen on the ground in Afghanistan is distressing. After spending twenty years, nearly a trillion dollars, and the ceaseless courage of our armed forces, this unfortunate conclusion now seems inevitable. (1/3)","date":"Mon Aug 16 16:45:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Beautiful morning and beautiful people at today’s African American Male Wellness Walk! https://t.co/8fvIOiTwjl","date":"Sat Aug 14 17:17:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, parents across the country should receive their second monthly #ChildTaxCredit checks of up to $300 per child to #KeepFamiliesAfloat. https://t.co/YpQ3YSiIE1","date":"Fri Aug 13 18:05:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Four years ago today, #HeatherHeyer was murdered for standing up against white supremacists in Charlottesville. We cannot forget her cause: If you aren’t outraged, you aren’t paying attention. https://t.co/d1fXwYuADb","date":"Thu Aug 12 15:50:53 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Only 3 days until the 2021 African American Male Wellness Walk. Hope you all can join me for a day of health, wellness, education, and fun. https://t.co/glF7MZnafA","date":"Wed Aug 11 18:55:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This compromise has the potential to rebuild the middle class with honest, good-paying jobs and reignite American competitiveness. My colleagues and I remain committed to working with the President as we build back better in #OH03 and nationwide.","date":"Tue Aug 10 18:57:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am glad the Senate, under the leadership of @POTUS, has passed a bipartisan bill that would make serious investments in our infrastructure. https://t.co/RlliyuU7l0","date":"Tue Aug 10 18:57:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This is what #BuildBackBetter looks like. https://t.co/liIgZjkDLi","date":"Tue Aug 10 15:47:50 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"If you need a reason to #VaxUp, do it for the nurses. https://t.co/2O6QkuZjmP","date":"Mon Aug 09 15:39:18 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This #InternationalBeerDay, crack into a cold #OhioCraftBeer! #DrinkBeerMadeHere https://t.co/LQS86o1TdS","date":"Fri Aug 06 18:24:29 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We cannot lose the progress made on August 6th, 1965. @TheBlackCaucus will continue our fight to protect ballot access and the legacy of the #VotingRightsAct until the vote is secured for everyone. https://t.co/VefnWdEGUi","date":"Fri Aug 06 16:17:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Just wrapped up an insightful roundtable discussion with central OH entrepreneurs who are a part of @GS10KSmallBiz “Road to Recovery” series. Thanks to everyone who participated! https://t.co/a0tZZDY8Xx","date":"Thu Aug 05 21:50:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Devastated to hear of the passing of long time friend Richard Trumka, a giant in the labor movement and unrelenting ally in the fight for workers’ rights. Rest In Peace, Richard. https://t.co/atCFFJ8sCh","date":"Thu Aug 05 17:32:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy 60th birthday to President @BarackObama! https://t.co/yXcdYWNcqI","date":"Wed Aug 04 13:33:57 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The pay gap is real. #BlackWomensEqualPayDay marks the additional 214 days a Black woman must work to earn what a white man takes home in a year. The time to pass the #PaycheckFairnessAct is now! https://t.co/F0juWZjgg2","date":"Tue Aug 03 19:32:55 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Dom has been with me through thick and thin. I’ve relied on his advice and friendship for 5+ years as my Communications Director. Although today may be his last day, he will always be #TeamBeatty. \n\nI wish Margaret &amp; him all the best back in Kentucky. You will be greatly missed. https://t.co/9HmRjYE1x3","date":"Wed Jul 28 20:59:14 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We support you. #EndTheStigma https://t.co/gxosOUgrZ1","date":"Wed Jul 28 11:55:43 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#January6th was one of the darkest days in American history. Many questions remain. We need to know the truth. 🇺🇸 https://t.co/b9nabKgc9e","date":"Tue Jul 27 14:24:53 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: all 50 states have seen increase in daily COVID-19 cases past 2 weeks.\n\nFACT: 21 states saw 2x daily rate.\n\nFACT: 19 states saw 3x daily rate.\n\nFACT: 2 states saw 4x daily rate.","date":"Tue Jul 27 12:18:16 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The future of our democracy is on the line. The American people deserve to know the truth. #January6th https://t.co/bFdIcsA79f","date":"Mon Jul 26 16:28:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: if you live to be 70 years old, you will spend TEN YEARS of your life on Monday.\n\nEvery. Day. Counts. #MondayMotivation","date":"Mon Jul 26 13:16:11 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#VaxUp #FYI https://t.co/4TGjfNCKl9","date":"Fri Jul 23 14:58:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"LMFAO. @HouseGOP desperately trying to flip the script.","date":"Fri Jul 23 00:34:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We won’t be stopped. We won’t be silenced. Our voice is our vote, our vote is our power. Stay strong @RepHankJohnson. ✊🏾 #ProtectTheVote #GoodTrouble #OurPowerOurMessage","date":"Thu Jul 22 21:37:11 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thank you Officer Harry Dunn for your service. https://t.co/76PRI3MQp6","date":"Thu Jul 22 19:17:43 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This week marks #200Days of @HouseDemocrats delivering For The People. Democrats have taken decisive action to \n🩹 crush COVID-19\n💵 put money in Americans' pockets \n🇺🇸 pass the American Rescue Plan","date":"Thu Jul 22 16:45:21 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"You can arrest us. You can’t stop us. You can’t silence us. #ProtectTheVote \n\nhttps://t.co/SsyuYgtHU0","date":"Thu Jul 22 14:44:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s literally a life or death decision. #VaxUp https://t.co/BRRemVbKjb","date":"Wed Jul 21 21:23:04 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The American people deserve to know the truth. I support @SpeakerPelosi’s decision to ensure the #January6thCommission is focused on following the facts. Patriotism NOT partisanship.  #TruthOverLies 🇺🇸","date":"Wed Jul 21 19:50:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 HAPPENING NOW 🚨\n\nEmergency @TheBlackCaucus meeting on voting rights!\n\nWe will not rest. We will not be stopped. Our voice is our vote, our vote is our power! #ProtectTheVote #OurPowerOurMessage \n\nWatch here ➡️ https://t.co/zUD64HLTlS","date":"Wed Jul 21 17:53:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Great conversation with THE @OhioState University @PresKMJohnson! #GoBucks https://t.co/mjhaQK3zAW","date":"Wed Jul 21 16:51:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"HAPPENING TODAY: emergency @TheBlackCaucus press conference to demand votes on the #ForThePeopleAct &amp; John R. Lewis Voting Rights Act.\n\nThe @SenateGOP shouldn't be able to filibuster Americans' voting rights! #ProtectTheVote\n\nFull details ➡️ https://t.co/WFpnXlKDXN https://t.co/YC3Lk0X60U","date":"Wed Jul 21 15:24:18 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"And I'd do it again. #GoodTrouble \nhttps://t.co/0PpTAmvWLS","date":"Wed Jul 21 13:53:05 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"BREAKING NEWS: @AppropsDems greenlight $5+ million in important #OH03 projects!\n\nGet more info ➡️https://t.co/ETEQV3dPaD https://t.co/vZmBamC7SC","date":"Tue Jul 20 18:21:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"No way, no how. #ProtectTheVote \nhttps://t.co/PD73Iuyecw","date":"Tue Jul 20 15:16:47 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Affordable housing IS infrastructure! Looking forward to hearing from my good friend @SecFudge at today’s @FSCDems hearing on guaranteeing EVERY American can #BuildBackBetter https://t.co/piF00INX5P","date":"Tue Jul 20 14:20:28 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: COVID-19 still kills more Americans than guns, car crashes, and flu combined.","date":"Mon Jul 19 19:28:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I'll continue to get in #GoodTrouble to #ProtectTheVote! ✊🏿🇺🇸\n\n📷: Jose Luis Magana (@AP) https://t.co/WWZzhtwrjC","date":"Mon Jul 19 17:54:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨🚨 DON'T MISS OUT 🚨🚨\n\nThe 2021 expanded Biden #ChildTaxCredit will put MORE money in your pocket! \n\nGo to https://t.co/xYUghBxzxS for more info. https://t.co/1Ay2AhIuaq","date":"Mon Jul 19 16:07:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"He's messing with the wrong Member of Congress! #ProtectTheVote https://t.co/Jg9RUXVFJH","date":"Mon Jul 19 15:03:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Actions speak louder than words. 🗣 #DiversityMatters","date":"Sun Jul 18 19:20:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"If @LeaderMcConnell can carve out a filibuster exception to ram through Trump’s SCOTUS nominee, @SenateDems can do the same to protect Americans’ voting rights. 🇺🇸 #ProtectTheVote","date":"Sun Jul 18 15:21:14 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"More photos from the christening of the #USNSJohnLewis. Glad to get in #GoodTrouble with THE @AlfreWoodard &amp; @RepJeffries. https://t.co/43WvHLtTVr","date":"Sat Jul 17 17:46:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"An amazing man, ship, event, and day. #USNSJohnLewis #GoodTrouble https://t.co/wSEilGtJK7","date":"Sat Jul 17 16:54:43 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Beautiful day to honor a beautiful soul. Great to join @SpeakerPelosi, fellow @TheBlackCaucus members &amp; @HouseDemocrats to christen the USS John Lewis. #GoodTrouble https://t.co/3AMvSqNTyo","date":"Sat Jul 17 15:02:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"One year later. You’re sorely missed. #GoodTrouble https://t.co/EKXXMiI5Tt","date":"Sat Jul 17 12:13:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Heads up @DonaldJTrumpJr...\n\nSince your Dad lost, got kicked off Facebook &amp; Twitter for inciting an insurrection that killed 5, &amp; keeps lying about the election, Govs. Kemp &amp; Abbott and Republican states are working overtime to deny Americans' the right to vote. It's a big story.","date":"Fri Jul 16 20:31:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Not a chance. #ProtectTheVote","date":"Fri Jul 16 19:35:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Honored to receive the @WomensCSA Congressional Impact Award for my commitment to inspiring, encouraging and elevating women in the Halls of Congress and beyond.\n\n#WhenWomenSucceed, America succeeds! 🇺🇸 #HighHeelsInHighPlaces https://t.co/n9yOQPxXBw","date":"Fri Jul 16 15:59:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The @SenateGOP shouldn't be able to filibuster Americans' voting rights. 🇺🇸\n\nPass it on. #ProtectTheVote","date":"Fri Jul 16 14:01:58 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS is why we march! Let the people vote! #OurPowerOurMessage https://t.co/gouCMgSkGK","date":"Fri Jul 16 11:37:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The only way we can make a change is by passing the John Lewis Voting Rights Act. Our voice is our vote. Our vote is our power! Thank you @MSNBC @TheLastWord  Lawrence O’Donnell. #OurPowerOurMessage https://t.co/ASpUVeqauk","date":"Fri Jul 16 02:54:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"You can arrest me. You can’t stop me. You can’t silence me.","date":"Thu Jul 15 23:56:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Statement on peaceful Senate demonstration. #GoodTrouble #YourVoteMatters https://t.co/ID1nlwmA41","date":"Thu Jul 15 21:31:21 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#GoodTrouble","date":"Thu Jul 15 20:13:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Let the people vote. Fight for justice. https://t.co/JnEUPl9KJW","date":"Thu Jul 15 19:45:20 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We will not be turned around. We will keep walking. We will fight for freedom. We will fight for our right to vote! https://t.co/uyJHXEy8Y0","date":"Thu Jul 15 19:42:11 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Black women are demanding OUR right to vote! We’re marching to the Senate to send a strong message. ✊🏾 #OurPowerOurMessage https://t.co/YyGT4uayto","date":"Thu Jul 15 19:35:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"WATCH LIVE: Speak Out: Call to Action Day on Capitol Hill. Marching to U.S. Senate to demand action. Black women. Free to vote!\n\n📺 https://t.co/bfxE3phv2P","date":"Thu Jul 15 19:22:18 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Did you receive $300 or $250 in your bank account today? It's the expanded #ChildTaxCredit as a result of @HouseDemocrats' #AmericanRescuePlan \n\nGet full details ➡️ https://t.co/h3pgVDHz1m https://t.co/5VTFIrHfQh","date":"Thu Jul 15 16:06:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Every Republican voted against expanding the #ChildTaxCredit which will cut child poverty in half! #StatOfTheDay","date":"Thu Jul 15 15:15:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"HAPPENING TODAY: 39 million American families will begin receiving monthly #ChildTaxCredit payments! Be on the lookout! 👀\n\nLearn more ➡️ https://t.co/dvsjXNDiCm https://t.co/HF2dUPsJPq","date":"Thu Jul 15 14:24:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The expanded #ChildTaxCredit will make a BIG difference in the lives of countless Central Ohio families! \n\n$3,600 per dependent under six\n$3,000 per dependent 6-17 years https://t.co/8phlCdkvTE","date":"Wed Jul 14 22:56:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"91.3%\n\nPercent of Central Ohio families receiving monthly cash payments beginning TOMORROW thanks to the American Rescue Plan. \n\nP.S. 0️⃣ Republicans voted for the bill. \n\n#ChildTaxCredit #ByTheNumbers https://t.co/eiQ6ouj4in","date":"Wed Jul 14 20:23:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Beginning tomorrow, nearly every Central Ohio family will qualify for monthly #ChildTaxCredit payments. The expanded credit is a result of House Democrats' and President Joe Biden's commitment to ensure that hardworking American families can #BuildBackBetter. Get more details. ⤵️ https://t.co/l3XTzucKaG","date":"Wed Jul 14 17:42:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"DID YOU KNOW: the @IRSnews launched an online tool for non-filer families to automatically receive the #ChildTaxCredit? 🤔\n\nCheck out https://t.co/xYUghBxzxS for more information.","date":"Wed Jul 14 16:55:47 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"@MissNthabeleng Congrats and Thank you for your vision and financial and banking leadership. I am a member of United States Congress. I would like to bring a delegation to meet with you. I am on the US Financial Committee.\nCan we zoom soon.\nCongresswoman Joyce Beatty","date":"Wed Jul 14 16:45:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I'll say it over and over again: you shouldn't be able to filibuster Americans' voting rights! 🇺🇸","date":"Tue Jul 13 20:01:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: you can't register and vote the same day in Ohio, but you CAN purchase a gun the same day! Does that make any sense? #DidYouKnow","date":"Tue Jul 13 17:56:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"DID YOU KNOW: the #ChildTaxCredit has expanded to $3,000 per child ages 6-17 and $3,600 per child under the age of 6?\n\nLearn more at https://t.co/xYUghBxzxS.\n\n🔁 Retweet now to help spread the word!","date":"Tue Jul 13 15:50:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"50 years &amp; going strong. ✊🏿 #OurPowerOurMessage \nhttps://t.co/PG2hC5OhoL","date":"Tue Jul 13 13:19:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Does this make sense...\n\nIn Georgia you can purchase a gun same day BUT can’t register and vote same day.","date":"Fri Jul 09 18:15:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"💯 agree. Affordable housing is infrastructure! Pass it on. \nhttps://t.co/Ujh0dxPN6F","date":"Fri Jul 09 15:48:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: more people have died from COVID-19 globally than the population of Los Angeles.","date":"Thu Jul 08 12:14:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 8 DAYS LEFT TO CLAIM. 🚨\n\nMake sure you take advantage of the expanded #ChildTaxCredit, but you better hurry--before it's too late! ⏬","date":"Wed Jul 07 19:53:57 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I won't stop until we put Tubman on the new $20.\n\nGet the latest now. ➡️ https://t.co/8a42kXqKeY https://t.co/9xXUpieuAG","date":"Wed Jul 07 16:34:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: ALL @GOP members voted against the #AmericanRescuePlan that is getting people back to work &amp; raising their wages!\n\nTheir constituents aren’t going to let them forget that – or their efforts to block EVERY proposal that puts American families first.","date":"Wed Jul 07 15:04:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🌉 $25 MILLION for Columbus Crossroads. \n👩🏿‍⚕️ $5 MILLION for Central Ohio health.\nMy bill to #RemoveHate passes House of Reps. 🏦 \nChair @FSCDems hearing holding banks' feet to fire. 🔥\n#4thOfJuly in Bexley.\n\nRelive it all. Read The Beatty Weekly Wrap Up!\nhttps://t.co/3yo0gACaS0","date":"Tue Jul 06 20:12:08 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It's been six months exactly since the deadly Capitol Insurrection. We deserve to know the truth. That's why I strongly support the the ongoing effort to investigate the domestic terrorist attack and get the American people answers. #TruthOverLies https://t.co/OMp1Ioj63C","date":"Tue Jul 06 17:56:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Show me the Tubmans! #TubmanTwenty https://t.co/f8OHa3sO1V","date":"Tue Jul 06 16:58:29 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"And we’re just getting started. #BuildBackBetter https://t.co/yz0zlIbSXX","date":"Tue Jul 06 14:14:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"All the more reason! #VaxUp\n\nhttps://t.co/RjHQlE9rB5","date":"Tue Jul 06 12:11:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy Independence Day from the Bexley #4thofJuly Parade! 🇺🇸 https://t.co/jUNGryK28W","date":"Sun Jul 04 19:10:46 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Wishing you a happy, healthy, and safe #4thofJuly! https://t.co/65uF9UzLJH","date":"Sun Jul 04 14:01:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Growing up with dyslexia and later on having a stroke, I know what it’s like to be counted out and told you “can’t.” That’s why I was so thrilled to receive this amazing drawing from an extremely talented artist who’s defying the odds every day! https://t.co/BIzbZSqRHi","date":"Fri Jul 02 14:46:46 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"850,000 new jobs in June! \n\nLet’s see how the @GOP spins this into a negative. They know @POTUS @JoeBiden &amp; @HouseDemocrats are bringing back our economy &amp; defeating COVID-19. #BuildBackBetter \nhttps://t.co/vpsHBvTRYT","date":"Fri Jul 02 13:03:52 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#January6th was one of the darkest days of our democracy. \n\nNearly six months after the insurrection, many questions about its circumstances &amp; the response to it remain.  \n\nThe American people deserve to know what happened and why. #TruthOverLies","date":"Thu Jul 01 20:16:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Trump and the Trump Organization are frauds. In more ways than one.","date":"Thu Jul 01 19:50:46 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: at least 10 @HouseGOP members voted to defund their own police departments. \nhttps://t.co/RveTMaqOhT","date":"Thu Jul 01 18:28:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#TeamBeatty is proud to help celebrate Somali Independence Day! https://t.co/hQVTzlUE5c","date":"Thu Jul 01 17:52:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"BREAKING NEWS: I have helped secure $25 MILLION for the Columbus Crossroads. This transformational project will make our community stronger. Talk about a win-win for my constituents and the economy! #GettingResults\n\nMore details. ⏬\nhttps://t.co/cdajIInjLQ","date":"Thu Jul 01 17:05:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It's time to #BuildBackBetter. It's time to invest in infrastructure. It's time to pass the #INVESTAct!","date":"Wed Jun 30 18:50:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 LEGISLATIVE ALERT 🚨\n\nThe House will vote 𝐓𝐎𝐃𝐀𝐘 on bill a to invest in:\n🌉 infrastructure\n📐 good-paying jobs\n🏭 American manufacturing (rural &amp; urban!)\n🌎 the climate crisis\n\n☎️ Call you Member of Congress now (202) 224-3121 &amp; tell them to pass the #INVESTAct!","date":"Wed Jun 30 18:31:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: 4,925 miles of Ohio roads need repair.\n\nFACT: 1,377 Ohio bridges do too.\n\nTransportation has a huge impact on Ohioans' daily life. It's how we get to work, school, the doctor, shop, and much more. \n\nThat's why TODAY @HouseDemocrats are voting YES on the #INVESTAct.","date":"Wed Jun 30 18:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today may be the last day of #PrideMonth, but that's no reason to stop celebrating who you are! Just ask @stonewallcmh. https://t.co/aztgiVlCod","date":"Wed Jun 30 17:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It's time for American companies to put their money where their mouth is! #DiversityMatters https://t.co/TQyicjdZ2e","date":"Wed Jun 30 15:25:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"BREAKING NEWS: the House passes @LeaderHoyer, @WhipClyburn, @RepBarbaraLee, @RepKarenBass, @GKButterfield, and my #RemoveHate bill to strip slavery, segregation, and sedition from the U.S. Capitol!\nhttps://t.co/o86D9nAsIT","date":"Wed Jun 30 14:16:15 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Tomorrow is built on today. Today is built on yesterday.","date":"Wed Jun 30 13:14:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: 120 @HouseGOP members voted against the effort to #RemoveHate from the U.S. Capitol, giving symbols of slavery, sedition, &amp; segregation a home in the People’s House. Another 24 were too scared to vote.","date":"Wed Jun 30 00:37:08 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#RemoveHate from the Capitol NOW!\n\nWe’re one step closer after the House passed @LeaderHoyer, @WhipClyburn, @RepBarbaraLee, @GKButterfield, @BennieGThompson, and my bill. \n\nSenate, your move.","date":"Tue Jun 29 22:34:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Keeping my 👀 on the lofty promises made my financial firms after George Floyd’s murder. Pledges and platitudes are great, but actions speak louder than words. 🗣 \n\n- @FSCDems Hearing “The Legacy of #GeorgeFloyd: An Examination of Financial Services Industry Commitments.” https://t.co/8KchbykHPK","date":"Tue Jun 29 19:52:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"At @FSCDems hearing today...\n\nFACT: American companies pledged $50+ BILLION—including $33 BILLION from financial firms—to address racial equity in the wake of George Floyd’s murder.\n\nFACT: only $250 million has gone out the door. \n\nWe need more than promises! We need action! https://t.co/cfLrVB6GZA","date":"Tue Jun 29 19:20:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Banks need to talk the talk &amp; walk the walk when it comes to promises addressing systemic racism. \n\n@FSCDems under my leadership are holding their feet to the fire! \n\n📺 WATCH LIVE ➡️ https://t.co/2aSuCI6CaQ","date":"Tue Jun 29 18:58:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am honored to serve as Speaker today on my bill to #RemoveHate from the U.S. Capitol! https://t.co/Rj92JemCtz","date":"Tue Jun 29 18:06:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Hate has NO place in our society, let alone the Halls of Congress! Let’s #RemoveHate and ensure that the People’s House reflects the very best of America. https://t.co/YLHQCrBEOr","date":"Tue Jun 29 16:04:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"$5,000,000 in 𝒏𝒆𝒘 federal funding for Central Ohio! \n\nGet full details ➡️ https://t.co/xxxaCI2til https://t.co/qCweihcQ8x","date":"Tue Jun 29 15:18:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"WATCH NOW!\n\n@FSCDems are taking action TODAY to protect Americans' credit during COVID-19 Pandemic.\n\n📺 https://t.co/bvnrc81FY1 📺","date":"Tue Jun 29 14:07:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"VOTE ALERT: Proud House will pass @LeaderHoyer, @WhipClyburn, @RepBarbaraLee, and my bill to #RemoveHate from U.S. Capitol because it belongs in the dustbin of history.","date":"Tue Jun 29 13:57:30 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Sending love and light to my friend @MayorGinther and his family. Lifting them up during this exceptionally difficult time. ❤️ https://t.co/cZOKnslLbv","date":"Tue Jun 29 13:12:37 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We can't change the future if we can't acknowledge the past.","date":"Mon Jun 28 19:25:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Does your child qualify for the $300 #ChildTaxCredit monthly payments set to begin on July 15th? Get the answer to the #QuestionOfTheDay now by reading The Beatty Weekly Wrap Up! https://t.co/sTmPezbhKX","date":"Mon Jun 28 18:01:20 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I 💯 agree. Love is love! 🏳️‍🌈🏳️‍⚧️\n#PrideMonth #QuoteOfTheWeek https://t.co/UQJFcWDuu9","date":"Mon Jun 28 16:46:25 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"ICYMI: @GovMikeDeWine ends extended emergency unemployment. Beginning this week, Ohioans out of work will no longer receive extra $300/week.\n\nhttps://t.co/aPVk2xixVi","date":"Mon Jun 28 15:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"52 years ago, Americans banded together to push back against discrimination at the #Stonewall Inn. Today, we stand on their shoulders as we continue the work to ensure equality &amp; dignity for LGBTQ+ Americans every where. #OTD https://t.co/C3w76N0GBQ","date":"Mon Jun 28 14:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"To #BuildBackBetter we need to BUILD roads and bridges to the future. We need to invest in infrastructure. We need to pass the #AmericanJobsPlan!","date":"Mon Jun 28 13:24:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Accountability. Transparency. #JusticeForGeorge. https://t.co/WbaJ0RND9K","date":"Sat Jun 26 00:37:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Powerful roundtable with @SecFudge &amp; @MayorGinther today. To #BuildBackBetter we need to invest in infrastructure, repair our roads, bridges, highways, &amp; waterways, and expand broadband. #InfrastructureIsCalling https://t.co/1S2VJWOqyN","date":"Fri Jun 25 19:22:29 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thank you @MidOhioFoodBank for helping us #VaxUp Central Ohio! #WeCanDoThis https://t.co/QpFDVuKaaC","date":"Fri Jun 25 18:49:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s the final push. #WeCanDoThis!\n\n#VaxUp because your life may very well depend on it. https://t.co/Nuw7OG0OUD","date":"Fri Jun 25 18:29:29 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@midohiofoodbank is making sure more Central Ohioans #VaxUp. They’ll help YOU too! Come out, roll up your sleeve, and let’s defeat COVID-19. #WeCanDoThis https://t.co/S9TeRu7DID","date":"Fri Jun 25 18:20:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: 8 years ago today, the Supreme Court gutted the 1965 Voting Rights Act, sparking a wave of new voter restriction laws. \n\nFACT: just this year, 17 states have enacted 28 voter restriction laws.\n\nFACT: we must #RestoreTheVote. Our democracy is at stake! https://t.co/EqLAYzDJBC","date":"Fri Jun 25 18:15:10 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We are defeating COVID-19, but we need your help. #VaxUp, Ohio! #WeCanDoThis https://t.co/eD9NC2vSIJ","date":"Fri Jun 25 16:45:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I got my shot, did you? #WeCanDoThis #VaxUp https://t.co/eNLp6n7Raw","date":"Fri Jun 25 15:29:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Looking forward to crisscrossing the Buckeye State today with my good friend @SecFudge to talk infrastructure and vaccines. \n\n#HelpIsHere Ohio! https://t.co/VeALhMPLK2","date":"Fri Jun 25 13:47:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thanks to @HouseDemocrats and @POTUS @JoeBiden, countless Central Ohio families will begin receiving expanded #ChildTaxCredit monthly payments on July 15th! Be on the lookout. 👀 https://t.co/4DOmsNXrWw","date":"Thu Jun 24 20:41:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The expanded #ChildTaxCredit is putting MORE $$ in Central Ohio families’ pockets to pay for childcare, put gas in the car, pay bills, and so much more! https://t.co/RMsd1kGSRs","date":"Thu Jun 24 17:58:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Highlighting the expanded #ChildTaxCredit &amp; its impact on Central Ohio families.\n\n1️⃣ $3,600 for dependents under 6\n2️⃣ $3,000 for dependents 6-17\n3️⃣ 91%+ Central Ohio children qualify. \n\n@TheDemocrats &amp; @POTUS @JoeBiden are committed to putting money in pockets. https://t.co/9xMy6Ktfsu","date":"Thu Jun 24 16:15:16 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I’m fighting every day for my constituents and our community! 💪🏾 #ForThePeople https://t.co/DrFRPgr9fZ","date":"Thu Jun 24 14:43:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: @TheDemocrats &amp; @POTUS @JoeBiden expanded the #ChildTaxCredit to help hardworking American families.\n\nFACT: 91%+ of Central Ohio children will benefit.\n\nFACT: 53,000 Central Ohio families will receive $3,300 on average.\n\nFACT: payments begin on July 15.\n\n#ByTheNumbers https://t.co/uOz8FLYDI9","date":"Thu Jun 24 13:41:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Show me the Tubmans! #TubmanTwenty https://t.co/wvVzMiwZdi","date":"Thu Jun 24 11:38:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The truth shall set you free.\n\nhttps://t.co/T1vEpqXeUx","date":"Wed Jun 23 23:54:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"America is a melting pot. Let’s celebrate it! 🇺🇸\n\nhttps://t.co/V9IMgkfJyo","date":"Wed Jun 23 19:25:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 #InfrastructureIsCalling &amp; Congress must answer! 🚨\n\nInvesting in our infrastructure would support workers and create good-paying jobs in: \n🚧 Construction\n📐Engineering \n🔋 Clean tech manufacturing \n➕And more","date":"Wed Jun 23 15:07:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: COVID-19 has devastated Black business owners, yet they were also more likely to be denied or experience delays in getting a PPP loan.\n\n@FSCDems are moving legislative solutions TODAY to achieve racial equity.\n\n📺 WATCH LIVE 📺\nhttps://t.co/eHeEWV7qWf","date":"Wed Jun 23 13:14:40 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@SenateGOP won’t even allow debate on a bill expanding and protecting Americans’ voting rights. Speaks highly of their “values.” #YeahRight \n\nhttps://t.co/WRKjnAHmd0","date":"Tue Jun 22 22:44:57 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Voter suppression is real.","date":"Tue Jun 22 22:00:31 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We made history last week! Find out how by reading the Beatty Weekly Wrap Up.\nhttps://t.co/tWEhvISYMI","date":"Tue Jun 22 20:05:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 Racism is a NATIONAL CRISIS! 🚨","date":"Tue Jun 22 19:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We need to:\n🗳️ Protect our freedom to vote\n💸 Stop billionaires from buying elections\n❌ End partisan gerrymandering\n💰 Stop corruption and conflicts of interest\n\nThat’s why it’s time for the Senate to pass the #ForThePeople Act! https://t.co/LMUhX1W4mm","date":"Tue Jun 22 18:05:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 LEGISLATIVE ALERT 🚨\n\nMy bipartisan affordable housing bill is ONE STEP from becoming law!\n\n☎️ Call your Senators now (202) 224-3121.\n\nTell them to support the Housing Financial Literacy Act!\nhttps://t.co/me710tAXRw","date":"Tue Jun 22 15:43:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"You shouldn’t be able to filibuster Americans’ voting rights. 🇺🇸","date":"Tue Jun 22 12:50:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: @HouseDemocrats &amp; @POTUS @JoeBiden expanded the  #ChildTaxCredit to provide direct $ for working &amp; low-income families w/ kids. \n👶  $3,600 per child ages 0 to 5.\n🧒  $3,000 per child ages 6 to 17.\n\nRT now to spread word &amp; find out more at https://t.co/xYUghBxzxS.","date":"Mon Jun 21 18:10:07 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thanks to @POTUS @JoeBiden we’re definitely on track to #BuildBackBetter!\n\nTogether, with @HouseDemocrats, we’re delivering real results. #ByTheNumbers https://t.co/zo9Ib2SQgr","date":"Mon Jun 21 15:58:31 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Every child deserves a high-quality education no matter where they live!\n\nhttps://t.co/krnmGm6pFC","date":"Mon Jun 21 13:18:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Missing my beloved Otto too. An amazing father. First Father’s Day without him. 💔 https://t.co/B0dXB8Phgh","date":"Sun Jun 20 12:19:37 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Looking forward to talking with @MSNBC’s @AliVelshi 8AM TODAY about #Juneteenth, voting rights, and the work ahead.\n\nBe sure to tune in. https://t.co/GE0H6ysS2n","date":"Sun Jun 20 11:55:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Missing my dad today and always. Happy Heavenly Father’s Day. ❤️ https://t.co/c5P638dhvk","date":"Sun Jun 20 11:25:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The work continues. ✊🏾#OurPowerOurMessage https://t.co/6FEHZ9H9wj","date":"Sat Jun 19 15:37:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“Struggle is a never ending process. Freedom is never really won, you earn it and win it in every generation.”- Coretta Scott King. #Juneteenth ✊🏾","date":"Sat Jun 19 13:16:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"This #Juneteenth and every day, we must remain relentless in our mission to achieve equity, equality, and justice for ALL Americans.\n\nBlack History is American History! 🇺🇸 https://t.co/LqXhqc3ixi","date":"Sat Jun 19 12:13:57 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Most definitely. 💯 #PrideMonth #QuoteOfTheWeek https://t.co/Vl5ydI0nox","date":"Fri Jun 18 16:01:47 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Yesterday was certainly one for the books. #Juneteenth https://t.co/CFQV1VyKqA","date":"Fri Jun 18 13:14:21 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thanks @Usher for lending your voice to the momentous movement to make #Juneteenth a national holiday. \n\nBlack history is surely American history and we can’t change the future if we can’t acknowledge the past. #OurPowerOurMessage ✊🏾 https://t.co/YYWkyPeobd","date":"Fri Jun 18 01:21:11 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, we remember the 9 Souls senselessly lost at #MotherEmanuel Church on June 17, 2016. We can honor them and prevent similar tragedies by closing the Charleston Loophole. https://t.co/QuQV2u8SEO","date":"Thu Jun 17 21:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#Juneteenth is a national holiday, and I have the pen to prove it! 🖊 https://t.co/WhoqXPDhHd","date":"Thu Jun 17 20:09:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@Usher knows that Black History is American History! ✊🏾🇺🇸 #OurPowerOurMessage #Juneteenth https://t.co/Qz7374IBbP","date":"Thu Jun 17 19:59:39 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"At the @WhiteHouse. Ready to go. \n\n#Juneteenth Forever. https://t.co/0cPioMbnoC","date":"Thu Jun 17 19:21:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"WATCH LIVE: beginning at 3PM: @POTUS @JoeBiden #Juneteenth Signing Ceremony at @WhiteHouse.\n\nI'll be watching. Hope you will too. https://t.co/ZRuEJLJYJn","date":"Thu Jun 17 18:37:34 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Excited to be at the @WhiteHouse to witness history! #Juneteenth https://t.co/SS5rFRPTcu","date":"Thu Jun 17 16:25:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS JUST IN: Republicans fail (for 65th+ time) to destroy the Affordable Care Act and eliminate coverage for Americans with pre-existing conditions! #StayWoke 👀\nhttps://t.co/m0FBQhD7Qn","date":"Thu Jun 17 15:09:29 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#Juneteenth National Independence Day is approved by Congress. Next stop, @WhiteHouse and @POTUS @JoeBiden’s signature. \n\nSee you there! 😁 https://t.co/GgTUAoNIB7","date":"Thu Jun 17 14:24:28 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"A momentous moment made possible through the strong voice &amp; leadership of @TheBlackCaucus. \n\nAmerica officially recognizes #Juneteenth National Independence Day. \n\nWe celebrate today, but realize we have much more work to do to achieve a brighter tomorrow. #OurPowerOurMessage https://t.co/jbLYcmOLdD","date":"Thu Jun 17 13:39:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Looking forward to joining @SpeakerPelosi for the historic engrossment of the #Juneteenth National Independence Day Act. We did it. \n\nWe can’t change the future if we can’t acknowledge the past. https://t.co/UzMoio9zQc","date":"Thu Jun 17 12:44:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Some perspective. #TruthToPower https://t.co/gKuJGBCgOk","date":"Thu Jun 17 01:45:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🎉 IT'S OFFICIAL 🎉\n\n#Juneteenth is NOW a national holiday!\n\nWe can't change the future if we can't acknowledge the past. \n\nhttps://t.co/Gtqzp4eW2A","date":"Wed Jun 16 23:19:47 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"100 years after they so valiantly defended our country and helped win WWI, the #HarlemHellfighters are just 1⃣ step away from getting the recognition they so greatly deserve. \n\nNever forget: Black History is American History. ✊🏿\nhttps://t.co/SLfHwhcxRN https://t.co/pQZMmywFjl","date":"Wed Jun 16 18:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 DON'T MISS OUT! 🚨\n\nCritical #SmallBusiness #COVID19 tax credit extended through September 30, 2021.\n\nGet details now. ⏬\nhttps://t.co/XxDWoi595d","date":"Wed Jun 16 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"LEGISLATIVE ALERT: the House is expected to pass a bipartisan bill TODAY to make #Juneteenth a federal holiday!","date":"Wed Jun 16 16:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#GoPurple to help raise awareness &amp; advocate for greater investment in scientific and medical research around Alzheimer’s and dementia. \n\n 💜 Together we can #EndALZ! 💜\n\nGet more info ➡️ https://t.co/F1uf2dPRs5 https://t.co/vKbmrvvCNL","date":"Wed Jun 16 15:12:58 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Think about this...\n\n21 @HouseGOP members voted AGAINST giving the Congressional Gold Medal to @CapitolPolice for their actions-including protecting all of them—during the January 6th domestic terrorist attack. #Pathetic","date":"Wed Jun 16 13:49:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: 220,000+ American bridges are in need of repair.\n\nFACT: that’s 1 in 3 bridges across the country.\n\nFACT: it would take 40 years to repair them at the current rate.\n\nWe can’t wait that long. We need to #BuildBackBetter by passing the #AmericanJobsPlan!","date":"Wed Jun 16 12:36:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Juneteenth should absolutely be a federal holiday.","date":"Wed Jun 16 00:49:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS JUST IN: House passes @RepTomSuozzi, @RepEspaillat and my bill to award Congressional Gold Medal to the Harlem Hellfighters.\n\nBlack History is American History!\nhttps://t.co/TjKT1RsGu8","date":"Tue Jun 15 20:50:46 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Standing up for survivors by introducing the Trafficking Survivors Housing Act.  \n\nRead more on bipartisan bill ⏩ https://t.co/yu2M9wTXMq https://t.co/KbEoCgX3pZ","date":"Tue Jun 15 18:54:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thanks to the #AmericanRescuePlan...\n\nVaccinations are up ⏫\nCOVID cases are down ⏬\nJob growth is up 📈 &amp; unemployment is down 📉\n\n@POTUS @JoeBiden's economic plan is working! \n#HelpIsHere","date":"Tue Jun 15 18:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"New documents reveal just how desperate Trump was to stay in the @WhiteHouse. We can't allow him or his #BigLie anywhere near the Oval Office!","date":"Tue Jun 15 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, we celebrate the resilience and tenacity of immigrant youth who won the DACA program for themselves and protected it from @GOP attacks. \n\nThey deserve better. #DACADay https://t.co/ZRcZ0ICify","date":"Tue Jun 15 17:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: men are 33% less likely to see a doctor &amp; tell them everything that's going on. Numbers are even worse for Black men. \n\nThis #MensHealthWeek, listen to your body, see a doctor if you need help, and KEEP IT REAL!\n \nGet more info ➡️ https://t.co/5Bij9WjIGu https://t.co/VyBOFFIfzh","date":"Tue Jun 15 15:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Joining my colleagues on the Capitol steps to remember and reflect on the 600,000+ Americans we’ve lost to COVID-19. Get vaccinated. Save lives. https://t.co/DQafLaC5uH","date":"Tue Jun 15 13:15:20 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I will be joining fellow Members of Congress TONIGHT (June 14th) to hold a Moment of Silence for the 600,000 American lives lost to COVID-19 at the U.S. Capitol. https://t.co/H6sAB1E0gQ","date":"Mon Jun 14 21:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"America is back. @POTUS @JoeBiden leading the way. https://t.co/NmqnIR25ba","date":"Mon Jun 14 20:22:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 HYPOCRITE ALERT 🚨\n\n@HouseRepublicans voted against the #AmericanRescuePlan, but they have no problem touting its success back home to their constituents.","date":"Mon Jun 14 20:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"$21 MILLION.\n\nWorking hard to deliver real results for my constituents and OH-03. \nhttps://t.co/zWDY5vvwTB","date":"Mon Jun 14 19:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy 246th Birthday, @USArmy!","date":"Mon Jun 14 17:44:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"You shouldn't be able to filibuster Americans' voting rights! 🇺🇸\n\nPass it on. #ForThePeople https://t.co/IWQfBSvjtT","date":"Mon Jun 14 16:23:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"\"The United States has grown and changed across the generations — and our flag has changed in turn.\" - @POTUS @POTUS \n\n244 years later, we celebrate the flag and continue our work to build the 'more perfect Union' it represents. #FlagDay https://t.co/rCwXQ387qb","date":"Mon Jun 14 15:22:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Prayers, love, and light to my friend @RepTerriSewell. 🙏🏾","date":"Mon Jun 14 11:19:53 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy Loving Day. https://t.co/mSBL1mB3AA","date":"Sun Jun 13 00:20:18 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We remember. #Pulse5YearsLater https://t.co/5oNqoU6DOL","date":"Sat Jun 12 18:54:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Words of wisdom.\nhttps://t.co/b55T70hDS1","date":"Fri Jun 11 16:58:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Truth. 💯 #PrideMonth #QuoteOfTheWeek https://t.co/kkTR7K263K","date":"Fri Jun 11 15:03:14 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We will not stop. \n\nAccountability. Transparency. Justice.\n\n#JusticeForCasey\n\nhttps://t.co/j8xkVoKNAj","date":"Thu Jun 10 18:48:20 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Banks talk a BIG game when it comes to diversity... it’s time they walk the walk too! \n\n@RepNikema and my bill will hold them accountable. #DiversityMatters \n\nhttps://t.co/cyDq1r6QmH","date":"Thu Jun 10 18:12:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to announce NEW $2+ million in funding to ensure more Central Ohio students succeed in &amp; outside the classroom.\nhttps://t.co/IIiwU0RQ6Q","date":"Thu Jun 10 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"\"In diversity there is beauty and there is strength.\" - Maya Angelou. #DiversityMatters https://t.co/rP9HfJp9Hc","date":"Thu Jun 10 16:11:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"HUGE announcement for #OH03. Everyone deserve safe, secure, and stable housing! https://t.co/L4nbhuuOlG","date":"Thu Jun 10 14:55:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"On the Equal Pay Act's 58th anniversary, let's FINALLY guarantee #EqualPayForWomen by passing the #PaycheckFairnessAct!\n\nBecause...\n1⃣ Women are paid 82 cents for every $1 paid to men\n2⃣ Black women = 63 cents\n3⃣ Native women = 60 cents\n4⃣ Latinas = 55 cents https://t.co/iFuxCl9Fyh","date":"Thu Jun 10 13:28:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s official. #LoveOverHate https://t.co/cM4yTv2qlx","date":"Thu Jun 10 00:44:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Teachers, healthcare professionals, frontline workers, and other hardworking Americans should NOT pay more in taxes than millionaires and billionaires!","date":"Wed Jun 09 22:42:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Childcare, eldercare, and a #CareEconomy helps America #BuildBackBetter! https://t.co/OCIjEKioFc","date":"Wed Jun 09 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"BREAKING NEWS: @TransportDems advance $19+ MILLION for important Central Ohio transportation projects!\nhttps://t.co/H4DwzXw0c9","date":"Wed Jun 09 17:00:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Rest in power. ✊🏿\nhttps://t.co/sJY1EqYtKA","date":"Wed Jun 09 15:40:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We must rebuild our communities and our economy better than before with the American Jobs Plan. \n\nIt’s time to #BuildBackBetter with @POTUS and @HouseDemocrats! https://t.co/281EyXpP9O","date":"Wed Jun 09 14:18:30 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Truth over lies. #Always","date":"Tue Jun 08 19:24:08 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Childcare and eldercare are now more important than ever. Let’s invest in the #CareEconomy! https://t.co/hUq2g90RyK","date":"Tue Jun 08 18:32:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@TheBlackCaucus is leading our nation’s effort to FINALLY close the racial wealth gap.\n\nIf the current trend continues it will take 200+ years to close the gap. https://t.co/yVZhR81Gdd","date":"Tue Jun 08 14:30:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS ⬇️⬇️ #BuildBackBetter #ByTheNumbers https://t.co/qPFvrmY95k","date":"Tue Jun 08 12:56:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS JUST IN: @USGAO gov't watchdog finds that Trump Administration @CFPB reorganization hurt agency's fair lending &amp; discrimination efforts.","date":"Mon Jun 07 20:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Busy week last week. Get the latest news. \n\nRead The Beatty Weekly Wrap Up.\nhttps://t.co/Bn5iLIa82R","date":"Mon Jun 07 19:09:10 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 NEWSFLASH 🚨\n\nParents &amp; caregivers can’t go back to work, grow our economy, &amp; build better lives for their families unless they know their loved ones are cared for &amp; safe. \n\nThat’s why @POTUS &amp; @HouseDemocrats are investing in the #CareEconomy. https://t.co/KLcJlcGuOM","date":"Mon Jun 07 16:42:55 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Soon if I have anything to do with it... and I do! #TubmanTwenty\nhttps://t.co/wriucr6dXO","date":"Mon Jun 07 14:42:40 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thinking of Breonna Taylor today on what would have been her 28th birthday. #SayHerName https://t.co/Dfn0xVO744","date":"Sat Jun 05 17:39:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"No doubt about it! 🏳️‍🌈🏳️‍⚧️ \n#PrideMonth #QuoteOfTheWeek https://t.co/KLp2IzMaJt","date":"Fri Jun 04 17:00:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I #WearOrange because the time is NOW to #EndGunViolence! \nhttps://t.co/L8rCk2ibgV","date":"Fri Jun 04 15:58:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS JUST IN: 550,000+ new jobs created last month! #BuildBackBetter","date":"Fri Jun 04 12:40:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#DiversityMatters at all levels of government! https://t.co/uK9Y0RxB7F","date":"Fri Jun 04 12:25:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@FSCDems, @RepMaxineWaters and I are ready to get to work with the @WhiteHouse to build Black wealth! \nhttps://t.co/wlNiAMWUBV","date":"Thu Jun 03 20:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"BREAKING NEWS: @HHSGov awards City of Columbus a $3.3+ million grant to help improve COVID-19 health outcomes for more Central Ohioans! #HelpIsHere\nhttps://t.co/IfGSmHTWVG","date":"Thu Jun 03 19:00:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy Birthday, @FLOTUS @DrBiden! 🎂🎉 https://t.co/4xr9DAnfK9","date":"Thu Jun 03 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨 STIMULUS CHECK FACTS 🚨\n\n🍲 Helped reduce food insecurity by 40%.\n💰 Helped reduce financial instability by 45%. \n❤️‍🩹 Helped reduce reported adverse mental health symptoms by 20%.\n0⃣ Republicans voted for last round of stimulus checks.\n\n#ByTheNumbers #HelpIsHere","date":"Thu Jun 03 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Under @POTUS @JoeBiden, the @CFPB is committed to protecting consumers from discrimination! #PeopleFirst \nhttps://t.co/dGwJGmFpFk","date":"Thu Jun 03 16:04:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The private sector should be doing even MORE of this to further diversity, equity, and inclusion in the financial services sector. #DiversityMatters #OurPowerOurMessage","date":"Thu Jun 03 15:10:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The power of public-private partnerships! NEW $13 million @CMHA housing development in #OH03 for survivors of human trafficking.\nhttps://t.co/Vo1hYw3Z4G","date":"Thu Jun 03 14:00:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Wishing you a safe and happy graduation-you earned it.\n\nCongratulations #ClassOf2021! \n\nhttps://t.co/vcXc8S0o4Q","date":"Thu Jun 03 12:47:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Every American deserves a chance to thrive. That’s why the #BidenBudget proposes historic investments that will create a stronger, more equitable future for America’s families AND help us #BuildBackBetter https://t.co/YoJfXvaD4T","date":"Wed Jun 02 18:16:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"ICYMI: @GovMikeDeWine rescinds Ohio mask mandate and COVID-19 related health orders.\nhttps://t.co/juX6AdpJ70","date":"Wed Jun 02 16:46:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"As a stroke survivor who was told they may never walk again,  I'm committed to helping more individuals &amp; families have the personal, psychological, &amp; professional supports they need to live life to the fullest. #RelentlessTogether \n\nRead more ➡️ https://t.co/D9MVL74P81 https://t.co/krdqA94NyF","date":"Wed Jun 02 16:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ma'Khia Bryant should be alive today.\n\nCasey Goodson, Jr. should be alive today.\n\nAndre Hill should be alive today. \n\n#SayTheirNames #JusticeForAll","date":"Wed Jun 02 14:40:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: during the last three months of the Trump Administration, the economy added an average of 60,000 jobs per month.\n\nDuring @POTUS @JoeBiden’s first three months the economy has added an average of 500,000 jobs per month.\n\n#ByTheNumber #BuildBackBetter https://t.co/rAlgc9dG8g","date":"Wed Jun 02 13:09:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#OurPowerOurMessage ✊🏾","date":"Wed Jun 02 00:50:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am joining @SenSherrodBrown &amp; Senator @RonWyden in calling for a COMPLETE investigation into the events leading up to the killing of Ma’Khia Bryant.\n\nHer family, friends, and our community deserve answers.\n\nRead full letter ➡️ https://t.co/94h7wUO4Ml… https://t.co/N5CJHRVJo9","date":"Tue Jun 01 21:02:33 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@GOP election integrity laws = voter suppression","date":"Tue Jun 01 17:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy #Pride Month! \n\nNo matter who you love or how you identify, I got your back!\n\nBe you. Be proud. 🏳️‍🌈🏳️‍⚧️\nRead more ➡️ https://t.co/ANVVNO7WhD https://t.co/kPx2J7y8GC","date":"Tue Jun 01 15:56:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We can't change the future if we can't acknowledge our past. #TulsaRaceMassacre\nhttps://t.co/03918HEuo8","date":"Tue Jun 01 14:48:57 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#OurPowerOurMessage ✊🏾","date":"Mon May 31 22:24:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"100 years ago today, a white mob demolished #BlackWallStreet, killing hundreds &amp; destroying the livelihood of generations of Black Americans. \n\nOn the solemn #TulsaMassacre anniversary, let’s face our past &amp; finally begin a truth &amp; reconciliation process.\nhttps://t.co/3UfczBTjSW","date":"Mon May 31 15:45:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"On #MemorialDay, we honor and remember those who made the ultimate sacrifice in defense of our country, freedoms, and way of life.\n\nOn behalf of a grateful nation and all Americans, I say the two most powerful words. Thank you. #HonorTheFallen https://t.co/NihwYbfzPE","date":"Mon May 31 14:03:43 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"How can you have an attack on the U.S. Capitol and the @GOP &amp; Republican @LeaderMcConnell vote against it?!? #TruthOverTrump","date":"Fri May 28 16:54:15 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Sad but not surprising. https://t.co/iAhw8O1HIg","date":"Fri May 28 16:43:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Truth over lies.","date":"Fri May 28 13:17:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy #OlderAmericansMonth! https://t.co/mJ2jrKTQuP","date":"Thu May 27 19:00:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Congratulations to the winners of the 2021 Congressional Art Competition. I can't wait to see the winning piece hang in the U.S. Capitol! https://t.co/jYDprJJQso","date":"Thu May 27 16:14:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I see you. @TheBlackCaucus sees you. And we are committed to ensuring ALL Americans can #BuildBackBetter after COVID-19. \nhttps://t.co/Z9M4grxXx5","date":"Thu May 27 15:21:46 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Republicans are desperate to forget January 6, 2021, but the American people will NEVER forget.","date":"Thu May 27 14:09:53 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Love it. You go girl. #HighHeelsInHighPlaces https://t.co/Xtpc2pMmTd","date":"Wed May 26 19:43:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS JUST IN: Excited to announce over $442 MILLION in COVID-19 relief funds for the City of Columbus and Franklin County. #HelpIsHere \nhttps://t.co/zvjYqQMFrB","date":"Wed May 26 17:57:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"My heart breaks for the entire San Jose community after yet another tragic shooting in America. #EndGunViolence","date":"Wed May 26 17:18:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Join me in saluting the dedicated, determined members of the Armed Forces for their steadfast service and sacrifice on behalf of our nation, freedom, and all of us. #HonorOurHeroes\nhttps://t.co/Osikug8LOs","date":"Wed May 26 16:32:04 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Don't miss out! #VaxUp","date":"Wed May 26 14:51:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It’s time to #BuildBackBetter with @POTUS @JoeBiden &amp; @HouseDemocrats!","date":"Wed May 26 14:32:37 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“My Daddy changed the world,” said Gianna Floyd, daughter of George Floyd. George Floyd did just that, and now we must do the same. \n\nWe will not rest until the Senate passes the George Floyd #JusticeInPolicing Act into LAW.","date":"Tue May 25 20:06:20 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Congress can’t get rid of @mtgreenee soon enough.","date":"Tue May 25 19:02:34 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am wearing green for #MentalHealthMonth. Join me in raising awareness &amp; letting people know it's okay to ask for help. #YouAreNotAlone\n\nhttps://t.co/vhxhrVcp6w","date":"Tue May 25 16:19:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Justice for Tamir. \n\nJustice for Breonna.\n\nJustice for Casey.\n\nJustice for Andre.\n\nJustice for Daunte.  \n\nJustice for Ma'Khia.\n\n#JusticeForAll #JusticeInPolicing #SayTheirNames.","date":"Tue May 25 14:46:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"9 minutes. 29 seconds.\n\nExactly one year ago, the world witnessed a knee on the neck of George Floyd. We must continue the fight for JUSTICE and create a future where NO ONE loses their life to preventable police violence.\n\nPass the George Floyd #JusticeInPolicing Act! https://t.co/S1711r3Ten","date":"Tue May 25 13:36:29 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Remembering my beloved Otto. Thank you @POTUS @JoeBiden &amp; @FLOTUS @DrBiden for your kind words. https://t.co/JWWBlI1OaI","date":"Fri May 21 16:06:09 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I love you, Otto. https://t.co/OMJ87H4ijk","date":"Wed May 19 13:56:18 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"https://t.co/ywPBRb3vGG","date":"Fri May 14 16:38:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"100% of @HouseDemocrats are COVID-19 vaccinated.  \n\nvs.\n\n&lt;50% of @HouseGOP are COVID-19 vaccinated.\n\n#ScienceOverFiction #ByTheNumbers","date":"Fri May 14 14:23:40 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"BREAKING NEWS: Central Ohio colleges and universities will receive $188 MILLION+ from the American Rescue Plan to weather the COVID-19's financial storm and ultimately help students graduate. \n\nRead more ➡ https://t.co/ilUGP2vr2Y https://t.co/WJqNwkHr6C","date":"Thu May 13 19:34:58 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"With three weeks left for @ColsCitySchools, let's #TBT to one of my old yearbook photos! https://t.co/xpBjrEvr8m","date":"Thu May 13 18:26:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: 91.6% of children in #OH03 could benefit from the expanded #ChildTaxCredit in the American Rescue Plan. \n\nMake sure to file your taxes to get your payments as soon as possible. https://t.co/wVEqL3mvnA https://t.co/gAEZ3DYPJm","date":"Thu May 13 16:30:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy National Infrastructure Week! \n\nThere's no better time than NOW to #LeadWithInfrastructure and #BuildBackBetter. \nhttps://t.co/E0bkig2p6d","date":"Thu May 13 15:21:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"And the TRUTH shall set you free.","date":"Thu May 13 13:54:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Eid Mubarak. May the days ahead bring all those celebrating blessings, peace and prosperity. https://t.co/bHYZk5Xxgg","date":"Thu May 13 01:06:11 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Don't miss out on claiming the expanded #ChildTaxCredit of up to $3,600+ per child. Deadline is May 17th. Get more info now. ⬇️\nhttps://t.co/BFTcvuzXwm","date":"Wed May 12 19:26:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thank you to our nation's nurses working on the frontlines to provide care, compassion, and saving lives. We are grateful for your selfless service and sacrifice this week and all year long! #EverydayHeroes #NationalNursesWeek \nhttps://t.co/3h5DHIPxQS","date":"Wed May 12 17:56:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Please join me in welcoming to the 117th Congress &amp; @TheBlackCaucus, Congressman Troy Carter! #OurPowerOurMessage https://t.co/KXXvRdvGlX","date":"Wed May 12 15:59:50 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #BigLie is the be-all and end-all.","date":"Wed May 12 15:00:30 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"HAPPENING TODAY: @FSCDems will advance @RepAlGreen's bill to expand protections against discrimination on the basis of sexual orientation, gender ID, census tract, or zip code.\n\nGet more info ➡️ https://t.co/MedpXEiInn","date":"Wed May 12 14:07:04 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"@ActiveRetirees https://t.co/icWRNUDLTJ","date":"Wed May 12 13:03:31 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #BigLie IS the Republican Party.","date":"Wed May 12 13:01:58 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We’re better than a C- in infrastructure. It’s time to #BuildBackBetter.","date":"Tue May 11 23:03:50 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"💰 Don't leave money on the table! 💰\n\nTake advantage of the #AmericanRescuePlan's expanded #ChildTaxCredit before its too late. \n\nFile your taxes by Monday, May 17th: https://t.co/FtCvHaY0qe. https://t.co/bW3Xp5jMAX","date":"Tue May 11 19:05:15 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"147 Republicans voted to overturn the 2020 Election.","date":"Tue May 11 17:42:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"One step closer. Justice for Tamir. #JusticeForAll \nhttps://t.co/NINaIaXGHd","date":"Tue May 11 16:14:30 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Honored and humbled to participate in THE @OhioState’s Spring 2021 Commencement and be awarded an honorary Doctor of Public Service.\n\nCongratulations graduates! 🎓 #Graduation2021 https://t.co/3kH2HFEe4j","date":"Tue May 11 14:33:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"No matter how you identify, @POTUS @JoeBiden wants to make sure you have high-quality, affordable healthcare. 🏳️‍⚧️\nhttps://t.co/H3Uvnmzip7","date":"Tue May 11 13:27:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"That feeling when you're fully vaxxed-up. Do you part! #DontWaitVaccinate https://t.co/tdRU12d48Q","date":"Wed May 05 18:30:24 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud of my 💯 score on @ActiveRetirees 2020 Congressional Scorecard. \nhttps://t.co/D5UQ86O3mS","date":"Wed May 05 17:06:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Transparency. Accountability. Justice https://t.co/HSOJaihKzr","date":"Wed May 05 15:01:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Lies catch up to you.","date":"Wed May 05 14:11:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"60 years ago today, 13 courageous Americans, including the @RepJohnLewis, started a monumental journey through the segregated South. \n \nAs we honor the #FreedomRiders and all the heroes of the Civil Rights Movement, we must recommit ourselves to justice &amp; equality for ALL. https://t.co/3905Vx5IwN","date":"Tue May 04 17:38:25 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Do you part. Get the shot. #VaxUp","date":"Tue May 04 16:09:47 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Never would have imagined seeing my face in Times Square! 😎 https://t.co/1EBai8Idjd","date":"Tue May 04 14:08:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"No man has a good enough memory to be a successful liar. - Abraham Lincoln","date":"Tue May 04 12:02:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"@PatrickHector @CULempowering @newsalemcares We’ve been talking about them extensively. In fact, the bill to make it possible passed out of Committee for the first time in history. Thanks for asking. Meanwhile, we’ll keep pushing for #ReparationsNowz","date":"Mon May 03 21:45:31 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Pass it on...\n\nGet Out the Vaccine! #VaxUp #DontWaitVaccinate \n\nhttps://t.co/J1ESvJeTAb","date":"Mon May 03 19:24:10 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"No matter your age. #VaxUp https://t.co/qdg47PT751","date":"Mon May 03 16:54:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"WATCH NOW: my Get Out the Vaccine Town Hall. \n\n📺 Tune in at: https://t.co/lugaD9bLHj. https://t.co/SDI4VmDAuh","date":"Mon May 03 15:50:37 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"🚨HAPPENING TODAY 🚨\n\nGet Out the Vaccine Town Hall\nMay 3, 2021\n11:30AM - 1:00PM (EST)\n \nGet your questions answered by Central Ohio's leading medical experts. \n\nWATCH LIVE ➡️ https://t.co/rm3jp3vJD9 https://t.co/ORpNGiICTM","date":"Mon May 03 14:09:21 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Standing together. One community. #VaxUp #DontWaitVaccinate https://t.co/UkuuaS8HJR","date":"Sun May 02 22:44:31 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Do your part! #VaxUp 👍🏾 https://t.co/fxlGnSuLlh","date":"Sun May 02 20:59:12 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Trust science. Don’t wait vaccinate! #VaxUp\nhttps://t.co/uiS3NH71rG","date":"Sun May 02 18:46:30 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Get Out the Vaccine at @newsalemcares. \n\nGet the vaccine TODAY, 2956 Cleveland Avenue, from 1PM - 6PM.\n#VaxUp #DontWaitVaccinate https://t.co/lxYY3ozUFh","date":"Sun May 02 16:10:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Don’t wait, vaccinate! \n\nStop by @CULempowering &amp; @newsalemcares Drive-Up #VaxUp TODAY! No appointment necessary.\n\nMore details ⬇️ https://t.co/T1WmBmj074","date":"Sun May 02 14:36:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"@TheBlackCaucus @RepHorsford @JacksonLeeTX18 @RepJoeNeguse @RepLucyMcBath @RepLawrence @RepDwightEvans @RepLBR @RepAdams @RepAnthonyBrown Great kick off in my District","date":"Sat May 01 16:58:25 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thank you @Walgreens for helping #OH03 Get Out the Vaccine! #VaxUp #DontWaitVaccinate https://t.co/6IAkG9dqEH","date":"Sat May 01 15:54:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Get Out the Vaccine! GOTV. #DontWaitVaccinate https://t.co/TNBIucr5A0","date":"Sat May 01 13:48:21 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Don’t wait vaccinate. Get Out the Vaccine! GOTV. #VaxUp https://t.co/ZcMJ590SHI","date":"Sat May 01 13:32:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Get Out the Vaccine weekend is underway in #OH03! Drive-up #VaxUp at @CULempowering and @newsalemcares TODAY until 6PM. https://t.co/xplr6HnNhA","date":"Sat May 01 13:30:55 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@LeaderMcConnell is demanding the Department of Education prevent schools from teaching the #1619Project? You don’t say! https://t.co/WBWzpjB6U7","date":"Fri Apr 30 20:08:27 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Drive-Up and #VaxUp.\n🚗 🚘 🚙 \n\nGet more details on my Get Out the Vaccine initiative beginning TOMORROW (May 1) through Monday, May 3rd.\n\nHope to see you there. https://t.co/dQ5kx4xTkl","date":"Fri Apr 30 18:35:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“Do not save what is left after spending, but spend what is left after saving.”- Warren Buffet #FLM2021 https://t.co/bh4sd0n3s3","date":"Fri Apr 30 16:00:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I know firsthand after being pepper-sprayed during a peaceful protest in downtown Columbus last summer! #PoliceReformNow\n\nhttps://t.co/aAgsFnQK9z","date":"Fri Apr 30 15:36:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"To participate please RSVP to either location with the links below. See you all this weekend! #GOTV \n\nColumbus Urban League: https://t.co/lirBHD05uG\n\nNew Salem Baptist Church: https://t.co/lPszTYDIvT","date":"Fri Apr 30 00:20:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"1 in 3 Americans have less than $50,000 saved for retirement! #FinancialLiteracyMonth2021 #StatOfTheDay","date":"Thu Apr 29 17:00:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Transparency. Accountability. Justice. ✊🏾\n\nhttps://t.co/mdJUCXNLQO","date":"Thu Apr 29 01:13:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Drive up Vax up! GOTV! (Get Out The Vaccine!)\nPop up vaccination clinics coming this weekend to the Columbus Urban League and New Salem Baptist Church on Saturday AND Sunday!\n\nSee the flyer for details. https://t.co/7qeGSYocn2","date":"Wed Apr 28 15:50:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: credit card debt has been rising every year for the last 5 years. #FinancialLiteracyMonth2021","date":"Wed Apr 28 15:00:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Index fund: An index fund attempts to track the performance of a financial market index, regardless of the conditions of that market. #FLM2021 #DefinitionOfTheDay","date":"Tue Apr 27 18:00:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Another milestone! Thank you @POTUS @JoeBiden! https://t.co/ToQ4ON9ea7","date":"Mon Apr 26 18:45:08 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Help determine the 2021 Congressional Art Competition Viewers' Choice. Winner determined by total Facebook 'likes. Voting runs through Monday, May 3rd. \n\nVOTE NOW! \nhttps://t.co/Lf7G8xVytS","date":"Mon Apr 26 16:00:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Improve your credit score now! @NPR has tips and tricks. #FinancialLiteracyMonth #TipOfTheDay\nhttps://t.co/YyptH5oKSO","date":"Mon Apr 26 14:00:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Calling on @POTUS @JoeBiden &amp; @TheJusticeDept to reopen the Civil Rights investigation into Tamir Rice's death. #JusticeForTamirRice https://t.co/lvBykRRKoN","date":"Fri Apr 23 20:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Police reform now. \n\nGeorge Floyd Justice in Policing Act now. \n\nTransparency. Accountability. Equal Justice. Now.","date":"Fri Apr 23 19:11:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“One penny may seem to you a very insignificant thing, but it is the small seed from which fortunes spring.”- Orison Swett Marden #FLM2021 https://t.co/mBtwmFisu1","date":"Fri Apr 23 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am fighting EVERY DAY to improve healthcare standards and outcomes for EVERY ONE! #NationalMinorityHealthMonth\nhttps://t.co/qRTjJx0aLn","date":"Fri Apr 23 15:42:43 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: America is wealthiest country in history of civilization, but only ranks 13th in infrastructure.\n\nOur roads, bridges, &amp; highways are crumbling, our electric grid is outdated, and too many lack high-speed Internet.\n\nLet's #BuildBackBetter. Let's pass the #AmericanJobsPlan https://t.co/DHqmHSTQpW","date":"Fri Apr 23 14:15:49 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Stop Asian Hate","date":"Thu Apr 22 20:59:45 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"What’s credit discrimination? @CFPB has the answer: https://t.co/sxf9S1ShyU  #FinancialLiteracyMonth #QuestionOfTheDay","date":"Thu Apr 22 19:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy #EarthDay2021! https://t.co/qXIq6dcQjt","date":"Thu Apr 22 18:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Jobless claims fall to another COVID-19 Pandemic low, but the work continues to #BuildBackBetter.","date":"Thu Apr 22 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today is Kevin’s last day in the Office. Thanks for all your help. #OH03 will miss you! https://t.co/nTTDxfIfGN","date":"Thu Apr 22 16:02:04 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"200 million COVID-19 vaccines in less than 100 days!","date":"Thu Apr 22 14:36:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"George Floyd Justice in Policing Act.","date":"Thu Apr 22 13:13:45 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"In case you needed a reminder. #BlackLivesMatter","date":"Wed Apr 21 22:30:09 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS JUST IN: My affordable housing bill just passed the House of Representatives by an overwhelmingly bipartisan vote. https://t.co/me710tAXRw","date":"Wed Apr 21 18:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Always divide your money in thirds: 1/3 spending, saving &amp; sharing. #FinancialLiteracyMonth2021 #TipOfTheDay","date":"Wed Apr 21 17:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We never had to guess what @RepHastingsFL thought or believed, he made it clear. Your @TheBlackCaucus colleagues and congressional friends will miss you dearly. https://t.co/WFTjhUUlGa","date":"Wed Apr 21 14:49:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today, we say goodbye to Congressman @RepHastingsFL. Rest in power. https://t.co/cQ5955G1HJ","date":"Wed Apr 21 14:35:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am at a total loss of words over the tragic killing of 16-year-old Ma’khia Bryant by the Columbus Police. My prayers are with her family and friends. Our community is hurting, has experienced too much heartbreak, and deserves better.","date":"Wed Apr 21 04:32:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Read my full statement on #DerekChauvin verdict. #JusticeForGeorge https://t.co/HzMILLEYb5","date":"Tue Apr 20 21:17:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"GUILTY X3.","date":"Tue Apr 20 21:09:04 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Verdict in in...","date":"Tue Apr 20 19:40:09 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: the average credit card debt in America is $6,194. #FinancialLiteracyMonth2021 #DidYouKnow","date":"Tue Apr 20 18:00:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We are seeking justice. We are writing the next chapter of history. #OurPowerOurMessage https://t.co/gP7U2SMeW0","date":"Tue Apr 20 16:44:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The Floyd family deserves justice! https://t.co/GYp2D7KE1z","date":"Tue Apr 20 13:58:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"There’s only ONE reason George Floyd is dead: Derek Chauvin.","date":"Mon Apr 19 20:53:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"In Minneapolis today standing with the Floyd family and all Americans to demand transparency, accountability, and equal justice. #JusticeForGeorge https://t.co/PAL3Tttvps","date":"Mon Apr 19 19:08:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Justice for George. ✊🏿","date":"Mon Apr 19 18:31:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“You have a right to be angry. You have a right to protest and let your voice be heard. And to express that anger. But don’t express it in a violent way, express it in a peaceful way.” \nhttps://t.co/J0WlH9JEqS","date":"Mon Apr 19 16:57:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"9 minutes 29 seconds.\n\nI can't breathe. 27x","date":"Mon Apr 19 15:30:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"In debt? Help is available. You have options… #FLM2021\nhttps://t.co/s2QS7ToTrI","date":"Mon Apr 19 14:00:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"There have been 50+ mass shootings in America since March 16th.","date":"Mon Apr 19 13:17:18 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Gun violence is a public health crisis.","date":"Sun Apr 18 16:13:41 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Reflecting on the power of one person's lies. https://t.co/wnh70KGBRp","date":"Fri Apr 16 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“An investment in knowledge pays the best interest.”- Benjamin Franklin #FLM2021 https://t.co/DN0vPFpONP","date":"Fri Apr 16 16:00:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"LAST DAY (April 16th) to submit artwork for my 2021 Congressional Art Competition. \n\nGet details now! ⬇️\nhttps://t.co/5HnoD2P4tk","date":"Fri Apr 16 15:33:43 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: 210 House Republicans voted against #EqualPay.","date":"Thu Apr 15 21:44:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Looking forward to many more meetings between @POTUS @JoeBiden, @VP @KamalaHarris, &amp; @TheBlackCaucus! #OurPowerOurMessage \nhttps://t.co/BmK1a51Q3D","date":"Thu Apr 15 20:45:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"VOTE ALERT I will proudly join ALL @HouseDemocrats to pass the Paycheck Fairness Act--and finally fulfill the promise of #EqualPay https://t.co/aEyyym7dIW","date":"Thu Apr 15 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: finances is the #1 reason why students withdraw from college. #FinancialLiteracyMonth2021","date":"Thu Apr 15 17:00:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Fair housing is a human right! 🇺🇸\nhttps://t.co/aVdlCQKUfG","date":"Thu Apr 15 16:12:34 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"One step closer. 400+ years later. #ReparationsNow \nhttps://t.co/6IOn4OayKF","date":"Thu Apr 15 14:17:48 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Police reform now.","date":"Thu Apr 15 00:50:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It is an honor to preside over the House for a vote on bipartisan resolution honoring beloved @TheBlackCaucus member, @RepHastingsFL-a dedicated champion of civil rights &amp; devoted rep. of Florida’s 20th Congressional District.  \n\nWe will miss you, Alcee. https://t.co/K6dcvTFihS","date":"Wed Apr 14 23:06:25 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"TWO DAYS REMAINING\n\nAccepting submissions for my 2021 Congressional Art Competition until 5:00PM, Friday, April 16th.\n\nSubmit your piece now. Winning artwork will be displayed in U.S. Capitol \n\nhttps://t.co/5HnoD36FkS","date":"Wed Apr 14 20:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to introduce the GROW Affordable Housing Act to increase certain affordable housing funding by 500%.\n\nGet full details ⬇️\nhttps://t.co/Po45NuBkML","date":"Wed Apr 14 19:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Progress.\nhttps://t.co/MhS3mkdriu","date":"Wed Apr 14 18:29:22 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #AmericanJobsPlan is a BIG deal for Ohio! #BuildBackBetter  \nhttps://t.co/WTo77c5rUg","date":"Wed Apr 14 18:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The time is now! Join @TheBlackCaucus in showing your support for @KristenClarkeJD to head the @TheJusticeDept @CivilRights Division.   ⚖ https://t.co/22OYnEQ8Lk","date":"Wed Apr 14 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Take time to improve your kid’s sense on dollars and cents! #FLM2021 https://t.co/yUCqLFs2bf","date":"Wed Apr 14 16:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Transparency. Accountability. Justice. ✊🏿 #SayTheirNames","date":"Wed Apr 14 14:33:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"First meeting at @WhiteHouse in the books. @TheBlackCaucus will continue to use #OurPowerOurMessage to strongly advocate for and advance the issues important to Black America. https://t.co/5JdW5SUlKa","date":"Tue Apr 13 22:28:23 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Very productive meeting in Oval Office today w/ @POTUS @JoeBiden &amp; @VP @KamalaHarris. @TheBlackCaucus looks forward to many more meetings at @WhiteHouse as we work to ensure Black Americans can #BuildBackBetter too. \n\nThis is #OurPowerOurMessage. https://t.co/qZR1fZ5fKl","date":"Tue Apr 13 21:19:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Systemic racism is a NATIONAL CRISIS.","date":"Tue Apr 13 20:04:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Headed to @WhiteHouse today to meet with @POTUS @JoeBiden, @VP @KamalaHarris, and fellow @TheBlackCaucus members to discuss COVID-19, the economy, voting rights, gun violence prevention, and justice for ALL Americans. #OurPowerOurMessage","date":"Tue Apr 13 17:36:43 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Infrastructure + transportation = more jobs &amp; stronger communities. #BuildBackBetter","date":"Tue Apr 13 17:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Financial education. Awareness. Empowerment.\n\nThe  3️⃣ keys to closing the racial wealth gap. #FinancialLiteracyMonth \nhttps://t.co/mi0fOD9QMK","date":"Tue Apr 13 16:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"BIG difference between taser &amp; a gun. #DuanteWright #BlackLivesMatter","date":"Tue Apr 13 15:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We honor the life and selfless service today of Capitol Police Officer William F. Evans. https://t.co/gyroBpM2Pv","date":"Tue Apr 13 14:09:16 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ramadan Mubarak to all those celebrating! https://t.co/6zKGZhiwzs","date":"Mon Apr 12 23:49:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"63% of children 18 and under have a savings account. #FinancialLiteracyMonth2021 #FastFact","date":"Mon Apr 12 20:04:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Relive the #First100DaysOf117th Congress now!\nhttps://t.co/m1wKFSK2GG","date":"Mon Apr 12 19:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The American Rescue Plan is WORKING. 🙌\n\n💉 150+ MILLION Americans vaccinated in 75 days.\n💵 Relief checks are arriving in mailboxes or bank accounts.\n📈 Over 916,000 Americans found jobs in March.\n\n#HelpIsHere #ByTheNumbers","date":"Mon Apr 12 18:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"April is Child Abuse Prevention Month, a time to raise awareness and empower people across the nation to play a role in creating supportive environments for child and their families. Together, we can prevent child abuse and maltreatment. #CAPMonth #BeAConnection https://t.co/cCGHaisqj1","date":"Mon Apr 12 17:00:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"During the #100DaysOf117th Congress, @HouseDemocrats fought for equal protection under the law, paycheck fairness, justice in policing, and so much MORE. \n\nJust imagine what we will do in the NEXT 100 days! 💪😁 https://t.co/YQGyAOd93K","date":"Mon Apr 12 16:22:32 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS JUST IN: Excited to announce $8.9+ million for @columbusairport through COVID-19/Government Funding Agreement because our economy can't 'take off' if planes are grounded! \nhttps://t.co/uHvRFT3t3C","date":"Mon Apr 12 15:31:53 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Every $1 in infrastructure investment generates $2+ economic benefit via @McKinsey.\n\n#AmericanJobsPlan #StatOfTheDay","date":"Mon Apr 12 14:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"ONE WEEK REMAINING! \n\nParticipate in my 2021 Congressional Art Competition. Winning artwork will be on display in the U.S. Capitol.  \n\nGet details ➡️ https://t.co/vuW3tCVEDa https://t.co/o6nGybfWN0","date":"Fri Apr 09 18:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Democrats and Republicans agree that it's time to #StopAsianHate!  \nhttps://t.co/IBL3EDsmfF","date":"Fri Apr 09 17:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“Financial literacy is just as important in life as the other basics.”- John W. Rogers #FLM2021 https://t.co/tWIgvJ3hFj","date":"Fri Apr 09 16:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"1 in 4 Americans are now vaccinated because of the American Rescue Plan. #VaxUp  #ByTheNumbers \nhttps://t.co/8D0mMzXt4Z","date":"Fri Apr 09 15:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Vaccines work. #TrustScience https://t.co/p2fctkCPbw","date":"Fri Apr 09 13:59:57 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Something to stew on...\n\nThe @GOP welcomed corporations &amp; BIG 💸💰🤑as people, until they had opinions on voting rights. https://t.co/z3tDAOvZU6","date":"Thu Apr 08 20:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Unbelievable tragedy. Devastated. My heart goes out to Wendell Light, his family, and all the victims.\nhttps://t.co/YyKcw7nvC7","date":"Thu Apr 08 18:46:59 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #AmericanRescuePlan is working! \n🩹150 MILLION shots in arms\n💵 150 MILLION stimulus checks for American families\n\n#HelpisHere #ByTheNumbers","date":"Thu Apr 08 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thank you for taking action, @POTUS @JoeBiden! #EndGunViolence\nhttps://t.co/0HfPLdDo5n","date":"Thu Apr 08 18:01:20 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"On Yom HaShoah, #WeRemember the six million Jewish victims of the Holocaust and vow #NeverAgain. https://t.co/VU7QMMZbhb","date":"Thu Apr 08 17:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"In the midst of the most challenging public health crisis of our lifetimes, it's more important than ever to celebrate public health! #NPHW\nhttps://t.co/hNDn9B9fOU","date":"Thu Apr 08 16:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Truth. #JusticeForAll https://t.co/wV62J3wvb3","date":"Thu Apr 08 15:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"You'll do the same after you #GetCovered! Promise.\n\nRegister by May 15th. https://t.co/09Ke6CGQ9X https://t.co/DOEMSLSLB7","date":"Thu Apr 08 14:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Powerful. 🙅🏾‍♀️","date":"Thu Apr 08 11:47:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Let's build a healthier, fairer world for everyone. #WorldHealthDay https://t.co/yckgtdzHbM","date":"Wed Apr 07 19:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"An amazing Central Ohioan. 💜https://t.co/VgynirnA9b","date":"Wed Apr 07 18:42:04 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"'Stand Your Ground' laws make communities less safe.","date":"Wed Apr 07 18:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #AmericanRescuePlan is crushing COVID-19 and helping us #BuildBackBetter.\n\nIt's all about:\n🩹Shots in arms\n💵Money in pockets\n🏫Children in schools\n🛠People in jobs https://t.co/eEw0w0b2Qv","date":"Wed Apr 07 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: there are enough privately-owned guns in America to arm every man, woman, &amp; child--AND still have 60 million+ left over!","date":"Wed Apr 07 16:29:04 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"$171,000 vs. $17,150.\n\nWhite household wealth vs. Black household wealth.\n\nTime to close the racial wealth gap! #FinancialLiteracyMonth2021","date":"Wed Apr 07 15:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"150 million shots in 75 days. Thank you, @POTUS @JoeBiden! #HelpIsHere #ByTheNumbers https://t.co/YLa5mOZQ3k","date":"Wed Apr 07 14:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"@HallieOnMSNBC Congressman Alcee Hastings served in Congress for nearly 30 yrs yet media doesn’t have the respect to post the correct image when reporting on his passing. Intentional or not it reflects a lack of respect. Regret after the fact is fine, research before the act is preferred.","date":"Tue Apr 06 17:04:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Now accepting submissions for the 2021 Congressional Art Competition! Winning piece will be displayed in the U.S. Capitol. \n\nMore details. ⬇️\nhttps://t.co/5HnoD36FkS","date":"Tue Apr 06 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: 73% of youth savings accounts were started before the age of 3! #FinancialLiteracyMonth2021","date":"Tue Apr 06 16:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I am incredibly heartbroken by the passing of my longtime friend and colleague Congressman Alcee Hastings. An outspoken champion for civil rights, voting rights, and his constituents, Alcee was the embodiment of a \"person for the people.\" (1 of 2) https://t.co/QtaNd5gizQ","date":"Tue Apr 06 15:06:52 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Even before our time together in Congress, I saw his drive, determination, &amp; commitment firsthand &amp; benefitted extraordinarily from his advice. My thoughts and sincerest prayers are with his children, family, friends, and the people of #FL20 during this difficult time. (2 of 2)","date":"Tue Apr 06 15:06:52 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"HAPPENING TODAY: @LowerLightsCHC COVID-19 Vaccine Pop-Up.\n\n2596 Sullivant Avenue, \nColumbus, OH 43204. \n10AM-4PM\n\nGet more details. ⬇️ #VaxUp https://t.co/qWn6623Dj2","date":"Tue Apr 06 14:00:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Join me this week in celebrating the magic of reading. 🪄🧙🏾🧙🏾‍♂️#NationalLibraryWeek  \nhttps://t.co/THtFzeLPUz","date":"Mon Apr 05 19:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ohioans, visit https://t.co/1dNhh8Ywnh NOW to determine eligibility &amp; to schedule your COVID-19 vaccine appointment. #VaxUp","date":"Mon Apr 05 18:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"NEWSFLASH: George Floyd is NOT on trial, Derek Chauvin is. #BlackLivesMatter","date":"Mon Apr 05 17:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Banks ❤️ to talk about diversity, but actions speak louder than words! #DiversityMatters\n\nhttps://t.co/6hOjYM2uWR","date":"Mon Apr 05 16:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: the #AmericanRescuePlan has helped regain nearly 65% of the 22 million jobs lost during COVID-19 Pandemic. #HelpIsHere https://t.co/wL0wFUxizv","date":"Mon Apr 05 15:04:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"57 million Americans have no emergency savings. #FinancialLiteracyMonth2021 #StatOfTheDay","date":"Mon Apr 05 14:00:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Harriet Tubman should be on the new $20.","date":"Sun Apr 04 21:06:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Easter is a time to come together and celebrate new beginnings, but please be sure to do so safely. \n\nWishing everyone a happy and healthy Easter! https://t.co/BPBk0D05Tf","date":"Sun Apr 04 16:09:13 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"As we mark 53 years today without Rev. Dr. Martin Luther King, Jr., let us never forget:\n\n“Darkness cannot drive out darkness; only light can do that. Hate cannot drive out hate; only love can do that.” https://t.co/Dl8E6uuLkO","date":"Sun Apr 04 13:48:58 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Calling ALL #OH03 high school students! 🎨👨🏾‍🎨👩🏾‍🎨 \n\nParticipate in the 2021 Congressional Art Competition. Grand prize winner will have artwork displayed in U.S. Capitol. Submission deadline is April 16, 2021.\n\nGet more details. ➡️ https://t.co/tulSRCsiiF https://t.co/rtb4BnrltB","date":"Fri Apr 02 17:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"“In all realms of life, it takes courage to stretch your limits, express your power, and fulfill your potential… it’s no different in the financial realm.”- @SuzeOrmanShow #FLM2021 https://t.co/HNeLFeiyak","date":"Fri Apr 02 15:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Spend some time today and this weekend reflecting on the values of compassion, hope, and community. https://t.co/9wS3M0QP1w","date":"Fri Apr 02 13:32:35 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The #AmericanRescuePlan is crushing COVID19 &amp; getting our economy back on track by putting:\n🩹 Shots in arms\n💵 Money in pockets\n🏫 Children in schools\n🛠 People in jobs\n\nGet more info now!\n1⃣ https://t.co/xVOB6UAnA6\n2⃣ https://t.co/3qaVsc0Xso","date":"Thu Apr 01 19:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It's super exciting to #GetCovered. \n\nFind out for yourself ➡️ https://t.co/09Ke6Cpfip https://t.co/zjxDxMZnQb","date":"Thu Apr 01 18:13:51 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy Birthday, @RepBowman! https://t.co/ZEsWPrjyfI","date":"Thu Apr 01 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Make better sense out of your dollars and cents. Happy #FinancialLiteracyMonth! \nhttps://t.co/zuhWOxzATV","date":"Thu Apr 01 16:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I can't breathe. 27 times. #JusticeForGeorge","date":"Thu Apr 01 15:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Excited to announce another $19+ MILLION to help fight COVID-19 in #OH03! \n\nhttps://t.co/PbopRkXtZx","date":"Thu Apr 01 13:22:19 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Now is the time! #BuildBackBetter https://t.co/2eC5n0gyjY","date":"Wed Mar 31 19:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"EXCITING NEWS! \n\n@WhiteHouse will create a COVID-19 vaccine outreach program after urging from @RepRobinKelly, @RepCardenas, and me. \n\nALL Americans need to #VaxUp!\n\nhttps://t.co/C7AQbxUCVZ","date":"Wed Mar 31 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"No one should be kicked out of home or forced to go homeless because of COVID-19. That's why @TheDemocrats included $30+ BILLION in the #AmericanRescuePlan to help keep families in their homes.\n\nThis bill is all about saving American lives and livelihoods. #HelpIsHere","date":"Wed Mar 31 17:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ohioan Jerrie Mock was the first woman to fly solo around the world. #WHM2021 https://t.co/HjNCrZQNmV","date":"Wed Mar 31 16:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"No matter how you identify, I got your back. \n\nToday and every day! 🏳️‍⚧️ https://t.co/4ek0FYnQWo","date":"Wed Mar 31 14:37:26 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"I got vaccinated for the health and safety of my family, friends, and constituents. How about you? #VaxUp https://t.co/blGXr4Xfc2","date":"Wed Mar 31 13:26:44 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Congratulations to Major General William Walker! He will be the FIRST Black American to serve as the U.S. House of Representatives Sergeant-At-Arms. https://t.co/vHTB7mzCTD","date":"Tue Mar 30 19:13:03 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Thank you today and always. #NationalDoctorsDay https://t.co/Gug5XCyI6t","date":"Tue Mar 30 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We MUST invest in our future to #BuildBackBetter. We MUST invest in transportation and infrastructure.","date":"Tue Mar 30 17:04:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Yvette McGee Brown was the first African-American woman Ohio Supreme Court Justice. #WomensHistoryMonth2021 #HighHeelsInHighPlaces https://t.co/adzRTfmocK","date":"Tue Mar 30 16:04:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Proud to score 💯 on @Defenders Congressional Scorecard because I'm 💯 about our wildlife, plants, and natural habitats. \nhttps://t.co/WiUY5BhXPy","date":"Tue Mar 30 15:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"ICYMI: @CDCgov extends eviction moratorium ban through June 30th.\n\nRead more ⬇️\n\nhttps://t.co/EqnbXQHXU7","date":"Tue Mar 30 12:59:31 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Don't be another statistic. Make sure you get the COVID-19 vaccine! #VaxUp  \n\nLearn more ➡️ https://t.co/4dneP8NuKN https://t.co/0OdeKIJj5w","date":"Mon Mar 29 19:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It's all about ability NOT disability! #DDawareness2021 https://t.co/1l31QawCfN","date":"Mon Mar 29 17:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"https://t.co/qgIoWgUCQS","date":"Mon Mar 29 16:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Today and every day, we demand #JusticeForGeorge. https://t.co/0WlRY7yOpS","date":"Mon Mar 29 15:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Malala Yousafzai is the youngest Nobel Laureate, globally recognized for her work fighting for gender education equality. #WHM2021 #HERStory https://t.co/dxgDG45xK5","date":"Mon Mar 29 14:00:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"https://t.co/ZtCQ1LpJRC","date":"Mon Mar 29 00:20:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"ALL Ohioans need to #VaxUp. Find out why TODAY!\n\n@ColumbusLinks Town Hall begins at 4:00PM. https://t.co/dwl0VRCgQU","date":"Sun Mar 28 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"May all those who celebrate be surrounded by light and happiness on #PalmSunday! https://t.co/Iq8X2cJRWR","date":"Sun Mar 28 15:34:37 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Wishing a healthy, safe, and happy #Passover to all who celebrate! https://t.co/miD4LMkMjY","date":"Sun Mar 28 15:33:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Before the Pregnancy Discrimination Act of 1978 women could be legally fired for being pregnant. #WHM2021 #DidYouKnow","date":"Sun Mar 28 15:00:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The @ColumbusLinks are 'Making it 𝐏𝐥𝐚𝐢𝐧 and 𝐒𝐢𝐦𝐩𝐥𝐞' TOMORROW. Tune in Sunday, March 28th, for an important conversation on why ALL Ohioans need to #VaxUp. \n\nGet more details. ⬇️\n\nhttps://t.co/YliszS2vKx https://t.co/b3iQzw1JE1","date":"Sat Mar 27 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The first woman elected to lead a nation was Sirimavo Bandaranaike of Sri Lanka in 1960. #WHM2021 #DidYouKnow https://t.co/W0LH6PNSLk","date":"Sat Mar 27 15:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"A BIG thank you @POTUS @JoeBiden for listening &amp; following though on commitment to ensure ALL Americans can #VaxUp. https://t.co/1f9tWywdIS","date":"Fri Mar 26 20:30:10 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: nearly 100,000 Ohioans will now qualify for reduced healthcare coverage AND some 25,000 will get a benchmark plan for $0 because of the #AmericanRescuePlan.\n\n#HelpIsHere Ohio.","date":"Fri Mar 26 18:13:29 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"\"A woman is like a tea bag, you can't tell how strong she is until you put her in hot water.\"- Eleanor Roosevelt #WHM2021 #QuoteOfTheWeek https://t.co/1EaDfM7u7J","date":"Fri Mar 26 17:00:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Can't wait until she is OMB Director Shalanda Young! ❤️ https://t.co/Mg2GZ2SSwe","date":"Fri Mar 26 16:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Happy Birthday, @SpeakerPelosi! Thank you for your leadership, friendship, and unyielding commitment to the American people. https://t.co/0bEsQnP7Up","date":"Fri Mar 26 15:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"#OH03 is united. #StopAsianHate","date":"Fri Mar 26 14:03:36 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Important conversation on COVID-19 this Sunday, March 28th, 4:00PM-5:00PM (EST). \n\nGet more details on @ColumbusLinks TownHall \"Overcoming COVID Vaccine Hesitancy.\n\nIt's all about Making it 𝐏𝐥𝐚𝐢𝐧 and 𝐒𝐢𝐦𝐩𝐥𝐞!\n\nVisit ➡️ https://t.co/YliszSk797 https://t.co/nRj7R932xt","date":"Fri Mar 26 13:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The financial services industry continues to talk the talk, but it's time for them to walk the walk and put words into action.\n\n⬇️ Get more details on @RepNikema's and my bill to make sure banks work better for ALL Americans! #DiversityMatters \nhttps://t.co/cyDq1r6QmH https://t.co/J1iZxYDrQP","date":"Thu Mar 25 19:46:54 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"The @GOP voted no, but their communities like the dough in the #AmericanRescuePlan. https://t.co/ejs8xi5ZQi","date":"Thu Mar 25 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Cities, counties, and communities need COVID-10 relief now! I am working hard to get them the support they so desperately need &amp; deserve! \nhttps://t.co/eEcwvG4vmt","date":"Thu Mar 25 17:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Frances Perkins was the first female Cabinet Secretary, serving as Secretary of Labor. #WomensHistoryMonth2021 https://t.co/NsrwI0mWAv","date":"Thu Mar 25 16:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"FACT: the #AmericanRescuePlan will lift 12,000,000 Americans out of poverty AND cut child poverty by 50%.","date":"Thu Mar 25 15:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Assault rifles belong on the battlefield NOT in the community! #EndGunViolence #EnoughIsEnough","date":"Thu Mar 25 13:45:17 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":".@POTUS @JoeBiden &amp; @TheDemocrats promised real relief to American workers, families, and small businesses. The #AmericanRescuePlan makes good on that promise. \n\n#HelpIsHere America! \n\nhttps://t.co/L5oFC9J1xO","date":"Wed Mar 24 19:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"2152.\n\nThe year the gender pay gap will close (if the current trend continues). \n\nIt's time for equal pay for equal work NOW! Time to pass the Paycheck Fairness Act! #EqualPayDay2021 https://t.co/5YxRGV1Ncc","date":"Wed Mar 24 18:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Still haven't received your #AmericanRescuePlan stimulus check? Never fear! \n\nHelp is available ➡️ https://t.co/u6PfX1qYFn https://t.co/80tNaXFZDN","date":"Wed Mar 24 17:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Equal pay for equal work. Today and every day!\n\nPass it on. #EqualPayDay2021 \n\nRead more ➡️ https://t.co/dWLOtXwmTN https://t.co/QgTgQyxKVL","date":"Wed Mar 24 16:01:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Ohioan Maya Lin at the age of 21 helped design the Vietnam Veterans Memorial in Washington, D.C. #WHM2021 #DidYouKnow https://t.co/zgZYvp5ARP","date":"Wed Mar 24 15:00:02 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"It shouldn’t be harder to vote than buy a gun!","date":"Wed Mar 24 13:29:57 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Powerful day with @POTUS @JoeBiden in #OH03 talking about the power of the American Rescue Plan. #HelpIsHere for my constituents and ALL Americans. \n\nThe work continues to #BuildBackBetter. https://t.co/ofniUzlN7k","date":"Tue Mar 23 23:29:58 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Just like @POTUS @JoeBiden said 11 years ago about the Affordable Care Act, the #AmericanRescuePlan is a “big deal!” It meets the moment for my constituents and ALL Americans. #HelpIsHere https://t.co/3vu35euvsq","date":"Tue Mar 23 21:48:56 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Grateful to spend time with @POTUS @JoeBiden today at @OSUCCC_James to mark 11th anniversary of the Affordable Care Act, discuss efforts to crush COVID-19, and eventually defeat cancer. https://t.co/aFLmlbjhrf","date":"Tue Mar 23 21:15:06 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"HAPPENING NOW: Shalanda Young confirmed by U.S. Senate as OMB Deputy Director. Now, let's make her OMB Director! https://t.co/s1N4dDN9MJ","date":"Tue Mar 23 19:03:42 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"We need common sense gun violence bills. \n\nTell @SenateGOP to pass the Bipartisan Background Checks Act and Enhanced Background Checks Act. \n\n☎️ CALL (202) 224-3121 NOW! ☎️\n#EnoughIsEnough #EndGunViolence","date":"Tue Mar 23 19:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Charity Early was the first African-American woman to be an officer in the Woman’s Army Auxiliary Corps. #WomensHistoryMonth2021 https://t.co/aI0ZaSz9Uz","date":"Tue Mar 23 18:00:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Can't wait to join @POTUS @JoeBiden today for his #HelpIsHere Tour in Columbus! https://t.co/ZDlfbfPZWU","date":"Tue Mar 23 17:29:38 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Deeply saddened by the passing of Ohio bball legend &amp; community activist Granville Waiters. Throughout his life, on &amp; off the court, he was a difference maker. I join all Ohioans in remembering, recognizing, &amp; reflecting on his tremendous impact. His legacy &amp; work will live on. https://t.co/QzrS4pRNJ6","date":"Tue Mar 23 16:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"HAPPENING NOW: $26+ million for #OH03 to fund groundbreaking research, early childhood education, &amp; in local economy. \nhttps://t.co/KivYVTe2eA","date":"Tue Mar 23 15:03:11 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"On March 23, 2010, the Affordable Care Act was signed into law by President @BarackObama. 11 years later, 23+ million more insured Americans, pre-existing conditions gone, and no more yearly/lifetime caps! \n\nHappy 11th Birthday, ACA! #ProtectOurCare https://t.co/utZZ5QtbFC","date":"Tue Mar 23 13:49:21 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"40 million Americans are at risk of going hungry because of COVID-19. \n\nZERO Republicans voted against doing anything about it.\n\n#ByTheNumbers #Priorities","date":"Mon Mar 22 20:47:47 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Looking forward to joining @POTUS @JoeBiden tomorrow in Columbus to highlight how #AmericanRescuePlan is delivering real relief to Central Ohio workers, families, and small businesses! #HelpIsHere \nhttps://t.co/Xyro9C5YWe","date":"Mon Mar 22 19:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Good afternoon! &lt;3 - Secretary @mlfudge https://t.co/YT2uQIf32Y","date":"Mon Mar 22 18:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Uninsured? Don't panic. #GetCovered now at https://t.co/09Ke6CGQ9X. Deadline is May 15th. https://t.co/CZi0eh8RYL","date":"Mon Mar 22 17:05:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"Americans are dying, schools are shuttered, &amp; millions of workers are still out of work. #HelpIsHere! \n\nThe #AmericanRescuePlan puts:\n🩹Shots in arms\n💵Money in pockets\n🏫Children in schools\n🛠People in jobs","date":"Mon Mar 22 16:03:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"THIS JUST IN: @GovMikeDeWine to allow Ohioans 16+ access to COVID-19 vaccine. Get details now. \nhttps://t.co/0vD4tDzOEg","date":"Mon Mar 22 15:02:00 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"In 1976 @BarbaraJWalters made television history by being the first woman to anchor a nightly newscast. #WomensHistoryMonth2021 https://t.co/DXtFKOEkxu","date":"Mon Mar 22 14:00:01 +0000 2021","user_id":"1531521632"},{"handle":"RepBeatty","text":"56 years later the march for equality, equal access to the ballot box, and justice continues. We can honor the brave men and women of the #SelmaMarch by passing the John Lewis Voting Rights Act. ✊🏾","date":"Mon Mar 22 01:11:42 +0000 2021","user_id":"1531521632"}]