[{"handle":"RepBurgessOwens","text":"More than half of Americans are dipping into their savings, borrowing money or going into debt just to cover their expenses.\n\nPresident Biden needs to address the crisis his disastrous economic policies created. https://t.co/GafJrVf3nx","date":"Thu Jun 16 19:00:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Race, income, and zip code should never be a barrier to high-quality education.\n\nI am proud to help introduce the Education Choice for Children Act to expand education freedom and help every student reach their God-given potential.\nhttps://t.co/KfYCLPeee8","date":"Thu Jun 16 17:30:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Yesterday, I announced 24 NEW co-sponsors to the Securing Our Students Act, legislation to redirect unused COVID funding to help America’s schools implement evidence-driven safety measures that protect our children and foster safe learning environments. https://t.co/dFIhoGcDII","date":"Thu Jun 16 17:00:01 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"READ MORE: \nhttps://t.co/IyPFjJXjqI","date":"Thu Jun 16 14:55:57 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Human trafficking denies freedom to an estimated 25 million people worldwide.\n\nProud to support the Human Trafficking Prevention Act of 2022, requiring all U.S. airplanes, airports, trains, train stations, busses, and bus stations to post the National Human Trafficking Hotline.","date":"Thu Jun 16 14:55:57 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"America's teachers make it possible for our kids to receive the life-changing gift of education.\n \nI enjoyed meeting with members of the Utah PTA in Washington today to discuss joint efforts to meet the academic, social, emotional, and safety needs of our students. https://t.co/7VZAiodArR","date":"Wed Jun 15 19:24:04 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"LIVE on @FoxNews with @JackBrewerBSI to talk about the vital role of fatherhood. Tune in! https://t.co/O9ljJbscuS","date":"Wed Jun 15 15:50:18 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"There is no greater joy than being a father.\n\n@RepDonaldsPress and I are proud to introduce a resolution promoting the foundational role of fatherhood and highlighting the need for family-first policies that strengthen children, families, and communities. https://t.co/I4Y4UIwQuK","date":"Wed Jun 15 14:25:44 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Today I voted YES on the Supreme Court Police Parity Act to extend essential security to Justices and their families. Protecting our Supreme Court Justices and their families from assassination attempts and violent threats should not be controversial.","date":"Tue Jun 14 20:40:59 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utahns tell me they’re facing significant shortages of medical dye used for scans that detect cancer and other serious diseases. I joined @RepSteel's letter to the FDA calling for immediate action to address this life or death issue. https://t.co/dXTC74PeF9","date":"Tue Jun 14 17:26:09 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"My bill - the Securing Our Students Act - would give states the ability to immediately re-allocate unspent COVID funding to address urgent school safety needs.\n\nRead more:\nhttps://t.co/ODfagP61RU","date":"Tue Jun 14 16:00:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"For 245 years, the American flag has been a powerful symbol of freedom, liberty, and opportunity, representing the extraordinary sacrifices of our servicemembers and the values of our great nation. Happy #FlagDay! https://t.co/rjbRIoBAFV","date":"Tue Jun 14 14:22:15 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 247th Birthday, @USArmy!","date":"Tue Jun 14 13:46:53 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I was honored to greet dozens of heroes from the @UtahHonorFlight last week as they toured the monuments built in their honor. May God bless our veterans and their families. https://t.co/AYERxjRGFI","date":"Mon Jun 13 19:15:58 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"For the first time in history, Utah gas prices have officially hit $5 per gallon.\n\nPresident Biden needs to take action and unleash U.S. energy independence. https://t.co/mEwMuToxvW","date":"Thu Jun 09 14:40:42 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"It was an honor to welcome 75 Utah veterans to Washington D.C. for the @UtahHonorFlight.\n \nThank you to these American heroes for their selfless service and countless sacrifices. 🇺🇸🇺🇸🇺🇸 https://t.co/AYnW5jOR57","date":"Wed Jun 08 18:39:51 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Juab Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. We're here to help you!\n\nFor more information, visit https://t.co/REkdD4XUTC. https://t.co/uhy2UgjeUi","date":"Tue Jun 07 22:00:02 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Sanpete Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. \n\nWe're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/GuGlHFE8mB","date":"Tue Jun 07 19:21:38 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Roughly 93% of ARP funding for K-12 schools remains unspent.\n\nToday, I introduced the Securing Our Students Act, legislation allowing local schools to use these funds to implement evidence-based safety measures that protect our students in the classroom. https://t.co/KAxRoEe5kX","date":"Mon Jun 06 16:11:38 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On the 78th anniversary of #DDay, we remember and honor the 160,000 Allied troops who stormed the beaches of Normandy to defend freedom.\n\nMay we never forget the courage and sacrifice of the Greatest Generation. https://t.co/noFnrlEich","date":"Mon Jun 06 14:22:09 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Our freedoms have an extraordinary cost. This #MemorialDay, we honor the American heroes who made the ultimate sacrifice in service to our great country. May God bless our fallen soldiers and their families. https://t.co/wItUy9g7jZ","date":"Mon May 30 14:27:56 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As a father and a grandfather, I am horrified by this senseless tragedy and heartbroken for these innocent children and their families. May God be with the Uvalde, Texas community. This is every parent’s worst nightmare.","date":"Tue May 24 22:54:31 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Whether it's remote education, telehealth, or telework, rural broadband services are essential for Utahns. The Rural Broadband Network Study Act shines a light on major streaming services and their financial impacts on rural consumers and local providers. \nhttps://t.co/jTfE0ojWbP","date":"Mon May 23 18:43:22 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utahns tell me they're frustrated by the Small Business Administration's delays, mismanagement, and lack of communication.\n\nI'm proud to support the IMPROVE the SBA Act to address these issues and ensure much-needed support for Main Street USA.\n\nRead more: https://t.co/mETQuTnz1r https://t.co/RQYEJQ3avN","date":"Mon May 23 17:56:02 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Over 100,000 more Utahns are feeling the pinch of inflation.\n\nThis ongoing cost-of-living crisis is making it more difficult for hardworking families to afford gas, groceries, and everyday essentials.\n\nhttps://t.co/eUngK0bENw","date":"Mon May 23 16:04:01 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Freedom is not free. On #ArmedForcesDay, we honor the Americans - past and present - who so courageously answered the call to serve in Utah, across the country, and abroad. Thank you for your service to our nation. https://t.co/CsncsmQyrR","date":"Sat May 21 20:47:28 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Historic drought is challenging Utah's farmers, ranchers, and industries.\n\nProud to help @Rep_Stansbury introduce the Water Data Act, a collaborative effort to improve water data infrastructure for better decision-making and management of water resources.\nhttps://t.co/OiYzTZhfP7","date":"Thu May 19 17:22:20 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Baby formula is in short supply and parents across the country are scrambling to feed their newborns.\n\nI'm proud to co-sponsor the Access to Baby Formula Act to strengthen U.S. supply chains, keep shelves stocked, and prevent future shortages. https://t.co/Etoczo1lhZ","date":"Wed May 18 20:53:02 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours today in Herriman City if you're having issues with the IRS, VA benefits, passports, or any federal agency.\n\nWe're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/efSx7qc4w7","date":"Wed May 18 15:59:55 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"\"The national average cost of a regular gallon of gasoline hit $4.567 early Wednesday morning. This topped Tuesday's record of $4.523, which in turn had beat Monday's record of $4.470.\"\n\nAmericans can't afford Biden's high gas prices. https://t.co/aEFxnEtuLk","date":"Wed May 18 15:32:04 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This year, @NLEOMF will honor @ProvoPolice Officer Trent Halliday, who died of cancer at age 37 from chemical exposure after taking down 150+ meth labs in Utah. Our state is a safer place because of his dedicated service and selfless sacrifice. \nhttps://t.co/tGA3m0wgDi","date":"Wed May 18 14:22:39 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The House just passed a bill to rename the Provo Veterans Center after Col. Gail S. Halvorsen, a true American hero who exemplified the very best of Utah and our nation.   \n\nRest in peace, Col. Halvorsen.","date":"Wed May 18 00:49:01 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Small business owners in #UT04 are frustrated by the lack of accurate and timely information from the @SBAgov regarding their COVID Economic Injury Disaster Loans.\n\nI co-signed a letter to Administrator Guzman encouraging increased transparency and streamlined support. https://t.co/KxtVc3BOX7","date":"Tue May 17 21:44:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Over 40% of America’s baby formula is out of stock, leaving Utah moms and dads scrambling to feed their newborns. This is a heartbreaking crisis that requires immediate action. \nhttps://t.co/1GCn0yZWgC","date":"Tue May 17 18:55:16 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"During #NationalEMSWeek, we honor Utah's paramedics, EMTs, and the entire EMS workforce, who are first on the scene when emergency strikes. Thank you for answering the call to serve others and going above and beyond in your commitment to safety. https://t.co/B1fUMFJd6g","date":"Tue May 17 16:07:45 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Last week, I joined @BoydMatheson on @kslnewsradio to discuss the successful extension of RECA for downwinders who endured the federal government's 50+ years of above-ground nuclear weapons testing.\n\nListen here! https://t.co/KyKyeAHP4Q","date":"Tue May 17 15:41:58 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Utah Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency.\n\nWe're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/9K3O0GEJKx","date":"Tue May 17 14:35:16 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Instead of working to meet demand and drive down costs, President Biden canceled three offshore oil and gas lease sales off the coast of Alaska and in the Gulf of Mexico. We should be producing more American energy - not less.\nhttps://t.co/8t4eWjsxOS","date":"Fri May 13 13:44:45 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In the Beehive State, you'll find over 7,000 @UTNationalGuard members who are always ready and always there. Day and night, they keep us safe.\n\nWe're grateful for the Airmen and Soldiers of our National Guard and thank them for their courageous service. https://t.co/EcRWKqiilu","date":"Thu May 12 22:16:30 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The RECA Extension Act of 2022 is a win for downwinders in Utah and across the West. Thanks to @SenMikeLee for leading the charge to extend this program for the countless innocent Americans affected by the federal government's 50+ years of nuclear testing. https://t.co/aKYAZSMMso","date":"Thu May 12 20:30:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"\"Grocery costs were up 10.8% over a year ago, gasoline costs on average were up 43.6% over April 2021 &amp; costs related to shelter rose 5.1% in the last year.\"\n\nPresident Biden's policies produced the worst inflation since 1981 &amp; Utahns are paying the price. https://t.co/zjMZxTuhZn","date":"Thu May 12 19:30:46 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"America's law enforcement officers serve around the clock to protect our communities and keep us safe. During #NationalPoliceWeek, we honor these heroes and express our immense gratitude for their commitment serving others. God bless and protect our men and women in blue. https://t.co/ij3Er7Jtq1","date":"Thu May 12 19:03:34 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As President Biden's inflation soars and the cost of living continues to climb, two-thirds of Americans are living paycheck to paycheck. \n\nI'm proud to support the Informed Lawmaking to Combat Inflation Act to curb reckless spending and drive down costs. https://t.co/qobX3Mns2S","date":"Wed May 11 21:05:05 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"America's nurses serve on the frontlines of our healthcare system and make extraordinary sacrifices to save lives. \n\nDuring #NationalNursesWeek, we celebrate these essential workers and recognize their tireless efforts to care for others. \n\nThank you, nurses!","date":"Wed May 11 19:22:42 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Forcing biological females to compete against biological males is unfair and undermines equal opportunity on the field. \n\nI'm a proud supporter of @RepublicanStudy's push to save girl sports, and thank @RepGregSteube for leading the charge.","date":"Wed May 11 19:08:48 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The House just passed a bipartisan bill to extend the Radiation Exposure Compensation Act for 2 more years.\n\nRECA is a lifeline for Downwinders in Utah and across the West, who lived in the shadow of radiation exposure and suffered life-altering diseases. https://t.co/0rLvTaJAPv","date":"Wed May 11 17:26:18 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Congress passed the Radiation Exposure Compensation Act in 1990 to make right what the federal government got wrong when it conducted over 1,000 nuclear tests in our backyard.\n\nWe can't allow RECA to lapse when so many Downwinders are still suffering. https://t.co/ITkEDddhbP","date":"Wed May 11 16:45:18 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Juab Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. We're here to help you! For more information, visit https://t.co/REkdD5fvLa. https://t.co/iVfDYgQtew","date":"Wed May 11 00:00:01 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Sanpete Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. We're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/NX27Cxe2Zn","date":"Tue May 10 21:30:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Charter schools open the door to opportunity for millions of kids across the country - regardless of race, income, or zip code.\n\nThe bureaucratic hurdles proposed by Biden's Department of Education will only kneecap the success of America's students. https://t.co/xolkLs4OBR","date":"Tue May 10 20:31:56 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"During #NationalMilitaryAppreciationMonth, we pay tribute to America's service members, past and present, who answered the call to serve in Utah, across the country, and abroad. We are forever grateful for these heroes and their commitment to defending our nation. https://t.co/Jj025V2HGv","date":"Tue May 10 18:49:13 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Last year, fentanyl overdoses were the #1 cause of death for Americans ages 18-45. The Biden Administration's open border policies are failing to stop the flow of deadly drugs into our communities and fueling this devastating crisis.\n\n#NationalFentanylAwarenessDay https://t.co/JnXtiUz5PW","date":"Tue May 10 17:24:47 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Biden's Disinformation Governance Board is a political tool for so-called experts to referee free speech.\n\nI'm a proud co-sponsor of @RepMikeJohnson's bill to prevent hard-earned taxpayer dollars from funding the obstruction of our First Amendment rights. https://t.co/X8859HSRRR","date":"Tue May 10 15:47:30 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Too many downwinders are still suffering the tragic consequences of above-ground nuclear testing. With RECA set to expire in July, @RepTeresaLF and I sent a letter to Congressional leadership urging a vote to extend this crucial program for two more years. https://t.co/u28Z74qDjX","date":"Mon May 09 14:22:34 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Wishing all the Utah moms a happy and joy-filled Mother's Day! https://t.co/HhrOBj2rGD","date":"Sun May 08 15:04:28 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Teachers make it possible for our kids to receive the life-changing gift of education. Happy #TeacherAppreciationWeek to our exceptional educators! Thank you for going above and beyond to make a difference in the lives of America's students. https://t.co/S6vLkbNAkr","date":"Fri May 06 23:12:24 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Lake Powell Glen Canyon Dam plays a crucial role in delivering power to rural communities, and I'm grateful the @Interior Department is taking action to address historically low water levels. https://t.co/vnFDI66E57","date":"Thu May 05 21:11:45 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In western states like Utah, drought season has already begun, making wildfires more likely and impacting water projects tied to electricity production.","date":"Thu May 05 21:11:45 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In a win for America's veterans, U.S. Park Police escort services for Honor Flight trips will resume June 1. Our veterans deserve the red-carpet treatment as they visit Washington's historic monuments. Big thanks to @RepChipRoy for leading the charge! https://t.co/uv4yIvbouL","date":"Thu May 05 20:20:47 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utah's small businesses make a big impact on our state's economy. This week, we celebrate the entrepreneurial spirit of Main Street USA and the resiliency of our nation's small, local, and independently-owned businesses.\n\nRemember to #ShopSmall for #NationalSmallBusinessWeek! https://t.co/DmOn1AKidb","date":"Thu May 05 19:40:34 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In both good times and bad, prayer is powerful and effective. On this #NationalDayofPrayer, we come together and give thanks for our many blessings and the right to worship freely. https://t.co/Ye5GX5w5FT","date":"Thu May 05 18:49:17 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Every life - born and unborn - is precious and worth protecting. I applaud the Supreme Court for returning power to the people.","date":"Tue May 03 18:04:13 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Last night's egregious leak of the internal deliberations of our nation's highest court is deeply disturbing and must be investigated immediately. Any attempt to politicize this sacred institution is detrimental to the foundation of our independent judicial system.","date":"Tue May 03 18:04:13 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"During last night's telephone town hall, an overwhelming majority of #UT04 callers said they did not support ending Title 42.\n\nWithout this policy in place, DHS predicts up to 18,000 illegal crossings per day. The Biden Administration is undermining border security at every turn.","date":"Thu Apr 28 23:00:02 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"President Biden didn't inherit a crisis at our southern border. He created it by refusing to enforce U.S. immigration laws.\n \nI encouraged Secretary Mayorkas to reverse course and end this administration’s empathy-free open border policies. https://t.co/jZzy4sn9EB","date":"Thu Apr 28 19:35:45 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Joining @marthamaccallum in a few minutes! Tune in on @FoxNews. https://t.co/zrnmQiCIrO","date":"Thu Apr 28 19:11:27 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Thanks to everyone across #UT04 who joined tonight’s telephone town hall! From strengthening education to supporting Utah’s small businesses, it was a pleasure answering your questions and providing an update on my work in Washington. https://t.co/U4Kx9yqxwW","date":"Thu Apr 28 01:45:30 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Such a pleasure to welcome members of the Utah Industry Association to the U.S. Capitol this afternoon. From manufacturing to mining, thank you for all that you do to represent the major employers of our state! https://t.co/QFKNQhCUjq","date":"Wed Apr 27 20:43:43 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"There were over 221,000 migrant encounters at our southern border in March – a 542% increase from 2020.\n \nPresident Biden isn’t “effectively managing” anything, let alone the border crisis his own policies created. What a joke.","date":"Wed Apr 27 18:05:40 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"A new @NFIB study shows that 68% of small businesses plan to raise prices to offset the highest inflation rate since 1981.\n\nOnce again, Main Street U.S.A. and American consumers are stuck with the consequences of President Biden's reckless fiscal policies.\nhttps://t.co/Q5PPBbyWBg","date":"Wed Apr 27 16:04:54 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm deeply saddened by the passing of one of America's most dedicated public servants: Senator Orrin Hatch. He was a giant in the Senate, an invaluable voice for the conservative movement, and a champion for Utahns. I'm praying for his wife Elaine and the entire Hatch family.","date":"Sun Apr 24 02:46:39 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The recent push to undermine objectivity and impartiality in the credit rating process is out-of-touch and purely political. Utah's top officials are united in calling out this policy shift that will negatively impact the financial strength of our state and local governments.","date":"Fri Apr 22 18:14:23 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I led Utah's city, county, and federal leaders in a letter to Postmaster General DeJoy seeking solutions to improve the increased strain on postal services in Lehi, Eagle Mountain, and Saratoga Springs.\n\nPostal services are essential services. Read our full letter below. https://t.co/7e05HV6Fxf","date":"Wed Apr 20 20:00:21 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Saratoga Springs if you're having issues with the IRS, VA benefits, passports, or any federal agency. \n\nWe're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/MFTVPZj1CV","date":"Tue Apr 19 22:00:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Inflation is real, and it's a top issue for Utahns. \n\nWhile President Biden plays the blame game, hardworking families across the country are struggling to afford gas, food, and utility bills. https://t.co/tMG1kaP5g3","date":"Tue Apr 19 19:34:56 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Utah Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. \n\nWe're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/14gdKUC9hD","date":"Tue Apr 19 16:20:03 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"From our family to yours, Happy Easter! https://t.co/JvN8rKPfe0","date":"Sun Apr 17 17:26:10 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 74th Birthday, @USAFReserve!","date":"Fri Apr 15 01:31:37 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'd like to formally thank the Russian government for including me on their sanctions list. I'll wear it like a badge of honor! #StandWithUkraine https://t.co/5h88FQyv4J","date":"Wed Apr 13 22:12:39 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utah students learn best in the classroom, and I'm thankful for our state's exceptional educators who have kept them on track and well prepared for the opportunities of tomorrow.\n \nThanks for having me, @JuabSD! https://t.co/jGeeQz0LXR","date":"Tue Apr 12 22:30:49 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Juab Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency.\n\nWe're here to help you! For more information, visit https://t.co/REkdD5fvLa. https://t.co/pnYRzF7Q9g","date":"Tue Apr 12 22:00:02 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Sanpete Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. \n\nWe're here to help you! For more information, visit https://t.co/REkdD5fvLa. https://t.co/pNaipMzTZu","date":"Tue Apr 12 17:30:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Excellent morning in Nephi helping guest judge this year’s @UtahFFA student agriculture research projects. \n\nUtah farmers feed our communities and youth programs like Future Farmers of America play an essential role in growing the next generation of our state’s workforce. https://t.co/w7pVNFFJ1e","date":"Tue Apr 12 16:19:26 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"It was an honor to visit with Utah veterans and their families yesterday during our tour of Salt Lake's George E. Wahlen Department of Veterans Affairs Medical Center. \n \nWe are immensely grateful to every Utahn who has served and sacrificed for our freedoms. https://t.co/Z1FjA2Skpu","date":"Tue Apr 12 15:22:45 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"My West Jordan District Office has helped dozens of Utah veterans navigate the @DeptVetAffairs and secure access to high-quality and timely medical care, housing, employment, and educational opportunities.\n \nIf you need assistance, contact us at https://t.co/X9rOlNEhF6.","date":"Tue Apr 12 15:22:45 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm a proud co-sponsor of the Major Richard Star Act because it secures military care and benefits for Utah's 143,000+ veterans and ensures that no retired servicemember is denied the care they deserve. \n\nLearn more about the bill here: https://t.co/P5rWfyEbi5","date":"Tue Apr 12 14:27:27 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utah's small businesses are the cornerstone of our local economy.\n\nIt was great to join members of the @MillcreekBzCncl this afternoon to discuss doing business in the Beehive State, the impact of inflation and supply chain disruptions, and ensuring employee success. https://t.co/OVxplZlZFc","date":"Mon Apr 11 23:07:22 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Access to early childhood education will help determine the success of future generations, and my @HarvardJOL paper explores the conservative approach.\n\nWe have no time to waste—parents are waiting, children are growing, and our nation is falling behind. https://t.co/VrbGyL2qLR","date":"Mon Apr 11 22:10:49 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Back in #UT04 and grateful to be with @TalentUtah as they kick off Apprenticeship Connection Week.\n \nA highly skilled workforce drives Utah's economic growth, and apprenticeship programs play a vital role in building quality career and education opportunities for our students. https://t.co/GbyXdfFniU","date":"Mon Apr 11 17:23:55 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In 2021, the U.S. imported over $500 million in wood products from Russia &amp; Belarus.\n\nThe No Timber From Tyrants Act is a no-brainer to revive U.S. dominance, support Utah's federal lands, create high-paying jobs &amp; ensure tyrants like Putin stand alone. https://t.co/LF36PJ8XjM","date":"Fri Apr 08 19:05:34 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"President Biden's war on U.S. energy has caused pain at the pump &amp; increased our dependency on foreign adversaries.\n\nProud to support @RepBlakeMoore's Promoting Energy Independence &amp; Transparency Act to empower American workers &amp; unleash domestic energy. https://t.co/1K1NQO67YD","date":"Wed Apr 06 16:26:46 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"An estimated 19 million rural Americans lack access to high-speed internet services. \n\nProud to support the Broadband Permitting Modernization Act to bring broadband infrastructure into the 21st Century while deploying reliable connectivity to #UT04. \nhttps://t.co/lDLXaBM9kx","date":"Tue Apr 05 16:56:23 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On #GoldStarSpousesDay, and every day, we honor the surviving spouses of America's fallen service members and offer our immense gratitude for their many sacrifices. God bless our nation's military families and all who serve. https://t.co/gq6cXLHKDr","date":"Tue Apr 05 15:23:06 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Biden Administration's open border policies have fueled illegal immigration and enriched criminals like human traffickers and drug smugglers.\n\nEnding Title 42 will extend this crisis — not stop it.","date":"Tue Apr 05 14:23:54 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Last year, Utah's farmers, ranchers, and producers faced drought, higher costs, and fewer crop yields.\n\nProud to support the Open Access Evapotranspiration Act to improve the efficiency and accuracy of water consumption data in Utah and across the West.\nhttps://t.co/Ht5De1yFSa","date":"Mon Apr 04 18:24:27 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"May we never forget the immense courage and extraordinary sacrifices of the 2.7 million Americans who answered the call to serve in the Vietnam War.\n\nToday and every day, we honor these veterans and their selfless service to our nation. https://t.co/q029mL8sMk","date":"Tue Mar 29 16:05:34 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On National Medal Of Honor Day, we salute America's extraordinary servicemembers who went above and beyond the call of duty, earning our nation's highest military honor. We are forever grateful for these heroes and their many sacrifices. https://t.co/DZwasW7TUt","date":"Fri Mar 25 15:24:04 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Exceptional work by @UCSO, @DHSgov, and local law enforcement officers across our state.\n\nThese heinous crimes have no place in Utah. https://t.co/qg5hu0UueT","date":"Thu Mar 24 20:27:28 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Secretary Madeleine Albright was a true trailblazer who inspired untold millions around the world. My thoughts and prayers are with her family and loved ones. https://t.co/YmlwGzpSso","date":"Wed Mar 23 20:24:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I joined @RepKenBuck on a letter to @TheJusticeDept urging an immediate strategy to combat nationwide spikes in violent crime and retail theft.\n\nThese disturbing upticks in crime threaten the safety and security of hardworking Americans and their businesses. https://t.co/mtH5Hbm9C9","date":"Wed Mar 23 17:17:26 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"There is no greater responsibility than protecting our children.\n\nPredators charged with child pornography offenses need to be locked up, not gifted leniency.","date":"Mon Mar 21 23:01:30 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Every life is a precious gift, and every person has inherent human dignity. On #WorldDownSyndromeDay, we celebrate Americans with Down Syndrome and their countless contributions to communities in Utah and across the nation. https://t.co/chAqjvHRXv","date":"Mon Mar 21 22:55:11 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Keeping Justice Thomas in my prayers and wishing him a speedy recovery! https://t.co/bfgJyEJuLA","date":"Mon Mar 21 20:00:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"During #NationalAgWeek, we celebrate America's hardworking farmers, ranchers, and agricultural producers and recognize their efforts to feed our communities and fuel our economy. Don't forget to #ThankAFarmer this week! https://t.co/JjgVGiDlMz","date":"Mon Mar 21 18:29:13 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Thousands of freedom-loving Ukrainians have bravely answered the call to defend their sovereignty. I’m proud to join @RepSpartz, @RepDustyJohnson, and so many of my colleagues in the charge to award them with the Congressional Gold Medal.\nhttps://t.co/nem9sA97gt","date":"Mon Mar 21 18:00:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Devastating news. I'm keeping these families and the entire @USMC community in my prayers. The service and sacrifice of these Marines will never be forgotten. https://t.co/sDmL9uOhsP","date":"Mon Mar 21 17:14:31 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Life's goal is to live in a way that you’ll be missed. I’ve only known @RepDonYoung for a year, and I will miss him terribly. My heart and prayers are with his family and loved ones. Rest in peace and love, my friend.","date":"Sat Mar 19 02:03:23 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Over the past 34 years, Brigadier General Tyler B. Smith served the Utah Army National Guard with honor and courage. He's an extraordinary example of our state's one-of-a-kind spirit of service, and I'm wishing him all the best in his retirement. Congratulations, General! https://t.co/9ylrXbG4cL","date":"Wed Mar 16 20:26:25 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Enjoyed meeting with @UtahFarmBureau at the U.S. Capitol today! \n \nTheir tireless work drives the economic success of Utah and feeds communities across our state. https://t.co/lI7d96A0rX","date":"Wed Mar 16 19:44:19 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm inspired by President Zelenskyy's unshakable leadership and Ukraine's unrelenting courage in the face of pure evil.\n\nThe Ukrainian people are fighting for freedom and peace. America must get off the sidelines and deliver immediate military, humanitarian, and economic support. https://t.co/Fs4SyjdGpy","date":"Wed Mar 16 15:38:10 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in South Utah Valley if you're having issues with the IRS, VA benefits, passports, or any federal agency. \n\nWe're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/JkbjZMJvXI","date":"Tue Mar 15 17:00:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours tomorrow in Utah Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. \n\nWe're here to help you! For more information, visit https://t.co/REkdD5fvLa. https://t.co/YJWBcDlGGt","date":"Tue Mar 15 13:00:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"U.S. inflation has surged to 7.9%, marking the sharpest spike since 1982.\n\nThis job-killing, wallet-crushing tax is the direct result of President Biden's failed economic policies and Washington's reckless spending sprees. https://t.co/XCr2eiv9kF","date":"Thu Mar 10 15:08:19 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"It's ludicrous that President Biden would rather lift oil import sanctions on human rights-abusing dictators than increase U.S. energy production.\n\nI'm a proud supporter of the Prohibiting Oil Trade with Venezuela’s Tyrant Act.","date":"Thu Mar 10 00:18:19 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As a father of 5 girls and grandfather to 12 girls, I'm proud to support the Protection of Women and Girls in Sports Act to ensure America's female athletes have a level playing field and a fair chance at competition.\n\nhttps://t.co/i4bixg6VMA","date":"Wed Mar 09 22:38:46 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This appalling attack on innocent women and children makes me absolutely sick. There is evil in this world, and Vladimir Putin will pay for his barbaric actions. \n\nI’m praying for our brothers and sisters in Ukraine.","date":"Wed Mar 09 20:59:47 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We must send a clear message: Those who stand behind Vladimir Putin will stand alone.\n\nProud to support the DICTATOR Act, bipartisan legislation to investigate whether the CCP, PRC, and  affiliated entities are helping Russia's regime evade U.S. sanctions. https://t.co/6k1wAZ3SFd","date":"Wed Mar 09 15:47:05 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TOMORROW in Juab Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. \n\nWe're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/iGi2K4gIcU","date":"Tue Mar 08 21:00:02 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"President Biden's ban on Russian oil and gas imports is 𝐨𝐧𝐞 good step after his year-long war on American energy.\n\nInstead of expanding domestic production, he's shifting our reliance from one power-hungry authoritarian regime to another.\n\nWhy not support American energy?","date":"Tue Mar 08 19:42:53 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TOMORROW in Sanpete Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency.\n\nWe're here to help you! For more information, visit https://t.co/REkdD5fvLa. https://t.co/JZMwiTS6L5","date":"Tue Mar 08 14:30:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"When it comes to \"golden passport\" schemes, Russia is one of the world's worst offenders. \n\nHuman traffickers, international criminals, and corrupt oligarchs shouldn't have the privilege of visa-free U.S. travel and U.S. taxpayer dollars shouldn't help them evade accountability.","date":"Thu Mar 03 19:12:08 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to introduce the No Travel for Traffickers Act with @RepCohen, legislation to crack down on citizenship-by-investment by revoking a country's eligibility for the U.S. Visa Waiver Program if they participate in these corrupt, crime-ridden programs. https://t.co/9XGp5Ag8tS","date":"Thu Mar 03 19:12:07 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This week, I joined 40+ colleagues in a letter to @SecBlinken urging him not to increase fees on H-2A temporary agricultural worker visas.\n\nThis disastrous policy will only worsen inflation and labor shortages for Utah's farmers and producers. https://t.co/Moc6p7PqGj","date":"Wed Mar 02 14:55:47 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This is a good step to further isolate Russia and ensure Vladimir Putin stands alone. \n\nAmerica will not waiver in our support for Ukraine. \nhttps://t.co/EoagaEo92V","date":"Wed Mar 02 04:45:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Once again, President Biden’s agenda fails to meet the ongoing threats to the safety, security, and prosperity of Utahns in the Fourth District, Americans across the nation, and our allies around the world.\n\nMy full statement on tonight's #SOTU address: https://t.co/Nu07Xoc6l3","date":"Wed Mar 02 04:20:42 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This is devastating news. I'll be praying for Coach Anderson and his family during this difficult time.","date":"Tue Mar 01 21:46:17 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Inflation is the #1 economic concern for Utahns.\n\nFrom groceries and gas to housing and health, this historic hike in consumer costs is crippling families and small businesses across America. https://t.co/t3BxeZ1ZWy","date":"Tue Mar 01 20:16:46 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The U.S. purchases hundreds of thousands of barrels of Russian oil each month.\n\nPresident Biden must end his war on American energy independence and cut off Putin's funding.","date":"Tue Mar 01 18:30:05 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Powerful words from my friend, @RepSpartz.\n\nVladimir Putin is a power-hungry dictator, and his unprovoked attack on Ukraine is pure evil. The U.S. must take every action to cripple Russia's war on innocent civilians.","date":"Tue Mar 01 18:17:07 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utah stands with President Zelensky and the freedom-loving people of Ukraine.","date":"Mon Feb 28 23:04:25 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Putin’s unprovoked invasion of Ukraine undermines its territorial sovereignty and violates international law. America stands with Ukraine, our NATO allies, and freedom. I’m praying for every man, woman, and child across Ukraine tonight.","date":"Thu Feb 24 05:43:31 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to be on the ground in Israel this week with dozens of my @HouseGOP colleagues. We're meeting with leaders across the Holy Land to reaffirm America's unwavering commitment to Israel. https://t.co/YTrRIP9PAd","date":"Tue Feb 22 16:59:03 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy Presidents’ Day! https://t.co/htgqpwuHjs","date":"Mon Feb 21 15:21:45 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm deeply saddened by the passing of our friend and teammate, Congressman Jim Hagedorn. My thoughts and prayers are with his wife, Jennifer, and the entire Hagedorn family during this difficult time.","date":"Fri Feb 18 15:57:38 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"God bless the brave men and women of Utah's @HAFB as they deploy to Germany. Our nation supports you, and we're keeping you in our prayers. https://t.co/KkaNr2KojF","date":"Thu Feb 17 16:30:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Berlin's 'Candy Bomber' Col. Gail Halvorsen is a true American hero who gave hope to millions and exemplified the very best of Utah. My prayers are with the Halvorsen family today as we celebrate his lifelong legacy of service and compassion. https://t.co/DevmUPFosR","date":"Thu Feb 17 16:01:15 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":".@UtahWingCAP serves communities across the Beehive State, leading emergency response, search-and-rescue missions, civilian aviation, and more.\n\nWe're thankful for these brave Utahns and all they do to keep us safe! https://t.co/0m8J4GLWGX","date":"Wed Feb 16 21:59:12 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utah farmers and agriculture producers are the backbone of our local economy and work tirelessly to feed communities across the state. \n\nEnjoyed meeting with @UtahFarmBureau to discuss their legislative priorities, like labor reform, lowering taxes, and reducing regulations. https://t.co/0SZH91CkLj","date":"Tue Feb 15 22:27:44 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to support the EARN IT Act of 2022, bipartisan legislation to crack down on unsafe websites that promote and monetize online child sexual abuse material. \n\nCongress has an important responsibility to fight these horrific crimes against our children. https://t.co/nTZyDJ4Uhs","date":"Tue Feb 15 19:47:13 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The consumer price index (CPI) surged 7.5% over the past year, marking the biggest jump in 40 years. \n\nInflation is taxation, and it's costing American families $276 more per month nationwide. \n\nhttps://t.co/9THMcAHcA7","date":"Fri Feb 11 19:00:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Virtual &amp; distance learning has taken a devastating toll on our students' educational progress, social development &amp; emotional wellbeing.\n\nProud to support the Kids in Classes Act to ensure America's children have consistency in their in-person education.\nhttps://t.co/7xj72whcUX","date":"Fri Feb 11 17:00:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Education is the civil rights issue of our generation. \n\nRead my latest op-ed with @SenatorTimScott on the need to provide all children - regardless of their zip code - with a world-class, high-quality education. \nhttps://t.co/4oi1D6sAr1","date":"Fri Feb 11 15:36:33 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TOMORROW in Sanpete Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. We're here to help you!\n\nFor more information, visit https://t.co/REkdD5fvLa. https://t.co/ALvoruYy8Q","date":"Tue Feb 08 20:00:02 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Forced arbitration silences the voices of victims, protects abusers, and shields misconduct in the workplace. H.R. 4445 restores the rights of an employee to seek public accountability and serves as a victory in our efforts to ensure justice for survivors. https://t.co/xpEEfIyfDV","date":"Tue Feb 08 00:56:27 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The CCP’s United Front Work Department is among the worst violators of human rights and religious freedom. These bad actors need to be held accountable. https://t.co/SK5ujSJYoc","date":"Sat Feb 05 17:31:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"@RepTenney Happy birthday, my friend!","date":"Fri Feb 04 22:37:56 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As a cancer survivor of 18 years, I know how devastating and life-altering a diagnosis can be. \n\nOn #WorldCancerDay, my heart is with the fighters, survivors, and all families who have lost loved ones to this heartbreaking disease. I pray for the day we find a cure. https://t.co/0Wt24FBMKH","date":"Fri Feb 04 18:30:42 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The America CONCEDES Act helps China and hurts America. Instead of protecting U.S. interests, accelerating American innovation &amp; addressing generational threats to our national security, this $325,000,000,000 package appeases our biggest adversary.","date":"Fri Feb 04 16:55:26 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Most shocking is the failure to include any meaningful accountability measures in response to the CCP's long history of genocide, human rights abuses, and slave labor.\n\nMy full statement: https://t.co/TSCQwWH7E9","date":"Fri Feb 04 16:55:26 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The America CONCEDES Act puts China first &amp; America last.\n\nThis legislation fails to hold China accountable for its long history of genocide and human rights abuses, fails to counter generational threats towards our national security, and fails to protect American interests. https://t.co/93ZjuUigyg","date":"Thu Feb 03 00:01:57 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Great to see you, my friend! \n\nVice President @NNVP_Lizer is a remarkable leader for Navajo Nation &amp; I'm looking forward to working with him on these issues and more.","date":"Wed Feb 02 23:57:32 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"From a childhood in segregation to serving in Congress, I'm inspired by the tenacity of giants like Martin Luther King Jr., Booker T. Washington, Madam C.J. Walker, and so many others, who fought for America's founding ideals of liberty and equality.\n\nHappy #BlackHistoryMonth!","date":"Tue Feb 01 17:55:03 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"#BlackHistoryMonth is dedicated to the heroes who rose above slavery, segregation, and racism to champion life, liberty, and the pursuit of happiness for future generations. Because of their courage, Black Americans have made enormous strides to shape the soul of our country. https://t.co/R8zLGCdVL8","date":"Tue Feb 01 17:55:02 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On February 1, 1865, President Lincoln signed a resolution that later became the 13th Amendment, abolishing slavery in the U.S.\n\n#NationalFreedomDay marks a monumental turning point in American history &amp; reflects our country's ideals of freedom, liberty, and opportunity for all. https://t.co/DhrpkncVYI","date":"Tue Feb 01 15:36:02 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to support @RepKatCammack's Human Trafficking Awareness Training Act to ensure top-of-the-line training for law enforcement agencies across the nation as they fight to prevent this devastating form of modern-day slavery.  https://t.co/JGgxnD3BNg","date":"Mon Jan 31 23:02:03 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Speaker Pelosi's $325 billion America COMPETES Act FAILS to match the CCP’s aggression towards our nation's security and prosperity.\n\nThis is a waste of taxpayer money.","date":"Mon Jan 31 21:53:34 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm a proud co-sponsor of ACT for ALS, legislation that will save countless lives in Utah and across the nation by enhancing access to treatments, drugs, and therapies for Americans suffering from this devastating disease. \nhttps://t.co/Il7oZBc47G","date":"Mon Jan 31 16:59:46 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Today, we commemorate America's Downwinders, who suffered life-altering illnesses at the expense of the federal government's 50+ years of above-ground nuclear weapons testing.\n\nWe must work together to expand the Radiation Exposure Compensation Act and right these wrongs.","date":"Thu Jan 27 20:11:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We must never forget. \n\n#HolocaustRememberanceDay https://t.co/gbqxLIIssU","date":"Thu Jan 27 14:04:19 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"#SchoolChoice unlocks high-quality educational opportunities and helps children across the country reach their God-given potential.\n\nThrilled to join today's virtual conversation on expanding choice and raising the bar for education in America. https://t.co/nCqbXycmFx","date":"Wed Jan 26 17:52:00 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"UTAH FARMERS &amp; RANCHERS: If you faced disruptions and grazing losses due to last year's drought and wildfires, you may be eligible for assistance under the 2021 Livestock Forage Disaster Program.\n\nApply by Monday, January 31st.\n\nLearn more here:\nhttps://t.co/2Re7yewnnT","date":"Wed Jan 26 16:15:04 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Enjoyed visiting with @GovCox today! From education to economic recovery, it’s been a pleasure working with him to ensure that every Utahn has the opportunity to succeed. https://t.co/ufe6Srp4OO","date":"Wed Jan 26 00:35:43 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Great to join @RepJohnCurtis and Taiwan Vice President @ChingteLai for a productive conversation on strengthening America’s relationship with Taiwan, one of Utah’s strongest trading partners.","date":"Tue Jan 25 23:36:38 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Support for #SchoolChoice is at an all-time high because it gives parents a voice &amp; students a greater chance to achieve their dreams.\n\nWe must continue this progress so that every child in America receives the promise of a high-quality, world-class education. https://t.co/1AAuGM2SgJ","date":"Tue Jan 25 19:30:08 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"It’s never been more important to fight for the future of America’s children. School choice expands high-quality options that represent the diversity of each student while making sure that parents have a seat at the table.\n\nHappy National #SchoolChoiceWeek! https://t.co/yQS4kufoXL","date":"Mon Jan 24 17:06:46 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Earlier today, I joined @BoydMatheson on @kslnewsradio to reflect on President Biden's first year in office &amp; to share some of the priorities we'll be focused on for Utah's Fourth District in the year ahead. \n\nListen here!\n\nhttps://t.co/GqpRJQHM8m","date":"Thu Jan 20 23:44:11 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Not only has the President's weak rhetoric failed to deter Russian aggression toward Ukraine, but his lack of coherent foreign policy has emboldened it. Proud to stand with @RepublicanStudy - the U.S. can and should do more to hold Putin accountable. https://t.co/2HS335ktY9","date":"Thu Jan 20 21:28:08 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Over the past year, hardworking Americans have faced forty-year high inflation, skyrocketing prices, decreases in real wage growth, and a persistent labor shortage.\n\nClearly, this economic crisis isn't \"transitory.\" https://t.co/cRIjTYZNhl","date":"Wed Jan 19 21:00:17 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Supplemental Impact Aid Flexibility Act just passed the House.\n\nProud to support this bipartisan legislation to help federally-impacted school districts maintain a reliable source of funding as they address the academic, social, emotional, and safety needs of students. https://t.co/64CHxklFrk","date":"Wed Jan 19 00:31:59 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Martin Luther King, Jr. was an inspirational force for good and overcame enormous obstacles to secure the dreams of future generations. As we honor Dr. King's dream today, let's carry on his legacy of equality and strive to continue building a brighter future for all. https://t.co/zuos3oSCcE","date":"Mon Jan 17 14:36:23 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Whole-heartedly agree.","date":"Sun Jan 16 02:24:23 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm praying for the safe rescue of our neighbors in Colleyville, Texas tonight as law enforcement officials work to secure Congregation Beth Israel.","date":"Sat Jan 15 23:07:27 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"States have the constitutional authority to run their own elections. This legislation has nothing to do with protecting your vote &amp; it should never become law.\nhttps://t.co/QulVvTLOsB","date":"Fri Jan 14 21:06:05 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Our law enforcement officers put their lives at risk every day to keep us safe. The COPS on the Beat Grant Program Reauthorization will increase federal funding for police departments &amp; create opportunities to invest in public safety &amp; emergency response. https://t.co/wuwgJnB7fm","date":"Fri Jan 14 15:50:25 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"What does actual voter suppression look like? \n\nJim Crow laws like poll taxes, property tests, literacy tests, and violence and intimidation at the polls.\n\nDon't let Democrats fool you - America has come a long way since the 1960s.","date":"Thu Jan 13 16:42:17 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"What was once a bipartisan NASA bill now includes provisions that strip power from states, nullify voter ID &amp; give taxpayer dollars to political campaigns.\n\nDemocrats have officially lost their minds. https://t.co/Mw6xrb3NTt","date":"Thu Jan 13 16:25:20 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"With crime on the rise, our law enforcement officers play an invaluable role on the front lines of public safety. In recent months, Utah has faced a shortage of police officers, particularly in our rural communities, impacting response times and straining critical resources.","date":"Wed Jan 12 21:28:03 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm proud to help introduce the bipartisan COPS on the Beat Grant Program Reauthorization Act to deliver much-needed support to police departments in Utah and across the country as they recruit, hire, and train new officers. https://t.co/OKI05G9tgr","date":"Wed Jan 12 21:28:03 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Couldn't agree more, @RepKenBuck. It's past time for Congress to help states reclaim their right to enforce federal antitrust laws against Big Tech and their growing unchecked power.","date":"Wed Jan 12 17:51:41 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Inflation just hit a 40-year high, and consumer prices are surging at the fastest rate since 1990. \n\nThis Administration's out-of-touch agenda is crippling hardworking families, stifling small businesses, and dragging our country into an economic crisis.\nhttps://t.co/mgLCV36vcQ","date":"Wed Jan 12 16:13:19 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Human trafficking is modern-day slavery and a horrific humanitarian crisis impacting communities worldwide. Today, we reignite our efforts to put an end to this multi-billion dollar industry, ensure justice for survivors, and prosecute those responsible for these heinous crimes. https://t.co/Vn5Wxwn5ai","date":"Tue Jan 11 15:02:11 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On #LawEnforcementAppreciationDay and every day, we honor the service of our law enforcement officers and their families. In Utah and across the country, these brave men and women put their lives on the line to keep our communities safe. God bless and protect these heroes. https://t.co/A2kCwokWK6","date":"Sun Jan 09 17:20:28 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 126th birthday to the Beehive State! \n\nToday, we celebrate the most beautiful state in the nation and reflect on the generations of Utahns who helped shape our one-of-a-kind spirit of service and extraordinary growth. https://t.co/pfoi2av76B","date":"Tue Jan 04 21:10:34 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy New Year, Utah! Wishing you and your family a happy, safe, and prosperous 2022. https://t.co/nchSK9SbhK","date":"Sat Jan 01 15:50:32 +0000 2022","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As these devastating fires continue to spread, I’m thinking of our neighbors in Colorado and praying for the safety of all families, firefighters, and first responders in harm’s way.","date":"Fri Dec 31 04:37:40 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As we celebrate the birth of Jesus Christ and this season of hope, the Owens family is wishing every Utahn and their loved ones a happy, healthy, and joyous Christmas Day! https://t.co/kiEIMfr9ME","date":"Sat Dec 25 16:31:55 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"One year ago today, Morocco joined the Abraham Accords with Israel, marking a landmark achievement for regional peace. Utahns benefit tremendously from our close ties to both Morocco and Israel, and we look forward to continuing this tradition of peace.","date":"Wed Dec 22 20:51:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Due to inclement weather, this morning's mobile office has been canceled. For questions about casework, please contact our West Jordan district office or visit https://t.co/REkdD4XUTC. I encourage all Utahns to stay safe and up to date on local road conditions.","date":"Wed Dec 15 13:42:08 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TOMORROW in Utah Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. \n\nWe're here to help you! For more information, visit https://t.co/REkdD5fvLa. https://t.co/lkOaO8TlT3","date":"Tue Dec 14 14:00:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 385th birthday, @USNationalGuard!","date":"Mon Dec 13 16:14:41 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The RECA Amendments of 2021 expands assistance for Downwinders who endured the federal government's 50+ years of above-ground nuclear weapons testing.\n\nProud to lead this important legislation, which passed the House Judiciary Committee earlier today with bipartisan support. https://t.co/F5zLtnhY3k","date":"Wed Dec 08 21:26:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TODAY in Juab Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. We're here to help you!\n\nFor more information, visit https://t.co/REkdD5fvLa. https://t.co/u5uF9LsPSD","date":"Wed Dec 08 13:00:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TOMORROW in Sanpete Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. We're here to help you!\n\nFor more information, visit https://t.co/REkdD4XUTC. https://t.co/83OmWCW8lW","date":"Tue Dec 07 18:00:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"80 years ago today, 2,403 brave service members and innocent civilians lost their lives in the attack on Pearl Harbor. May we never forget the sacrifices of these extraordinary Americans and their service to our nation. https://t.co/MSJ3rr7d87","date":"Tue Dec 07 16:20:48 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Senator Bob Dole lived an extraordinary life of public service and left an unforgettable mark on our country. My prayers are with his wife Elizabeth and the entire Dole family during this difficult time.","date":"Sun Dec 05 19:41:41 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Yesterday, I joined @BoydMatheson on @kslnewsradio to talk about the Child Rescue Act, legislation to expand our toolbox in the fight to eradicate human trafficking and child exploitation once and for all.\n\nListen here! https://t.co/xyKZHhivvQ","date":"Fri Dec 03 18:09:03 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"@RepBlakeMoore Congratulations, my friend!","date":"Thu Dec 02 20:50:18 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As a father of 6 and grandfather to 16, I know from experience that students thrive when parents and educators work together. @HouseGOP's Parents Bill of Rights keeps moms and dads in the driver's seat and raises the bar for education in America. https://t.co/P8zzTamDb8","date":"Thu Dec 02 19:30:08 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On Dec. 1, 1955, Rosa Parks stood up by sitting down. Her single act of courage wasn't just about a seat on the bus but taking a stand against racial segregation and discrimination. Today, we honor her extraordinary legacy that forever changed the course of our nation. https://t.co/NFQg6JgdYh","date":"Wed Dec 01 22:44:59 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utah-based @GrovTech is helping farmers and ranchers feed communities in the Fourth District and around the globe through robotic vertical farming technology. I enjoyed learning more about this team and their work to fuel prosperity during yesterday's tour. https://t.co/qWpACZQJ0C","date":"Tue Nov 30 22:53:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Yesterday, I had the pleasure of visiting with the team behind @narcx1, a leader in biodegradable medication disposal solutions and an integral partner for hospitals, pharmacies, medical practices, and law enforcement agencies across Utah's Fourth District. https://t.co/2VE72eIjaf","date":"Tue Nov 30 21:41:04 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"From manufacturing to the restaurant industry and everything in between, Utah runs on small and local businesses. Supporting these pillars of our community has never been more important - remember to #ShopSmall for #SmallBusinessSaturday! https://t.co/lyFeaZ5r2i","date":"Sat Nov 27 15:21:12 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Last week, Team Utah took to the House floor to share what makes the Beehive State so special, and each of us agreed - we have so much to be thankful for. It's the blessing of a lifetime to call the Fourth District my home, and I'm wishing every Utahn a happy and restful holiday. https://t.co/KM2u8UxmSt","date":"Thu Nov 25 15:27:13 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In Utah, innovation and service go hand in hand. Great to meet with @CaoGroup in West Jordan, a device manufacturing company that recently launched several initiatives aimed at helping Utah's dental professionals continue practicing safely after COVID-19 disruptions. https://t.co/wH0HkRkCxS","date":"Tue Nov 23 00:58:12 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Afternoon stop at @TaffyTown, a fourth-generation family-owned and operated small business in West Jordan. With current challenges like supply chain gridlock and labor shortages, it's never been more important to support Utah's small business community. https://t.co/M6TVEoEf0H","date":"Tue Nov 23 00:15:28 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Back in Utah and grateful for the opportunity to speak with @MountainAmerica, a major employer for the Fourth District and an instrumental financial partner for families across our state. https://t.co/dElW882ths","date":"Mon Nov 22 21:14:03 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Praying for the Waukesha, Wisconsin community tonight.","date":"Mon Nov 22 02:09:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Generations of Utahns will bear the brunt of this $5 trillion far-left kitchen sink package and the Democrats' fiscally negligent spending. https://t.co/deqiZd2l8T","date":"Fri Nov 19 14:41:06 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Yesterday, I co-sponsored @RepSteel and @RepSusieLee's Telehealth Expansion Act to keep vital health services permanent, accessible, and affordable for Utahns in the Fourth District and Americans across the country.","date":"Wed Nov 17 21:43:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On behalf of moms and dads in Utah and across the country, I'm proud to join @GOPLeader, @VirginiaFoxx, @RepJuliaLetlow, and @RepJimBanks to introduce a Parents Bill of Rights. It's never been more important to keep America's parents in the driver's seat.\n\nhttps://t.co/JL4ujmdAfo https://t.co/BEKkf4bddT","date":"Wed Nov 17 20:33:33 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Many thanks to @RepDonaldsPress for leading this resolution to honor the law enforcement officers in Utah and across the country who lost their lives to COVID-19. God bless these heroes and their families.","date":"Tue Nov 16 21:28:02 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Incredibly proud to stand in solidarity with @RepMariaSalazar and my colleagues as the Cuban people bravely fight against tyranny and oppression. The time for freedom and democracy is now. #SOSCuba https://t.co/rDJDdpiq1C","date":"Tue Nov 16 16:07:25 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TOMORROW in Utah Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. \n\nWe're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/HxZVAMoTdD","date":"Tue Nov 16 15:00:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I joined @BoydMatheson on @kslnewsradio earlier today to talk about a hero of mine, my dad, Clarence Owens, who served in an all-black, segregated unit during WWII.\n\nGod bless every Utahn and American who has served our great country 🇺🇸 🇺🇸🇺🇸\nhttps://t.co/zA8k8wEkE2","date":"Mon Nov 15 23:10:54 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Last week, I toured @patternhq, one of the largest employers in Lehi and a global leader in e-commerce.\n\nAmerica’s entrepreneurial spirit runs strong in Utah, and I'm proud to represent such diverse businesses that make such a positive impact in our state and around the globe. https://t.co/7GnmePM27c","date":"Mon Nov 15 18:59:13 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"With over 260 registered apprenticeship programs spanning dozens of vital industries, Utah's on-the-job training is second to none, providing students with additional pathways to success and helping workers across our state to thrive in their careers.\n\n#NationalApprenticeshipWeek https://t.co/b0YAW70XBZ","date":"Mon Nov 15 17:43:50 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On #VeteransDay and every day, we salute America's men and women in uniform who have served in Utah, across the country, and abroad. These heroes exhibit bravery above and beyond the call of duty, and we're forever grateful for their service. https://t.co/3UxppbeS86","date":"Thu Nov 11 14:22:35 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As a father of six and grandfather to 16, I am heartsick by the prevalence of child abuse and exploitation in America.\n\nThe Child RESCUE Act will expand our toolbox to protect children, prosecute offenders, and put an end to these heinous crimes. https://t.co/eF9n8mVOtJ","date":"Wed Nov 10 17:05:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 246th Birthday, @USMC!","date":"Wed Nov 10 15:21:52 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Welcome home to @UTNationalGuard's 141st Military Intelligence Battalion! 🇺🇸","date":"Wed Nov 10 14:50:15 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TODAY in Juab Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. We're here to help you!\n\nFor more information, visit https://t.co/REkdD5fvLa. https://t.co/Du36dFM3ef","date":"Wed Nov 10 13:00:02 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This commonsense legislation will increase data transparency, expand consumer privacy, and shed light on mechanisms used to power Big Tech platforms.","date":"Tue Nov 09 16:01:42 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TOMORROW in Sanpete Co. if you're having issues with the IRS, VA benefits, passports, or any federal agency. We're here to help you!\n\nFor more information, visit https://t.co/REkdD5fvLa. https://t.co/SPBbLAc6d2","date":"Tue Nov 09 15:00:02 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"It's unfortunate that passing a bill to tackle infrastructure also unlocks a multi-trillion-dollar tax-and-spending spree that will place a staggering debt on the next generation of Americans, increase inflation, and leave our economy worse off. https://t.co/FE9m9IKmjT","date":"Sat Nov 06 04:00:45 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":".@CondoleezzaRice is an unstoppable force for good, and I’m inspired by the barriers she’s broken throughout her many years in public service. So proud to meet her on Capitol Hill today. https://t.co/g9kJ3YJnVA","date":"Wed Nov 03 20:44:44 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"There's an urgent need to raise the bar for education in America, and we can't do that by pushing parents out of the driver's seat and ignoring the academic needs of students.\n\nWATCH the full conversation: https://t.co/MuT6lNsqHi","date":"Wed Nov 03 17:20:31 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Many thanks to @GOPLeader for hosting today's roundtable discussion on education and parental choice.\n\nI've heard it firsthand - Utah moms and dads don’t want important decisions regarding their child's education, development, and wellbeing in the hands of D.C. bureaucrats. https://t.co/lMXp1i0kNR","date":"Wed Nov 03 17:20:31 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to join this commonsense charge to address the NCAA's unchecked and unfair infractions process. Our bill will level the playing field by eliminating bias, enhancing transparency, and increasing due process protections for student-athletes, coaches, and universities.","date":"Tue Nov 02 17:39:26 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On #NationalFirstRespondersDay, we honor America's police officers, paramedics, EMTs, firefighters, and all who are first on the scene when emergency strikes. Thank you for answering the call to serve and going above and beyond in your commitment to safety. https://t.co/8Vp1hFMgQJ","date":"Thu Oct 28 19:08:10 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"@RepDonaldsPress Happy birthday, @RepDonaldsPress!","date":"Thu Oct 28 18:40:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Brent Jex is an invaluable pillar of Utah's law enforcement community, serving @Utah_FOP, Utah’s Joint Criminal Apprehension Team, and @WJ_Police for over two decades. He embodies the service-oriented spirit of our state, and I'm thankful for all he does to keep Utahns safe. https://t.co/YLUYe1ZsHz","date":"Thu Oct 28 16:06:22 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Beehive State is moving forward and soaring to new heights thanks to strong community leaders who love our state. Honored to welcome chambers of commerce from across Utah to Washington today &amp; grateful to @RepTomEmmer, @ByronDonalds, @RepNewhouse &amp; @RodneyDavis for joining! https://t.co/pUYql4HBCa","date":"Wed Oct 27 21:25:28 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Sending my prayers to Coach Tuckett's family and the entire @BYU community.","date":"Tue Oct 26 18:38:12 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Just in time for winter, the proposed \"Heat your Home\" tax is projected to increase heating bills by up to $242 next year.\n\nOnce again, Utah families will bear the brunt of Democrats' out-of-control spending and misguided priorities. https://t.co/DKUqQlqWoE","date":"Tue Oct 26 18:29:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On this National Day of the Deployed, we honor America's deployed troops and their families who have so courageously answered the call to serve in Utah, across the country, and abroad. We are forever grateful for your service and commitment to our nation. 🇺🇸 https://t.co/DpXcxHYw58","date":"Tue Oct 26 15:11:10 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to vote YES on @RepLisaMcClain's bill to award the Congressional Gold Medal to the 13 American service members killed in Kabul, Afghanistan, on August 26th, including Utah's very own Staff Sgt. Taylor Hoover.\n\nWe will never forget the service and sacrifice of these heroes.","date":"Mon Oct 25 23:07:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Harriet Tubman escaped the horrors of slavery &amp; overcame unspeakable odds to secure the dreams of future generations. \n\nAs the great-great-grandson of a slave, Harriet is an inspiration to me &amp; I'm proud to join this effort to honor her enormous legacy.\nhttps://t.co/K9OVEYeu5T","date":"Fri Oct 22 15:31:04 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This racial harassment and appalling discrimination is heartbreaking and clearly violates equal protection under the law.\n\nWe can and must do better to protect our children from the ugliness of hate.\nhttps://t.co/xAtcCz2wKn","date":"Fri Oct 22 14:53:36 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Instead of advancing policies that prolong unemployment, weaken competitiveness, and drive up costs for American families, Congress should focus on fixing our country's rapidly eroding supply chain.\n\nThanks to @RepSamGraves and @RepWesterman for leading this commonsense charge. https://t.co/28VcS99ScH","date":"Thu Oct 21 15:52:41 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"When it comes to antitrust regulations, China shouldn't get an unfair advantage. Proud to support this commonsense bill that requires the FTC &amp; DOJ Antitrust Division to monitor financial support or subsidies provided by foreign governments in the premerger notification process.","date":"Wed Oct 20 22:16:35 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"With over 1.2 MILLION illegal immigrants apprehended since February, it's clear we're facing an out-of-control crisis at our southern border that's fueling unprecedented illegal immigration, human trafficking, and drug smuggling.\n\nTime to support @CBP &amp; secure the border. https://t.co/VihVKbZkbZ","date":"Wed Oct 20 22:06:17 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TOMORROW in Lehi if you're having issues with Social Security, Medicare, or any federal agency. We're here to help you! \n\nFor more information, visit https://t.co/REkdD5fvLa. https://t.co/JW7dVZCdVM","date":"Tue Oct 19 13:00:02 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As former Chairman of the Joint Chiefs &amp; America's first Black Secretary of State, Gen. Colin Powell was an extraordinary public servant &amp; steadfast leader for our country. I'm sending my deepest condolences to his wife Alma &amp; the entire Powell family during this difficult time.","date":"Mon Oct 18 13:22:31 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 246th Birthday, @USNavy!","date":"Wed Oct 13 15:48:44 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Included in the upcoming reconciliation bill is a provision mandating banks to report transactions over $600 to the IRS. Proud to co-sponsor @RepAshleyHinson's bill to protect Americans’ financial privacy against this harmful big government surveillance.\nhttps://t.co/OOQEz4CO9R","date":"Wed Oct 13 14:34:21 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TODAY in Juab if you're having issues with Social Security, Medicare, or any federal agency. We're here to help you!\n\nFor more information, visit https://t.co/REkdD5fvLa. https://t.co/7FJo7E4tAa","date":"Wed Oct 13 12:00:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Today, we celebrate the backbone of our country and the hardworking farmers who fuel prosperity across Utah. #ThankAFarmer","date":"Tue Oct 12 22:25:47 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TOMORROW in Sanpete if you're having issues with Social Security, Medicare, or any federal agency. We're here to help you!\n\nFor more information, visit https://t.co/REkdD5fvLa. https://t.co/DegACCCYMG","date":"Tue Oct 12 15:00:02 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This unilateral decision fails to end the political back-and-forth of Utah’s monuments, instead perpetuating a cycle of abuse under the Antiquities Act and denying our state a say in the care and management of our lands. \nhttps://t.co/VMGaJxq6MC","date":"Fri Oct 08 23:05:27 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Parents are irreplaceable advocates for their children, and recent attempts to stifle their genuine concerns are unproductive and harmful to students. Proud to join @RepLisaMcClain’s efforts to defend the rights of parents in Utah and across the country.","date":"Thu Oct 07 21:26:38 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":".@RepJohnCurtis and I are proud to welcome Rep. @RodneyDavis to Utah County today to discuss actions we can take to remove federal impediments in local elections, bolster voter trust, and protect the right to vote. https://t.co/tIqsniPMqL","date":"Wed Oct 06 18:15:53 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The bipartisan RECA Amendments Act of 2021 will reauthorize critical support for the many Utahns who are still suffering the tragic consequences of nuclear testing.\n\nRead my latest op-ed with @RepChrisStewart in @DeseretNews ⬇️\n\nhttps://t.co/WWCrGruoWi","date":"Tue Oct 05 15:14:20 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Terry Technical Correction Act is a commonsense solution clarifying the potential sentencing reductions to low-level crack offenses in the First Step Act. Proud to co-sponsor this bipartisan legislation. https://t.co/pL5n1n5V5l","date":"Fri Oct 01 22:03:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"With inflation on the rise and the most expensive piece of legislation in the history of our country on deck, I spoke on the House floor about what I've been hearing in Utah's Fourth District - Americans can't afford this crisis. https://t.co/pQVBOuA1Mp","date":"Thu Sep 30 16:16:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Such a pleasure to welcome Utahns from @SVUTChamber, @ChamberWestUT, @stgeorgechamber, and @DavisChamberUT to Washington today.\n\nMany thanks to @SteveScalise, @RepRichHudson, @VirginiaFoxx, and @ByronDonalds for stopping by to share their passion for service. https://t.co/f7RPTGh2GQ","date":"Wed Sep 29 19:53:33 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Last year, students fell on average five months behind in math and four months behind in reading.\n\nWe must lean on scientific facts, not political fiction, to protect children’s access to the classroom for full-time, in-person learning.\n\n@EdLaborGOP\n\nhttps://t.co/1KlVU2Ungy","date":"Wed Sep 29 16:06:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The bipartisan EQUAL Act ends the sentencing disparity between crack and powder cocaine at the federal level that has disproportionately affected communities across the country for far too long. Proud to vote YES on this important legislation.","date":"Tue Sep 28 18:52:02 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Just voted NO on the Abortion on Demand Until Birth Act, which would abolish laws preventing late-term abortions and remove nearly all pro-life protections for the unborn. The life of every child - born and unborn - is valuable and worth protecting.","date":"Fri Sep 24 15:33:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Americans are still suffering the consequences of our country's foray into nuclear testing.\n\nThe RECA Amendments Act of 2021 will provide much-needed support for \"Downwinders\" in Utah and across the west.\nhttps://t.co/L4XYxkm2ri","date":"Fri Sep 24 14:25:09 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This is devastating news. Please keep Staff Sgt. Olmstead's family in your prayers. https://t.co/Inyz7NvqHw","date":"Thu Sep 23 23:46:12 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to vote YES on H.R. 5323 in full support of Israel's Iron Dome missile defense system that continues to save countless innocent lives. This should not be a partisan issue. #StandWithIsrael","date":"Thu Sep 23 19:28:07 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Radiation exposure caused by the U.S. atomic weapon development program forever destroyed lives and livelihoods in Utah.\n\nProud to introduce the Radiation Exposure Compensation Act Amendments of 2021 to renew our support and right these wrongs. https://t.co/oEOSNYteej","date":"Wed Sep 22 20:08:25 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Once again, Utah is bearing the brunt of the Biden Administration’s misguided policies. Bureaucrats shouldn’t be managing western lands from Washington, D.C.","date":"Tue Sep 21 21:44:32 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Just voted YES on S. 189 to guarantee an annual cost-of-living and disability adjustment for America’s veterans. As inflation soars and prices skyrocket, this bill will deliver much-deserved support and stability to our service men and women.","date":"Mon Sep 20 23:44:28 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Human trafficking is modern-day slavery – plain and simple.\n\nOn top of reauthorizing vital funds to combat human trafficking, H.R. 5150 expands our toolbox for enforcing the law, supporting victims &amp; prosecuting the perpetrators of these heinous crimes. https://t.co/83py7gWaQJ","date":"Mon Sep 20 19:47:58 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 74th Birthday, @usairforce! 🇺🇸","date":"Sat Sep 18 15:25:33 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On National #POWMIA Recognition Day, we honor the American service members who were held as prisoners of war or remain missing in action. The service and sacrifice of these heroes will never be forgotten. https://t.co/uKYger86M8","date":"Fri Sep 17 18:59:10 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On September 17, 1787, our Founding Fathers signed a world-changing document that formed a government of the people, by the people, and for the people. Happy Constitution Day! https://t.co/lqZ2IlmPtH","date":"Fri Sep 17 16:23:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Enjoyed catching up with leaders from all across Utah at last night's @uac29 Fall Conference. Many thanks for having me and for your great service to our state. https://t.co/0NzmfQwWfL","date":"Thu Sep 16 21:52:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Last week, I had the pleasure of touring the @USU_water_lab and seeing firsthand the leadership and innovation behind the Beehive State’s premier water and environmental research facility. Thank you to Director David Tarboton and his team for having us! https://t.co/4lr27cE1lU","date":"Thu Sep 16 19:29:05 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Spent yesterday with the fine men and women of our @UTNationalGuard, learning more about their advanced capabilities and extraordinary expertise in Utah, across the country, and abroad. Thank you for your hard work and service 🇺🇸 https://t.co/Bcktz69onV","date":"Thu Sep 16 14:20:51 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"From manufacturing to the restaurant industry &amp;  everything in between, Utah runs on small businesses. Proud to join @RepBlaine's charge to commemorate small, local, and independently owned businesses in every corner of the country.\n\n#SmallBusinessWeek \n\nhttps://t.co/zf1EIRw6oy https://t.co/3YKK5Y5zp2","date":"Wed Sep 15 19:30:29 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Beautiful day in Salt Lake County for a tour of Millcreek's new city center and Neff's Canyon. Many thanks to Mayor Silvestrini and Assistant City Manager Mike Winder for taking the time to share their unique solutions to housing, transportation, and forest management. https://t.co/ObXukhHefq","date":"Tue Sep 14 19:01:40 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We will never forget the heinous terrorist attacks on #September11 that changed our country forever. Two decades later, we commemorate the lives lost, our heroic first responders, and the brave Americans who have fought to keep us safe. https://t.co/t6Qhl8krqV","date":"Sat Sep 11 14:09:34 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"While inflation soars and American families pay more for just about everything, the Democrats are rushing through the \"biggest tax and spending increase in half a century.\"\n\nMakes sense.\nhttps://t.co/vGTtzxMGYP","date":"Fri Sep 10 15:56:14 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm a proud co-sponsor of the Curriculum Review of Teachings Transparency Act, led by @RepFitzgerald and Dr. @virginiafoxx. Parents should never be in the dark when it comes to what their child is learning in the classroom. https://t.co/kHzq5mjRKF","date":"Thu Sep 09 17:09:24 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Just wrapped a great Telephone Town Hall with @HASCRepublicans Ranking Member @RepMikeRogersAL. So many great questions on the ongoing situation in Afghanistan, what we know about those left behind, and how this shapes the trajectory of American national security. https://t.co/D6OpIPjWIs","date":"Thu Sep 09 01:19:38 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"During this season of drought, Central Utah Water Conservancy has played a crucial role in delivering millions of gallons of clean, usable water across Utah. Many thanks for today's tour and the important work you all do to power the Fourth District and beyond. https://t.co/4LMLk1LVAH","date":"Wed Sep 08 20:08:04 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Wishing all Utahns a Happy Labor Day!","date":"Mon Sep 06 15:33:53 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Great question.","date":"Fri Sep 03 16:37:27 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"With skyrocketing inflation &amp; out-of-control spending in Washington, Americans across the country &amp; Utahns in the Fourth District want to see fiscal responsibility restored at the federal level.\n\nProud to join my colleagues in this effort.\nhttps://t.co/MtcMF9D3fW","date":"Wed Sep 01 22:34:30 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We will never forget the 13 Americans, including Utah’s own Staff Sgt. Taylor Hoover, who made the ultimate sacrifice to protect the lives of others. Proud to co-sponsor @RepLisaMcClain's bill to honor the legacy and service of these heroic service members.https://t.co/DeOYXdCshT","date":"Tue Aug 31 20:10:50 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This is what overreach looks like. The Biden Administration is using taxpayer dollars to try and strip Utah parents of their right to decide if their children will wear masks. ⬇️ https://t.co/IfRiE0E0Fp","date":"Tue Aug 31 16:48:36 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I’m sending my prayers across Utah as our state mourns the loss of Staff Sgt. Taylor Hoover, a hero who leaves behind a lifelong legacy of service and courage. I’m thinking of his family during this time.\nhttps://t.co/ajBE7k5oMt","date":"Fri Aug 27 22:44:37 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This is heartbreaking. My prayers are with the Soviak family as they navigate the difficult days ahead. \n\nGod bless our troops and their loved ones.","date":"Fri Aug 27 18:41:19 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"There are no words to describe what an utterly devastating day this is for our country. I am heartsick for the families of our fallen heroes and continue to pray for them and for our troops, Americans, and allies who remain in harm’s way.","date":"Thu Aug 26 18:49:22 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Please join me in praying for the safety of our service members, American citizens, and the Afghan people on the ground in Kabul today. \n\nTeam Owens stands ready to help however we can. Call us at (801) 999-9801 or (202) 225-3011. \nhttps://t.co/RpRhyFv1MH","date":"Thu Aug 26 16:18:29 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utahns see right through this and deserve more transparency from the elected leaders recklessly blowing through their taxpayer dollars.","date":"Tue Aug 24 21:14:39 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"While Americans reel from soaring inflation and an abdication of leadership in Afghanistan, Speaker Pelosi shielded her members from an unpopular vote by using a procedural gimmick to ram through Biden's $3,500,000,000,000 hyper-partisan budget without debate.","date":"Tue Aug 24 21:14:39 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Biden Administration is reducing its footprint in Afghanistan with an unconfirmed number of Americans on the ground. Unbelievable.","date":"Tue Aug 24 19:29:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to stand with my @HouseGOP colleagues in support of our veterans and the U.S. citizens and Afghan partners stranded behind enemy lines. The President must stop deferring to the Taliban's terms and make it clear that no American will be left behind.","date":"Tue Aug 24 16:47:10 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Read my full statement with @EdLaborGOP Republican Leader @virginiafoxx. \n\nhttps://t.co/g23ZzkB16T","date":"Sat Aug 21 15:57:36 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In an egregious overstep of federal power, this administration is using threats and COVID-19 resources to infringe on states’ authorities to protect students and ensure access to education.\n\n@virginiafoxx","date":"Sat Aug 21 15:36:30 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Exactly.","date":"Thu Aug 19 19:17:20 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Next stop: @HexcelCorp’s 110-acre Salt Lake City manufacturing site, the leading supplier of carbon fiber, honeycomb, and other advanced composite materials for the commercial aerospace industry.\n\n@uammi_utah https://t.co/2KBffLRjpT","date":"Tue Aug 17 22:47:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Just wrapped a fascinating tour of @RockWestComp in West Jordan with @UAMMI_Utah. Founded in 2007, this impressive team leads in composite and carbon fiber technologies that benefit industries from aerospace and defense to sporting goods. https://t.co/dklM5OSW1f","date":"Tue Aug 17 19:29:47 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Thanks to @uammi_utah for bringing together advanced manufacturing leaders from across the state for today’s roundtable. We discussed workforce challenges, supply chain issues &amp; strengthening vocational education to help these dynamic organizations continue long-term growth. https://t.co/sZYiSb7usx","date":"Tue Aug 17 17:14:42 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As this humanitarian and national security crisis continues to unfold, the freshman class is urging @POTUS to prioritize the immediate evacuation of American citizens and the many Afghan allies who served alongside U.S. troops. https://t.co/rJsPKa94s3","date":"Tue Aug 17 16:39:27 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Three months ago, I supported bringing U.S. troops home, contingent on a clear plan that tackled increased terrorist activity while protecting national interests and personnel on the ground.","date":"Mon Aug 16 21:17:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Instead of taking responsibility for this catastrophic failure of strategy and leadership, President Biden doubled down on his administration's indefensible decisions while abandoning our Afghan allies and endangering national security.","date":"Mon Aug 16 21:17:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The takeover of Afghanistan is nothing short of horrifying, and my heart breaks for the innocent women, children, and families facing the sheer terror of reality under the Taliban.","date":"Mon Aug 16 21:17:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As our firefighters work around the clock to contain the #ParleysCanyonFire, I urge all Utahns in the surrounding areas to exercise caution and follow local guidance and evacuations. \n\nFind more information at @UtahWildfire.","date":"Mon Aug 16 17:13:54 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We have a responsibility to every single Downwinder and victim of radiation exposure—and their families—to reauthorize the Radiation Exposure Compensation Act. It was a pleasure to meet with stakeholders today in the 4th District as we look to develop fair &amp; responsive solutions. https://t.co/VjVksHgouB","date":"Fri Aug 13 19:51:07 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As a powerhouse economy and the fastest-growing state in the nation, Utah is innovating to improve long-term transportation solutions. Great to meet with @RideUTA yesterday for an update on the FrontRunner project and to tour the MidValley Route, SLCC Hub, and Murray Station. https://t.co/omBxbLbDEM","date":"Fri Aug 13 15:33:23 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to welcome 124 new American citizens from over 38 countries this morning at the Utah State Capitol in an extraordinary celebration of the American dream. Congratulations to our newest citizens! 🇺🇸 https://t.co/XGdMJQpnsk","date":"Thu Aug 12 17:59:34 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to join @RepAnnWagner's letter to the Attorney General calling for an investigation into the content sold by OnlyFans. We have a responsibility to protect young Americans from platforms that promote sexual exploitation and unsafe online environments.","date":"Wed Aug 11 17:04:35 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"What a devastating loss for our community. I’m praying for the safety of our firefighters, first responders, and all Utahns impacted by this fire.","date":"Sat Aug 07 14:41:09 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Ending my day with the Herriman Mustangs and the Riverton Silverwolves. I remember the days of tough practices in the grueling summer heat and the drive it took to run that field day after day. Proud of these Utah teams and looking forward to Friday night football! https://t.co/JXAHrCQyZc","date":"Fri Aug 06 01:23:58 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Communities across Utah are demonstrating incredible growth and resiliency thanks to impactful local leaders who love our state. Enjoyed catching up with Mayors Troy Walker, David Coombs, Cliff Wheeler, and Brad Frost this week as I make my way across the Fourth District. https://t.co/ru9Ggti3ND","date":"Thu Aug 05 23:14:44 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"When that sweet tooth hits and Nebo Queen is just down the street. https://t.co/amGTtgPcXW","date":"Thu Aug 05 20:26:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Beautiful afternoon in Southern Utah County for a tour of the Payson Fruit Growers co-op. The Rowley family walked me through the current labor shortage, extreme drought conditions, and how their industry has powered through the year. They even let me drive the cherry picker! https://t.co/68QYAVwePq","date":"Wed Aug 04 23:22:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Next stop: Visiting with the father-son duo behind Springville Meat Company, a local, family-owned, and operated small business that's called Utah home for over 60 years. https://t.co/d3ueplaz5E","date":"Wed Aug 04 22:03:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Small businesses are the heart and soul of Utah’s Fourth District, and supporting them through this season of recovery is more important than ever.\n\nMany thanks to Santaquin’s very own Red Barn and Santa Queen for the warm hospitality. https://t.co/h998luIF8Z","date":"Wed Aug 04 16:21:44 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 231st Birthday, @USCG!","date":"Wed Aug 04 14:16:26 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Last night, my team hosted an FSA Information Session for farmers, ranchers, and producers in Utah and Juab Counties.\n\n100% of our state is experiencing extreme drought, and one of my top priorities is to ensure that every Utahn affected has access to timely relief. https://t.co/hUa8Psi2DE","date":"Wed Aug 04 14:12:09 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Opportunity zones are an invaluable economic development tool proven to boost investment and job creation in distressed communities. This is a solid effort to spread opportunity in Utah and every corner of the country.","date":"Fri Jul 30 17:49:14 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to see the #VIPAct unanimously pass the House! This legislation means America's real MVPs are one step closer to free lifetime access to our country's iconic national parks and public lands. https://t.co/ax1WwVvyCd","date":"Thu Jul 29 22:36:30 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This season of drought is affecting all Utahns, including a Juab farmer who runs a third-generation family farm in the 4th District. He's yielded zero output and faced increased costs because of this year's severe conditions. Unfortunately, his story is not unique. https://t.co/CL3RlePJ8q","date":"Thu Jul 29 15:48:17 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Col. Gail S. Halvorsen is a Utah veteran and an American hero. He embodies our state's spirit of service, faith, and community, and I'm proud to join this united effort to honor him and his family in a way that will continue his extraordinary legacy.\nhttps://t.co/KwskG9yHq6","date":"Thu Jul 29 14:39:26 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"100% of Utah is experiencing extreme drought. Livelihoods and generational family farms are at stake, and I call on the Administration to step up the efforts of their Interagency Working Group tasked with addressing these severe conditions. https://t.co/y37ZCFVC3L","date":"Wed Jul 28 20:18:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"CRT teaches students that America is irredeemably racist and intrinsic characteristics like race define you. The Say No to Indoctrination Act prevents your taxpayer dollars from funding these discriminatory practices that preserve divisive worldviews.\nhttps://t.co/Oo0Ka99CCw","date":"Tue Jul 27 15:01:39 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Joined @virginiafoxx and @RepGregMurphy to request information and increased transparency to ensure taxpayer dollars are efficiently funding @usedgov's priorities.","date":"Mon Jul 26 17:13:38 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"174 years after our state's pioneers settled in the Salt Lake Valley, Utahns still proudly embody the values that unite us all - faith, courage, sacrifice, and perseverance. Wishing all Utahns a safe and happy #PioneerDay this weekend!","date":"Fri Jul 23 18:47:39 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to stand in solidarity with @RepMariaSalazar and the Cuban people as they bravely fight against tyranny and oppression. The time for freedom and democracy is now. #SOSCuba https://t.co/4Vp0rxNyUN","date":"Thu Jul 22 21:18:24 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As the U.S. withdraws from Afghanistan, our Afghan partners and their families are getting left behind. Proud to vote yes on the ALLIES Act, which expedites visa applications and secures protection for those who risked their lives alongside our troops.","date":"Thu Jul 22 19:29:19 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This year's wildfire season is threatening the safety of Utah's communities, first responders, and businesses. Proud to join this multi-state effort to review and improve federal wildland fire policy.","date":"Wed Jul 21 15:42:33 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TODAY in Lehi if you're having issues with Social Security, Medicare, or any federal agency. We're here to help you! For more information, visit https://t.co/REkdD4XUTC. https://t.co/Zrp43YhNlj","date":"Wed Jul 21 13:05:10 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Gas prices in Utah are currently 5th highest in the country - one of the many consequences of soaring inflation. This is a hidden tax on working Americans, and more spending won't take the pressure off.\nhttps://t.co/loCS2ngIzk","date":"Tue Jul 20 14:24:10 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Momentum is building in the bipartisan push to take on Big Tech's anti-competitive, monopolistic practices. Proud to join the Freedom from Big Tech Caucus to develop solutions that empower consumers, support competition, and strengthen privacy rights. https://t.co/KldTT4k1sM","date":"Fri Jul 16 18:46:59 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"1.8 million Americans have turned down jobs due to unemployment benefits.\n\nSmall businesses can't afford to compete with heavy-handed government programs that pay more to stay home. https://t.co/CpICCVCMfl","date":"Wed Jul 14 20:17:49 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utahns deserve a full understanding of American history, not this corrosive practice that seeks to divide students based on race and destroys character-based meritocracy.","date":"Wed Jul 14 19:21:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Yesterday's subcommittee hearing on widespread concerns surrounding new facial recognition technology in law enforcement was a great start to developing bipartisan solutions. Appreciated the insight and expertise of Brett Tolman, former Utah U.S. Attorney.\nhttps://t.co/mY84NDSUVw","date":"Wed Jul 14 16:38:49 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Earlier this week, I joined the @westerncaucus to advocate for rural farmers, ranchers, and small businesses in Utah and across the country who will face damaging consequences if the Administration returns to the far-reaching and burdensome #WOTUS rule.\n\nhttps://t.co/xbdg4yB1Hd https://t.co/Fw7MACXL7Q","date":"Wed Jul 14 15:58:31 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"@MaloufFdn Congratulations, @MaloufFdn! Your organization is mission-critical to fighting human trafficking and ensuring justice for survivors.","date":"Wed Jul 14 14:22:11 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"85% of Utahns say they're concerned about inflation. With consumer prices reaching a 13-year high, it's clear this Administration's tax-and-spend agenda is bad for economic recovery and unsustainable for families trying to make ends meet. https://t.co/1W4O8wSn4t","date":"Tue Jul 13 21:54:21 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The denial of tax-exempt status of Christians Engaged was politically motivated and discriminatory. Proud to sign this letter alongside my colleagues in defense of religious freedom and encouraged to see this decision reversed.\n\nhttps://t.co/AwyUMafL8B https://t.co/IPEetRQYDE","date":"Fri Jul 09 00:11:02 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"According to BLM Utah, flying the American flag is now racist and hateful. What an insult to those who have fought, served, and died for our freedoms. \nhttps://t.co/zrjaopvY4R","date":"Thu Jul 08 18:48:32 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Wishing all Utahns a safe and happy Independence Day! 🇺🇸 https://t.co/c9Q8l5yxoY","date":"Sun Jul 04 13:51:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"It's no secret that Utah is on the cutting-edge of healthcare innovation. Read my thoughts on how our state's providers are leading in the development of consumer-focused, accessible, and affordable care.\nhttps://t.co/YBK6gLYgFi","date":"Wed Jun 30 17:20:02 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Thanks to @GOPLeader for selecting me to serve on The Future of American Freedoms task force. I look forward to working with @Jim_Jordan and the team to develop policies that strengthen our country's foundational freedoms and ensure the American dream is even more accessible.","date":"Wed Jun 30 16:14:40 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I’m back in Utah for knee replacement surgery this week. My team in West Jordan and Washington are operating as normal and, I’ll be staying up to date with legislation during recovery. Thank you for the prayers and support – it means the world to our family.","date":"Tue Jun 29 18:08:13 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Today I voted against S.J. Res. 14, an attempt to reinstate Obama-era policies that harm the American fossil fuel industry and small oil and gas facilities in Utah. Increasing our country's energy independence should be a bipartisan endeavor.","date":"Fri Jun 25 16:54:17 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Judiciary Committee just passed my amendment to bolster the ACCESS Act's data privacy provisions to further protect American consumers and their data. Another important step to hold Big Tech accountable.","date":"Thu Jun 24 02:33:39 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to join the @climate_caucus to help pursue effective legislation that is consistent with conservative values and American innovation. Big thanks to my friend and fellow Utahn @RepJohnCurtis for leading the charge.\nhttps://t.co/Pru70dqKqp","date":"Wed Jun 23 18:37:08 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Meet Team Owens for mobile office hours TODAY in Taylorsville if you're having issues with Social Security, Medicare, or any federal agency. We're here to help you!\n\nFor more information, visit https://t.co/REkdD4XUTC. https://t.co/1DA3dMKXt4","date":"Mon Jun 21 15:12:21 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Congratulations, Rhyan!","date":"Mon Jun 21 14:21:51 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Being a father of 6 and a grandpa to 15 is the greatest blessing I could have ever imagined. From our family to yours, #HappyFathersDay! https://t.co/04kd9OXRBf","date":"Sun Jun 20 15:02:59 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On this #Juneteenth, we remember the heroes who fought for freedom and continue our never-ending pursuit of a more perfect union. https://t.co/x3kdnfW59O","date":"Sat Jun 19 19:21:03 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"@RepBlakeMoore Congratulations, Blake!","date":"Thu Jun 17 20:09:07 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"#Juneteenth marked the end of slavery and a monumental turning point in history. As we recognize our newest federal holiday, may we reflect on the resiliency and progress of my proud race and commit to our ongoing work to unlock the pathway to prosperity for Black Americans.","date":"Thu Jun 17 20:06:55 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Strong foundations for children impact long-term learning and lifelong success. My new bill with @RepRonEstes will develop bipartisan solutions to streamline early childhood education and care programs, ultimately saving families precious time and money. https://t.co/LzZk19Scqe https://t.co/efQdHfcIip","date":"Wed Jun 16 21:24:35 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Highlight of my day was welcoming @SaltLakeCC President Huftalin to Washington. We talked about the impressive work they're doing to power our state's future and last week's BIG win! https://t.co/1O4mNYxnuy","date":"Wed Jun 16 20:05:49 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Administration's race-based aid for farmers violates their right to equal protection under the law.\n\nIt’s one thing to provide relief to those who need it, but it is fundamentally wrong to intentionally discriminate based on race. https://t.co/egnjDe5ihX","date":"Mon Jun 14 17:01:50 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy Birthday, @USArmy!","date":"Mon Jun 14 16:35:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"For over 240 years, the American flag has been a powerful symbol of freedom, hope, and opportunity, representing the sacrifices of our servicemen and women and the values of our more perfect union. #FlagDay https://t.co/RSHTLfzx7v","date":"Mon Jun 14 16:25:19 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":".@nypost is right - Big Tech has been getting away with murder. I'm proud to co-sponsor the ACCESS Act, which empowers users to transfer their personal data between platforms and puts American consumers back in the driver's seat. https://t.co/roKpDAH4ZW","date":"Fri Jun 11 23:17:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Congratulations, @slcc_msoccer!","date":"Fri Jun 11 17:08:44 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As @POTUS considers @SecDebHaaland's recommendations for the Bears Ears and Grand Staircase-Escalante national monuments, Utah's federal delegation reiterated calls for a collaborative plan that reflects the input of those most directly impacted.\nhttps://t.co/R4Yv0JIDEd","date":"Thu Jun 10 00:56:45 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I also asked @SecMartyWalsh about how broader use of e-delivery for retirement savings documents could benefit retirement plan participants and impact seniors and those in rural areas. https://t.co/4ZEdfLX330","date":"Wed Jun 09 23:58:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Small business is the heart and soul of Utah, but employers can't afford to compete with heavy-handed government programs that pay more to stay home. \n\nWith 9.3 million unfilled jobs across the country, there's never been a better time to get Americans back to work. https://t.co/a35A84TqYK","date":"Wed Jun 09 23:57:52 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm proud to see the @MaloufFdn once again leading the fight to end human trafficking while providing survivors with all-encompassing support. This heinous crime has no place in Utah. \nhttps://t.co/ZpnFEfZywH","date":"Wed Jun 09 16:06:48 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In April, businesses across the U.S. were unable to fill 9.3 million job openings. Our country's hiring crisis is real - and it's getting worse by the day.\n\nThe government should stop hindering recovery and start incentivizing Americans to return to work.\nhttps://t.co/zuGsr9D9sf","date":"Wed Jun 09 14:43:11 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This weekend marked a well-deserved celebration for the American Preparatory Academy's Class of 2021 &amp; my first time delivering a commencement address. Wishing all of Utah's graduates blessings and success in their next chapters! https://t.co/LIzOeBhusQ","date":"Mon Jun 07 21:33:54 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This story is a must-read as we reflect on yesterday's anniversary and the bravery that changed the course of history. Thank you, Cpl. Don Pullan.\nhttps://t.co/tY49BZ6Vt1","date":"Mon Jun 07 21:32:26 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"77 years ago, 160,000 Allied troops landed on the beaches of Normandy to liberate Europe and defend freedom. May we never forget the courage and sacrifice of the Greatest Generation. #DDay https://t.co/dFzFb01y9q","date":"Sun Jun 06 14:23:44 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Very proud to join the House that SHE Built team as two years of hard work comes to fruition. This nationally recognized project represents more than just four walls and a roof - it shows the determination and grit of Utah’s women professionals and tradeswomen. https://t.co/66lM3iq9ap","date":"Fri Jun 04 19:44:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Freedom is not free. Today, and every day, we honor the American heroes who made the ultimate sacrifice in faithful service to our great country. May God bless our fallen officers and their families. #MemorialDay https://t.co/eZUIcL9MCZ","date":"Mon May 31 14:34:12 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We must stand united against violence, discrimination, and hate. Proud to co-sponsor the Preventing Anti-Semitic Hate Crimes Act led by @RepDavidKustoff and @GOPLeader.","date":"Wed May 26 20:17:26 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"President Biden's big-government, ultra-inflation, and massive spending agenda has a big problem: the economy. It's also spiking the price of groceries, gas, lumber, and more. Americans can't afford this.\nhttps://t.co/1DfoP9dTdU","date":"Wed May 26 16:04:50 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Team Owens also had the pleasure of honoring two heroes in education - Elizabeth Halloran of West Jordan and Roger Morgan of Saratoga Springs. Thank you for all that you do to inspire the next generation. https://t.co/UZmnefLn8n","date":"Tue May 25 00:56:59 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Thrilled to spend the day visiting schools across the 4th District with local and state leaders. Utah students learn best in the classroom, and I’m thankful for the hardworking educators who have kept them on track despite a challenging year. https://t.co/7nruMU6pPp","date":"Tue May 25 00:56:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Roger Morgan is a pillar of the Vista Heights Middle School community and has made a lasting impact on countless students, teachers, and families. Proud to honor him on the House floor! https://t.co/1cuDoM20SS","date":"Thu May 20 19:41:38 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Critical Race Theory is anti-American and has no place in our schools. That's why I joined @EdLaborGOP's letter to @usedgov objecting to education programs that advance racist and divisive ideologies.","date":"Wed May 19 21:36:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Gas prices are skyrocketing in Utah and across the country. Proud to co-sponsor @RepHerrell's bill to provide swift relief by temporarily suspending the federal gas tax.","date":"Wed May 19 19:40:10 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The skyrocketing price of lumber is hurting the construction industry and homebuyers in Utah's Fourth District. Proud to sign this bipartisan letter urging @USTradeRep to pursue a balanced agreement that prioritizes American jobs and economic growth. https://t.co/mNtzvHsONg","date":"Tue May 18 21:59:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"America is not a racist country, but divisive ideologies like Critical Race Theory perpetuate the bigotry &amp; separation of a pre-Civil Rights era. Today, I introduced legislation to discourage discrimination in classrooms &amp; U.S. institutions.\n\nRead more: https://t.co/lJgjqn4iWh https://t.co/6BIKdzRMd5","date":"Fri May 14 18:06:40 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In Utah, you'll find a unique approach to community-centric programs that increase effective early intervention and decrease recidivism. Appreciated the insight of Brett Peterson, who represented our state's collaborative efforts at today's House Judiciary hearing. https://t.co/XSV81H6ep1","date":"Thu May 13 23:06:06 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Beautiful morning in Washington to honor our country's men and women in uniform. I'm grateful for Utah’s police officers and remember their sacrifices every day. https://t.co/GWHavZRxzZ","date":"Thu May 13 14:48:44 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I've talked with dozens of small business owners who are struggling to fill well-paying jobs and can't afford to compete with the federal government. This is an important step to getting Utahns back to work and reopening our state.","date":"Wed May 12 18:47:05 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In recent days, innocent civilians have been targeted and killed by Hamas. Israel - one of our greatest allies - has the right to defend itself from this onslaught of violence. #StandWithIsrael","date":"Tue May 11 18:20:25 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This #NationalPoliceWeek, I'm sending my prayers and gratitude to the brave men and women in blue who put their lives on the line every day to keep us safe. God bless our law enforcement officers and their families. https://t.co/4PORvbquT8","date":"Mon May 10 23:14:38 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"It is inexcusable to prioritize unions over students and politics over science. The longer schools stay closed, the further children will fall behind, particularly students with disabilities and disadvantaged groups.\n\n@virginiafoxx @EdLaborGOP \nhttps://t.co/ZDtrpJv4s5","date":"Mon May 10 18:23:05 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"To all the moms in Utah and beyond, Happy Mother’s Day! https://t.co/NAuhUDb03V","date":"Sun May 09 14:20:50 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I was proud to join our state's leaders to welcome @FLOTUS yesterday for her first official trip to the Beehive State. Even during a challenging year, Utah students are resilient and have persevered to find success in the classroom and beyond.\n\nhttps://t.co/3IwVhlm5G3","date":"Thu May 06 21:17:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Congratulations to the winners of the 2021 Congressional District Art Competition! We received some outstanding artwork and can’t wait to see the first place piece hang proudly in the U.S. Capitol. https://t.co/IH8eFsKT0P","date":"Thu May 06 20:47:36 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Welcome home!","date":"Wed May 05 16:37:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We need to see the complete picture in the fight to eradicate human trafficking once and for all. \nhttps://t.co/7d3SgxXC4x","date":"Wed May 05 15:33:33 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Sending prayers and gratitude to all the firefighters in Utah's Fourth District and across the country! #FirefighterAppreciationDay https://t.co/ss18BSo2Jo","date":"Tue May 04 22:00:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Human trafficking is modern-day slavery. Proud to team up with @virginiafoxx to request a @USGAO report on how the federal government can improve life-saving response efforts and preventative measures to combat this horrific global humanitarian concern. https://t.co/PNWDGU6Iax","date":"Tue May 04 18:32:19 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy #TeacherAppreciationDay to the heart of our education system. Thank you, teachers! https://t.co/7lrJSGows2","date":"Tue May 04 16:00:52 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Democrats' progressive pet projects and disastrous policies come at the expense of hardworking taxpayers and future generations. To truly restore the soul of our nation, the President must stop governing from the far left and start representing all Americans.","date":"Thu Apr 29 02:49:13 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Tonight, we heard President Biden's spin on his first 100 days in office, but nothing of his job-killing executive orders, the national security crisis at our border, or the largest tax increase in a generation.","date":"Thu Apr 29 02:49:13 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Taiwan's invaluable contributions to the international community in the fight against COVID-19 should be on full display for the 74th World Health Assembly - not sidelined by the @WHO and the Chinese Communist Party. #LetTaiwanHelp","date":"Tue Apr 27 18:39:27 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":".@SenatorTimScott is the living embodiment of the American Dream, and I'm proud to serve with him. This \"fact check\" is insulting and incorrect.","date":"Fri Apr 23 20:54:32 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 113th Birthday, @USArmyReserve! https://t.co/pN5iuDlepv","date":"Fri Apr 23 15:35:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"\"The notion that black people must be protected from a free ID to secure their votes is not just insane - it's insulting.\"\n\n@MarkRobinsonNC is right. This should be about integrity, not power.","date":"Thu Apr 22 15:08:08 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Thanks for having me, @jasoninthehouse!","date":"Wed Apr 21 19:18:07 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Today, justice was served in the senseless killing of George Floyd. I am praying for peace and healing in Minnesota and across the nation as we the people unite to build bridges for positive change.","date":"Tue Apr 20 22:19:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Reparations will not and cannot help our cause as Black Americans.\n\nRead my latest op-ed in today's @WashTimes.\n\nhttps://t.co/0a6DJxrd1M","date":"Tue Apr 20 20:27:58 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Jim Crow laws like poll taxes, property tests, literacy tests, and violence and intimidation at the polls made it nearly impossible for Black Americans to vote.\n\nI remember legalized institutional racism, and these comparisons to Georgia are outrageous and offensive. https://t.co/I9n35vRdEG","date":"Tue Apr 20 17:21:35 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Looking forward to joining @maloufFdn this afternoon to discuss steps we’re taking on the federal level to fight human trafficking.","date":"Sat Apr 17 17:19:03 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I grew up in the days of the KKK, Jim Crow, and segregation, so I'm no stranger to casual racism and hate-fueled rhetoric. This is a new low from the @sltrib. https://t.co/4iVqwvoFN8","date":"Fri Apr 16 18:25:25 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"“Preferential care based on race” \n\nSounds like a violation of the Civil Rights Act. \nhttps://t.co/fKzYjWlC2Y","date":"Wed Apr 14 18:27:48 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Congratulations to the newest member of our freshman team, @jbletlow! I look forward to working with you in Congress.","date":"Wed Apr 14 17:41:52 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Our American culture of empathy, opportunity, and compassion is undermined when the price of entry is immense human suffering.\n\nClosing your eyes to this humanitarian crisis won't make it go away. https://t.co/RzxwsnTt8D","date":"Wed Apr 14 17:29:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Journalism Competition and Preservation Act is a bipartisan piece of legislation that establishes a four-year safe harbor from antitrust restrictions that allow news publishers — big and small — to band together and negotiate with players in Big Tech.https://t.co/coHPwQs4Kq","date":"Fri Apr 09 23:38:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Today I joined @SecDebHaaland, @SenMikeLee, and @RepChrisStewart to discuss the need for a collaborative, permanent solution to the 25+ year dispute over the boundaries and management of our state's monuments. Utah deserves a seat at the table. https://t.co/K689OUupcE","date":"Fri Apr 09 16:32:43 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"https://t.co/UK2htsYTRV","date":"Thu Apr 08 00:31:51 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Overheard today in TX:\n\n“This crisis is unlike anything we’ve ever seen.”\n“It’s chaos.”\n“This unprecedented surge is a direct result of the current administration’s policies.”\n\nIt’s open season on the border &amp; there’s no end in sight.","date":"Wed Apr 07 18:48:03 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Tune in!","date":"Wed Apr 07 18:04:09 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I am eternally grateful for the men and women of our @CapitolPolice, who have been through so very much these last few months. My family and I continue to pray for comfort and peace for the family of Officer Evans, as well as the continued recovery of Officer Shaver. https://t.co/8uVDhErHtZ","date":"Wed Apr 07 16:56:24 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Biden's EO didn't just shut down down border wall construction - it caused a preventable breakdown in security. \n\n@CBP agents in Texas tell me they've been pulled from these gaps to mitigate the humanitarian crisis in migrant facilities. https://t.co/inU5IJEtUP","date":"Tue Apr 06 23:25:53 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Overcrowded facilities. Thousands of unaccompanied children. 171,000+ southwest border encounters in March 2021. \n\nThe Biden Administration is trying to cover up a humanitarian and national security crisis of their own making.","date":"Tue Apr 06 17:55:40 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"From our family to yours, Happy Easter! https://t.co/rJ8RIsbWd0","date":"Sun Apr 04 14:40:33 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Thanks to the Western AG Credit in South Jordan, farmers and ranchers across Utah are seeing signs of hope and receiving the support they need to continue feeding our communities. https://t.co/tOC3sjmHlV","date":"Sat Apr 03 19:49:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Mount Liberty College in Murray provides a top-notch education, emphasizing job training and alternate pathways to success. Highlight of my week was meeting with students and discussing one of my favorite authors and American educators, Booker T. Washington. https://t.co/b1cp6yAs4k","date":"Sat Apr 03 19:49:55 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Great week back in Utah! Enjoyed meeting with an interfaith group of 15+ pastors in West Valley who do incredible work to preserve religious liberties in our state. https://t.co/zrOlgxRumh","date":"Sat Apr 03 19:49:53 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This is devastating news. My heart is heavy for the entire @CapitolPolice community, and my prayers are with the officer’s loved ones on this tragic day.","date":"Fri Apr 02 19:13:28 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Sending my prayers to our heroic @CapitolPolice and wishing a swift recovery to the officers injured today.","date":"Fri Apr 02 17:55:14 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Glad to join my friend @RepTiffany to introduce the ACRE Act, which prohibits @USDA from discriminating or advantaging American farmers based on race, national origin, or sex. https://t.co/r0iMtHotSp","date":"Wed Mar 31 18:09:23 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Included in Biden's $1.9 trillion spending package was $5 billion in agriculture debt relief earmarked exclusively for non-white farmers.\n \nIt’s one thing to provide relief to those who need it, but it is fundamentally wrong to perpetuate policies of discrimination based on race. https://t.co/q7OPhWfXzs","date":"Wed Mar 31 18:09:22 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utah’s ‘mom and pop’ businesses are seeing signs of hope. This is tremendous news and a true testament to our local leaders and the fortitude of our small business community. https://t.co/oWcUxt0twP","date":"Tue Mar 30 14:42:46 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"May we never forget the sacrifice of our nation’s Vietnam veterans who so courageously answered the call to serve. #VietnamWarVeteransDay https://t.co/mbZ9fmWJYt","date":"Mon Mar 29 15:44:24 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utah is leading the nation in facilitating recovery &amp; promoting long-term growth as local businesses navigate a post-pandemic economy. https://t.co/CF6Vly1IH5","date":"Fri Mar 26 15:51:21 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We should be empowering American workers, not returning to the era of big labor union bosses. Read my op-ed with @RepSteel on the PRO Act, a radical bill with devastating economic consequences. https://t.co/wquAv5Ij1Y","date":"Thu Mar 25 18:26:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On #NationalMedalofHonorDay, we pay tribute to the extraordinary Americans who have earned our nation's highest military honor. We are forever grateful for their service and sacrifice. https://t.co/FD8Yoc25nq","date":"Thu Mar 25 14:28:25 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm a proud member of the @HouseGOP freshman team that welcomed a record number of women to the halls of Congress. During #WomensHistoryMonth - and every month - we celebrate these leaders &amp; their tremendous impact on our nation.","date":"Wed Mar 24 22:00:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"With the stroke of a pen, the Biden administration halted construction on the border wall, infringing on Congress' constitutional power of the purse &amp; contributing to the growing national security crisis on our southern border. https://t.co/qyDvV1OS1O","date":"Wed Mar 24 21:09:36 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On #NationalAgDay, we celebrate the backbone of our country &amp; the hardworking farmers, ranchers, and growers that fuel prosperity across Utah. https://t.co/SufkdccLNc","date":"Tue Mar 23 16:34:17 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Schools across the country stayed closed because of politics – not science – and our students paid the price.","date":"Fri Mar 19 21:57:04 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Future generations will foot the bill for America’s fiscal irresponsibility. Proud to co-sponsor the Unauthorized Spending Accountability Act with Rep. @cathymcmorris to reduce the deficit and do away with unauthorized and wasteful spending.\nhttps://t.co/Rz3dGZ89Za","date":"Fri Mar 19 21:28:35 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Great news out of Utah! To schedule an appointment, visit https://t.co/rwTwifcMlf or https://t.co/p04DR0VBp8.","date":"Thu Mar 18 19:14:08 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We're collaborating with the Wounded Warrior Fellowship Program to hire a wounded or disabled veteran for a paid two-year fellowship. The fellow will work alongside my staff in our West Jordan Office, serving the constituents of UT-04.\n\nTo apply, visit: https://t.co/sNwRGGJboF","date":"Wed Mar 17 20:38:14 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We’re facing a serious crisis at our southern border that’s threatening the safety of Americans.\n\nProud to stand with @RepMariaSalazar and my GOP colleagues to promote a compassionate immigration reform policy that both fairly enforces the law and drives the American Dream. https://t.co/euc86QLiGE","date":"Wed Mar 17 15:33:12 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy Saint Patrick's Day! https://t.co/46LDp9QyCI","date":"Wed Mar 17 15:02:03 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Key constituencies were excluded from the Biden administration's 30 by 30 initiative. I joined the @westerncaucus to ask how this goal can be accomplished without harming industries, economies, and livelihoods in Western and rural communities.\n\nRead more: https://t.co/I2luAT8Upb https://t.co/OCoyPjSF5C","date":"Tue Mar 16 20:20:57 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Cancel culture has taken the form of oppressive censorship as Big Tech silences American voices &amp;  freedom of speech - and their power is only growing. \n\nEnjoyed taking part in today's House Judiciary anti-trust hearing. https://t.co/VSl9CcsjZV","date":"Fri Mar 12 22:36:49 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In the last week, I’ve received over 1,000 letters from my constituents who strongly oppose H.R. 8 and H.R. 1446.\n\nA bill like this doesn't make it harder for criminals to get guns - it makes it harder for good, law-abiding citizens to protect themselves. https://t.co/Byh1NDuAvj","date":"Wed Mar 10 20:04:38 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Nancy Pelosi’s $1.9 trillion wish list allocates less than 10% for COVID-19 health care relief, only 1% for vaccine distribution &amp; ignores $1 trillion in unspent funds from the previous bipartisan packages.\n\nThis was never about pandemic relief. https://t.co/jmSti1h0Ia","date":"Wed Mar 10 18:41:06 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The PRO Act, while claiming to be pro-worker, seeks to fundamentally re-engineer our country's labor regulations by overturning right-to-work laws, forcing one-size-fits-all union contracts, and prioritizing union bosses.\n\nRead more: https://t.co/U0kMW3etk5 https://t.co/5EukBO5yKR","date":"Wed Mar 10 00:10:15 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The good news keeps rolling in for Utah’s business-friendly environment. This #1 @usnews ranking is a testament to our state's leaders, who have put in the work to fuel job growth, innovation, and economic partnerships across Utah. https://t.co/SrzeZpfPOX","date":"Tue Mar 09 21:17:06 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I spent the week talking with law enforcement officials in my district - here's what they had to say about #HR1280:\n\n“This will destroy public safety.”\n\n“We haven’t done anything to earn this type of distrust.”\n\n“This will push good law enforcement out of the business.” https://t.co/ABDXa47rL0","date":"Wed Mar 03 23:54:22 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy 106th Birthday, U.S. @navy_reserve! https://t.co/IG0rRTCl95","date":"Wed Mar 03 17:56:24 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Agreed. #HR1 has nothing to do with protecting your vote &amp; everything to do with keeping Washington bureaucrats in power.","date":"Wed Mar 03 16:02:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Bringing the freshman team a sweet Utah treat! @CrumblCookies https://t.co/BK46HA6xYN","date":"Tue Mar 02 19:01:07 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In the fallout from #COVID19, families in my district &amp; across the country are suffering severe financial burdens. I’m proud to join @RepCloudTX &amp; @RepAshleyHinson to advocate for responsible stewardship of hard-earned taxpayer dollars.\n\nRead more: https://t.co/rZEgqmau91","date":"Tue Mar 02 16:41:04 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to co-sponsor @RepChrisStewart's Fairness For All Act. It's time that we define the federal protections for our LGBT and religious friends and neighbors - there's room to do both.\n\nhttps://t.co/KQUOvSKG67","date":"Tue Mar 02 16:29:22 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This bill showcases the worst of Washington – funding special interest groups, incentivizing harmful lockdowns, and destroying quality jobs at the expense of American families. My constituents in the Fourth District deserve better “relief” than this.","date":"Sat Feb 27 05:38:59 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The American Rescue Plan is a trillion-dollar wish list filled with special interest buyouts, progressive spending priorities, and misplaced assistance masquerading as pandemic relief.","date":"Sat Feb 27 05:38:59 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This is great news. Sending prayers and gratitude to Officer John Oseguera and his family.","date":"Sat Feb 27 00:42:53 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to have the @USArmy seal hanging in our office, thanks to Maj. Gen. Neil Thurgood, Director of Hypersonics, Directed Energy, Space &amp; Rapid Acquisition AND a @UUtah grad! https://t.co/GRu0mHfdgc","date":"Fri Feb 26 20:14:18 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"For nearly a year, students have been pushed out of their schools &amp; forced to learn from behind a screen. \n\n@virginiafoxx and I sent a letter to @CCSSO requesting information on how states are working alongside school districts to reopen classrooms. https://t.co/rrKjlGaPJw","date":"Thu Feb 25 21:00:00 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Congress knows how to protect religious freedom when it wants to. Why not make the law clear to promote civil rights AND religious liberty? That would be the historic and unifying thing to do. https://t.co/X7emNsq95n","date":"Thu Feb 25 20:33:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to join @RepStefanik in introducing the End College Chinese Communist Partnerships Act to block taxpayer dollars from supporting CCP ideologies &amp; propaganda efforts on American campuses. https://t.co/FgMu1BWOwI","date":"Wed Feb 24 22:45:42 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Just wrapped a great conversation with @Heritage &amp; Rep. @ByronDonalds on the importance of empowering black communities and preserving the American dream for generations to come. https://t.co/7U0CZOPUiQ","date":"Wed Feb 24 16:27:49 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This bill is a $1.9 trillion wishlist of special interest buyouts and progressive spending priorities - not pandemic relief.\n\n- $50 million for environmental justice grants\n- $1.5 billion for Amtrak\n- $35 billion to bail out ObamaCare\n- $15 minimum wage\n\nhttps://t.co/WA1oxLTltc","date":"Mon Feb 22 19:47:25 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Great op-ed from my friend @RepChrisStewart. \n\nI completely agree - religious freedom is a core principle of our country and we must work tirelessly to preserve it for future generations.","date":"Sun Feb 21 15:29:08 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Our youngest students are bearing the effects of COVID-19 and its impact on early education. The science is clear: we must put the needs of students first, provide options for families, and prioritize safe in-person learning.\nhttps://t.co/m4uzWdAShz","date":"Sun Feb 21 15:03:19 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Utah’s thriving communities are taking our state to new heights. Proud to see three Utah powerhouse cities recognized for their innovation and job creation.\nhttps://t.co/mx9dpvNc2F","date":"Thu Feb 18 00:43:51 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The reality is that Black history is not one of a hapless, hopeless race. It's the rich history of millions of Black Americans achieving their American dream. https://t.co/iQnJs64VWv","date":"Wed Feb 17 22:23:50 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Rush Limbaugh was an invaluable voice for the conservative movement and left an extraordinary mark on this country. My prayers are with his wife Kathryn and the entire Limbaugh family during this difficult time.","date":"Wed Feb 17 18:30:51 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Born into slavery, Rep. Joseph Rainey of SC was the first African American to serve in the U.S. House of Representatives. Also a member of the Republican Party, he was a changemaker who blazed a path for freedom, liberty, and opportunity. https://t.co/rZcwcpEz4J","date":"Mon Feb 15 21:32:45 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In 1870, Sen. Hiram Revels of MS became the first African American to serve in the U.S. Senate. As a member of the Republican Party, he challenged the social order &amp; was an outspoken opponent of segregation, fighting for equality across racial lines. https://t.co/4eowRZ4xqj","date":"Mon Feb 15 21:32:45 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"February is a month dedicated to honoring the heroes who rose above their circumstances to live their American Dream. Without the sacrifices of trailblazers like Sen. Revels and Rep. Rainey, I wouldn’t be where I am today.","date":"Mon Feb 15 21:32:45 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"#BlackHistoryMonth is an important celebration and recognition of American history, and I’m humbled to stand on the shoulders of the great men and women who came before me. https://t.co/S1sOVYehaa","date":"Mon Feb 15 21:32:44 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"My first newsletter is here! For updates from my official office, and to sign up, subscribe here: https://t.co/Z9IBbUXOAb. \n\nhttps://t.co/ECbpAnRytE","date":"Mon Feb 15 17:40:28 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Honoring the father of our country, President George Washington, and the Americans who have guided our nation throughout history. Happy #PresidentsDay! https://t.co/phqFDQbzGp","date":"Mon Feb 15 15:16:03 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"When Utah students succeed, our entire state prospers. I’m grateful to our state's educators for putting students first, following science, and safely returning to the classroom with proper precautions. Thanks for having me, North Sanpete High! https://t.co/xGfSB5lL7w","date":"Sat Feb 13 18:14:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As the son of an educator and a grandfather to 16 school-aged children, I’m thrilled for the opportunity to serve our nation's students as ranking member of the Early Childhood, Elementary, and Secondary Education Subcommittee.\n\nhttps://t.co/0fMJjmqHmi","date":"Tue Feb 09 15:16:05 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm deeply saddened by the news of Representative Ron Wright's passing. My prayers are with his wife Susan and the entire Wright family during this difficult time.","date":"Mon Feb 08 16:41:02 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"To be on the field right now is a remarkable blessing, and I'm humbled for this opportunity to serve my state. \nhttps://t.co/zEhK9471fc","date":"Mon Feb 08 15:41:01 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Just introduced my first piece of legislation! The Education Freedom Scholarships &amp; Opportunity Act expands common-sense approaches to diverse opportunities for students in Utah and across the country.\n\nRead more: https://t.co/xIVOesgdG8 https://t.co/R0jlrHllmZ","date":"Fri Feb 05 20:37:47 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As one of only two Black men to serve on our nation's highest &amp; most distinguished court, Justice Clarence Thomas deserves unbiased recognition.","date":"Thu Feb 04 18:10:09 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Officer Brian Sicknick is a hero, and I was honored to pay my respects to him today. My deepest condolences are with his family, loved ones, and the entire @CapitolPolice community. https://t.co/XSN2rHvqFY","date":"Wed Feb 03 17:33:07 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As a young man in the segregated south, I felt empowered by the stories of Booker T. Washington, Madam C.J. Walker, Martin Luther King Jr., Jackie Robinson, and so many of my heroes, who overcame unspeakable odds to secure the dreams of future generations. #BlackHistoryMonth https://t.co/tStajrptXQ","date":"Mon Feb 01 19:22:21 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The life of every child - born and unborn - is a precious gift and worth protecting.\n\nThis is #WhyWeMarch.","date":"Fri Jan 29 17:31:36 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We must never forget. https://t.co/FwfE3ttyRz","date":"Wed Jan 27 15:17:17 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Great piece. Human trafficking is slavery - plain and simple, and I pray that we can forge a united path forward to end this atrocity once and for all.\nhttps://t.co/z4VzSsmvkq","date":"Tue Jan 26 17:20:37 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Happy birthday @GOPLeader !","date":"Tue Jan 26 17:03:50 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"America's workforce is the backbone of our country, and I'll work alongside my colleagues to further strengthen health care, job training, and retirement security.","date":"Tue Jan 26 02:17:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I entered public service to fight for American workers and students across Utah, and I’m thrilled for the opportunity to continue this important work on the @EdLaborCmte.","date":"Tue Jan 26 02:17:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"From early learning to higher education, every student deserves access to a high-quality education - regardless of race, income, or zip code.","date":"Tue Jan 26 02:17:16 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I’m honored to be selected to serve on the House Judiciary Committee and look forward to considering the critical matters related to our federal courts, law enforcement agencies, and constitutional amendments.","date":"Mon Jan 25 22:00:48 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"In the coming months, I’ll work hard to combat human trafficking, address the dangers of censorship, and protect the civil liberties of all Americans.","date":"Mon Jan 25 22:00:48 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"ICYMI: Indian lands are not federal public lands.\n\nThe Biden Administration should bring the people impacted by their decisions to the table.\n\nhttps://t.co/bAxFnEID5U","date":"Mon Jan 25 12:56:30 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"This is counterproductive. With the stroke of a pen &amp; no bipartisan discussion, countless Utahns will be out of work, and a critical industry will suffer yet another unnecessary blow. Why make life more difficult for Americans who are already struggling?\nhttps://t.co/selfo9jBSU","date":"Fri Jan 22 22:16:25 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"On the 48th anniversary of Roe v. Wade, we reignite our duty to protect and defend the lives of every innocent and unborn child. https://t.co/Dv3nLsqSIb","date":"Fri Jan 22 18:37:15 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"What happened last night was an absolute disgrace. THANK YOU to the members of our @USNationalGuard - you are appreciated and deserve the utmost respect.\nhttps://t.co/Kji8FvcE8M","date":"Fri Jan 22 13:46:22 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Blocking high-paying jobs and promoting radical liberal policies is not a recipe for success in the Fourth District. I'd hoped that the days of prioritizing partisan agendas over the interests of all Americans were behind us.","date":"Fri Jan 22 02:44:45 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I've pledged in good faith to work with the Biden Administration to protect and bolster the priorities most important to our country. But uniting to achieve these goals does not mean staying silent when my colleagues and I witness policies that are out of step with our districts.","date":"Fri Jan 22 02:44:45 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Highlight of my day was spending time with the brave men and women of the @UTNationalGuard. These heroes exhibit the ultimate in courage and sacrifice, and I'm grateful they've answered the call to serve. https://t.co/tsjt2ml3lq","date":"Thu Jan 21 23:41:49 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to join my colleagues in signing a letter to President Biden and Vice President Harris, pledging to rise above the partisan fray &amp; work towards meaningful change for Utah’s Fourth District and Americans across the nation. https://t.co/0avCvwkhPX","date":"Wed Jan 20 20:59:15 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"God bless the soldiers, airmen, and law enforcement officials standing guard to ensure the safety of today's events. Thank you for your service to our nation.","date":"Wed Jan 20 14:35:38 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I'm honored to attend the 59th Presidential Inauguration and join the country in celebrating a peaceful transition of power that has served as a cornerstone of American democracy for over 200 years.","date":"Wed Jan 20 14:35:38 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Great news for Utah’s small businesses - @SBAgov has reopened the Paycheck Protection Program to ALL participating lenders - a critical lifeline for small businesses facing the unprecedented financial impact of COVID-19. Learn more at https://t.co/V3lRWNw1Dm. https://t.co/oZkScLdwg8","date":"Tue Jan 19 21:00:18 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"As a young man, we had separate bathrooms, water fountains, and schools. Thanks to heroes like #MartinLutherKingJr, my children and grandchildren get to live their American dream. As we honor Dr. King's legacy, let's reaffirm his devotion to creating a brighter future for all. https://t.co/nONyAR589b","date":"Mon Jan 18 14:34:14 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The brave men and women of the @UTNationalGuard embody the values and ideals of this nation, and I'm proud to see so many answer the call to serve our Capitol. THANK YOU for this commitment. \nhttps://t.co/fZX2cNabPk","date":"Fri Jan 15 23:44:46 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"We have a transfer of power occurring next week, and any debate on impeachment will only deepen the divide our country is facing. My statement: https://t.co/L6uCz06035","date":"Wed Jan 13 13:56:45 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"The Paycheck Protection Program has been a lifeline for small businesses in Utah and across the country. This week, the PPP reopened to support small businesses facing unprecedented strain. Learn more &amp; apply at @SBAgov.\nhttps://t.co/05foGwiZ2t","date":"Tue Jan 12 20:52:13 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Airman 1st Class Martinez and Tech. Sgt. Marshall exhibited bravery above and beyond the call of duty, and I’m grateful for their service to Utah and our Nation. https://t.co/IQ1Drqb7EJ","date":"Tue Jan 12 18:11:17 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"My great-great-grandfather came to this country as a slave, and I’m forever grateful to those who made his freedom possible. On #NationalHumanTraffickingAwarenessDay, we're reminded of this global issue and our duty to keep our neighbors safe.","date":"Mon Jan 11 23:08:11 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to co-sponsor this bill with @repchrisstewart, and thankful for the tireless leadership and many years of service Mr. Bishop has dedicated to the great state of Utah.","date":"Mon Jan 11 21:50:30 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"My heart breaks for the tragic loss of Officer Liebengood, and my prayers are with his family, loved ones, and the entire @CapitolPolice  community. Officer Liebengood's sacrifice &amp; many years of service will never be forgotten. God bless the brave men &amp; women in law enforcement.","date":"Mon Jan 11 03:11:08 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I continue to mourn the loss of @CapitolPolice Officer Brian Sicknick and pray for his family. His selfless service will always be remembered, and the individuals responsible must be prosecuted to the fullest extent of the law.","date":"Sat Jan 09 17:48:22 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"It is time for us to unite and focus on healing our country. I look forward to working with my colleagues to identify solutions that will restore faith in our democracy, and to getting back to the people’s work.","date":"Thu Jan 07 02:59:58 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I hoped – on behalf of those who felt or who were disenfranchised - to ask that we take a serious look at the transparency of our electoral process. Because of the unacceptable mob violence demonstrated today, I did not get that chance.","date":"Thu Jan 07 02:59:56 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I was looking forward to giving my first floor speech. Telling the story of my great-great grandfather, my grandfather, and my father – who, regardless of their incredible success, were denied the right to vote.","date":"Thu Jan 07 02:59:55 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I am heartsick over what happened at the Capitol today. This is a sad day for our nation.","date":"Thu Jan 07 02:59:54 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"My team and I are safe and beyond grateful for the service of Capitol Police. \nI am deeply saddened by what is happening right now. Americans are better than this. Senseless violence is NEVER okay. We have to do better.","date":"Wed Jan 06 20:24:07 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Proud to sign this statement alongside so many of my colleagues. We owe it to the American people to protect the integrity of our electoral system. Period.\n\nhttps://t.co/oYk5iL0ZN0","date":"Wed Jan 06 13:50:44 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"Today, I took an oath to defend the constitution; an oath I do not take lightly. I'm honored #UT04 has chosen me to represent them in Washington. I promise to serve you to the best of my ability. From Juab &amp; Sanpete to Utah &amp; Salt Lake counties, thank you. I will make you proud.","date":"Mon Jan 04 02:28:48 +0000 2021","user_id":"1344481217685692416"},{"handle":"RepBurgessOwens","text":"I was proud to vote for @GOPLeader as Speaker of the House today. I share his vision that govt should get out of the way and let our families thrive, and that The American Dream was built on the promise that hard work and freedom can open the doors to success for anyone. https://t.co/UUPxlaAQGE","date":"Sun Jan 03 20:55:40 +0000 2021","user_id":"1344481217685692416"}]