[{"handle":"RepBrianMast","text":"Freedom                  Oppression\nDemocracy     &gt;       Autocracy\nCapitalism               Communism https://t.co/IKrePiQxLx","date":"Fri Jun 17 11:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🔥🔥 MUST WATCH 🔥🔥\n\nDemocrats are making gas prices absurdly expensive for Americans and they don't want to be questioned about it. \n\nThis will make your blood boil ⬇️","date":"Thu Jun 16 19:19:41 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Big win for veterans! Legislation that I wrote with @SenRubioPress, the Burn Pits Transparency Act, is heading to the President’s desk to become law, along with other bills to address the burn pit crisis facing our veterans. https://t.co/Q9jAM5UMUr","date":"Thu Jun 16 18:59:26 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨The South Florida Clean Coastal Waters Act is law!\n\nFor way too long, Florida’s east and west coasts have been treated as the state’s septic tanks. This law is a huge step forward in ensuring our communities have the tools needed to end toxic algal blooms once and for all. https://t.co/PKPhL2GRmU","date":"Thu Jun 16 16:47:59 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The China Social Media Reciprocity Act is a sanction: if the CCP is going to block Americans from their social media, they will be blocked from ours. https://t.co/wxwzls5hxy","date":"Thu Jun 16 14:29:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Not a list you want to be at the top of. Liberal policies driving up prices.\nhttps://t.co/uHoPsxvChV","date":"Thu Jun 16 00:44:55 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"LIVE NOW: Head to my YouTube page where I’m discussing the latest from Washington, D.C. and what it means for our community. https://t.co/90FmbBE7zP","date":"Wed Jun 15 22:06:09 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My provision in WRDA 2022 mandates a note be made in the file of every servicemember who is exposed to toxic algal blooms at Lake O. That way, if they experience health problems, they won’t have to fight to prove it’s connected to their service. https://t.co/vfa7yGbRBG","date":"Wed Jun 15 19:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Curious about what’s happening in Washington this week? I’ll be live tonight around 6PM to answer your questions. https://t.co/YxQHZ2yioZ","date":"Wed Jun 15 17:26:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Special Investigator Patterson dedicated his entire adult life to the service of St. Lucie County, beginning the day he graduated from the police academy at age 19. My prayers are with his wife, Alisha, and their two beautiful children. https://t.co/dw1HonOLc1","date":"Wed Jun 15 16:33:40 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’ll be on with @kilmede, @ainsleyearhardt &amp; co. shortly. We’re discussing my China Social Media Reciprocity Act &amp; why Big Tech shouldn’t allow the Chinese Communist Party to peddle their bull on American-run social media platforms while simultaneously banning conservatives.","date":"Wed Jun 15 11:40:21 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy Birthday to the @USArmy! Some of the most valuable lessons I’ve learned in life came from my 12 years of service. #HOOAH #ArmyStrong #BeatNavy https://t.co/0qwoJw7CtL","date":"Wed Jun 15 01:36:56 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"How do you think the St. Lucie River railroad bridge should be regulated\nTell the Coast Guard TODAY!\nhttps://t.co/2bTMVdEyd7 https://t.co/5G0jBAJS0v","date":"Tue Jun 14 23:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reminder: Joe Biden’s first order of business as President was spending an unnecessary $1.9 trillion on the so-called American Rescue Plan. That reckless move made the inflation we’re all feeling today that much worse.","date":"Tue Jun 14 22:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"That's why @RepJimBanks, @RepJoeWilson &amp; I introduced the China Social Media Reciprocity Act to block CCP officials from U.S. social media while American officials remain blocked from Chinese sites. (3/3)","date":"Tue Jun 14 20:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"But Chinese officials can’t be allowed to spew communist propaganda on U.S.-based platforms while blocking democratic ideas on their own. (2/3)","date":"Tue Jun 14 20:10:11 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There’s a reason China threw a fit about a Taiwaneese flag on Maverick’s jacket in Top Gun 2. The CCP knows that freedom always beats tyranny, and that’s why they go to extremes to keep American ideals out of the mainstream and offline. (1/3) https://t.co/zKw7hPEqEt","date":"Tue Jun 14 20:09:49 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ICYMI: A toxic water advisory was issued for Lake Okeechobee near Indiantown yesterday. Legacy nutrient buildup is a driving cause of these harmful algal blooms, which is why I included a provision in WRDA to allow for dredging of Lake O to get rid of that buildup. https://t.co/8iUvJz1Q7U","date":"Tue Jun 14 17:31:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The 50 stars and 13 stripes of our flag are stitched together with the sacrifices of every man and woman who has served this nation. That is what we should all remember this Flag Day. https://t.co/4urF8knCmY","date":"Tue Jun 14 13:59:53 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"⛽️ Fuel is up 106.7%\n✈️ Airfare is up 37.8%\n🏨 Hotels are up 22.2%\n\nPandemic restrictions are finally being lifted, but #Bidenflation means Americans still can’t travel this summer.","date":"Tue Jun 14 11:02:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The EAA Reservoir is the most important project when it comes to restoring the Everglades and sending water south. Enough is enough - the Army Corps needs to buckle down and get this done, which is why I included a provision in WRDA to make that crystal clear. https://t.co/DGve6j9cGS","date":"Tue Jun 14 00:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Life begins at conception.","date":"Mon Jun 13 23:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Pollution &amp; legacy nutrients in Lake O will keep causing problems until policymakers act. That’s why the Senate needs to send WRDA to the President’s desk. It includes my language to allow for dredging of Lake O to remove the muck that fuels these toxins. https://t.co/kSKaHsOvWq","date":"Mon Jun 13 22:00:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Last week, House Democrats blocked a bill to provide security to Supreme Court Justices and their families.\n\nLooks like their liberal allies in the media are also happy to ignore the problem. Disgusting.\nhttps://t.co/CpqHQoYLGf","date":"Mon Jun 13 20:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reminder to post your comments regarding the future of the St. Lucie River railroad bridge operations.\n\nThis regulation will decide whether boaters have to wait for 15 minutes at the bridge for a train to pass or 45 minutes! https://t.co/FLNXuQSoiV","date":"Mon Jun 13 19:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Addressing inflation should start by ending the war on American energy, not by ending tariffs that are keeping the communist nation responsible for coronavirus in check.\n\nCheck out the full interview here: https://t.co/rOGF08YIMU https://t.co/V3O9qpsyRb","date":"Mon Jun 13 12:34:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"A great reminder for everyone that this is still, without a doubt, the greatest nation on earth. Every day, we wake up with the freedom to decide that today will be better than yesterday. \nhttps://t.co/vVSOVH7Q7q","date":"Mon Jun 13 00:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Yes, public comments are the one opportunity our community has to weigh in on these changes and it will matter!  Head to https://t.co/g4f7Wk3j5A to learn more.\nhttps://t.co/qO0FJaGQMU","date":"Sun Jun 12 21:17:48 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We should be using every tool in our toolbox to combat the harmful algal blooms that poison our wildlife and threaten the health of our children nearly every summer. WRDA includes my provision to authorize the Army Corps to develop new technology to combat toxic algal blooms. https://t.co/nAr1jxrKFG","date":"Sun Jun 12 17:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My heart goes out to FWC Senior Investigator Kyle Patterson and his family. We will remember him for his selfless service to our community and his dedication to conservation. \n\nhttps://t.co/BpK2Di1BW4","date":"Sun Jun 12 14:11:02 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It says a lot about the White House’s credibility on the global stage that other foreign leaders didn’t think it was worth their time to attend this year’s Summit of the Americas.\n\nCheck out the full interview here: https://t.co/Y2lXq07rqj https://t.co/TdZKq5cl00","date":"Sun Jun 12 12:43:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If you care about boating access on the St. Lucie, the Coast Guard’s proposed change to the St. Lucie railroad bridge operations will impact you. To leave a public comment, you can head to https://t.co/2bTMVdW94F. https://t.co/ufQjKlKbOY","date":"Sat Jun 11 23:05:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As both a veteran and a co-chair of the Bipartisan Cannabis Caucus, I believe that veterans should be able to access every legal tool possible in order to treat their physical and mental health.\nhttps://t.co/vVENwLOR1P","date":"Sat Jun 11 21:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I guess Democrats in Washington no longer care about family separations.\n\nOur allies and partners deserve better.\nhttps://t.co/o7XhmnbfzE","date":"Sat Jun 11 18:16:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Protecting the ecosystem of the Indian River Lagoon is crucial. That’s why I’m excited that WRDA 2022 included legislation that I wrote to make sure the Indian River Lagoon-South project stays on track.  Learn more about this critical restoration project: https://t.co/1gTh9rj4Ov","date":"Sat Jun 11 16:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Huge news for Florida this week: the Water Resources Development Act - including my Northern Estuaries Restoration Plan - is just steps away from becoming law.\n\nPlus, an update on potential changes impacting boater access on the St. Lucie and more. Watch the latest #WeekInReview: https://t.co/mw2EhJnRBU","date":"Sat Jun 11 15:00:03 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Gas prices have reached an average of $5 per gallon nationwide. This is a direct consequence of Joe Biden’s war on American energy. https://t.co/tzuuZashXq","date":"Sat Jun 11 13:49:33 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Framers were very clear in setting up the three branches of government: the judicial branch is designed to be free from political pressure.\n\nAttempts to drag Supreme Court Justices into the fray are despicable. Cowardly attacks on them by the radical Left cannot be tolerated.","date":"Fri Jun 10 23:10:39 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When it comes to water quality, there’s a lot of work done at the local level. Included in this year’s WRDA is $100 million I secured for Martin, St. Lucie &amp; Palm Beach Counties to invest in infrastructure projects like storm and wastewater treatment that protect our estuaries. https://t.co/Ve0bu5fs66","date":"Fri Jun 10 19:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"A must-read thread for those who want to understand the political games being played that have really hurt progress on the EAA Reservoir. Reporters - either wittingly or unwittingly - are going along with it because the fraud is being perpetrated by media-friendly Democrats.","date":"Fri Jun 10 18:09:33 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨Newest data shows inflation has broken yet another record and climbed to 8.6% in May. \n\nBidenflation is already costing American families $600 each month. House Democrats should focus on that - not relitigating January 6th.","date":"Fri Jun 10 12:52:42 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Why doesn’t the Biden Administration have a plan to fight inflation? There are steps they could take NOW to alleviate the pressure on American families. Here’s what those are: https://t.co/XmsD92eMgf","date":"Fri Jun 10 12:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Northern Estuaries Restoration Plan will be the most consequential legislation our waterways on the Treasure Coast have seen in two decades. With the House vote to pass my bill yesterday, we’re just steps away from it becoming law. https://t.co/nKbji1hZ5L","date":"Thu Jun 09 23:02:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Got to spend this morning with the interns who are working for the Florida Delegation in Congress. It’s always great to see young people who are willing to serve their communities and their country! https://t.co/k4chFxpaCb","date":"Thu Jun 09 20:34:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"LIVE NOW: Head to my YouTube page where I’m discussing the latest from Washington, D.C. and what it means for our community. \n\nhttps://t.co/B4suZZOnho","date":"Thu Jun 09 16:17:58 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Wondering what the Water Resources Development Act means for our community? I’ll be live on YouTube at 12:15pm TODAY to answer your questions. I hope you can join me.\n\nhttps://t.co/B4suZZOnho","date":"Thu Jun 09 12:37:40 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"PASSED! The House just approved the Water Resources Development Act, including my legislation - the Northern Estuaries Restoration Plan - mandating the Army Corps develop infrastructure needed to END HARMFUL DISCHARGES to the St. Lucie, Caloosahatchee &amp; other northern estuaries! https://t.co/xOrhowfVb5","date":"Thu Jun 09 00:29:40 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’m proud of the bipartisan work done in Congress to address burn pits, though more work is still needed.  Burn pits are quickly becoming the Agent Orange of my generation.  Our service members and veterans deserve better. https://t.co/Qd6aUdcIfL","date":"Wed Jun 08 22:30:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Boater access under the St. Lucie River railroad bridge is already limited by train construction. If the Coast Guard approves a new regulation to accommodate Brightline, it’ll only get worse.\n\nYou can submit public comment here:\nhttps://t.co/wmsmIlEauc https://t.co/yxKocYpnLe","date":"Wed Jun 08 16:46:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is absolutely the right decision. We cannot allow the sugared up politicians in Tallahassee to derail Everglades restoration!  This bill would have meant more discharges to the St. Lucie and Caloosahatchee.  Good riddance. \n\nhttps://t.co/ltCutt4WEa","date":"Wed Jun 08 14:18:04 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The #ThinBlueLine is getting stretched even thinner with high retirements and skyrocketing crime. Once again, Florida is leading the way and making investments in law enforcement, as opposed to California’s and New York’s dangerous push to #DefundThePolice\nhttps://t.co/Vxy1v96wVj","date":"Wed Jun 08 13:16:19 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy National Fishing and Boating Week!\n\nRemember that there’s a major debate that could impact your ability to enjoy time boating! Consider submitting your opinions on the upcoming St. Lucie River railroad bridge decision.\nhttps://t.co/wmsmIlmz5C","date":"Wed Jun 08 01:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The House is about to vote on the Water Resources Development Act with 7 MAJOR initiatives I wrote that will make a huge difference for Florida’s water quality, including the Northern Estuaries Restoration Plan to permanently end toxic discharges. https://t.co/XRAbmR2pYw","date":"Tue Jun 07 22:38:47 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Congratulations to the newest Eagle Scout, Owen Johnson! The leadership skills you’ve gained through your time scouting will undoubtedly serve you well in the years to come. https://t.co/ribJIgwi2E","date":"Tue Jun 07 15:52:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"“The price of gasoline is not set by a dial in the Oval Office.” - Transportation Secretary Pete Buttigeg\n\nNo, it’s set by an all-out assault on American energy production that begins in the Oval Office. The American people see right through this Administration’s blame game.","date":"Tue Jun 07 11:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Who is in charge of the CDC? Scientists or the teachers unions?\nhttps://t.co/UyDPxDqgZt","date":"Mon Jun 06 23:09:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"#OnThisDay Allied Forces stormed the beaches of Normandy and began the liberation of Europe from Nazi rule. Almost 8 decades later, that commitment to freedom should still inspire every American. https://t.co/8ldN1SRH0g","date":"Mon Jun 06 20:36:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Boaters - have you submitted a comment to the Coast Guard about the changes to the St. Lucie River railroad bridge schedule? Boat access could be jeopardized. Click here to learn more: https://t.co/wmsmIlEauc https://t.co/5cWzNZpFrb","date":"Mon Jun 06 16:48:35 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The same Taliban that the White House called “businesslike” and “professional” is now giving safe haven to the people responsible for 9/11.\nhttps://t.co/NekNXQhDw2","date":"Mon Jun 06 15:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I appreciated the opportunity to speak with Keiser University's graduates this weekend. Good luck to all of you as you begin an exciting new chapter in your lives! https://t.co/YT7yMg8YHB","date":"Mon Jun 06 13:12:43 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨30 DAYS LEFT to share your opinion with the Coast Guard about a MAJOR change to the St. Lucie River railroad bridge that will impact boaters. Submit a public comment: https://t.co/wmsmIlmz5C https://t.co/WJtzE24lmH","date":"Mon Jun 06 00:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is why it’s crucial that we break the sugar industry’s iron grip on Lake Okeechobee’s management. The lake needs to be allowed to reach a lower level at the end of dry season so that when wet season rolls around, our communities aren’t dumped on.\nhttps://t.co/mekV5o1sTK","date":"Sun Jun 05 20:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My message to my brothers and sisters in arms: your mental health is not a battle you have to fight alone. \nhttps://t.co/42WIZUaBRZ","date":"Sun Jun 05 15:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ATTENTION BOATERS: The Coast Guard is considering major changes to the St. Lucie River railroad bridge, and we could see major delays. You can share your opinion with the Coast Guard here: https://t.co/wmsmIlEauc https://t.co/iXZDTwSZ2h","date":"Sun Jun 05 11:38:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Hurricane season is here. For tips on how to make sure your family is prepared and stays safe, visit https://t.co/5nJugg2uiL.\nhttps://t.co/LgorXvwjED","date":"Sat Jun 04 22:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"⛽️ Average gas price on January 19, 2021: $2.38\n\nIn 17 months, Joe Biden has managed to literally double the prices Americans are paying at the pump. #AmericaLast #Bidenflation","date":"Sat Jun 04 17:16:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The World Health Organization actively worked with the Chinese Communist Party to cover up COVID-19 origins. Why should the U.S. give this organization one single dollar?\nhttps://t.co/GC2eNLU06T","date":"Sat Jun 04 14:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden is trying to tout this month’s jobs report, but look beyond the headline: small businesses lost nearly 100,000 jobs in May. \n\nMain Street job creators are the backbone of our economy, and they’re being crushed by every policy put in place by the White House.","date":"Sat Jun 04 00:57:13 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The American people deserved action months ago. How are parents supposed to feed their babies for the next FOUR WEEKS before this hits the shelves? Too little, too late.","date":"Fri Jun 03 23:07:42 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I fight every day to clean up our water so that we never have to get an advisory like this again. Our community does not deserve to be poisoned!","date":"Fri Jun 03 21:57:08 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨A water advisory has been issued for Port Mayaca🚨 \n\nCyanotoxins in algal blooms have been linked to serious illness including liver disease and ALS. Avoid contact! https://t.co/YaUSOzRtuD","date":"Fri Jun 03 21:57:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨 More than 2.6 million illegal immigrants have been encountered at our southern border since Joe Biden took office. This is a huge crisis and the Administration is trying to hide it from the American people.","date":"Thu Jun 02 23:09:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Understatement of the year.\nhttps://t.co/hTGVh6mjvD","date":"Thu Jun 02 20:09:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"REMINDER: the Coast Guard is accepting public comments about these changes until July 5 https://t.co/wmsmIlEauc","date":"Thu Jun 02 14:01:44 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We had a very important conversation this morning at the Stuart Chamber of Commerce about how proposed changes to the St. Lucie River railroad bridge will impact boaters. https://t.co/sB1VAZL86M","date":"Thu Jun 02 14:01:43 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There needs to be a coordinated effort across all levels of government to #SaveTheManatees, including passing the Manatee Protection Act in Congress to re-list manatees as an endangered species and get more federal resources to protect them.\n\nhttps://t.co/YFvn3k2bmq","date":"Thu Jun 02 11:43:54 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"URGENT: The Coast Guard is asking for our community’s opinion on the St. Lucie River Railroad Bridge and its impacts on boat traffic. This will determine if the operations prioritize Brightline rail traffic or boat traffic. Share your opinion here:\nhttps://t.co/wmsmIlEauc","date":"Wed Jun 01 23:41:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Fauci is wasting another $2 million to torture puppies in outdated tests. Congress needs to pass the PAAW Act to defund Fauci's dog abuse once and for all.\nhttps://t.co/i7FZGpQeZ9","date":"Wed Jun 01 22:21:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden is having a record-breaking presidency, but not in a good way.\nhttps://t.co/CER9puCo0L","date":"Wed Jun 01 20:36:51 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden’s foreign policy can be summed up in one word: flailing. https://t.co/EpIJAGviu9","date":"Tue May 31 22:58:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ICYMI: Nikki Fried is talking a big game on water issues, but her record of support for the sugar industry tells us everything we need to know about her priorities. \nhttps://t.co/lJcl4h6L08","date":"Tue May 31 16:18:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"85% of Americans believe that the US is heading towards a recession.\n57% of small business owners think things will be worse next year.\n8 out of 10 Americans say the Biden hasn’t done enough to fight inflation.\n\nBiden broke our economy, and Americans don’t believe he can fix it.","date":"Tue May 31 11:56:13 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As we come to the end of Military Appreciation Month, one more salute to all who have served. I am grateful for all that my time in the Army gave me, especially the opportunity to serve alongside some of the best people I’ve ever met. \nhttps://t.co/4LX6eaU55y","date":"Mon May 30 21:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today, while I hope you are enjoying time with your friends and families, I hope you also take a moment to pause and reflect on who made it possible for you to do so. https://t.co/wCdvUWvvlQ","date":"Mon May 30 14:40:05 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Appreciated everyone who joined us this week to discuss Brightline and what their expansion means for our community. There’s lots of work still to be done to protect our piece of paradise. Sign up here to get updates from my office:\nhttps://t.co/fGHkm027Ue https://t.co/rn53jfXLbL","date":"Sun May 29 19:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Technicalities and loopholes should not keep veterans from the benefits they have earned. I’ve cosponsored @RepJackBergman’s bill to make sure that families receive the financial assistance promised to them after their loved one passes. \nhttps://t.co/YB67ViEqYG","date":"Sun May 29 17:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I was blessed to be the recipient of Helping A Hero’s generosity, so I can say from firsthand experience, this is going to change the lives of Sgt. Fleming, his kids and his wonderful fiancée. Welcome home, Fleming family!\nhttps://t.co/CHoZZy5bFS","date":"Sun May 29 15:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Under Trump, household savings hit record high rates. Under Biden, families are forced to spend them just to afford the basics like groceries. #AmericaLast\nhttps://t.co/QMNTxY8IFT","date":"Sat May 28 23:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Unless they’ve served, no one can understand what those who’ve worn the uniform experienced. That’s why it’s on us, as veterans, to help combat the stigma about mental health. \n\nThis isn’t a battle you have to fight alone. #MentalHealthAwarenessMonth #MilitaryAppreciationMonth https://t.co/SfVJNA6RtJ","date":"Sat May 28 19:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Hurricane season is knocking on our door. Make sure your family is prepared.\nhttps://t.co/w2shRAlxmt","date":"Sat May 28 15:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As Memorial Day Weekend begins, a reminder that this isn’t the “kick-off of summer.” It’s a time to honor all who made the ultimate sacrifice so that we can spend time with our friends and family. Don’t get caught up in the sales or parties and forget the reason for this weekend.","date":"Sat May 28 13:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Diesel prices are up 50 cents from last month and more than $2 from last year. With prices like that, truckers won’t be able to afford to operate and supply chain backups will get even worse.\n\nMake no mistake, this is the direct result of Biden’s war on American energy.","date":"Fri May 27 23:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Veterans are facing a mental health crisis, and it’s on us to look out for each other. Thank you for your work, CSM Satterly.\nhttps://t.co/Qi3Hz9tW64","date":"Fri May 27 22:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Small businesses on the Treasure Coast have lost millions of dollars due to harmful algal blooms. They literally cannot afford another lost summer.  That’s why I’m fighting tooth and nail to make sure toxic water is not flushed into our community.\nhttps://t.co/R0ziCA5oc7","date":"Fri May 27 20:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The world cannot take its eye off of Afghanistan. Without the global spotlight on them, the Taliban will continue to move closer and closer to all-out Shariah law.\nhttps://t.co/ApUU0KZoLY","date":"Thu May 26 23:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inflation 📈\nLikelihood of recession 📈\nU.S. GDP 📉\n\nEverything is trending in the wrong direction. Democrats in Washington need to admit they got it wrong and get back to President Trump’s pro-growth policies.\nhttps://t.co/P4mMRA0sAJ","date":"Thu May 26 21:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We don’t know if the feeding program helped, but we do know that ending toxic discharges would drastically curtail the threat to manatees’ food supply. \nhttps://t.co/rGobEcflkA","date":"Thu May 26 18:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"WATCH THIS: I hosted a community forum in Stuart to discuss the Brightline expansion and its impact on the maritime industry.\nhttps://t.co/khYM1yEaLF https://t.co/qeGUvcQxtl","date":"Thu May 26 16:23:49 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For any parents who are feeling the effects of the baby formula crisis, here are some places to buy it online:\nhttps://t.co/HUkBdVqjN1","date":"Wed May 25 23:09:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Welcome home, Sgt. Fleming. We’re glad to have you as a part of our community. And thanks to @HelpingAHero, Mattamy Homes, @BassProShops and @TheLeeGreenwood for making today the best housewarming I’ve ever attended. https://t.co/stlDJ1Rgml","date":"Wed May 25 20:52:43 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Yes, Lake Okeechobee is in a better starting position than compared to last year, but we can’t get complacent. The only acceptable result is ZERO discharges.\nhttps://t.co/DOQc3UFw0M","date":"Wed May 25 19:55:41 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Baby formula is being flown in on military planes. This is a scene you’d expect out of Venezuela, not Indiana. \nhttps://t.co/J16JaYEIvK","date":"Tue May 24 20:56:11 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"So, will Biden defend Taiwan or not? He is incapable of speaking clearly or giving any degree of certainty to any of the nations who look to the U.S. for leadership.\n\nhttps://t.co/mOvRpSS1uW","date":"Tue May 24 18:00:43 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Nikki Fried is trying to pretend she cares about our water, but her policies continue to put the sugar industry before Floridians.  Check out the latest #LakeOFactCheck: https://t.co/qUvfY2qsvZ","date":"Tue May 24 14:20:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"People that loot and destroy businesses: “peaceful protestors.”\nParents who want a say in their child’s education: “domestic terrorists.”\nThat’s the message liberal school board activists are sending.\nhttps://t.co/aw6V5oVnu0","date":"Tue May 24 12:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Our Resilient Coast and Estuaries Act will make a difference in preserving natural treasures from sea to shining sea.\nhttps://t.co/KMCUI1vvmx","date":"Mon May 23 22:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thanks to rampant pollution &amp; the Army Corps’ mismanagement of Lake Okeechobee, water quality has declined for years. That’s why I fought for $100M in the 2022 Water Resources Development Act for water quality improvement projects in Martin, St. Lucie &amp; Palm Beach Counties. https://t.co/0LiBtOU9qY","date":"Mon May 23 18:25:24 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Sunshine and freedom. Florida is without a doubt the best state in the nation.  California and New York - take notes. \nhttps://t.co/fndi790c1W","date":"Mon May 23 13:22:49 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s #MilitaryAppreciationMonth, and I can tell you with certainty I don’t regret a moment of my time in the military. From teaching me the values that I hope to instill in my kids to getting to work alongside some of the best people I’ve ever met, the Army has made me who I am. https://t.co/BuEUh48nUf","date":"Sun May 22 23:40:08 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The sad reality is the Palestinian Authority isn’t interested in a two-state solution. So why does the Biden Administration keep filling their coffers and enabling a fight against our strongest ally, Israel?\nhttps://t.co/mds2bmw0zr","date":"Sun May 22 14:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"At best, they’re annoying. At worst, these scams cost people thousands of dollars. That’s why I’ve voted in favor of bills like the Stopping Bad Robocalls Act. If you think you’re being scammed, my office can help you contact the Florida Attorney General.\nhttps://t.co/sMmRyB2dJ5","date":"Sun May 22 00:45:39 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"One of the biggest wins for our community in this year’s Water Resources Development Act is the Northern Estuaries Restoration Plan (NERP). My legislation would force the Army Corps to develop infrastructure to end ALL harmful discharges. https://t.co/r5SqmwpR13","date":"Sat May 21 19:33:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This week, we made huge progress towards our goal of ending discharges once and for all! Watch the latest #WeekInReview to learn about what’s in the Water Resources Development Act, plus an update on baby formula and fuel prices. https://t.co/wsSQlviNUa","date":"Sat May 21 15:11:11 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨A federal judge has AGAIN stopped Biden from revoking Title 42, or the “Remain in Mexico” policy. How many times will the judicial branch have to tell him “no” before he finally learns?","date":"Fri May 20 21:57:56 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"💧 $100 million for water quality projects in Martin, St. Lucie and Palm Beach\n💧 A first-of-its-kind initiative to eliminate ALL harmful discharges to the estuaries\n💧 Funding to improve the Indian River Lagoon\n\nWRDA is a WIN for our community.\nhttps://t.co/lsFp3PBf8R","date":"Fri May 20 21:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Florida’s gentle giants are a national treasure. #SaveTheManatees\nhttps://t.co/2EgMG9U1kS","date":"Fri May 20 19:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Does this mean the left’s argument is no longer “abortion is women’s healthcare”?","date":"Fri May 20 17:15:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Good news for freedom-loving Americans everywhere: Joe Biden’s plan to police “disinformation” is dead. We came entirely too close to recreating Orwell’s 1984. https://t.co/46JEe6pd8T","date":"Thu May 19 23:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Unfortunately, this doesn’t come as a shock. Biden’s botched withdrawal enabled our enemies and made the world less safe.","date":"Thu May 19 21:44:28 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Every two years, I fight to include as many priorities for the state of Florida as possible in the W RDA.  This year’s bill includes huge wins for the St. Lucie, Caloosahatchee, Indian River Lagoon and Lake Worth Lagoon.  Check it out:\nhttps://t.co/aefQJZHcJZ","date":"Thu May 19 19:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"JUST NOW: House Democrats forced through legislation to impose socialist price controls on fuel. This is basic supply and demand: we need more supply, not less, and de-incentivizing production means that prices will continue to climb.","date":"Thu May 19 16:24:26 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Well deserved! Congratulations again to Dreyfoos’ Amber Hansen for her first place win in this year’s Congressional Art Competition.\nhttps://t.co/GI3530J0pY","date":"Thu May 19 12:06:12 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"A massive win! The Water Resources Development Act just passed the Transportation Committee with 7 pieces of legislation I wrote, including the Northern Estuaries Restoration Plan &amp; $100mil for new infrastructure to protect the St. Lucie, Indian River Lagoon &amp; Lake Worth Lagoon. https://t.co/tTqKgwOShv","date":"Wed May 18 20:17:05 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"39 Members of Congress – Democrats and Republicans alike – just voted to allow glyphosate (subject of an $11 billion lawsuit settlement for increasing cancer risk) to be sprayed into bodies of water used for drinking water.  \n\nCompletely unconscionable.","date":"Wed May 18 18:59:04 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨 DHS temporarily “paused” the work of the “Disinformation Governance Board” aka the Ministry of Truth. This should only exist in a dystopian novel or maybe a history book about the USSR. I’ll keep the fight going in Congress until this “board” is permanently scrapped.","date":"Wed May 18 17:40:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The federal government is literally poisoning the people that I represent. The U.S. Army Corps of Engineers cannot be allowed to flush toxic water into our community.","date":"Wed May 18 16:28:05 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"HAPPENING NOW: The Transportation and Infrastructure Committee is debating the Water Resources Development Act - or WRDA. This is the single biggest piece of legislation impacting water infrastructure and is crucial in our fight for clean water. \nhttps://t.co/zHY4RJsbmU","date":"Wed May 18 14:15:16 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Socialist price controls are never the answer. If House Democrats are serious about bringing down gas prices, they must end their war on American energy.","date":"Wed May 18 12:19:24 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’ve been sounding the alarm on this for months: not only is the government robbing young people of their future and their chance to serve, they are purging our military of those who are willing to think critically and challenge the process. Disgusting.\nhttps://t.co/sZ4SPIW8v8","date":"Tue May 17 23:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Important news! Tomorrow, the House Transportation Committee will begin consideration of the Water Resources Development Act. This crucial legislation is passed every two years and is vital to the fight for clean water. https://t.co/Rfzhl3rc5H","date":"Tue May 17 20:48:52 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Why is Biden pouring taxpayer dollars into the Palestinian territories to “set conditions for a viable two-state solution” when they've admitted they don’t support it?\n\nHere's the USAID Administrator admitting that the Palestinian Authority wouldn't even try to make it work: https://t.co/WWQs4YgaBl","date":"Tue May 17 19:39:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today, the House Intel Committee is holding the first hearing on UFOs in 50 years. \n\nNo hearings are scheduled on the baby formula shortage or runaway inflation.  \n\nGlad to see House Democrats have their priorities in order. Talk about #AmericaLast.","date":"Tue May 17 14:55:12 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If Democrats in Congress hadn’t pushed through a $1.9 trillion wishlist in 2021, inflation would not be at the levels it is now and our dollars would go further at the grocery store.  \nhttps://t.co/ruPMoz5PYC","date":"Tue May 17 12:00:46 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We’ve seen huge results in the Great Lakes &amp; the Mississippi River fighting harmful algal blooms.\nThanks to my law, the South Florida Clean Coastal Waters Act, Florida will see the same improvements. https://t.co/WToDR8dUdF","date":"Mon May 16 21:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is dire for families in our community and across the country. The Biden Administration should’ve taken action as soon as the first complaint was filed.\nhttps://t.co/VHXBV1zWTl","date":"Mon May 16 18:00:53 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’m on #TruthSocial! Head over and follow @RepBrianMast for updates from Washington and our fight for policies that will put #AmericaFirst.","date":"Mon May 16 12:01:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Initiatives like this are important, but we need to address the underlying cause of the seagrass shortage: rampant pollution and toxic discharges from Lake O.  \nhttps://t.co/x7HkgwMwlz","date":"Sun May 15 20:38:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Congratulations to everyone graduating this year! Sorry that Joe Biden’s supply chain crisis put a damper on your celebration. \nhttps://t.co/8oBOfO2a34","date":"Sun May 15 17:23:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Every day, law enforcement officers put their lives on the line to protect our communities. We owe them a tremendous debt of gratitude. It’s #NationalPoliceWeek, so I hope you’ll join me in thanking our police officers. https://t.co/jtqKVaQG82","date":"Sun May 15 13:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Yesterday, just in time for National Police Week, I had the privilege to give a Capitol tour to some of our police officers from Palm Beach County. \n\nTheir dedication to keep our community safe is an inspiration. I will continue to fight for them in the halls of Congress. https://t.co/l9xTkPREdu","date":"Sat May 14 23:44:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For decades, 13 different federal agencies have failed our community in the fight against toxic algal blooms. We’re one signature away from changing that. https://t.co/RKOAA2lCoa","date":"Sat May 14 18:35:03 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My bill to combat toxic algae passed the House this week with wide bipartisan support.  Watch the latest #WeekInReview video for that and more: https://t.co/ZvPCsJo6nk","date":"Sat May 14 15:00:03 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In the last week, the Biden Administration has:\n\n🤥 Lied about the availability of vaccines under President Trump\n🤥 Lied about Republicans raising taxes\n🤥 Lied about taxpayer-funded crack pipes \n\n…and these are the people that want to police “disinformation.”","date":"Sat May 14 00:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Our nation is under a different kind of chemical attack: fentanyl is pouring across our southern border and claiming tens of thousands of lives. https://t.co/8wRuvFynTV","date":"Fri May 13 23:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My bill, which just passed, will force the federal government to take responsibility for that harm they have caused to our waterways and develop an action plan to combat toxic algal blooms in our community. https://t.co/b7U5mrADIR","date":"Fri May 13 22:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s FDA was aware of problems at the Michigan plant as early as October. They had months to fix this problem, but once again, instead of admitting their mistake, they’re blaming parents for “hoarding” formula. Unbelievable. \nhttps://t.co/glg9Xa6Llo","date":"Fri May 13 20:33:12 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For Florida families, inflation is equal to a $610 line item in their budgets every month. That’s going to put them in the red and force them to make impossible choices like paying the electric bill or buying groceries. The Biden Administration needs to act NOW.","date":"Fri May 13 12:26:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Last year, Biden claimed inflation was temporary and did nothing to fight it. He stuck his head in the sand and now Americans are paying the price, literally. https://t.co/XaXdz0wu77","date":"Thu May 12 23:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Our South Florida Clean Coastal Waters Act is going to make a big difference for our community, and I’m excited to see it become law! \nhttps://t.co/0MXQgLMums","date":"Thu May 12 20:56:11 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Disarming bombs for a living gives you a different kind of bond with your coworkers. Great to see the U.S. Bomb Techs Association on Capitol Hill this week. \n\n(Photo courtesy of @USBTA2016) https://t.co/k4giwVQSw7","date":"Thu May 12 19:13:25 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden’s screw up allowed this to happen. There are still Americans trapped behind enemy lines, women who’ve known freedom &amp; education are now treated as second class citizens, our allies are being murdered.\n\nHe cannot be let off the hook for this one.\nhttps://t.co/RTpibiqyCX","date":"Thu May 12 17:36:41 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Fentanyl is now the leading drug involved in overdose deaths. Securing our border is not just a matter of homeland security, it’s also a matter of saving American lives.\nhttps://t.co/LW2zvyjLar","date":"Thu May 12 14:32:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🍼 Moms and dads can’t find formula for their babies. \n🗣 A new government entity is policing speech. \n🩸 Murder rates have increased by 48 percent. \n\nIn 16 months, Joe Biden has turned America into Venezuela.","date":"Thu May 12 12:38:21 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My bill, the South Florida Clean Coastal Waters Act, passed the House &amp; was sent to POTUS to sign into law! \n\nFor decades, government has mismanaged our waterways &amp; our community’s paid the price. This bill creates the first-ever federal action plan to fight harmful algal blooms! https://t.co/aHIAXCRJau","date":"Thu May 12 00:57:25 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"GREAT NEWS: The House just passed my bill to combat toxic algal blooms - the South Florida Clean Coastal Waters Act.  It will now be sent to the President’s desk to become law! https://t.co/uVoIw28oQy","date":"Wed May 11 21:27:46 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reminder: if Joe Manchin hadn’t put his foot down, Dems in DC would’ve spent another $3.5 trillion &amp; inflation would be worse. \n\nThey don’t care that gas is $4.40/gallon or that parents can’t find formula. Their only goal is keeping the far-left happy by passing a radical agenda.","date":"Wed May 11 17:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"An opinion piece in the WASHINGTON Post is arguing that George WASHINGTON University needs to change its name… \nhttps://t.co/etGt0fqyqG","date":"Wed May 11 15:50:32 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"#Bidenflation shows no signs of slowing down...","date":"Wed May 11 12:47:02 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When parents wanted to know what their kids were being taught in school, the DOJ used the FBI to intimidate and silence them.\n\nWhen pro-abortion activists target and threaten the homes of Supreme Court justices, the DOJ does nothing.","date":"Wed May 11 11:21:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In high school, I was a mediocre student.  At age 36, I graduated with honors from Harvard. The difference was that in between the two, I joined the Army. It’s Military Appreciation Month, and you can be damn sure I appreciate everything the military taught me. https://t.co/0xR6WO6q6g","date":"Wed May 11 00:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Is making a threat against a Supreme Court justice (who the Founders intended to be above the political fray) in order to intimidate them and influence a decision, a threat against our constitutional republic?","date":"Tue May 10 22:59:15 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Will the new Ministry of Truth label this as “disinformation?”","date":"Tue May 10 21:02:16 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"\"‘Does anyone have a clue what (Republican's) plan is to bring down prices?’ said a White House official.\" \n\nDoes anyone have a clue as to what the party that controls the House, the Senate and the White House plans to do to bring down prices?\nhttps://t.co/4T5IOP3IN2","date":"Tue May 10 17:23:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"You don’t need to be an investment expert to know our economy is struggling. You just need to go to the grocery store.\nhttps://t.co/5ZdlP77IUv","date":"Tue May 10 16:32:35 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Congratulations to the winner of this year’s Congressional Art Competition, Amber Hansen from Palm Beach County! Looking forward to seeing her art in the halls of the Capitol, and thanks again to all who participated! https://t.co/tEiCa5USUe","date":"Tue May 10 12:01:27 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Disgusting. Cowardly. Unacceptable. \nhttps://t.co/3Fbl04cXc1","date":"Tue May 10 00:11:10 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"BREAKING: Tomorrow, the House will vote on my bill, the South Florida Clean Coastal Waters Act. \n\nIf it passes, the bill heads to the President’s desk to be signed into law. We are so close to the first-ever federal action plan to reduce harmful algal blooms in our community!","date":"Mon May 09 23:17:34 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Summer’s almost here, which should mean fun in the water with our kids. Unfortunately, the threat of toxic algal blooms looms large again. What the federal government should - at a very minimum - be doing to help ⬇️\nhttps://t.co/UVKCtkIuI5","date":"Mon May 09 12:45:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Woke corporations should not get a tax break to fund procedures that hurt our kids and kill innocent children. \nhttps://t.co/ucbe4UOMUw","date":"Sun May 08 23:23:38 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy Mother’s Day to the love of my life and the best mom in the world, Brianna. Grateful to you each and every day for all that you do for me and our four monkeys. \n\nAnd a happy Mother’s Day to all of the mothers out there. Thank you for everything that you do! https://t.co/j3vjQHb4kv","date":"Sun May 08 12:30:31 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden said “America is back,” but his policies have put America Last.\n\nHis party is the party of open borders. https://t.co/4yoSOo9d8N","date":"Sun May 08 01:00:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The liberal media and Democrats in Congress are trying to create a narrative that the military is a breeding ground for dangerous ideology. Their solution? They are forcing our troops to undergo woke indoctrination, which is an actual radical ideology. https://t.co/WKM9gO6itM","date":"Sat May 07 20:02:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Anyone who is engaging in the pro-life vs. pro-choice debate needs to answer two fundamental questions: when is a life a life, and is that life worth protecting? https://t.co/uVU0DtX9pb","date":"Sat May 07 17:02:06 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"From government red tape and a broken supply chain to skyrocketing gas prices, truckers are being hit from every angle. And if it’s costing more for truckers to transport goods, it costs more for us to buy those goods. \nhttps://t.co/UQTP8k3cLb","date":"Fri May 06 19:03:25 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If the Biden Administration refuses to let go of the unconstitutional power they grabbed during the pandemic and allow society to return to freedom, Congress needs to act.\nhttps://t.co/B3FWbnIwUZ","date":"Fri May 06 17:20:42 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Florida will not allow our country to become 1984.\nhttps://t.co/9JovJzyyP4","date":"Fri May 06 00:17:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Trending in the right direction, but still far short of the total we need. This fight isn’t over until we have #ZeroDischarges.\nhttps://t.co/Q4BSSJCRn7","date":"Thu May 05 22:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The people Biden made the biggest promises to - low and middle income families - have been hurt the most by his policies.\nhttps://t.co/wkXO2ODPpl","date":"Thu May 05 21:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I spent some time behind the counter this morning at RaceTrac.  I heard from employees and owners about the struggles they’re facing thanks to labor shortages and record-breaking inflation. https://t.co/oqgBHMjp3r","date":"Wed May 04 23:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’ve said it before, but I’ll say it again: Biden’s policies encourage people to break the law and the ones who pay the price for those crimes are the border patrol agents. \nhttps://t.co/RtNyyKSJ69","date":"Wed May 04 20:35:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’ll take “Massive Wastes of Taxpayer Money” for $1000, Alex.","date":"Wed May 04 19:35:43 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"National Prescription Drug Take Back Day is this Saturday. Too many who suffer from addiction feed that addiction through their friends’ and families’ medicine cabinets. Find a location near you and safely dispose of your unused prescriptions. \nhttps://t.co/R9wbLlC1nO","date":"Wed May 04 16:54:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Department of Homeland Security can’t control the border, so instead they’re going to hide the truth with their “Disinformation Governance Board.” https://t.co/e1LAvo20sg","date":"Wed May 04 11:51:21 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Degraded water quality continues to hammer Floridians where it hurt. We are forced to continue building expensive infrastructure to counter the effects.\n\nFlorida’s legislature needs to tackle the ROOT CAUSE and stop trying to fix it with bandaids! https://t.co/fPQLnRpQaI","date":"Tue May 03 23:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There’s no doubt in my mind that every heartbeat of an innocent child is worth protecting. https://t.co/jFiHFX98f2","date":"Tue May 03 20:28:27 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As a soldier, I’ve seen what true evil looks like. But as a father, I’ve seen pure innocence. There’s no doubt in my mind that every heartbeat of an innocent child is worth protecting. (2/3)","date":"Tue May 03 14:17:46 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This decision has the opportunity to protect millions of vulnerable, unborn babies, and it is undoubtedly the right one. (3/3)","date":"Tue May 03 14:17:46 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I fought on battlefields to protect the innocent and uphold the Constitution. Abortion does neither. (1/3)","date":"Tue May 03 14:17:46 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Families are struggling to put food on the table and gas in the tank. Joe Biden thinks they’re a punchline. This isn’t a laughing matter. https://t.co/C2Kf8gJZPs","date":"Mon May 02 23:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Algal blooms are an emergency for our community. The government must take responsibility for the harm they are causing.\nhttps://t.co/fUb6UraH2D","date":"Mon May 02 21:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Good news! After calling out the Biden Administration for failing to support our veterans, they heard us and the Park Police will resume escorts for Honor Flight trips beginning June 1.\n\nIt’s ridiculous that these escorts ever stopped. Our veterans deserve to see THEIR monuments.","date":"Mon May 02 20:31:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Are you claiming that the people in charge of the disinformation board are spreading…disinformation…about the disinformation board?\nhttps://t.co/YMYW0IV6Ci","date":"Mon May 02 15:41:30 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"You can watch the full interview here: https://t.co/8EN5JWXIBE","date":"Mon May 02 11:46:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Speaker Pelosi refuses to hold a vote on mask mandates on public transportation, so I’m fighting to force her to put it on the House Floor. https://t.co/9gNOPHOvyI","date":"Mon May 02 11:45:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Decades ago, troops were exposed to Agent Orange while serving in Vietnam. Today, they’re still fighting to force the VA to recognize the negative health effects of those exposures.\n\nWe cannot subject another generation of veterans to that same fight.\n\nhttps://t.co/6t4vVrlZWK","date":"Sun May 01 23:20:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"You can watch the full interview here: https://t.co/8EN5JWXIBE","date":"Sun May 01 22:25:06 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The world is looking to the United States for direction, but Secretary Blinken and the rest of this Administration refuse to offer that leadership. https://t.co/IhMwOwtoOC","date":"Sun May 01 16:58:34 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This week, I had a meeting with a very good girl, Beesly, who was rescued from horrific drug testing. She’s a great advocate for ending all taxpayer funded animal testing and for all of our four-legged friends. https://t.co/0sDJBMFpH0","date":"Sun May 01 12:33:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There’s no issue that I spend more of my time and energy thinking about and working on than the fight for clean water, and I won’t stop until they stop poisoning our communities. \nhttps://t.co/oYYgDqa8WC","date":"Sat Apr 30 21:52:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My wife, Brianna, is the best person in the world. When I was deployed to Afghanistan, she held down the homefront. The same is true for hundreds of thousands of military spouses across the country, and Congress should do more to support them. \nhttps://t.co/fAWX2FWA1E","date":"Sat Apr 30 19:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration needs to fix this huge mistake immediately. Veterans deserve to see their monuments.\nhttps://t.co/vD0yZxP8KX","date":"Sun Mar 27 14:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"From Ukraine to natural disasters to mask mandates, the Biden Administration is clearly not acting in the best interest of American citizens. I’m working to hold them accountable. \n\nWatch the latest #WeekInReview: https://t.co/Gq8UAlQ6Qh","date":"Sat Apr 30 15:00:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration refuses to give any answers to the American people when it comes to Ukraine, but they’ll continue to take our tax dollars to send overseas. Ridiculous. https://t.co/0J2OTxoNNx","date":"Fri Apr 29 23:21:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"West Palm Beach politicians are lying to you. They’re advocating to keep more water in Lake O supposedly for drinking water (*cough* for the sugar industry *cough*) but behind the scenes they’re actively searching for a new source because the water in Lake O has gotten too toxic. https://t.co/prMPExhji8","date":"Fri Apr 29 21:32:55 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’m an Army guy, but even I have to admit that the Blue Angels are pretty awesome. Check them out this weekend!\nhttps://t.co/ikUfLk8FHy","date":"Fri Apr 29 15:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The people who…\n\n🛑 Spent years denying that COVID-19 could come from a lab,\n🛑 Slandered border patrol agents saying they were whipping migrants, \n🛑Dismissed Hunter Biden’s laptop as a Russian plot,\n\n…now want to be the ones policing “disinformation.” \n\nPot, meet kettle.","date":"Fri Apr 29 11:38:55 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"And the third finalist in the Congressional Art Competition is Anashya Etienne, representing St. Lucie County! Thanks again to our judges - with all of this talent, I know you had a tough job. The winner will be announced next Friday. https://t.co/ozub8uJkWr","date":"Fri Apr 29 01:33:39 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’m LIVE on YouTube discussing the latest news: Ukraine, the fight for clean water, more mask hypocrisy and more! Head over now, subscribe and ask your questions in the comments.\n\nhttps://t.co/IoL9h3hPvF","date":"Thu Apr 28 22:40:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joining @SeanSpicer to discuss the failures in Ukraine and Sec. Blinken’s pathetic attempts to justify the Biden Administration’s foreign policy. Tune in now!","date":"Thu Apr 28 22:00:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration is all talk and no action. They are talking tough on Russia but offer no road map as to how they plan to hold Putin accountable for the war crimes committed in Ukraine. https://t.co/rbgovvz95u","date":"Thu Apr 28 21:54:44 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"These girls grew up thinking they would be able to go to school and have careers, but thanks to Joe Biden’s failed withdrawal, those dreams were ripped away from them in less than 10 days.\nhttps://t.co/er8Ge8rsMh","date":"Thu Apr 28 19:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"A “Disinformation Governance Board?” Did Joe Biden miss the day in English class where they explained that 1984 was an ironic cautionary tale? \n \nThis is something you’d read about in a history book on the USSR, it has no place in America.","date":"Thu Apr 28 17:15:44 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When a community gets hit by a hurricane, FEMA steps in to help. But our community is hit with a disaster nearly every summer - toxic algal blooms - and FEMA does nothing. My amendment passed today to get FEMA to recognize harmful blooms as the natural disasters that they are. https://t.co/kwnhNaoIII","date":"Thu Apr 28 16:45:27 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Don't forget to leave your questions here for tonight's LIVE: https://t.co/Tlz9WoQg1Z","date":"Thu Apr 28 13:20:35 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I will be going LIVE on YouTube TONIGHT at 6:30PM to answer your questions and discuss the latest on the fight for clean water, the ongoing hypocrisy about mask mandates and more. \n\nIf you missed the last one, watch the recap here! https://t.co/ri9IvBEo0Q","date":"Thu Apr 28 13:20:16 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden’s policies have managed to do something that even a global pandemic hasn’t pulled off in 2 years: shrink the U.S. economy.\nhttps://t.co/dTMze0OAz2","date":"Thu Apr 28 12:52:12 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We need someone who will stand up for our laws and the men and women charged with enforcing them. DHS Secretary Mayorkas doesn’t seem to be up to the task.\nhttps://t.co/eR4YRFLcle","date":"Thu Apr 28 00:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If we don’t act now, burn pits will become the Agent Orange of my generation. Our veterans deserve better. https://t.co/PmmFFKE6yC","date":"Wed Apr 27 22:30:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"HAPPENING NOW: I’m heading to the House Floor to file a petition to force the Biden Administration to end its ridiculous mask mandate once and for all. DOJ is challenging the court’s ruling, so we need Congressional action to make sure masks on planes don’t come back. https://t.co/3dKxRf6Hzz","date":"Wed Apr 27 20:23:33 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"NEWS: Amber Hansen was selected by our judges to represent Palm Beach Co. in this year’s Congressional Art Competition! There’s so much talent in our communities. Excited to see who will represent the district in the Capitol. The winner will be announced next Friday,  stay tuned. https://t.co/j2sqAB4EAL","date":"Wed Apr 27 18:31:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The rest of Florida uses the Treasure Coast like a septic tank. That’s why I’ve introduced the Northern Estuaries Restoration Program to force the Army Corps to eliminate toxic discharges once and for all. https://t.co/r8QE0LGKqt","date":"Tue Apr 26 23:57:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Trump and Republicans in Congress passed the largest tax cut in decades. Joe Biden and Nancy Pelosi took over and gave every American a pay cut instead. \nhttps://t.co/FPlcOl1vga","date":"Tue Apr 26 19:19:04 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Congratulations to Sophie Araque-Liu for making it to the finals of this year’s Congressional Art Competition, and thank you to our judges for sharing your expertise with our aspiring young artists! https://t.co/TYQsYdU7a8","date":"Tue Apr 26 14:19:25 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Our troops are willing to give their last breath for this nation. Their commander-in-chief is taking that commitment for granted &amp; asking them to risk their for illegal migrants.\n\nSpc. Evans, thank you for your service; you deserved better. https://t.co/vGtdrYf2QA","date":"Tue Apr 26 11:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"“Defund the police” is not just a slogan. It’s a dangerous policy position that is costing officers their lives. I’ll always #BackTheBlue.\nhttps://t.co/yKuPLWIUqD","date":"Mon Apr 25 23:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Grateful to have partners at every level in the fight to clean up our water.\nhttps://t.co/tzAOnRCNQU","date":"Mon Apr 25 22:05:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden's track record of stupid immigration policies invited migrants to break the law, but the ones who pay the price for their crimes are the brave troops &amp; agents on the border, like Specialist Evans who gave his life in service. They deserve more of their \"commander-in-chief.\"","date":"Mon Apr 25 21:39:49 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨Federal courts have ordered that Title 42, the \"Remain in Mexico\" policy, must stay in place. \n\nGrateful that we have a judicial branch that will stand for the rule of law when the leader of the executive branch is too weak and feckless to do it.","date":"Mon Apr 25 21:38:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"How do Hunter Biden’s Chinese cobalt deals fit into a renewable energy strategy? \nhttps://t.co/PmIUNoQ1S6","date":"Mon Apr 25 18:05:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Trump: eliminates IRGC commander Qasem Solemani. \nPresident Biden: removing IRGC from the list of terrorist organizations in order to appease terrorists. \n\n#AmericaLast","date":"Mon Apr 25 12:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reports say that Biden is considering sending VA doctors to the border to treat illegal immigrants instead of veterans. This is completely unacceptable and a slap in the face to American veterans!\nhttps://t.co/39qsjqw0Sw","date":"Sun Apr 24 23:50:08 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Ukrainian people will not allow their country to become the next North Korea or East Berlin. \nhttps://t.co/6icmgXlnTW","date":"Sun Apr 24 15:54:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The science is clear: toxic discharges from Lake O cause harmful algal blooms and intensify red tide. Polluters need to be held responsible, and the Army Corps needs to stop poisoning Floridians immediately.\nhttps://t.co/KdeKnW9xFo","date":"Sun Apr 24 12:48:24 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Proposing to take 80,000 Iranian militants off the sanctions list is 80,000 more reasons why the Biden Administration should not be negotiating with a rogue regime.\nhttps://t.co/87gPLZl8HX","date":"Sat Apr 23 23:09:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s “disturbing” that Fauci doesn’t understand that NO ONE is above the rule of law and the Constitution.\nhttps://t.co/77RS5MsQ04","date":"Fri Apr 22 21:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden says it’s “up to them” whether Americans want to wear masks or not, but his Justice Department is appealing to reinstate mandates on planes. Makes you wonder who’s really running this country, Joe Biden or unelected bureaucrats?","date":"Fri Apr 22 17:02:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Have some good, outdoor fun this weekend to celebrate Earth Day!\nhttps://t.co/ONXgP4Ebjm","date":"Fri Apr 22 15:25:28 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy #EarthDay! It is our job to keep our planet sustainable for generations to come. For Florida, that means restoring the Everglades, sending the water south, and ZERO DISCHARGES! https://t.co/rQHSGbmn2k","date":"Fri Apr 22 13:33:24 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"At every point, the Biden Administration has made the wrong decision and taken the situation at the border from bad to worse. \nhttps://t.co/FTih61U3Ml","date":"Thu Apr 21 21:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Last month, there were 221,303 illegal crossings at our southern border that our officers were able to find. That’s…\n\n❌More than 7,000 crossings per day\n❌About 300 crossings per hour\n❌Roughly 5 crossings per minute\n\nBiden has rolled out the welcome mat on our southern border.","date":"Thu Apr 21 17:29:47 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Doctrine is “negotiate with terrorists.”\nhttps://t.co/hrHPiMUXN6","date":"Thu Apr 21 12:09:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For anyone who needs to hear it: ending mask mandates does not mean masks are banned. Wear a mask, don’t wear a mask - it’s your call.","date":"Thu Apr 21 11:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨BREAKING: Biden’s DOJ announced that it’s going to try to reverse the judge’s ruling and reinstate mask mandates on planes. \n\nWe have to continue to fight for freedom against an Administration hellbent on squashing it.","date":"Wed Apr 20 23:14:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The blame for our economy rests solely on Joe Biden’s shoulders.\nhttps://t.co/VKEwNTfeDM","date":"Wed Apr 20 23:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Tallahassee needs to step it up, listen to the experts and pass enforceable water quality standards. \nhttps://t.co/9ZfPCSZLFv","date":"Wed Apr 20 20:09:09 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Yesterday’s decision confirms what we already knew: the CDC wasn’t basing its mandates on “proper reason,” it was about politics.\nhttps://t.co/bNAWmhG5ch","date":"Wed Apr 20 12:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"About. Damn. Time. \nhttps://t.co/zfitmXESth","date":"Tue Apr 19 22:39:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s like they just can’t help themselves. Anything to hold onto the power they’ve grabbed.","date":"Tue Apr 19 22:32:46 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Freedom: 1\nTyranny: 0","date":"Tue Apr 19 20:59:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@POTUS needs to reverse course on his disastrous energy policies before things get even worse. \nhttps://t.co/B7EiHLxIG4","date":"Tue Apr 19 19:32:26 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨 Victory! The federal Middle District of Florida district court has struck down the CDC’s unconstitutional mask mandate on planes. That means airlines are ending their mandates effectively IMMEDIATELY! Leave it to Florida to pave the way for freedom across the country!","date":"Tue Apr 19 00:52:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Two years later, the People’s House is finally open! https://t.co/PBWyTaaChb","date":"Mon Apr 18 22:00:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Take it from those on the front lines of the border crisis: do not end “Remain in Mexico.” \nhttps://t.co/Kd6TeeZTCe","date":"Mon Apr 18 16:40:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"A reminder that there has been no accountability for Joe Biden’s disaster in Afghanistan. No one has been fired, resigned or even apologized. Someone needs to take responsibility, and that someone is Joe Biden.\nhttps://t.co/oK5WHaN1hH","date":"Mon Apr 18 13:18:53 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Great to see these community traditions back in action after two years of pandemic shutdowns. \nhttps://t.co/Ych0Pkkwty","date":"Sun Apr 17 21:30:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Hallelujah, He is risen! Wishing you all a wonderful Easter filled with love, peace and family. https://t.co/wkMAybGjqs","date":"Sun Apr 17 12:00:02 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ICYMI (not likely if you’ve been to the grocery store lately) the latest inflation numbers show prices are rising at the fastest rate in my lifetime. \nhttps://t.co/sqCkCGGYoU","date":"Sat Apr 16 23:05:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This bill will mandate exactly what the St. Lucie, Caloosahatchee and Lake Worth Lagoon need: zero harmful discharges! https://t.co/shzb9UBDYn","date":"Sat Apr 16 21:30:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reversing Title 42, the “Remain in Mexico” policy, is just the latest in a long line of ass-backwards decisions @POTUS has made on immigration. https://t.co/z8IfyAe9Qz","date":"Sat Apr 16 18:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inspiring! Thank you for all you have done and are doing, Andy. \nhttps://t.co/A91WBGlRAB","date":"Sat Apr 16 14:31:58 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"To all who are celebrating Passover this evening, I hope that you have a peaceful and healing holiday surrounded by friends and family. May you find a sense of calmness and strength. Chag sameach! https://t.co/vRJWgedyiQ","date":"Fri Apr 15 19:46:25 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@pinheadnyc Not sure comparing the Democrat leader of the House of Representatives to a war criminal is the flex you think it is.","date":"Fri Apr 15 19:26:37 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I was personally sanctioned by Russia. Putin is engaging in full-throttled economic warfare. It’s past time that the Biden Administration does the same and quits fighting with one hand tied behind its back.","date":"Fri Apr 15 16:40:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"NERP would be a landmark program to help us reach our ultimate goal: zero discharges. \nhttps://t.co/mk8OYvNFCo","date":"Fri Apr 15 12:42:45 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Russia sanctioned me yesterday. https://t.co/XlKd3VRIAX","date":"Thu Apr 14 22:04:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Comprehensive Everglades Restoration Program (CERP) is important, but it is designed to eliminate only about ⅔ of discharges to the St. Lucie Estuary.\n\nYesterday, I introduced the Northern Estuaries Restoration Plan to stop the remaining discharges that CERP won’t eliminate. https://t.co/7vdJrM8DLI","date":"Thu Apr 14 13:05:26 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Spare me the crocodile tears. You live in a $6 million mansion and instigated riots that caused billions of dollars in damage. You can handle an IRS form. https://t.co/3KScVbSKqt","date":"Thu Apr 14 11:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration needs to do more to get resources and products from A to B faster and cheaper.\nhttps://t.co/JrQYWiSA7n","date":"Wed Apr 13 23:35:53 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@TzareMare You can reach out to my office during normal business hours at 202-225-8398.","date":"Wed Apr 13 20:25:13 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Ed “killed” it here: “The relationship between Lake O and the St. Lucie River is not one that is fair or balanced. It's more like the relationship between a pigeon and a statue.”\nhttps://t.co/XQENkxlDxV","date":"Wed Apr 13 17:38:06 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨TSA extended their mask mandates once again! If COVID-19 is under control enough to re-open the border, why do mothers still have to force masks on their asthmatic toddlers? \n\nAmerica must move beyond these unconstitutional and unscientific mandates.","date":"Wed Apr 13 16:05:30 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"What we are seeing from Shanghai right now is another example of the disastrous side effects of COVID-19 lockdowns.","date":"Wed Apr 13 14:28:03 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"According to Bloomberg, economists predicted that inflation would peak at 7%... But inflation is now at 8.5%! Even they couldn’t predict how bad Biden’s policies would be.\n\nBiden is not capable of getting it in check. He should call President Trump for advice! #BuildBackBroke https://t.co/Uxl85NtnVL","date":"Wed Apr 13 12:41:30 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Our veterans fought for our country, and they deserve to see monuments made in their honor.\nhttps://t.co/AD7RoGrMRX","date":"Tue Apr 12 23:16:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Unacceptable treatment of animals at the hands of the military and government. \nhttps://t.co/etuPInhM1f","date":"Tue Apr 12 21:57:15 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inflation is now 8.5% - the highest it’s been since I was born! Here’s what you need to know: https://t.co/yTCFKTHaB1","date":"Tue Apr 12 16:29:14 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inflation keeps on rising and now it’s at 8.5 percent! \n\nBiden refuses to take responsibility and instead is trying to blame it all on Putin’s war on Ukraine. One look at the data and it’s clear this isn’t #PutinsPriceHike, it’s #Bidenflation. https://t.co/BPav7alaLz","date":"Tue Apr 12 12:53:12 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Did you catch our YouTube Live Q&amp;A this week? Watch a recap here and make sure you subscribe to the channel so you can participate in future events!\nhttps://t.co/oAcpDfBC7E","date":"Tue Apr 12 00:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ROTC cadets and students at service academies are paying a huge price for exercising their right to medical freedom - their entire college tuition. This can’t be allowed to continue. https://t.co/4PZCcX6ni6","date":"Mon Apr 11 15:17:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Is this the future progressives want for the whole country? \nhttps://t.co/kt3x2wz6rC","date":"Mon Apr 11 12:56:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"What the heck is going on in Washington, D.C.? You don’t want to miss this:\nhttps://t.co/v5tzhB4ouu","date":"Sun Apr 10 20:45:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This week, the House passed legislation to collect evidence of Putin’s war crimes. That’s important, but what the Ukrainian people really need now is help ending the war crimes, not a promise of punishment when this is all said and done. https://t.co/JKPEApmffj","date":"Sun Apr 10 17:31:26 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"#IranDeal news: \n\nIf Joe Biden won’t uphold his oath of office, action needs to be taken. That’s why I introduced legislation with @RepScottPerry to ensure he puts the security of Americans first. \nhttps://t.co/dPlOMJAjkZ","date":"Sun Apr 10 15:34:59 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s supply chain crisis has deadly consequences. \nhttps://t.co/wSWS0sQSBg","date":"Sat Apr 09 23:48:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"No animal should ever endure cruelty or torture. Throughout my time in Congress, I’ve fought to end government-funded animal testing, and I’m honored to have been named a @WhiteCoatWaste Warrior as a result. \nhttps://t.co/WKtdlvTPPZ","date":"Sat Apr 09 21:26:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Congress has a bad habit of throwing money at broken programs. Congress has a responsibility to the taxpayer and failed on that front this week. https://t.co/Mcw9QII9oI","date":"Sat Apr 09 17:35:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"What’s going on here?\n\n❌ Removing ROTC cadets over vaccine mandates\n❌ Negotiating with terrorists\n❌ Failing to support Ukraine’s fight for democracy \n\nThe Biden Administration is weakening our military.  Watch the latest #WeekInReview: https://t.co/ZncYvRzYJJ","date":"Sat Apr 09 15:00:01 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Grateful for organizations like a Place of Hope and the work they do to serve our community.\nhttps://t.co/olkCNYG6r1","date":"Sat Apr 09 00:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This shouldn’t even be a discussion. No concessions for terrorists.\nhttps://t.co/SzBNoVxbyo","date":"Fri Apr 08 22:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Another heartbreaking and unacceptable attack on Israel. The United States must stand in solidarity with our important ally and ensure they have the tools to protect themselves.\nhttps://t.co/IyAUXCSabX","date":"Thu Apr 07 20:52:30 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Pelosi - who has COVID - yesterday at the White House. \n\nBut you need to keep wearing a mask on trains and airplanes.\n\nBecause...they say so. https://t.co/XUYoN61UIi","date":"Thu Apr 07 16:42:59 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden is putting Iranian terrorists before the safety of the American people by negotiating a new Iran Deal. House Republicans will do everything in our power to stop him! https://t.co/Q6tFxC52I5","date":"Thu Apr 07 14:02:33 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For far too many families in our community, the fight against glioblastomas is personal. I’ve introduced a resolution recognizing Glioblastoma Awareness Day in honor of Mark Cunningham, a St. Lucie native who lost his battle with this aggressive cancer in 2019. https://t.co/4gwicqFcxo","date":"Thu Apr 07 13:04:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"By repealing the “Remain in Mexico” policy, Biden is saying that COVID-19 is over for the thousands of migrants crowded in detention centers at the border. But it’s not over for the 1.73 million Americans who travel via plane. Time to end mask mandates. \nhttps://t.co/9nqFCFbU6N","date":"Wed Apr 06 23:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Constitution is perfectly clear: any treaty must be ratified by the Senate. Likewise, the Biden Administration should not be able to remove an organization like the Iran Revolutionary Guard from the list of state sponsors of terrorism without approval from Congress.","date":"Wed Apr 06 19:08:13 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s attempts to push a new Iran deal are extremely dangerous and unconstitutional. https://t.co/xPPP3nC9IP","date":"Wed Apr 06 19:08:02 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Obama's Iran Nuclear Deal was bad, but the Biden Administration is going to make it worse. In today’s Foreign Affairs Committee hearing, I asked the Deputy Secretary of State if the weakened position of our military would make negotiations more difficult. She wouldn’t answer. https://t.co/h2KWqVeEag","date":"Wed Apr 06 16:37:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Unexploded ordnances - bombs - pose as much, if not more, of a risk to civilians after fighting stops. Around the world, the US leads the way in clearing these devices to keep people safe. On Mine Awareness Day, I shared my experience with the Explosive Ordnance Disposal Caucus. https://t.co/s155CtTcDz","date":"Wed Apr 06 12:45:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@POTUS is giving President Zelenskyy hundreds of millions of dollars worth of equipment, but won’t give him the one thing he’s asking for: planes. That makes no sense. https://t.co/JRfIaXhlFb","date":"Tue Apr 05 23:48:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"But they’ll still tell you kids (who are least susceptible to serious illness) need to be masked to sit in a classroom.","date":"Tue Apr 05 22:27:14 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’m inspired every day by the Gold Star families in our community. Their sons and daughters were patriots, heroes and selfless defenders of our nation. They have made incredible sacrifices. They understand the commitment to the stars and stripes better than anyone ever could. https://t.co/9AWDPa5W7q","date":"Tue Apr 05 22:08:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We can't let bureaucracy get in the way of what matters most: honoring our veterans. https://t.co/ZxrxK06Bms","date":"Tue Apr 05 15:56:51 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Do you believe President Biden’s decision to repeal Title 42, aka the “Remain in Mexico” policy, will make our country safer?","date":"Tue Apr 05 11:22:05 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When the President is basing his national defense strategy on CNN, not the NSC, our nation is in trouble.\n\nWatch the full interview here:\nhttps://t.co/gwgydAbjHX https://t.co/A9BKfgaTaj","date":"Mon Apr 04 23:45:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Completely asinine. Joe Biden is giving terrorists exactly what they want, just so he can resurrect the Iran Nuclear Deal. @RepScottPerry and I have introduced legislation to stop him.\nhttps://t.co/XYbvuzjnlE","date":"Mon Apr 04 22:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Enough is enough. The Biden Administration needs to give President Zelensky the tools to effectively defend his nation, instead of working in half measures.\nhttps://t.co/YEyiYZQlRD","date":"Mon Apr 04 19:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s out-of-control spending continues to hit Americans where it hurts.\nhttps://t.co/lef95R1dVh","date":"Sun Apr 03 20:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Curious about what the Fed’s interest rate increase will mean for you? Click here ⤵️\nhttps://t.co/buXZBCaakB","date":"Sun Apr 03 13:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨 The CDC was just caught arbitrarily changing Florida’s COVID-19 data. This unaccountable agency can’t be relied on for accurate information.\nhttps://t.co/UjLBehRHsH","date":"Sat Apr 02 23:35:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This week in Washington: \n\nA plan for more spending, even as inflation continues to spike, and an attempt to circumvent the Constitution in search of a new Iran Deal. \n\nAll this and more in the latest #WeekInReview: https://t.co/UBDbNcfMWc","date":"Sat Apr 02 15:00:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thank you @GovRonDesantis for protecting what makes our state great! 17,000 more acres for Floridians to enjoy.\nhttps://t.co/kF7WT4CSbb","date":"Sat Apr 02 12:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"More proof that Fauci worked to cover up the Wuhan lab leak and discredit it as a “conspiracy theory.”\nhttps://t.co/CpeegXmPaA","date":"Sat Apr 02 00:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The CDC is lifting COVID-19 restrictions for immigrants, but Americans still have to wear masks on planes. Show me the science that makes that make sense.\nhttps://t.co/l4TIByYvEn","date":"Fri Apr 01 21:56:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We're going live NOW from Washington DC! Join now to ask questions and hear updates from Congress.\n\nhttps://t.co/4XgS4WcvQm","date":"Fri Apr 01 16:36:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden and Congressional Democrats were driving way over the speed limit with out of control spending, and now, they are leaving it to working Americans to pay the fines for their reckless driving. https://t.co/PxHwtCPz4A","date":"Thu Mar 31 23:31:53 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Israel is constantly under attack diplomatically and domestically. We must continue to stand with Israel.\nhttps://t.co/tYg4nCJNyR","date":"Thu Mar 31 22:32:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thank you @GovRonDesantis for your leadership to protect Florida’s environment!\nhttps://t.co/Qj0DyYQKuC","date":"Thu Mar 31 21:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Pelosi is trying to instill fear in the American people in order to justify billions in spending that 1) isn't needed and 2) is driving up inflation. \n\nLive and enjoy your life! Don't live in fear.","date":"Thu Mar 31 15:29:58 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We are losing our status as the leader of the world, but at least we can use gender “X” on our passports starting next month.","date":"Thu Mar 31 12:45:06 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"You can’t spend your way out of a leadership deficit, but that’s exactly what @POTUS is attempting with this budget. More money, no vision.\n\nWatch the full interview here:\nhttps://t.co/ompIiWaWGW","date":"Thu Mar 31 00:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"You can’t spend your way out of a leadership deficit, but that’s exactly what @POTUS is attempting with this budget. More money, no vision.\n\nWatch the full interview here:\nhttps://t.co/ompIiWsxyu https://t.co/fRy8r06jH5","date":"Wed Mar 30 23:39:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Glad to see funding for Everglades restoration trending upward, but this fight isn’t over until we see the full $725 million needed each year.\nhttps://t.co/OcWjrfDNWV","date":"Wed Mar 30 22:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is why we’re suing the CDC. The airlines agree: it’s past time to end these unconstitutional mandates on travelers.\nhttps://t.co/xpdQ2F3awC","date":"Wed Mar 30 16:33:21 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@boobalou I have been extremely vocally opposed to this bill.  \n\nhttps://t.co/H70Vd5o4tD","date":"Wed Mar 30 14:53:16 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When people in power try to convince you that toxic algae doesn't have any impact on the drinking water supply, you should be highly skeptical. \n\nhttps://t.co/tKG4dRfTAp","date":"Wed Mar 30 14:21:30 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Watch the full interview here: https://t.co/Va1zfnWRa6","date":"Wed Mar 30 13:32:42 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Indecisiveness is weakness. Biden’s flip-flopping is worse than any ‘gaffe.’ https://t.co/cPQaGQgyUH","date":"Wed Mar 30 13:32:36 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’m going to miss Don Young. Sitting next to him on the House Floor and getting to hear his stories has made my last 5 years in Congress exponentially more interesting. Alaska has lost a giant, but his love of the 49th state and his family is a legacy that will live forever. https://t.co/LXvbfOU9HD","date":"Wed Mar 30 01:37:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joining @Stinchfield1776 to talk Biden’s budget and what it means for our military. Tune in now!","date":"Wed Mar 30 00:23:52 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Always appreciate the chance to talk with the future of our military, and this group of @USArmy officer candidates out of @FortBenning was no exception. Great discussion on leadership and the foundations that make our country great. https://t.co/c0QNnhG9EX","date":"Tue Mar 29 19:34:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s economic policies took everything from bad to worse, and made it nearly impossible to blunt the impact of Putin’s war.\nhttps://t.co/DyqLQYo5iw","date":"Tue Mar 29 16:37:01 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For the first time in over 2 years, the People’s House is open to the people. My staff can coordinate tours for up to 15 people. If you’re visiting D.C., drop us a line: https://t.co/R5M53XtzOD https://t.co/iIva6lff4F","date":"Mon Mar 28 22:24:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s borderline Pavlovian - Putin thinks all he has to do is wave his nuclear card and the West will do exactly what he wants. There need to be clear consequences for his posturing.  \nhttps://t.co/srej6awQfg","date":"Mon Mar 28 20:17:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Watch my full interview with @NextRevFNC here: https://t.co/o0JIa9hVwL","date":"Mon Mar 28 16:58:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The West needs to be clear and draw the hardline for Putin: he cannot get away with this and cannot be allowed to slice up Ukraine. https://t.co/aZlgOICqzw","date":"Mon Mar 28 16:58:14 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s energy policy is a slap in the face for working Americans. https://t.co/PgjiODwvdZ","date":"Mon Mar 28 13:05:25 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The resilience of the Ukrainian people has hindered Russia’s attempts to restore the Soviet Union.\n\nNow, it’s the time for President Biden to draw the red line for Putin so that the tragedy in Ukraine does not spill over into the rest of Europe.\nhttps://t.co/TJ19otzGUH","date":"Mon Mar 28 12:40:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Tune in to @FOXNews now! @SteveHiltonx and I are discussing the latest Ukraine news on @NextRevFNC. #MustWatch","date":"Mon Mar 28 01:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration needs to fix this huge mistake immediately. Veterans deserve to see their monuments.\nhttps://t.co/vD0yZxP8KX","date":"Sun Mar 27 14:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"By imposing severe sanctions on North Korea, President Trump and Congress showed what peace through strength looks like.\n\nNow, news of weakness in the White House has made its way to the Hermit Kingdom and North Korea is testing its missiles across Japan.\nhttps://t.co/azhF9R8jNv","date":"Sat Mar 26 22:52:26 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"What do you think about Biden’s plan to sign a new Iran Nuclear Deal? Share your thoughts here:\nhttps://t.co/F7YOL9EldO","date":"Sat Mar 26 19:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@POTUS should take a page out of @ZelenskyyUa’s book. He said if Russians were in Ukraine, they’d be there alone because everyone of his citizens would fight to the death. Powerful words from a true lion of a leader.\n\nWatch the full clip here: https://t.co/5lFJHokUxr https://t.co/IBiAExyDfy","date":"Sat Mar 26 13:44:32 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Stories like Mrs. Jeannaro’s highlight a major problem when it comes to our veterans and the VA. Bureaucracy should not stand in the way of the care that they have earned. That’s why I’ve introduced the END Act. https://t.co/HTo22b6Osx","date":"Fri Mar 25 22:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thanks to @SFWMD for the tour of the 10-Mile Creek Reservoir. This is just one of the pieces to the puzzle when it comes to our waterways, and we need to make sure it’s able to hold the volume of water it was designed to clean. https://t.co/wufyOSwmyQ","date":"Fri Mar 25 19:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"With President Trump in the White House, our adversaries knew exactly what the red lines were and what the consequences would be for crossing them. With President Biden, they know they can continue to push the envelope. \nhttps://t.co/IGR4DBqHa2","date":"Fri Mar 25 18:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s been a month since Putin started a war, and he continues to rain down fire on innocent Ukranians all across their nation. \n\nI break down the situation and why we should #StandWithUkraine ⬇️ https://t.co/3OZ5zbj1WY","date":"Thu Mar 24 21:00:02 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Heartbreaking consequences of Joe Biden’s failures for girls who have grown up in a free society.","date":"Thu Mar 24 18:49:30 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I introduced legislation today to protect veterans and their families from surprise medical bills following emergency care. The END Act is an important piece in ensuring veterans receive the care they have earned. https://t.co/iDhs0Srh9N","date":"Thu Mar 24 16:08:14 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When the Biden Administration fails, Americans step up, just like they did in Afghanistan. \nhttps://t.co/HFDlZrbWGd","date":"Thu Mar 24 00:23:16 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When President Trump nominated a very qualified juror to the Supreme Court, the media spent weeks on end digging up dirt and completely fabricating evidence.  \n\nWhen President Biden nominates a juror, they write about her husband's socks.","date":"Wed Mar 23 16:32:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today supporters of the Iran Deal are blowing up my feed defending RUSSIA'S involvement in the agreement. \n\nIf you are on the side of Iran and Russia, you are on the wrong side.","date":"Wed Mar 23 16:25:55 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"How can you be trusted to make a decision on a Title IX sex-based discrimination case if you don't even know what makes somebody a woman vs. a man?","date":"Wed Mar 23 16:23:47 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If you need emergency care, the last thing you’re thinking about is notifying the VA. Veterans right now are being penalized to the tune of thousands of dollars just because they don’t navigate the bureaucracy fast enough. I’m introducing legislation to change that. https://t.co/m3fAekAl5Q","date":"Wed Mar 23 14:56:59 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Share your opinion on a potential new deal here:\nhttps://t.co/F7YOL9EldO","date":"Wed Mar 23 13:33:31 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Do you believe the Biden Administration should enter into a new Iran Nuclear Deal negotiated by Russia?","date":"Wed Mar 23 13:33:31 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Whether it’s Ukraine or Israel, the U.S. should empower democracies to defend themselves against tyranny. That’s why @RepJoshG and I introduced the Bunker Buster Act to help Israel stand up to Iran.","date":"Tue Mar 22 23:09:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Russia is actively engaged in the negotiations, there’s potential to remove the Islamic Revolutionary Guard Corps as a terrorist organization and Iran dropped bombs near our consulate less than a month ago.\n\nOf course, we would all be skeptical.\nhttps://t.co/4tHhUMj0ZH","date":"Tue Mar 22 16:01:04 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joining @VarneyCo shortly to talk Ukraine and our lawsuit against the CDC’s mask mandate on planes. Tune in!","date":"Tue Mar 22 15:20:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is a headline I’d expect to see out of Venezuela, not the United States. @POTUS’s policies are literally turning our country into a communist dystopia.","date":"Tue Mar 22 14:22:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If Putin is not stopped, this tragedy will not end. https://t.co/rmkZODh17Y","date":"Tue Mar 22 13:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We cannot take our eye of Xi Jingping and China. He’s watching Vladmir Putin and he’s taking notes.\nhttps://t.co/dpPAJFApc0","date":"Tue Mar 22 01:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Not the kind of list you want to be ‘first’ on. More evidence that action is needed in the state legislature to enact enforceable water quality standards and to push back against the sugar industry’s political machine.\nhttps://t.co/o16UY486de","date":"Mon Mar 21 22:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If we’re on the doorstep of WWIII, as some are speculating, it’s because the U.S. abandoned ‘peace through strength’ and failed to rally the world in standing up to Putin. https://t.co/NUNPcQtlC5","date":"Sun Mar 20 21:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There shouldn’t be a single American dollar in Putin’s pocket.\nhttps://t.co/DTWKMaq6pN","date":"Sun Mar 20 17:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I had a great visit with folks at American Legion Post 40. I appreciated the chance to discuss the issues facing our nation with those who have sacrificed to make it what it is today. https://t.co/gtSTbAES5c","date":"Sun Mar 20 13:11:03 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Iran has been on a mission to blow Israel off the map - literally. We need to support our strongest ally and ensure they have the tools they need to defend their right to exist.\nhttps://t.co/50f4zyXtwx","date":"Sat Mar 19 21:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I'll miss my friend, my seat mate in Congress for the last 5 years and his stories and jokes of years past. He was an archive of the history of Congress. His love for Alaska and for his country was equal only to the love he had for his wife and family. Rest In Peace, @repdonyoung https://t.co/waXk1jjNZg","date":"Sat Mar 19 02:30:21 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ICYMI: I’m suing the CDC. If they refuse to “follow the science,” we’ll make them. https://t.co/4lGC8NKUxj","date":"Fri Mar 18 22:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s ironic that Congressional Democrats blamed President Trump when gas hit $2.92 a gallon, but it’s everyone’s fault except for President Biden’s now that it’s at $4.27 a gallon. https://t.co/VOZ0WuPCvS","date":"Fri Mar 18 18:52:03 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Florida legislature has again failed to pass needed reform to protect our waterways. More money alone won't get it done without changes to curb pollution &amp; prevent toxic discharges.\n\nFederal progress is being made but state legislators need to STEP UP!\nhttps://t.co/IUT5zKwtkB","date":"Fri Mar 18 13:20:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is what it looks like on the frontlines of democracy and freedom. \n\nThe United States is supposed to be the leader of the world and a beacon for democracy. We must #StandWithUkraine. https://t.co/C3trzqkkXs","date":"Fri Mar 18 12:45:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"U.S. does the minimum while Ukrainians are indiscriminately killed but if 1 hair on a NATO ally’s head is hurt, our military responds in full force. That doesn’t sit well with me. I know many veterans feel the same &amp; that’s why they’re signing up to serve. https://t.co/UsWtHIA9vv","date":"Thu Mar 17 22:38:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Nope, these aren’t pictures of the Chicago River today. Toxic algal blooms means the water in #FL18 looks that disgusting without adding green dye! Happy St. Patrick’s Day! #SendTheWaterSouth #ZeroDischarges #StopPoisoningUs https://t.co/ORCz9GKvNV","date":"Thu Mar 17 20:58:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The CDC and TSA need to end the mandates. They won’t, so we’re suing. \nhttps://t.co/5NczTZSQoK","date":"Thu Mar 17 18:46:32 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"How can the White House continue to do nothing?","date":"Thu Mar 17 17:45:24 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Zelensky is not asking for American troops to fight his battles for him - he’s asking for the tools so that the Ukrainian military can do it themselves. \n\nWe can’t look back on this moment and say that those who could do the most, did the least.","date":"Thu Mar 17 16:22:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@ZelenskyyUa is on the frontlines - literally - of the fight for democracy and freedom in the world.","date":"Thu Mar 17 16:22:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Watch the full interview here: https://t.co/jBPkEuJVa5","date":"Wed Mar 16 22:17:38 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden agrees that Putin is a war criminal. \n\nWhat’s more important is what is the U.S. going to do to stop him? https://t.co/DvHn5mKSe5","date":"Wed Mar 16 22:17:26 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Look, we’ve seen maternity wards bombed and journalists killed by Russia. Those are war crimes. There is no other interpretation. The only question is what Joe Biden and the international community is going to do about it.","date":"Wed Mar 16 15:39:03 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We don’t need a hearing to answer the question of whether war crimes occurred in Ukraine…yet that’s exactly what Democrats in Congress are debating right now. https://t.co/ga3h6ugKuh","date":"Wed Mar 16 15:38:52 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@ZelenskyyUa is David taking on Goliath, but he needs more than slingshots. The Biden Administration should move immediately to provide him and the Ukrainian people with the necessary equipment to defend their country.","date":"Wed Mar 16 13:43:19 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Watch the full interview here: https://t.co/fPoJsBiO0I","date":"Wed Mar 16 12:34:15 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden says he “can’t do much now” about the prices - that’s a blatant lie. There are steps the federal government could take to lower prices TODAY, but instead he’s spending his time and energy trying to find someone else to blame. https://t.co/T0gTal51vK","date":"Wed Mar 16 12:34:06 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Don’t get distracted by the spin. The EAA reservoir is the single most important project when it comes to cleaning our waterways and delays in construction play right into the sugar industry’s hands. \n\nCheck out the latest #LakeOFactCheck: https://t.co/o8n9kR0vTT","date":"Tue Mar 15 21:30:06 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If the West doesn’t step up, Putin won’t stop in Ukraine. He’ll continue to push the envelope until the U.S. and NATO won’t have a choice. \nhttps://t.co/zmcTcS292w","date":"Tue Mar 15 20:23:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Fox News' Pierre Zakrzewski spent a career documenting and opening the world's eyes to the horrors of war that ultimately took his life. May he rest in peace in a place where there is no pain.\n\nRussia’s war crimes must not go unanswered.","date":"Tue Mar 15 17:09:10 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Americans are being forced to ration their meals, and Joe Biden refuses to admit it’s his fault. Disgraceful. \nhttps://t.co/MXZi8maTLr","date":"Tue Mar 15 15:17:54 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"With Biden as president, Putin has been allowed to dictate what the West does. China’s Xi is going to see that and realize he can do the same. https://t.co/WapsUuZM8P","date":"Mon Mar 14 23:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨I’m suing the CDC over its unconstitutional mandate that Americans stay masked on planes. 🚨 \n\nIf celebrities can go to the Super Bowl and liberal politicians can visit classrooms without masks, you can fly without one also. \nhttps://t.co/4bo8nCPnFV","date":"Mon Mar 14 22:07:45 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’m humbled to be named the Harbor Branch Oceanographic Institute’s 2022 Leadership and Achievement Award recipient. I’m grateful to have them as a partner in the fight for clean water. We #LoveYourLagoon! https://t.co/kwICa9Ktwu","date":"Mon Mar 14 20:36:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The U.S. gets to form pacts with whomever we want. Dictators like Putin don’t get a say.  We should be giving @ZelenskyyUa every tool necessary to defend his country and defend democracy. https://t.co/gH5w9gnynh","date":"Mon Mar 14 15:59:09 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden would rather strike a deal with a dictator like Nicolas Maduro than piss off the far left socialists in his party by increasing American energy production. \nhttps://t.co/v222Pdh6Cy","date":"Sun Mar 13 21:46:24 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden declared war on American energy when he reversed the policies that put #AmericaFirst.\n\nNow, we are seeing the consequences. https://t.co/zujjN8Slw8","date":"Sun Mar 13 13:08:52 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today marks 2 years since the Capitol closed to the public ostensibly because of COVID-19. The time to open the People’s House is long overdue.","date":"Sat Mar 12 23:54:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"“Indian River Lagoon, St. Lucie River score 'F minus' in annual report.”\n\nI’m not surprised, but I am angry. We need leaders in the state legislature to STEP UP!  Garbage bills like SB2508 will only make this even worse. #SaveTheManatees #SendTheWaterSouth\nhttps://t.co/fWg0eEz64W","date":"Sat Mar 12 20:45:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden wants you to believe that this is #PutinsPriceHike, but the President’s war on American energy and the Democrats’ reckless spending sent costs skyrocketing well before Russia invaded Ukraine. \n\nMore on their shameless blame game in the latest #WeekInReview: https://t.co/vmywtvUmBL","date":"Sat Mar 12 16:00:02 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reminder: Putin is a war criminal. \n\nHe should be tried for slaughtering hundreds of innocent Ukrainian civilians. https://t.co/jWkZKwxJaB","date":"Sat Mar 12 00:56:40 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Ukrainians aren’t sheep. They do not want to be a part of Russia and will not accept a communist war criminal as their leader. And that’s why Putin will never hold a single city in Ukraine.","date":"Fri Mar 11 19:42:35 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It doesn’t matter the policy - it’s never Joe Biden’s fault. \n\nHe said in his inaugural address he would admit when he makes mistakes, but I’ve lost track of how many times he’s broken that promise. \nhttps://t.co/s7s3cuskg2","date":"Fri Mar 11 13:48:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Can the Biden Administration finally admit that “transitory” inflation isn’t transitory? https://t.co/9FuAi5qr7n","date":"Thu Mar 10 23:48:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Our path to victory is energy independence. In addition to suspending energy imports from Russia, we need to invest in key infrastructures to produce energy made here in the U.S. President Biden, put America first.","date":"Thu Mar 10 20:18:36 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"A big step forward for the South Florida Clean Coastal Waters Act! Thanks to @SenRubioPress leadership, the bill has unanimously passed the Senate!\n\nI’m sponsoring this legislation to require the first-ever action plan to reduce harmful algal blooms in Florida.","date":"Thu Mar 10 13:52:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When you’re paying more than $4 per gallon at the pump, remember that Biden’s war on American energy is just as much to blame as Putin’s war on Ukraine. https://t.co/eceaJ4Y0I6","date":"Wed Mar 09 23:30:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As a reminder, less than 2 years ago, the United States didn’t even recognize Maduro’s dictatorial government as the leaders of Venezuela. Now, President Biden is trying to do business with him under the table.","date":"Wed Mar 09 21:07:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Florida stands with Ukraine and all who fight for freedom.\nhttps://t.co/GDWCZ4wMmP","date":"Wed Mar 09 13:53:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In the words of @ZelenskyyUa, he needs ammo, not a ride. \n\n@POTUS must work with NATO to get the Ukrainians the supplies they need. \nhttps://t.co/g24sjEyoGa","date":"Tue Mar 08 23:47:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"#InternationalWomensDay","date":"Tue Mar 08 19:57:17 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Places we should get energy from: United States, Canada (via the Keystone XL Pipeline)\nPlaces Biden is trying to get energy from: Venezuela, Iran, Saudi Arabia\n\nU.S. energy independence is a national security issue.","date":"Tue Mar 08 18:47:04 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Just a thought… what if instead of trading one psychopathic leader’s business for another, we increase U.S. energy production. \nhttps://t.co/bKldYos5KE","date":"Mon Mar 07 23:49:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is Putin’s war. My prayers are with the courageous Russian people who are willing to put their freedom on the line in order to stand up for their neighbors. \nhttps://t.co/iktioE0F43","date":"Mon Mar 07 20:27:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Wonderful to see so many people come to honor the life and legacy of Trooper Bullock. His example of service will never be forgotten, and I was honored to write the bill to rename the post office in Port Salerno in his honor. https://t.co/KYbHZJtzXc","date":"Mon Mar 07 18:02:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The murder of innocent civilians on a massive scale is not just war. It’s genocide. The international community needs to ramp up the pressure and make sure that Putin is dealt with like the homicidal dictator he is.","date":"Mon Mar 07 13:01:42 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Let’s go Tigers!\nYou’ve brought the state title back to where it belongs - Stuart!\nhttps://t.co/wfM8hErOPu\nate-title-since-1979/9383354002/","date":"Mon Mar 07 02:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We can’t wage economic warfare with one hand tied behind our back. We need to hit Putin hard, and we need to hit him now.  That means leading the world in a boycott of Russian energy. https://t.co/NIv5mbORdq","date":"Sun Mar 06 22:53:59 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This week the Transportation and Infrastructure Committee passed my amendment to protect the right of way for boaters going under the St. Lucie Railroad Bridge. Learn more here:\nhttps://t.co/KEo4alcyH0","date":"Sun Mar 06 15:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Not a single taxpayer dollar should be going to Russia, but certainly not to fund cruel and unusual experiments on animals.\nhttps://t.co/NL20BeWY6e","date":"Sat Mar 05 23:44:14 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"“Our military give their lives to stop them.”\n\n“We need planes.”\n\n“Please help us and please don’t allow our brave and strong people, many times smaller than Russia, to be exterminated.”","date":"Sat Mar 05 16:50:52 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@ZelenskyyUA made it clear to me today that…\n\n“Russians go into the city and take all the groceries so people will starve.”\n\n“There are 50 dead kindergarteners.”\n\n“They’ve targeted 6\nnuclear units. Chernobyl was 1. Russians don’t care if it melts down and destroys Europe.” https://t.co/SwXkD5QKme","date":"Sat Mar 05 16:50:44 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Russia invades a sovereign nation in a move unlike anything we’ve seen since World War II, but Joe Biden’s response in the State of the Union fails to meet the moment. \n\nAll this and more in the latest #WeekInReview ⬇️ https://t.co/QsrGHknyLy","date":"Sat Mar 05 16:00:01 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The only way to respond to Putin’s complete and total commitment to this war is with our own complete and total commitment to cut Russia off from the world. https://t.co/34HktozfA2","date":"Fri Mar 04 23:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Dependency on Russian oil means complicity in Russian atrocities. https://t.co/0QHd9uvD3o","date":"Fri Mar 04 21:07:32 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Trooper Bullock was a hero and now, this post office will serve as a reminder of his commitment to service and to his neighbors for the entire Port Salerno community. https://t.co/R0s4hdPrNf","date":"Fri Mar 04 16:55:16 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy birthday to the greatest state in the Union. 177 years of the Sunshine State! https://t.co/BQAAeD8PTU","date":"Fri Mar 04 01:43:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Burn pit exposure is the Agent Orange of my generation, but I don’t want to see others go through the fight Vietnam veterans were forced through when it came to getting the treatment they need. This bill is a step in the right direction.","date":"Fri Mar 04 00:14:51 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"🚨 The House passed the Burn Pit Transparency Act today as part of the Honoring Our PACT Act. I co-authored this bill with @RepTimRyan because it’s crucial that we track exposure to burn pits so exposed veterans can get the care they need.","date":"Fri Mar 04 00:14:51 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If we CAN do the most, we MUST do the most.\n\nAs Americans, we need to stand up for humanity. We need to stand with Ukraine. https://t.co/wpkY5pI8pX","date":"Thu Mar 03 23:14:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Florida Highway Patrol Trooper Joseph Bullock was fatally shot in the line of duty in 2020. To honor him, President Trump signed the bill I introduced to rename the post office in Port Salerno as the Joseph Bullock Post Office Building. (1/2)","date":"Thu Mar 03 21:35:06 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Tomorrow, all are welcome to join the Port Salerno Office Renaming Dedication to honor him at 11AM. The ceremony is taking place at 4755 SE Dixie Hwy, Port Salerno, FL 34992. (2/2)","date":"Thu Mar 03 21:35:06 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There’s no reason that over 500 politicians can sit maskless in the same room on Tuesday, but millions of Americans have to wear a mask to take a bus to work on Wednesday.\nhttps://t.co/MhX8xPtkJa","date":"Thu Mar 03 19:48:44 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In 2015, a year after Putin forcefully annexed Crimea, President Obama thanked him for his role in the Iran nuclear deal. \n\nHistory cannot be allowed to repeat itself. Stop the so-called “nuclear deal” that only emboldens Iran and Russia now. https://t.co/1wmAuCOrGb","date":"Thu Mar 03 15:47:02 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Putin’s actions must be met with a worldwide commitment to reject Russian energy immediately and for generations to come. https://t.co/YhUDgxvzi7","date":"Thu Mar 03 00:34:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden was elected to find solutions, that’s not what we heard from him last night. https://t.co/Pl0XahhY0q","date":"Wed Mar 02 22:28:33 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@SLeeC46 @lwhite2112 @KyleMartinsen_ Kandahar.  My legs are still there.","date":"Wed Mar 02 19:53:08 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s energy policies are empowering a war criminal. \n\nWhen we import Russian gas, we give Putin cash.","date":"Wed Mar 02 18:11:58 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The House Foreign Affairs Committee is meeting today for the first time since Russia invaded Ukraine. Watch now ⬇️ https://t.co/4NIW5OqBTK","date":"Wed Mar 02 17:06:43 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is the same guy who checked his watch when 13 flag draped caskets arrived at Dover. Anyone who doesn't \"have the time\" for our troops does not deserve the title \"Commander-in-Chief.\"","date":"Wed Mar 02 16:02:41 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Tonight, Joe Biden didn't say the one thing he should have: sorry. When he was elected, he promised to admit when he made mistakes, but he refuses to admit that his policies have made our country less free, less secure and less prosperous. #SOTU https://t.co/Oe78z0jtEe","date":"Wed Mar 02 05:19:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The State of the Union:\n📈 High gas prices \n📈 High number of illegal border crossings\n📈 High crime rates\n\n📉 Low confidence in the White House among Americans and our allies\n\n#SOTUinCrisis","date":"Wed Mar 02 03:09:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden has clearly seen the statistics: record breaking crime across the country. But the American people won’t forget that his is the party of “defund the police” that led to the robberies, murders and carjackings. #BackTheBlue #SOTU","date":"Wed Mar 02 02:53:38 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Trump and Operation Warp Speed developed three vaccines at a record-breaking pace. President Biden developed unconstitutional mandates.\nOne of those helped us beat #COVID. (Hint: it’s not the mandates.) #SOTU","date":"Wed Mar 02 02:46:40 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Mr. President, you know that Xi is watching the coverage of Ukraine. You know that actions speak louder than words. If you want to get tough on China, get tough on Russia. #SOTU","date":"Wed Mar 02 02:26:26 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden does not understand what inflation is doing to families in Florida or anywhere else in the country. If he did, he would not be advocating for far-left policies that will exacerbate the problem.","date":"Wed Mar 02 02:24:17 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The first thing that President Biden should have done was reverse his energy policies and lead Western nations in ensuring that the next generation is not dependent on Russian natural resources. Canada has made that commitment, why hasn’t the U.S?","date":"Wed Mar 02 02:18:39 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Putin cannot be allowed to set the terms of this fight. He is a thug and a bully, and he cannot be allowed to hold the rest of the world hostage.","date":"Wed Mar 02 02:13:23 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The State of the Union - and the state of the world - has changed dramatically in the last six days. President Biden’s speech needs to reflect that. Now is the time for him to offer real solutions, not take a victory lap he doesn’t deserve.\n#SOTUinCrisis https://t.co/YIIfhRWYRd","date":"Wed Mar 02 01:15:34 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We know what he has done.  That's precisely why we don't appreciate it.","date":"Tue Mar 01 22:32:43 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We do not want to look back on this moment and say ‘those who could do the most, did the least.’ https://t.co/WI4proZA8n","date":"Tue Mar 01 22:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Masks down, fences up. \n\nI’m sick and tired of @SpeakerPelosi using the People’s House as a political prop. Getting rid of masks just in time for the State of the Union and putting the fences back up are decisions made based on politics, not safety. https://t.co/A4vMB2x8y4","date":"Tue Mar 01 20:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When times get tough, people step up. \nhttps://t.co/DrmTKyUdqV","date":"Tue Mar 01 17:59:01 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is what leadership looks like. \nhttps://t.co/LhkDru0EYY","date":"Tue Mar 01 16:29:41 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Tonight, @POTUS will deliver his State of the Union address. What do you think he should discuss? \nhttps://t.co/WpJvV1VKo3","date":"Tue Mar 01 14:03:51 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Putin’s nuclear saber-rattling means the west must stay united against Russia. https://t.co/CuCldH43gw","date":"Tue Mar 01 00:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Putin should be tried as a war criminal. Slaughtering hundreds of innocent Ukrainian civilians cannot go unpunished.\nhttps://t.co/V6nF8zbTrM","date":"Mon Feb 28 20:02:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Putin is pure evil and must be stopped. Try him as a war criminal!","date":"Mon Feb 28 19:00:24 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Покажіть ім, що таке пекло - Show them hell.\n#Ukraine, we are with you. \n@ZelenskyyUA @Vitaliy_Klychko https://t.co/JTSbWRSMlI","date":"Mon Feb 28 18:51:16 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is good news, but manatees need a permanent solution not a band aid. #SendTheWaterSouth #StopToxicDischarges\nhttps://t.co/MPZtTgcls3","date":"Sun Feb 27 14:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The world is going to be facing an enormous humanitarian and refugee crisis in the coming weeks. Grateful for the generosity of Floridians who are stepping up to help.\nhttps://t.co/r3M8LlK8Bn","date":"Sun Feb 27 00:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Project Dynamo is doing incredible work.\nhttps://t.co/ZZ5cBYeth5","date":"Sat Feb 26 22:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@ZelenskyyUa you are a true leader. Unlike the exiled coward of a president, Ghani, and others who fled Afghanistan, you have the backbone and grit to stand with your people and meet the enemy in combat. Give them hell, sir! #StopRussianAggression #UkraineUnderAttack https://t.co/0vpd8G29Yi","date":"Sat Feb 26 17:59:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Xi only stands to benefit from Putin’s success. It’s naïve to think he would be on our side. \nhttps://t.co/eQgiIhf6Af","date":"Sat Feb 26 15:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In 2018, President Trump warned NATO that the EU buying Russian oil and gas would only embolden Putin. He said these “countries have to step it up, not over a 10 year period, they have to step it up immediately.” \n \nHis predictions were right.\nhttps://t.co/o09617EjhO","date":"Sat Feb 26 00:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I've said time after time that Putin’s worst nightmare is Ukraine's full NATO membership. Failure to even put that option on the table led Putin to think Ukraine is his to take. https://t.co/z48daVuJH9","date":"Fri Feb 25 22:24:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Why are some people so eager to cover up for Joe Biden’s mistakes? They should quit lying about the EAA reservoir and help us get it the funding it needs.\n \nThe latest #LakeOFactCheck ⬇️ https://t.co/TjhxEEI3S4","date":"Fri Feb 25 19:37:40 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"People of Ukraine are fighting tooth and nail for freedom and democracy. They are taking up arms and sending a strong message to the world that a thug will not drag their country backwards without a fight. #UkraineUnderAttack #StopRussianAggression","date":"Fri Feb 25 16:05:40 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Abandoning the policies of peace through strength, border security, energy independence, and a self-reliant supply chain was not in the national or global best interest and led to catastrophic foreign policy failures as well. https://t.co/bqf5yYjoyK","date":"Thu Feb 24 23:19:06 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I had the opportunity to meet with Afghan refugees yesterday.  For these children, democracy was all they had known, and it was ripped away from them in a matter of days. We need to take action now before Ukrainian children experience the same. https://t.co/OeY7qrr4C3","date":"Thu Feb 24 18:39:46 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The world (and China in particular) is watching how the United States reacts to what is happening in Ukraine.  \n\nThere will be far-reaching geopolitical consequences and very personal consequences for the people of Taiwan.","date":"Thu Feb 24 16:04:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Putin once said the collapse of the Soviet empire was the “greatest geopolitical catastrophe” of the past century for Russia.\n \nFor America, President Biden may be the greatest geopolitical catastrophe of this century.","date":"Thu Feb 24 14:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Nonetheless, our country must now be united in helping our leaders find the strength needed to confront this challenge because China, Iran and North Korea are all watching, and a premeditated, unprovoked act of war cannot stand.","date":"Thu Feb 24 12:57:21 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There's no doubt that weakness leads to war. Abandoning the policies of peace through strength, border security, energy independence and a self-reliant supply chain was not in the national or global best interest, and it has led to catastrophic foreign policy failures as well.","date":"Thu Feb 24 12:57:21 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The US and our allies must draw a red line and make it clear that this act of war will not be tolerated. (THREAD)","date":"Thu Feb 24 12:57:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I am calling for the House Foreign Affairs Committee and Senate Foreign Relations Committee to hold an immediate, emergency joint meeting to implement policies to isolate Vladimir Putin and force him to remove his forces from sovereign Ukraine.\n\ncc: @HouseForeign @SenateForeign","date":"Thu Feb 24 12:57:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I met with Afghan refugees today. They saw their lives turned upside down in a matter of days: girls banned from school, families uprooted and futures uncertain at best. Now, with Putin’s invasion, the Ukrainian people are facing a similar fate.","date":"Thu Feb 24 12:57:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Stories like Christine’s are all too common in 2022. That’s why we need to return to pro-growth solutions instead of Joe Biden’s out-of-control spending.\nhttps://t.co/we5yWEzLdq","date":"Thu Feb 24 00:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Crime is on the rise and senseless mandates are only making it worse.\nhttps://t.co/I0EqQnu292","date":"Wed Feb 23 22:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If you think Xi isn’t watching the world’s response to Putin, you are sorely mistaken. \nhttps://t.co/AZAHqeWdb9","date":"Wed Feb 23 19:49:48 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden has set off a chain of dominoes that led to this point. We may not be able to restack them. https://t.co/SSmXx79hXM","date":"Wed Feb 23 00:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Floridians continue to pay the price for Biden’s policies. \nhttps://t.co/MILA55Rvu7","date":"Tue Feb 22 22:35:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Genocide and COVID-19 cover-ups are bad for ratings, who’s surprised?\nhttps://t.co/DAEvZCTd30","date":"Tue Feb 22 19:51:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s past time for the ‘swift and firm response’ the Biden Administration promised. Putin cannot be allowed to steamroll sovereign nations. Permanently end Nord Stream 2 and impose sanctions that will hit Russia where it hurts.","date":"Tue Feb 22 17:42:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I had the honor and privilege of speaking to our next generation of heroes.\n \nThey all do our service members proud! https://t.co/hH0dGZkks3","date":"Mon Feb 21 22:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy Presidents’ Day. Our nation has been guided by many extraordinary leaders with great vision for the American people. Without them, we would not be the world leader we are today! https://t.co/pkhVMFJRKt","date":"Mon Feb 21 15:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Whether it’s New York or Toronto, we must not take freedom for granted. https://t.co/ZeKSU4YeHf","date":"Sun Feb 20 23:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We need a long-term solution that cleans up our water not another band aid on a gaping wound.\nhttps://t.co/9Dx9tHLsOm","date":"Sun Feb 20 20:11:44 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thank you, Cole. There’s not a day that goes by that I don’t hear from a fellow brother or sister in arms who is struggling after service. We have to look out for each other.\nhttps://t.co/uLQjyUfHhu","date":"Sun Feb 20 16:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If Gavin Newsom can go maskless at the Super Bowl, you can go maskless on your morning commute.\nhttps://t.co/O2EXvRmzbE","date":"Sat Feb 19 23:07:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Every state is a border state, but that’s especially true for Florida. https://t.co/lWwwhZHf4R","date":"Sat Feb 19 16:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inflation cost the average American family $5,000 last year. \nhttps://t.co/AKIhpUuDZo","date":"Sat Feb 19 00:34:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"She can choose to wear a mask - I’m going to not wear a mask. Thank God for freedom in the United States.\nhttps://t.co/qK3nhXH613","date":"Fri Feb 18 22:19:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Parents are crucial to our kids’ education.","date":"Fri Feb 18 18:55:09 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Jim Hagedorn was a great friend of mine who had a tremendous love for the country and for his state Minnesota. I will miss Jim - may he rest in peace.","date":"Fri Feb 18 17:40:12 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s been reported that our servicemembers spent roughly 6 million man-hours on “woke” training. In that time, the Taliban took over Afghanistan, 2 million illegal immigrants were encountered at the border and Russia and China moved closer to war.\nhttps://t.co/A52ik5OGHX","date":"Fri Feb 18 01:00:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thanks to Officer Trevor Horten for 18 years of service with the Port St. Lucie PD. For almost two decades, he’s worked every day to keep our community safe. https://t.co/p69OkfU8B8","date":"Thu Feb 17 21:33:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If the U.S. and NATO take their eye off the ball, Ukraine will be a replay of Crimea. https://t.co/rSLEeIIQc9","date":"Thu Feb 17 18:58:54 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Fauci going down with the ship on this harmful, unhealthy mandate.","date":"Thu Feb 17 17:17:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s energy policy + Biden’s foreign policy = more $ at the pump \nhttps://t.co/z5iQHWdZ12","date":"Wed Feb 16 23:44:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@HillaryClinton https://t.co/LvfloYckqE","date":"Wed Feb 16 23:38:58 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Americans stand for freedom! \nhttps://t.co/rXDFx7ZNTn","date":"Wed Feb 16 19:48:04 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We knew Nancy Pelosi wasn’t following the science, but I guess she’s ignoring math now too. \nhttps://t.co/BoUix5IiJK","date":"Wed Feb 16 14:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"6 months ago, the world watched in horror as people clung to planes at Kabul International Airport. 6 months later, and no one in the Biden Administration has been held accountable. I’m fighting to change that. https://t.co/vTkb2R3OtY","date":"Wed Feb 16 00:19:27 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s withdrawal from Afghanistan, his disastrous energy policies and his incompetence at running our country - it’s all contributed to what we’re seeing in Ukraine. https://t.co/LX3fUZg9Ja","date":"Tue Feb 15 21:52:30 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"But more than that - the Democrats in Congress who have spent the last 6 months helping him cover up his failures should be ashamed of themselves. I hope every time they look at me, they are embarrassed by their own cowardice.","date":"Tue Feb 15 16:49:08 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today marks 6 months since the fall of Kabul and more than 11 years since I lost my legs to a bomb planted by the Taliban. Clearly, Joe Biden failed us and our allies. https://t.co/b6g6EJhGVe","date":"Tue Feb 15 16:49:08 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s weakness in Afghanistan has given Putin a roadmap to invading Ukraine.  I joined @FoxNews this weekend to discuss: https://t.co/WXuEqEtZEN","date":"Mon Feb 14 22:46:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden is recycling the same failed script. The Taliban didn’t believe him, so why should Putin? https://t.co/Qb4m0kcEza","date":"Mon Feb 14 19:31:39 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Governor DeSantis is fighting back against members of the Florida legislature that want to reserve Florida’s water for the sugar industry.  We need to back him up!\nhttps://t.co/uoqVKom8YF","date":"Mon Feb 14 00:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Police officers’ jobs are tougher than ever. Crime rates and murder of law enforcement are on the rise. I’m cosponsoring the Protect and Serve Act to push back on dangerous “defund the police” rhetoric and punish those who target officers with violence.\nhttps://t.co/r4lBX19dc7","date":"Sun Feb 13 19:58:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"But it’s clear @EnesFreedom isn’t in it for the money.  He knows the meaning of life: serve something more important than yourself and you live with 0 regrets, no matter what it costs you. You are bigger than the NBA!","date":"Sun Feb 13 14:40:46 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@Nike made @Kapernick their poster child for kneeling during the National Anthem and gave him a multi-million dollar contract. Let’s see if they offer @EnesFreedom a similar reward for speaking out against China.","date":"Sun Feb 13 14:40:45 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"First Biden’s supply chain crisis made Thanksgiving more expensive, then Christmas, now the Super Bowl… how many more times will he let this happen?\nhttps://t.co/OsZfEn7MCv","date":"Sun Feb 13 14:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Not only is discharging 3,000+ troops over vaccine mandates bad policy, it’s fundamentally un-American.\nhttps://t.co/d3zV0ArkHy","date":"Sat Feb 12 20:20:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Friendly reminder to my friends in Congress: this isn’t your money to blow.  It belongs to the taxpayers. https://t.co/JWAeBwKwLT","date":"Sat Feb 12 16:00:01 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thankful to have a governor who fights for our waterways.\nhttps://t.co/1rDeuEobHD","date":"Fri Feb 11 23:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"At what point do the pro-lockdown Democrats admit they made a mistake?\nhttps://t.co/dMFcr0D25u","date":"Fri Feb 11 19:11:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden left Americans behind enemy lines so that he could throw a celebration on 9/11. He literally played politics with their lives. \n \nAction is needed to get these people home to their families.  In the meantime, please pray for their safety.\nhttps://t.co/PQmgcl1ZDL","date":"Fri Feb 11 16:39:32 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Men and women in uniform defend our rights to freedom and privacy, but they lose their jobs for exercising those same rights? Another ass-backwards Biden policy. https://t.co/iBqaSwPTJU","date":"Fri Feb 11 13:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden has managed to make Jimmy Carter look good. #Bidenflation","date":"Thu Feb 10 18:05:59 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Is the Florida Legislature going to side with Joe Biden, who is blocking funding for the EAA reservoir and delaying the project, or with @GovRonDeSantis, who is increasing funding and accelerating construction?  It's a binary choice, and it shouldn't be a hard one.","date":"Thu Feb 10 17:40:11 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Florida Senate Bill 2508 would be a death knell to the St. Lucie and Caloosahatchee - guaranteeing toxic discharges for decades to come. This bill must be stopped at all costs! https://t.co/IGL4QvuPEt","date":"Thu Feb 10 17:25:04 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@SpaceForceDoD was formed by President Trump to protect the USA from above and beyond. I am looking forward to hanging this seal on my wall with those from our other Armed Forces. https://t.co/94ADAh5etL","date":"Thu Feb 10 14:04:40 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I will not stop fighting to get the funds needed to build the EAA Reservoir. #SendTheWaterSouth\nhttps://t.co/KkWHqqa4Yk","date":"Thu Feb 10 01:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Genocide and COVID-19 coverup are not the Olympics spirit.","date":"Wed Feb 09 23:35:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s so easy to sneak into the United States under President Biden that they’re flying to Mexico from all over the world to do it.\nhttps://t.co/ZTV6e1h5Y8","date":"Wed Feb 09 22:15:13 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Don't let the media trick you into thinking that Democrats in DC are backing off efforts to defund the police.  They're charging ahead full steam.","date":"Wed Feb 09 15:49:39 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Blue state governors are finally starting to see the light and ending ridiculous mandates.  Somebody ought to tell @POTUS. \nhttps://t.co/JTN3gZAivw","date":"Wed Feb 09 00:02:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Improving Florida’s waterways is the most important issue for our community, which is why I’m continuing the fight to #SendTheWaterSouth and #StopToxicDischarges in the Transportation and Infrastructure Committee today. https://t.co/4on4uXhWuE","date":"Tue Feb 08 17:56:08 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@GovRonDeSantis Even CNN recognizes the brutal reality that our law enforcement officers are facing. \"Defund the Police\" rhetoric is costing selfless men and women in uniform their lives.\nhttps://t.co/3z2U9R5Isb","date":"Tue Feb 08 17:18:32 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"2021 was the most deadly year for our law enforcement officers since 2001. This is what happens when megacity councils cave to the demands of mobs chanting “Defund the Police”. \n \nWith @GovRonDeSantis, Florida will always #BacktheBlue","date":"Tue Feb 08 16:35:35 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s a ‘moral obligation’ until Nancy Pelosi would have to slum it with the rest of us.\nhttps://t.co/StcXXLUGSC","date":"Tue Feb 08 14:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Unmask our kids. NOW. https://t.co/HyNjQaEjOC","date":"Mon Feb 07 23:16:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden's vaccine mandate for the military is making America less safe. Today, I'm introducing a bill to empower these Members of the military that he has discriminated against to rejoin at their existing rank! https://t.co/VUIJekxIhB","date":"Mon Feb 07 20:45:11 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Excuse me, what?  The crap they bury in these bills just keeps getting crazier...\n\nYou can count on me to be a STRONG NO.","date":"Mon Feb 07 19:34:13 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Speaker Pelosi showed just how weak she is when she directed American athletes to cower in fear of Chinese censors.  We must not back down to China’s attempts at intimidation! https://t.co/PcFhbEJDYD","date":"Mon Feb 07 13:26:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Speaker Pelosi and House Democrats pushed through the COMPETES Act this week, allegedly to counter China. But not only does it not counter China, it in fact enables the communist regime even more. I break it down in this video: https://t.co/Nq6OLFVmzu","date":"Mon Feb 07 00:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Crime rates are skyrocketing across the country, and the White House is just sticking its head in the sand.  The American people deserve better. https://t.co/g6kiDJoCcg","date":"Sun Feb 06 22:09:25 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It has never been about safety or health. It has always been about control.\nhttps://t.co/paCoWwQ2xI","date":"Sun Feb 06 16:09:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The intelligence communities across the globe have assessed that President Biden is weak, and they are walking all over him as a result.  How will President Biden respond?  With strength or more weakness? That decision will have huge national security consequences for our nation. https://t.co/GAafs5KMEx","date":"Sun Feb 06 00:30:40 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@ResisterDoggie Congratulations to him!  Good luck!","date":"Sat Feb 05 21:31:08 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Chinese Communist Party is predictably trying to impose their oppressive control on American athletes at the Beijing Olympics by threatening athletes who use their freedom of speech. https://t.co/N0FrT9PSPz","date":"Sat Feb 05 18:00:02 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When Russia and China are celebrating, and the American people are getting completely abandoned, you know it wasn’t a good week in Washington. https://t.co/201TsptNfI","date":"Sat Feb 05 14:00:01 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@ChineseEmbinUS \n@SpoxCHNinUS \n@USOlympic\n@SpeakerPelosi \n@EnesFreedom","date":"Sat Feb 05 00:15:35 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My message to China’s President Xi Jinping: Americans will not be intimidated into silence. https://t.co/XD34eB6qc7","date":"Sat Feb 05 00:15:34 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"So, what the heck is going on with Florida’s water issues and why are there so many conflicting reports? Here’s an update: https://t.co/iI8ugo5m6D","date":"Fri Feb 04 19:08:11 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thank you @RepStephMurphy for standing strong against China.  The complete cave to the Chinese Communist Party by Democrats in Congress has been pathetic to watch this week.","date":"Fri Feb 04 17:35:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Ultimately, the Supreme Court should be about fairness, not favor; Constitution, not color.\n\nThe American people certainly shouldn’t be celebrating Biden's subversion of our judiciary for political gain.\n\nRead my op-ed on @FoxNews: https://t.co/gQ0gBYhTYe","date":"Fri Feb 04 16:45:58 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@ResisterDoggie I tried.  They refused to add the funding.  Your anger is misplaced.","date":"Fri Feb 04 15:10:18 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@JuliZartman When a person votes against a bill because it doesn't include the funding you requested, it's not a \"gotcha\" to point out that they voted against the bill.","date":"Fri Feb 04 14:32:38 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today we are AGAIN calling on President Biden to fund the EAA Reservoir.  \n\nThis project is bipartisan and has broad support.  We have been calling on it to be funded repeatedly since Biden took office.\n\nHe has ignored bipartisan pleas.  There is no excuse. https://t.co/JCDGdAaI9N","date":"Fri Feb 04 14:22:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"How can the Biden Administration and Speaker Pelosi say that they are trying to counter China while continuing to turn to a country for help that caused this global pandemic?\nhttps://t.co/nouOrMpOOq","date":"Fri Feb 04 14:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ALSO FACT: The Administration completely ignored us - didn't even respond.\n\nNow those of us who tried in good faith to fund this project are getting attacked for not working with them?  \n\nAbsolute BS.","date":"Fri Feb 04 14:02:57 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"FACT: On March 29th, I led a bipartisan group of Florida members to ask the Biden Administration to fund the EAA Reservoir in their infrastructure bill. \n\nI then made the bipartisan request repeatedly for the next several months. https://t.co/o0m5QFX33Y","date":"Fri Feb 04 14:01:59 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@JohnKGriffin March 29th wasn't in time?\n\nhttps://t.co/bTTozxNJiN","date":"Fri Feb 04 13:56:16 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"#LakeOFactCheck: While the attention grabbing headlines about funding for Everglades restoration sound great, where it’s placed is missing the mark.\nZero funding for the EAA reservoir means less water flowing south and no reduction to toxic discharges. That’s a huge failure. https://t.co/dL3rA34qs8","date":"Fri Feb 04 00:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"From Afghanistan to Russia and China, President Biden’s incompetence hurts morale among our men and women in uniform.  I joined @Newsmax to discuss: https://t.co/k2FzkDRTTx","date":"Thu Feb 03 20:19:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s policies continue to drive inflation higher and higher.  We are all paying the price at the pump.\nhttps://t.co/EEKRJ8GJDq","date":"Thu Feb 03 13:05:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is how unprepared the Biden Administration was - new leaked documents show just hours before the fall of Kabul to the Taliban, they still had no concrete plans to withdraw from Afghanistan. https://t.co/w2SUlbFXJI","date":"Thu Feb 03 00:30:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’ll be joining @seanspicer &amp; @LyndsayMkeith at 6pm on @newsmax to discuss the leaked document that shows how unprepared Biden was for the withdrawal in Afghanistan.","date":"Wed Feb 02 22:32:16 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This disaster resulted in the deaths of innocent Americans and Afghan allies, and President Biden is solely responsible for it because he was so focused on politics that he completely ignored the planning necessary to achieve a critical security objective.\nhttps://t.co/ykZbYwS3AY","date":"Wed Feb 02 21:35:03 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Here is the leaked document: https://t.co/FSiUf8TXHW","date":"Wed Feb 02 16:20:14 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"LEAKED: An internal White House memo leaked last night exposes just how unprepared the Biden White House was to evacuate Afghanistan. Joe Biden prioritized politics over people and Americans died as a result. https://t.co/SP2FYURCxq","date":"Wed Feb 02 16:19:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"How detached from reality can you be?\nhttps://t.co/L1IqnmtNLA","date":"Wed Feb 02 14:18:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When #Beijing2022 kicks off on Friday, the Chinese Communist Party is hoping the world doesn’t notice that it’s actively engaged in a genocide. American athletes need to be briefed about the atrocious human rights violations of the host country. https://t.co/RId4D9UnKt","date":"Wed Feb 02 00:25:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is an alarm House Republicans have been sounding for months: the Taliban is sitting on a treasure chest of natural resources, again, thanks to Joe Biden’s incompetence. \nhttps://t.co/9hRFbYayqg","date":"Tue Feb 01 21:09:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Ds trying to politicize Everglades (@RepLoisFrankel 👀) think pointing out R's vote against \"infrastructure\" bill is somehow a \"gotcha.\"\n\nWe voted no precisely because it ignored projects like EAA Reservoir in favor of garbage like \"tree equity\" &amp; \"racist highways.\"\n\nFrom Nov: https://t.co/SDq7P51UaT","date":"Tue Feb 01 20:45:18 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"https://t.co/Kvg2JNbo31","date":"Tue Feb 01 19:40:29 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@GovDeSantis has led a historic charge for state funding for the EAA reservoir.  Now, it’s time for @POTUS to follow suit. We need this project ASAP to #SendTheWaterSouth and stop toxic discharges. https://t.co/xVtet7UyRP","date":"Tue Feb 01 17:46:12 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"People are being poisoned in Florida from toxic water, and Joe Biden is up there in DC using taxpayer dollars to funnel support to his allies and punish his enemies.\n\nJust like in Afghanistan, he cares far more about politics than people.  It's pathetic.","date":"Tue Feb 01 15:32:05 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"These are our allies. They fought shoulder to shoulder with us in the trenches. Joe Biden abandoned them, and they’ve paid the ultimate price for his callousness. It’s beyond disgusting. \nhttps://t.co/ymmnBwq21I","date":"Tue Feb 01 00:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The EAA Reservoir is key to restoring the Everglades and stopping toxic discharges to the estuaries. The Biden Administration’s decision not to fund this project was despicable. That’s why I’m joining @GovRonDeSantis in calling on Biden to fully fund this project ASAP! https://t.co/jEWqxtcY2m","date":"Mon Jan 31 20:55:36 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Putin, Xi and Kim Jong-un have the same idea: walk all over Joe Biden. \nhttps://t.co/oYt4WEf4Kg","date":"Mon Jan 31 16:46:52 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The idea that you don’t need an ID to elect the school board, but you do need one to go to school is ass-backwards.\nhttps://t.co/vg2BtiM2fT","date":"Sun Jan 30 20:05:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Not surprised by this list at all - Florida is the best state for everyone.\nhttps://t.co/An9YLagAE6","date":"Sun Jan 30 16:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"School choice is about the students, so let’s hear it straight from them. Here’s what my kids had to say about their homeschool experience. #SchoolChoiceWeek https://t.co/ehUNiu8Ni4","date":"Sat Jan 29 22:30:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"More heartbreaking scenes from Afghanistan thanks to Joe Biden’s disaster. \nhttps://t.co/NGEkIC5jrg","date":"Sat Jan 29 16:40:48 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reminder: civil servants are still losing their jobs for having the audacity to make their own healthcare decisions. \nhttps://t.co/WEPjrjYQhZ","date":"Fri Jan 28 23:42:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Why won’t Joe “The Buck Stops With Me” Biden take responsibility for the crises (plural) facing our country? https://t.co/0js1L781NP","date":"Fri Jan 28 22:48:37 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Great to join folks at the iCare Get Fit Run! Appreciate their work to support all members of our community. https://t.co/eZ6a9mMd3Y","date":"Fri Jan 28 16:42:45 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Every state is a border state under President Biden. \nhttps://t.co/HdilNEb7m2","date":"Thu Jan 27 23:56:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"“Harmless” is how you should describe your pet, and not your nation’s Commander-in-Chief. https://t.co/vccTdmDaAG","date":"Thu Jan 27 21:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We must remember the atrocities of the Holocaust so that the worst of human history is not repeated. https://t.co/TCckyDSSWO","date":"Thu Jan 27 18:43:53 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Why does the Army Corps leadership refuse to acknowledge that its personnel are being poisoned on its watch? \n\nThis week, we’re fact checking Lt. General Scott Spellmon. #LakeOFactCheck https://t.co/fZd7btCnOn","date":"Thu Jan 27 14:03:21 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Dr. Fauci was more concerned about hurting the Chinese Communist Party’s feelings than protecting the health of Americans. #FireFauci\nhttps://t.co/8gn8nw6dU1","date":"Wed Jan 26 23:50:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inflation is a tax on all Americans. \nhttps://t.co/e9IK8YOQ1o","date":"Wed Jan 26 20:32:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Anti-semitism has no place in Florida, or anywhere else in America. Not on my watch.\nhttps://t.co/Gq4Xa7Abne","date":"Wed Jan 26 16:29:15 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Scamming elderly folks is despicable. Thanks to Martin County Sheriff Snyder and his team for standing up for our neighbors. https://t.co/G7qAAdpXR2","date":"Wed Jan 26 13:55:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Just rolling out the welcome mat…\nhttps://t.co/odR1K15Ne1","date":"Wed Jan 26 00:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The economy is struggling to get back on its feet, and Biden keeps knocking it down. \nhttps://t.co/pWRhn2NmeS","date":"Tue Jan 25 21:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Your administration delayed the single most important project - the Everglades Agricultural Area Reservoir - by two years and then specifically excluded funding for it in this bill.  Stop trying to pull the wool over the eyes of Floridians.","date":"Tue Jan 25 20:13:05 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"From the best natural treasure, the Everglades, to the freedom-loving people, Florida is the best state in the Union. \n\nHappy Florida Day! https://t.co/1I78xSoF8l","date":"Tue Jan 25 18:10:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ID to work but no ID to vote? The hypocrisy of the left continues. https://t.co/lCOQPBcbLG","date":"Tue Jan 25 00:00:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Putin and Xi have the same idea: roll Biden. \nhttps://t.co/fw7KPpmM4c","date":"Mon Jan 24 21:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"\"The U.S. government will not be in a position to evacuate U.S. citizens.\"\n\nLeaving Americans trapped behind enemy lines.  Afghanistan all over again.","date":"Mon Jan 24 17:55:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Natural immunity NEEDS to be considered in the conversation when we talk vaccine mandates. \nhttps://t.co/MNx6S28yfM","date":"Mon Jan 24 16:59:22 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"What kind of “research” involves transgender monkeys? Government-sponsored animal cruelty must stop and Dr. Fauci needs to be held accountable. #FauciLiedMonkeysDied https://t.co/tnURmLjKTg","date":"Mon Jan 24 00:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s failure to draw a red line has given Putin the green light. https://t.co/o0dd4uvt8d","date":"Sun Jan 23 20:30:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Glad to see the EVEST Act passed to cut red tape for fellow veterans. \nhttps://t.co/4F6WkWGNmB","date":"Sun Jan 23 16:10:52 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s weakness highlighted by the catastrophic Afghanistan withdrawal gave a green light to Russia and China to do whatever they please. https://t.co/ONVWcnrBFu","date":"Sat Jan 22 23:27:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This week, Joe Biden omitted crucial funding for the EAA Reservoir - which is essential to stopping toxic discharges - from an allocation of infrastructure dollars. Biden and the Army Corps failed Florida, but I will keep fighting to reverse their mistake. https://t.co/JuWNNztRwr","date":"Sat Jan 22 22:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"One year of broken promises. \n\nThe latest #WeekInReview⬇️ https://t.co/U3dESHMr8F","date":"Sat Jan 22 16:00:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Blue states are literally decriminalizing crime, and the rest of the country is paying for it. \nhttps://t.co/rDuKpVSZJN","date":"Sat Jan 22 00:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In twelve months, everything that President Biden has touched has fallen apart. \n\nMy take on the first year of the Biden Administration ⬇️\nhttps://t.co/3XQMwCNEZx","date":"Fri Jan 21 21:27:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Um, Florida's schools have stayed open...  \n\nThey are so desperate to attack the best Governor in America they're grasping at invisible straws.","date":"Fri Jan 21 18:11:09 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@POTUS You “make no apologies” for Afghanistan, but you should apologize to every service member whose life you endangered by putting a PR goal ahead of a strategic objective. A big 9/11 speech was not worth 13 lives. https://t.co/rgDnVw4KL1","date":"Fri Jan 21 18:03:43 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"One year of President Biden, one year of empty words and lies. https://t.co/NfjcrkLyUf","date":"Fri Jan 21 00:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Nothing like this did, or would, happen under the Trump Administration. \nhttps://t.co/FBDtbvQbRx","date":"Thu Jan 20 21:53:03 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"One year of Joe Biden and one year of record-breaking unemployment. \nhttps://t.co/JRtjAA6TJp","date":"Thu Jan 20 15:02:24 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden says he \"makes no apologies\" for Afghanistan. A slap in the face to every veteran who served there and every family who lost their son or daughter.","date":"Wed Jan 19 22:16:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Putin gets a pipeline, Israel gets the middle finger. Thanks, Joe Biden.\nhttps://t.co/1z9ZEOxW6d","date":"Wed Jan 19 22:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@Douglas_Main These are the projects being funded.  The EAA reservoir is not one of them. https://t.co/LLGAGVYNFt","date":"Wed Jan 19 22:00:12 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today the Army Corps announced they wouldn’t allocate even one dollar for the EAA reservoir, cementing the Biden Administration’s massive screw up. It’s clear that Joe Biden has no regard for the wellbeing of South Florida’s environment, economy or public health. https://t.co/YBBJOPZQuQ","date":"Wed Jan 19 16:27:12 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration continues to fail our Afghan partners. \nhttps://t.co/5lVYcOBrjd","date":"Wed Jan 19 14:02:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"DC Democrats’ To-Do List: \n\n📍 Manipulate elections\n📍 Waste trillions of tax dollars\n📍 Repeat\n\n🚨🚨  It’s clear addressing inflation isn’t a priority. 🚨🚨\nhttps://t.co/tShZP9D2Ux","date":"Tue Jan 18 22:39:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s like we’re watching a rerun of the Obama years.  I guess this is what Biden meant when he said “America is back.” \nhttps://t.co/I9oPjKIR8f","date":"Tue Jan 18 16:12:17 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We need enforceable water quality standards and we need them NOW.\nhttps://t.co/NEDZICx4mF","date":"Mon Jan 17 21:16:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Martin Luther King, Jr.’s legacy reminds us that the fight for liberty, justice and equality is always one worth having. https://t.co/j0BMSsNVQi","date":"Mon Jan 17 16:37:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"These increases are forced onto you, the consumer.\nhttps://t.co/HUrP7nbQDZ","date":"Mon Jan 17 00:18:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Grateful to those in our community who are stepping up to #SaveTheManatees\nhttps://t.co/Y2fKfIhvli","date":"Sun Jan 16 21:05:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"A lot happened this week in our fight for clean water.  I break it all down in a special edition of #WeekInReview: https://t.co/pCVPRiTJIE","date":"Sun Jan 16 16:23:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden should listen to the Ukrainians: say no to Putin. https://t.co/1pw5TWLwwe","date":"Sun Jan 16 00:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Dr. Fauci’s latest mad science experiment: transgender monkeys. This man must be stopped.\n#FauciLiedMonkeysDied\nhttps://t.co/iEC43kZV7u","date":"Sat Jan 15 21:17:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We began the new year in Congress with hypocrisy and temper tantrums.  Off to a great start.  Check out the latest #WeekInReview: https://t.co/raNenpzdhg","date":"Sat Jan 15 16:00:02 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Yesterday, the Supreme Court sided with freedom and against the tyranny of Joe Biden. Vaccine mandates on private businesses are officially unconstitutional. https://t.co/ik4gWEcd7o","date":"Sat Jan 15 00:04:51 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Will Biden stand up to Putin before it’s too late?\nhttps://t.co/D7GxATCWQ3","date":"Fri Jan 14 22:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s clear: our nation is less secure with Joe Biden in the White House. \nhttps://t.co/F8mptULB3P","date":"Fri Jan 14 18:05:37 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When Biden said “freedom to vote” is this what he meant? Freedom for foreigners to manipulate our elections?\nhttps://t.co/7F0r3axmUw","date":"Fri Jan 14 14:17:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Empty promise after empty promise from the Biden Administration.\nhttps://t.co/m8LVSnRSGR","date":"Fri Jan 14 01:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Last time the inflation was this bad, this was what Joe Biden looked like: https://t.co/oGKADAiaPF","date":"Thu Jan 13 23:15:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy 15 year anniversary, Brianna Mast. Best adventure of my life. https://t.co/8Z2aXroB0E","date":"Thu Jan 13 21:54:48 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Big win! The Supreme Court Smacks down vaccine mandates and makes it clear that Joe Biden can’t tell private businesses what to do.\nhttps://t.co/5Y5OnpXGyv","date":"Thu Jan 13 19:58:31 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When even one of the farthest left Members of your own party thinks you screwed up, you know it's getting bad...","date":"Thu Jan 13 16:54:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Americans are struggling, but instead of helping them, Joe Biden is focused on breaking the Senate so he can push through his far left agenda. https://t.co/71OTwswmp3","date":"Wed Jan 12 23:56:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"People spent more because things cost more. Things cost more because of #Bidenflation. \nhttps://t.co/eV5ts6LvqI","date":"Wed Jan 12 20:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Let's be clear here...\n\nAmerican lives are being put at risk from toxins in our waterways and the Army Corps is more concerned about optics than actually coming up with a solution.  \n\nIf Lt. General Spellmon won't act, then he needs to be replaced with someone who will.","date":"Wed Jan 12 17:33:51 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"COVER UP?!? Why won’t Army Corps leadership admit that their personnel are being poisoned by toxic algae? In today's committee meeting, I pushed Army Corps Commanding General Scott Spellmon to own up and take action to protect those working in hazardous conditions at Port Mayaca. https://t.co/kb61AJ2f6e","date":"Wed Jan 12 16:51:59 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reminder that Democrats literally voted AGAINST an amendment to stop murderers from getting stimulus checks.\nhttps://t.co/6ESv9fTLhh","date":"Wed Jan 12 14:03:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"\"[Eliminating the filibuster] is not only a bad idea, it upsets the constitutional design and it disservices the country.\"\n-Senator Joe Biden, 2005\nhttps://t.co/J5KqvYo6Nz","date":"Wed Jan 12 00:08:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The attack on civil servants continues.\nhttps://t.co/npN8f9DGfa","date":"Tue Jan 11 20:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Everyone should have the right to exercise their freedom of religion, but the Bill of Rights has fallen by the wayside under Joe Biden.\nhttps://t.co/n0wFSgqQE6","date":"Tue Jan 11 19:00:01 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today marks the first day of the second session of the 117th Congress. I will continue to fight for #FL18 and stand up against the power grabs from the Biden Administration. https://t.co/X29tEU6Qdu","date":"Tue Jan 11 01:10:30 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"75 years to publish the safety data of a vaccine that millions of Americans are being forced to take? Unacceptable. \nhttps://t.co/jWoKObJx7s","date":"Mon Jan 10 18:35:49 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As someone who’s swam with sharks, I can say first hand it’s an awesome experience and a great chance to learn about Florida’s incredible natural resources.\nhttps://t.co/NobBH3Evwf","date":"Mon Jan 10 14:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s big government mandate infringes on our rights - states’ rights and the right to privacy, just to name a few.\nhttps://t.co/RwvU5q37hg","date":"Sun Jan 09 22:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Law enforcement officers dedicate their lives to service and sacrifice for the wellbeing of our communities. Today we recognize that sacrifice with #LawEnforcementAppreciationDay #BacktheBlue https://t.co/IilJc1c6y6","date":"Sun Jan 09 14:05:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@POTUS Well, Mr. President, which one is it? https://t.co/3syxDBPwoc","date":"Sat Jan 08 22:21:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Every day, our law enforcement puts their wellbeing on the line - both physical and mental. We need to ensure they have every resource possible. #BackTheBlue\nhttps://t.co/X3CiCyywp5","date":"Sat Jan 08 18:02:18 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@POTUS Well, Mr. President, which one is it? https://t.co/9jjKdFmRqO","date":"Sat Jan 08 15:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s simple: if our servicemembers are forced to take the vaccine to keep their jobs, our government should be held liable for any adverse effect they may have from taking the vaccine. https://t.co/0wPHv9Gp8i","date":"Fri Jan 07 23:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s economy disappoints again.  \n\nhttps://t.co/Cn3vltETuG","date":"Fri Jan 07 20:12:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden let our Afghan allies down and now they are fighting for their lives. https://t.co/7CqWH3wIF2","date":"Fri Jan 07 17:57:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"On top of the unconstitutionality of President Biden’s vaccine mandate, this has serious implications for our force readiness. Separating hundreds/thousands of Marines for exercising their rights can put the United States at a huge military disadvantage.\n\nhttps://t.co/lPkjIka9IG","date":"Thu Jan 06 23:33:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Your 18th District team is hosting satellite office hours. They will be at @IRSCTheRiver, Building A, every Thursday from 10AM to 1PM. No appointment necessary.\n\nIf you’re having an issue with Social Security, the VA, the IRS or any other federal agency, we may be able to help. https://t.co/xOfKG6neZH","date":"Thu Jan 06 19:55:39 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My heart breaks for the 13 families who spent the holidays without their sons and daughters because of Joe Biden’s failure. They deserve accountability!\nhttps://t.co/80y8Gycz2n","date":"Thu Jan 06 01:02:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is becoming a year round problem because of the complete failure of the Florida legislature to pass enforceable water quality standards.\nhttps://t.co/l14HVt2zje","date":"Wed Jan 05 22:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"China is not just a ‘competitor.’ The Chinese Communist Party is a hellbent on expanding its influence all over the world.\nhttps://t.co/F32z4EgIpZ","date":"Wed Jan 05 18:13:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Governor DeSantis knows family comes first.  Trying to shame our great governor for caring for his wife is just despicable!\nhttps://t.co/AEz2RTIdaA","date":"Wed Jan 05 14:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"How many times is Biden going to run this play before he figures out that big government is the problem, not the solution? \nhttps://t.co/IJDqVDpQm4","date":"Wed Jan 05 00:05:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration is more concerned with keeping the teachers union happy than our kids’ wellbeing. \nhttps://t.co/UAq8s9rW2o","date":"Tue Jan 04 22:07:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Hope you enjoyed a taste of freedom, AOC! Now, take your lockdown politics back to New York.\nhttps://t.co/h2BXztXWyE","date":"Tue Jan 04 16:27:20 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I was asked what I think about another round of COVID lockdowns.  Here’s my answer: hell no.\nhttps://t.co/jeQLuWz2yv","date":"Tue Jan 04 00:10:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden’s broken supply chain is hurting Americans of all ages. \nhttps://t.co/bzCMyXNlbi","date":"Mon Jan 03 19:39:50 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The very rights these sailors defend are being undermined by Joe Biden’s unconstitutional mandate.\nhttps://t.co/v5rcHKvYQf","date":"Sun Jan 02 22:09:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"What are the top priorities Congress needs to focus on in 2022?  Share your thoughts here:\nhttps://t.co/ATG5wj4rqe","date":"Sun Jan 02 14:06:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Maybe Joe Biden’s New Year’s resolution will be to actually focus on policies that will make it easier for American families….I doubt it.\nhttps://t.co/VQBVLVcvye","date":"Sat Jan 01 22:04:00 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy New Year! Today marks a fresh start and new opportunities. I hope you all have an outstanding 2022. https://t.co/hR1SEjwktP","date":"Sat Jan 01 17:33:41 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy New Year's Eve!  I hope you all enjoy your night celebrating the end of the year! https://t.co/hWafapSucE","date":"Sat Jan 01 00:08:07 +0000 2022","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"2021 under Joe Biden:\n\n⛔️ Weakness in the White House\n⛔️ Abandoned in Afghanistan\n⛔️ Supply Chain Crisis\n⛔️ Massive Inflation\n⛔️ “Get Jab or Lose Job” Vaccine Mandates","date":"Fri Dec 31 22:41:46 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s tough to feel optimistic when you can’t get what your family needs, and when you can, you’re paying substantially more.  Americans deserve better than Joe Biden’s ineptitude.\nhttps://t.co/X6mXqFVT1K","date":"Fri Dec 31 00:06:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden’s supply chain crisis is still raging, and now, our pets are feeling the impacts.\nhttps://t.co/hUKKsuHHew","date":"Thu Dec 30 22:01:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"From waterways to supply chains, infrastructure impacts every American.  Despite the failure of Congressional Democrats to include Everglades restoration dollars in their infrastructure bill, I will not give up the fight! #YearInReview https://t.co/N5LwHf0bPb","date":"Thu Dec 30 14:30:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Over my cold, dead body.\nhttps://t.co/xXO71L7FLi","date":"Wed Dec 29 23:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"An incredible story. Thank you both for your service. #ArmyStrong\nhttps://t.co/OD1Na04v6w","date":"Wed Dec 29 20:18:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This year was a complete foreign policy disaster from the Biden Administration, including abandoning Americans and our allies in Afghanistan.  I will keep fighting to hold them accountable! #YearInReview https://t.co/5ovDBctSaL","date":"Wed Dec 29 14:30:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In just the first year, they’ve delayed the EAA reservoir, failed to include funding for Everglades Restoration in their infrastructure bill, and engaged in a cover up to hide the impacts of toxic algae on military personnel. (2/3)","date":"Wed Dec 29 00:08:55 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In addition, they proposed a Lake Okeechobee regulation schedule that will continue toxic discharges and allowed manatees to starve to death.  We cannot let them get away with it! (3/3)","date":"Wed Dec 29 00:08:55 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden’s administration continues to fail Floridians. Thread 🧵(1/3)\nhttps://t.co/udV5hrIlVV","date":"Wed Dec 29 00:08:55 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"#OnThisDay in history, Congress officially adopted the Pledge of Allegiance.  I proudly stand for the flag! How about you?\nhttps://t.co/z2MzeayPvw","date":"Tue Dec 28 22:06:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This year, we made progress in the fight for clean water, but we’ve got a lot of rounds left to go.  I will not stop fighting! #YearInReview https://t.co/RaxmEIdIK5","date":"Tue Dec 28 14:16:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Anthony Fauci needs to remember that animal cruelty is never acceptable. The PAAW Act will put an end to his mad science experiments once and for all. https://t.co/ZXOnr912bB","date":"Tue Dec 28 00:14:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I don’t know about you, Senator Warren, but I’d call that a ‘fair share’. \nhttps://t.co/c7AUXOuZfY","date":"Mon Dec 27 22:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As your Representative in Congress, one of the responsibilities I take most seriously is to help our friends and neighbors solve the problems they face with the federal government. This year we helped people resolve more than 1,600 issues. #YearInReview https://t.co/bijBNxdeOx","date":"Mon Dec 27 14:08:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Not one penny of taxpayer money should be spent on animal cruelty. #FauciLiedDogsDied\n​​https://t.co/TJertZv3Zu","date":"Sun Dec 26 21:20:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’ll be forever grateful for those like Geeta Bakshi who stepped up for our Afghan allies when the Biden Administration failed them. \nhttps://t.co/wcMaKXp4Gh","date":"Sun Dec 26 14:09:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I hope you all had a joyous holiday with your families and friends! https://t.co/3rGW0udYWb","date":"Sat Dec 25 23:35:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Congratulations and merry Christmas, Mr. Reda! There’s no one more deserving than a member of the #GreatestGeneration.\nhttps://t.co/T89zgxyOhU","date":"Sat Dec 25 21:11:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Wishing you and your loved ones a day full of peace and joy. Merry Christmas! https://t.co/pmTdofuE3A","date":"Sat Dec 25 16:36:33 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This Christmas Eve, Brianna and I wish you all a wonderful evening with loved ones, and I hope your Christmas is the best one yet!\nhttps://t.co/nItyLjID7u","date":"Fri Dec 24 21:59:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Science: “omicron variant has lower risk of hospitalization than other variants.”\nPolitics: “require vaccination cards at every business” \nhttps://t.co/7zZlaQpysW","date":"Fri Dec 24 18:17:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"U.S. businesses are the most efficient in the world - it’s only when the government gets involved that things get messed up. \nhttps://t.co/ARI7zaRCU1","date":"Fri Dec 24 14:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There still has been zero accountability for Joe Biden’s complete and utter failure in Afghanistan from start to finish because Nancy Pelosi and Democrats in Congress are shielding him from public scrutiny.\nhttps://t.co/O4BRNRT1DM","date":"Fri Dec 24 00:04:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The president puts stock in fear tactics more and more with each passing day.\n\nBiden is all empty threats towards those he’s meant to serve.\nhttps://t.co/ozEXZzM8Us","date":"Thu Dec 23 21:29:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Key takeaways: \n➡️ Biggest price jump since 1982\n➡️ Don’t expect relief anytime soon\n➡️ Housing and utilities are up, personal savings are down\n➡️ Any increase in wages was wiped out by inflation\n\nThis is Joe Biden’s America. \nhttps://t.co/11diOJbcp0","date":"Thu Dec 23 17:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"California’s loss is Florida’s gain. Welcome to the Sunshine State! \nhttps://t.co/cLVvmh0lYt","date":"Thu Dec 23 14:02:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Instead of backing those who protect our country, Biden continues to undermine them with his big government mandates.\nhttps://t.co/Hp9oSSKPeU","date":"Wed Dec 22 22:13:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s simple: police keep communities safe. #BackTheBlue\nhttps://t.co/vRBvgn6r9S","date":"Wed Dec 22 14:03:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"First #Bidenflation came for Thanksgiving.  Now it is making Christmas more expensive.  How much longer will this continue before Democrats in Congress wake up and get to work to solve this problem?\nhttps://t.co/ezGzIDzMRK","date":"Wed Dec 22 01:09:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"How does Biden expect to hold Russia accountable if all he does is wait for our adversaries to make their move? Isn’t that how Obama lost Crimea and enabled North Korea’s nukes?\nhttps://t.co/TxXTcRXuK9","date":"Tue Dec 21 22:08:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Trying to silence parents and cut them out of their child’s education is unacceptable. The Palm Beach County School Board cannot hide behind unconstitutional rules. \nhttps://t.co/442C7aQJD2","date":"Tue Dec 21 14:11:33 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inflation is weighing on the shoulders of every American. https://t.co/bqZ6yU5LvY","date":"Tue Dec 21 00:22:50 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thank you, @GovRonDeSantis for advocating for Floridians.\nhttps://t.co/vdsgEJ70xX","date":"Mon Dec 20 22:02:51 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Sanity prevailed over socialism - for now.  \nhttps://t.co/tYMloCZ1i2","date":"Mon Dec 20 18:01:42 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"China is paying influencers to spread misinformation in the United States because they know Joe Biden is too weak to stop them.\nhttps://t.co/0s86B8TDV1","date":"Sun Dec 19 22:11:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Christmas spirit is alive and well!\nhttps://t.co/XmItLOgjrd","date":"Sun Dec 19 19:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inflation is at its highest levels in a generation. A trillion dollar spending spree is not the answer.\nhttps://t.co/B1Noe49CqR","date":"Sun Dec 19 14:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Remember. Honor. Teach. \n\nGrateful for the privilege to participate in Wreaths Across America in Stuart this afternoon. https://t.co/ZXrhSYHuzx","date":"Sun Dec 19 01:05:52 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"President Biden’s failure in Afghanistan showed that he is weak and incompetent. Now, Russia and China are taking full advantage of that weakness in the White House. \nhttps://t.co/NEjBjGccFb","date":"Sat Dec 18 20:57:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thanks to everyone who came out to the St. Lucie County Fairgrounds last night for this year’s Cattle Extravaganza to support scholarships for young adults in our community! https://t.co/2LsKLZQBXu","date":"Sat Dec 18 16:36:41 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"“Nothing is so permanent as a temporary government program.”\nhttps://t.co/1A9nVLGDVj","date":"Sat Dec 18 00:06:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If the past year has shown us anything, it’s that parents have a right to be involved in what their children are learning.  This is a cowardly move and an affront of parents in Palm Beach.\nhttps://t.co/e1mBl3Bkt2","date":"Fri Dec 17 22:13:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The border crisis is not just in Texas or other southwestern states - it’s a national issue that also impacts our own backyard.\nhttps://t.co/cvGsSawvAz","date":"Fri Dec 17 15:59:51 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"They’re finally figuring out that “defund the police” is a catchy slogan, not sound public policy. \n\nhttps://t.co/pcDVtgFLWQ","date":"Fri Dec 17 01:02:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Grateful to Sgt. Curran for his decades-long commitment to our community and wishing him all the best in this next chapter. \n\nhttps://t.co/xRWXpdK8Wj","date":"Thu Dec 16 22:15:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Florida &gt; California\nhttps://t.co/Ax7q1QhZ5d","date":"Thu Dec 16 19:29:38 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is American taxpayers’ money they’re talking about. DC Democrats need to know it’s OUR money funding their spending spree.\nhttps://t.co/dsFz36Y695","date":"Thu Dec 16 00:13:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy 230th birthday to one of the most important documents in our history, the Bill of Rights. The Bill of Rights keeps our government from infringing our personal rights and liberties, which is apparently a lesson Joe Biden never learned. https://t.co/psEFXUEJ1Q","date":"Wed Dec 15 20:20:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"With the federal government flying illegal immigrants to all across the United States, every state is a border state. Thank you, Governor DeSantis, for fighting against Biden’s ridiculous policies.\nhttps://t.co/ZKNdF9KL6P","date":"Wed Dec 15 16:18:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Paychecks can’t keep up with Joe Biden’s economic mismanagement.\nhttps://t.co/EFz2xbzUhV","date":"Wed Dec 15 14:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration is using vaccine mandates as a tool to purge conservative voices from the military and government.  We cannot let them get away with it! https://t.co/Z4OA8W6ddw","date":"Wed Dec 15 01:35:34 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"University of Florida researchers are looking for volunteers to collect berries from plants on their Fort Pierce research fields.\n\nHelp our communities fight off the invasive species and keep Florida, Florida.\nhttps://t.co/HE88I11uQm","date":"Tue Dec 14 22:16:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"These unconstitutional, controlling vaccine mandates are cutting down leaders in the prime of their career.  Our country is less safe as a result. \n\nhttps://t.co/4Yk6cPlv16","date":"Tue Dec 14 19:17:29 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"While the cat’s away, the mice will play. \n\nJoe Biden’s incompetence means Russia and China can - and will - take over. https://t.co/hfGd7WtzXG","date":"Tue Dec 14 01:34:16 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"With Joe Biden in the White House, rogue nations are pushing the envelope.\nhttps://t.co/nuJw9zgzIz","date":"Mon Dec 13 23:27:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This legislation would give Florida the flexibility it needs to address our most pressing issue: water quality. https://t.co/hU4jePyjCZ","date":"Mon Dec 13 21:40:54 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration is so afraid of China that they’re allowing themselves to be censored.\n\nChina needs to accept that Taiwan is here to stay, and Biden needs to stand up for democracy.\nhttps://t.co/H3ts5zEnLB","date":"Mon Dec 13 19:36:47 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Have your Christmas gifts still not been delivered? The Biden Administration’s supply chain crisis may be to blame. https://t.co/eIv96MXbP3","date":"Mon Dec 13 00:30:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Glad to have @RepBuddyCarter as a partner in the push for commonsense solutions to our nation’s environmental challenges: \nhttps://t.co/HYXukgUMKr","date":"Sun Dec 12 20:15:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We need to do everything we can to fix Florida’s water quality.  My bill will add another tool to the toolbox:\nhttps://t.co/Pgw0ezdGln","date":"Sun Dec 12 15:03:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inflation raises the cost of doing business for everyone - even Santa! Passing a multi–trillion spending bill will only make it worse. https://t.co/Xj2vryfZ5C","date":"Sun Dec 12 00:00:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Every kid deserves a healthy start in life, but 1 in 33 children suffer from a birth defect. This week, the House passed a bill that would provide essential resources to better understand and treat the issues that these children face.\nhttps://t.co/DFaJ8lZsvw","date":"Sat Dec 11 20:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This week, Congress passed legislation to authorize military spending and our fight for clean water continued. \n\nWatch the latest Week in Review: https://t.co/WOyMD10e91","date":"Sat Dec 11 15:00:02 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The federal government needs to remember that every dollar it spends is YOURS. https://t.co/C0WD6ImqwZ","date":"Sat Dec 11 00:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If President Biden was intimidated by the Taliban, Vladimir Putin will absolutely roll him. https://t.co/VHZ8ETw7me","date":"Fri Dec 10 21:06:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"https://t.co/JC2jksx9Ol","date":"Fri Dec 10 19:25:46 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"“Inflation has been inflicting a heavy burden on consumers, especially lower-income households and particularly for everyday necessities. It has also negated the higher wages many workers have received.”\nhttps://t.co/3a2vRfunNQ","date":"Fri Dec 10 17:05:19 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Ilhan Omar wants to create a new, taxpayer-funded government office to investigate whatever she deems Islamaphobia (which apparently includes criticizing Hamas). I successfully passed an amendment to require any position be Senate confirmed so we can block her radical picks! https://t.co/710gY3Lfx7","date":"Fri Dec 10 14:06:08 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For Floridians, water quality and recreation go hand-in-hand. We can’t promote recreation without addressing toxic water, which is why I introduced the Land and Water Conservation Fund Amendment Act to ensure this critical program supports clean water projects in Florida. https://t.co/EluuVMrG7t","date":"Fri Dec 10 00:25:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@Ilhan has tried to deflect legitimate criticism of terrorists by hiding behind claims of “Islamophobia.\" She even attacked pro-Israel Democrats for it. Now, she wants to create a government agency to investigate. HELL NO! https://t.co/vqK7vie7gu","date":"Thu Dec 09 22:56:04 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Senator Dole was undoubtedly one of the greatest of the Greatest Generation.  There was never an obstacle big enough to stop him from serving his country, and that’s an example we should all strive to learn from. https://t.co/gOs5In6c0b","date":"Thu Dec 09 22:01:44 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The situation in our lagoon is so bad for manatees that wildlife officials are providing food for them. We need a permanent solution that improves our waterways and provides clean water for the manatees instead of just another band aid on a gaping wound.\nhttps://t.co/1SkEWR1Jxl","date":"Thu Dec 09 16:29:30 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Speaker Pelosi wants to spend $200 million of YOUR tax dollars to fix up her favorite park. I’m fighting to stop her. https://t.co/QZ0i7d3yvB","date":"Thu Dec 09 01:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Our community’s water is plagued by pollution from numerous sources.  Today I took our fight for clean water to the Transportation and Infrastructure committee in Congress.  Watch here: https://t.co/DTUngGocPU","date":"Wed Dec 08 22:18:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"With a military base on the Atlantic Coast, China can threaten the United States from both oceans. But thank goodness the State Department is on Snapchat.\nhttps://t.co/24fIQtfOiU","date":"Wed Dec 08 20:07:23 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For years, Democrats in D.C. have talked about the importance of the Everglades. But when push came to shove, they didn’t directly allocate a single dollar for restoration in their infrastructure bill. Watch the latest #LakeOFactCheck: https://t.co/qBt2mKhq74","date":"Wed Dec 08 19:30:11 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Anne Frank’s life was consumed by unchecked bigotry and hatred. To see a memorial in her honor vandalized - especially during Hanukkah - is unacceptable and a stark reminder of why Anne’s story must be shared with future generations. \nhttps://t.co/8wrvra34xQ","date":"Tue Dec 07 22:15:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden’s supply chain crisis is a real threat to the health of Americans. \nhttps://t.co/Ij8av4uDbk","date":"Tue Dec 07 18:50:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I hope the protestors thanked those veterans for fighting for their right to be idiots.","date":"Tue Dec 07 15:39:58 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The attack on Pearl Harbor 80 years ago is a reminder of bravery in the face of adversity and the sacrifices that millions of Americans made throughout World War II. It’s an example that can never be forgotten. https://t.co/bmfu0QWkE3","date":"Tue Dec 07 15:28:14 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s not about the science, it’s about control. https://t.co/nvNOS0ePh4","date":"Mon Dec 06 23:30:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Check out Year 1 of #BidensAmerica Wrapped. https://t.co/L5abqi0xN3","date":"Mon Dec 06 21:45:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"That’s code for “more opportunities for the Biden Administration to fear-monger.”\n\nhttps://t.co/aaJ86JOvMB","date":"Mon Dec 06 19:52:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Our adversaries are taking full advantage of the weakness in the White House. \nhttps://t.co/8AuXVrGVzb","date":"Mon Dec 06 18:15:47 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reminder: Anthony Fauci literally kills puppies with taxpayer dollars for “science.”  Nobody elected him, but Joe Biden thinks he’s the President.\nhttps://t.co/0qbZSiU3lA","date":"Mon Dec 06 01:02:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is the real meaning of community - taking care of one another.\nhttps://t.co/16xtEuHQUY","date":"Sun Dec 05 22:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I know firsthand the hold that opioids have on people - and it is not easy to fight it off. That’s why I’m committed to combating the opioid epidemic in this country. \nhttps://t.co/O0Lo1bRJFG","date":"Sun Dec 05 16:09:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This week, I introduced legislation that would prevent employers from asking about your vaccination status because it’s none of their business. \nhttps://t.co/7vzm5muXnH","date":"Sat Dec 04 22:06:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Always impressed by the students who seek nominations to our nation’s service academies. Today we held our annual physical fitness assessment for applicants.  The future of our military is bright! https://t.co/yhuFfffr56","date":"Sat Dec 04 20:41:16 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This week, Congress once again failed to do its job, the fight continues against unconstitutional mandates, and the latest on the opioid epidemic.\n\nCheck out the Week in Review ⬇️ https://t.co/3cBjwHIbQc","date":"Sat Dec 04 16:09:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is good news, but the fight to defend our freedoms is far from over. \nhttps://t.co/5UBIxYCXrp","date":"Sat Dec 04 00:03:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Vaccine mandates go to the heart of who we are as a nation. Are we the nation of freedom and liberty, or government control? https://t.co/oyO5LNEPWC","date":"Fri Dec 03 21:47:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Spoiler alert: scientists will continue to discover new variants, and D.C. Democrats will continue to use them as excuses to take away our freedom.","date":"Fri Dec 03 20:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Try to keep up with this logic: you don’t need a vaccine to fly in an airplane with 100 strangers, but you do need one to sit in an office with 100 coworkers. \n\nIs this what the Biden Administration means when they say “follow the science”?\nhttps://t.co/nmWn6qNGLB","date":"Fri Dec 03 18:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Another swing and a miss for Joe Biden. \nhttps://t.co/O0QRlykulE","date":"Fri Dec 03 16:54:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"You can’t spend your way out of inflation, but that’s not going to stop Biden from giving it the old college try.\n\nhttps://t.co/n1aCtwPm4m","date":"Fri Dec 03 14:25:18 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In the middle of Hanukkah, the UN voted to omit the Jewish ties to the Temple Mount. Hanukkah commemorates the triumph of the Jews over those who would destroy them. The anti-Semites were defeated in the 2nd Century BC, they will be defeated in our time.\nhttps://t.co/egFutqWzdi","date":"Fri Dec 03 00:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Being an American should mean you get to live your own life and choose what you do or don’t do.\nApparently, Joe Biden disagrees. https://t.co/MrgZE0j9pr","date":"Thu Dec 02 22:33:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The bill I introduced this week is about two things: protecting the privacy of all employees and pushing back against unconstitutional mandates. https://t.co/neI9keLgD1","date":"Thu Dec 02 15:41:45 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden has sentenced hundreds, if not thousands, to death.  His cruelty is surpassed only by his incompetence.  \nhttps://t.co/yx8kvvOQ6S","date":"Thu Dec 02 01:03:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration That Stole Christmas. \nhttps://t.co/lkVoqggfEa","date":"Wed Dec 01 23:42:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The more we take our eyes off the situation in Afghanistan, the more the Taliban and ISIS get their way. The utter failure by the Biden Administration is enabling the Taliban to turn Afghanistan back into a terrorist safe haven. https://t.co/bKcdLIibaP","date":"Wed Dec 01 21:57:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Their hypocrisy knows no bounds.","date":"Wed Dec 01 20:37:10 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"💯","date":"Wed Dec 01 19:38:36 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Vaccine mandates have no place in a freedom-loving nation like America. The current mandate pushed by the Biden Administration is the most rampant discrimination that Americans are facing in their workplaces and it’s not acceptable. https://t.co/7v8alVm1BR","date":"Wed Dec 01 16:17:18 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@CNN featured Harmony Allen’s story this weekend. \n\nSimply put, no rapist should be released on a technicality. I was honored to help take Harmony’s case to the Supreme Court, and today Harmony’s rapist is back behind bars where he belongs. https://t.co/Cg9epjJmDd","date":"Wed Dec 01 14:08:45 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"His son, Dale, tells me that he is proud to have served and to have a father who heroically served. I agree, and I salute Mr. Dorinski and his son for their service to our country.","date":"Wed Dec 01 01:47:14 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Following the heroic victory in the war, however, tragedy struck at home when his mother passed away shortly after his return.  As a young man in his early 20s, he learned that life consists of battles and you win some and lose some.","date":"Wed Dec 01 01:47:13 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"One of his sons went on to serve in the U.S. Army Reserve during the Vietnam War and later wrote a book based on his father’s time in the Pacific, inspiring more people to live a life of service for their communities and their country.","date":"Wed Dec 01 01:47:13 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"A year after his return, he married the love of his life, and together they raised three sons and a daughter. Mr. Dorinski passed away in 2012.","date":"Wed Dec 01 01:47:13 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"His story, however, does not end there. Mr. Dorinski’s service profoundly influenced his four children, teaching them self-reliance, confidence, hard work and the value of an education.","date":"Wed Dec 01 01:47:13 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today’s #veteran spotlight is Mr. Walter Dorinski, who served in the United States from 1943 to 1946 at the height of World War II.  As a radioman, he was stationed in the USS Wilson, patrolling the Pacific Ocean. https://t.co/m8eXpSq2aT","date":"Wed Dec 01 01:47:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"During the Battle of the Philippine Sea and the Mariana Campaign, the destroyer ship played a role in the American victory, enduring the force attacks and kamikazes from the Japanese.","date":"Wed Dec 01 01:47:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Government Accountability Office told me it isn't accountable to Biden’s mandates. Left to their own devices, they haven't mandated a vaccine for employees. Makes you wonder why the rest of the federal government is still being held “accountable” to an unconstitutional edict. https://t.co/uwgnRRKfEL","date":"Tue Nov 30 21:34:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In other news, the sky is blue and 2+2=4.\nhttps://t.co/mpydz8gHT3","date":"Tue Nov 30 20:02:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Rules for thee and not for me. The hypocrisy continues. \nhttps://t.co/14LcKdalet","date":"Tue Nov 30 18:35:51 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Read the article here: https://t.co/QuVpP6z01L","date":"Tue Nov 30 02:09:17 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"A year ago, Walensky - now Biden’s CDC Director - not only believed the bogus numbers put out by communist China, but also thought its brutal lockdowns were worth learning from.\n\nIt shouldn’t surprise anyone that Biden’s CDC is obsessed with trying to take away our freedoms.","date":"Tue Nov 30 02:09:17 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There are people in Stuart and across the country whose livelihoods are threatened by government overreach. This isn’t a game. If you’re concerned about your vaccination status impacting your employment, head to https://t.co/ulz0grLhU2.\nhttps://t.co/D224CEjB16","date":"Mon Nov 29 22:42:54 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Runaway prices and broken supply chains mean a lot of families’ stockings may be empty this Christmas.  Is that what Biden meant when he said “America is back”? #SaveChristmas https://t.co/oAYU3YiZyc","date":"Mon Nov 29 19:45:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"To anyone who says that inflation is a “high class problem,” Exhibit A. Don’t see a lot of millionaires shopping at Dollar Tree.  https://t.co/3esbVQv2OJ","date":"Mon Nov 29 18:15:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today’s veteran spotlight is on Mr. Joshua Schwarz, a 4th generation veteran from Port St Lucie that served in the Air Force. Mr. Schwarz enlisted in the military his senior year, and served as a Security Forces Specialist with the 90th Security Forces Squadron station. (1/3) https://t.co/NXvVNVsliL","date":"Mon Nov 29 17:00:28 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For many veterans, service in the military has paved the way to higher education, opening up new opportunities in one’s life. I salute and thank you Mr. Schwarz, for your service to this country and to your education. (3/3)","date":"Mon Nov 29 17:00:28 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"After finishing his service, Mr. Schwarz enrolled as a full-time student using the Post 9/11 GI bill and graduated from Indian River State College with a 4.0 GPA. Mr. Schwarz is currently completing his bachelor’s in business management as a full-time student at FSU. (2/3)","date":"Mon Nov 29 17:00:28 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Anti-semitism is unacceptable in whatever form it takes, but threats on the first night of Hanukkah is especially disgusting. This type of hate has absolutely no place in our country.\nhttps://t.co/lR8NN4fkfr","date":"Mon Nov 29 14:39:16 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Hunter Biden used his family ties to benefit China by facilitating a Chinese company’s purchase from an American company.  Why am I not surprised?\nhttps://t.co/PmIUNoyqtw","date":"Mon Nov 29 00:50:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Hanukkah, or the Festival of Lights, is a celebration of light overcoming darkness, just as Jewish people overcame oppression more than 2,000 years ago. It is a reminder of the resiliency of Jewish people in history all across the world. \n\nTo all who celebrate: Hanukkah Sameach! https://t.co/b4ZFN8boTX","date":"Sun Nov 28 21:04:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Great to see everyone last night at St. Lucie’s Tradition Square Toy Collection. ’Tis the season for giving - thanks to all who donated. https://t.co/o9gubRymZV","date":"Sun Nov 28 16:36:33 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Mr. George has also participated in annual Veterans Arts competitions, and he won gold medals in 2000 and 2001 in his category. Mr. George’s is a story of passion.  He used his talents to serve our nation and, we are grateful. Thank you, Mr. George.","date":"Sun Nov 28 13:48:06 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"15 years after he left the military to finish his education in music, he joined the 42nd Infantry Division National Guard band in New York City.  Following 9/11, Mr. George transferred to a support unit that was involved in recovery duties, in addition to deploying to Iraq.","date":"Sun Nov 28 13:48:06 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For many, the military offers an opportunity to channel passion for our country into service.  That’s certainly true of today’s #veteran spotlight, Mr. David George.  Mr. George enlisted in the Army in 1967 and joined the 7th Infantry Division band in South Korea. https://t.co/DluOwRkTpn","date":"Sun Nov 28 13:48:05 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Mr. Cancilla's long and accomplished career serves as an example for the quality of veterans our military has produced. Thank you for your service, Mr. Cancilla, and for your continued dedication to our country and our community. (4/4)","date":"Sat Nov 27 22:39:46 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"After completing Officer Candidate School, Mr. Cancilla engaged in combat operations in Grenada, Panama, Iraq and Kuwait. He later attended the FBI National Academy and was subsequently selected as the Army Aide to the President of the United States, George H.W. Bush. (2/4)","date":"Sat Nov 27 22:39:45 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Shortly after his service to President Bush, Mr. Cancilla was appointed to a senior position at the U.S. &amp; Foreign Commercial Service in the Department of Commerce, starting his post-retirement career in leadership and management experience for the next several decades. (3/4)","date":"Sat Nov 27 22:39:45 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Mr. Russell Cancilla is today's veteran spotlight. While he was drafted into the Army one year before the draft system officially ended in 1973, he found his calling in military service. He served 6 years as an enlisted soldier, primarily working as a criminal investigator. (1/4) https://t.co/oGAJ846ARW","date":"Sat Nov 27 22:39:44 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Iran’s outrageous human rights abuses can’t be ignored.\nhttps://t.co/oHCl6Af7bc","date":"Sat Nov 27 20:47:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"From lockdowns and mandates to supply chain crises and labor shortages, small businesses have been put to the test. Today’s the day to support them and #ShopSmall! https://t.co/QeFyz9TtHA","date":"Sat Nov 27 17:22:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"For the Biden Administration, this was never about the science, it’s always been about control.\nhttps://t.co/19vmeB7OlX","date":"Sat Nov 27 13:35:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Black Friday is supposed to mean low prices but Joe Biden’s tax and spend agenda has ruined that also.\nhttps://t.co/xR5DCU4Zcx","date":"Fri Nov 26 22:08:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joining the military meant letting go of her scholarship and her collegiate singing career. Yet, her dedication to service meant more to her than all of these.  She says that joining the military was the best decision of her life. I thank you for your service, Ms. Miller.","date":"Fri Nov 26 15:29:21 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"During her time in service, Ms. Miller learned Korean at the Defense Language Institute and was stationed over there for a year. She would eventually go on to serve in military intelligence, as a Korean linguist and an electronic warfare signal interceptor specialist.","date":"Fri Nov 26 15:29:21 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today’s veteran spotlight is Ms. Michelle Miller who joined the Army in 1989. Despite having a full-ride scholarship to college for singing, the call of duty was stronger and she chose to enlist in the Army. Everyone she knew was shocked by her decision, but she says it paid off. https://t.co/USVXsIchKT","date":"Fri Nov 26 15:29:20 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy Thanksgiving!  My monkeys are my 4 greatest blessings. Hope you had the chance to spend the day with your loved ones. https://t.co/9j92lmIGgS","date":"Fri Nov 26 00:09:56 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"One thing I’m not thankful for: #Bidenflation. https://t.co/nq11F8Mbva","date":"Thu Nov 25 22:16:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I cannot begin to count all the blessings God has given us. Happy Thanksgiving to everyone in #FL18! https://t.co/xRwUcnl4if","date":"Thu Nov 25 16:43:22 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"But more personally, you can also help this by checking up on your fellow veterans and making sure they know that they are loved in their communities. (5/5)","date":"Wed Nov 24 23:17:09 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"According to statistics, an alarming number of 6,261 veterans lost their inner fight in 2019. There is still a long way to make sure that those who put their lives on the line receive the care they need. As a Congressman, I will continue to fight for that. (4/5)","date":"Wed Nov 24 23:17:09 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Following a period of struggle within, Mr. Reinwasser lost his battle on Veterans Day of 2018.\n\n“I will forever be proud of Joshua’s service,” his mother tearfully but proudly tells me. (3/5)","date":"Wed Nov 24 23:17:09 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Mr. Josh Reinwasser, while serving our nation in Guam and Qatar, served as a loader maintainer for a B-1 bomber. He had pride in the work he did that he could tell from start to finish every step of every part of his job. However, he also developed health complications. (2/5) https://t.co/kkZkMi6Erq","date":"Wed Nov 24 23:17:08 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Sacrificing for our nation comes at a cost. Some return to their homes once their battles end, but many begin new battles that start from within. Today’s #veteran spotlight sheds light on those moments. (1/5)","date":"Wed Nov 24 23:17:07 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This would benefit our economy, as well as strengthen the partnership between the U.S. and our most important ally: Israel. \nhttps://t.co/1JYfShqlQ8","date":"Wed Nov 24 15:13:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Self-defense is a constitutional right.","date":"Wed Nov 24 01:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When he was told that his eyesight would not allow him to fly an airplane, he eventually became a weapons loader for military aircraft. \n\nUpon his retirement he continued to serve his community as a teacher for the Air Force JROTC in schools, including Treasure Coast High School.","date":"Tue Nov 23 23:10:55 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"His service is invaluable to our communities and we salute him for his dedication to service and to our country.","date":"Tue Nov 23 23:10:55 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Our veteran spotlight for today - Mr. Thomas Frazier - comes from a family of service, with his grandfathers from the Army and the Navy respectively, and his father from the Marine Corps. Mr. Frazier took a different path and enlisted in the Air Force. https://t.co/KHQEj7l24p","date":"Tue Nov 23 23:10:54 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thanks to Governor DeSantis’ leadership, our businesses are open and Floridians are back at work.\nhttps://t.co/oFY2KZuZUi","date":"Tue Nov 23 21:11:15 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The photo is from their reunion in 2016; Mr. Prestopnik is on the right in the front row. Thank you for your service to our nation, Mr. Prestopnik, and may your friendships last for life! (4/4) https://t.co/o1luVYb45M","date":"Tue Nov 23 01:47:13 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"#FL18 VETERAN SPOTLIGHT:\n\nMr. Tom Prestopnik left his small home town in upstate New York to serve in the U.S. Air Force and made invaluable friendships along the way. (1/4)","date":"Tue Nov 23 01:47:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Serving at the 48th Tactical Hospital in a military base in England, he met other service members from all walks of life and from all over the US.\n\nMr. Prestopnik considers the 3 years in England the most important 3 years of his life because of the friendships he made. (2/4)","date":"Tue Nov 23 01:47:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In fact, he and his friends still get together every two years, and he says they are closer to him than any other friends he’s made throughout his life. (3/4)","date":"Tue Nov 23 01:47:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"File this one right next to gender neutral passports and “understanding white rage.” \nhttps://t.co/68m9GoNjN0","date":"Mon Nov 22 23:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Hell no.  I will do everything in my power to stop them. \nhttps://t.co/av6ma5JJz1","date":"Mon Nov 22 21:57:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Manatees are dying in record numbers because of the mismanagement of our waterways that has killed seagrass. We must make sure we protect our beloved “sea cow” by re-listing it as an endangered species and allocating resources to keep our waterways clean. \nhttps://t.co/r77FHEjHUm","date":"Mon Nov 22 14:18:50 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"In addition to serving as a corrections officer, he also served as a police officer, and finished his career in public service as an Alcoholic Beverage Control Commission investigator.","date":"Mon Nov 22 02:01:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Nowadays - at the age of 96 - Mr. Sullivan spends time enjoying ocean views, supporting his favorite charities, and reading American history. It's his sacrifice not only for our nation, but also for our community that America is safe today. We thank you for your service.","date":"Mon Nov 22 02:01:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"James Augustus Sullivan is today's #veteran spotlight, who served as a radioman 3rd class during World War II. After James was honorably discharged from service, he continued to serve his community through a career in law enforcement, serving his community. https://t.co/shRIIAfJxZ","date":"Mon Nov 22 02:01:11 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The C-44 Reservoir will help prevent discharges to the St. Lucie.  This is a BIG deal.  There are ups and downs in our fight for clean water, but make no mistake: we are WINNING the fight.\n\nhttps://t.co/0Yq7jeoND6","date":"Sun Nov 21 22:57:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We have more satellite office hours coming up this week. If you need assistance with a federal agency, find a location and time near you.\nhttps://t.co/Sqr96IPsqu","date":"Sun Nov 21 21:26:32 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’m calling on the Army Corps to prioritize funding for Everglades Restoration after President Biden left it out of his infrastructure bill. Investing in the Everglades will improve the lives of millions of Floridians!\nhttps://t.co/QudjakrBl6","date":"Sun Nov 21 14:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When the government gets out of the way, business booms and communities thrive. Proud to have Port St. Lucie as a prime example. \nhttps://t.co/gszK5xP2Iv","date":"Sat Nov 20 22:11:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Retiring as Lieutenant Colonel, her duties ranged from software development for aircraft to satellite operations. She tells us that it was the most incredible 32 years of her life, and though it was not easy, she was able to get through thanks to her faith and her family.","date":"Sat Nov 20 21:51:35 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is what America is - fighting for family and one country under God - and her 32-year-long career is proof of that. We salute you, Ms. Dawn Muller, for your selfless dedication for our country.","date":"Sat Nov 20 21:51:35 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today's veteran spotlight is Ms. Dawn Muller, who began her journey in Florida State University’s ROTC in 1981 - back in Reagan's first year as President - and ended in 2013! https://t.co/rioHotoSCC","date":"Sat Nov 20 21:51:34 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This project is a game changer for the water issues facing our community.  I’m proud to have played a role in getting this reservoir across the finish line.  The fight for clean water continues!\nhttps://t.co/ThmVvGGyqK","date":"Sat Nov 20 16:17:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We’re talking #BidensThanksgivingTax, bills to support our veterans, and the latest on OSHA’s vaccine mandate and LOSOM in the latest #WeekInReview ⬇️ https://t.co/KEnUW8j84X","date":"Sat Nov 20 14:00:01 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Just like his service in Vietnam, he spent his whole life with guiding principles of service to others. A few years ago, with the help of many veterans, Mr. Slepakoff was successful in petitioning the PGA National Property Owners Association to build the Veterans Garden.","date":"Sat Nov 20 02:52:16 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"He has been a relentless leader and puts America above all else. Thank you, Mr. Slepakoff, for your service to our nation and to our community.","date":"Sat Nov 20 02:52:16 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today’s veteran spotlight goes to Mr. Paul Slepakoff (second from the left), who was assigned to a mechanized infantry battalion with the 2nd Armored Division. After studying Vietnamese, he served in Vietnam as an advisor to the 18th Division in South Vietnam. https://t.co/KcZltYI4hp","date":"Sat Nov 20 02:52:15 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Inflation is a tax that impacts us all and hits low income families especially hard.  #BidenThanksgivingTax\n\nhttps://t.co/f7xQbkb4cc","date":"Fri Nov 19 21:54:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Congratulations to @Wesley_R_Brooks, a great former member of my staff.  He was a huge asset in the fight for the health of the St. Lucie while he worked in our office and is a huge asset for our entire state as well.  Very well deserved and great selection by @GovRonDeSantis!","date":"Fri Nov 19 21:08:07 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Florida is open for business! https://t.co/cNuwr2Iltv","date":"Fri Nov 19 16:40:14 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The socialist spending bill just passed without any bipartisan support goes against everything that makes our nation great: it’s more government, more taxes and less freedom https://t.co/sKbkAZb17t","date":"Fri Nov 19 15:13:26 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration spent over $1 trillion in what they call a ‘once-in-a-generation’ investment in our nation’s infrastructure, and yet, not $1 of that investment was set aside specifically for Everglades restoration. Florida deserves better.\nhttps://t.co/Qudjak9ZWw","date":"Fri Nov 19 00:47:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden has built less of a border and more of a ‘welcome’ sign to illegals.\nhttps://t.co/eghwVKUWee","date":"Thu Nov 18 23:35:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Mr. Ervin's uplifting endeavor to stay strong in the midst of waves of challenges tells us that there is no mountain too big to climb. We thank Mr. Ervin for his service to our nation.","date":"Thu Nov 18 21:55:03 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Despite these challenges, Mr. Ervin was able to face his own fear and trauma of his past through his faith and art. \n\nAfter his VA counselor and his wife convinced him to pick up his brush again and start painting, his artistic journey has kept him at peace with himself.","date":"Thu Nov 18 21:55:03 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today's #veteran spotlight is on Jimmie Lee Ervin, who served in the U.S. Navy from 1964-1968. While deployed as a radioman in Vietnam, he went through many experiences that left him with post-traumatic stress disorder (PTSD), as well as other medical complications. https://t.co/f26O6x6fIr","date":"Thu Nov 18 21:55:02 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We should never take our freedoms for granted.\n\nIt is the duty of the free to protect and encourage the freedoms of others.\n\nWe stand with the people of Cuba! #SOSCuba\n\nhttps://t.co/FLRwiQWrzS","date":"Thu Nov 18 19:07:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As a descendant of a guard who was  part of George Washington's Life Guard during the Revolutionary War, service is a family tradition for the Landons. https://t.co/JJUHLI3OEA","date":"Thu Nov 18 01:56:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Families like Mr. Landon’s have served as the backbone of our country, and we are indebted to these men and women in uniforms who put their lives on the line for us. We thank you and your family, Mr. Landon, for your service to our nation.","date":"Thu Nov 18 01:56:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Service to the nation can run in the family, and that’s certainly true of today's veteran spotlight. After moving to South Florida, Mr. Michael Landon joined the U.S. Army in 2004 and was deployed to Iraq. https://t.co/pyVnc6CJ4H","date":"Thu Nov 18 01:55:58 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Build Back our Borders.","date":"Wed Nov 17 22:44:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If the Biden Administration is serious about solving the supply chain crisis, they should follow Florida’s example - not California’s. https://t.co/ANdRBAIjnY","date":"Wed Nov 17 21:22:48 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Every decision the Biden Administration made took the situation in Afghanistan from bad to worse. There’s no avoiding that. https://t.co/0lwyrw2EUD","date":"Wed Nov 17 16:42:54 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I guess Nancy Pelosi’s outrage about parades with U.S. military equipment is limited to when President Trump plans them.  The Taliban gets a pass. https://t.co/h2L8r6Bm0W","date":"Wed Nov 17 00:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Taxpayer money should have never gone into cruel cat and monkey experiments in the first place. This is good news for animal lovers across our country.\n\nhttps://t.co/BFvwc9mJ5E","date":"Tue Nov 16 21:56:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The story of Mr. Gallerani tells us about the resilience and valor of our men and women in uniform. I thank and salute you, Mr. Gallerani, for your service to our nation.","date":"Tue Nov 16 20:29:04 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"After walking on his own for a week, he was able to meet a Belgian resistance force, who helped him get through France, Spain, Gibraltar, and finally to England all within a month.","date":"Tue Nov 16 20:29:04 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today’s #veterans spotlight goes to Mr. Bruno Gallerani, who just turned 101 last month! While serving as an airman in World War II, Bruno’s plane was shot down in Belgium. Thankfully, he was able to parachute out to safety, but he was considered to be missing back at home. https://t.co/xGXdo0teDD","date":"Tue Nov 16 20:29:03 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Proud of Florida for leading the charge against these unconstitutional vaccine mandates. \n\nhttps://t.co/GOdNsVwbow","date":"Tue Nov 16 16:21:15 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Today, he is the director of multimedia production at the Benjamin School and mentors the Veterans Appreciation Club at the school. I salute you and thank you, Kenneth Archer, for your selfless service to our country and our community.","date":"Tue Nov 16 01:29:45 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As an honor graduate of Air Force Leadership School, he took on multiple roles during his time in service from decontamination team for chemical weapons use to training dental hygienists and conducting forensics.","date":"Tue Nov 16 01:29:44 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Throughout the month of November, I want to continue to celebrate the veterans in our community.  \nOur first veteran spotlight is Kenneth Archer, who served in the United States Air Force from 1981 to 1995. https://t.co/bp5NYCGm0p","date":"Tue Nov 16 01:29:44 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"To the firefighters and all those who participated in the 10th annual Tequesta Firefighter Chili Cook-Off, I applaud you!\n\nTo the veterans who earned their place among America’s heroes, I salute you! https://t.co/f3pRahFHk0","date":"Mon Nov 15 22:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"COVID-19 cases: ​​📈\nCost of goods and services: 📈\n\nThe only curve the Administration managed to flatten was their polling numbers.","date":"Mon Nov 15 20:52:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thanks to the Treasure Coast Classical Academy for having me last week - great questions from the students about serving in the military and Congress! https://t.co/nooGqLFERe","date":"Mon Nov 15 19:05:43 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As your Representative, I can help with issues you may face with federal agencies, like the VA or Social Security Administration. Our staff is hosting satellite office hours so you can easily meet with someone for assistance. Find a date near you: https://t.co/du8SSSCyL5","date":"Mon Nov 15 17:24:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s America: you make less money, the government takes more of what you make, and you have to spend more of what’s left. \n\nhttps://t.co/fFfvm6uvUL","date":"Sun Nov 14 22:14:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Every decision Biden makes takes us from bad to worse. Record breaking inflation? Spend more money. Gas prices through the roof? Shut down pipelines and limit supply.\n\nhttps://t.co/05tL7ywNU2","date":"Sun Nov 14 14:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Grateful to everyone who’s taken time to thank our veterans for their service and sacrifice. \n\nhttps://t.co/ElSLWINKah","date":"Sat Nov 13 21:53:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We keep learning more and more about Fauci’s cruel experiments on puppies. Why hasn’t the mad scientist been fired? \n\nhttps://t.co/OATbKtpb7c","date":"Sat Nov 13 14:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Tucked inside the Democrats’ 2000+ page socialist spending spree are nearly 7 million green cards for those who entered the country illegally. \n\nhttps://t.co/CjUYixbn3D","date":"Fri Nov 12 22:47:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration is trying to avoid any responsibility, but Floridians have a right to know who is coming into our communities.  I’ll continue to demand accountability. \n\nhttps://t.co/hVRjEjE2fr","date":"Fri Nov 12 20:06:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thanks to the leadership of @GovRonDeSantis and @SFWMD, Florida is making historic progress toward cleaner water for Floridians.","date":"Fri Nov 12 19:09:08 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Congress has provided record funding levels to support the Indian River Lagoon – South projects, and the acquisition of land by SFWMD for the C-25 reservoir will be another critical step forward.","date":"Fri Nov 12 19:07:27 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This project is critical to protecting the Indian River Lagoon and the St. Lucie River by helping to keep nutrient-filled runoff from entering our waterways. \n\nhttps://t.co/jBFGSRrFIr","date":"Fri Nov 12 19:07:05 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Thanks to all the truckers who are working hard to get presents delivered on time this Christmas. #SaveChristmas https://t.co/y5tpi3hEfD","date":"Fri Nov 12 14:37:47 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My message to all those who’ve taken the oath and worn the uniform on this Veterans Day:\n\nhttps://t.co/yXqBg81Lyn","date":"Thu Nov 11 23:25:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Veterans Day reminds us that we can’t take our freedoms for granted. It was hard-won with the blood, sweat and grit of millions of veterans. https://t.co/1yMkg5bHmr","date":"Thu Nov 11 21:05:09 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There are thousands of men and women in our community who are part of our nation’s proud tradition of military service, and it’s an honor to represent them in Congress.  To all who served, I salute you. https://t.co/kSjyHgWdHK","date":"Thu Nov 11 14:00:03 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden is bending to the socialist demands like a windsock. His authoritarian vaccine mandate is proof. https://t.co/DGMOiglF6C","date":"Thu Nov 11 01:15:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Whether you work for a small business or you’re a member of the military, your vaccination status is your business, not your boss’s.  That’s why I introduced the Medical Freedom in the Military Act.\n\nhttps://t.co/ho1cPdihAo","date":"Wed Nov 10 23:40:51 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy 246th birthday, U.S. Marine Corps.  Thanks to their service, Americans have been safe from our enemies abroad. https://t.co/vk39nNmXGM","date":"Wed Nov 10 21:01:39 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We’re facing a doctor and nurse shortage in this country. We should be looking for ways to hire more providers, not finding reasons to fire them. \nhttps://t.co/DdzH7RVd6y","date":"Wed Nov 10 18:02:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Take it from those who are on the front lines: mandates are going to make the supply chain crisis worse.\n\nhttps://t.co/UhruFziCI3","date":"Wed Nov 10 15:38:14 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Meanwhile, the Biden Administration is ready to fight back with the first nonbinary passport and celebrated International Pronouns Day.\nhttps://t.co/JJ1OCgzt9G","date":"Wed Nov 10 00:02:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Shortages of truckers are making the supply chain crisis worse. This is why I introduced a bill that would eliminate red tape and get more drivers on the road.\nhttps://t.co/iB6FB52Lzv","date":"Tue Nov 09 22:04:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s actions in Afghanistan are inexcusable.  But so is the fact that his entire administration has gotten off scot-free. \n\nhttps://t.co/3CIzsNA7Pv","date":"Tue Nov 09 18:42:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ATTN: @POTUS, call your office.","date":"Tue Nov 09 17:57:02 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration must be stopped from infringing on our rights in every facet of our lives.  I will fight this with everything I’ve got!   https://t.co/MRUJ6OcWhz","date":"Tue Nov 09 02:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I introduced the Mandating Responsibility Act, requiring employers to accept liability for any consequence from mandating COVID-19 vaccine to their employees.\n\nIf employers are hellbent on mandating vaccines, we must mandate responsibility on them as well. https://t.co/M9MOyBAIK2","date":"Mon Nov 08 22:36:06 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Gas prices and heating bills 📈\nAmerican independence 📉\nhttps://t.co/o5LLPrcjZb","date":"Mon Nov 08 21:05:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"From “2 weeks to slow the spread” to 600 days. All I can say is it’s about time.\nhttps://t.co/TT61PeDSbT","date":"Mon Nov 08 18:03:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Fauci is getting away with killing beagles, funding dangerous experiments AND lying to Congress.  The time to hold him responsible is long overdue. \nhttps://t.co/MqfC0zSSp9","date":"Mon Nov 08 17:29:22 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s motto: do as I say, not as I do. https://t.co/B27RPPdvGU","date":"Sun Nov 07 22:13:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Looks like politicians on the left are finally starting to realize that we need police. \n\n#BackTheBlue\nhttps://t.co/V1g47liwls","date":"Sun Nov 07 16:17:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If a business is going to mandate that you take a vaccine, it should be mandated that they accept liability for it.\nhttps://t.co/nVSjolPE9z","date":"Sun Nov 07 14:13:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Vaccine mandates are hurting our families, jobs, and freedom. https://t.co/tKphLDNfyP","date":"Sat Nov 06 22:43:55 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration still refuses to accept responsibility for Afghanistan or share any of the planning documents with Congress. What are they hiding?\nhttps://t.co/ogEB9aJSPy","date":"Sat Nov 06 21:02:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"As Veterans Day approaches, it’s great to see communities stepping up to support those who put it all on the line for our country. \nhttps://t.co/orzbVvPWln","date":"Sat Nov 06 15:03:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Interested in what’s actually included in the Democrats’ 2000+ page Socialist Spending Spree? Check out the latest Week in Review: https://t.co/KOU1X11nwc","date":"Sat Nov 06 13:00:01 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"One silver lining of being stuck in D.C. last night - got to spend the flight home this morning with Southeast Florida Honor Flight. Thank you for your service, and welcome home. https://t.co/zrDXNklTQE","date":"Sat Nov 06 12:55:20 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"4/ What is happening now is not a serious attempt at improving our nation’s infrastructure. It is a socialist boondoggle, and the American people should not be forced to pay the bill.","date":"Sat Nov 06 03:40:51 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"3/ For nearly a year, I’ve been asking for the plan to include full funding to restore America’s Everglades, a priority with broad bipartisan support.  Instead, Democrats have chosen to prioritize partisan pet projects like $200 million for a park by Nancy Pelosi’s house.","date":"Sat Nov 06 03:40:35 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"2/ and I will do everything in my power to stop them from continuing down the path toward socialism. Our country needs an investment in critical infrastructure that is done responsibly and without raising taxes.","date":"Sat Nov 06 03:40:18 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"1/ Tonight’s vote was just the start of Democrats’ attempts to jam through a multitrillion dollar socialist wishlist with the largest tax increase in decades to pay for it. Their reckless spending habit has already caused massive inflation and labor shortages,","date":"Sat Nov 06 03:40:01 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Don is a true patriot and it's an honor to call him my friend.","date":"Sat Nov 06 02:21:40 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’d be better for everyone if Pelosi took her talents to Hollywood.","date":"Sat Nov 06 02:05:08 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Spend more money to get more people to sign up for a program that people don’t want.  Makes as much sense as anything else this Administration has done.\nhttps://t.co/JKtIKPkuEy","date":"Sat Nov 06 00:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"https://t.co/aNHeXQmfHo","date":"Fri Nov 05 21:52:04 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s catastrophic withdrawal meant our allies were forced to choose: death or ISIS. They deserve better. https://t.co/kgufoTLSCr","date":"Fri Nov 05 21:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden’s big government fiat does not have the consent of the governed, and Republicans in Congress are going to continue to fight against this vaccine mandate. https://t.co/i29gubFq7b","date":"Fri Nov 05 20:06:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Quick update from the Capitol on this Friday afternoon: Nancy Pelosi is trying to force through a bill that nobody wants. https://t.co/fkHvFGMcLh","date":"Fri Nov 05 17:33:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@SpeakerPelosi https://t.co/H56mqjMHtP","date":"Fri Nov 05 17:18:45 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@SpeakerPelosi is literally trying to buy off journalists to cover her socialist spending bill more favorably.  She is beyond desperate.","date":"Fri Nov 05 16:35:28 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This mentality from the left is absurd. \n\nAmericans don't want a government that prioritizes freeloaders over hardworking taxpayers.","date":"Fri Nov 05 16:13:49 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Parents build America up.","date":"Thu Nov 04 23:24:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s only policy position is “Anything But Trump,” and it is making America less safe.\nhttps://t.co/AOAd7pgd2L","date":"Thu Nov 04 21:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s #TurkeyTax explained: \nhttps://t.co/ItyukIkcqo","date":"Thu Nov 04 19:04:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"2135 pages of socialist giveaways.","date":"Thu Nov 04 17:45:11 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Great to join @RepVanTaylor to honor some of America’s heroes ahead of Veterans Day. https://t.co/S7HOEoWYpl","date":"Thu Nov 04 16:54:21 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The innocent continue to suffer at the hands of the Taliban.\nhttps://t.co/j8Ll4N5rhe","date":"Wed Nov 03 23:35:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s been 2 MONTHS since Biden’s failed Afghanistan withdrawal that cost American lives, and yet the Biden Administration is STILL refusing to show us their withdrawal plan. What are they hiding? https://t.co/VCNRaX1mef","date":"Wed Nov 03 22:17:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Joe Biden pretends “Build Back Better” is about the middle class but then slips in massive tax cuts for blue state billionaires.  You can’t trust anything he says. https://t.co/Zlrci2SBV6","date":"Wed Nov 03 21:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Biden Administration must not be let off the hook for the disaster in Afghanistan.  Officials at all levels need to take responsibility. https://t.co/piuQ9ARvRU","date":"Wed Nov 03 18:32:37 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"By voting to keep police, deep blue city Minneapolis acknowledged that law enforcement officers are an essential part of our communities. We #BackTheBlue all across the United States!","date":"Wed Nov 03 15:58:40 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Kids couldn’t get their costumes thanks to Joe Biden’s #SupplyChain crisis. \n\nAnthony Fauci says we may not be able to see our families for Christmas. \n\nJoe Biden’s #TurkeyTax means this Thanksgiving is set to be the most expensive on record. \n\nThis is not normal.","date":"Tue Nov 02 23:44:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"COVID-19 vaccines are supposed to be about public safety. How safe will we be when there are no firefighters or police officers to respond to emergencies? \n\nhttps://t.co/HuQVdZt1sK","date":"Tue Nov 02 21:24:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If a federal agency or a business is going to mandate that an employee get the COVID-19 vaccine, they need to accept any and all responsibility for the results.  That’s why I introduced the Mandating Responsibility Act. https://t.co/lXfhmt615n","date":"Tue Nov 02 19:03:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"➡️ Average cost to send a kid to college: $107,280\n➡️ Average home value: $269,039\n➡️ Average retirement savings at age 65: $206,819\n\n🚩 Payout to an illegal immigrant: $450,000\n\nPeople work hard to achieve the American Dream. Under Joe Biden, all you have to do is break the law.","date":"Tue Nov 02 00:04:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"If Biden gets his way, there’s more where this came from. #NoVaccineMandates \n\nhttps://t.co/trwkcEez1b","date":"Mon Nov 01 22:45:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"You can’t make this stuff up.","date":"Mon Nov 01 21:59:57 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Parents are the best teachers and the best advocates our kids can have. The government has no right to steamroll and gaslight them.\n\nhttps://t.co/XW06xpLVWc","date":"Mon Nov 01 20:27:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"REMINDER: Completed application packets for service academy nominations must be submitted to my Port St. Lucie office by 5PM tonight!\n\nAdvice to all applicants from Robert: make sure you know your why, and don’t let fear of a challenge keep you from going after your goals! https://t.co/HsUKaOIxoQ","date":"Mon Nov 01 18:35:41 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"ICYMI: The last U.S. troop left Afghanistan two months ago, but there has been no accountability for the unmitigated disaster. Check out my latest video, Timeline of Lies.\nhttps://t.co/0uJ5uuxzqt","date":"Mon Nov 01 13:08:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"What kind of ass-backwards policy is paying people half-a-million dollars for breaking the law? \nhttps://t.co/fAJIKHU9to","date":"Sun Oct 31 18:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Happy Halloween to everyone except the sugar industry. They’ve had a sweet government deal for way too long.\nhttps://t.co/q7yL45bFK0","date":"Sun Oct 31 14:20:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Veterans have made tremendous sacrifices for our nation.  They should be able to see their monuments. \nhttps://t.co/Qv6R3RwUHi","date":"Sat Oct 30 19:03:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Another week of House Democrats pushing their out-of-touch priorities and trying to infringe on the rights of all Americans. https://t.co/JLbmAA3PNS","date":"Sat Oct 30 15:00:01 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"They’re trying to tax Americans into oblivion and turn our country into a socialist dystopia.\n\nhttps://t.co/3iHw6Bel63","date":"Fri Oct 29 22:50:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s vaccine mandate is unconstitutional and anti-American on every level. This is a victory for freedom-loving Americans all across the country. \nhttps://t.co/ISEVYaidGm","date":"Fri Oct 29 19:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"2 months after the withdrawal, there's been no accountability for the disaster in Afghanistan. The media moved on, but we must demand responsibility from the Biden Administration.\n\nI break down exactly what went wrong in a documentary, Timeline of Lies ⬇️\nhttps://t.co/nCXsiPtfbW","date":"Fri Oct 29 18:10:27 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We need to use every tool at our disposal to clean up Florida’s waterways.\nhttps://t.co/UnzumGpXH6","date":"Thu Oct 28 22:13:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"#FauciLiedDogsDied\nhttps://t.co/uvqqO97MqH","date":"Thu Oct 28 21:11:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Excuse me, what? Forget free health care, now Biden is going to give illegal immigrants more compensation than 9/11 victims received?","date":"Thu Oct 28 20:33:43 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"There is still an active hostage crisis taking place in Afghanistan. \n\nThe Biden Administration abandoned Americans at home and abroad. \nhttps://t.co/MuvMQU0r1M","date":"Thu Oct 28 19:59:08 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Florida is leading the fight against Joe Biden’s unconstitutional, big government power grab. NO vaccine mandates! https://t.co/n8BIAQNjQO","date":"Thu Oct 28 18:01:13 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":".@POTUS wants to spend $1.75 trillion but won’t answer a single question about it. https://t.co/A0EcmoBSC9","date":"Thu Oct 28 16:22:52 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"“Those who would give up essential Liberty, to purchase a little temporary Safety, deserve neither Liberty nor Safety.\" -Benjamin Franklin\n\nWhy should Americans give up their fundamental right to privacy, particularly when it comes to doctor-patient confidentiality? https://t.co/RCXEmgtJXs","date":"Thu Oct 28 00:15:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Think the supply chain is broken now?  Just wait until pilots and truckers can’t work because they refused to shut up and do as the government tells them. https://t.co/J7PSsViXkH","date":"Wed Oct 27 23:14:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The cost of heat is already going up, and Democrats’ policies are adding fuel to the fire. \nhttps://t.co/BvtWvgFBr5","date":"Wed Oct 27 21:11:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The Transportation Committee Chair ruled me out of order &amp; told me I was wasting everyone’s time for offering amendments to prohibit vaccine mandates.\n\nI don’t think stopping an unconstitutional order that is going to cost Americans their jobs &amp; livelihoods is a waste of time. https://t.co/WEx1tQxhUY","date":"Wed Oct 27 18:18:55 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When it comes to freedom across the country, Florida should be the standard, not an outlier. https://t.co/9PETBT2epB","date":"Wed Oct 27 00:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"I’ve heard from federal employees across the country who do not want to lose their jobs over an unconstitutional mandate. This is a war on independent thinkers in the federal government. \n\nhttps://t.co/fJqAJxYAG4","date":"Tue Oct 26 21:57:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Apparently anti-Semitism is more important than the environment to the Sunrise Movement.\n\nhttps://t.co/tnYEFX33F7","date":"Tue Oct 26 18:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Every dollar gained by the Taliban is a dollar that will be used to fund terrorism. And Biden’s failed withdrawal has left them a fortune. \n\nhttps://t.co/jd6w39J5jX","date":"Tue Oct 26 15:16:25 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Americans are paying more for everything, and now Congressional Democrats are going to raise their taxes to fund a socialist wishlist. \n\nOut of touch and irresponsible.","date":"Tue Oct 26 00:38:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Out of 40 weekends since his inauguration, Biden spent 20 weekends at his house in Delaware, and 10 weekends at Camp David. He has plenty of time to visit the border. https://t.co/5JjokYEjen","date":"Mon Oct 25 23:16:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Congress is voting to give the soldiers who lost their lives during Biden’s withdrawal from Afghanistan Congressional Gold medals. We owe them so much more &amp; our country owes it to all of our soldiers to lead from a position of strength instead of Biden's weakness. https://t.co/7NBV68BC03","date":"Mon Oct 25 22:18:01 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"People who fund the torture of dogs should be in jail, not making medical decisions that impact our entire country.","date":"Mon Oct 25 22:04:57 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s a sad day when the President of the United States is acting like a character out of a dystopian novel. \n\nhttps://t.co/5nvCG0VlOq","date":"Mon Oct 25 18:55:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s failed economic policies are hurting our kids. \nhttps://t.co/DbxXSpPr25","date":"Mon Oct 25 13:03:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"While California tries to get its act together, Florida is open for business. \nhttps://t.co/NXBUAXPLtR","date":"Mon Oct 25 00:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Veterans Day is coming up, and I want to honor those who’ve served. Submit your photos and stories to FL18.veterans@mail.house.gov today! https://t.co/IdtI3MZE20","date":"Sun Oct 24 21:10:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"We have the most efficient economy in the world - until the government gets in the way. The result is a broken supply chain and higher prices for consumers. \nhttps://t.co/rz9hsjDqNc","date":"Sun Oct 24 17:00:02 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The deadline for nominations to the service academies at West Point, the Naval Academy, the Air Force Academy and the Merchant Marine Academy is ONE WEEK away! \n\nFor more information, head to https://t.co/Ho4UjqOtNH https://t.co/udaVL2dBFv","date":"Sun Oct 24 14:08:23 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Workers are the backbone of this country, and Joe Biden’s policies are breaking America’s back.\nhttps://t.co/7XSDoOhc9C","date":"Sat Oct 23 22:14:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When Russia and China are celebrating, you know something has gone terribly wrong.\nhttps://t.co/lshuJaB3eZ","date":"Sat Oct 23 17:14:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Republican member of Congress is suspended for stating facts, but the spokesperson for the Taliban still has access to his account.","date":"Sat Oct 23 16:24:32 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Immigration crisis, blank checks to foreign countries, the IRS spying on Americans: just another week in Washington. Check out the latest Week In Review ⬇️ https://t.co/MxWT0PFuvt","date":"Sat Oct 23 15:00:02 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"My office is currently accepting intern applications for the spring semester. Congressional interns get a front row seat to the legislative process and have a chance to serve their community. Consider applying today! https://t.co/MDaqs455az https://t.co/Rsqyb7aAzD","date":"Fri Oct 22 23:25:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"At the same time as they try to raise our taxes, House Democrats just voted to send HUNDREDS OF MILLIONS of taxpayer dollars overseas.  They cannot be trusted with our money. https://t.co/hQbb4ejBkb","date":"Fri Oct 22 22:13:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Contrary to what the White House keeps telling you, this spending boondoggle does not cost $0. They’re going to pay for it with the biggest tax hikes in 60 years. ⬇️ https://t.co/UVhaHl0K1N","date":"Fri Oct 22 16:14:56 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Despicable practice by Anthony Fauci's department at @NIH.","date":"Fri Oct 22 14:16:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"House Democrats are covering for Biden and his catastrophic Afghanistan withdrawal. The American people deserve answers, yet they’re blocking the release of all documents. https://t.co/4dLl6IxYgk","date":"Thu Oct 21 23:00:01 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Reports of the Administration flying illegal immigrants to Florida and New York in the dark of night are extremely concerning. The FAA needs to stop this from happening ⬇️ https://t.co/pz22Klb4oY","date":"Thu Oct 21 20:32:01 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"It’s past time for these offices to be open. Our retirees deserve better.","date":"Thu Oct 21 14:53:32 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When the average American maxes out their credit card, they take a hard look at their spending. Why doesn’t the federal government do the same?\nhttps://t.co/h3hTayiWpi","date":"Thu Oct 21 00:07:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"This is the direct result of Biden’s policies. The cost of everything has gone up, and those costs are passed onto you - the consumer. \nhttps://t.co/b39xFqLjKG","date":"Wed Oct 20 21:35:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Sunlight is the best disinfectant. What is the Biden Administration hiding?\nhttps://t.co/ON6yEvHzIo","date":"Wed Oct 20 17:09:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"@POTUS https://t.co/DTVHwvOHWj","date":"Tue Oct 19 23:39:03 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Appreciated the chance to check in with the Ft. Pierce Marine Unit. Our border patrol and homeland security agents are committed to the safety of our nation, and I’m grateful for their service! https://t.co/0Kjz35fy6q","date":"Tue Oct 19 21:30:54 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Good advice from Daniel…except for that last part. #GoArmy\n\nConsidering applying for a service academy?  The deadline is less than 2️⃣ weeks away! https://t.co/guj3zPfM1v","date":"Tue Oct 19 17:25:14 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"#BackTheBlue \n\nhttps://t.co/r9D6VL7STp","date":"Tue Oct 19 15:10:14 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Biden’s solution to the supply chain crisis his Administration created is to have shifts going 24/7. Who does he think is going to fill those jobs when employers already have millions of openings they can’t find employees for? https://t.co/mTKbNY2eYQ","date":"Mon Oct 18 22:51:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"The hypocrisy never ends. \nhttps://t.co/t9E4oIv5TU","date":"Mon Oct 18 19:09:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Surprise, surprise...another hypocrite.","date":"Mon Oct 18 17:25:59 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Back from his 2 month leave in the middle of a supply chain crisis, Pete Buttigieg is trying out a new argument:\n\nThe Biden Administration was SO SUCCESSFUL that your family is now spending $175 more per month for the same quality of living. \n\nIf that is success, COUNT ME OUT!","date":"Mon Oct 18 14:22:09 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"When Congressional Democrats maxed out our country’s credit card, they irresponsibly passed a bill to raise the credit limit by $480 billion. That’s why last week I introduced a bill that would reduce federal spending by $480 billion instead.\n\nhttps://t.co/kx8qkCoMbX","date":"Mon Oct 18 13:12:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"What is Fauci doing?!? American tax dollars...\n👉🏼 should not fund animal cruelty.\n👉🏼 should not fund labs in Russia and China.\n👉🏼 should DEFINITELY NOT fund animal cruelty in Russian and Chinese labs.\n\nhttps://t.co/DaXMiraefz","date":"Sun Oct 17 23:46:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"All these chemicals in our waterways are poisoning our water. Check out the latest Tortured Coast to learn more:\n\nhttps://t.co/UPvTcIBWnk","date":"Sun Oct 17 21:06:00 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"Parents should have a say in what is being taught to their children. Care for the next generation is NOT domestic terrorism.\n\nhttps://t.co/sitVVqhmsN","date":"Sun Oct 17 14:57:12 +0000 2021","user_id":"814103950404239360"},{"handle":"RepBrianMast","text":"You know it’s bad legislation when even the liberal DC media won’t defend it.\n\nhttps://t.co/g25l6p4yrw","date":"Sun Oct 17 13:16:09 +0000 2021","user_id":"814103950404239360"}]