[{"handle":"RepBlaine","text":"Great to meet with @NFIB to discuss how inflation, supply chain challenges and labor shortages are continuing to affect Missouri business owners. \n\nThanks for stopping by! https://t.co/7pPTlfFL9l","date":"Wed Jun 15 17:11:07 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this day in 1777, our government officially adopted the design of the flag. \n\nIt is now a symbol of freedom and American pride around the world 🇺🇸🇺🇸🇺🇸 https://t.co/pGEu3lb3DW","date":"Tue Jun 14 17:09:17 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Birthday to @USArmy! \n\nThank you for defending this nation and our freedom for 247 years. https://t.co/5pobbjuEHI","date":"Tue Jun 14 15:32:10 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"If only someone would have warned them...\n\nhttps://t.co/cfoVpf0LDv","date":"Fri Jun 03 16:21:27 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"@FAFNorwalk has repeatedly said the purpose of CECL is to increase investor transparency.  They got it wrong. \n\nhttps://t.co/31ur05eSPS","date":"Fri Jun 03 16:21:27 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"A very big congratulations to the Russellville and St. Elizabeth baseball teams! Two great programs making our area very proud! \n\nhttps://t.co/W6azqyhq9t","date":"Thu Jun 02 18:25:35 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"While I hope you find a way to kick off your summer this weekend, please don’t forget to remember the sacrifices and American heroes who have made it possible. \n\nWe owe it all to the members of our military and their families. \nhttps://t.co/5qzCuGWCWl","date":"Fri May 27 17:02:19 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"If only the Biden Administration could stop breaking records. \n\nAmerican families need affordable energy now.  \nhttps://t.co/ZMp31jEqHp","date":"Tue May 24 17:00:57 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/9R7tLyz5eG","date":"Fri May 20 22:07:22 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Last week, almost 43% of the U.S. baby formula supply was out of stock in grocery stores. \n\nWhat used to be a simple, every day need for American families has turned into a rare commodity, &amp; the rush to feed our country's babies has become a crisis.\nhttps://t.co/ZeYGs42tmr","date":"Fri May 20 20:16:31 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, @PatrickMcHenry &amp; I led a letter with @FinancialCmte Republicans to @chopracfpb.\n\nCFPB’s new UDAAPs policy &amp; recent changes to CFPB administrative adjudication procedures - that deviate significantly from past practices - are very concerning. \nhttps://t.co/A2FrXoqbhN","date":"Thu May 19 16:09:51 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me TOMORROW for a tele-town hall at 5:30pm CT. I'm looking forward to catching up with the Third District! \n\nTo receive a call, please click here: https://t.co/sitK7fQQig","date":"Tue May 17 20:41:10 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me in thanking a police officer this week. \n\nThey run into danger when everyone else is running away from it, and we are so fortunate to have these brave Missourians protecting our families and our communities every day. \nhttps://t.co/X8vmoCbfQM","date":"Fri May 13 15:50:46 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Fentanyl is so prevalent in our country that it's now the leading cause of death in Americans ages 18-45. It's 100x more potent than morphine &amp; 50x more potent than heroin.\n\nCongress should be doing all we can to stop the spread of this deadly substance.https://t.co/SNxJWWNOdF","date":"Tue May 10 19:49:48 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Small businesses are the embodiment of the American Dream. \n\nThere is something profound about American entrepreneurs betting on themselves &amp; their communities to be their support systems, while simultaneously providing good jobs &amp; economic growth.\nhttps://t.co/1F8pc55TsE","date":"Fri May 06 14:35:36 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":".@CFPB Director Chopra either lied to @FinancialCmte or @BankingGOP &amp; @SenToomey.\n\nWe clearly need to hear directly from OCC Chief Counsel, Benjamin McDonough to understand his role in the hostile takeover of the FDIC. https://t.co/y599J1rX7X","date":"Wed May 04 13:42:37 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/nkE35oYtFQ","date":"Tue May 03 14:27:58 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Biden Admin is saying Title 42 is no longer necessary, w Sec Mayorkas stating “we have effectively managed the border.”\n\nThe #'s show that's empirically untrue &amp; if this critical policy's lifted, border patrol agents could face 18,000 encounters a day.\nhttps://t.co/WcOeWyJqKD","date":"Fri Apr 29 16:04:22 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"-86% of small biz owners were forced to raised prices thanks to inflation\n-68% say they’ll have to do it again in the next 3 months\n-60% of Main Street biz fear they'll close down\n \nPres Biden touting a \"small business boom\" is insulting to U.S. biz owners.https://t.co/VxjmfPmdzP","date":"Thu Apr 28 17:17:45 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Love to see this team reinvesting in the Third District for a great cause!","date":"Tue Apr 26 20:35:09 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Bipartisan members of the @FinancialCmte @FSCDems agree – it is irresponsible to move towards implementation of CECL until the economic effects can be fully understood.\n\nI strongly urge FASB to STOP &amp; STUDY before blindly implementing this significant accounting change. https://t.co/OJWhrDaNj8","date":"Thu May 16 18:03:25 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Being home in Missouri and getting to catch up with many of you is my favorite part of the job. \n\nWhile the bill writing gets done in Washington, D.C., talking to real people about real issues spurs the bill ideas we develop. \nhttps://t.co/is3GNpuoSi","date":"Fri Apr 22 20:21:18 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"This isn’t about science.  It’s about power and control. https://t.co/BK1DaQBm5O","date":"Thu Apr 21 15:03:22 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"This is a flat out lie. \n\nThe Biden Administration’s failed policies and lack of action have gotten our country to this point.","date":"Wed Apr 20 15:39:45 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Last week President Biden extended the Covid Public Health Emergency for 3 more months, but he’s all but inviting hundreds of thousands of untested migrants across the border.  \n\nThe hypocrisy is breathtaking.\nhttps://t.co/IbsTE4x8k0","date":"Mon Apr 18 20:17:37 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing you a Blessed Easter from my family to yours! https://t.co/6QUjtIFuUd","date":"Sun Apr 17 17:04:18 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today is Good Friday &amp; the start of the holiest weekend of the year for Christians around the world.\n\nGod sent His only son to save us from our sins, and this Easter Sunday we will celebrate Jesus’ Resurrection making it a weekend filled with joy &amp; hope.\nhttps://t.co/yEnYU3q6iY","date":"Fri Apr 15 15:24:23 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Don't forget! \n\nJust a couple weeks left to submit entries for the 2022 Congressional Art Competition. https://t.co/swKJEUMPUM","date":"Thu Apr 14 19:06:56 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Restaurants were among the very first businesses to take a hit when the pandemic began. \n\nPPP &amp; EIDL provided emergency funding in record time, but it was clear that it wasn't going to be enough to save all the bars &amp; restaurants fighting to stay afloat.\nhttps://t.co/mNsdapOvZi","date":"Fri Apr 08 20:48:00 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Why we would want to limit the amount of times criminals can be prosecuted and taxpayer dollars can be recovered?","date":"Thu Apr 07 19:01:54 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"There’s an estimated $82.7B in potential fraud in SBA’s COVID relief programs. \n\nBut every House Dem just voted against an amendment to extend the statute of limitations for PPP and EIDL fraud from 5 years to 10 years. That is literally all the amendment did. https://t.co/PaRevQrxi3","date":"Thu Apr 07 19:01:54 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Yesterday in @FinancialCmte, I questioned Sec. Yellen on the delayed Russia sanctions and the need to prepare our economy for a possible Chinese invasion of Taiwan. \n\nICYMI⬇️\nhttps://t.co/84F8IO6rct","date":"Thu Apr 07 14:58:03 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Being a Gold Star Family is a title nobody wants to have.\n\nToday on Gold Star Spouses Day, we honor the servicemembers who gave their lives for this country and thank the military spouses who sacrificed so much. https://t.co/mgCbMAq2GS","date":"Tue Apr 05 14:34:33 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"151,000 Vietnam veterans call MO home &amp; another 1,400 Missourians gave their lives in the war. Sadly, most of our vets haven't seen the Vietnam Memorial or had the opportunity to properly honor the fallen.\n\nThe Honor Flight is a great way for them to that.\nhttps://t.co/7PH47rikXd","date":"Fri Apr 01 17:20:11 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"President Biden could stop releasing our oil reserves if he flipped our domestic energy switch back on. \n\nWe need American oil from American soil. \nhttps://t.co/1m5wTIc70q","date":"Thu Mar 31 17:00:13 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to be with the National Lumber &amp; Building Materials Dealers Association this morning to discuss how inflation, tax increases, labor shortages and supply chain disruptions are affecting small businesses in the industry. \n\nThanks for having me! https://t.co/wd0A7x9mk5","date":"Thu Mar 31 16:22:37 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this #VietnamVeteransDay, please join me in thanking the veterans in Missouri and across America who served our country honorably in Vietnam. \n\nWe're forever grateful for their sacrifice. 🇺🇸\nhttps://t.co/d2nLdmQ2IE","date":"Tue Mar 29 19:35:22 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to be with business owners from the St. Louis area today to discuss what Congress is working on to help Missouri businesses thrive. \n\nThanks for having me! https://t.co/00qZfi0g2i","date":"Fri Mar 25 20:27:09 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Farming &amp; ranching are just about as Missouri as it gets.\n\nOur state runs an $88.4 billion ag industry - mostly consisting of family farms - showing that not only do we have a rich history of farming, but our future as a global ag leader looks very bright.\nhttps://t.co/TVkx7K5dld","date":"Fri Mar 25 16:50:18 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this #NationalAgDay, please join me in celebrating the Missouri farmers and ranchers who feed the world and help our economy thrive. \n\nThank you for keeping our state’s longstanding ag tradition going! https://t.co/Q1LnqrO4uZ","date":"Tue Mar 22 16:01:32 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"At a time when inflation is at a 40-year high &amp; gas prices are breaking records weekly, families in Missouri &amp; across America are hopeful of a timely tax return. I can’t advocate enough for getting your taxes in early &amp; filing electronically if possible.\nhttps://t.co/s05bEKDx7A","date":"Fri Mar 18 18:12:15 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"My office is now accepting entries for the 2022 Congressional Art Competition! https://t.co/4vAvmGzP23","date":"Thu Mar 17 15:25:23 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"A powerful speech from an incredibly courageous leader. Now, America needs to: \n\n❌Provide Ukraine with more military assistance \n❌Get tougher on Russian sanctions to stop funding this war\n❌Hold Putin - a true thug - accountable for countless war crimes \n\n#StandWithUkraine️","date":"Wed Mar 16 14:21:14 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Financial regulation and allocation of capital cannot be based on political ideology. \n\nI hope the Biden Administration will now put forward a serious nominee who will prioritize the safety &amp; soundness of the American financial system. https://t.co/giMONEgqJq","date":"Tue Mar 15 19:35:58 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Relying on foreign oil is a national security issue. Most countries in Europe don’t have the domestic energy supply we have in America, which forces them to be reliant on Russian oil and gas. \n\nAmerica has the resources; we just aren’t using them.\nhttps://t.co/yvqCH3sB2n","date":"Fri Mar 11 14:35:05 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"February saw the fastest inflation acceleration since 1982. \n\nFamilies in Missouri and across American can't afford for the price of gas, groceries and shelter to keep going up. \nhttps://t.co/DCsaAKaVm4","date":"Thu Mar 10 16:43:46 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"This is a step in the right direction. \n\nNow, we need a guarantee that the replacement oil will come from America – not countries with crooked leaders like Venezuela, Saudi Arabia or Iran. \nhttps://t.co/qW8C8wdHTm","date":"Tue Mar 08 20:52:56 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today in @FinancialCmte, I discussed the urgent need to lower inflation by reducing regulations on businesses and workers, &amp; for the Administration to take action to ease the economic burden on American families.\nhttps://t.co/k2IGWlKSz5","date":"Tue Mar 08 20:02:35 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"President Biden would rather go to some of the world’s most corrupt leaders for oil instead of turning the American energy switch back on.\n\nTruly unbelievable.","date":"Mon Mar 07 19:30:26 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"To think the devastation in Ukraine is taking place in the year 2022 is almost unimaginable. Vladimir Putin has invaded a sovereign nation completely unprovoked with the full force of the Russian military behind him. https://t.co/4v0TpaAfR0","date":"Fri Mar 04 22:47:17 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"We won't President Biden increase American oil production?  His top choice for Comptroller of the Currency explained it very clearly. \n\nHer nomination may have failed but her ideology is alive and well in the White House.","date":"Fri Mar 04 17:02:06 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Speaker doesn't understand how gas taxes are collected...","date":"Thu Mar 03 17:31:41 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for stopping by!","date":"Thu Mar 03 16:33:26 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"While the world is in chaos, American families are being suffocated by inflation, businesses can’t find workers, &amp; our borders are being inundated, I had hoped to hear some concrete solutions from President Biden.\n\nICYMI, my full statement on #SOTU: \nhttps://t.co/p6hVRGDrGl","date":"Wed Mar 02 13:52:06 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Agriculture is the lifeblood of our state. \n\nBut just like every other industry, farmers across Missouri are fighting to keep operations going thanks to historic inflation.","date":"Tue Mar 01 19:25:23 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"We must also take meaningful steps to end our dependence on tyrants and dictators for critical resources.","date":"Tue Mar 01 15:27:19 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"This is vital for the safety of the American People, to maintain our position as the world’s largest economy, &amp; to show international onlookers planning to take advantage of this Administration's perceived weakness that further aggressions will not be tolerated.","date":"Tue Mar 01 15:27:19 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Administration and our allies must immediately put in place the harshest sanctions possible - including full removal from SWIFT - and completely isolate Russia and Putin from international markets. \nhttps://t.co/7WMpKI1vAC","date":"Tue Mar 01 15:27:18 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Had a great day on Friday catching up with some Third District manufacturers and the Washington Area Chamber. \n\nThanks for having me! https://t.co/KZi2bsdydA","date":"Mon Feb 28 19:21:04 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Our response to Russia demands the use of all available tools, including removal from SWIFT. Russia has no place in international markets and must be completely isolated from them.  The U.S. economy is 15 times the size of Russia's.  It's time we start acting like it.","date":"Sat Feb 26 19:35:12 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Our nation is currently dealing with historic inflation, a labor crisis, an unsecure southern border and now, a Russian invasion of Ukraine. \n\nWe are all well-aware of the state of the union, &amp; the President must make clear his plan to tackle these issues.\nhttps://t.co/vHMHdCYyDw","date":"Fri Feb 25 16:30:05 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/SRMn2jrA8D","date":"Thu Feb 24 13:46:18 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to @JeffersonCityFD on 180 years! \n\nThank you for all you do to keep our community safe.","date":"Tue Feb 22 18:29:13 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Presidents Day and Birthday to America’s Founding Father! https://t.co/zvbGCTjoxn","date":"Mon Feb 21 16:28:28 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"All Presidents are now celebrated on Presidents Day, but it began as a celebration of George Washington's birthday. \n\nIt was actually the 1st federal holiday to recognize a birthday, &amp; the Father of America is certainly a worthy recipient of such an honor.\nhttps://t.co/1CfYTq9H9R","date":"Fri Feb 18 21:50:20 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"My statement on my friend @RepHagedorn's passing: https://t.co/X2RQFTDBWd","date":"Fri Feb 18 16:54:16 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"We’ve also sent a letter to hold Director Chopra accountable regarding the rulemaking of section 1071 of Dodd-Frank. https://t.co/7rnwqlMyZM https://t.co/mBUYWh7YMY","date":"Thu Feb 17 19:40:04 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"This week, I introduced a 3-bill package with @RepFrenchHill and @RepRWilliams to protect small businesses &amp; financial institutions from @CFPB's costly &amp; invasive data collection practices. https://t.co/4c5a8f8Qge","date":"Thu Feb 17 19:39:56 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Partisan agendas – like Sarah Bloom Raskin’s climate finance activism – have no place at the Federal Reserve.","date":"Wed Feb 09 15:53:16 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Just a reminder that tax season could look different for some Missouri families this year! As always, my office is here to help if you run into issues.","date":"Tue Feb 08 19:26:36 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congress should be doing everything we can to stop the deadly fentanyl that is coming across our border and taking American lives.\n\nBut just last week, House Democrats blocked my legislation to permanently make fentanyl illegal. https://t.co/Y4rF9hayuM","date":"Tue Feb 08 17:47:44 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Remaining competitive with China isn’t a Republican or Democrat issue, it’s an American issue.\n\nBut Democrats' bill is just 3,000 pages of climate change measures, Green New Deal subsidies, &amp; progressive priorities.","date":"Fri Feb 04 17:47:40 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"China may think it’s on its way to becoming the global leader, but any government that operates in such an immoral manner has no business leading the world in anything.","date":"Fri Feb 04 17:47:39 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"With the Olympics starting today in Beijing, all eyes have been on China with growing attention on its extremely disturbing human rights violations and religious persecutions.\nhttps://t.co/7mLQZ15H4X","date":"Fri Feb 04 17:47:39 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, the House passed the misleadingly named “COMPETES Act,” a bill that was supposed to update our laws to give our workers and businesses a boost in competing with China.","date":"Fri Feb 04 17:47:39 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"American families can’t afford the Biden Administration’s failed energy policies. \nhttps://t.co/YkJl3fdRMs","date":"Fri Feb 04 15:08:31 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to meet with some Third District high school students to discuss the importance of youth anti-drug education. \n\nThanks for stopping by! https://t.co/xrVMeKmn41","date":"Thu Feb 03 20:42:54 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Stay safe out there! https://t.co/TbDjX9WtcC","date":"Thu Feb 03 19:44:35 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"The focus of America’s top banking supervisor should be the health and success of our nation’s financial system, but Sarah Bloom Raskin’s prior statements criticizing our nation’s energy providers indicate otherwise. https://t.co/lJipFYUrXn","date":"Wed Feb 02 15:30:11 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri state parks are breaking records! \n\nWhile it’s a bit chilly for it now, it’s not too early to start planning a family outing to enjoy the natural beauty that can only be found in our state.\nhttps://t.co/GevhxIN1JQ","date":"Mon Jan 31 21:08:03 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"There is one week left to participate in the Valentines for Veterans program! I hope you’ll join this year to brighten a fellow Missourian’s day. https://t.co/oJmZ9TRjhq","date":"Fri Jan 28 21:03:05 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me in praying for these Missouri officers’ recovery and for an end to the attacks on law enforcement. They risk their lives every day to keep us safe and we will never be able to repay their sacrifice. https://t.co/QgXoOmMZtw","date":"Wed Jan 26 21:58:15 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"With mask mandates, closures, and questionable curriculum in our schools, it’s more important than ever that parents have the final say in their children’s education. #SchoolChoice https://t.co/BJeQlmKwIh","date":"Tue Jan 25 18:24:06 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"We know that at just 5 weeks babies have heartbeats, and their blood vessels, spinal cords, and brains have begun to develop. They are our most vulnerable population. We must protect them. \n\nhttps://t.co/BVhcCdM6VU","date":"Fri Jan 21 20:17:32 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"⚫️Grocery store shelves are empty\n⚫️Inflation's at a 40-year high\n⚫️Gas prices went up 49.6% in 1 year\n⚫️Jobless claims just hit the highest level since last October\n\n‼️ @JoeBiden claiming America is in a “better place” after one year of his leadership is objectively untrue.","date":"Thu Jan 20 18:55:26 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Don’t forget! The deadline for Valentines for Veterans is Friday, February 4th. \n \nGuidelines on how to submit kind notes for Third District veterans this Valentine’s Day here: https://t.co/Nk6OULC2BG","date":"Thu Jan 20 15:07:10 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Dr. Martin Luther King Jr. was one of the most unifying, courageous and influential Americans to ever call this country home. \n\nOn this #MLKDay, please join me in honoring his incredible life and legacy.","date":"Mon Jan 17 15:35:16 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"We’re almost halfway through January, which means tax season is upon us. The biggest suggestion I can give this year is to file early &amp; electronically if possible.\n\nAs always, my office is here to be a liaison between you &amp; the IRS when you run into issues.https://t.co/T4dqi7FmpY","date":"Fri Jan 14 21:28:31 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"I applaud the Supreme Court for upholding the Constitution and blocking the Biden Administration’s overreaching vaccine mandate on American businesses.\n\nThis decision is a step in the right direction for economic freedom &amp; small businesses across the U.S. https://t.co/4b6k9qP69F","date":"Thu Jan 13 20:50:51 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"(5/5) And it would give BILLIONS of taxpayer dollars to Congressional campaigns. \n\nIf signed into law, Speaker Pelosi would receive 22.7 million dollars from the government for her campaign.","date":"Thu Jan 13 20:04:03 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"(4/5) It would force states to stop requiring a photo ID to vote and allow illegal immigrants to vote, completely compromising our election integrity.","date":"Thu Jan 13 20:03:15 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"(3/5/) It would force every state in the country to legalize ballot harvesting.","date":"Thu Jan 13 20:02:33 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"(2/5) It would make the U.S. Attorney General the “Election Czar” with the power to change state election laws at will, and put Washington bureaucrats in charge of elections across the country.","date":"Thu Jan 13 20:01:10 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"(1/5) Democrats’ “voting rights” bill is nothing more than another attempt to federalize our elections and threaten our democracy. \n\nMind you, 2020 saw the highest number of votes cast in our nation’s history.","date":"Thu Jan 13 19:55:07 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"A big thanks to Jan Oliver for your years of public service and hard work on behalf of American small businesses on @HSBCgop. \n\nEnjoy your well-earned retirement! https://t.co/9KWIuaRlxo","date":"Thu Jan 13 19:33:33 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"The highest inflation rate in 40 years. \n\nAmerican families are paying more for almost everything and there’s no end in sight.\nhttps://t.co/jhDXgKUw8l","date":"Wed Jan 12 15:25:24 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today is #HumanTraffickingAwarenessDay, and Missouri is doing its part to put an end to this horrible problem and keep our communities safe.\n\nFor more information on how to recognize and report suspected human trafficking, click here: \nhttps://t.co/EdxKJvGjRz","date":"Tue Jan 11 20:32:37 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations @GaryPinkel on this well-deserved honor!\n\n@MizzouFootball was lucky to have so many years of your dedication and leadership. #MIZ 🐯🏈\nhttps://t.co/TZIRXKAtxg","date":"Mon Jan 10 23:35:53 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Every February, the 3rd District comes together to send  valentines to Missouri veterans, letting them know how grateful we are for the sacrifices they’ve made to keep us safe. While these notes are a small token of gratitude, they make a big impact. \nhttps://t.co/Nk6OULC2BG","date":"Mon Jan 10 17:00:30 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri families have been fighting to keep businesses open, kids in school, bills paid, &amp; their freedom in tact since March 2020, &amp; I can't tell you how hopeful I am that this will be the year life finally goes back to the way it should be in our state.\nhttps://t.co/M24AlYaHcc","date":"Fri Jan 07 21:15:59 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Serving the Third District is my absolute honor, &amp; I’ll continue doing everything I can to make life in MO the best it can be.\n\nWith a new year comes a fresh start, &amp; I’m very much looking forward to that in 2022. Wishing you a happy &amp; healthy new year!\nhttps://t.co/kVpIfDdiP7","date":"Sat Jan 01 22:13:25 +0000 2022","user_id":"1849261916"},{"handle":"RepBlaine","text":"Chairman McWilliams' service is greatly appreciated and her leadership will be sorely missed.","date":"Fri Dec 31 22:04:50 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Born under socialist rule, Jelena McWilliams has a deep appreciation for capitalism, and knows all too well the danger that faces Americans if it's taken away. https://t.co/thY51VsRqV","date":"Fri Dec 31 22:03:58 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today I joined @newsmax to discuss a recent poll showing 48% of American adults say they're worse off economically than 1 year ago, &amp; the raging inflation we are seeing under the Biden Administration.\nhttps://t.co/hzDqPiJHrY","date":"Thu Dec 30 16:01:03 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/qGL5XA6TR4","date":"Sat Dec 25 16:34:58 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"It’s hard to believe this year is already coming to an end, but today is Christmas Eve! \n\nAs we celebrate the birth of our Lord, it’s also a wonderful time to think about how fortunate we are to live in the finest state in the greatest country on earth.\nhttps://t.co/mHhhbtqzN0","date":"Fri Dec 24 20:10:40 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Our state’s longstanding farming tradition is thriving! \n\nThank you to all our farmers who make Missouri a major supplier for not just the nation, but the entire world.","date":"Mon Dec 20 21:31:54 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"For anyone in the Third District in need of support following last week’s tornados, @RedCrossMO has set up a resource center in Defiance.","date":"Fri Dec 17 16:42:19 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, the bill to honor the lives of the servicemembers we lost in Kabul was signed into law.\n\nOur continued prayers are with the Schmitz family &amp; families of all 13 of these brave soldiers as they face the first holiday season without their loved ones. \nhttps://t.co/8MCwwZfpXJ","date":"Thu Dec 16 19:49:09 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Unfortunately, President Biden’s failed policies continue to make history. \n\nThe American people shouldn’t have to put up with this, especially during the holiday season. https://t.co/5ZaRx8TWyr","date":"Tue Dec 14 15:42:22 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Democrats may wish Chopra's actions were not an illegal attempt to govern an entirely separate agency, but that doesn't make it true. \n\nHis actions are completely unacceptable. \nhttps://t.co/SazwBEaaNT","date":"Tue Dec 14 14:24:35 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Birthday to the National Guard and thank you to all who serve! https://t.co/y9DLgUaAK7","date":"Mon Dec 13 21:45:15 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"A truly horrible night in Missouri. Jackie and I are heartbroken for the families who lost loved ones, and we’re praying for the recovery of those injured. We will do everything we can to assist local, state and federal efforts to recover and rebuild.\nhttps://t.co/NcKCbCqSQd","date":"Sat Dec 11 16:43:11 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Christmas is 2 weeks away, &amp; the excitement of the holiday season is all around. This time of year, Missourians' biggest concern should be whether or not we get a white Christmas. Unfortunately, a major issue this winter is the energy crisis we're facing.\nhttps://t.co/1JjFKXQ2M3","date":"Fri Dec 10 22:02:05 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"My statement on Director Chopra's failed attempt to seize authority from FDIC:\nhttps://t.co/vsM1Okgwex","date":"Thu Dec 09 23:16:52 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the Cougars on their STATE CHAMPIONSHIP TITLE and an incredible game! Making the Third District proud!\nhttps://t.co/Wo0FanCaGD","date":"Thu Dec 09 19:34:52 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Professor Omarova’s radical beliefs showed that if confirmed, she had the potential to devastate the U.S. economy. \n\nShe was only one of many alarming nominees, but I’m hopeful her withdrawal is an indicator of a shift toward common sense in Washington. \nhttps://t.co/FZwFJtX5U3","date":"Wed Dec 08 14:26:28 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, on the 80th anniversary of the attack on #PearlHarbor, we remember the 2,403 Americans we lost &amp; thank the veterans from the Greatest Generation who served our nation that day.\n \nThis “date which will live in infamy” will always remind us that freedom does not come free. https://t.co/fNnWW6AFVf","date":"Tue Dec 07 17:07:01 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"On Friday, @FERC announced it would extend the temporary emergency certificate for the STL Pipeline. \n\nThis will provide critical access to affordable and reliable clean natural gas to allow Missouri families to get safely through this winter. https://t.co/fO3Zkqjddv","date":"Mon Dec 06 16:08:57 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Tragically, we lost a record 100,000 American lives to overdose deaths this year, per the CDC.\n\nToo many families have lost loves ones to addiction. Instead of partisan spending bills, we need to pass legislation to put this devastating epidemic to an end.https://t.co/z5YK6I3vMd","date":"Fri Dec 03 15:52:57 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks, Charles! Small businesses deserve better than a cabinet member who ignores the law.","date":"Wed Dec 01 19:20:19 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The tragic Roe v. Wade decision took place almost 50 years ago, and in that time modern medicine has very clearly proven what pro-life America has been saying all along: an unborn baby is a human life. \nhttps://t.co/Fbx6UwxHEk","date":"Wed Dec 01 14:36:15 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"As @CFPB's 1st director, Richard Cordray made it his mission to bog down the U.S. financial services industry with as many regulations as possible. \n\nHis confirmation would simply further President Biden’s federal takeover of our banking &amp; financial system.https://t.co/ratiaaghjz","date":"Tue Nov 30 16:38:22 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Hope you enjoyed a Thanksgiving surrounded by loved ones &amp; a bit too much food! \n\nAs we shift our focus to Christmas, don't forget tomorrow is #SmallBusinessSaturday &amp; that local small biz offer many of the same &amp; even better options than the retail giants.https://t.co/lO9SNc6PxC","date":"Fri Nov 26 16:33:39 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wow, the answer to skyrocketing energy prices is more oil? \n\nIf only you'd known this when you shut down pipelines and American energy production.","date":"Tue Nov 23 15:17:37 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"I look forward to working with Jay Powell as the Fed addresses the record inflation with which families across the country are struggling and to maintain the responsible approach to supervision our economy needs to fully recover.\nhttps://t.co/OgbxvOiKIr","date":"Tue Nov 23 14:36:03 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Going into Thanksgiving, I hope you're able to gather with family and friends around a table to count your blessings and reflect on all there is to be thankful for this year.\nhttps://t.co/kLpcOZLorO","date":"Mon Nov 22 20:02:26 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(10/10) While this bill has passed the House, that doesn't necessarily mean it will become law. \n\nI'll continue fighting this proposal and urge my Senate colleagues not to make the same disastrous mistake Democrats in the House just made under Speaker Pelosi’s leadership.","date":"Fri Nov 19 15:47:21 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(9/10) And $4.9 million for butterflies.","date":"Fri Nov 19 15:46:13 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(8/10) $2.5 billion for “tree equity.”","date":"Fri Nov 19 15:45:54 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(7/10) $100 billion for backdoor amnesty to allow millions of illegal immigrants to obtain 5-year renewable visas.","date":"Fri Nov 19 15:45:30 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(6/10) Tax breaks for Ivy League Schools and Universities, including $7.8 billion in an “environmental justice tax credit” for schools that support climate change studies.","date":"Fri Nov 19 15:45:07 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(5/10) Electric vehicle subsidies for households making $500,000 a year.","date":"Fri Nov 19 15:44:43 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(4/10) A Natural Gas Tax that would raise American families’ bills by up to 30% a year.","date":"Fri Nov 19 15:43:53 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(3/10) A $285 billion tax cut for the wealthy in high tax states.","date":"Fri Nov 19 15:43:03 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(2/10) This bill includes more harmful provisions than you can count, like a 20-30% tax increase on middle class Americans.","date":"Fri Nov 19 15:42:24 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(1/10) My statement on Democrats' Socialist Spending Spree: https://t.co/FYhbaoLLoE","date":"Fri Nov 19 15:40:01 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"I certainly hope my Senate colleagues on both sides of the aisle understand that having Professor Omarova as the primary bank regulator in this country would be absolutely devastating to our financial system and the American economy. https://t.co/ocy6kKWFAE","date":"Thu Nov 18 15:30:14 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Once again common sense and basic economics elude this White House. You celebrated cutting off U.S. oil and natural gas supplies. \n\nNice try, but the American People aren’t stupid.","date":"Wed Nov 17 18:31:20 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Having the federal government operate as a direct lender through SBA would crowd out the private market and compete with America's community banks and other financial institutions. \n\nToday, @RepFrenchHill and I sent a letter to @SBAgov to stop this:\nhttps://t.co/LfmdajveX7","date":"Wed Nov 17 16:50:45 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me for a tele-town hall TONIGHT at 5:15pm CT! \n\nTo participate, sign up here by 1:00pm CT: https://t.co/sitK7fQQig","date":"Wed Nov 17 15:20:01 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me this WEDNESDAY, November 17th at 5:15pm CT for a tele-town hall! Looking forward to hearing from the Third District and discussing what Congress has been working on. \n\nSign up to participate here: https://t.co/sitK7fQQig","date":"Mon Nov 15 21:56:27 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"On Friday, I led a letter to @FERC requesting an extension of the temporary emergency certificate that authorizes continued operations of the Spire STL Pipeline, providing critical access to affordable natural gas for Missouri families this winter. https://t.co/MXzKRRgy1u","date":"Mon Nov 15 15:55:07 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"We live in the greatest country in the world, and that is all thanks to the incredible men and women who have answered the call to serve.\n\nTo all the veterans and military families in the Third District, thank you.\nhttps://t.co/kOerq5AltI","date":"Fri Nov 12 21:55:21 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this #VeteransDay, please join me in expressing our deepest gratitude to the Missourians who have served and continue to serve our country so we can live in freedom. \n\nWe’re thankful for your sacrifice today and every day. https://t.co/D64MN7kd1n","date":"Thu Nov 11 16:57:00 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Just listen to what the Administration is saying… President Biden’s nominee for Comptroller - the same person who wants to “end banking as we know it” - wants American companies to go bankrupt. \n\nPrivate sector failure is their goal.","date":"Wed Nov 10 21:19:22 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to be with the Jefferson City Chamber for their Business Leadership Summit today to give an update on what’s happening in Washington, DC and discuss all the great things they’re doing for Missouri’s economy. \n\nThanks for having me! https://t.co/EiuvvrUyQU","date":"Wed Nov 10 20:54:09 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy 246th Birthday to @USMC! Thank you to all the brave #Marines who have been keeping our nation safe since 1775. https://t.co/9x7oFuoWWq","date":"Wed Nov 10 16:30:58 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Republicans &amp; Democrats can both agree that America’s traditional infrastructure – roads, waterways, bridges, railways, broadband – needs improving. But House Democrats’ \"infrastructure\" bill is nothing more than the Green New Deal 2.0.\n\nMy full statement:https://t.co/KyGvjsSyCi","date":"Sat Nov 06 03:45:54 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"This morning I held a roundtable on Democrats' IRS reporting regime proposal.\n\nTheir bill changes daily, &amp; something that Treasury estimated will raise $460 billion in revenue is a juicy payfor whenever Democrats want to pass a radical tax &amp; spend agenda. https://t.co/bphk97LH6l https://t.co/1wS6NZR2R3","date":"Fri Nov 05 16:30:37 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, I had the honor of hosting a showcase &amp; roundtable in Washington, DC  in honor of #NationVeteransSmallBusinessWeek. \n\nNot only have these people served our nation, but they’re serving our communities and keeping our local economies afloat. Thank you all for a great day! 🇺🇸 https://t.co/lFsEI62CCn","date":"Thu Nov 04 22:38:17 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"This unconstitutional overreach from the Biden Administration will result in even fewer people working and more people depending on the government from home. \n\nJust like they want it.\nhttps://t.co/X7ps8Ko575","date":"Thu Nov 04 15:03:42 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Ironic that on the same day voters in Virginia, Minneapolis, Buffalo, and towns across the country resoundingly rejected this Administration’s radical agenda, President Biden made his most radical nomination yet.\nhttps://t.co/dzWnNEJNTO","date":"Wed Nov 03 19:27:29 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, voters in Virginia made clear what people in Missouri &amp; across the U.S. have been saying for months: our children won't be used to push radical agendas and undermine our country.\n\nCongratulations, Governor-Elect Youngkin! \nhttps://t.co/CGetQYWDIB","date":"Wed Nov 03 04:11:44 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, I’ll be joining @GOPLeader to discuss how the Democrats’ socialist spending bill would devastate American small businesses and what Republicans can do to stop them. \n\nTUNE IN at 2:45 EST/1:45 CT! https://t.co/BIYXz7Nq9g","date":"Tue Nov 02 18:10:10 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(4/4) And a proud grandpa moment - the St. Elizabeth Hornets came in third place in the State Tournament! \n\nVery proud to represent all these outstanding teams! https://t.co/t9xiMrzHIq","date":"Tue Nov 02 15:57:17 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(3/4) Congratulations to the Washington Blue Jays on their Class 4 State Championship title!","date":"Tue Nov 02 15:52:03 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(2/4) The Blair Oaks Falcons clinched an incredible Class 3 State Championship win against Chillicothe!","date":"Tue Nov 02 15:47:46 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"(1/4) Last week was a big one for 3rd District softball! \n\n🥎New Bloomfield\n🥎Elsberry\n🥎Iberia\n🥎Silex\n🥎St. Charles West\n🥎Sullivan\n🥎Fulton\n🥎Warrenton\n🥎Troy Buchanan \n\nall made it to the State Tournament and should be proud of hard-fought seasons!","date":"Tue Nov 02 15:46:34 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanksgiving and Christmas will be here before we know it. This year, it's important to get a jump on shopping for favorite holiday foods and gifts for loved ones as inflation &amp; the supply chain crisis is putting American families in a precarious position.\nhttps://t.co/87l2sxumrW","date":"Fri Oct 29 20:12:34 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Fall Softball Championships are here and the Third District teams are looking good! Wishing everyone good luck and a great game!","date":"Fri Oct 29 16:26:32 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Americans are paying more for groceries, gas, and clothes, and President Biden wants to pay people for coming to this country illegally? \n\nTruly unbelievable.\nhttps://t.co/7hFgaGJk18","date":"Fri Oct 29 15:33:55 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today is National First Responders Day and a great opportunity to thank the Missouri police officers, firefighters, EMTs and all first responders who run toward danger to keep the rest of us safe. We’re grateful today and everyday for all you do!\n\nhttps://t.co/PPECIzMZOS","date":"Thu Oct 28 18:39:49 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"This socialist proposal would burden financial institutions &amp; small businesses, and compromise the financial privacy of households across the country. \n\nCongress and American citizens have a right to know what’s in it. https://t.co/Y30xI2XQd1","date":"Wed Oct 27 16:16:52 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":".@PatrickMcHenry &amp; I are calling for a hearing on the Democrats’ IRS reporting proposal. \n\nWith Democrats operating completely behind the scenes, Congress must provide transparency on this disastrous idea that would impact the majority of Americans. https://t.co/a7sSmHUHsv","date":"Wed Oct 27 16:06:40 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"We will never forget the sacrifice Wentzville native, Marine Lance Corporal Jared Schmitz &amp; 12 other brave Americans made for our freedom. https://t.co/FnmZSov342","date":"Tue Oct 26 17:12:31 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The House has passed a bill to posthumously award Congressional Gold Medals to the heroes we lost in the Kabul attack.\n\nI was proud to cosponsor this bill to honor these soldiers, including a son of Missouri, &amp; express our deep gratitude to their families. https://t.co/rbOZ16vgN6","date":"Tue Oct 26 17:10:38 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Glad to see the NSBA walking back this outrageous language. \n\nParents have every right to voice their concerns over the radical agenda being taught in too many of America's schools.\nhttps://t.co/dc2JdxbZuY","date":"Mon Oct 25 17:59:40 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Every effort to make government run more efficiently &amp; keep it from unnecessarily interfering w/ our economy is a win for all of us.\n\nOnce the Guidance Clarity Act receives Senate passage, we'll have succeeded in making the government a little bit smaller.\nhttps://t.co/0jZml7aylu","date":"Fri Oct 22 19:32:04 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Democrats' IRS reporting proposal isn't about finding tax dollars. It's about a socialist takeover of the government and the government snooping on your daily activities and accounts. \n\nThis is nonsense.\nhttps://t.co/2Jw4suHbau","date":"Thu Oct 21 19:51:07 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"This bill will help regulators do their jobs more efficiently and small businesses, who lack the resources to employ teams of lawyers to navigate the regulatory maze, continue to create jobs and grow the economy.","date":"Wed Oct 20 19:31:11 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"My Guidance Clarity Act is a commonsense fix that requires federal agencies to include a plain language statement on guidance documents clarifying that guidance does not have the force or effect of law. \n\nVery proud to see this bill pass the House today! https://t.co/7FNnPEt8s9","date":"Wed Oct 20 19:30:38 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The government takeover of financial services or any industry is explicitly un-American. But the proof is right here for all of us to see. \n\n⬇️My @FoxBusiness op-ed:\nhttps://t.co/8ROyuyPxIQ","date":"Wed Oct 20 16:12:11 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"As shelves across country remain empty, Jen Psaki thinks it’s appropriate to make jokes? \n\nAmerican businesses are suffering and the Biden Administration can’t be bothered to doing anything about it.\nhttps://t.co/WqCMNKxJ8P","date":"Tue Oct 19 20:50:03 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/micG4VTyjl","date":"Mon Oct 18 19:55:24 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Birthday @USNavy! \n\nThank you to all who serve at home and at sea. 🇺🇸","date":"Wed Oct 13 20:14:22 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"#BreastCancerAwarenessMonth is a great opportunity to spread awareness about the need for screening/early detection, as well as offering support &amp; prayers for survivors, those fighting for their lives, &amp; the ones we've tragically lost to breast cancer.https://t.co/6Z6q1wQkSI","date":"Fri Oct 08 19:31:02 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"What an incredible accomplishment - Fulton Middle School Principal, Beth Houf has been named the National Principal of the Year. The 3rd District is so fortunate to have educators like Principal Houf going above &amp; beyond for our students.\n\nCongratulations!\nhttps://t.co/X3vUymnx4M","date":"Fri Oct 08 15:26:44 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"President Biden forfeited Bagram Air Base and the 7,000 terrorists held there, only to have one of them take the lives of 13 Americans. \n\nAn absolute failure of leadership.https://t.co/Z8tUtEDp01","date":"Wed Oct 06 18:03:08 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"\"This is about Democrats funding additional debt &amp; programs. And they want us to join them &amp; institute socialism into our government in an even greater style? I don’t think so. Especially when you’re raising taxes to do it.\"\n\n⬇️My interview with @newsmax:\nhttps://t.co/fJ64dkceAc","date":"Tue Oct 05 15:35:20 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Democrats are putting the government in direct competition with the smallest financial institutions in the country... it's long past time we put an end to government direct lending. \n\nICYMI, my @CNBC  op-ed: https://t.co/60oZ1V0JeW","date":"Mon Oct 04 15:29:09 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"There are several practical issues w/ Democrats' $600 reporting proposal, like the IRS’s inability to do its current job, but the intent is clear: Washington Democrats want the government to monitor - &amp; therefore control - how and when you spend your money.https://t.co/eYmCtAJQht","date":"Fri Oct 01 19:13:30 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"History has shown too many times that the government’s shortcomings end with American citizens paying the price. It needs to stop.\n\n⬇️My @CNBC op-ed: https://t.co/60oZ1V0JeW","date":"Fri Oct 01 13:55:11 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The ability to protect your property, family &amp; yourself is a fundamentally American right that I firmly believe in, &amp; I'll continue to be a strong defender of the 2nd Amendment.\n\nI signed onto a letter urging removal of the “red flag” provision in the NDAA.https://t.co/6kCx3456OT","date":"Thu Sep 30 15:21:34 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"President Biden caught lying to the American people to defend his reckless policy decisions once again...  \nhttps://t.co/H3nh94XT8S","date":"Wed Sep 29 15:04:56 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Let's go birds!⚾️⚾️⚾️","date":"Wed Sep 29 12:47:45 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"President Biden is so out of touch he thinks Democrats’ massive $4.3 trillion spending package will cost “zero dollars.” \n\nHe should probably double-check that price tag before signing off on the largest spending bill and tax increase in American history.","date":"Mon Sep 27 20:17:16 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"No bipartisan bill is perfect, but our military is too important to let politics get in the way &amp; I was proud to vote for the 2022 NDAA. \n\nOur men &amp; women in uniform protect us every day, &amp; I'll continue to do everything I can in Congress to support them.https://t.co/Y6WERQ9Cm4","date":"Fri Sep 24 21:01:53 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"House Democrats want to remove almost all protections for the unborn at both state and federal levels with their Abortion on Demand Until Birth Act. If signed into law, this devastating bill will allow abortions for nearly any reason up until birth. \n\nAbsolutely horrifying. https://t.co/mQi0voBAZG","date":"Fri Sep 24 15:39:30 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/nqXiCzYEzA","date":"Tue Sep 21 21:34:47 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The radical Left’s outright disdain for Israel and disregard for the safety of innocent civilians against terrorists is unacceptable. \n\nSpeaker Pelosi has once again lost control of her party and Israel could unfortunately pay the price. #StandWithIsrael https://t.co/fT1hy4XILE","date":"Tue Sep 21 18:36:42 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"As the top Republican on @HSBCgop, it's my job to ensure small businesses in Missouri and across America have the freedom, resources, and support they need to thrive and keep our communities in business, &amp; one I take very seriously. https://t.co/ZPqnHKzPXd","date":"Fri Sep 17 20:56:46 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Burying a child is the absolute worst thing that can happen to a parent. Please continue showing support for the Schmitz family.\n\nLance Cpl. Jared Schmitz died a hero and will never be forgotten. 🇺🇸\nhttps://t.co/DDyOzreyRl","date":"Thu Sep 16 14:33:18 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to meet with some Third District business owners this morning for a roundtable in honor of Small Business Week. Business owners like them provide good jobs and keep Missouri's economy going. \n\nThanks for having me! https://t.co/m6bQI5MGqU","date":"Wed Sep 15 18:57:32 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"I've introduced a resolution to honor the lives of the 56 Missourians who gave their lives for this country in the War on Terror in Afghanistan.\n\nMissouri will never be able to repay these families for their service &amp; sacrifice, but we will always remember.https://t.co/MYq0NAk72q","date":"Wed Sep 15 13:44:16 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Very grateful to receive the Defender of Small Business Award from @JobCreatorsUSA &amp; participate in their Small Business Bus Tour in Jefferson City. \n\nAs small businesses continue to lead our economic recovery, we must ensure they’re free to operate without government overreach. https://t.co/rRunWGRr8j","date":"Mon Sep 13 17:13:27 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for having me!","date":"Mon Sep 13 16:25:47 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"As we observe this solemn day, please join me in praying for the families of the victims, first responders and heroes we lost on that fateful September day, &amp; the members of our military who made the ultimate sacrifice in the War on Terror. \n\n20 years later, we will never forget. https://t.co/iou7JLIVbJ","date":"Sat Sep 11 16:00:12 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"September 11th, 2001 was one of the most consequential, difficult days in American memory. As we observe the 20th anniversary of that terrible September day tomorrow, we are unfortunately feeling the aftershocks more than ever. https://t.co/AkR0HBV7yr","date":"Fri Sep 10 20:26:39 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/AI0P0vyJgn","date":"Thu Sep 09 22:46:33 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"She refuses to travel to the southern border, comment on Afghanistan or even take a reporter’s question, but the VP cleared her schedule to fly to CA and campaign for her floundering pal Gavin Newsome. \nhttps://t.co/QAWROsazLk","date":"Wed Sep 08 20:04:46 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"More proof that President Biden’s spend first, ask questions later policies are devastating our economy. His Administration continues to pay people to stay home, while American businesses desperately seek workers to keep their doors open. https://t.co/XDYbRLmrF1","date":"Fri Sep 03 18:14:34 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"This weekend we celebrate Labor Day &amp; summer's unofficial end. Kids are back in school, temperatures will dip under 100 degrees, fall sports have begun &amp; we all settle back into our regular routines. \n\nWishing you all a safe &amp; enjoyable Labor Day weekend! https://t.co/IcfBmip9yk","date":"Fri Sep 03 17:42:15 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wonderful evening at the @MOFarmBureau 3rd District Appreciation Dinner. With 2/3 of our state covered in farmland, Missouri’s long-standing ag tradition is alive and well thanks to our dedicated farmers &amp; ranchers. \n\nAppreciate you having me and thank you for all you do! https://t.co/d1jQv4HBrn","date":"Wed Sep 01 18:53:35 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to be in WashMO today for a small business roundtable. We discussed workforce and unemployment issues as well as the need to prevent government overregulation so they can continue service their local communities and economies.  \n\nThanks for having me! https://t.co/Kh2jIEnIxE","date":"Tue Aug 31 20:44:56 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thousands of Americans were able to rejoin their families because Lance Corporal Jared Schmitz gave his life in their defense. His life &amp; sacrifice won't be forgotten. \n\nWe're forever grateful to Jared &amp; his family &amp; continue to hold them in our prayers. https://t.co/ig17greGxe","date":"Tue Aug 31 16:13:47 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"My statement on the death of Wentzville native, Marine Lance Corporal Jared Schmitz: https://t.co/xBFenIrEu2","date":"Fri Aug 27 19:43:13 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"We're all sickened &amp; angered by the footage from Afghanistan, but I can only imagine the pain the families of our soldiers are feeling. \n\nThere's nothing I can write in this column to ease that pain, but those soldiers &amp; their families are in my prayers.https://t.co/ZSKL4BUPVX","date":"Fri Aug 27 13:44:06 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/IK8qhEWgcI","date":"Thu Aug 26 17:09:53 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Had a great time attending the @i3Broadband ribbon cutting last week. \n\nThey’re investing over $100 million in fiber optic, high-speed internet services in the greater St. Charles County area and we’re fortunate to have them! https://t.co/NOd3f2bSSc","date":"Tue Aug 24 18:56:48 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Summer is winding down, and after a fun-filled few months of family trips, camps &amp; summer jobs, it's time for Missouri students to return to school. Wishing all Third District students and teachers a wonderful school year! https://t.co/zkwJP1SJOi","date":"Fri Aug 20 19:55:08 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Good to be with ⁦@MOFarmBureau⁩ today to discuss the need to protect Missouri farm &amp; ranch families from unnecessary economic &amp; administrative burdens after losing a loved one. \n\nFuture generations of Missourians shouldn’t be penalized for continuing their family tradition. https://t.co/HFvfEiRhOR","date":"Thu Aug 19 20:38:07 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Had a great time flipping steaks at the Beef House with @MoCattle today. \n\nThanks for having me! https://t.co/TFdPjO4ahM","date":"Thu Aug 19 20:06:36 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/X7X18mqoIK","date":"Tue Aug 17 14:51:23 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"It's August, &amp; most members of Congress have headed back to their hometowns for the District Work Period. This time allows me to travel around the 3rd District to meet with families, groups &amp; businesses to hear what's going well &amp; what can be improved upon.https://t.co/XuEtMT7jL0","date":"Fri Aug 13 17:57:28 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Had a great visit with @NewcoCup in St. Charles. This Missouri small business has been providing beverage service equipment to states nationwide since 1974 and continues to be a great source of jobs here in the Third District. \n\nThanks for having me! https://t.co/44V6dO7nxe","date":"Wed Aug 11 19:30:26 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"There’s no shortage of ways to celebrate the Show Me State! \n\nFor information about continued Bicentennial celebrations near you, please visit: \nhttps://t.co/fujeh8KUsu","date":"Tue Aug 10 16:38:25 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/ImHQHVyhGP","date":"Tue Aug 10 16:03:09 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"For 200 years, Missourians have raised families, farmed land, built businesses and made major contributions to American history. \n\nAugust 10th marks our state's Bicentennial and gives good reason to celebrate this wonderful place we're lucky to call home.\nhttps://t.co/vs7jcSm4wk","date":"Fri Aug 06 15:44:05 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to speak at the Teacher Appreciation Breakfast in Callaway County this morning. Our state is so fortunate to have such wonderful teachers setting students up for success. \n\nThank you for having me and for all that you do! https://t.co/OyFGKp2QNj","date":"Thu Aug 05 19:00:54 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Birthday to the United States Coast Guard and thank you to all who serve at home and abroad!","date":"Wed Aug 04 18:48:10 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Funding the government is essential and one of Congress’ jobs as written in the Constitution. \n\nBut this year’s process paid no attention to the country’s needs and certainly ignored the record-breaking nationwide inflation levels we’re experiencing.\nhttps://t.co/FS9ci1KAEa","date":"Fri Jul 30 18:58:43 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"So Sec. Yellen won’t show her face at @FinancialCmte to discuss President Biden’s failing rental assistance program, but we’re supposed to bail out Democrats with an eviction moratorium? https://t.co/eZrd78TF20","date":"Fri Jul 30 16:54:53 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"A classic case of Democrats' \"do as I say, not as I do...\"","date":"Fri Jul 30 15:13:05 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Absolutely unacceptable that @SecYellen makes time for a meeting with Maxine Waters, but can’t find a free moment to fulfil her *constitutional duty* to appear before Congress in the wake of the pandemic.  https://t.co/c2C1yogHgk","date":"Thu Jul 29 15:41:09 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The CFPB is constantly being used as a political football due to the almost limitless power of its director. \n\nMy bill provides increased accountability and transparency so the American people can trust the CFPB to do its job without political motivation. https://t.co/zV0y1IbUAx","date":"Wed Jul 28 18:28:24 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Gas, milk, fruit, televisions, furniture, washing machines, car rentals, hotel rooms – what do all of these things have in common? Their prices have gone up under the Biden Administration. \n\nICYMI, my @FoxBusiness op-ed on inflation: https://t.co/MI03SFqQm8","date":"Tue Jul 27 12:50:51 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Hypocrisy at its finest… Rep. Cori Bush continues to beat the “Defund the Police” drum with her progressive colleagues yet spends $70,000 on security for herself. \n\nUnbelievable.\nhttps://t.co/ZdgEY3Vbyg","date":"Mon Jul 26 20:19:04 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Bankers want to grow, invest in, and make loans to their communities. \n\nLoans are how you grow your community, the bank and the whole economy around you. \nhttps://t.co/CFYsZApUY8","date":"Wed Jul 21 19:43:22 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Most small businesses don’t have access to teams of lawyers to guide them through the U.S. regulatory maze. It’s critical we eliminate this confusion to provide American small businesses with the clarity they need to continue operating effectively and reviving our economy.","date":"Tue Jul 20 15:24:56 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The American people deserve better than this. #InflationisTaxation","date":"Mon Jul 19 21:27:00 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Inflation is climbing at the fastest rate in 13 years, and the proposed solution from President Biden and Congressional Democrats is a $3.5 trillion spending package?\nhttps://t.co/dRvadJoQxY","date":"Mon Jul 19 21:15:55 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Join me on Parler.\nhttps://t.co/gSdYii2lml https://t.co/LYbdjT6CyT","date":"Mon Jul 19 18:16:46 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The White House is OPENLY admitting they’re telling Facebook who to censor.  https://t.co/4Yz64SIoPD","date":"Fri Jul 16 19:54:20 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Despite the Hyde Amendment’s widespread support by the American people, Democrats continue to push for your tax dollars to fund the killing of unborn babies. \n\nProud to continue helping give a voice to the voiceless. #HydeSavesLives https://t.co/8qcelSXlqn","date":"Thu Jul 15 19:20:23 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"👀👀👀\nhttps://t.co/oy9VkZEn6b","date":"Thu Jul 15 15:48:39 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"President Biden’s reckless immigration policies have blown our border wide open, so why are #Cubans being singled out?\nhttps://t.co/0cOJKk2B5U","date":"Thu Jul 15 15:28:12 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Had a great visit with the folks at @scccaps yesterday. \n\nThe CAPS programs connect community partners with St. Charles County high schoolers allowing them to gain real world experience through internships while earning school credit. Thanks for having me! https://t.co/IKtDc1pFX1","date":"Tue Jul 13 20:51:38 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks to all the farmers and ranchers who call the Third District home, every day is #CowAppreciationDay around here. https://t.co/uQQCWbtTkY","date":"Tue Jul 13 15:13:25 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Socialism doesn’t work, and nobody knows this better than the people of #Cuba. \n\nAmerica stands with the Cuban people in their peaceful quest for freedom from tyranny. https://t.co/Iry9RBSF55","date":"Mon Jul 12 17:16:52 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"For MO-03 middle and high schoolers interested in coding, registration for the Congressional App Challenge is open! \n\nMore info here:\nhttps://t.co/ni013wqeU8","date":"Mon Jul 12 16:19:19 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing everyone in Missouri’s Third District a happy and safe Fourth of July full of freedom &amp; fireworks! https://t.co/VVFSTRN3w7","date":"Sun Jul 04 16:03:11 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Celebrations looked a little different last year with many parades &amp; parties being cancelled, but MO July 4th celebrations are back! This is the greatest nation on earth &amp; the way we celebrate #IndependenceDay is a perfect display of America's patriotism. \nhttps://t.co/R5KrF2u1e8","date":"Fri Jul 02 15:36:45 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Threatening Missouri’s economic growth with financial penalties? \n\nApparently the Biden Administration doesn’t like the fact that red state Missouri is leading the charge in America’s economic recovery. https://t.co/yl5TKdk9ak","date":"Thu Jul 01 19:03:55 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"What gets overshadowed by the self-promotion and inappropriate gestures are the great stories of athletes who have worked their whole life for this moment.  \n\nCongratulations to American record holder &amp; St. Charles native, DeAnna Price. Good luck in Tokyo!https://t.co/JC3RWt15g9","date":"Thu Jul 01 13:27:50 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"If you expect the government to be able to put together a program that is going to be error-free, you’re on the wrong planet.\n\nMy full remarks from yesterday’s @FinancialCmte  hearing on credit reporting here: \nhttps://t.co/KE08MgW7Vi","date":"Wed Jun 30 17:01:11 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri continues to lead by example in America’s economic recovery! \n\nThank you @GovParsonMO for eliminating the labor competition between our state’s businesses and government handouts.  https://t.co/41qcsmbjGW","date":"Tue Jun 29 15:39:53 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"China must be held accountable for its deceit, recklessness, and disregard for the entire world, and many of my colleagues and I are calling for action. \n\nWho knows how many lives could have been saved had they been open and honest about COVID-19?\nhttps://t.co/vtVs6ubXg7","date":"Fri Jun 25 20:51:12 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"I wonder if the Vice President will still find our nation's border crisis giggle-worthy once she finally gets there?https://t.co/gxcJlsmZ0D","date":"Fri Jun 25 14:00:33 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Proud to lead this letter to continue the fight for the unborn. \nhttps://t.co/2TqaAJbA1w","date":"Thu Jun 24 17:17:07 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"To date Congress has allocated $46 billion in rental assistance so Americans could stay in their homes w/o fear of eviction during economic recovery. This bill gets the federal government out of the way so states can quickly get this $ to those who need it.https://t.co/aF0aXOwRFy","date":"Thu Jun 17 15:46:39 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri continues to be a national leader in economic recovery! \n\nAverage salaries have increased across our state and we are #1 in small business wage growth nationwide for the 2nd month in a row. https://t.co/EYciwaP4k1","date":"Tue Jun 15 20:19:21 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Proud to join my colleagues and @RepRichHudson in calling on the AG &amp; ATF to preserve 2nd Amendment rights of disabled veterans and law-abiding Americans who use stabilizing braces. This proposed guidance is overreaching and unconstitutional.","date":"Tue Jun 15 19:27:52 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this day in 1777, the American flag was adopted. \n\nThis #FlagDay, we celebrate this universal symbol of freedom &amp; hope and remember the brave Americans who have made the ultimate sacrifice defending it. https://t.co/7sbOtZ6hle","date":"Mon Jun 14 19:35:28 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy 246th Birthday to our nation’s oldest military branch, the United States Army! Thank you to all who are serving and have served. https://t.co/agNk3A5Dzd","date":"Mon Jun 14 19:05:13 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"For any Missourians facing unemployment or employers looking to hire, the Missouri Office of Workforce Development is a great resource. You can visit their website at https://t.co/0vOJji2T7C or call 888-728-JOBS (5627).","date":"Fri Jun 11 15:50:16 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Now that schools &amp; daycares have reopened &amp; businesses are wide open, Missouri has hundreds of thousands of job openings available for anyone who needs one.\n\nWe're also #1 in the U.S. for small business wage growth, meaning these are good, well-paying jobs.https://t.co/1CRDb0jBaM","date":"Fri Jun 11 15:49:03 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"President Biden's overregulation regime continues. \n\nNow he's doubling down on disastrous water policy that gives the federal government control over nearly every body of water in the U.S. down to drainage ditches and seasonal streams on private property.\nhttps://t.co/dj5qK8ggZm","date":"Thu Jun 10 18:43:59 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri lost one of our finest to senseless violence exactly one year ago. Please join me in praying for Captain David Dorn’s family today.","date":"Wed Jun 02 20:45:37 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the St. Elizabeth High School baseball team on a hard-fought 2nd place finish in the 1A Championship yesterday! https://t.co/Ee2cqVWQc1","date":"Wed Jun 02 19:14:18 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy #MemorialDay to everyone in Missouri’s Third District, especially our military families. \n\nLand of the free because of the brave 🇺🇸","date":"Mon May 31 19:00:44 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"It’s important that we remember what Memorial Day is truly about: honoring the men and women who made the ultimate sacrifice for this country so that we and our children can continue to live in freedom.\nhttps://t.co/Px2mfAF7VJ","date":"Sat May 29 15:28:23 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Chairwoman is right. Secretary Yellen violated the law by refusing to appear. \n\nAbsolutely unacceptable.","date":"Wed May 26 16:24:45 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The science has continually shown school closures are extremely harmful to students’ health and well-being. \n\nNow, there's evidence that our economy could feel the effects of school closures for years to come. https://t.co/W3vZZ6ki97","date":"Tue May 25 15:58:52 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to be at Hechler Hearth &amp; Home in Troy yesterday to discuss the wood and pellet heater investment tax credit. Thanks for having me! https://t.co/0dKF8GHNPq","date":"Tue May 25 14:23:37 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"We're at Mother Nature’s mercy with the amount of rain and snow we receive here in the 3rd District, but making sure our area is well-equipped with the necessary resources to handle flooding is always at the top of my priority list in Congress. https://t.co/wslLCrLALh","date":"Fri May 21 18:37:28 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Proud to sign onto this letter to support our longtime friend, Israel.","date":"Thu May 20 14:21:43 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations, Abbie! Very proud to have your work representing Missouri’s Third District in the United States Capitol.","date":"Wed May 19 14:01:56 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri is open for business and thriving!","date":"Tue May 18 17:27:41 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"At 15 weeks, babies have arms, legs, fingers, toes, lips, noses, fully developed hearts and they can feel pain.\n\nEncouraged to see the Supreme Court take up this important case in the fight for the unborn. Every life is precious. https://t.co/rCWsUiuBrY","date":"Tue May 18 15:26:30 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"What’s more, 1 million small businesses file as C-corporations. President Biden’s tax increase would affect 1.9 million small businesses at the very least. \n\nHaven’t Americans been through enough over the last year?","date":"Mon May 17 20:56:41 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Even if this were true, America is home to roughly 30 million small businesses. 3% of 30 million is 900,000. \n\nRaising taxes on 900,000 small businesses - the driving force of our economy and workforce - as they continue to recover would be devastating. \nhttps://t.co/AzKuUNcJ1J","date":"Mon May 17 20:46:44 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Police officers run into danger while everyone else is running out of it and I'll always work to protect those who protect us. \n\nThis #NationalPoliceWeek please join me in expressing deep gratitude to each and every law enforcement officer in Missouri. https://t.co/PIFrXJnTxF","date":"Fri May 14 20:32:25 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Innocent civilians are being forced to take shelter from Hamas’ attacks and the Israeli government has every right to protect its people. \n\nProud to cosponsor this bill to show America will continue to stand with our good friend, Israel.","date":"Fri May 14 13:17:24 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Reminder: Please join me TONIGHT for a tele-town hall on Missouri’s economic recovery! \n\nSign up here before 1:00pm CT to participate: https://t.co/sitK7fQQig","date":"Thu May 13 15:34:24 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thank you @GovParsonMO for your leadership and taking this important step in our state’s economic recovery. \n\nFor Missourians seeking jobs or employers looking to post openings, please visit: https://t.co/flM5vrs1a5","date":"Wed May 12 19:52:24 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri continues to lead the nation in economic recovery, &amp; there are now more job openings than workers to fill them. \n\nRather than incentivizing people to stay home, government should be getting out of the way to allow workers and businesses to thrive. https://t.co/XQLB01tzMV","date":"Wed May 12 19:51:20 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Outlawing voter ID, legalizing ballot harvesting, and – if you can believe it – allowing federal tax dollars to fund political campaigns. \n\nCongressional Democrats want to federalize our election process at the expense of our election integrity. https://t.co/T9EcZLifPq","date":"Tue May 11 17:05:19 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me THIS THURSDAY at 5:15pm CT for a tele-town hall on Missouri’s economic comeback. Looking forward to hearing from the Third District and taking your questions! \n\nSign-up to participate here: https://t.co/sitK7fQQig","date":"Tue May 11 15:17:26 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri police officers risk their lives every day to keep us safe. This #NationalPoliceWeek is a great opportunity to thank the incredibly brave men and women in blue for all they do and remember the officers who have made the ultimate sacrifice protecting our communities. https://t.co/82oE47zYcT","date":"Mon May 10 17:49:17 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Mothers are the glue that hold our families together. Motherhood can sometimes be a thankless job, making Mother’s Day that much more important to celebrate and the perfect opportunity to thank all the mothers in our lives for everything they do. \nhttps://t.co/nW0fTZCSC7","date":"Fri May 07 22:52:35 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy graduation weekend to the Chamois Pirates and Fatima Comets! Congratulations on a job well done. #Classof2021","date":"Fri May 07 21:51:19 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Turns out when the federal government pays people to stay home, they do just that.\nhttps://t.co/XT64jjslVr","date":"Fri May 07 19:23:48 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Economic &amp; individual freedom is the only way to ensure the state of the union continues to improve. Our country gets stronger by the day, &amp; it's up to the president to do everything in his power to allow this progress to continue – not get in the way.\nhttps://t.co/dMTA52zHKo","date":"Fri Apr 30 18:29:37 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"In order for us to return to the historic economic success experienced before the pandemic, the government should be stepping aside to let the American People finish the job. \n\nUnfortunately, what President Biden laid out last night is just the opposite. https://t.co/Jm2uJjcEZP","date":"Thu Apr 29 13:45:53 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The WHO continues giving into pressure from China to exclude Taiwan from the annual World Health Assembly, despite the fact that Taiwan has continued to help America and the world fight the pandemic amid China’s recklessness. #LetTaiwanHelp","date":"Tue Apr 27 23:14:21 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"We were just reminded that we’re still in the season of going from snow to 70-degrees in a week, but we can soon take advantage of spring here in MO. It's National Park Week, &amp; a great time to plan your next outing to explore all our state has to offer.\nhttps://t.co/GcUhPGL4sV","date":"Fri Apr 23 20:58:51 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The American people deserve a long-term solution to keep our communities safe from deadly fentanyl. \n\nThis is progress, but my bill, the Stopping Illicit Fentanyl Trafficking Act would permanently schedule a substance that has destroyed so many lives. https://t.co/F6LcJMNK3b","date":"Thu Apr 22 16:02:13 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The proper disposal of prescription drugs can save lives. This Saturday is National Prescription Drug #TakeBackDay and a great opportunity to help make our communities a safer place. \n\nFor more details and to find a collection site near you, please visit: https://t.co/YfJlkpdDIq","date":"Thu Apr 22 13:34:55 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":".@SpeakerPelosi what time is the vote to strip Maxine Waters of her committee assignments? https://t.co/zsXf7c6UBG","date":"Mon Apr 19 20:08:29 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Republicans and Democrats alike agree it is essential to provide this country with roads, bridges, waterways, ports, and airways that are safe and fully operational, but President Biden's overreaching plan is an infrastructure bill in name only. https://t.co/5wphQTU2Wd","date":"Fri Apr 16 20:17:50 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"For anyone in St. Charles County wanting to help with vaccine distribution, medical and non-medical volunteers are needed!","date":"Fri Apr 16 18:27:14 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Proud that Missouri continues to be a national leader in the fight to protect the sanctity of human life! Thanks to the MO pro-life community, we are getting closer and closer to becoming the first abortion-free state in the country.\nhttps://t.co/waCJftNax4","date":"Thu Apr 15 17:00:43 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"It seems unfathomable that a law needs to be passed to protect babies born alive during an abortion. I signed the #BornAlive discharge petition because ALL babies – regardless of circumstance – deserve medical care.","date":"Thu Apr 15 16:08:20 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"@SBAList @SteveScalise @Kat_Cammack @RepAnnWagner Proud to sign and give a voice to the voiceless.","date":"Thu Apr 15 16:07:55 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"No child’s safety, regardless of location, race, religion, or parents’ income level should be valued less than another’s. I've introduced Protecting Every Student Act to ensure all students have the same opportunity to attend school safely. https://t.co/P3LlXyZxZZ","date":"Fri Apr 09 13:58:06 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for having me!","date":"Thu Apr 08 14:55:51 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Phase 3 of Missouri’s vaccine rollout begins THIS FRIDAY, making all adults in our state eligible to receive the vaccine.\n\nFor registration and more details, please visit: https://t.co/l54RdB5I2k","date":"Tue Apr 06 18:54:44 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Saddened to hear of the passing of my colleague, Congressman Alcee Hastings. Praying for his family and loved ones at this difficult time.","date":"Tue Apr 06 16:26:54 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"“He is not here; he has risen!”\n\nWishing everyone in Missouri’s Third District a very Happy Easter!","date":"Sun Apr 04 20:04:25 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Just like with Jesus’ resurrection, Easter brings new beginnings. It's fitting that we celebrate in the spring when nature comes back to life after a long winter. This Easter, we can also celebrate new beginnings in Missouri with life returning to normal. https://t.co/Y848LC4EI4","date":"Fri Apr 02 21:07:52 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Capitol Police continue to risk their lives daily to keep Capitol Hill safe. Devastated to hear we've lost another officer to senseless violence. \n\nPlease join me in praying for this officer's family &amp; a full recovery for the other brave officer injured today in the line of duty.","date":"Fri Apr 02 19:35:38 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Our state has now entered Phase 2 of vaccine distribution allowing many more Missourians to be eligible for the vaccine. \n\nFor eligibility information and registration/scheduling, please visit Missouri’s vaccine navigator:  https://t.co/l54RdB5I2k","date":"Tue Mar 30 17:57:00 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Instead of making the tough decisions, President Biden is keeping the American people in the dark and hoping the problem will fix itself. \n\nIt’s time that the safety of Americans takes priority over fairytale beliefs that an open border is good for anyone.\nhttps://t.co/hFtETBquXd","date":"Fri Mar 26 20:05:01 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"My office is now accepting entries for the 2021 Congressional Art Competition! https://t.co/A05UWTZfEt","date":"Thu Mar 25 14:29:00 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"With 2/3 of our state covered in farmland and being home to the 2nd highest number of farms in the nation, Missouri knows a little something about the ag business.\n \nHappy #NationalAgDay to all my fellow Missouri farmers &amp; ranchers! https://t.co/L4B3lIjxwu","date":"Tue Mar 23 21:49:53 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"While Missourians are encouraged to file taxes as soon as possible, the deadline for individuals has been extended to MAY 17th.\n \nMore info:","date":"Mon Mar 22 14:02:36 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"From the earliest settlers in the 1600s to the leaders of today, MO has a lot to be proud of – much of it accomplished by women. This month is a good reminder of those achievements &amp; an appropriate celebration of how much they’ve improved all of our lives.\nhttps://t.co/yOg2hnECdt","date":"Fri Mar 19 20:26:58 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"While mental health &amp; substance abuse services are available again, America is now facing another problem: a spike in overdose deaths due to a major increase in illicit fentanyl coming across our border. \n\nI've introduced a bill to combat this crisis:\nhttps://t.co/Qk21bPuxcT","date":"Fri Mar 19 19:42:32 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thank you @MOTreasurer for your work on this! Proud to join you in working for increased access to resources for Missourians with disabilities.","date":"Thu Mar 18 16:11:55 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"With great power comes great responsibility, and Congressional Democrats seem to be squandering it. \n\nRather than working with @HouseGOP to find commonsense solutions and compromise, they are pandering to the far-left and trying to score political points.\nhttps://t.co/ddi4RjfTUp","date":"Fri Mar 12 22:59:12 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to be in Eldon this morning for the Chamber’s Eggs &amp; Issues Breakfast to discuss Missouri’s economic recovery and what Congress has been working on. Thanks for having me! https://t.co/2uB1W0UUiZ","date":"Fri Mar 12 19:10:12 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today @NydiaVelazquez, @RepYoungKim and @RepBourdeaux joined me in introducing the bipartisan PPP Extension Act. \n\nThere are still funds in PPP, and this extension will allow for more struggling businesses to get the help they need. https://t.co/QCFtYawddf","date":"Thu Mar 11 20:19:36 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":".@RepYoungKim played an integral role in making this happen -- thank you for your leadership!","date":"Thu Mar 11 18:34:27 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"As our country continues to recover from the pandemic, it's more important than ever that health care services are available to everyone who needs them, regardless of zip code.\n\nToday, I introduced the Affordable Access to Rural Health Care Act: https://t.co/HDwQ36zrXS","date":"Thu Mar 11 17:50:24 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"House Democrats’ partisan power grab disguised as an “emergency” Covid rescue package will:\n\n- Cut Medicare for Missouri’s seniors by $8.3 billion\n\n- Allow federal prisoners to receive $1400 stimulus checks\n\n- Do nothing to reopen schools this year","date":"Wed Mar 10 22:48:09 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"While Democrats tout this as the ‘most progressive’ bill in history, the numbers show this bill has very little to do with Covid relief and even less to do with everyday Missourians.\nhttps://t.co/vS4phBnCW1","date":"Wed Mar 10 22:48:09 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thank you to my friend @RoyBlunt for years of service to our great state. \n\nLooking forward to working together to advance Missouri priorities in Congress over the next two years.","date":"Mon Mar 08 18:05:58 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Over the past year, the National Guard has assisted both our state and our nation in some extraordinary circumstances. MO is extremely fortunate to have these brave men and women who put our state and the nation before themselves at a moments’ notice. \nhttps://t.co/SVOQaou8Q8","date":"Fri Mar 05 20:47:03 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"For any Missourians with questions regarding their Recovery Rebate Credit now that tax season is here, the @IRSnews has put together a comprehensive FAQ’s page: https://t.co/2wazO1YZYS","date":"Thu Mar 04 14:22:37 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Yesterday, I introduced 2 bills that would clearly define the purpose and legal use of guidance and provide the utmost transparency between the federal government and the American people. \n\nRead more HERE: https://t.co/yr64VAv3bd","date":"Wed Mar 03 22:17:07 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Fortunately, the Senate parliamentarian agrees with what @HouseGOP has been saying all along: \n\nSpeaker Pelosi’s $100+ million subway project has absolutely nothing to do with coronavirus relief.\n\nhttps://t.co/XtLR6b7ge7","date":"Wed Mar 03 20:15:22 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"My Republican colleagues &amp; I continue to work to get students back in school, vaccines distributed, and our economy back to thriving. \n\nMeanwhile… Democrats are focused on nationalizing elections and using taxpayer dollars to fund campaigns with the #ForThePoliticians Act. https://t.co/8JkELtChCP","date":"Wed Mar 03 19:48:50 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"At one of the most pivotal moments in our nation’s history, the Biden Administration and Congressional Democrats are using this opportunity to advance their partisan agenda and sell it to the American people as a rescue effort.\nhttps://t.co/zyO8XuJJ3g","date":"Sat Feb 27 13:54:27 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"And if that wasn’t enough… the bill includes $112 million for Speaker Pelosi's subway to Silicon Valley and $1.5 Senator Schumer’s bridge to Canada. \n\nHow are these going to help the American people recover from the pandemic?","date":"Fri Feb 26 23:01:35 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"95% of the $123 billion allocated for K-12 schools won’t be spent until after 2021 – creating zero incentive to get our students back in school.","date":"Fri Feb 26 22:21:28 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"It includes $50 million in family planning grants and fails to include Hyde protections that would prevent taxpayers from paying for abortions. It also makes it possible for Planned Parenthood to receive PPP $$$ meant for America’s smallest and struggling businesses.","date":"Fri Feb 26 21:56:01 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The bill rewards state and local governments that continue to shut down their economies and kill small businesses with a $350 billion bailout.","date":"Fri Feb 26 21:05:40 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The bill would reestablish the Obama-era Treasury SSBCI program, and give $10 billion in funding to states who don’t need to use it until 2030. \n\nThis isn’t emergency relief.","date":"Fri Feb 26 18:00:59 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, the House will vote on Speaker Pelosi’s extraordinarily partisan $1.9 TRILLION proposal -- only 9% of which is actually devoted to covid relief -- using taxpayer dollars to tick more items off their liberal wish lists. https://t.co/tKpoUyQs1D","date":"Fri Feb 26 17:10:35 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"At a time when our local economies are still recovering, Democrats want to make it even harder for businesses to serve their communities and pay their employees what they deserve. https://t.co/JGWso5WeFb","date":"Wed Feb 24 16:47:32 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Democrats’ minimum wage hike is threatening Missouri businesses’ ability to effectively operate and keep employees on payroll. https://t.co/uj9gzspjQP","date":"Wed Feb 24 15:42:12 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"There is $1 TRILLION in unspent covid funding from the bipartisan relief package Congress passed in December.\n \nRather than working with @HouseGOP to put it to use, Democrats have introduced a “rescue package” that will give billions to their pet projects. https://t.co/j4Vj1NLXyF","date":"Tue Feb 23 22:54:14 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, the Missouri delegation sent a letter to the Federal Energy Regulatory Commission regarding the critical energy situation caused by weather events across the Midwest. Read the full letter HERE: https://t.co/F0Hx8gB2cP","date":"Thu Feb 18 22:27:46 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Retail investors outsmarted the institutions and brought to light real issues that need to be addressed. \nhttps://t.co/XaeJTBLN7e","date":"Thu Feb 18 21:17:46 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Rush Limbaugh was a proud Missourian and champion for conservative values. \n\nPraying for his family and loved ones at this difficult time. https://t.co/Ci2CAGVy0F","date":"Wed Feb 17 19:49:00 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing everyone in Missouri's Third District a safe and happy #PresidentsDay! https://t.co/0GOPwUMyRD","date":"Mon Feb 15 16:08:04 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Presidents’ Day is a good time to look back at our history &amp; honor all 46 Presidents who have served our nation in this incredibly important position, but it's also a good excuse to spend time with family. I wish you all a safe and relaxing Presidents’ Day!https://t.co/UEbk7b3O5E","date":"Fri Feb 12 23:25:05 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Think about the message we're sending to businesses by establishing a program where states may not receive all the funding for 5 years. \n\nSome governors would like to keep small biz shut down for the next 5 years, but we should focus on the next 5 weeks. https://t.co/N8FubYoazb","date":"Wed Feb 10 20:17:02 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Tax season is here! To make this year as easy as possible, the IRS recommends filing electronically if you are able. And for any Missourians still missing money from either EIP, this can be claimed on your 2020 taxes.","date":"Wed Feb 10 16:16:28 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Very saddened to hear about the passing of my friend and colleague Ron Wright, a faithful servant for Texas’ 6th Congressional district. Praying for his family, friends and loved ones at this difficult time.","date":"Mon Feb 08 19:32:38 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Unfortunately, the Biden Administration’s stance on abortion &amp; the right to life differs greatly from my own. But my fellow pro-life colleagues &amp; I stand at the ready to continue to do everything in our power in Congress to protect the sanctity of life.  https://t.co/eshloV4bAt","date":"Fri Feb 05 19:07:12 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"#ChiefsNation #RunItBack","date":"Fri Feb 05 18:57:26 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Incredible update from a Missouri company. \n\nThis investment from @AnheuserBusch will help stimulate local economies and support job growth in our state and across the country as our nation’s economic recovery continues.","date":"Wed Feb 03 18:41:47 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, United States Capitol Police Officer Brian Sicknick laid in honor in the very building he dedicated his life to defending. \n\nPlease join me in praying for this hero’s family, loved ones and fellow officers. https://t.co/UX7qOlObFP","date":"Wed Feb 03 17:46:52 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"I'm honored to once again lead one of the subcommittees that will be at the forefront of America’s economic recovery. \nhttps://t.co/TgaRSTZQTu","date":"Tue Feb 02 17:08:51 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Every January since 1974, Americans have come together for a celebration of life and to give a voice to the voiceless. As a member of Congress, it is my job to protect the unborn and one I take very seriously. https://t.co/UfHTARVBgb","date":"Fri Jan 29 22:15:13 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Well, that didn’t take long. \n\nAfter months of promising unity &amp; pledging to be the President for every American, it only took a few hours for President Biden to issue executive orders to appease the far left at the expense of the middle of the country.\nhttps://t.co/u0tO6jzan9","date":"Fri Jan 29 21:04:47 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"More disturbing news coming out of Gov. Cuomo’s NY. As if the crippling restrictions on businesses weren't enough, the NY Attorney General has now found that following Gov. Cuomo's directives, the state undercounted nursing home deaths by as much as 50%. https://t.co/9iJ94xoZfZ","date":"Thu Jan 28 21:30:58 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Small businesses are a huge job driver of our economy. They’re the entrepreneurs, the ones who innovate and take risks. \n\nMy full interview with @TheHillEvents here: https://t.co/Z6q7NwVztp","date":"Wed Jan 27 21:01:49 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this #HolocaustRemembranceDay we remember the millions of lives tragically lost in the Holocaust. \n\nWe also honor the memory of heroes like Carl Lutz who saved nearly 62,000 lives in the Holocaust’s largest civilian rescue mission &amp; later called MO home.https://t.co/XvlAvNrfyr","date":"Wed Jan 27 20:42:23 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"This morning I joined @RealAmVoice to discuss how my colleagues and I on @HSBCgop plan to help small businesses and our economy continue to recover this Congress. https://t.co/E1GAMzMGu4","date":"Wed Jan 27 20:16:59 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to newly confirmed Treasury Secretary @JanetYellen. \n\nWe don’t always agree on policy, but she is extremely capable and deserving of her confirmation. I look forward to working together to protect small businesses and build our economy. https://t.co/694WgxSgUp","date":"Tue Jan 26 16:38:30 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"If there was ever any question that blue state governors were killing small businesses purely for political purposes, there isn’t now. This is ridiculous.","date":"Tue Jan 26 14:22:08 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Excited to join @TheHillEvents this Wednesday, Jan. 27th for #TheHillSmallBiz to discuss what's next for small business recovery. Tune in! \n\nRegister here: https://t.co/EpL8Rlv93b","date":"Mon Jan 25 20:28:17 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Regardless of who occupies the White House, my job remains the same: representing the Third District of Missouri and fighting for our priorities. https://t.co/3IHqNmWyVl","date":"Fri Jan 22 21:22:14 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, we mourn the 48th anniversary of the tragic Roe v. Wade decision and observe #SanctityofHumanLifeDay.\n\nWhile there is still work to be done, I’m proud that Missouri continues to be a national leader in the pro-life movement &amp; defending the unborn. https://t.co/awNPi3DjRe.","date":"Fri Jan 22 17:07:26 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"This takes government overreach to the next level. \n\nDemocrat politicians in Missouri and across the country are suffocating small businesses with their extreme policies at a time when they need our help the most. https://t.co/CgtXrT43na","date":"Fri Jan 22 16:26:53 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Historic economic success, a strengthened military, peace in the Middle East, a COVID-19 vaccine in record time and so much more. \n\nThank you for your service, Mr. President.","date":"Wed Jan 20 15:40:17 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, we celebrate Martin Luther King, Jr.'s life, legacy and hope for a brighter tomorrow. https://t.co/3fRL9cANia","date":"Mon Jan 18 15:58:47 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Over the last year, our nation has endured more than our fair share of adversity. There is no doubt these are times of challenge and controversy. \n\nNow we must decide where we go from here.  \nhttps://t.co/BMyAhqHAFe","date":"Fri Jan 15 14:32:49 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"January 6th was a truly horrible day for our country that will leave a lasting scar on our history. \n\nBut the inappropriate use of the 25th Amendment and rushed impeachment proceedings are the exact opposite of what our country needs and deserves.\nhttps://t.co/ci3zeLZ0k8","date":"Wed Jan 13 21:50:42 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"ATTN Small Business Owners: The Paycheck Protection Program is re-opening this week.\n\nUnderserved small businesses that did not receive a first draw from #PPP in 2020 can now apply.\n\nCommunity Financial Institutions now have access to the  #PPP portal.\n\nhttps://t.co/qHmiuGvCxu","date":"Mon Jan 11 20:11:01 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/cplp4gagIJ","date":"Fri Jan 08 18:41:26 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"The attack on the Capitol was a tragic moment for America. We must learn from it &amp; find a new way to debate important issues. While some conversations will be contentious, they'll be respectful, without violence, &amp; keeping in mind that we're all Americans. https://t.co/tFHllUMM8f","date":"Fri Jan 08 18:28:30 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Peaceful protesting is acceptable. \n\nViolence, lawlessness and attacks on law enforcement are absolutely not.","date":"Wed Jan 06 20:11:15 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"Joining @RepMikeJohnson &amp; 35 GOP colleagues in the fight to protect the Constitution and our nation’s elections. \n\nI’ll be voting to object to the electoral votes of the states we believe clearly violated the Constitution in the 2020 presidential election.\nhttps://t.co/Htx8U01Gj1","date":"Wed Jan 06 14:26:00 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"My family has called Missouri home for generations. I’m incredibly honored to represent the people of the Third District and to fight for their priorities in Congress. https://t.co/LCOwYSl8vg","date":"Mon Jan 04 15:01:04 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"There's no denying 2020 was a hard year, but with the New Year comes a fresh start. It's my sincere belief this COVID relief package is the 1st step toward a healthy &amp; prosperous 2021. On behalf of my family, I wish you and yours a very Happy New Year!  \nhttps://t.co/GYygjT6duz","date":"Fri Jan 01 17:47:15 +0000 2021","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/1gboGAHijS","date":"Fri Dec 25 16:02:02 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Christmas season is one of hope, something this country needs an extra dose of this year. Despite the difficulties of 2020, we have many reasons to be hopeful with the vaccine &amp; more small biz aid coming. Wishing you a happy, healthy &amp; Merry Christmas!https://t.co/1IDc7WluLJ","date":"Wed Dec 23 16:56:26 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This bill-like most gov funding packages-is far from perfect, but it delivers big wins for both MO &amp; the U.S. The COVID portion will provide support for small biz &amp; resources for the dissemination of vaccines prioritizing health care workers &amp; the at-risk. https://t.co/RlJv6Y22Er","date":"Tue Dec 22 02:54:34 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The real issue is that while millions of small businesses are being forced to shut down, Hollywood millionaires have been deemed essential by Gavin Newsom.  \n\nThe hypocrisy never ends.","date":"Fri Dec 18 19:04:50 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This week, Americans began receiving the COVID-19 vaccine less than a year after development began. Thanks to the incredible doctors, scientists, trial volunteers, &amp; #OperationWarpSpeed, a feat that historically takes decades happened in a matter of months.https://t.co/3dgznSuwAE","date":"Fri Dec 18 16:19:22 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Americans need as much economic flexibility as possible to keep people employed &amp; our businesses afloat. We must extend the CARES Act provisions that give financial institutions the flexibility to work w/ struggling customers &amp; get them back on their feet.https://t.co/0NAPSFnZQE","date":"Thu Dec 17 18:48:58 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"HALF of American small business owners believe they could have to permanently close within the year if they don’t receive more relief. \n\nInstead of shutting them down, let’s help them operate safely and profitably. https://t.co/Q4hFWu6EKJ","date":"Wed Dec 16 20:16:15 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"American business owners have gone above and beyond to adapt to COVID restrictions and take every precaution possible to keep their customers safe and their doors open. \n\nThey simply cannot afford another shut down. https://t.co/UlVLpcoQ9f","date":"Wed Dec 16 16:26:04 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missourians should be able to start receiving the vaccine this week. Truly incredible what #OperationWarpSpeed has been able to accomplish so quickly for the American people.https://t.co/EQORpAHsk0","date":"Mon Dec 14 15:39:46 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Pretty convenient that mainstream media has started covering Hunter Biden’s federal criminal investigation one month AFTER the election… https://t.co/lsqqVCSiLR","date":"Thu Dec 10 21:32:46 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Speaker has intentionally increased pain on small biz with hopes of tanking the economy &amp; hurting @realDonaldTrump's election chances. \n\nThat’s not leadership. That’s not serving our country. That’s hurting people - the very people we came here to help.https://t.co/xUhlheLqkx","date":"Thu Dec 10 20:37:14 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"YouTube announcing today that they will be removing all content involving 2020 election fraud. Does this also apply to fraudulent claims that Russia stole the 2016 election from Hillary? Or do these rules only apply to matters that are still being considered in court?","date":"Wed Dec 09 17:45:13 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"For Missouri farmers &amp; ranchers whose operations have been impacted by COVID-19, the Coronavirus Food Assistance Program (CFAP) is accepting its 2nd round of applications until this FRIDAY, Dec. 11.","date":"Wed Dec 09 17:15:06 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"MO's 3rd District sees more than our fair share of flooding &amp; water issues &amp; with the MO and MS Rivers bordering us, we play an important role in America's water infrastructure. \n\nProud that #WRDA2020 includes multiple provisions designed to protect MO-03.\nhttps://t.co/xT01erCmP0","date":"Wed Dec 09 15:44:34 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This is about our constitution and our democracy -- @realDonaldTrump has every right to ensure every. single. legal. vote counts. \n\n@SenTedCruz is the right man for the job!\nhttps://t.co/ewOOxA3gjj","date":"Tue Dec 08 16:15:01 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Dems clearly haven't learned their lesson. American small biz have proven they can operate safely in these difficult times. They don't need more arbitrary, gov't mandates to destroy livelihoods &amp; lives. I'll always fight to ensure small biz have a fair shot at the American Dream.","date":"Tue Dec 08 15:30:24 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"79 years ago today, 2,403 American lives were taken in the attack on Pearl Harbor. \n\nThis #PearlHarborRemembranceDay we honor the memories of the heroes we lost and thank the heroes who survived. https://t.co/7sHV4wqpCF","date":"Mon Dec 07 21:11:35 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"From our favorite restaurants, florists, barbers, you name it - small businesses hold a special place in towns across America. \n\nMy goal as the new leading Republican on @HSBCgop is to ensure small companies in MO &amp; nationwide get a fair shot at success. https://t.co/Pz4veUD9oC","date":"Fri Dec 04 18:21:01 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Tis the season 🎄! Tune in at 4:00pm CT for the 98th Annual National Christmas Tree Lighting. Click here to watch: https://t.co/De5o06lBWQ","date":"Thu Dec 03 21:29:47 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Once again, House Dems are putting partisan games – this time in the form of marijuana legalization &amp; protection for exotic cats – over COVID relief. \n\nMeanwhile, $138 billion in unused #PPP funds continue to sit ready &amp; waiting to help struggling biz. https://t.co/Yybs9Ga6jZ","date":"Thu Dec 03 21:16:17 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Honored by my @HouseGOP colleagues’ confidence in my ability to lead @HSBCgop. Looking forward to getting to work for small businesses in Missouri and across America.\nhttps://t.co/VpEi5BVdH1","date":"Thu Dec 03 16:11:34 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today is #GivingTuesday and a great opportunity to consider donating to your favorite charity, especially during this season of giving. And thanks to the CARES Act, Americans will receive a special $300 deduction for charitable donations made before 2021.","date":"Tue Dec 01 21:12:47 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This year more than ever, Missouri small businesses need our support. Today is #SmallBusinessSaturday and the perfect opportunity to get a jump on your Christmas list while helping the local economy. https://t.co/3bqbAhO89p","date":"Sat Nov 28 15:24:09 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Throughout 2020, our nation has been through peaks &amp; valleys, but we continue to show the world how extraordinarily resilient America truly is. This year, I'm especially thankful to live in a place where no matter how hard things get, we always bounce back.https://t.co/eYR5DQnmve","date":"Fri Nov 27 22:36:06 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/iBT02Knn6K","date":"Thu Nov 26 18:42:16 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Ranking 2nd in America for completed apprenticeships for the 2nd year in a row, MO is showing the rest of the country how beneficial apprenticeships can be. I've introduced a bill to allow people nationwide the same worthwhile apprenticeship opportunities. https://t.co/cNG6Cx2Mi7","date":"Fri Nov 20 20:47:12 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this #NationalRuralHealthDay, we thank the incredible doctors, nurses and health care providers who continue to take great care of rural Missouri. https://t.co/K0Gdmybk3F","date":"Thu Nov 19 18:38:25 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Reauthorizing NDAA is one of Congress’ most important jobs each year. \n\nI am honored to have been chosen to be a conferee by @GOPLeader and look forward to getting to work for America’s military.\nhttps://t.co/m5X4LlGdgb","date":"Thu Nov 19 14:52:42 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Reminder for Missouri non-filers who haven’t received an EIP payment - the registration deadline has been extended to November 21st!","date":"Tue Nov 17 19:21:21 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thank you @SEC_News Chairman Clayton for your service to American investors and our country. https://t.co/0GVOmQOlKj","date":"Mon Nov 16 21:13:11 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri is home to over 400,000 veterans. This week, we celebrated #VeteransDay and the millions of brave men and women who have dedicated their lives to keeping this country safe and preserving the freedoms we enjoy each and every day. https://t.co/1BJ52NyldP","date":"Fri Nov 13 17:06:49 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This #VeteransDay, we honor the brave men and women who are currently serving our country, retired from duty, the souls we have lost, and the families they leave at home. \n\nToday and every day, we thank you for your service and for keeping us free. https://t.co/rt7k0WxLTQ","date":"Wed Nov 11 16:52:00 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"For any Missourians who don’t normally file a tax return, today is National EIP Day and a good reminder that you can register to receive your EIP until November 21st.","date":"Tue Nov 10 21:04:20 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri ranks #2 in the nation for completed apprenticeships &amp; this #NationalApprenticeshipWeek is the perfect opportunity to learn about the importance of apprenticeships to our workforce &amp; economy. \n\nMore info for employers, providers &amp; partners here:","date":"Tue Nov 10 19:46:26 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy 245th Birthday to the @USMC! Today we honor Marines past and present and thank them their for their dedication to keeping America safe. https://t.co/ScXaev2WNF","date":"Tue Nov 10 18:50:37 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/eutwQOdnoI","date":"Mon Nov 09 16:27:56 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This week, I was extremely honored to be re-elected to serve the people of Missouri’s Third Congressional District. My family has called this area home for generations, and it is a great privilege to continue representing you in Congress. https://t.co/E2wfUMCYqm","date":"Fri Nov 06 22:07:53 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"@realDonaldTrump is well within his rights to make every effort possible to protect legally cast votes and ensure our democratic process is not diluted or cheapened. https://t.co/n22JEJUNUq","date":"Fri Nov 06 17:35:08 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Regardless of what happens Tuesday, the former Vice President of the United States and his family have been implicated in some very unsavory activity and America deserves an explanation. https://t.co/komJZP2keX","date":"Fri Oct 30 19:08:09 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Incredible economic progress -- at 33.1%, our GDP is smashing records and growing at the fastest third quarter pace in our nation’s history. \n\nAmerica’s economic comeback CONTINUES! \nhttps://t.co/OXzswYVkUP","date":"Thu Oct 29 14:52:16 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"If former Vice President and current presidential candidate, Joe Biden and his family were involved in illegal activity with foreign nationals, don’t the American people have a right to know about it? My letter: https://t.co/yg0crbPole\n\nhttps://t.co/qD10RGVO7R","date":"Thu Oct 29 13:49:44 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Former Hunter Biden business partner, Tony Bobulinski was an eye witness to the alleged suspicious activity. It’s clear the Biden family’s interaction with foreign governments warrants further investigation. My letter: https://t.co/LVz4se2ifw","date":"Wed Oct 28 19:35:43 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"THIS is why I've called on @FSCDems &amp; @HouseIntel to investigate potential $$$ laundering within the Biden family. \n\nIf these committees are truly dedicated to oversight rather than political games, they'll do just that. My letter: https://t.co/LVz4se2ifw\nhttps://t.co/p8DdSvNTLL","date":"Wed Oct 28 17:01:52 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":".@FSCDems &amp; @HouseIntel claim their sham investigations of @realDonaldTrump are not political. They owe the country a real investigation of the Bidens' suspicious activity with foreign governments.\n \nMy letter urging an investigation here: https://t.co/UINsYuAc9b","date":"Tue Oct 27 16:00:54 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":".@realDonaldTrump has made another outstanding choice to serve this country and defend conservative values on the #SupremeCourt. \n\nI'm pleased Judge Barrett has received a swift &amp; fair confirmation and am confident she'll be an exemplary addition to our nation’s highest court. https://t.co/5ri0D7MXc3","date":"Tue Oct 27 00:28:15 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Small biz are the perfect example of the notion that with hard work &amp; an entrepreneurial spirit, anything is possible in America. \n\n2020 has been a difficult year, but many have figured out creative ways to keep their doors open in the face of adversity. \nhttps://t.co/mRSUdvHoSU","date":"Fri Oct 23 19:32:55 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"In-person learning is vital to students’ social, physical and academic well-being. The vast majority of Third District schools have been able to safely reopen and I’m hopeful the rest of the country will be able to do the same.","date":"Wed Oct 21 18:37:25 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Honored to be named a #smallbizguardian by @NFIB. \n\nThe economic interruption our country has experienced in the last year has made support for America’s small businesses more important than ever. https://t.co/RxGUfDV25n","date":"Tue Oct 20 19:58:58 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"One of the scariest facts we’ve learned in @SelectGOP is that mammograms are down 87% due to COVID. \n\nThat is hundreds of thousands of lives at risk due to lost access to medical services, which means the fight against breast cancer is as serious as ever. \nhttps://t.co/vCD7ZHCg6w","date":"Fri Oct 16 19:41:57 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy 245th Birthday to @USNavy! Thank you to all the brave men and women who serve and have served to keep our nation free. https://t.co/alPd2j9OF7","date":"Tue Oct 13 21:55:07 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thousands of scientists are confirming what I have been saying for months – the unintended consequences of the nationwide shutdowns are having devastating effects on our nation’s public health.","date":"Tue Oct 13 16:57:25 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, 60 of my colleagues joined me in sending a letter to \n@USTreasury &amp; @SBAgov urging the implementation of a streamlined loan forgiveness process for all #PPP loans up to $150,000. Small biz across America simply cannot afford this burdensome process. https://t.co/l5w3AimQpT","date":"Fri Oct 09 23:20:28 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Most of us agree more support is needed, but no one here in MO has told me direct checks to illegal immigrants, cuts to law enforcement, &amp; weakened election security - items included in Speaker Pelosi's \"HEROES Act 2.0\" - are the answers to their concerns.\nhttps://t.co/BCOSdJW3YS","date":"Fri Oct 09 21:22:09 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The PPP has been a undoubted success, but the forgiveness process has proven unnecessarily burdensome for many small biz/lenders. \n\n@USTreasury's announcement is a good step for businesses that don't have time or $ to jump through legal/regulatory hoops. https://t.co/4pFx2lL409","date":"Fri Oct 09 15:35:06 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Proud of my alma mater, @LUBlueTigers for receiving preliminary approval to be home of the first HBCU police academy in the country! \n\nThis is a great step for Missouri law enforcement and making our communities safer. https://t.co/yLtzHJNixh","date":"Wed Oct 07 20:49:19 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This is a pivotal time in our country, and President Trump now has the responsibility to appoint another well-qualified Justice to the Supreme Court who will uphold the rule of law and strictly adhere to the Constitution. \n\nhttps://t.co/e4jM1BWPwG","date":"Fri Oct 02 21:42:11 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today in @SelectGOP, @HHSGov Secretary Azar testified about the unintended medical consequences America has faced during the pandemic. https://t.co/EpTE9pOVFr","date":"Fri Oct 02 21:32:13 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"As the leader of the free world, @POTUS has operated as an essential worker during the pandemic and continued working hard to get America through it. \n\nHe and the First Lady are in excellent care with the WH medical team &amp; I wish @realDonaldTrump and @FLOTUS a speedy recovery.","date":"Fri Oct 02 12:50:51 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"What’s the difference in this version of House Democrats' COVID relief bill and the last partisan bill they floated? This one has $600 million less for law enforcement. \n\nThat’s not compromise, that's defunding the police. https://t.co/tjFpjVr5hS","date":"Wed Sep 30 19:14:28 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today I was proud to sign @HerreraBeutler's discharge petition to force Speaker Pelosi to bring @HouseGOP's PPP bill to the floor. She &amp; House Democrats have held this extra funding hostage for over 50 days. \n\nAmerican businesses and families deserve better. #FightForSmallBiz https://t.co/hR3YPiwNZ5","date":"Wed Sep 30 00:43:01 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Judge Barrett is one of our most well respected legal minds. President Trump has once again honored his commitment to appoint judges who put the Constitution and rule of law above all else.","date":"Sat Sep 26 22:22:27 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":".@HouseGOP has a plan for getting this country back on its feet with our #CommitmentToAmerica. \n\nThe 3 pillars: Restore, Rebuild, and Renew, put us on a path to heal this nation &amp; return to the historic prosperity we were experiencing prior to the virus.https://t.co/pdhqet5R90","date":"Fri Sep 25 19:51:56 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Space exploration might not be the first industry that comes to mind when thinking of Missouri, but our workers and scientists generate $127 million in economic impact for our state. Thank you!","date":"Fri Sep 25 18:31:38 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Small businesses across the country are still reeling from the pandemic. @HouseGOP has a plan to get the remaining PPP money to them, but Speaker Pelosi refuses to bring the bill to the floor. \n\nHow much longer will American families have to wait? #FightForSmallBiz https://t.co/woIRvE9xwD","date":"Fri Sep 25 15:44:25 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thousands of Missouri jobs are supported by the building of the F-15EX, many at small businesses. Thank you @federalreserve Chair Powell for speaking to @SelectGOP today about the importance of protecting American businesses. https://t.co/aq887fBVpW","date":"Wed Sep 23 20:40:12 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great news for MO ag producers! @USDA is now providing additional direct assistance to farmers and ranchers whose operations have been affected by COVID-19. \n\nFor more information and how to apply, please visit: https://t.co/wVLNdk199V","date":"Tue Sep 22 16:55:47 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Justice Ruth Bader Ginsberg dedicated nearly three decades of her life to public service and this country. Praying for her family at this difficult time.","date":"Sat Sep 19 13:51:04 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy 73rd Birthday to @usairforce and thank you to everyone who serves! Land of the free because of the brave. https://t.co/7mZdxhCiDF","date":"Fri Sep 18 17:16:52 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"233 years ago, our Founding Fathers signed the most important document in American history: the Constitution. \n\nToday we celebrate this doctrine of hope and appreciate the freedoms it continues to preserve for all Americans. #ConstitutionDay https://t.co/ANWeTwGQWP","date":"Thu Sep 17 16:23:38 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Grateful for @realDonaldTrump's commitment to peace in the Middle East. Yesterday’s historic peace deal normalizing relations between Israel, the UAE and Bahrain will increase stability in the region and is one of the most significant peace agreements in decades. https://t.co/3BWXXUHOq4","date":"Wed Sep 16 18:55:00 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"19 years ago today at 7:46am, terrorists flew a plane of Americans into the North Tower of the World Trade Center. It was 1 of the worst days ever in the US, but the heroism &amp; American pride that came out of it has been remarkable to witness. #NeverForget https://t.co/KxgzPaQ6ls","date":"Fri Sep 11 15:02:04 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today in @SelectGOP, my fellow Missourian @MissouriSOS Jay Ashcroft confirmed our election integrity is being well-maintained, voter participation in our state is up, and Missourians are voting safely and in person.\nhttps://t.co/dkXY8h1nQJ","date":"Wed Sep 09 21:21:39 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Hope everyone in MO-03 has a safe and happy Labor Day! https://t.co/931ONxJhjy","date":"Mon Sep 07 19:56:38 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great news heading into Labor Day Weekend with 1.4 million more Americans working! \n\nThere is more work to be done but America’s economy is strengthening. \nhttps://t.co/ReNJPrAuoh","date":"Fri Sep 04 14:57:15 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"For most of us, Labor Day means the end of summer &amp; time to spend with our families grilling in the backyard before we settle into fall &amp; another school year. But it was actually created to celebrate the American workers who make this country great.https://t.co/a5p0FcbvK2","date":"Fri Sep 04 14:55:40 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Yesterday I joined @AftertheBell discuss the prospects of another COVID-19 relief package following the @SelectGOP hearing with Treasury Secretary Mnuchin.\n\nhttps://t.co/k0LTB5fLEC","date":"Wed Sep 02 17:34:16 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today in @SelectGOP, I discussed funding for education, testing for schools and retirement homes and getting our economy back on track.\nhttps://t.co/Qt8rLQMwh4","date":"Tue Sep 01 23:10:27 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, my colleagues and I on @SelectGOP released a report detailing how #PPP has saved millions of jobs and businesses nationwide.","date":"Tue Sep 01 17:03:48 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Big thank you to Taiwan's President Tsai for moving to lift restrictions on imports of U.S. pork and beef which will lead to even stronger bilateral trade opportunities. Good news for our livestock producers!","date":"Fri Aug 28 22:37:19 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"While learning from home was an acceptable alternative as we began understanding the virus &amp; preparing our response, MO’s numbers have improved, cases &amp; fatalities have decreased over the last few months and it is time to finally return to school. https://t.co/jQNMegFVhK","date":"Fri Aug 28 16:18:36 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Don't forget! @IRSnews has reopened the registration period until September 30th for families who weren't able to register in time to receive $500 per child with their Economic Impact Payments. Find more info &amp; how to register here: https://t.co/IiVD0M2uXV","date":"Thu Aug 27 14:59:43 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"I have been &amp; will continue to be a supporter of #USPS in Congress.\n \nBut Democrats are crying wolf over a manufactured crisis to distract from the fact that they refused to work with Republicans and @realDonaldTrump on further COVID-19 relief for America.\nhttps://t.co/zc3vn71QxO","date":"Fri Aug 21 16:57:09 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, we honor the brave women who spent their lives fighting for their voices - and those of future generations - to be heard. #19thAmendment https://t.co/kb1WrZU8Kq","date":"Tue Aug 18 17:58:09 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"I've become increasingly concerned about hospitals’ inflated COVID-19 fatality reporting during my time on @SelectGOP. \n\nNow more than ever, we need to be able to trust the numbers our medical officials are telling us. \nhttps://t.co/stxhQErkrl","date":"Fri Aug 07 15:17:03 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"There are plans to be flexible and to continue to address issues as they pop up. As we go through and have schools open up, I think we can manage COVID-19. We just have to learn how to do that. https://t.co/kmtIfZEowo","date":"Thu Aug 06 22:57:43 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"ICYMI: Yesterday I joined @tperkins on “Washington Watch” to discuss the issue of hospitals reporting unrelated fatalities as COVID-19 deaths to receive more funding.  \n\nHighlights and full interview here: https://t.co/JYocKa9AHo","date":"Wed Aug 05 21:12:32 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"I'm calling on @CDCgov &amp; @HHSGov to address COVID-19 death misreporting in hospitals.\n\nThe 20% additional reimbursement for COVID-related deaths may have created a perverse incentive to over-code COVID-19 deaths, even if it wasn't the ultimate cause.\nhttps://t.co/mm8M4N2Hic","date":"Wed Aug 05 18:46:46 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":".@CDCgov Director and @HHSGov Assist. Secretary for Health have now both confirmed in @SelectGOP that hospitals in some states have been reporting unrelated fatalities as COVID-19 deaths to receive more funding. \n\nThis irresponsible and unethical practice cannot continue. https://t.co/zqzPxcFKH2","date":"Tue Aug 04 18:30:17 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"COVID-19 has created a real-life case study of CECL’s procyclicality &amp; has shown it wreaks havoc in a downturn. This harmful accounting standard is bad for institutions, investors, &amp; everyday Americans.\n \nIt’s time we eliminate #CECL once and for all.\nhttps://t.co/wCtNdcyf25","date":"Tue Aug 04 15:46:15 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"As the shutdown's lingered across the country, financial institutions will need to give flexibility &amp; forbearance to customers beyond the CARES Act.\n \nMy bill provides a long-term fix to get biz through this precarious time &amp; our economy back on its feet. https://t.co/KDE7E4AUYB","date":"Tue Aug 04 14:59:16 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today in @SelectGOP, Dr. Fauci and Dr. Redfield, two of the nation's top medical experts, confirmed the urgent need to get students back to school this fall. https://t.co/jF1pWmwDWH","date":"Fri Jul 31 20:36:12 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"With repeated calls from Democrats to “defund the police” &amp; violent riots taking place, our 2nd Amendment rights are more meaningful than ever. \n\nThe ability to protect your property &amp; family is a fundamentally American right that I firmly believe in. \nhttps://t.co/oDtcTIrhxj","date":"Fri Jul 31 20:03:04 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Unsolicited seed shipments from China/surrounding countries have reportedly been delivered to some MO households. To help protect our livestock &amp; crops from invasive species, please notify @USDA if you've received a package like this. \n\nMore info here: https://t.co/EDkaG07vl6","date":"Thu Jul 30 16:52:04 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Don’t forget to join me TONIGHT for a tele-town hall on the coronavirus. \n\nPlease sign up by noon today to join our call list: https://t.co/63PovFC9s0","date":"Thu Jul 30 14:34:17 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The 3rd District is home to 1000's of miles of shoreline &amp; it's always important that our priorities are included in WRDA. \n\nBy investing in water resource infrastructure, we can better protect our communities from flooding, grow our economy &amp; protect jobs.https://t.co/WwGsDsogVG","date":"Thu Jul 30 00:10:59 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me this THURSDAY at 4:50 pm for a tele-town hall to discuss the coronavirus and what Congress is doing to help Missourians. \n\nTo sign up for our call list, please visit: https://t.co/sitK7fzeTG","date":"Tue Jul 28 16:00:47 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Getting Missouri students back to school this fall is incredibly important to their social, physical and academic well-being. \n\nI'm hopeful that we can work together to get our state’s schools reopened in a responsible and safe way.\nhttps://t.co/VqQZrqB1CE","date":"Fri Jul 24 19:32:40 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today in @FinancialCmte, Democrats held a hearing on their partisan wish list, the HEROES Act. This bill already passed the House &amp; has no chance of becoming law. \n\nWhy are we wasting what already limited time we have in our committee on things like this? https://t.co/CvSw2gbKG3","date":"Thu Jul 23 17:58:02 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":".@realDonaldTrump took decisive action to protect our country by restricting travel from China to slow the spread of COVID-19. Today, House Dems voted to undermine POTUS' ability to secure our borders and keep us safe. \n\nThese political games are putting American lives in danger.","date":"Wed Jul 22 21:11:21 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was an honor to serve alongside Congressman John Lewis – a true civil rights hero, champion for racial justice, &amp; advocate for peaceful protesting whose legacy helped make a lasting impact on our country. My prayers are with his family at this extraordinary difficult time.","date":"Sat Jul 18 15:22:22 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"With the stimulus of the CARES Act &amp; forbearance banks have been giving to customers, we haven't seen broad delinquencies/charge offs yet. But, as this forbearance ends I’m fearful we will see a broad markdown of assets on balance sheets similar to 2008. https://t.co/hYcJG9vRIN","date":"Sat Jul 18 14:32:46 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This summer seems to be flying by, but there is still plenty of time to enjoy all that MO has to offer. July is National Park &amp; Recreation Month and the perfect time to take advantage of all the great outdoor activities right here in our backyard. https://t.co/sC3RIhX4pl","date":"Fri Jul 17 18:58:11 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Since its passage, #PPP has helped tens of millions of Americans supporting over 80% of small biz employees &amp; more than 51 million jobs nationwide.\n\nHere in MO, over $9.1 billion has been loaned to businesses keeping doors open &amp; employees on payroll.\nhttps://t.co/zrkyH0YzPm","date":"Fri Jul 10 16:54:26 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Whether it's Fulton’s annual Independence Day Parade, Eldon’s Firecracker 5k Race, the fireworks displays happening all over MO, or next to your grill, the 3rd District is a great place to celebrate our nation’s independence. I wish you all a safe and happy Fourth of July! https://t.co/hgIz3uUZZP","date":"Sat Jul 04 15:50:15 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Declaration of Independence laid the foundation for what became the envy of every freedom-loving nation on earth, &amp; each year on July 4th, Americans come together to celebrate the liberties afforded to us as citizens of this country. https://t.co/gIY58lT6FA","date":"Fri Jul 03 12:49:50 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today HHS Assistant Secretary for Health confirmed states are inflating COVID-19 fatality numbers to receive higher payments. https://t.co/W8g3iXsMbQ","date":"Thu Jul 02 21:06:38 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Good news for Missouri small businesses. Congress voted last night to extend the application deadline for the Paycheck Protection Program to August 8th.  \n \nFind more information on how to apply here: https://t.co/b7I3H5AbP0”","date":"Thu Jul 02 14:54:51 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"There's a time and place for rules and regulations. If they're not functioning, we should start over.","date":"Tue Jun 30 21:58:03 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today is the LAST DAY for Missouri small business owners to apply for the Paycheck Protection Program. Information on qualifications and how to apply can be found here: https://t.co/b7I3H5AbP0","date":"Tue Jun 30 18:19:31 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"SCOTUS just confirmed what many of us have said for years: the unchecked power of @CFPB director is unconstitutional. \n\nProgress, but my bill establishes a bipartisan commission to ensure consumer protection rules/regs won't change with the political tide.\nhttps://t.co/JjyXYlEbdM","date":"Mon Jun 29 18:01:51 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The media is only telling you that the cases are increasing. \n\nWhat it doesn’t tell you is that both deaths and hospitalizations continue to go down. \n\nhttps://t.co/ac3AgS4Lqc","date":"Fri Jun 26 21:06:05 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"We’re dealing with a sensitive and complex situation with life &amp; death implications. What’s lost in the noise is the critical role law enforcement officers play in our lives every day. \n\nThey represent the bravest among us &amp; deserve our deepest gratitude. https://t.co/aSoKTEVhg1","date":"Fri Jun 26 16:07:31 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"To all of the fathers in MO-03, Happy Father’s Day! https://t.co/S5spmhKD4R","date":"Sun Jun 21 22:08:50 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"We can protect those who are at-risk without having our entire state shut down. Missourians have the right to make their own decisions, and @GovParsonMO is absolutely right to reopen our state. https://t.co/4DnzdLIEED","date":"Fri Jun 19 22:16:08 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Studies have found that for every $17 million the U.S. loses in collective income, we lose an American life. That translates to 65,000 American lives lost each month due to the economic shutdown. It’s important we look at the whole health care picture. https://t.co/7a3P38B3wl","date":"Thu Jun 18 20:11:05 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":".@COVIDOversight Dems are feigning concern over the loan process they themselves helped design in the CARES Act. \n\nTheir demand for the personal &amp; financial info of millions of Americans is an attempt to shame small biz owners &amp; attack the Administration. https://t.co/vpyxdXLP0k","date":"Wed Jun 17 22:21:56 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Incredibly saddened by the sudden passing of Carol Barr. @RepAndyBarr is a good friend, a great representative of Kentucky, and an even better man. Jackie and I are praying for him, his young daughters and entire family.","date":"Wed Jun 17 14:46:16 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"@GovParsonMO is absolutely right to reopen Missouri. \n\nI look forward to our great state reopening for business, getting our economy going again, and hardworking Missourians having the ability to once again support their families.\nhttps://t.co/sAiEOK24bD","date":"Fri Jun 12 22:40:21 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This Sunday, America will celebrate @USArmy's 245th Birthday. This is a great opportunity to thank the brave men and women of the Army for dedicating their lives to this country so the rest of us can live in freedom. https://t.co/HjZf964rlM","date":"Fri Jun 12 20:02:01 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"GREAT news for Missouri workers, businesses and families!","date":"Fri Jun 12 17:53:02 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"As we reopen, we should remain conscious of the fact that the threat of the virus still exists &amp; is frightening for some. \n\nBut we can continue to take care of the at-risk population without threatening MO’s society as a whole &amp; get back to normal life. \n\nhttps://t.co/4uKqO1eACH","date":"Fri Jun 12 17:02:04 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"One of the things we’ve learned is because this is a very targeted disease, we should be able to maintain and manage those at risk in a way that could minimize their risk as well as open up the rest of society.\nhttps://t.co/OZBs4zWxcC","date":"Thu Jun 11 19:41:33 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this 76th Anniversary of D-Day, we remember the heroes who stormed the beaches of Normandy. As Pres. Reagan said, “These are the champions who helped free a continent. These are the heroes who helped end a war.” https://t.co/CNbPXr8T5X","date":"Sat Jun 06 16:07:58 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"History has proven that unemployment has a direct effect on public health and safety. \n\nIt’s great to see that employment rose by 2.5 million jobs in May and the economy is starting to heal. \n\nhttps://t.co/CoWQJFUrn8","date":"Fri Jun 05 15:28:39 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"A recent study that came out that said over 50% of the people, if the vaccine was available, wouldn’t take the shot… \n\nBecause of that, it would seem it’s even more imperative that we open up our economy.\nhttps://t.co/0WqRYyYc9s","date":"Thu Jun 04 20:08:13 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"We are all too well aware of the toll the coronavirus crisis has taken on our country, but it has been more than just physically. The economic fallout from this pandemic has put the mental health of Americans across the nation at risk. https://t.co/fBJnIikRfS","date":"Fri May 29 21:55:52 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The average estimate of the loss of life over the next several months due to the economic shut down – we’re looking at 65,000 lives per month based on suicides, overdoses, all of those sorts of things.\n\nhttps://t.co/ZN7IniO6jz","date":"Fri May 29 21:18:41 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"UPDATED LAUNCH TIME: Be sure to tune in for the second launch attempt tomorrow at 2:22pm CT!","date":"Fri May 29 21:06:19 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Sam Johnson was a true patriot who dedicated his life to this nation fighting in both Korea and Vietnam and serving the people of Texas for nearly three decades in Congress. I’m grateful to have called this American hero a colleague.","date":"Thu May 28 02:10:12 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri’s own @AstroBehnken will be headed to space this afternoon! He &amp; his crewmate will be the first Americans to launch from U.S. soil in 9 years. \n\nBe sure to tune in for the @NASA launch at 3:33pm CT today: https://t.co/g0gOWScVAi","date":"Wed May 27 17:37:38 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Every year our nation celebrates Memorial Day to honor the brave men and women of our military who have made the ultimate sacrifice for this country. We have been blessed to live in the freest country in the world, and it's all thanks to these fallen heroes and our veterans. https://t.co/rm8CjGisIS","date":"Mon May 25 17:55:14 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"While it’s always nice to gather and spend time with family, it's important to remember the true meaning of Memorial Day: honoring Americans who have given their lives fighting for our freedom and letting their families know that we haven’t forgotten. https://t.co/U9UauyhR1w","date":"Fri May 22 17:13:21 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"For Missouri farmers, ranchers and ag producers whose operations have been impacted by COVID-19, @USDA will begin accepting applications for the Coronavirus Food Assistance program on May 26. \n\nMore details and instructions can be found here: https://t.co/u2SfJf4EHq","date":"Fri May 22 16:44:47 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"One year ago today, an EF-3 tornado ripped through Eldon and Jefferson City destroying businesses and homes and taking three lives. Today, we remember the Missourians we lost and thank the first responders who were on the frontlines that day. https://t.co/K1pM29Nj8I","date":"Fri May 22 15:59:40 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"@USOCC Comptroller Otting brought real world experience to the OCC &amp; showed a willingness to work with members of Congress and our constituents to increase transparency and efficiency. I appreciate his service and wish him the best in his future endeavors.\nhttps://t.co/z6XFZ3FYq4","date":"Fri May 22 15:41:39 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"From the largest cities in America to the smallest town in Missouri, everyone has been affected by the economic fallout caused by the COVID-19 crisis. The modernization of the CRA is a perfect reminder of the need for banks to reinvest in their communities.https://t.co/YXKZpAMerp","date":"Wed May 20 22:27:40 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Not only did China cause a global pandemic, they manipulated the WHO to help them cover it up. \n\nYesterday, @SelectGOP &amp; I sent a letter asking Democrats to help us hold China accountable for the COVID-19 outbreak &amp; the WHO for not doing its job. https://t.co/ilHLphJPFR","date":"Wed May 20 14:33:21 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"For business owners who have received PPP loans, @USTreasury has released guidance for loan forgiveness. More information can be found here: https://t.co/KqfbKozTob","date":"Mon May 18 21:16:03 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, House Democrats voted to pass a self-titled \"liberal wish list\" disguised as a COVID-19 relief package &amp; a rule change allowing them to no longer travel to Washington, DC to pass laws. America needs leadership from Congress right now – this isn’t it.https://t.co/82AwINExpV","date":"Sat May 16 01:39:58 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"@MOFarmBureau has created a great resource that allows Missourians to buy directly from our state’s meat producers. For more info, head to their website.","date":"Fri May 15 17:34:17 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This #PoliceWeek, we thank Missouri’s brave men and women in blue who work so hard to protect us every day and honor those who have given the ultimate sacrifice in the line of duty. https://t.co/aRbaJinZE6","date":"Thu May 14 17:01:55 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Instead of acknowledging that a non-partisan health and economic crisis deserves a non-partisan Congressional response, this afternoon's Committee proceedings looked eerily similar to those the House majority forced the U.S. to endure for months in 2019. \nhttps://t.co/A8WDeK9fnz","date":"Wed May 13 22:57:37 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"MO farmers, ranchers &amp; ag producers who would like to apply for the Coronavirus Food Assistance Program (CFAP) can learn about the application process &amp; necessary documentation in a webinar hosted by @USDA tomorrow, May 14 at noon CT. \n\nRegister here: https://t.co/VNkiEgvEOf","date":"Wed May 13 15:02:47 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Just one more week to submit artwork for the Congressional Art Competition! My office is accepting entries via email through next Tuesday, May 19th at 5:00pm. \n\nFor more info please call our Wentzville office or visit our website: https://t.co/S0trDiWUaI https://t.co/5Wg0glXiyh","date":"Tue May 12 16:21:52 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today on the 75th anniversary of VE Day, we honor and remember the heroes who fought in WWII. Sir Winston Churchill was instrumental in this victory and I’m proud that Missouri is home to the @ChurchillMuseum. https://t.co/ng7UJ1LSdJ","date":"Fri May 08 20:22:27 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The coronavirus pandemic has put Missouri through a trying few months and our faith remains as important as ever. \n\nToday on National Day of Prayer, we pray for the families who have been affected by the virus and for the healing of our country.","date":"Thu May 07 21:17:02 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"TUNE IN tonight at 8:00pm for a live virtual town hall with the entire Missouri Congressional delegation. I’m looking forward to answering questions about coronavirus and addressing its effects on the Third District.","date":"Thu May 07 20:27:06 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Instead of holding China accountable for its role in this pandemic, Democrats are using Congress' time &amp; resources for yet another witch hunt &amp; attack on @realDonaldTrump. I look forward serving on the Coronavirus Oversight Committee to hold my Democratic colleagues accountable. https://t.co/5jsLvMVDHM","date":"Thu May 07 17:41:13 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Nurses have gone above and beyond the call of duty to get Missouri safely through the COVID-19 crisis and have risked their own health on the frontlines caring for others. On this #NationalNursesDay, we cannot thank you enough for everything you do. https://t.co/HpflI9gL4N","date":"Wed May 06 17:28:10 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"With schools closing and many parents homeschooling children who have been at home for months, National Teacher Appreciation Day takes on a whole new meaning this year. To all the Missouri teachers who have dedicated their lives to educating our children, THANK YOU! https://t.co/A3mAZE0kBT","date":"Tue May 05 21:04:37 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Don’t forget! I’ll be doing a tele-town hall TOMORROW at 5:00pm to give an update on coronavirus and take your questions. \n\nTo be added to our call list, please sign up here by noon tomorrow: https://t.co/sitK7fQQig","date":"Mon May 04 20:47:35 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"While the last few months have been trying as we've stayed home to slow the spread of COVID-19 , MO is on the path to safely reopening. PPP is back up &amp; running, testing has become more available, &amp; we're getting closer &amp; closer to a safe return to normal.https://t.co/x1uk8mAy7l","date":"Fri May 01 19:40:57 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me this TUESDAY, May 5th at 5:00pm for another tele-town hall on the coronavirus. Looking forward to hearing from the Third District and answering your questions. \n\nTo sign up for our call list, please click here: https://t.co/sitK7fzeTG","date":"Thu Apr 30 18:18:33 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The first round of PPP supported 769,000 jobs in MO. The 2nd round passed last week is expected to support 696,000 more. More information on PPP can be found here: https://t.co/b7I3H5AbP0 https://t.co/hsgi8P4FJk","date":"Tue Apr 28 20:03:01 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This morning, I joined @MariaBartiromo to discuss my role on @realDonaldTrump's Opening Up American Again Congressional Group and the second round of much-needed funding for the Paycheck Protection Program that was passed by Congress this week.  https://t.co/CaWlBHizPf","date":"Fri Apr 24 18:58:17 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"For Missourians who are facing unemployment right now, companies are desperately seeking to hire essential workers.","date":"Fri Apr 24 14:07:50 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"MO businesses like our favorite restaurants, barber shops &amp; florists have been devastated by COVID-19's economic impact &amp; need help weathering this storm. Congress has passed a bill to provide more funding to the PPP &amp; our incredible medical community. https://t.co/GrSDXTMJTf","date":"Fri Apr 24 13:34:00 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"While the Paycheck Protection Program &amp; Health Care Enhancement Act should've been passed over a week ago, the funding will save jobs and, more importantly, lives. I was proud to vote in support of medical professionals, 1st responders, &amp; small businesses.\nhttps://t.co/rlB7H55obJ","date":"Fri Apr 24 00:25:19 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"For Missourians who receive SSA or RRB benefits, TOMORROW, April 22 is the deadline to add money to your Economic Impact Payment for dependents in your household.","date":"Tue Apr 21 22:21:08 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Congressional Art Competition deadline has been EXTENDED to May 19th! This is a great activity for students who are at home. Please find competition guidelines and details on how to submit here: https://t.co/S0trDiWUaI","date":"Tue Apr 21 21:29:06 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Last week, Democrats blocked a clean bill that would have added much needed funding to the Paycheck Protection Program and yesterday the PPP's funding ran out. Their political games need to stop. American businesses and workers can’t wait.\n \nhttps://t.co/qLeRjWnJuS","date":"Fri Apr 17 17:55:10 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Had a great phone call with @realDonaldTrump, @VP &amp; @stevenmnuchin1 this morning and I'm honored to have been asked by @POTUS to join the Opening Up America Again Congressional Group. It's critical that we put Americans on the path back to economic success. https://t.co/5CWlsaZ3Gk","date":"Thu Apr 16 20:26:10 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"For Missourians who don’t file annual tax returns, it may be necessary to provide the IRS with more information in order to receive your COVID-19 Economic Impact Payment. More information here:\n\nhttps://t.co/mQK1qIkK3P","date":"Wed Apr 15 16:09:59 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me TOMORROW at 4:10pm for a tele-town hall on the coronavirus where I’ll be providing an update and taking your questions. To be added to our call list, please sign up here by noon tomorrow: https://t.co/sitK7fQQig","date":"Mon Apr 13 16:33:28 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"While the logistics may be a little different this year, the message of Easter and our faith remain more important than ever. From my family to yours, I wish you all a safe and happy Easter. https://t.co/xURjPfWnwr","date":"Sun Apr 12 16:40:41 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me this coming TUESDAY, April 14th at 4:10pm for a tele-town hall on the coronavirus. I’m looking forward to updating the Third District and taking your questions about the virus &amp; the government’s response. Sign up to participate here: https://t.co/sitK7fQQig","date":"Thu Apr 09 17:23:24 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"A fun activity for Missouri students who are at home right now and a great reminder that Easter is almost here! @WhiteHouse @realDonaldTrump","date":"Wed Apr 08 16:33:44 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri doctors, nurses and health care workers are on the frontlines of the COVID-19 crisis risking their lives to help all of us. On this #WorldHealthDay, please take a moment to thank these heroes. https://t.co/WSo48STzSM","date":"Tue Apr 07 20:38:41 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for having me!","date":"Tue Apr 07 19:35:25 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Many MO children rely on free/reduced meals at school. Classes have been cancelled due to COVID-19, but the majority of 3rd District schools are still providing meals for students who need them. More info on participating schools and operating hours here: \nhttps://t.co/wOp4ogYGtJ","date":"Mon Apr 06 16:22:28 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri small businesses: if you’re looking for an eligible lender for SBA loans under the Paycheck Protection Program (PPP), this link will help you find one in your area. https://t.co/l2oY5g5Rlu","date":"Fri Apr 03 20:17:39 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This is an unprecedented situation, but America is united and we will get through this.\nhttps://t.co/lsse6WIAN5","date":"Fri Apr 03 19:54:25 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"It’s #CensusDay &amp; a great time to use @MOCensus’s new online response option while many of us are at home. Join me in helping MO get accurate representation &amp; federal funds to support MO hospitals, schools, roads, disaster relief &amp; more. Get started here: https://t.co/6bOMK4zBlD","date":"Wed Apr 01 15:34:06 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Due to the critical role ag producers play in our state's food supply chain, MO farmers have been deemed “essential” by @DHS &amp; @GovParsonMO  while we deal with #COVID19. Important documents for farmers to continue working uninterrupted can be found here: https://t.co/BIvvujZ9Kv","date":"Mon Mar 30 18:03:45 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"On Friday, federal regulators announced a 2-year delay in capital requirements under #CECL. COVID-19 has created a real-life case study of #CECL's procyclicality &amp; exacerbation of stress on financial institutions’ balance sheets that cannot be ignored.\nhttps://t.co/HZ8BjWIuWQ","date":"Mon Mar 30 15:29:57 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The spread of #COVID19 has created an unprecedented situation in MO &amp; our state/local governments need additional help to get Missourians through a health crisis of this magnitude. Thankful @realDonaldTrump has approved a major disaster declaration for MO. https://t.co/Av8xQasB3P","date":"Fri Mar 27 20:15:18 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The CARES Act provides badly-needed resources for our medical community who is working around the clock to keep us safe, relief for families who need help to make ends meet, &amp; help for businesses so they can stay afloat &amp; keep providing paychecks.\nhttps://t.co/aTMUqNkzWT","date":"Fri Mar 27 18:42:13 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The deadline for REAL ID enforcement has been extended nationwide by @DHS to October 1, 2021. This is a big help for Missourians who haven’t been able to get a new ID due to the spread of #COVID19. https://t.co/306SISQVcN","date":"Thu Mar 26 18:01:54 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, the MO congressional delegation sent a letter supporting @GovParsonMO’s request for a federal emergency disaster declaration for Missouri to give our hospitals, schools, businesses, &amp; families the resources they need to respond to #COVID19. \n\nhttps://t.co/QAWfyB3CaK","date":"Wed Mar 25 20:35:57 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Small Business Administration (SBA) will be hosting a webinar for small business owners affected by #COVID19 with SBA Administrator Jovita Carranza this Friday, March 27th at 1:00pm CT. Register here: https://t.co/4PSfj0Qmbz","date":"Tue Mar 24 18:49:35 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Along with the @USTreasury moving tax day to July 15 this year due to the spread of #COVID19, @MissouriRevenue has extended the Missouri tax filing deadline to July 15 and expiring drivers licenses and vehicle registrations have been granted extensions.","date":"Mon Mar 23 18:15:48 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"As MO responds to the spread of #COVID19, or coronavirus, resources are available to ensure your families &amp; businesses stay as safe &amp; prepared as possible. Please visit my coronavirus information page for the latest updates and support resources. https://t.co/u09ex9BQul","date":"Mon Mar 23 16:53:14 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri small business owners who have been impacted by the spread of #COVID19 are NOW eligible for disaster loan assistance through the Small Business Administration (SBA). Apply for a loan here: https://t.co/waT18BaAfq","date":"Sun Mar 22 17:00:55 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, I led a letter to Congressional leadership requesting the inclusion of a CECL delay in the third coronavirus funding package. It’s clear CECL poses a significant threat to exacerbate the current economic instability. https://t.co/k0n6xGMnDt","date":"Fri Mar 20 23:29:28 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"ATTENTION #MO03 Small Business Owners! @realDonaldTrump will be hosting a conference call regarding #COVID19 with small business owners nationwide TODAY at 2:45pm CT. You'll receive call in information once you have registered with the following link: https://t.co/utV9ss7phX","date":"Fri Mar 20 17:16:05 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"All Missouri Schools have been closed due to #COVID19. @MOEducation will provide updates on reopening when available.  https://t.co/MdfmoPFjK4","date":"Thu Mar 19 23:35:32 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"If you are a small business owner in #MO03 and need information on how to connect with your local Small Business Association (SBA) partner for assistance while our state continues to deal with the spread of  #COVID19, please click here: https://t.co/awX6pvf7BY","date":"Thu Mar 19 19:09:11 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The public and private sector are working together to address economic instability. It's time for @FAFNorwalk and @SEC_News to join the effort. We have to delay or eliminate #CECL.","date":"Thu Mar 19 18:06:31 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congress is considering drastic - but necessary - measures to stabilize the economy &amp; provide relief to businesses &amp; families. One FREE way to provide relief is to eliminate #CECL, an ill-advised accounting standard restricting lending &amp; sucking billions of $ out of the economy.","date":"Thu Mar 19 17:10:22 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"@USTreasury has announced that families &amp; small businesses will be able to defer tax payments for 90 days with waived penalties and interest this year. For more information visit https://t.co/HpZUTs6FNr","date":"Wed Mar 18 23:26:11 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"If you or someone in your family is not feeling well and would like to have your symptoms addressed by a health care provider from home, @muhealth is offering free video visits to assess for coronavirus.","date":"Wed Mar 18 19:21:22 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Small businesses are the heart &amp; soul of MO. In the coming weeks, they could struggle to stay open as the U.S. responds to #COVID19. Yesterday, the MO congressional delegation sent a letter supporting  @GovParsonMO's request for small business assistance.\nhttps://t.co/m9C8GgngAv","date":"Wed Mar 18 17:46:49 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"We learned this evening that an individual in Cole County has tested positive for coronavirus. \n\nhttps://t.co/T8A00mXP3q","date":"Tue Mar 17 23:10:51 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"While our state deals with #COVID19, @MOChamber is offering webinars, resources and daily updates to help prepare and secure Missouri businesses and employers. Please find more information here: https://t.co/7RZZ30vWDQ","date":"Tue Mar 17 18:13:29 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to see companies lending a helping hand while families and students are at home. https://t.co/1OzHQR2fv2","date":"Tue Mar 17 17:06:50 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"@HealthyLivingMo continues to provide updated information on the #COVID19 response. For guidance, visit their website or call the hotline at 877-435-8411. \n\nhttps://t.co/p5dIf6mWk1","date":"Tue Mar 17 16:19:44 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/bLmzm7nk31","date":"Sat Mar 14 04:54:39 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Read my statement on @realDonaldTrump's national emergency declaration here: https://t.co/JYx6JYQG34","date":"Fri Mar 13 21:12:54 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"My hometown team, the St. Elizabeth Hornets boys basketball team is taking on the Dora Falcons in the MO State Championship – Let’s Go Hornets!","date":"Fri Mar 13 19:34:28 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Attention Farmers: @USDA’s Risk Management Agency is working to lower insurance rates for farmers impacted by breached levees in 2019. March 16 is the deadline to apply for coverage or update crop insurance for spring crops. For more info visit: https://t.co/KqHm7PVfmo","date":"Thu Mar 12 18:37:11 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please continue to follow @CDCgov guidelines for staying healthy, but don’t forget that TODAY is the 1st day Missourians can reply to the 2020 Census. This is a good opportunity to take advantage of @MoCensus's new online response option. More info here: https://t.co/sZXiXK6o6Y","date":"Thu Mar 12 15:54:32 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"If you or someone you know is looking for guidance on COVID-19 (coronavirus), @HealthyLivingMo now has a hotline where you can talk to medical professionals.","date":"Wed Mar 11 18:52:19 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please remember to be vigilant not only about your health, but people trying to take advantage of this situation. To report coronavirus-related phishing scams or price gauging, call @AGEricSchmitt's Consumer Protection Hotline at 1-800-392-8222.","date":"Mon Mar 09 21:42:36 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Earlier today, @realDonaldTrump signed the Congress-passed coronavirus funding bill into law. It'll increase diagnostic test availability, support treatment, &amp; fund vaccine development. Guidelines for staying healthy can be found at https://t.co/lqVmGitkpW https://t.co/251FJIT23D","date":"Fri Mar 06 18:19:47 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, I introduced a bill that would replace the @CFPB Director’s position with a 5-member bipartisan commission to ensure accountability maintain the transparency Americans expect. No single person should wield such unabated power over our economy. https://t.co/sy7CRZqbJp https://t.co/nIAvYi581B","date":"Thu Mar 05 21:32:03 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this day in 1946, Winston Churchill gave his famous “Iron Curtain” speech at @WestminsterMO. I was proud to pass a resolution in Congress to recognize the Winston Churchill Memorial and Library on their campus as \"America's National Churchill Museum.\" https://t.co/tY4MnGQhTl","date":"Thu Mar 05 20:51:24 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Had a great meeting with some Mid-Missouri elected officials to discuss our state’s health care and infrastructure this afternoon. Thanks for stopping by! https://t.co/7wchrQrAVj","date":"Tue Mar 03 20:55:09 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"This week is @NWS and @MoSEMA_'s Missouri Severe Weather Preparedness Week. Make sure you and your families are ready for severe storm and flooding season –  learn more about staying safe and prepared here: https://t.co/OMZ1fOXRD2","date":"Tue Mar 03 19:18:33 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to see you all!","date":"Fri Feb 28 14:21:57 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"NEW TIME: Please join us at 5:30pm CT TONIGHT for a tele-town hall! Sign up to be added to our call list by 1:00pm CT: https://t.co/sitK7fQQig","date":"Thu Feb 27 15:57:21 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to see the @HeartlandCUA folks on Capitol Hill today! https://t.co/xJR3ZgAUIc","date":"Wed Feb 26 20:14:07 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Met with @MOBroadcasters and discussed the positive impact Missouri’s local radio has on our communities. Thanks for stopping by! https://t.co/G8Q2I3JJCD","date":"Wed Feb 26 19:20:47 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for having me!","date":"Wed Feb 26 15:57:17 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"THIS THURSDAY: Please join me for a tele-town hall at 6:30pm CT -- I’m looking forward to catching up with the Third District! Sign up to participate here: https://t.co/sitK7fQQig","date":"Tue Feb 25 20:09:20 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Had a great morning at the @CallawayChambe1 of Commerce business breakfast yesterday. Grateful for all the work the Chamber does to support our community, create jobs, and maintain the historic economic success Missouri and the country is experiencing. https://t.co/sUwFKFzX57","date":"Thu Feb 20 20:08:14 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Enjoyed speaking at the @MOFarmBureau Legislative Banquet this week! Missouri is home to the second most farms of any state in the country, thankful for all our farmers who continue our strong agricultural tradition. https://t.co/10uO8KyhLv","date":"Thu Feb 20 17:16:25 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this #PresidentsDay, we remember and thank Presidents past and present. Wishing you a happy and safe Presidents’ Day! https://t.co/a0NvwByQEW","date":"Mon Feb 17 17:46:00 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Valentine’s Day! Thank you to everyone in #MO-03 who participated in our 5th Annual Valentines for Veterans, these kind notes are a great way to let our veterans know we’re thinking of them. https://t.co/RPJH8KqN7y","date":"Fri Feb 14 15:43:12 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"100 years ago today, the Negro National League was founded in Missouri. It created a place where stars were born and helped pave the way for integration in sports and our society. #BlackHistoryMonth","date":"Thu Feb 13 17:17:03 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great to see you, Joseph!","date":"Wed Feb 12 14:58:05 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for stopping by!","date":"Tue Feb 11 22:02:12 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Calling all high school artists! My office is now accepting entries for the 2020 Congressional Art Competition. Please submit your work by April 21st at 5PM. More information here: https://t.co/qrFcJ8pwRC","date":"Mon Feb 10 22:05:46 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"February is American Heart Month &amp; next week is Congenital Heart Disease Awareness Week. CHD is the leading cause of infant deaths in the U.S. &amp; 1 in 100 babies is born with it. It's critical we fight for more medical advancements to protect our children. https://t.co/nsaNeZcGa4","date":"Fri Feb 07 17:24:54 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The American economy continues to boom! Employers added an incredible 225,000 jobs and wage growth is up at 3.1% in January. https://t.co/5LOX7fAyOF","date":"Fri Feb 07 16:45:35 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Instead of incessantly trying to overturn the 2016 election, I hope my Democratic colleagues can finally focus on the real reason they were elected and start working for the American people. https://t.co/DBbXFJTlep","date":"Wed Feb 05 21:46:52 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"A quick reminder why we’re so grateful for law enforcement officers. Thank you @kcpolice for keeping our fellow Missourians safe!","date":"Wed Feb 05 16:53:09 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"I’ll be on @971FMTalk with @MarcCox971 this morning to discuss #SOTU2020 at 8:35amCT – tune in!","date":"Wed Feb 05 13:52:37 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Watch my response to President Trump’s State of the Union address here: https://t.co/l8usbMXJtn","date":"Wed Feb 05 04:23:19 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"@realDonaldTrump has invited a MO mom &amp; her daughter to be guests at tonight’s #SOTU. Robin Schneider’s daughter Ellie was born at just 21 weeks &amp; 6 days – one of the youngest to survive in the U.S. Now, this miracle baby is a healthy 2-year old girl. Welcome to the Capitol!","date":"Wed Feb 05 00:58:43 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Sending prayers &amp; hopes for a speedy recovery to my fellow Missourian, Rush Limbaugh and his family. \nhttps://t.co/UW96xvQsfi","date":"Mon Feb 03 21:46:32 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for a great visit!","date":"Mon Feb 03 19:42:03 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"#ChiefsKingdom","date":"Mon Feb 03 03:17:23 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The last time the @Chiefs were in the @SuperBowl, it was 1970 and Air Force Colonel Edward Hubbard was a POW in Vietnam. Glad to see this Missouri-native and American hero will be attending this year’s game in Miami – GO CHIEFS! https://t.co/XICZ987GJm","date":"Fri Jan 31 21:35:35 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"There are over 234,000 jobs in Missouri that depend on trade with Canada and Mexico. #USMCA is a major victory for Missouri farmers, manufacturers and small businesses and today @realDonaldTrump has signed this historic trade agreement into law. https://t.co/Y0nE6r30SF","date":"Wed Jan 29 17:47:02 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"In 2019, @CBP seized appx. 2,460 lbs. of #fentanyl – enough to kill everyone in the U.S. nearly twice. We’re only 9 days from the DEA's scheduling expiration of this deadly substance. My bill, the Stopping Illicit Fentanyl Trafficking Act would help put a stop to this epidemic.","date":"Tue Jan 28 18:04:15 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Exciting news for Missouri! @USDA has invested $60.9 million in our high-speed rural broadband infrastructure that will improve e-connectivity for households, businesses, farms, educational facilities and heath care facilities in our state. https://t.co/Xy4yvOhA0U","date":"Tue Jan 28 16:10:23 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"The American economy is thriving under \n@realDonaldTrump. We can’t allow an ill-advised accounting standard to threaten it. https://t.co/55WecYBB3B","date":"Tue Jan 28 15:02:59 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Carl Lutz saved nearly 62,000 lives in the Holocaust’s largest civilian rescue mission. Prior to his diplomatic career, Carl - a Swiss immigrant - worked in a MO factory &amp; attended Central Wesleyan College in Warrenton, MO. Read his incredible story here: https://t.co/XvlAvNrfyr","date":"Mon Jan 27 18:49:13 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"On the 75th anniversary of the liberation at Auschwitz, we honor the survivors &amp; remember the victims who lost their lives in the Holocaust. Proud to sponsor the #NeverAgain Education Act to continue the fight against anti-Semitism through education. #HolocaustRemembranceDay https://t.co/Rz849t8BWw","date":"Mon Jan 27 16:58:35 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"I'm thankful to have a President who shares my views on the preciousness of human life from the moment of conception. #MarchForLife","date":"Fri Jan 24 21:31:58 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for having me!","date":"Fri Jan 24 17:18:14 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Grateful to the thousands of Missourians who travel to Washington, D.C. for #MarchForLife every year to show their support for our most vulnerable population: the unborn. I will continue to fight to protect the sanctity of human life in Congress. https://t.co/1h0xIWGjUM","date":"Fri Jan 24 16:53:06 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Innocent babies have a right to the gift of life. On President Trump’s first annual National Sanctity of Life Day, I’m proud to have received an “A” rating on the Susan B. Anthony List National Pro-Life Score Card. https://t.co/rx0tBMjAoR","date":"Wed Jan 22 22:51:21 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, we honor and remember Martin Luther King Jr, a man who spent his life uniting our nation. #MLKDay https://t.co/frzncGMFlY","date":"Mon Jan 20 18:43:29 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/fteQT32AyS","date":"Fri Jan 17 16:58:36 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Under #USMCA, U.S. ag &amp; food exports will increase by $2 billion+ a year. MO's 1.1 million small biz employees will see more job opportunities, less gov interference, &amp; a more level playing field. Looking forward to seeing #USMCA's positive impact in MO! https://t.co/UzlT2kzmIr","date":"Thu Jan 16 17:14:13 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"#CECL can't continue. \nhttps://t.co/pBBJ1hRYgk","date":"Wed Jan 15 23:42:56 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"With Missouri being made up of two-thirds farmland and home to a thriving auto industry, our already strong economy will continue to approve thanks to @realDonaldTrump's #ChinaTradeDeal\nhttps://t.co/kRFDAFEyuV","date":"Wed Jan 15 22:29:30 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"I’m glad the House can finally put this sham investigation behind us and get back to work for the American people.\nhttps://t.co/26iF1jgA4r","date":"Wed Jan 15 21:33:25 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"In the last decade, over 1,065 individuals fell victim to human trafficking in MO. These victims are often hiding in plain sight &amp; unable to get the help they desperately need. To learn how to identify, report or help a human trafficking victim visit https://t.co/KQg0fFemhB https://t.co/00ATPJ0Uw4","date":"Tue Jan 14 18:39:28 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this #LawEnforcementAppreciationDay, we thank Missouri’s finest for answering the call to serve and keeping our communities safe each &amp; every day. https://t.co/mPVySugJNK","date":"Thu Jan 09 17:13:29 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Calling all college students and recent graduates! If you’re energetic, hard-working, and interested in working in a fast-paced environment, my Jefferson City office is accepting internship applications for the spring. https://t.co/DthPgo5Lis","date":"Thu Jan 09 13:41:20 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Grateful no Americans were injured after Iranians launched ballistic missiles at U.S. military bases last night. As expected, Iran took action to save face. But as usual, our military was 1 step ahead of the Iranian regime. I stand behind our Commander in Chief @realDonaldTrump.","date":"Wed Jan 08 15:33:47 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/ftQr9JXilw","date":"Fri Jan 03 18:12:52 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"Don’t miss out on my weekly column where I give an update on the latest happenings in Missouri's 3rd District &amp; Congress! Sign up to receive #BlainesBulletin here: https://t.co/WhqpUwlEov https://t.co/H6b11P7a2E","date":"Thu Jan 02 19:34:12 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/4fHr5tuF1G","date":"Wed Jan 01 20:38:22 +0000 2020","user_id":"1849261916"},{"handle":"RepBlaine","text":"In the past few years, MO has exported over $300 million of goods &amp; services worldwide by utilizing the #EXIM Bank. Thankfully, last week Congress reauthorized this important resource that allows small biz to compete in the global marketplace &amp; keeps jobs in America.","date":"Fri Dec 27 15:15:53 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"https://t.co/MOzFeEQO8n","date":"Wed Dec 25 19:04:24 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"In 2020, our nation’s military will get a 3.1% pay increase – the largest pay bump in a decade. Our men and women in uniform make sure our country is taken care of every day, I’m glad my colleagues and I could pass a bill last week that takes care of them.","date":"Tue Dec 24 16:07:44 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"It truly is the most wonderful time of the year! https://t.co/A9FEoRKj8a","date":"Fri Dec 20 22:08:53 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Another data breach exposing thousands of Americans' personal and financial information. Meanwhile, @EnergyCommerce &amp; @FSCDems have made zero progress on a national data security standard. https://t.co/T9pwkjcDlq","date":"Fri Dec 20 16:21:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Over 234,000 jobs in MO depend on trade with Canada &amp; Mexico, and thanks to #USMCA, U.S. ag and food exports will increase by at least $2 billion each year. This milestone trade deal is a major victory for Missouri farmers, manufacturers and small biz. https://t.co/zSYP1d6DyV","date":"Thu Dec 19 22:36:21 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"House Democrats have achieved nothing more than a massive political divide in America and long-lasting damage to our democracy.\nhttps://t.co/ftoZ3dacOT","date":"Thu Dec 19 02:02:55 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"This has been a 2.5 year process with the sole mission of overturning @realDonaldTrump's election. What a shame. What a sham. https://t.co/PrepFISmsn","date":"Wed Dec 18 19:32:55 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"In recent years, deaths related to fentanyl have seen a 1,000% increase. Like so many other states, Missouri has seen the devastating effects of our nation’s opioid crisis firsthand. Last week, I introduced a bill to combat illicit fentanyl trafficking. https://t.co/LpsPNngivp","date":"Mon Dec 16 22:23:26 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today’s announcement by GM is a testament to the quality of MO03’s workforce &amp; our state's business environment.  Looking forward to many more years of success in Wentzville as auto manufacturing in the U.S. continues to strengthen. https://t.co/qM9r4MBHCz","date":"Fri Dec 13 19:50:06 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"A must-read account from someone actually involved with United States-Ukraine relations. https://t.co/K29dwoURK1","date":"Tue Dec 10 20:18:20 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Read my full statement on the articles of impeachment here: https://t.co/hVOHJvKbqO https://t.co/U7MnjPvASV","date":"Tue Dec 10 18:36:41 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thank you @MOFarmBureau! Honored to receive this award from an organization I’ve been a proud member of for nearly 20 years and so firmly believe in. #MOFB19","date":"Tue Dec 10 13:51:34 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Speaker Pelosi said it herself: Democrats started the impeachment of @realDonaldTrump 2.5 years ago.","date":"Mon Dec 09 20:20:05 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The USMCA will increase U.S. ag &amp; food exports by at least $2 billion a year. 33,049 manufacturing jobs in MO depend on trade with Canada and Mexico. This bill is a no-brainer – Speaker Pelosi needs to stop delaying and bring USMCA to the House floor. https://t.co/lgCRACJtnU","date":"Mon Dec 09 18:22:56 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"America’s economy is red hot! Employers added an incredible 266,000 jobs in November, unemployment -- at just 3.5% -- is at a 50-year low, and workers’ wages have gone up 3.1%. https://t.co/sbj9TPnr5N","date":"Fri Dec 06 14:39:38 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Seeing as Democrats have been trying to impeach @realDonaldTrump since the day he was sworn in, Speaker Pelosi's announcement that the House will proceed with articles of impeachment is not news, just another political stunt in their unconstitutional impeachment “investigation.”","date":"Thu Dec 05 18:08:36 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"House Democrats begin the next phase of their impeachment sham in the Judiciary Committee today. Hope Chairman Nadler remembers his own statement from President Clinton’s impeachment in 1998.","date":"Wed Dec 04 15:45:38 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Blaine's Bulletin: Thanksgiving https://t.co/17yAjiUgXI https://t.co/Hr5b1zcx6d","date":"Fri Nov 29 18:11:16 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Far too often, my constituents face challenges when accessing quality health care in rural Missouri. I will continue to advocate for all Missourians’ access to health care regardless of zip code. #NationalRuralHealthDay","date":"Thu Nov 21 21:08:13 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"House Dems keep changing the narrative hoping to make even an ounce of progress on their impeachment quest. \n\nFirst they accused @POTUS @realDonaldTrump of \"quid pro quo.\"\nNext, “extortion.”\nNow, it’s “bribery.” \n\nTheir investigation is unraveling. It’s time for the sham to end.","date":"Wed Nov 20 14:42:09 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri’s Third District is Deer Country – Franklin and Callaway Counties were ranked #1 and #3 in the state for total deer harvested this past weekend! https://t.co/XerBGrhncS","date":"Tue Nov 19 15:26:53 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Reminder: Join me for a tele-town hall TONIGHT at 5:35pm CST! Please sign up by noon to ensure your number is added to our call list: https://t.co/sitK7fQQig","date":"Tue Nov 19 14:19:29 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"TOMORROW: Please join me at 5:35pm CST tomorrow evening for a tele-town hall! I look forward to hearing from you -- sign up to participate here: https://t.co/sitK7fQQig","date":"Mon Nov 18 20:58:04 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Great news for Callaway County – the Route D Bridge over I-70 will be completely replaced. The fight to keep Missourians safer on our roads continues! https://t.co/F9j2Nzittr","date":"Fri Nov 15 20:46:42 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"What we’ve learned from week one of the Democrats’ public impeachment circus: https://t.co/Zr9kubfvvZ","date":"Fri Nov 15 16:57:43 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, I introduced legislation to improve the recovery process of endangered species in our country and reduce the misuse of the endangered species list. https://t.co/iKx54FVXK9 https://t.co/y8yTJ2cobf","date":"Thu Nov 14 21:30:52 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Once Republicans were actually given a chance to speak, Adam Schiff promptly interrupted the questioning and advised the witness on how to answer. The sham continues. https://t.co/vgafJhJtnp","date":"Wed Nov 13 18:35:36 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"We’re now over two hours into the so-called “open hearing” and not a single Republican has been allowed to ask a question.","date":"Wed Nov 13 17:22:09 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"House Democrats’ tainted impeachment charade drags on today and continues to prevent Congress from legislating. Republicans are ready to pass #USMCA, give our troops a pay raise, and fund the government. Let’s get back to work for the American people.","date":"Wed Nov 13 16:46:32 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy 100th Birthday to the @FarmBureau! The state of Missouri is made up of two-thirds farmland and home to a longstanding agricultural tradition. A great reminder that it’s time pass the #USMCA for our nation's farmers.","date":"Tue Nov 12 19:11:26 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri is home to over 438,000 veterans – today and every day, we thank you. https://t.co/2tmRylmMk5","date":"Mon Nov 11 16:22:27 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Berlin Wall fell 30 years ago today, reinforcing that individual freedom and democracy always overcomes communism. I’m proud a piece of this important moment in history stands today in Fulton, MO. https://t.co/WVur2HwbHr","date":"Fri Nov 08 20:15:37 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today I sent a letter to Speaker Pelosi and Chairman Schiff demanding the release of all transcripts from their secret impeachment depositions. Despite promising increased transparency, this investigation continues to happen behind closed doors and completely on Democrats’ terms. https://t.co/vTvxvXrddi","date":"Thu Nov 07 21:36:36 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Countless communities in rural MO are still in need of dependable broadband. The MO Broadband Grant Program provides state resources that help providers, communities &amp; regions invest in broadband infrastructure in underserved areas of MO. Application info: https://t.co/WfHwwsaQZj","date":"Tue Nov 05 19:51:04 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congrats the Helias Lady Crusaders – Class 3 State Softball Champions!\nhttps://t.co/jm1MFmy2xk","date":"Mon Nov 04 22:00:48 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"#USMCA is a great deal for Missouri and America.  It’s time to pass it! https://t.co/SwthH2amMb","date":"Fri Nov 01 21:05:54 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Democrats are relentlessly pursuing impeachment of @realDonaldTrump, who they've been trying to undermine since his 1st day in office. Today’s vote &amp; this investigation are simply political stunts from Democrats who are still aching from the 2016 election https://t.co/OVaXD196EV","date":"Thu Oct 31 19:04:55 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Witnesses at a hearing with MDIs recently discussed the harmful effects CECL will have on low-to-moderate income consumers. Unfortunately, Chairwoman Waters has yet again blocked any attempt to address this potentially disastrous accounting standard. https://t.co/xDzhwIUjRP","date":"Thu Oct 31 15:29:39 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"A great day with @the_USO service project on Capitol Hill! 2,000 care packages are on their way to our brave men and women defending our freedom abroad. https://t.co/jrlCcYbtmz","date":"Wed Oct 30 18:02:49 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wentzville’s finest answering the call to serve in every way! https://t.co/uU3O1n4uLj","date":"Wed Oct 30 13:47:54 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The #USMCA will benefit farmers, manufacturers and businesses across the country. House Republicans are ready to pass it, but Democrats continue to use this so-called “impeachment inquiry” as a stall tactic.","date":"Tue Oct 29 21:11:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy #NationalFirstRespondersDay! Thank you to all the heroes who risk their lives for Missouri and our nation each &amp; every day. https://t.co/UFUWKKkwbP","date":"Mon Oct 28 21:12:08 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"As the leader of ISIS, al-Baghdadi was one of the most ruthless, evil people on the planet. His death is a victory for the entire world. Thanks to the leadership of @realDonaldTrump &amp; the bravery of our military, we now live in a safer place. https://t.co/CD44YhMapF","date":"Sun Oct 27 15:41:55 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The dollar is the world’s reserve currency because it is the most trusted and stable. With new technologies and rapid innovation, we must make sure we keep it that way. Thank you Mark Zuckerberg for testifying today. https://t.co/rmXRwQIB2z","date":"Wed Oct 23 19:13:42 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"CECL is a direct threat to small banks and the communities they serve. It’s past time for House Financial Services Committee to act.  https://t.co/CWcJTahU0h","date":"Tue Oct 22 21:24:22 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today I sent letters to House Leadership requesting access to all records, documents, transcripts, and materials related to or obtained in the course of the ongoing joint impeachment investigation. The manner in which this investigation is being conducted is unconstitutional. https://t.co/FjtvpTZuXS","date":"Mon Oct 21 22:23:23 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I sent a letter to Treasury Secretary @StevenMnuchin1 urging FSOC to require OFR to conduct a study on the CECL accounting standard. Read it here: https://t.co/VCI4heW0Zp","date":"Mon Oct 21 21:20:16 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I was proud to co-lead a letter with @RepMattGaetz and nearly 70 other Members thanking @SecAzar for his work to end taxpayer-funded research using aborted fetal tissue. https://t.co/fhMfRUMlbO","date":"Mon Oct 21 19:28:45 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today on #NationalMammographyDay, I introduced a bill that would allow mobile mammography units, or \"MammoVans\" to better reach rural, underserved areas in Missouri. https://t.co/ivxus1N1tn","date":"Fri Oct 18 18:39:48 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"My sincere condolences to the Cummings family. I had the opportunity to serve with @RepCummings on the House Oversight Committee as a freshman, and always admired how he guided his life through staunch principles.","date":"Thu Oct 17 16:13:43 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing all my fellow Missourians a very Happy Missouri Day! Proud today and every day to represent #MO03. https://t.co/9k5Cww4rmi","date":"Wed Oct 16 18:19:59 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today is Missouri day – the perfect occasion to celebrate @StLouisBlues Stanley Cup win on Capitol Hill! https://t.co/mOEGPHv51X","date":"Wed Oct 16 14:55:26 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"UPDATE -- Center for Responsible Lending: “As proposed, CECL creates a significant disincentive for lenders to originate loans to low- and moderate-income families and communities of color” @FAFNorwalk https://t.co/ruCjgSedRQ","date":"Tue Oct 15 21:15:59 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Calling all space lovers – @NASA has invited K-12th grade students to name the Mars 2020 Rover! The contest closes November 1st, so be sure to send in your names and short essays soon. https://t.co/jBFWDqE0LV","date":"Tue Oct 15 18:29:14 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"With 7,600 auto care industry employees in #MO03, I’m glad to be a part of the Auto Care Caucus.","date":"Tue Oct 15 15:02:10 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Excited to see the restoration of this 1870 cottage in the Historic City of Jefferson. A joint effort from the federal government and the VA to create a place for veterans to use. Read more here: https://t.co/loSAaxljPD","date":"Fri Oct 11 20:07:12 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Let's go Cardinals! Excited for game 5! #TimeToFly #RedOctober","date":"Wed Oct 09 20:35:01 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I am proud to cosponsor @RepAndyBiggsAZ’s resolution to condemn and censure Rep. Adam Schiff. He should be held accountable for his reckless pursuit of impeachment and for continuously misleading the American people.","date":"Wed Oct 09 18:54:39 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Once again, my colleagues across the aisle are grasping at straws in an attempt to defend their agenda of impeachment. https://t.co/28ZWOyNwVl","date":"Wed Sep 25 15:35:34 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, I announced upcoming constituent service days to be held across #MO03. Staff from my office will be available to assist, one-on-one, with anything from veterans’ benefits to Medicare issues to general questions regarding federal agencies. https://t.co/oV9TXXCaPs https://t.co/0Gg7qRlsX0","date":"Tue Sep 24 20:30:31 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"On #ConstitutionDay, WE THE PEOPLE celebrate the framework for our great nation.\n\nFor over 200 years, the words of our founding fathers have been a beacon of democratic ideals. We must remain vigilant in protecting the rights and freedoms guaranteed by this revered document. https://t.co/fgIyy6kroz","date":"Tue Sep 17 19:57:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"We would do anything to protect our children and that means ensuring they have a properly installed car seat that is right for their AGE, HEIGHT, and WEIGHT.\n\nDo you have #TheRightSeat to keep your child safe?","date":"Mon Sep 16 19:11:17 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"This week I had the pleasure of meeting with leaders from my alma mater, Lincoln University. As a proud graduate of @LUBlueTigers, I’m happy to see @POTUS taking action and prioritizing HBCUs across the nation. https://t.co/iEZtCz9kWI","date":"Wed Sep 11 21:55:34 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"At this moment 18 years ago today, our nation was forever changed. Today we remember and honor those who lost their lives. \n\nWe will never forget. https://t.co/nmTJQowBZ9","date":"Wed Sep 11 12:48:02 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"#MO03 residents from Cole, Lincoln, Miller, Osage and St. Charles counties can submit grant applications at 601 Business Loop 70 West Parkade Center, Suite 235, Columbia","date":"Tue Sep 10 18:30:33 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks to @usda, rural communities affected by natural disasters will get the resources they need! https://t.co/JuAWbmPWVZ","date":"Tue Sep 10 18:30:32 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, House Republicans are taking action and hosting a hearing to examine the Born Alive Infant Protection Act. Tune in at NOON CT https://t.co/69gaK19oXZ","date":"Tue Sep 10 15:52:33 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"77% of voters agree: Babies #BornAlive during an abortion must be protected.\n\n80 times, Representatives have requested a vote.\n\n80 times, Pelosi has blocked a vote to #EndInfanticide\n\nWhy is it so hard for @SpeakerPelosi and House Democrats to pass the commonsense #BornAliveAct? https://t.co/zgGLJjpAd3","date":"Tue Sep 10 15:52:32 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"After a busy Aug. district work period I'm back in DC armed with important knowledge from my constituents. Representing #MO03 is an honor and I'll continue to advocate on your behalf as I return to our nation's capital to tackle critical issues this month. https://t.co/9ZKGBgRfCZ","date":"Mon Sep 09 21:44:52 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Trump administration is putting people first - committing to combat the opioid crisis by providing states with additional resources they need to expand access to treatment, increase prevention, and advance understanding of the epidemic.","date":"Wed Sep 04 20:08:26 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Throughout our nation’s history, American workers have been the driving force behind its growth and success. Our country is built on American grit and the pride of a hard day’s work.\n\nOn this #LaborDay, I hope we can all celebrate the successes of our fellow Americans. https://t.co/vRxm22hJKu","date":"Mon Sep 02 14:45:35 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I had the opportunity to visit the @SitemanCenter on the campus of Barnes-Jewish St. Peter’s Hospital this week. I was amazed by dedication and expertise of the staff and I thank them for having me! https://t.co/qrrYBgKwdr","date":"Fri Aug 30 19:04:49 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"What an honor to spend my afternoon learning more about the work these heroes are doing to keep our communities safe. Thanks for having me!","date":"Thu Aug 29 20:12:10 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"COLE COUNTY – If you’re looking for repair and rebuilding advice following severe weather, @fema will have experts in Jefferson City from August 29th through September 3rd to offer proven home-improvement tips. https://t.co/6VvHGQBNyB","date":"Tue Aug 27 14:40:34 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I’ve had the honor of serving alongside @RepSeanDuffy on the @FinancialCmte for nearly a decade. He has proven himself as a dedicated public servant &amp; devoted family man who will be missed in the halls of Congress. \n\nPlease join me in keeping the Duffy family in your prayers.","date":"Mon Aug 26 21:36:40 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Yesterday the Federal Home Loan Bank of Des Moines presented grants providing critical housing resources for domestic violence victims and seniors in #MO03. It was such an honor to see this investment in our community. https://t.co/UrvakZbSfT","date":"Wed Aug 21 16:37:17 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me in keeping these heroes and their families in our thoughts and prayers.","date":"Mon Aug 19 17:15:17 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"SHOCKING numbers from the company with a majority market share in private education lending. \n\nHow will CECL affect student loan borrowers? FASB has yet to do a comprehensive analysis, so simply put - we don't know. https://t.co/XAC2MUstZh","date":"Wed Aug 14 15:43:51 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today marks 198 years of the great state of Missouri!","date":"Sat Aug 10 22:38:39 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today and every day I stand in awe of the tremendous bravery and sacrifice of our men and women in uniform. On this #PurpleHeartDay we honor those who put their fellow Americans before themselves and paid the ultimate price. We are forever grateful for their service.","date":"Wed Aug 07 17:26:36 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"As farmers across Missouri face undue hardship due to trade tensions, I thank @POTUS and @SecretarySonny for prioritizing efforts to provide support. I urge #MO03 farmers to sign up for the Market Facilitation Program at the following link https://t.co/V3cqUSGdrw","date":"Tue Jul 30 16:00:36 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"On one of the worst days in our nation’s history, thousands of brave men and women put their lives on the line to save their fellow Americans. Our brave first responders deserve to know their families will be taken care of – no matter what. #NeverForget","date":"Mon Jul 29 20:36:33 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"OSAGE COUNTY- today @fema opened a disaster recovery center at St. George Parish (611 E. Main St., Linn) \n\nIt will be open today, tmrw and Monday from 8 am to 7 pm. Please register online at https://t.co/UKDafABZDd or call 800-621-FEMA (3362) before visiting the recovery center.","date":"Fri Jul 26 19:32:34 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"My Washington D.C. office was lucky to have Chloe, Rachel and Jonathan as part of the team this Summer. Thank you for all of your hard work and best of luck in your future endeavors! #NationalInternDay https://t.co/dT9PJLnlTe","date":"Thu Jul 25 21:11:37 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Calling all #MO03 veterans! ⬇️","date":"Wed Jul 24 19:50:55 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The disaster recovery centers will be open from 8 a.m. to 7 p.m. daily. Before visiting a recovery center, residents are asked to register online at https://t.co/UKDafABZDd or call 800-621-FEMA (3362)","date":"Mon Jul 22 18:10:17 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"@fema disaster recovery centers are now open in Cole &amp; Miller counties:\n\n🔴Cole County/Jefferson City Office of Emergency Management (1736 Southridge Drive, Jefferson City)\n🔴Eldon Community Center (309 E. 2nd Street, Eldon)","date":"Mon Jul 22 18:10:16 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"BREAKING → Bipartisanship in the House of Representatives! \n\n332 members vote AGAINST impeaching @realDonaldTrump","date":"Wed Jul 17 22:01:19 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Are you prepared for the rising temperatures in Mid-Missouri? ☀️\n\n@MoSEMA_ has numerous heat safety tips to ensure everyone stays safe and cool.","date":"Wed Jul 17 16:54:03 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"@FinancialCmte @FSCDems It's abundantly clear that no comprehensive analysis was done to see how the most significant accounting change in decades would affect our economy. That's why I recently joined my colleagues on a bill to STOP &amp; STUDY the potential economic effects of CECL https://t.co/Th5Q3Ua4xV","date":"Wed Jul 17 14:22:19 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Bipartisan members of the @FinancialCmte @FSCDems are on the same page – it's irresponsible to blindly implement CECL before the economic effects are fully understood. This morning, FASB will consider delaying some CECL implementation dates. \n\nPut simply – that’s not good enough https://t.co/t0rGIdt0HF","date":"Wed Jul 17 14:15:09 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Now that @POTUS has approved the disaster declaration in some #MO03 counties, property owners and renters can apply for disaster assistance. Please visit https://t.co/ZatNgrfm5Z or contact my office at 573-635-7232 if you need help navigating the process https://t.co/GahhexBlja","date":"Mon Jul 15 17:42:36 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Americans across the nation deserve a more balanced trade agreement that works for our 21st century economy, and now is the time for Speaker Pelosi to bring the #USMCA up for a vote in the House.","date":"Wed Jul 10 16:06:38 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thank you to @POTUS for his swift approval of Missouri’s vitally important disaster declaration. The President’s action today will help Missourians in our #MO03 communities continue rebuilding after facing historic tornadoes and flooding. https://t.co/RAnX49bz43","date":"Tue Jul 09 22:25:20 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Freedom has always been the driving force of American life. Today, I hope you will take a moment to remember the sacrifices of our troops, both at home and abroad, who protect our uniquely American freedom.\n\nWishing everyone in #MO03 a Happy Independence Day! https://t.co/9b30pnzA4N","date":"Thu Jul 04 14:00:01 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"On #PTSDAwareness Day, we must all work together to spread the word and help those suffering get the help they need.","date":"Fri Jun 28 00:26:49 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to welcome our 2019 Congressional Art Competition winner, Gabrielle Miller, to D.C. to see her artwork hanging in the U.S. Capitol. I’m excited for visitors from across the nation to see her wonderful representation of one of Missouri’s most iconic landmarks! https://t.co/YYH58cMF0y","date":"Wed Jun 26 19:42:22 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to Missouri native and my former Chief of Staff Seth Appleton on his well-deserved confirmation to serve as Assistant Secretary of Policy Development and Research at @HUDgov!","date":"Fri Jun 21 14:13:35 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Since 2000, the death rate for Alzheimer’s disease has increased 145%. I’m a proud advocate of legislation that provides resources to advance critically important medical research.\n \nTogether we can fight this relentless disease and #EndALZ https://t.co/qRKLDvZZhY","date":"Wed Jun 19 21:53:01 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Throughout my life I’ve held many titles from student, to small businessman, to Congressman. However, none of these titles will ever mean as much or sound as great as being called “dad” and “grandpa.” \n\nI hope everyone in #MO03 has a great Father’s Day! https://t.co/OEZIqViHA4","date":"Sun Jun 16 18:41:34 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Worth the wait!\n\n#STLBlues #StanleyCupChampions","date":"Thu Jun 13 02:51:03 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations Makenna!","date":"Tue Jun 11 20:42:34 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"After a natural disaster the first step towards rebuilding is assessing the damage. I urge everyone in #MO03 affected by recent disasters to:\n\n✔️Notify your insurance company &amp; file a claim\n✔️Keep disaster-related receipts\n✔️Make a list of the major items that have been damaged","date":"Tue Jun 11 16:19:03 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"75 years ago, the allied forces launched the great crusade to liberate Europe. Today, we remember the Greatest Generation and the reflect on the sacrifices they made to put freedom and liberty above all else. #DDay75 https://t.co/CwrxHrR17N","date":"Thu Jun 06 13:00:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Proud of this hardworking team for winning the state championship!","date":"Tue Jun 04 17:49:42 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Closer than ever! #StanleyCup #stlblues #PlayGloria","date":"Tue Jun 04 13:51:16 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"REMINDER: My office is accepting U.S. Military Service Academy applications for the Class of 2024!","date":"Mon Jun 03 18:18:13 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Liberty High School!\n\n@WSDinfo https://t.co/q0a4oT4rPH","date":"Sun Jun 02 14:03:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Holt High School!\n\n@WSDinfo https://t.co/8L9UbxDoFh","date":"Sun Jun 02 14:02:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Timberland High School!\n\n@thsactivities https://t.co/Mzvv7Eziah","date":"Sun Jun 02 14:01:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to St. Charles West High School!\n\n@scwactivities https://t.co/wMf1bFSPHs","date":"Sun Jun 02 14:00:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"After witnessing the power of mother nature, our community demonstrated the importance of neighbors helping neighbors.\n\nGarrett Sommerer’s dedication to helping his community instills faith in the kindness and compassion of our future generations. #MO03 is so proud of you!","date":"Fri May 31 18:55:38 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to @WindsorHighOwls! https://t.co/xp4ghoG31n","date":"Thu May 30 20:47:55 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to St. Charles High School!\n\n@SCHSactivities https://t.co/PutlU6a5tf","date":"Thu May 30 20:44:45 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to my hometown @StE_Hornets baseball on winning the Class 1 state championship! https://t.co/0szKkpz5O6","date":"Thu May 30 14:12:35 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I am pleased to announce my office is now accepting U.S. Military Service Academy applications for the Class of 2024! \n\nThis is an opportunity to gain a strong college education and serve our nation. https://t.co/VlRdtxEljL https://t.co/RSrBDdDjgE","date":"Tue Apr 30 20:38:56 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks to @AjitPaiFCC for once again showing his commitment to expanding access to reliable internet. We cannot allow rural Americans to be left behind. https://t.co/uPnpBIcTYf","date":"Tue May 28 17:03:01 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"When you go home\nTell them of us and say\nFor your tomorrow\nWe gave our today\n\n#MemorialDay2019 https://t.co/Amgo0agAUn","date":"Mon May 27 13:01:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this Memorial Day, I hope everyone will take the time to reflect on the blessings of freedom &amp; liberty that come with living in this great nation &amp; the sacrifice of those who made it possible. https://t.co/STAzuI6ngl","date":"Mon May 27 13:00:01 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Fort Zumwalt North High School!\n\n@FZSchools https://t.co/AsUCvfiouP","date":"Sat May 25 14:04:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Fort Zumwalt West High School!\n\n@ZumWestHigh https://t.co/84DmAdQEET","date":"Sat May 25 14:03:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Fort Zumwalt South High School!\n\n@FZS2019 https://t.co/lLiueR35ON","date":"Sat May 25 14:02:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Fort Zumwalt East High School!\n\n@FZESENIORS2019 https://t.co/3pY917wva8","date":"Sat May 25 14:01:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Calvary Lutheran High School! https://t.co/6gDH4My9Au","date":"Sat May 25 14:00:01 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Montgomery County High School! https://t.co/xRtY2eVwth","date":"Fri May 24 13:02:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Sullivan High School!\n\n@sullivaneagles https://t.co/zn1JH7dsd1","date":"Fri May 24 13:01:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to South Callaway High School! https://t.co/3OCTDsyW46","date":"Fri May 24 13:00:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Washington High School!\n\n@SDofWashington https://t.co/Jo6Tzv7Rh0","date":"Thu May 23 22:01:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Crosspoint Christian School!\n\n@CCSCougarTweet https://t.co/4Zy9vsK5T3","date":"Thu May 23 22:00:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"For additional updates in #JeffersonCity follow @GovParsonMO and @NWSStLouis","date":"Thu May 23 16:07:15 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Jackie &amp; I are praying for our neighbors in Jefferson City. We are so grateful to the first responders who drove into the storm to protect our community.\n\nTo everyone in #JeffersonCity #MO03 please stay safe and follow @MOPublicSafety @MODOT_Central @MOsema_ for continued updates","date":"Thu May 23 12:14:25 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Herculaneum High!\n\n@BlackcatUpdates https://t.co/1SfJxHgs1B","date":"Wed May 22 15:53:32 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congrats @StLouisBlues! #StanleyCup #stlblues #PlayGloria","date":"Wed May 22 14:46:26 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"100 years ago today, the United States House of Representatives passed the 19th Amendment granting women the right to vote and ensuring the voices of all Americans are heard for generations to come. #WomensVote100 https://t.co/hLGmHJ7dwl","date":"Tue May 21 18:35:13 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the St. Elizabeth High School Class of 2019!\n\n@StE_Hornets https://t.co/ICOr3cd4RH","date":"Mon May 20 13:28:03 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the @SeckmanHigh Class of 2019! https://t.co/Czp4SnpQtH","date":"Mon May 20 13:25:54 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the Pacific High School Class of 2019!\n\n@PacificIndians https://t.co/SmeQhaxw7G","date":"Mon May 20 13:23:45 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the Owensville High School Class of 2019! https://t.co/uEZHDKCm1Y","date":"Mon May 20 13:20:56 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the Linn High School Class of 2019! https://t.co/hEe4S6yvhc","date":"Mon May 20 13:18:41 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the @heliascatholic Class of 2019! https://t.co/nUoxRKFp1c","date":"Mon May 20 13:17:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the Cole County High School Class of 2019!\n\n@ColeRV1 https://t.co/AMDU8vrPXD","date":"Mon May 20 13:16:12 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congrats to the @spxlancers Class of 2019! https://t.co/nK5bvpZmmI","date":"Mon May 20 13:13:02 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Warrenton High School! https://t.co/2LLZhFV9QQ","date":"Sun May 19 00:50:33 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Wright City High School!\n\n@wcr2high https://t.co/Nkt0Eb4D2I","date":"Fri May 17 17:32:29 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Chamois High School! https://t.co/49POrgmaZU","date":"Fri May 17 17:27:56 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Tuscumbia High School!\n\n@ttown_lions https://t.co/vp9WipB0dZ","date":"Fri May 17 17:22:03 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Silex High School!\n\n@silexr1 https://t.co/HXaKXZP2qv","date":"Fri May 17 17:16:50 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Twin City Christian Academy! https://t.co/DeF9MBQQXD","date":"Fri May 17 17:15:37 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Northwest High School! https://t.co/rdDGFaJUHi","date":"Fri May 17 17:06:35 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to North Callaway High School!\n\n@NCHS_TBirds https://t.co/7MS3jE4fRw","date":"Fri May 17 17:02:19 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to New Bloomfield High School!\n\n@NBr3CATS https://t.co/wQV7YoPgcs","date":"Fri May 17 17:00:41 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Fulton High School!\n\n@FHSHornets https://t.co/WAW4Dl6bOW","date":"Fri May 17 16:57:55 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the Camdenton High School graduates!\n\n@LakersChs https://t.co/2iJU4HJYl4","date":"Fri May 17 15:13:36 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Nearly 1 million men &amp; women across the nation leave their homes &amp; families each day without the certainty of return. They put their lives on the line to protect our communities and we will never forget their heroism. #NationalPoliceWeek https://t.co/00LPXSJEcr https://t.co/SRYwintqAy","date":"Fri May 17 14:34:17 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Bipartisan members of the @FinancialCmte @FSCDems agree – it is irresponsible to move towards implementation of CECL until the economic effects can be fully understood.\n\nI strongly urge FASB to STOP &amp; STUDY before blindly implementing this significant accounting change. https://t.co/OJWhrDaNj8","date":"Thu May 16 18:03:25 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Osage High School!\n\n@SOTOHighSchool https://t.co/VkJiAtuBNq","date":"Thu May 16 13:05:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Union High School!\n\n@UnionRXI https://t.co/XHSkUC0RKA","date":"Thu May 16 13:02:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to St. Francis Borgia High School! https://t.co/Le9GpX0szw","date":"Thu May 16 13:01:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Hermann High School!\n\n@HHSBearcats https://t.co/8ZnDF3PmJ0","date":"Thu May 16 13:00:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to St. Dominic High School!\n\n@StDominicHS https://t.co/nF7WGV3pJe","date":"Wed May 15 14:28:34 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Orchard Farm High School!\n\n@OrchardFarmRV https://t.co/UrljupLdhE","date":"Wed May 15 14:17:54 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to New Haven High School!\n\n@newhavenschools https://t.co/HSCBQ8j7cm","date":"Wed May 15 14:11:10 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing a Happy Mother’s Day to all the wonderful moms in #MO03! https://t.co/Zelch5KtGk","date":"Sun May 12 20:46:08 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Fatima High School! https://t.co/KirQZP7Xmy","date":"Sun May 12 14:20:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Eldon High School!\n\n@EldonMustang https://t.co/7nwEBYPxU0","date":"Sun May 12 14:15:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Troy Buchanan High School!\n\n@Linc_R3 https://t.co/wEPFir7dk3","date":"Sun May 12 14:10:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Jefferson  City High School!\n\n@JCPSTWEETS https://t.co/LFf29jJErq","date":"Sun May 12 14:05:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Blair Oaks High School!\n\n@WeAreBlairOaks https://t.co/hzDMBURw3F","date":"Sun May 12 14:00:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Russellville High School!\n\n@R_VilleStudents https://t.co/YYQvDhzRDM","date":"Sat May 11 14:00:01 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Wellsville High School! https://t.co/fnaFukCIgj","date":"Fri May 10 13:05:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to Crystal City High School!\n\n@CCHornetnews https://t.co/wsw1aS2LTC","date":"Fri May 10 13:00:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy Graduation Day to St. Clair High School! @StClairR13 https://t.co/V2gLmLHznj","date":"Thu May 09 13:20:02 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the Vienna High School Class of 2019! https://t.co/f3vFPKf6ZY","date":"Wed May 08 14:29:08 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to the Belle High School Class of 2019! https://t.co/AKxdTITOR9","date":"Wed May 08 14:27:41 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"With amazing high school students like Paige, Jonah and Trey the future of STEM is bright! It was a pleasure to once again congratulate @OHSSTEM on winning the #SolveForTomorrow contest. \n\n#MO03 is so proud of your accomplishment! https://t.co/RJZCj74U5i","date":"Fri May 03 14:32:15 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I am pleased to announce my office is now accepting U.S. Military Service Academy applications for the Class of 2024! \n\nThis is an opportunity to gain a strong college education and serve our nation. https://t.co/VlRdtxEljL https://t.co/RSrBDdDjgE","date":"Tue Apr 30 20:38:56 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to meet you @TCOMPARDO. Thank you for your service!","date":"Tue Apr 30 17:10:19 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"From my family to yours, Happy Easter! https://t.co/eoWfstJeUN","date":"Sun Apr 21 11:50:20 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The full report can be found here → https://t.co/d8kfSxkhZg","date":"Thu Apr 18 16:58:42 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"No collusion. https://t.co/U3P2nN8bfk","date":"Thu Apr 18 16:54:30 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"ICYMI in Missouri…\n\nTaxes are DOWN 24%\nTax Refunds are UP 3.3%\n\n#TaxReformWorks https://t.co/4lMzCwMGqR","date":"Wed Apr 17 21:02:45 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"REMINDER: Less than a week to enter the Congressional Art Competition!\n\nPlease click here for more information → https://t.co/T0Qa2JyB6y","date":"Wed Apr 17 16:28:37 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to meet with @HomeyerPM and discuss the importance of manufacturing in #MO03! Thanks for stopping by.","date":"Thu Apr 11 19:03:43 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Jamie Dimon to @RepBlaine “I think CECL will constrain banks at precisely the wrong time.” https://t.co/aMTtEdDIaa https://t.co/lZVFlIoZho","date":"Wed Apr 10 20:25:37 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri has the 6th highest lung cancer rate in the nation. \n\nToday, I’m wearing turquoise to support the @LungAssociation fight against lung cancer as we work toward better methods of early detection, treatments and cures. #TurnTheHillTurquoise https://t.co/Tjkl0WZlEa","date":"Wed Apr 10 19:21:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Proud of our @OHSSTEM students and their innovative invention. Congratulations on your amazing accomplishment!","date":"Wed Apr 03 17:57:38 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"You deserve to know: I stand with @SteveScalise and @RepAnnWagner and strongly support their legislation to #EndInfanticide","date":"Tue Apr 02 13:11:06 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Joined by 83 of my pro-life colleagues, I’m requesting @rosadelauro and @TomColeOK04 include language to protect those who cannot protect themselves → https://t.co/QkTEXrGUyS","date":"Mon Apr 01 17:49:16 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"At a time when protecting babies is, unbelievably, a partisan issue, I’m urging leaders on the Appropriations Committee to do what is right and support our most vulnerable populations.","date":"Mon Apr 01 17:49:16 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"REMINDER: Entries for the Congressional Art Competition must be delivered by Tuesday, April 23rd! \n\nPlease click here for more information → https://t.co/T0Qa2JyB6y","date":"Mon Apr 01 15:45:20 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"To the Missouri #veterans who courageously answered our nation’s call to serve, we honor you today. #VietnamWarVeteransDay","date":"Fri Mar 29 21:05:02 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to meet with @MOPrimaryCare representatives this week to discuss healthcare priorities for Missourians.","date":"Fri Mar 29 18:03:11 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"These amazing young people are in Washington D.C. today advocating for NIH funding. It was a pleasure to meet with them and I assured them I will support funding for NIH and the President’s Childhood Cancer Initiative! #SSFtakesonDC https://t.co/3u8UjgUgF9","date":"Wed Mar 27 19:23:30 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"My statement on the Mueller report https://t.co/xfrrZK4t49","date":"Sun Mar 24 23:31:15 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"With historic flooding in Missouri please follow @MoSEMA_ @GovParsonMO @MoDOT @Readygov @fema for important #flooding updates and safety tips.","date":"Thu Mar 21 15:08:39 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Honored to receive the @FRCdc True Blue Award for my commitment to supporting #ProLife causes. I will always fight for the most vulnerable among us and for our Missouri values. https://t.co/28MCkfortZ","date":"Wed Mar 20 20:25:53 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Calling all high school artists in #MO03! \n\nI just announced the 2019 Congressional Art Competition details. Please click here for more information →  https://t.co/T0Qa2JyB6y https://t.co/BqQhNpldOo","date":"Tue Mar 05 14:07:19 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I was happy to join @CallawayChambe1 this morning to discuss my work at the federal level to support small business growth. https://t.co/kKBaVdetVC","date":"Wed Mar 20 15:10:37 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"To everyone in #MO03 affected by flooding, please protect yourself and your loved ones by following these important #floodsafety tips. https://t.co/kmDD7dzlb1","date":"Mon Mar 18 17:51:02 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to address #CUNAGAC and meet with Missourians from @HeartlandCUA. Welcome back to DC!","date":"Thu Mar 14 12:38:24 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today at the @FinancialCmte we’re discussing reauthorization and reforms of the National Flood Insurance Program, a critical issue for many homeowners in #MO03. Tune in! https://t.co/bOFwul05WU","date":"Wed Mar 13 15:23:10 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missouri is home to nearly 100,000 farms totaling more than 28 million acres of farm land.\n\nThis week we honor the hardworking Missourians who work day in and day out to feed our communities and our nation. #NationalAgWeek https://t.co/B9em8HvB1O","date":"Mon Mar 11 19:03:07 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"How bad could the potential impact of #CECL be on millions of American consumers and small banks? Financial regulators simply don't know. https://t.co/6Yfz44PaxR","date":"Mon Mar 11 17:23:43 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today we celebrate the extraordinary women in our lives and across the globe. As the proud grandfather of two young granddaughters, I can’t wait to see more female CEOs, Congresswomen and small business owners making history and realizing their dreams! #InternationalWomensDay","date":"Fri Mar 08 21:49:48 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Good luck to my hometown @StE_Hornets basketball team as they compete in the Class 1 state semifinals tonight! #GoHornets #FinalFour","date":"Fri Mar 08 21:00:37 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"ICYMI: House Democrats believe increasing government bureaucracy and trampling states' rights are the best ways to “empower the American people.”\n\nHR 1 is for the politicians NOT for the people https://t.co/DILG4tRdK8","date":"Wed Mar 06 16:20:41 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Calling all high school artists in #MO03! \n\nI just announced the 2019 Congressional Art Competition details. Please click here for more information →  https://t.co/T0Qa2JyB6y https://t.co/BqQhNpldOo","date":"Tue Mar 05 14:07:19 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"ICYMI: @FinancialCmte members on both sides of the aisle raised CECL concerns in their questions to @federalreserve Chair Powell yesterday https://t.co/AXrSqO1TQx","date":"Thu Feb 28 15:33:55 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"After overcoming a difficult season, I’m happy to congratulate @EldonMustang senior Isaiah Simmons on winning an individual Class 2 state wrestling title! https://t.co/YURY4mB4ob","date":"Wed Feb 27 21:17:08 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"At 9 am CT @federalreserve Chair Powell will be testifying before the @FinancialCmte. Tune in to hear important updates on the state of our economy! https://t.co/TZbnXBmLOC","date":"Wed Feb 27 14:30:58 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"President @realDonaldTrump is committed to keeping American citizens safe and I wholeheartedly support his efforts to secure our nation.","date":"Wed Feb 27 01:32:20 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"America is facing a crisis at the border and instead of working to protect those who elected us, my colleagues have decided to waste time on a purely political resolution.","date":"Wed Feb 27 01:32:20 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Knowing full well this resolution has no chance of being signed into law, today my Democratic colleagues advanced another futile attempt to obstruct the President’s statutory authority and overturn his national emergency declaration.","date":"Wed Feb 27 01:32:20 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Tune in!","date":"Tue Feb 26 15:10:05 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The gift of life is an inherent right bestowed on each and every human being at conception. As your Congressman, it's my responsibility to fight for Missouri values &amp; protect the most vulnerable among us. I'm encouraged by this pro-life shift in our nation https://t.co/7OUZY4vYVh","date":"Mon Feb 25 22:59:05 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"This President’s Day, we recognize those who have cultivated the country we know today. Each President is known for his strengths and weaknesses, wins and losses, yet each indelibly shaped the path of our nation. https://t.co/lcHjGRMwsj","date":"Mon Feb 18 20:01:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Legislation to fund the government is headed to @POTUS desk. \n\nRead my full statement here: https://t.co/dQhYPGMYNR https://t.co/Lnw1mSLOrg","date":"Fri Feb 15 02:42:29 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing a Happy Valentine’s Day to everyone in #MO03! ❤️\n\nOn this special day, I LOVE seeing how many valentines we received for our veterans. What an amazing show of support and gratitude for those who served our nation! https://t.co/DYyBiSIWmF","date":"Thu Feb 14 17:29:49 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was such an honor to meet with Missourian Lynna Hodgson to hear more about her inspiring story! @SOMissouri","date":"Tue Feb 12 19:46:16 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was an honor to serve alongside @RepWalterJones. He will be missed. \n\nI send my deepest condolences to his loving family at this difficult time.","date":"Mon Feb 11 14:51:35 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Joining @MorningsMaria on @FoxBusiness shortly. Tune in!","date":"Fri Feb 08 13:18:36 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Tonight, we were reminded of why we should all be proud to be American. \n\nRead my full #SOTU statement here https://t.co/6AhIblNDUi","date":"Wed Feb 06 03:35:47 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"\"We must keep America 1st in our hearts. We must keep freedom alive in our souls. And we must always keep faith in America's destiny - that one Nation, under God, must be the hope and the promise and the light and the glory among all nations of the world!\" @realDonaldTrump #SOTU","date":"Wed Feb 06 03:29:48 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"\"America was founded on liberty and independence - not government coercion, domination, and control. We are born free, and we will stay free. Tonight, we renew our resolve that America will never be a socialist country.\" @realDonaldTrump #SOTU","date":"Wed Feb 06 03:10:09 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"\"Let us work together to build a culture that cherishes innocent life. And let us reaffirm a fundamental truth: all children - born and unborn - are made in the holy image of God.\" @realDonaldTrump #SOTU","date":"Wed Feb 06 03:04:04 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"\"Simply put, walls work and walls save lives. So let's work together, compromise, and reach a deal that will truly make America safe.\" @realDonaldTrump  #SOTU","date":"Wed Feb 06 02:46:24 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"\"If there is going to be peace and legislation, there cannot be war and investigation...We must be united at home to defeat our adversaries abroad.\" @realDonaldTrump #SOTU","date":"Wed Feb 06 02:25:42 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Finally heading to the Capitol to see @realDonaldTrump deliver his second State of the Union Address! #SOTU \n\nTune in at 8pm CT on https://t.co/9xCSpTRuZG https://t.co/Oo3K7AoqgP","date":"Tue Feb 05 22:40:19 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today’s the day! \n\nTune in tonight for @POTUS second State of the Union Address and join the conversation with #SOTU https://t.co/3y2bJYiUoQ","date":"Tue Feb 05 14:27:44 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for having me!","date":"Mon Feb 04 21:00:48 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"DEADLINE EXTENDED – My offices will be accepting Valentines for Veterans until Monday, February 11th. \n\nThat means #MO03 has an extra week to take a moment and create a valentine for those who bravely served our nation! https://t.co/bPVT6cXDnV","date":"Fri Feb 01 19:52:38 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"February is #AmericanHeartMonth ❤️\n\nAs your Congressman I will continue supporting heart disease research and funding to ensure Missourians continue to live long, happy and healthy lives. #NoMOHeartDisease #BlainesBulletin https://t.co/hXe0yxNY3W","date":"Fri Feb 01 15:26:30 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Keep them coming! Valentines for Veterans can be dropped off or mailed to my district offices in Wentzville, Jefferson City, and Washington until Monday, February 4th at 5:00 pm. \n\nPlease visit my website for additional details https://t.co/bPVT6cXDnV https://t.co/wjPRyOuSMC","date":"Tue Jan 29 19:39:41 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"With bitterly cold weather headed our way, I urge you to follow @MoSEMA_ and @Readygov for important information and safety tips. Stay safe #MO03!","date":"Tue Jan 29 14:50:14 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Data security and breach notification are some of my top priorities. On this #DataPrivacyDay I’m happy to see Chairman @MikeCrapo of Senate @BankingGOP furthering the dialogue on this important issue.","date":"Mon Jan 28 20:13:17 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to @RodKRCG13 on his induction into the Missouri Sports Hall of Fame!","date":"Mon Jan 28 19:05:58 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"We must keep our promise to the American people. https://t.co/o4UdyMaHzs","date":"Fri Jan 25 20:37:09 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I’ll be joining @kevcirilli on @BloombergTV momentarily. Tune in!","date":"Wed Jan 23 21:20:50 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"REMINDER: Valentines for Veterans can be dropped off or mailed to my district offices until February 4th at 5:00 p.m.\n\nI hope everyone can find a moment to create a valentine for those who bravely served our nation. https://t.co/bPVT6cXDnV https://t.co/8NSA1HAt4N","date":"Wed Jan 23 17:44:08 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this #MLKDay we honor the amazing life and legacy of Dr. Martin Luther King Jr. https://t.co/bDDGrYdMbI","date":"Mon Jan 21 16:31:37 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I support President Trump's mission to secure our border and keep our citizens safe, and I hope Democratic leaders can set aside partisan politics, show true leadership, and reopen the government.","date":"Sat Jan 19 23:12:13 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Divided government can only work if both sides show a willingness to compromise and negotiate in good faith. @realDonaldTrump has shown he is willing to work with Congressional Democrats on their immigration priorities, even in the face of continued Democratic obstruction.","date":"Sat Jan 19 23:12:13 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"46 years after Roe v. Wade, the pro-life movement is as strong and as passionate as ever.\n\nThis morning I spoke with #prolife Missourians who traveled to Washington DC to make their voices heard. https://t.co/PdooIzJLc8","date":"Fri Jan 18 19:40:42 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for having me!","date":"Wed Jan 16 21:44:36 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The @usdafsa office in Jefferson City will be open on Jan 17, Jan 18, and Jan 22. It is located at 1911 Boggs Creek Road, Jefferson City.\n\nFor additional information click here https://t.co/BJWKdaVtdr or call the Jefferson City @usdafsa office at (573) 893-5196","date":"Wed Jan 16 20:03:20 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Last year, Customs and Border Patrol seized or helped seize:\n- 282,000 lbs of cocaine\n- 248,000 lbs of methamphetamine\n- 6,500 lbs of heroin\n- 2,400 lbs of fentanyl\n \nWe must do everything we can to secure our border and protect American citizens https://t.co/6Dc1fpfcdw","date":"Mon Jan 14 17:17:00 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"The border crisis is not an elaborate ruse as some would like us to believe, but the result of decades-long policy failures. \n \nMy press releases from 2009 sound like they were written today, a bleak reminder of how little has been done to #SecureOurBorder https://t.co/F67fV8dixp","date":"Fri Jan 11 20:50:38 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today I reintroduced four bills that will make a real difference to coastal Americans as we continue to work toward permanent, comprehensive reform of the National Flood Insurance Program https://t.co/OqYkomBXqq https://t.co/KuTqfyI0c3","date":"Thu Jan 10 21:48:31 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I’m thrilled to announce my 4th annual ‘Valentines for Veterans’ initiative today!\n\nLast year my office received more than 12,000 valentines for local vets. I hope everyone can find a moment to create a valentine for those who bravely served our nation. https://t.co/bPVT6cXDnV https://t.co/z9N2alT9CV","date":"Wed Jan 09 18:08:30 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"President Trump's mission to thwart illegal immigration, gang violence, crime, drugs &amp; human trafficking is in the best interest of all Americans. I support @POTUS mission to secure our border &amp; keep our citizens safe. \n\nI hope my colleagues will keep our promise #SecureOurBorder","date":"Wed Jan 09 03:07:45 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"New Year. New Congress. \n\nMake sure you're in the loop by signing up to receive my weekly column! I share updates from Washington D.C. each week in #BlainesBulletin https://t.co/TC2dHxvYxK https://t.co/chuEZVgNIb","date":"Fri Jan 04 15:41:55 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"I’m back in DC and ready for the first day of the 116th Congress! I am so grateful and honored to have the opportunity to represent the great people of #MO03 for another term. https://t.co/4AZHVvqzga","date":"Thu Jan 03 17:06:49 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing everyone a prosperous and blessed 2019!","date":"Tue Jan 01 19:12:41 +0000 2019","user_id":"1849261916"},{"handle":"RepBlaine","text":"On behalf of my staff and the entire Luetkemeyer family, I wish everyone in Missouri-03 a Merry Christmas! https://t.co/lRVxfmcb7L","date":"Tue Dec 25 15:49:08 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Please join me in keeping our brave armed forces in your thoughts and prayers today. Their selflessness and love of country serve as the purest embodiment of the Christmas spirit and set a shining example for all Americans to follow.","date":"Tue Dec 25 15:49:08 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing you a safe, happy and blessed holiday. Merry Christmas Eve! https://t.co/9B7fysNwOp","date":"Mon Dec 24 20:14:10 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Last night I kept my promise to the people of #MO03 and supported additional funding to secure our border and keep our citizens safe. The House has done its job. I urge my Senate colleagues to get this legislation over the finish line.","date":"Fri Dec 21 17:14:32 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to @heliascatholic senior Ellie Rockers on being named the Missouri High School Volleyball Coaches Association Player of the Year! https://t.co/Cs3lSQP4tx","date":"Thu Dec 20 15:26:03 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to my hometown’s own Ross Struemph on his accomplishment. Keep up the good work!","date":"Mon Dec 17 16:14:56 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"My office was happy to have Anthony, a @Mizzou sophomore, interning in my DC office this semester. While in DC, he has done great work helping my staff and even gave tours of the Capitol to our fellow Missourians. I wish him well in all his future endeavors! @mu_serves https://t.co/9MJH43cozY","date":"Fri Dec 14 20:07:02 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"For 382 years the National Guard has always stepped up to serve when the American people needed them most. Today we celebrate these American heroes, especially the great men and women serving in the @Missouri_NG! #Guard382","date":"Thu Dec 13 18:48:07 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"I’m proud to support this legislation to provide the certainty Missouri farmers deserve and invest in the future of our rural communities. #2018FarmBill\n\nRead my full statement here → https://t.co/xI6CI5pL1f","date":"Wed Dec 12 22:05:39 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Many of our #armedforces serving around the world are unable to spend the holidays with their families. Today I joined the @RedCross #HolidayforHeroes event to send holiday greetings to our men and women in uniform, thanking them for their service and sacrifice. https://t.co/CWOe634yJ8","date":"Tue Dec 11 17:56:39 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"TOMORROW I will be holding a live telephone town hall to give an update on what I’ve been doing in Washington and answer questions from #MO03. If you are interested in joining the telephone town hall, please sign up here → https://t.co/1RGqqhyWpY","date":"Mon Dec 10 15:46:49 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to Coach Ted LePage and the Blair Oaks football team on winning the Class 2 State Championship! https://t.co/KdQezBMVcT","date":"Fri Dec 07 21:29:39 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"77 years ago, our nation was under attack. Today we honor the Greatest Generation and remember the brave Americans lost at #PearlHarbor. \n\nMay we never forget their sacrifice. https://t.co/tjykIC5qwY","date":"Fri Dec 07 16:06:42 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"This week @POTUS safeguarded the Delta Queen’s storied history, returning her to MO rivers.\n\n@POTUS signs S.140 The Frank LoBiondo Coast Guard Authorization Act of 2018 Tuesday Dec. 4, 2018, in the Oval Office of the White House. (Official White House Photo by Joyce N. Boghosian) https://t.co/YMGF2PDtoP","date":"Thu Dec 06 16:27:29 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to speak at the ribbon cutting ceremony for the long-awaited new Highway 47 Bridge! Replacing the aging bridge originally built in 1934, the new bridge will provide a vital link between Franklin and Warren counties. https://t.co/5wyGPS3oim","date":"Mon Dec 03 18:07:39 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"America has lost an honorable man who leaves a legacy of conservative leadership. President George H.W. Bush exemplified the Greatest Generation through his faithful commitment to our nation as a war hero, Congressman, Ambassador to the UN, Director of the CIA and President.","date":"Sat Dec 01 16:04:49 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Along with my fellow Americans, I send my sincere condolences to the entire Bush family on this difficult day. We all gain some comfort in knowing he is now reunited with his beloved wife, First Lady Barbara Bush.","date":"Sat Dec 01 16:04:49 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Proud of my friend @PatrickMcHenry who will lead the @FinancialCmte Republicans with distinction.","date":"Fri Nov 30 17:36:49 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"500 MILLION customers may have had information exposed, including passport numbers and payment information in some cases. We must make data security a priority and finally address this critical issue affecting Americans across the nation. https://t.co/ZprkmW4Rl3","date":"Fri Nov 30 14:31:28 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":".@RepHensarling has been a friend and colleague for many years, and it has been a privilege to serve alongside him on the @FinancialCmte. I wish him all the best in his future endeavors!","date":"Wed Nov 28 18:41:09 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"\"Full Steam Ahead: Delta Queen Legislation Headed to President’s Desk\" https://t.co/J5KmxZxSi6\n\nI hope Missourians will be able to enjoy the historic Delta Queen as it traverses Missouri’s waterways for years to come.","date":"Tue Nov 27 23:59:07 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"During this season of reflection, I ask you to join me in giving thanks for the many blessings and freedoms we enjoy as Americans. On behalf of myself, my family, and my staff, I hope everyone has a safe, joyous, and blessed Thanksgiving!","date":"Thu Nov 22 15:55:30 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Missourians cherish the tradition of togetherness. Each year I look forward to a house full of grandchildren and my wife Jackie’s sweet potato casserole. This year I'm sharing my favorite Thanksgiving recipe, and I hope you and yours will enjoy it as much as our family does! https://t.co/U8WeNPH6Nn","date":"Thu Nov 22 15:55:29 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Let the #Thanksgiving planning commence! The @USDA offered these #FoodSafety tips to keep your Thanksgiving bacteria free. https://t.co/rzuV3Q36VA","date":"Wed Nov 21 17:18:18 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today is #NationalRuralHealthDay \n\nFor additional information and resources, please visit the Missouri Office of Rural Health’s website https://t.co/m4oFoLh6Is","date":"Thu Nov 15 16:52:26 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to my colleague @RepJasonSmith on his reelection to serve on the House GOP Conference leadership team. I know he will serve our conference just as he serves the great people of Missouri’s 8th district, with a commitment to upholding conservative Missouri values.","date":"Wed Nov 14 21:03:12 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"The bravery and sacrifice of Specialist Jeffrey L. White, Jr. and his family reflects the best of our nation. It was a privilege to dedicate the Pacific Post Office in honor of Jeffrey and pay tribute to our hometown hero. https://t.co/EmrvFdKVXU","date":"Tue Nov 13 20:52:14 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this #VeteransDay we honor all the selfless men and women who served our nation. Freedom is not free and we are all eternally grateful for their sacrifice. https://t.co/l9U3hLw44X","date":"Sun Nov 11 19:18:22 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"ICYMI: @WSJ Editorial Board on Operation Choke Point “Regulators have no business blocking lawful companies from the U.S. banking system, as if Check Into Cash were the government of Iran.” https://t.co/yO6ikX5LqT","date":"Thu Nov 08 18:38:10 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing everyone in Missouri-03 a safe and happy Halloween! https://t.co/Iczp6EUk66","date":"Wed Oct 31 15:16:31 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"TOMORROW is National Prescription Drug Take Back Day. I urge you to check your medicine cabinet! If you don’t need it, please dispose of your prescription drugs for the safety of your loved ones.\n\nFor more information on collection sites near you visit https://t.co/9Lp1Ij2mzx https://t.co/h3CSWxaoLu","date":"Fri Oct 26 21:00:02 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"This week @POTUS signed into law H.R. 6, the SUPPORT for Patients and Communities Act.\n \nRead more about this historic legislation to combat the opioid crisis in this week’s #BlainesBulletin → https://t.co/ckdqDqpWzl","date":"Fri Oct 26 18:46:03 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"With Veteran’s Day around the corner, my office is able to have a flag flown over the United States Capitol in honor of any veterans in your life. If you’re interested, please call my Washington DC office at 202-225-2956 or fill out the form on my website https://t.co/QvIooDPUsK","date":"Thu Oct 25 20:18:02 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"I am deeply concerned by the blatant intimidation, coercion and bias employed by bureaucrats playing politics with the livelihood of Americans. We have a duty to ensure businesses are never again subject to despicable abuses of power like Choke Point. https://t.co/gjNsoh6ijm","date":"Thu Oct 25 13:15:16 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"I support President Trump and Vice President Pence’s strong denouncement of today’s attempted attacks. This type of violence has no place in our nation.","date":"Thu Oct 25 00:17:28 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to address the 2018 Young Bankers Leadership Conference last week. I will continue to fight for reasonable and responsible regulations that allow bankers to get back to the business of investing in our communities.","date":"Mon Oct 22 19:58:30 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It is an honor to represent so many great Missourians from #MO03! Happy #MissouriDay!","date":"Wed Oct 17 21:48:47 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"“The U.S. is back on top as the most competitive country in the world, regaining the No. 1 spot for the first time since 2008” #BetterOffNow https://t.co/H5htfc4YX7 https://t.co/BPw8cKrhE7","date":"Wed Oct 17 17:52:09 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, I called on FDIC Chairman McWilliams &amp; Comptroller Otting to do what their predecessors consistently declined to do by investigating this abuse of power and restoring the integrity of their agencies. https://t.co/ZcvecPMAiu","date":"Mon Oct 15 16:57:52 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"As a former examiner, I find it appalling that regulators would not only allow but encourage this irresponsible behavior. The intimidation tactics and implicit bias employed by these unelected bureaucrats stands in direct opposition to the important missions of the agencies.","date":"Mon Oct 15 16:57:52 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"On Friday, we learned of additional compelling evidence exposing the vindictive bureaucrats who crusaded against legitimate businesses by starving them of access to financial services. https://t.co/dHVBzVvIjz","date":"Mon Oct 15 16:57:51 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"For the last five years I've fought to end the Obama Administration’s ideologically driven initiative against individuals and legal businesses – aptly named “Operation Choke Point”","date":"Mon Oct 15 16:57:51 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy to see a hometown business investing in the future of our community and expanding right here in Missouri’s third district! https://t.co/OdK4nmPjdi","date":"Fri Oct 12 15:29:33 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Luetkemeyer Congratulates Justice Brett Kavanaugh on his Confirmation https://t.co/MvkRSOeRyk https://t.co/aAX2J4m8OJ","date":"Sat Oct 06 20:27:17 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Congratulations to Dr. Jerald Jones Woolfolk, the newly inaugurated President of @LUBlueTigers. As a proud alum, I’m happy to welcome Dr. Woolfolk to our historic university.","date":"Fri Oct 05 21:46:38 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"More great economic news! https://t.co/ovrElUDAsD","date":"Fri Oct 05 16:00:39 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"REMINDER: Today at 1:18 CT @FEMA will be conducting a nationwide test of the Wireless Emergency Alert System. 🚨","date":"Wed Oct 03 15:04:17 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"This extension will allow @MissouriRevenue to complete the transition to REAL ID without subjecting Missourians to the hindrance of noncompliance.","date":"Mon Oct 01 20:43:36 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Read more about Tax Reform 2.0 in this week’s #BlainesBulletin → https://t.co/2OFkhrpLql","date":"Fri Sep 28 16:30:38 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today I joined my colleagues to deliver permanent tax relief to families and small businesses, safeguarding our economic prosperity, creating jobs and ensuring future generations continue to reap the benefits of our growing economy. https://t.co/jphkwuDcE3 https://t.co/h3uSnsFRjV","date":"Fri Sep 28 16:26:57 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It's an honor to receive the @NFIB Guardian of Small Business Award.\n\nSmall businesses are the heart of our communities and drive economic growth in this country. I'll continue to advocate for pro-growth economic policies that support small businesses in MO and across the nation. https://t.co/o1fawKdnkr","date":"Thu Sep 27 16:48:11 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today I voted to:\n✔️ Provide our troops with the largest pay raise in 9 yrs\n✔️ Fully fund the Department of Defense\n✔️ Deliver resources to fight the opioid epidemic\n✔️ Provide Hurricane Florence relief https://t.co/b6yrt3VHHE","date":"Wed Sep 26 21:35:38 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"For 71 years the dedicated men and women of the USAF have defended our nation. Thank you for your service!","date":"Tue Sep 18 14:29:55 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"The U.S. Constitution provides the framework for our great nation, and for 231 years it has been a beacon of our democratic ideals. On this #ConstitutionDay we celebrate the unique rights and freedoms we, as U.S. citizens, are guaranteed. https://t.co/awtaiTsfYJ","date":"Mon Sep 17 19:17:44 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"@FinancialCmte We need better cooperation from all my colleagues and the industries that handle consumer data to advance additional meaningful changes. At some point there will be another major breach, and without a comprehensive solution our constituents will pay the price for our inaction.","date":"Thu Sep 13 19:30:54 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"@FinancialCmte I’m disappointed that my colleagues on the other side of the aisle did not join committee Republicans to elevate the conversation surrounding data security and vote to institute new statutory requirements for all financial firms.","date":"Thu Sep 13 19:30:25 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"PASSED → The @FinancialCmte just passed my bill to protect and notify financial institution consumers in the event of a data breach. https://t.co/AfLsg1lE4R","date":"Thu Sep 13 19:28:53 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to address the #MIBAConv18 yesterday. Thanks for having me!","date":"Wed Sep 12 17:40:41 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"17 years ago, our nation was under attack. \n\nOn this day, we honor the lives tragically lost and remember the bravery and heroism of our fellow Americans. We will never forget. https://t.co/q44dTLsYoS","date":"Tue Sep 11 12:00:02 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"ICYMI: U.S. Jobless Claims Declined to Fresh Post-1969 Low Last Week #BetterOffNow https://t.co/wfpR83LwjY","date":"Thu Sep 06 14:19:25 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"This ceremony was another reminder that freedom is not free, a reality the White family knows far too well. Next time you go by the Specialist Jeffrey L. White Jr. U.S. Post Office, take a second to remember the sacrifice of those who protect our nation https://t.co/b2hDX2h83D","date":"Wed Sep 05 13:16:02 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Army Specialist Jeffrey L. White from Catawissa, MO tragically lost his life in 2012, just one week before he was scheduled to come home on leave. Last week I had the honor of joining Jeffrey’s family and local officials for the dedication of the Pacific Post Office in his memory","date":"Wed Sep 05 13:14:29 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, we celebrate the hard work of Americans across the nation. I hope you have a safe and happy holiday with your loved ones!","date":"Mon Sep 03 19:46:07 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"ICYMI: US economy logs best performance in nearly 4 years https://t.co/88DdeeUTTg #BetterOffNow","date":"Wed Aug 29 19:37:04 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today the world has lost a great American hero. Senator McCain served our nation for more than half a century, dedicating his life as a distinguished member of the U.S. Navy and the U.S. Senate. Please join me in keeping his wife Cindy and his family in your prayers this evening.","date":"Sun Aug 26 02:01:56 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"The new Emergency Operations Center is critical to my constituents in St. Charles County and it was a pleasure to see the progress for myself. Thank you for having me!","date":"Wed Aug 22 15:39:20 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"We also had Samantha, Bryce and Carter intern in my Washington D.C. office this summer. Thank you all for your hard work and we wish you the best in the future! https://t.co/VcWAvcoydi","date":"Tue Aug 21 16:12:07 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"This summer my office had the pleasure of having Halle intern in my Jefferson City office. https://t.co/8Vwp2opKuc","date":"Tue Aug 21 16:10:45 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"If you don’t already receive my weekly e-newsletter, you can sign up on my website https://t.co/l0j90rTD2c #blainesbulletin","date":"Fri Aug 17 17:43:20 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"From U.S. Capitol tours to help with Federal Agencies to service academy nominations – my staff is here to help. \n\nRead more about how my office can help you in this week’s column → https://t.co/BKNwW3lHRU #blainesbulletin","date":"Fri Aug 17 17:42:18 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":".@POTUS just signed the National Defense Authorization Act into law - ensuring our troops have the resources they need to defend our nation and providing them with a well-deserved pay raise. Thanks to @POTUS leadership and the bravery of our armed forces, America is #betteroffnow https://t.co/1kcKC7Mu1R","date":"Mon Aug 13 19:39:08 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today we celebrate 197 years of the Show Me State! https://t.co/77IkWJ8M2h","date":"Fri Aug 10 15:40:37 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"TUNE IN - I’ll be joining @MariaBartiromo on @FoxBusiness @MorningsMaria in just a few minutes","date":"Fri Aug 10 11:51:23 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"ICYMI: U.S. workers received their biggest pay increases in nearly a decade over the 12 months through June, a sign the strong labor market is boosting wages https://t.co/h3kw7Ph2Be","date":"Wed Aug 01 15:18:40 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"This month my office had the opportunity to give U.S. Capitol tours to more than 280 Missourians! If you’re visiting Washington D.C. please reach out to my office at 202-225-2956 or visit my website. \n\nWe’d love to have you stop by! https://t.co/oHD9CzIdHx","date":"Tue Jul 31 20:14:32 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to meet advocates from #ATeamMissouri to discuss how Congress can support their important mission. #DignityHasAVoice https://t.co/HLAY2ArpZc","date":"Thu Jul 26 17:00:36 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Unemployment ↓\nWages ↑\nConsumer confidence ↑\n\nThe economy is booming and we’re just getting started. America is #betteroffnow https://t.co/vgnZDUdzaf https://t.co/aCBID3vejo","date":"Mon Jul 23 22:28:39 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Heartbroken to hear of the tragedy in Branson last night. Please keep these families in your thoughts and prayers.","date":"Fri Jul 20 13:55:40 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Yesterday I had a very productive conversation with the @NTSC_CISO regarding the future of data security legislation. It was a pleasure to hear their perspective as I continue to work on this important issue. https://t.co/6s06rrzZPH","date":"Thu Jul 19 13:11:30 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"@federalreserve @FinancialCmte ICYMI -  “He’s not a think-tank guy, but a banker from the real world, and that gives him a perspective that I think is important.” https://t.co/Oyk7CxBCEQ","date":"Wed Jul 18 14:13:28 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"HAPPENING NOW - @federalreserve Chair Powell testifies before the @FinancialCmte on Monetary Policy and the State of the Economy. \n\nTune in here https://t.co/DJ18GCryy5","date":"Wed Jul 18 14:12:56 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"PASSED - The House just passed the JOBS and Investor Confidence Act with broad BIPARTISAN support. https://t.co/TALPpvAq1c","date":"Tue Jul 17 22:51:50 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks to @USRepRodney and @RepTomGraves the FY19 Financial Services Appropriations bill includes my legislation to permanently end Operation Choke Point. This will ensure no future administration can coerce banks into terminating relationships due to personal and political bias. https://t.co/mPHSsHtGMs","date":"Mon Jul 16 21:07:15 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Last week I had the opportunity to meet with representatives from @JDRF who updated me on their important mission. \n\nIt was a pleasure to meet you, and thank you for your hard work fighting against type 1 diabetes! #T1D https://t.co/GOXZjiEHwL","date":"Mon Jul 16 19:51:59 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Using the Federal Reserve as a personal ATM follows neither the spirit nor the letter of the Constitution. \n\nThanks to @RepTomGraves leadership, the House will soon vote to ensure proper Congressional oversight of the @CFPB by FINALLY subjecting it to the appropriations process. https://t.co/2YUkA4auzc","date":"Fri Jul 13 15:04:15 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today I met with great students from the Hermann FFA chapter. It was a pleasure to meet you all and welcome to Washington DC! https://t.co/ICGqQUN39r","date":"Thu Jul 12 15:57:46 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"I’m happy to see this crucial project come to fruition. The bridge rebuild will create more than 100 jobs in our area and boost our local economy. https://t.co/9UvF388W3q","date":"Wed Jul 11 14:33:28 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was a pleasure to welcome our 2018 Congressional Art Competition winner, Courtney Walsch, to Washington DC! \n\nIf you’re visiting the @uscapitol this year, keep an eye out for her painting and please reach out to my office for help with scheduling tours https://t.co/oHD9CzIdHx https://t.co/jtbGwrNpPN","date":"Tue Jul 10 19:02:02 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"My full statement on President Trump's nomination of Brett Kavanaugh https://t.co/WjNGzantgN https://t.co/ItBOfMCmQX","date":"Tue Jul 10 01:54:53 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Happy to have Missouri’s own @RoyBlunt leading the Senate in the fight to #EndALZ https://t.co/Hc93JjjBto","date":"Mon Jul 09 19:46:02 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"CLASS OF 2023 - My office is now accepting applications for Service Academy nominations for the class of 2023. For more information about the application process or general questions, please contact my Jefferson City office at 573-635-7232. https://t.co/s1D3vvnDy0","date":"Fri Jul 06 18:37:41 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"The U.S. economy added 213,000 jobs last month, beating expectations. More great news for Americans across the nation! https://t.co/qRdROBtgRO","date":"Fri Jul 06 15:39:36 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"As we celebrate the birth of our great nation, I hope you are spending the day with your family and friends and enjoying the unmatched rights and freedoms we have as Americans. On behalf of myself, my family and my staff – Happy Fourth of July! https://t.co/ZvQMSVxKnP","date":"Wed Jul 04 13:00:01 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Calling all #MO03 students and recent graduates – if you’re interested in a fall internship with my office, please contact my Washington D.C. office at 202-225-2956 or my Jefferson City office at 573-635-7232 for more information. https://t.co/UTiVQZiIEt","date":"Mon Jul 02 16:50:10 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"TUNE IN to hear @SecretaryCarson testify before the @FinancialCmte this morning https://t.co/HEUn26QNXU https://t.co/x0zxoj32U2","date":"Wed Jun 27 14:11:18 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"At 1 pm CT I will be chairing a @FinancialCmte hearing on the implications of de-risking in the wake of the financial crisis. Watch LIVE here → https://t.co/iRuyN9fAdj","date":"Tue Jun 26 17:57:10 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Last week the House passed the 2018 Farm Bill. This critical legislation prioritizes rural America and provides much-needed certainty to Missouri farmers. \n\nClick here to read more → https://t.co/TPWrO4INEt","date":"Mon Jun 25 18:24:14 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"On this day, we recognize the 230th anniversary of the ratification of our nation’s founding framework.  Through the Constitution the Founding Fathers laid the groundwork for the greatest nation in history.  \n\nWe are eternally grateful for their courage and foresight. https://t.co/glyTpW9odd","date":"Thu Jun 21 14:34:29 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today I welcomed Greg Prestemon, President and CEO of the @edcscc to testify before the @HouseSmallBiz Committee. It was an honor to have a #MO03 constituent testify about how important small businesses are to our communities. Thank you for your hard work! https://t.co/WVHypoWZfi https://t.co/wQAAxYyHRA","date":"Wed Jun 20 17:39:57 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Thanks for stopping by! https://t.co/FwHbJUc7cG","date":"Wed Jun 20 12:55:27 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Tune in tomorrow to hear how tax reform is helping our economy get back on track ↓ https://t.co/ocZDtCffjA","date":"Tue Jun 19 20:01:49 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Wishing a Happy Father’s Day to all the great dads in Missouri-03!  I hope you have a wonderful day spent with your loved ones. https://t.co/ELSxZPN5t2","date":"Sun Jun 17 18:53:18 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"This week, members of the Montgomery County FFA are in Washington D.C. for the @NationalFFA Washington Leadership Conference. It was a pleasure to meet with these great young people and hear more about the conference. Thanks for stopping by! https://t.co/G3TruNlGvY","date":"Fri Jun 15 15:05:50 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"As we continue our work to combat the opioid crisis, I was proud to support the THRIVE Act. This legislation will help address the housing needs of individuals recovering from opioid addiction.\n\nThanks to my @FinancialCmte colleague @RepAndyBarr for sponsoring this critical bill! https://t.co/cOkF5ADfE0","date":"Thu Jun 14 20:38:34 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today we honor all that the Red, White and Blue means to us as Americans. On this day, we also salute the men and women in uniform who protect the unparalleled freedom and hope our flag represents. #FlagDay https://t.co/cwGBF69Pxk","date":"Thu Jun 14 14:52:04 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Yesterday, the House passed 25 bills to tackle the opioid crisis. We have a responsibility to get this problem under control, and I will continue to fight until we find a solution. https://t.co/0jER4ODklQ","date":"Wed Jun 13 20:50:51 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was an honor to discuss the important issues facing Missouri with @GovParsonMO. Under his leadership, our state’s future looks bright! https://t.co/WuSCoMu79A","date":"Mon Jun 11 17:20:57 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Yesterday, I had the opportunity to meet with some great young people from the Elsberry FFA in Washington, DC. Thanks for stopping by! https://t.co/yFZzFCRN3O","date":"Fri Jun 08 19:58:22 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"74 years ago today, it was the beginning of the end. \n\nToday we remember those who gave their lives and those who returned home knowing their accomplishments will never be forgotten. #DDayRemembered https://t.co/lgyLCnoaeh","date":"Wed Jun 06 13:29:09 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"We’ve been working hard to get America’s economy back on the right track, and it looks like our hard work is paying off. https://t.co/pij5HyfcYZ","date":"Mon Jun 04 17:51:55 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Good luck! https://t.co/fouyIxjpXe","date":"Fri Jun 01 15:16:46 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"More great economic news for Missourians and Americans across the country! \n\nWith unemployment matching its lowest point since 1969, our economy is on the right track. I will continue to fight for responsible, pro-growth economic policies to benefit all Americans. https://t.co/A53wIfGlwW","date":"Fri Jun 01 14:49:35 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Luetkemeyer Statement on Governor Eric Greitens Resignation https://t.co/IVvBPhYIrl https://t.co/Ir6NNKTwKE","date":"Tue May 29 21:57:27 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was an honor to nominate such an outstanding young woman to attend the @AF_Academy. Paige has a bright future ahead of her and I am confident she will make Missouri-03 proud! https://t.co/1XJme0wuSV","date":"Tue May 29 15:49:19 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today we honor the brave men and women whose love of country led them to answer the call to defend our nation. Memorial Day is a time to remember our fallen heroes – those who made the ultimate sacrifice. Without them, America would not be the country it is today. https://t.co/h3NoluHrmi","date":"Mon May 28 12:44:22 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"It was an honor to stand alongside @realDonaldTrump as he signed the most significant pro-growth banking deregulation bill in decades. Under the leadership of President Trump, things are looking up for community banks and consumers across the nation https://t.co/FmfhzUtRzy","date":"Thu May 24 21:03:23 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"The Farm Bill is critical to our Missouri-03 farmers and rural communities. This week I had the opportunity to discuss the Farm Bill with Kermit Miller from @KRCG13 while he was in Washington DC https://t.co/wJrNJmQBUH","date":"Wed May 23 22:54:03 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"PASSED: S. 2155 is headed to the President's desk! This a win for community financial institutions, a win for small businesses, a win for consumers, and a win for the American economy. https://t.co/NjkQW9Ona8 https://t.co/j4nNe2MOJz","date":"Tue May 22 21:44:38 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Today, too many consumers are left struggling to get the tools they need to achieve financial independence. \n\nS. 2155 is a big step in the right direction. #Relief4MainStreet https://t.co/vnXctoVbyS","date":"Tue May 22 19:07:42 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"In the wake of the financial crisis, Americans needed reg reform that would lift the economy.  Instead, Congress responded with a framework that increased the cost of financial products, restricted access to loans, and redistributed credit away from middle-income borrowers.","date":"Tue May 22 19:06:18 +0000 2018","user_id":"1849261916"},{"handle":"RepBlaine","text":"Yesterday I had the opportunity to stand next to @POTUS as he reversed the @CFPB auto lending guidance. Working alongside my colleagues and @WhiteHouse, we must continue to roll back harmful Obama-era regulations. (Official White House Photo by Shealah Craighead) https://t.co/ZR3jBxFd3Z","date":"Tue May 22 12:50:39 +0000 2018","user_id":"1849261916"}]