[{"handle":"RepBradWenstrup","text":"GE Aviation’s engine testing facility in Peebles, Ohio – right in the heart of our Second District – contributed to the sounds of Hollywood’s latest @TopGunMovie! Read more here: https://t.co/85DAwOL9Ft","date":"Thu Jun 16 21:04:05 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Even more unfortunate, with a looming recession, real wages shrinking, and gas prices skyrocketing, things are just getting worse. https://t.co/C2IlBMQlvY","date":"Wed Jun 15 18:35:30 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Unfortunately, under President Biden, working women haven’t had it this bad in decades.","date":"Wed Jun 15 18:16:00 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“Murder is already against the law. Criminals pay no attention to our laws. A conversation that revolves merely around what laws we can enact and what guns we can ban is one that is intellectually lazy.” https://t.co/z4C0xwbhJs","date":"Tue Jun 14 20:43:15 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Army is the best club I ever joined. In 1998, I picked up the phone, dialed 1-800-USA-ARMY, and my life was forever changed. It’s an honor to serve our great country. Happy 247th Birthday @USArmy! https://t.co/9uui3EzOV6","date":"Tue Jun 14 15:27:42 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The American flag was born amid a revolution. As Americans, we must work to \"mend our every flaw,\" as it says in the song “America the Beautiful” and live up to the Founders’ vision of \"liberty and justice for all\" who live under Old Glory. https://t.co/M5v5I5LMzM","date":"Tue Jun 14 13:37:08 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"5 years ago, a terrorist tried to assassinate members of the Republican baseball team. Every day, I thank God for the bravery of the armed police officers and countless miracles that saved @SteveScalise and all of us that day. https://t.co/pWFqpx6vjt","date":"Tue Jun 14 12:52:29 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Chillicothe, Ohio was recently named a top 15 small town to visit in 2022. If you have not been, I hope you will come visit our communities and see all that Southern Ohio has to offer soon. https://t.co/y930K9HRmI","date":"Mon Jun 13 22:03:37 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I was able to greet this summer’s adventurers as they paddled the Ohio River Challenge’s 250 miles from Portsmouth to Louisville over 10 days. This great tradition helps showcase river recreation and tourism in our Ohio river counties and towns. https://t.co/2xO7gKEgzd","date":"Mon Jun 13 20:36:12 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Putin's inhumane blockade of Ukrainian goods will prove catastrophic for other nations that depend on food imports. As allies, we must not allow Putin to starve the world. https://t.co/7HX7rTdaMP","date":"Fri Jun 10 17:58:16 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As a physician, commonsense tells me that if we don't look at the events in someone's life that lead to the thoughts and feelings that lead to this murderous behavior, then we are doing our society a grave injustice. https://t.co/jozmPFakkg","date":"Thu Jun 09 14:38:43 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Supreme Court leak and the inflammatory language from the left is putting Justices' lives at risk. We were lucky to not lose anyone at the baseball field five years ago; let's not put others at risk. https://t.co/eG6DrEPX71","date":"Wed Jun 08 18:21:56 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Honored.\nhttps://t.co/SIhu4fX6ka","date":"Wed Jun 01 15:58:45 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"At the Greenfield, Ohio Memorial Day Parade with my children. We honored those that gave their lives for our freedom. May we not let them down. https://t.co/MspOrPNHzl","date":"Mon May 30 18:24:14 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Click here to RSVP if you are interested, and please share with any high school students you think might be interested. https://t.co/MFuqNRrdyZ","date":"Thu May 05 18:35:04 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Reminder: My office will host our annual Academy Day on Saturday, May 7th, for students, parents and educators who are interested in learning more about applying to the U.S. Military Service Academies.","date":"Thu May 05 18:35:04 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today we celebrate President Grant's 200th birthday. A native of SW Ohio, Grant was a great leader and general who helped restore and rebuild our country when it was most needed. As we celebrate him, we are reminded of the mark he left on American history, and his legacy. https://t.co/TZnPJ0Yncz","date":"Wed Apr 27 18:29:21 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you or someone you know is interested in working on behalf of the people of Ohio’s Second District, click the link below for more information. The deadline for application submissions for my Anderson Township and Peebles offices is May 6th. \n \nhttps://t.co/gUlmT8Qdps","date":"Wed Apr 13 13:15:51 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Are you a hard-working student who is interested in public policy? My Anderson Township and Peebles offices are still accepting Summer internship applications! Any student who is enrolled in college or graduate school and is at least 18 years of age is eligible to apply.","date":"Wed Apr 13 13:15:51 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I support any efforts that would put the Russian people in charge of their own future, free of a diabolical dictator. https://t.co/3MGTItg5N6","date":"Sat Mar 26 22:13:41 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"President Biden is right on this - Putin is a ‘butcher’; the truth must be told. Russia and the world will be better off without Putin in power.","date":"Sat Mar 26 22:13:41 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Don Young was an incredible public servant and an even better friend. The last few years we became even closer. Don had many stories to tell and we joked regularly. My heart breaks as my sympathies extend to his wife, family, and friends. We miss you, Don Young.","date":"Mon Mar 21 12:36:41 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our leaders shouldn't fear what Putin might do if planes are sent to Ukraine for their defense. Putin should fear what we might do if he continues down this path.\n\nSend the planes.\n\n\"Peace through strength.\"","date":"Fri Mar 11 15:25:28 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I call on the good people of Russia to rally against Putin, who does not care about them or their well-being, and stand with each other in solidarity, in protest, and in supporting leaders who will save the Russian people from this maniacal dictator.","date":"Fri Mar 04 17:05:43 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In a few minutes, I will be joining @FOX19 to discuss the ongoing crisis in Ukraine. Be sure to tune in! https://t.co/sOiXrNIHyc","date":"Fri Feb 25 13:50:36 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My weekly \"Bringing the Capitol to You\" emails are great for history buffs, students, and anyone with an interest in our American political institutions. You can share with friends and sign up here: https://t.co/8OgZWDO4eh","date":"Thu Feb 17 15:02:32 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Historically, my office provides guided tours of the U.S. Capitol Building to Ohioans visiting Washington, D.C. However, due to the ongoing pause on public tours, I am giving Ohioans an opportunity a behind-the-scenes look at our seat of democracy – from home. https://t.co/eZHp1DeSNb","date":"Thu Feb 17 15:02:31 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Keep in mind as you see blue states lift mask mandates and Democrats try to claim credit:\n\nThe science on COVID hasn’t changed. The political science has.\n\nRemember: Republicans have fought to allow Americans to sensibly and methodically move past the pandemic. Democrats haven’t.","date":"Wed Feb 09 15:38:23 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"With the Olympic Ceremonies in Beijing beginning tomorrow, we must do more to protect Team USA athletes and counter the CCP’s authoritarian ambitions. My thoughts⬇️\n\nhttps://t.co/150rFjR0Sc","date":"Thu Feb 03 14:25:17 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Located in the Cox Corridors of the U.S Capitol is the famous quote from one of Benjamin Franklin's letters. To read this letter and learn more about the Silence Dogood letters, click here: https://t.co/H4ND3uLNPP","date":"Fri Jan 07 15:56:21 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Bringing the Capitol to you:\n\nUnder the pen name Silence Dogood, 16-year-old Benjamin Franklin wrote letters to the editor to his older brother, James, at the New-England Courant about a future of freedom from the monarchy. https://t.co/74AvDXhoPW","date":"Fri Jan 07 15:56:20 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Time and again, people who ought to be getting it right have circulated inaccurate information or tainted the truth with ideology. Talk to YOUR doctor. My latest: https://t.co/CGou1dzlTO","date":"Wed Jan 05 22:07:02 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In dealing with the COVID-19 pandemic, far too many public health officials have lost sight of the need for patient-focused, straight forward communication.","date":"Wed Jan 05 22:07:02 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations Bengals! Excited to see what you can do in the playoffs! #RuleTheJungle","date":"Wed Jan 05 01:43:12 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congrats to the @GoBearcatsFB on a season that we will never forget! I'm impressed by what this team was able to accomplish and proud to be a Bearcat.","date":"Tue Jan 04 15:18:51 +0000 2022","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Last week, I visited with Cincinnati Children’s new CEO, Dr. Steve Davis, and learned about their recent expansion to be able to serve more patients in the region. https://t.co/DUj8aR6wrH","date":"Tue Dec 28 18:32:02 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"From my family to yours, Merry Christmas! \nPlease join me in praying for our brave servicemembers who are away from their families right now. May God bless us all and keep us from harm. https://t.co/zjlNEXkqYy","date":"Sat Dec 25 16:31:13 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Medal of Honor is our military’s most prestigious award, and I’m grateful to see these heroic men receive the recognition they deserve. God bless them all. https://t.co/k0QFJpHwoH","date":"Thu Dec 16 01:06:02 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It’s great to see local organizations, like RecoverWisely, help give individuals struggling with addiction a chance for recovery. I’ve had the opportunity to meet with Daniel and hear about his journey and the great work he is doing to help others. https://t.co/yMZZbAeHMH","date":"Tue Dec 14 20:06:27 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This week in the Capitol, I want to highlight Winston Churchill’s wisdom and foresight in the fight against tyranny during World War II. This bust of Winston Churchill was donated to the Capitol by @ChurchillCentre. Find more information here: https://t.co/GxbmA0wXA8.","date":"Fri Dec 10 20:32:11 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Renamed the “Freedom Foyer” in 2015, Congress dedicated this small rotunda in the Capitol to foreign dignitaries who led countries from impending oppression. America is thankful for its Allies, especially our friends across the pond. https://t.co/5DQnVSzEHW","date":"Fri Dec 10 20:32:10 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Inflation - a tax on ALL Americans - has hit a near 40-year high. The Biden administration's claims that inflation is \"transitory\" and a \"high class problem\" falls flat with Ohioans who can't afford these dramatic price increases. https://t.co/fAzqEF3EVl","date":"Fri Dec 10 19:34:54 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We must always be reminded of what happened on this day in 1941 at Pearl Harbor.\n\nPay homage to all those brave Americans who gave the ultimate sacrifice and those who fought back.\n\nAt the day’s end, may they all rest in comfort with God in Heaven. https://t.co/Sp6UInSFe2","date":"Tue Dec 07 15:45:26 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/02qmdPZfob","date":"Mon Dec 06 23:30:31 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Senator Dole was a statesman and a hero who embodied the Greatest Generation. His service in the military and as an elected official is admirable and inspiring. \n\nMay he Rest In Peace.","date":"Sun Dec 05 19:47:07 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You can read Adams' full speech here: https://t.co/UMpc3d8PYo.","date":"Fri Dec 03 16:31:37 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The architects of the U.S. Capitol Building filled it with wisdom from our founding fathers. Located in the Cox Corridors is this famous Samuel Adams quote from just after the first Continental Congress enacted the Declaration of Independence. https://t.co/EyJywK2CJS","date":"Fri Dec 03 16:31:37 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Wishing all our Jewish friends and families a Happy Hanukkah this week! https://t.co/BDNf2ZL1zP","date":"Fri Dec 03 14:30:40 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"A common scam this time of year includes bad actors targeting victims by soliciting donations to fake charities. Here’s a helpful tool to ensure that any donations you make are going to legitimate charities. \nhttps://t.co/uUsSgrb6t1","date":"Thu Dec 02 14:17:38 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great news for the rule of law! I continue to stress that vaccines have undoubtedly saved lives and are an important tool to protect against COVID-19. However, whether or not to receive one should be a decision made between a patient and their doctor. https://t.co/MiGwnNodNZ","date":"Wed Dec 01 22:05:25 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"On the policy front, I’ve championed the bipartisan Treat and Reduce Obesity Act to increase access to treatment that help with chronic weight management and will ultimately lead to a healthier and higher quality of life. https://t.co/1Q0fMyyMkR","date":"Tue Nov 30 22:00:39 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I appreciated a very informative visit and roundtable discussion with Cincinnati-based startup Standard Bariatrics, which develops medical devices for surgical treatment for individuals struggling with obesity. https://t.co/4LupKljsww","date":"Tue Nov 30 22:00:38 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As we look to the health challenges of the future, we’re going to need find different ways to address the growing obesity issues in America, both through prevention and treatment. It is great to see new companies innovating and working toward heath solutions across our nation.","date":"Tue Nov 30 22:00:38 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"On this Thanksgiving, I am eternally grateful for Americans, past, present, and future. I pray for the continued success of this country.\n\nMay you find peace, comfort, and prosperity every day, but especially today. \n\nHappy Thanksgiving and God bless! https://t.co/MFV9AB9VZK","date":"Thu Nov 25 14:11:07 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"His service and sacrifice deserve our respect and praise, and giving him a proper burial is just one of the ways we can honor him and help give his loved ones comfort and closure. https://t.co/Y0bZC6mzL1","date":"Tue Nov 23 00:00:47 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This soldier’s return has been long overdue. I’m grateful for Corporal Kenneth Foreman’s family and friends to see Brown County get one of our fallen countrymen back.","date":"Tue Nov 23 00:00:46 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My statement regarding the Democrats' #BuildBackBroke Act⬇️ https://t.co/788q2M3b5L","date":"Fri Nov 19 17:02:26 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I recently introduced the Stop Vaccine Mandates Act to rescind the Biden administration's vaccine mandates for federal employees and federal contractors. https://t.co/Ob2XIXTwtL","date":"Wed Nov 17 22:50:55 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The vaccines have undoubtedly saved lives over the past year, but vaccination decisions should be made between you and your doctor, not the federal government and your employer.","date":"Wed Nov 17 22:50:55 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I am proud to have had members of my staff in this program in the past and know how valuable this experience can be for veterans. Those interested can follow the link below for more information about the Fellowship qualifications and application process.\nhttps://t.co/COGirNIbJW","date":"Tue Nov 16 14:20:53 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My office is currently seeking applicants for a Wounded Warrior Fellow in our Ohio office: The Wounded Warrior Program provides entry-level opportunities for wounded and/or disabled veterans to serve in a 2-year fellowship working for a Member of Congress.","date":"Tue Nov 16 14:20:53 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We owe our veterans a debt of gratitude. I want to take this Veterans Day to thank those who served our country and who were willing to put their lives in danger to defend our freedoms. Today is a day of reflection and appreciation for all those who honorably wore the uniform. https://t.co/tdWzisI3YN","date":"Thu Nov 11 19:08:54 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to join @RepMariaSalazar in introducing the SERVICE Act to help veterans in difficult situations. https://t.co/jRaar27LeK","date":"Tue Nov 02 13:31:54 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"To put this in perspective, families of soldiers who are killed in action receive less than 1/4th of what the Biden administration reportedly wants to give to illegal immigrants.\n\nI completely oppose this proposal.\n\nhttps://t.co/dpzB0tl3Iu","date":"Fri Oct 29 19:12:29 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Doubling down with a massive spending bill that drastically expands the role of government in Americans’ lives is not the answer. Rather, we need pro-growth policies that create more opportunity and empower people to succeed. https://t.co/WHKvQVzINE","date":"Thu Oct 28 15:12:11 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Inflation is draining Americans’ pockets. There is still an ongoing crisis at the border. Today’s disastrous GDP numbers show the economy is just another item on a laundry list of the Biden administration’s failures.","date":"Thu Oct 28 15:12:10 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The United States cannot be ambiguous in our support for Taiwan, and President Biden's diplomatic doublespeak is benefiting no one. We must clearly commit to supporting them in the face of growing aggression from China. https://t.co/JRll9zggjN","date":"Tue Oct 26 16:04:42 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Yesterday, the House passed a bill that I introduced to help tell their story by renaming the Burnet Avenue Post Office in Cincinnati after them. The building is located in the North Avondale neighborhood in which the two men went to school together.\nhttps://t.co/BG40pYVlWi","date":"Thu Oct 21 17:11:18 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The duo became fast friends and dedicated their later years to traveling the country to give talks to students about interracial understanding and unity. Their story became the topic of the book Black and White Airmen: Their True History and @Local12 Documentary \"Side by Side.\"","date":"Thu Oct 21 17:07:58 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"John Leahr and Herbert Heilbrun were heroes who both served as pilots in the Army Air Corps during WWII. Later in life, they met and learned that they unknowingly flew on some of the same missions in the war, were both from Cincinnati, and even attended school together.","date":"Thu Oct 21 17:07:57 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It was an honor to welcome Tri-State veterans who were making their Honor Flight to the WWII memorial. We owe them a debt of gratitude that cannot be repaid. Thank you to all our veterans for your service! https://t.co/xTBiBMFI9q","date":"Thu Oct 21 14:31:39 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Inflation is a tax hike on ALL Americans. In just one year, gas prices have rocketed up 42% while we are paying more for food, such as meat and eggs. It may not come out of your paycheck, but it does come out of your bank account. https://t.co/GDcMmh2iM2","date":"Wed Oct 20 21:03:30 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Americans are already forced to pay more for everyday goods due to the Biden administration’s economic failures, and their massive spending will only make things worse.","date":"Wed Oct 20 21:03:30 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I joined @WaysandMeansGOP colleagues in sending a letter to Treasury Secretary Janet Yellen demanding answers regarding the impacts these intrusive bank account surveillance provisions would have on American families, farmers, and small businesses. https://t.co/Bm2ryZen7Q","date":"Wed Oct 20 20:06:26 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Biden administration is proposing a bank account surveillance regime as part of its “Build Back Better” agenda, requiring banks to provide the IRS additional details on their customers’ data.","date":"Wed Oct 20 20:06:25 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/q9D6FG25Es","date":"Fri Oct 15 14:20:33 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"GE already has a strong presence in Cincinnati and the 2nd Congressional District, including among the most advanced engine manufacturing sites in the world which employs thousands locally, and this is a great way to train and keep our local talent right here in Southwest Ohio.","date":"Fri Oct 15 14:20:32 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I welcome General Electric’s new investment in Cincinnati with their “Next Engineers” program, which will help thousands of area high school students prepare for careers in engineering.","date":"Fri Oct 15 14:20:32 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy 246th Birthday @USNavy!!","date":"Wed Oct 13 17:44:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Read more ⬇️\nhttps://t.co/oOxWpe5sEU (3/3)","date":"Tue Oct 12 18:28:04 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Recently, I introduced the bipartisan Patriot Retention Act to help alleviate this problem and provide our Armed Forces with additional tools to meet our personnel needs and provide a pathway for qualified, specialists to continue their service with the Ready Reserve. (2/3)","date":"Tue Oct 12 18:28:03 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In order to remain the greatest fighting force in the world, our military needs to address critical staffing shortages within our Ready Reserve. (1/3)","date":"Tue Oct 12 18:28:03 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"To that end, I will continue working to ensure that the No Surprises Act is implemented in line with congressional intent.","date":"Fri Oct 01 16:13:22 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If unchanged, this rule will disincentivize insurance companies from keeping providers in their networks, limiting care for Americans and threatening the health and safety of our nation.","date":"Fri Oct 01 16:13:22 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In June, I led 96 of my colleagues from both sides of the aisle in calling upon the administration to reflect congressional intent as they implemented these critical patient protections. Unfortunately, this rule does not meet our intent.","date":"Fri Oct 01 16:13:21 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In crafting the legislation, Congress protected patients and created a balanced process to settle payment disputes between health care providers and insurers.","date":"Fri Oct 01 16:13:21 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The HHS Second Rule on surprise billing is a disaster for patient access. Congress was very clear that we did not intend to create a de facto benchmark for negotiations when creating the arbitration process in the historic, bipartisan No Surprises Act.","date":"Fri Oct 01 16:13:21 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Therapeutics must continue to be a critical component of our COVID-19 response. We’ve seen a lot of promise with treating individuals with monoclonal antibodies, and this news from Merck appears to be another positive development. \n\nhttps://t.co/OLfmn9CPgb","date":"Fri Oct 01 16:11:50 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Baseball is America's Pastime and unites us in so many ways.\n\nI'm proud to represent Ohio's Second CD in tonight's Congressional Baseball Game for Charity. #PlayBall⚾️🇺🇸 https://t.co/dJapFovPvT","date":"Wed Sep 29 18:00:07 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"However, the NPRC is now operating at roughly 10% of normal capacity, down even from 20-25% capacity at the height of the COVID-19 pandemic last year. This continued reduction in operating capacity is creating a serious backlog is hurting veterans.","date":"Tue Sep 28 16:31:08 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Recently, I joined over 60 of my colleagues on both sides of the aisle in demanding that the Biden administration address these staffing issues so our brave veterans have access to the records they need. https://t.co/yrK1UkmObq","date":"Tue Sep 28 16:31:08 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"To receive benefits earned through their service, veterans sometimes need to access records – such as your DD-214, discharge papers, and separation documents – through the National Personnel Records Center (NPRC).","date":"Tue Sep 28 16:31:07 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We must always remember why we are free. May God grant Gold Star mothers and families comfort.","date":"Mon Sep 27 00:15:55 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The right to life is one of the most basic human rights. Thank you @cathymcmorris for sharing your #prolife story.","date":"Fri Sep 24 17:44:32 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It will help more companies enter the carbon capture market by creating certainty and predictability as well as by expanding access to the tax credit. You can read more here: https://t.co/YPKEo9ytVf","date":"Tue Sep 21 21:52:17 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This week is #NationalCleanEnergyWeek! I believe America must remain the leader in developing, utilizing, and exporting clean energy technology. I've introduced a bill with @RepDavid to help businesses invest further in cutting-edge technology.","date":"Tue Sep 21 21:52:16 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our legislation will help take more pollution out of the air as well as boost the economy without jeopardizing jobs or driving up costs for hardworking American families and businesses.","date":"Tue Sep 21 21:52:16 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Customs and Border Protection announced an unprecedented 208,887 border apprehensions at the southern border in August. President Biden needs to take control of the untenable crisis he helped create at our Southern Border. https://t.co/g3q1oqGdiP","date":"Tue Sep 21 21:14:44 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Constitution is the backbone of America — the greatest country in the world. On this day in 1787, our Founding Fathers gave us the framework to build our nation. Happy Constitution Day!","date":"Fri Sep 17 14:47:31 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My remarks⬇️\n\nhttps://t.co/YarrJYHWIC","date":"Wed Sep 15 20:46:50 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’ve heard members on both sides of the aisle express concern over this issue. Unfortunately, every Democrat voted against it because they are on strict orders from Speaker Pelosi to reject all Republican amendments, even if they have bipartisan support or are commonsense.","date":"Wed Sep 15 20:46:50 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We cannot allow American tax dollars to fund our adversaries’ gain-of-function research, like in China,  which is why I introduced an amendment during today’s @WaysandMeansGOP markup to ensure it never happens again.","date":"Wed Sep 15 20:46:49 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Gain-of-function experiments are where scientists supercharge pathogens – like a virus – to make them more contagious and dangerous.","date":"Wed Sep 15 20:46:48 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"100% Correct","date":"Tue Sep 14 16:47:28 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We banded together to protect our country from those who sought to destroy it. It was a time of mourning but also of great unity, resilience, and determination. It’s that unity, resilience, and determination that we need now more than ever.","date":"Sat Sep 11 15:23:35 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our nation made a vow to never forget those who died or were gravely injured during the tragic events that unfolded on September 11, 2001. In the days that followed, we, as a nation, resolved to seek out the villains who perpetrated the attack and bring them to justice. https://t.co/lTQP8Tpw2u","date":"Sat Sep 11 15:23:35 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#HydeSavesLives https://t.co/y4ixsNlgrm","date":"Wed Sep 08 17:06:22 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"On September 24, the Ohio Department of Insurance will be hosting an in-person presentation on Medicare's Open Enrollment at the Anderson Township Senior Center. The Open Enrollment period is October 15 - December 7. https://t.co/rheRrLfI1h","date":"Tue Sep 07 19:29:03 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I have been hearing from various groups working around the clock to get American citizens and SIVs out of Afghanistan. @StateDept needs to work with them and with our congressional offices to help get them out safely.","date":"Thu Sep 02 18:05:23 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I never thought I would see the day.","date":"Tue Aug 31 00:16:50 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“Mr. President, we strongly urge you to commit to completing this evacuation, regardless of timeline. It’s the right thing to do.”\n\nRead our bipartisan letter ⬇️ https://t.co/BSzLnQDlRK","date":"Sat Aug 28 16:07:33 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I am glad there was at least some show of force and retaliation. However, targeting a single member of ISIS-K is hardly sufficient and will not ensure we can safely get Americans and our allies out of Afghanistan swiftly and safely.","date":"Sat Aug 28 15:39:27 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As we continue to receive updates from the \nadministration regarding the situation, I join the nation in praying for the families of those lost as well as the many individuals injured. https://t.co/w3Ho6ptMgq","date":"Thu Aug 26 21:14:37 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We must dictate the terms of our evacuation plans; we mustn't let the Taliban do so. https://t.co/opFDKcPk2u","date":"Tue Aug 24 17:55:37 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The overwhelming opinion of Republican and Democrat members of Congress, especially those who served during the Global War on Terror, is that we need to extend the August 31, deadline or we will be leaving Americans and allies behind.","date":"Tue Aug 24 17:55:36 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/rSk3bSrkcq","date":"Tue Aug 24 14:12:27 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is who we are! 🇺🇸","date":"Sun Aug 22 23:43:01 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you are a veteran or surviving family going through a difficult time, please know that we are here for you. Please don’t hesitate to seek help. \n \nTAPS National Military Survivor Hotline: (800) 959-TAPS (8277) \n \nVeteran Crisis Hotline: (800) 273-8255 &amp; press 1 or text 838255","date":"Fri Aug 20 15:29:19 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Yes, you made a difference for the better, you defended our country and you saved American lives.\"\nMy mentor and former colleague Mac Thornberry summed up well what we need to be telling our GWOT veterans and Gold Star families in this op-ed.\nhttps://t.co/V65crIG2Et","date":"Fri Aug 20 15:29:19 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The time will come for Congress to exercise its rightful oversight role and conduct the necessary after-action reviews. But right now, the Biden Administration needs an all-hands-on-deck approach to get our partners and our own citizens out of harm’s way.","date":"Tue Aug 17 20:39:55 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"American morality is being tested, and this is so far a black eye on the United States. If we do not honor our promises to the brave Afghans who stood by our side for 20 years, our warfighters will have a difficult time finding partners in future engagements.","date":"Tue Aug 17 20:39:55 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In our August 13 letter, we asked President Biden to “act immediately to facilitate the evacuation from Kabul of Afghans whose active support for our efforts…made them likely targets of Taliban retribution.” https://t.co/JK3mUm15pU","date":"Tue Aug 17 20:39:54 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congress introduced critical legislation that the State Department said was needed to accelerate the process. Rep. Crow and I led the HOPE for Afghan SIVs Act. Rep Crow and the Working Group also introduced the ALLIES Act. HOPE and critical provisions of ALLIES became law.","date":"Tue Aug 17 20:39:52 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In our June 4 letter, we expressed our concerns that there was not yet a whole of government plan to protect our Afghan partners, and we expressed our belief that “we must evacuate our Afghan friends and allies immediately.” https://t.co/OL0aK4TTyK","date":"Tue Aug 17 20:39:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In our April 21 letter, we recognized that President Biden’s “administration and Congress must move swiftly to prioritize and expedite” the SIV and U.S. Refugee Admissions programs. The Working Group was formed, and we stood ready to work w/ the administration. https://t.co/3APv72LLF8","date":"Tue Aug 17 20:39:48 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As a veteran of the Iraq war, I know firsthand how critical local allies are to our Armed Forces. I personally sponsored two Iraqi interpreters who are now U.S. citizens. The congressional Honoring Our Promises Working Group has been pressing this issue since April.","date":"Tue Aug 17 20:39:46 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Afghan SIV evacuation crisis is something bipartisan Members of Congress and organizations like @n1leftbehind have been warning about for months. It's not a left or right issue — it's an American issue. Our credibility and Afghan lives are on the line.","date":"Tue Aug 17 20:39:45 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/XjaKNmwzoo https://t.co/GVg7qPAGfG","date":"Mon Aug 16 19:23:31 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/BHzg1JmcRr","date":"Mon Aug 16 04:34:02 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is an abject travesty for the Afghan people and the global community. The Biden administration needs to take responsibility for the situation on the ground and let the world know how they’re going to ensure Americans’ safety and that of our allies.","date":"Sun Aug 15 19:45:55 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Recently, I joined my @GOPDoctors colleagues to demand the Department of Homeland Security tests migrants for COVID-19, and get more clarity about what they’re actually doing to prevent COVID-19 at the border. https://t.co/S1ei4Dh4i4","date":"Sun Aug 08 22:32:08 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As our Southern border continues to be overwhelmed, thousands of migrants enter our country untested, spreading COVID-19.","date":"Sun Aug 08 22:32:07 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I can't stress enough: please talk to YOUR doctor that you know and trust about vaccinations. Together, you can make the decision that is best for you. https://t.co/uUr72yOurr","date":"Thu Jul 29 18:00:59 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Inflation doesn't matter.\n\nThat's the message Democratic leaders are sending as they try to push more than $4 trillion into the economy to build infrastructure, fight climate change, and ease the financial cost of child and elder care for families.\" \n\nhttps://t.co/NSGhug41OP","date":"Mon Jul 26 17:43:41 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Inflation does matter. Long-term inflation makes it that much harder for working class families to get by. It also depreciates the value of Americans' hard-earned retirement savings and makes every-day necessities harder to afford. We can't spend our way out of this problem.","date":"Mon Jul 26 17:43:41 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This bill passed unanimously in the Senate. Why don't my colleagues on the other side of the aisle want transparency about the origins of COVID-19? https://t.co/XjH4UtK8Lp","date":"Thu Jul 22 13:59:13 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As we look to recover from COVID, we need more pro-growth policies, not tax hikes that hurt families and small businesses. https://t.co/45FopWTP6i","date":"Thu Jul 22 11:20:17 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Some Democrats continue to push the false narrative that the 2017 tax relief only went to the wealthy, which even the Washington Post gave “three Pinocchio’s.\" The reality is that most Americans were able to keep more of their hard-earned take home pay.","date":"Thu Jul 22 11:20:17 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is spot on, and we’ve been pressing Tedros since March. \n\nhttps://t.co/SOyMURv788\n\nThis question is, will China cooperate?","date":"Sat Jul 17 15:11:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"What changed? Why do Democrats want to force Americans to violate their conscience and pay for abortions? #HydeSavesLives https://t.co/mVZYP8WLKd","date":"Thu Jul 15 13:18:05 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you for hosting me! It’s always an honor to work with you and your devoted volunteers. So grateful for your work helping those in need. Good job, @OperationRamp!","date":"Wed Jul 14 21:19:15 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In order to remain the greatest fighting force in the world, our military needs to address shortages within our Ready Reserves. Recently, @RepJimmyPanetta and I introduced the Patriot Retention Act to provide the Armed Forces with an additional tool to fill critical shortages.","date":"Wed Jul 14 17:03:45 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It provides a pathway for qualified, retiring specialists to be placed into the Ready Reserve without financial disincentives. https://t.co/ZA4U6J4f95","date":"Wed Jul 14 17:03:45 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m grateful that we were able to get the HOPE for Afghan SIVs Act passed in the House and urge Leader Schumer to bring it up for immediate consideration in the Senate. While today’s announcement is positive, there is still work to be done on this critical issue. 4/4","date":"Wed Jul 14 16:59:06 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The bipartisan Honoring Our Promises Working Group played a big role in keeping the pressure on the administration to act. 3/4","date":"Wed Jul 14 16:59:05 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"First and foremost, this is welcome news. These brave men and women put their lives on the line to help our warfighters safely and effectively complete their missions. We have an obligation to ensure their safety. 1/4","date":"Wed Jul 14 16:59:05 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"While I disagree with the administration’s decision to publicly announce a specific withdrawal date – which informed our adversaries and endangers our allies – an evacuation plan should have been in place beforehand regardless. 2/4","date":"Wed Jul 14 16:59:05 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We must support our law enforcement who are working hard to protect Americans amidst the #BidenBorderCrisis. Proud to join @RepLisaMcClain and @SteveScalise in cosponsoring this resolution.","date":"Tue Jul 13 17:22:22 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The #Bidenflation is a tax on all Americans.","date":"Tue Jul 13 14:21:42 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Drugs smuggled across the border by the cartels make their way to Ohio and play a major part in fueling the opioid crisis we are fighting, and that’s why I asked Gov. DeWine to see how Ohio may be able to help assist in securing the border.","date":"Sat Jul 10 16:43:10 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you to @GovMikeDeWine and the State of Ohio for answering the call and sending resources to help secure our southern border and protect Ohioans. https://t.co/zEycBWLUgJ","date":"Sat Jul 10 16:43:10 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As evidence continues to emerge pointing to the Wuhan Institute of Virology, the United States must lead, and engage with other nations, and thoroughly investigate the origins of this pandemic.","date":"Wed Jul 07 19:47:34 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Chinese Communist Party continues to block any real investigation into the origins of the COVID-19 outbreak. https://t.co/18r2PAdAUq","date":"Wed Jul 07 19:46:33 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Don’t miss it.\n\nAmidst the hot dogs and baked beans, fireworks and friends, I urge you: don’t miss the opportunity to reflect on the real reason we are celebrating:\n\nhttps://t.co/zYNoptuLoc","date":"Sun Jul 04 15:10:32 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As we look back on the pandemic, we know that obesity is one of the leading risk factors for COVID-19 patients. I’ve introduced the bipartisan Treat and Reduce Obesity Act to ensure patients can have access to needed weight management therapies. https://t.co/OxYSBKAM6m","date":"Wed Jun 30 13:23:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"✅PASSED: H.R. 3385, the HOPE for Afghan SIVs Act.\n\nWe need to keep our promises to the Afghan translators and guides who bravely aided our troops.\n\nRead more: https://t.co/OLf1tVxGVa","date":"Tue Jun 29 20:18:35 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Americans are already experiencing inflation – a tax on ALL Americans – due to Democrats out of on control spending. Now, they're talking about spending another $6 trillion that we don't have and our children and grandchildren will have to pay back.","date":"Mon Jun 28 18:23:10 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Rep. Brad Wenstrup (R-OH), a co-chair of the caucus expressed concern that the United States may have been a victim of both 'genetic engineering and political engineering.'\"\nhttps://t.co/FrHijAXEEO","date":"Thu Jun 24 21:50:09 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Regardless of where the pandemic began, we must not allow American taxpayer dollars to be funneled directly – or indirectly – to fund these projects in adversarial nations.","date":"Wed Jun 23 20:50:36 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"There is mounting evidence that the pandemic may have originated from a lab leak at the Wuhan Institute of Virology. We know the lab had been conducting sensitive and dangerous gain-of-function research that involves enhancing the transmissibility of a pathogen.","date":"Wed Jun 23 20:50:36 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"By letting the General System of Preferences (GSP) trade program expire, Congress has already cost Ohio businesses over $12 mil – a steep price to pay coming out of a global pandemic.\n\nI support @WaysandMeansGOP legislation to renew it and urge Congress to pass it without delay.","date":"Wed Jun 23 20:15:12 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Four years ago last week, a gunman tried to assassinate members of this team because we are Republicans. By the grace of God and the bravery of some Capitol Police and Alexandria Police officers, we’re still here today, stronger than ever. https://t.co/aWKHAlReD4","date":"Mon Jun 21 13:08:40 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Juneteenth represents a crucial moment in our nation’s history and has been rightfully celebrated by our fellow Americans of African descent for over 150 years. The liberation from slavery should be a celebration for Americans of all generations and all backgrounds.","date":"Fri Jun 18 16:42:28 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Maybe the FBI didn’t know when Mr. McCabe was in charge, but they seem to know now.","date":"Tue Jun 15 22:19:04 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy 246th Birthday @USArmy! In 1998, I picked up the phone and dialed 1-800-USA-ARMY. This phone call turned out to be a life changing moment, and I am honored to serve my country.","date":"Mon Jun 14 20:09:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy Flag Day! https://t.co/M5v5I5LMzM https://t.co/lVUGa8LB1t","date":"Mon Jun 14 18:02:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I'm eternally grateful for the bravery of Special Agents Crystal Griner &amp; David Bailey on that baseball field 4 yrs ago.\n\nWe're very blessed to have @SteveScalise still with us on this Earth — healthy &amp; as a leader in our Conference.\n\nGod sent angels to be with us that day.","date":"Mon Jun 14 17:42:36 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Unfortunately, bad actors will try to exploit any difficult situation, and the pandemic was no different. \n\nI'm proud to cosponsor this critical legislation to protect our UI system from fraud and go after those who try to steal from the American people.","date":"Sun Jun 13 15:44:39 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Have you noticed that things are more expensive lately?\n\nWith President Biden's massive spending through endless borrowing, the U.S. dollar does not go nearly as far as it used to. Inflation is part of Biden tax hikes on all Americans.","date":"Thu Jun 10 15:04:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It's been 75 days since President Biden named VP Harris \"border czar.\" She refuses to visit the border to see the consequences of this administration's words and actions. If she was serious about fixing the border, she would at least visit it. https://t.co/e5s2OrisWW","date":"Tue Jun 08 19:53:03 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"India, a strategic ally, needs our help in its ongoing fight against COVID-19. Our abundant vaccine supply gives us opportunities to help our partners around the globe, where help is needed the most.","date":"Tue Jun 08 19:24:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Operation Warp Speed delivered safe and effective vaccines in record time. We must always protect American innovation and IP while, at the same time, assisting our friends in need around the world.","date":"Tue Jun 08 19:23:59 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our allies need our immediate help. I am proud to join my colleagues in demanding that President Biden evacuate Afghan interpreters who worked closely with our servicemembers for the past 20 years. https://t.co/PzcsFGv1Oi","date":"Mon Jun 07 14:41:55 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My reflections on this Memorial Day. https://t.co/NG6RRu3CSl","date":"Mon May 31 13:23:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"American soldiers paid for the freedoms &amp; comforts we enjoy on Memorial Day with their lives.\n\nMadam Vice President, I encourage you to reflect on the meaning of this holiday. It's not just a \"long weekend.\"\n\nYou can start here: https://t.co/NG6RRulegV","date":"Sun May 30 00:31:23 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"For the last 40 years, both sides agreed that American taxpayers should not pay for abortions. Unfortunately, my colleagues on the left no longer respect the right of conscience. I will always support the Hyde Amendment to protect the unborn. #HydeSavesLives","date":"Fri May 28 18:09:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Chinese Communist Party has obstructed any attempts to investigate the Wuhan Institute of Virology. I joined this letter demanding that Speaker Pelosi allow investigations into the lab.","date":"Fri May 28 16:17:18 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In March, along with some members of the @GOPDoctors, I wrote about the importance of a proper investigation. This still holds true today. https://t.co/F6xABPDD0h","date":"Tue May 25 19:15:13 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We need to get to the bottom of the origins of COVID-19 and hold the Chinese Communist Party accountable for whatever role they played.","date":"Tue May 25 19:15:13 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Intelligence on Sick Staff at Wuhan Lab Fuels Debate on Covid-19 Origin https://t.co/wwOUoJqGUP","date":"Tue May 25 19:15:13 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Israel is our strongest ally in the Middle East. America must continue assisting Israel in its defense against Hamas, an Iranian-backed terrorist organization. https://t.co/hHxAmTkx0h","date":"Thu May 20 16:25:37 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Republicans are ready to work on infrastructure that addresses our country's needs, such as updates to the Brent Spence Bridge. My @WaysandMeansGOP colleagues and I are working hard to negotiate this deal in a common sense manner. https://t.co/cHURhCRyE6","date":"Thu May 20 16:01:46 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@GOPLeader &amp; @GOPDoctors are standing up to Speaker Pelosi's unscientific mask mandate, which sends the wrong message to the American people.\n\nInstead, we should show that we CAN trust the vaccines' efficacy.\n\nhttps://t.co/9qovqGW6UC","date":"Wed May 19 16:01:16 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I had a chance to sit down virtually with @MedEconomics senior editor Jeffrey Bendix to talk vaccines, health care, and the @GOPDoctors caucus. Check out the interview ⬇","date":"Wed May 19 15:59:57 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We owe a great deal of gratitude to our brave servicemen and women defending our country. Please join me in honoring our military members on this Armed Forces Day. https://t.co/ujrYMSxyUU","date":"Sat May 15 14:08:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"About time. \n\nI've been saying this since the vaccines became widely available: we need to trust the safety provided by the vaccines and start returning to normal.\n\nhttps://t.co/GLdoqJo77B","date":"Thu May 13 20:29:59 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is the right move. Let's help get Ohioans back to work and our economy back on track to its pre-pandemic levels.","date":"Thu May 13 19:47:52 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to join @RepArrington's letter to Speaker Pelosi to stand up for Ohio farmers and small businesses.","date":"Thu May 13 18:57:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy 513 Day! https://t.co/dpKTR8UPpx","date":"Thu May 13 18:50:45 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great news! It just became easier to get to and from vaccination appointments. Read more here: https://t.co/EKrzMb09B2","date":"Wed May 12 18:25:57 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you to all the front line medical workers! https://t.co/mvFEqIKBCU","date":"Wed May 12 13:11:06 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our law enforcement officers risk their lives to protect our communities. Please join me in thanking them for their service during National Police Week. https://t.co/6ipSdprrpf","date":"Wed May 12 12:47:53 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My letter with @SteveScalise &amp; 15 others urging the FBI to conduct an internal investigation into how it reached the conclusion of “suicide by cop\" — rather than a assassination attempt by a domestic terrorist — and who was behind that process and determination.  ⬇ https://t.co/SXVCVTtPXt","date":"Tue May 11 22:35:04 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I stand with Israel, one of America's strongest allies. Hamas -- the Iranian-backed terrorist group -- must cease its violence on innocent people.","date":"Tue May 11 15:40:03 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy Mother's Day to my mom, Joan, my wife, Monica, and all mothers out there! https://t.co/txpuWoR2GX","date":"Sun May 09 14:14:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In 1940, Winston Churchill famously said in the House of Commons \"in God's good time, the new world, with all its power and might, steps forth to the rescue and the liberation of the old.\" 76 years ago today, Germany officially surrendered to the Allies. Happy V-E Day! https://t.co/ftvvZ3a7hl","date":"Sat May 08 14:09:00 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"When someone joins the military, their family also makes sacrifices. As a reservist, I understand the sacrifices that members' spouses and their loved ones must make, and I am happy to recognize them today on Military Spouse Appreciation Day. https://t.co/hOm2FNirjc","date":"Fri May 07 13:15:18 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Please join me in praying for our nation today with a special intention for our frontline workers, servicemembers, and veterans. https://t.co/oHgGtQnMXk","date":"Thu May 06 18:56:43 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Navy veteran Ted Ruble has served the American Legion Roy W. Wilson Post 694 in Mowrystown for 50 years. Please join me in thanking Ted for his service to our country both in the Navy and at the American Legion.\nhttps://t.co/nCbcqE8LpX","date":"Wed May 05 16:48:28 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy 113th Birthday @USArmyReserve! \n\nIn 1998, after seeing our nation keep getting attacked, I picked up the phone and dialed 1-800-USA-ARMY. It was one of the best decisions I've ever made, and I am honored to still serve with brave men and women of the Army Reserve. https://t.co/H1NoAMDVD6","date":"Fri Apr 23 13:18:12 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Americans are ready to get back to normal, and Congress must lead the way. As more and more Americans become vaccinated, it's important we start scaling back restrictions, including in Congress. \n\nhttps://t.co/sEBzyO0QJT","date":"Thu Apr 22 23:37:36 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you for your years of service to Ohio and to our country. It's been a pleasure to work alongside you — a friend and fellow veteran, and I wish you, Karen, and your family the best as your start this new chapter.","date":"Mon Apr 19 14:27:10 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to support this life-saving effort to protect children who survive abortions.","date":"Thu Apr 15 15:21:59 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/VQUxMeL3j3","date":"Wed Apr 14 19:07:08 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Where is President Biden? Where is VP Harris?\n\nThere is a crisis going on at our southern border and they're nowhere to be found.\n\nPresident Biden, VP Harris, and Dr. Fauci need to visit the border and see firsthand the result of their misguided policies. https://t.co/iqVDml0No5","date":"Mon Apr 12 22:40:03 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The #BidenBorderCrisis is a humanitarian issue, a national security issue, and a national health security issue.\n\nThe administration needs to get down there and get ahold of the situation immediately. https://t.co/aVwQhROPV2","date":"Mon Apr 12 21:20:59 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If President Biden &amp; VP Harris really want an infrastructure project, then we should be focused on finishing the border wall that their administration halted constructing. https://t.co/iJ63CIMpcL","date":"Mon Apr 12 20:35:06 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The current Biden \"infrastructure\" proposal is just another tool for Democrats to force through a bunch of unrelated liberal wish list items.\n\nWe need to let the economy reopen so it can recover —not impose job crushing tax rate hikes. https://t.co/WsrOdqwuyy","date":"Mon Apr 12 19:55:49 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Sadly, the #BidenBorderCrisis was predictable. \n\nWhile women and children are being used as their pawns, the cartels are getting rich.\n\nPresident Biden &amp; VP Harris must get control of this humanitarian crisis caused in part by their misguided policies. https://t.co/Y03RtjCDPU","date":"Sat Apr 10 16:01:29 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m on the ground in Texas, witnessing the #BidenBorderCrisis firsthand.\n\nWe have a long way to go to address this humanitarian crisis, and a good start would be for the President and Vice President to come here and see for themselves the results of their misguided policies. https://t.co/GmxvOta09X","date":"Fri Apr 09 17:56:56 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"He is risen! Let us rejoice and be glad. Happy Easter! https://t.co/Ni4R877gqo","date":"Sun Apr 04 13:30:39 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We know there is a strong possibility that this virus escaped from a lab in Wuhan. Independent investigators need to be able to fully explore that hypothesis without CCP interference. https://t.co/wYDvGT3foJ","date":"Wed Mar 31 12:54:06 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Earlier this month, I wrote an op-ed with @RogerMarshallMD, @SenJohnBarrasso, @RepAndyHarrisMD, &amp; @RepJohnJoyce about why the WHO needs to demonstrate independence from the CCP:\nhttps://t.co/F6xABPDD0h","date":"Wed Mar 31 12:53:53 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We should be very concerned with the WHO's report into the origins of COVID-19. https://t.co/huimFFtQ1b","date":"Wed Mar 31 12:53:52 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Hey America have you all noticed that you can't say “China virus” but it's OK to say “UK variant?” 🤔","date":"Tue Mar 30 13:39:21 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy Doctors Day! May God guide you and bless you. https://t.co/V0g6F2Cjwc","date":"Tue Mar 30 13:02:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Many of those who came home did not receive the hero's welcome they deserve. Today, we give special honor to our Vietnam War Veterans. You are not forgotten.\n\nIf you or any veterans you know need help navigating the VA, please don’t hesitate to call my office at (513) 474-7777. https://t.co/R8qk7tLUkA","date":"Mon Mar 29 13:12:34 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today, more than a billion Christians around the world will celebrate Palm Sunday. I wish all who celebrate a very reflective and meaningful Holy Week. God bless. https://t.co/LRGbe8wUem","date":"Sun Mar 28 16:12:43 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"On this Medal of Honor Day, we thank over 3,500 Medal of Honor recipients for their brave service to our country. We can never fully repay you! https://t.co/nZA9Y6Ck0a","date":"Thu Mar 25 18:50:33 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congrats to the Shawnee State University Men’s Basketball team on winning the 2021 NAIA National Championship!","date":"Thu Mar 25 17:30:35 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Here’s a helpful resource from @DOL to help victims of unemployment insurance fraud: https://t.co/AE0skIL1OO","date":"Wed Mar 24 13:06:24 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This teachers’ union is failing our nation’s students.\n\nWe must get our children back to school for their overall physical, emotional, mental, and social well-being.","date":"Wed Mar 24 00:09:01 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is welcome news, but we've known for months that it's safe to reopen schools. \n\nIn fact, it's more dangerous to children's overall health and well-being to keep them closed.\n\nhttps://t.co/sxYMoGWMd7","date":"Fri Mar 19 16:43:22 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Also proud to note that we added 1000 new Medicare funded residency slots in the bipartisan COVID Relief bill passed last December to combat physician shortages.\n\nThis was a big priority for the bipartisan Rural and Underserved Health Care Taskforce and a big win for patients!","date":"Fri Mar 19 13:25:31 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#FlashbackFriday to 1986 when I was completing my residency at Thorek Memorial Hospital in Chicago. https://t.co/0DsK4IhH0t","date":"Fri Mar 19 13:25:30 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations to the thousands of medical students who will begin a new chapter in their journey today.\n\nBest of luck and thank you! https://t.co/g20OnASqrw","date":"Fri Mar 19 13:25:29 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Biden administration created the current crisis at our southern border &amp; refuses to even acknowledge that it is a crisis.\n\nAs @RepJohnKatko said: we have “disorder at the border through executive order.” https://t.co/LolM3TZahS","date":"Mon Mar 15 19:40:05 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We’ll find out this week which members put party over the safety and security of the American people.","date":"Mon Mar 15 19:35:13 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Rep. Swalwell has been compromised &amp; should not sit on the intelligence committee.\n\n@GOPLeader is right to put this to a vote. Americans need to know how seriously their representatives take our country’s intelligence matters &amp; national security. https://t.co/lrIgmUIIVN","date":"Mon Mar 15 19:35:12 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Be sure to give @GOPDoctors a follow for the latest on what Congress’s largest group of health care providers is up to! #FF","date":"Fri Mar 12 23:52:17 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Let’s be honest with the American people: this is not a COVID relief bill. This is a Democrat Payoff spending bill and only 9% goes toward defeating the virus.\n\nMy latest ⬇️\n\nhttps://t.co/ZmYvkpZ0QP","date":"Wed Mar 10 20:40:19 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Let’s be honest with the American people: this is not a COVID relief bill. \n\nThis is a Democrat Payoff spending bill and only 9% goes toward defeating the virus. https://t.co/e7iuCrz5HO","date":"Wed Mar 10 20:10:24 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations, @tcs_na, on 5 years of helping millions of students strengthen their computational thinking skills!\n\nHere's a throwback to last year when I encouraged students in Milford and nationally to participate in the #goITMonthlyChallenge ⬇️","date":"Wed Mar 03 19:39:31 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"March 1, 1803 marks the day Ohio became the 17th state in the union. Happy birthday to our great state — here's to many, many more!\n\nhttps://t.co/WePPm4Os8C","date":"Mon Mar 01 19:22:45 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is absolutely devastating. My heart goes out to the families of Officer Lagore and the young girl who died in this tragedy. Please keep them and the Highland County community in your prayers.\n\nhttps://t.co/87LgvJ8VZK","date":"Wed Feb 24 23:48:20 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congress provided $54 billion in December to help schools reopen. \n\nRT if you agree that we should pass @RepAshleyHinson's bill to ensure schools that receive those taxpayer dollars actually reopen to in-person learning. https://t.co/qeGO8HYMwF","date":"Wed Feb 24 21:46:36 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I led a bipartisan effort last year with @RepRaulRuizMD to invest in research about the long-term health impacts of COVID-19, and I welcome the @NIH’s announcement that they’re taking up the effort. \n\nhttps://t.co/X08VEe4EAj","date":"Wed Feb 24 21:28:09 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Yet we wonder how much public support there’d be if Americans understood that most of the [budget] blowout is a list of longtime Democratic spending priorities flying under the false flag of Covid-19 relief.\"\n\nMUST READ in @WSJ: https://t.co/CnKUrP2QMo","date":"Tue Feb 23 17:07:33 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Don’t be fooled: The so-called “COVID Relief” bill contains $1,000,000,000,000 for Speaker Pelosi &amp; Leader Schumer’s spending wish list. https://t.co/MiQZiuhWND","date":"Tue Feb 23 16:30:53 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great work, @CBP!\n\nDrug trafficking gets less attention during the pandemic, yet remains a huge issue.","date":"Mon Feb 22 20:01:45 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I have great respect for LTG Honoré's military service. Unfortunately, he has already said some disturbing things as a matter of fact about @CapitolPolice even before he was appointed to head the investigation.","date":"Fri Feb 19 19:56:28 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“'It’s like the Capitol Police was doing security by Zoom,' he said in a televised interview days before his appointment as leader of a review of Capitol security.\"","date":"Fri Feb 19 19:56:28 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"He added that 'I’ve just never seen so much incompetence – so they’re either that stupid, or ignorant or complicit. I think they were complicit.'”\n\nhttps://t.co/XIDvtXgTmF","date":"Fri Feb 19 19:56:28 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"After reading the following statement from him, does anyone think he can conduct an unbiased investigation into the Capitol's security?","date":"Fri Feb 19 19:56:28 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Are you a parent with a child who has been affected by ongoing school closures? \n\nWe want to hear your story!\n\n#ShareYourStory ⬇️\nhttps://t.co/aHGSbpsyuX","date":"Thu Feb 18 19:55:14 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Last week, as Republicans were offering constructive amendments to the Democrats’ partisan COVID spending bill, I noticed that many of my colleagues on the other side of the aisle were more interested in criticizing the former admin than working with us to improve the bill. https://t.co/rkexZkJ8R5","date":"Tue Feb 16 21:04:17 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Stop moving the goalposts.\n\nFollow the science.\n\nOpen the schools. https://t.co/cVXcjxUKiT","date":"Tue Feb 16 21:00:57 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Jan 2021: Biden rejoins the WHO\nFeb 2021: Biden admin raises concerns that Chinese gov altered the findings of a WHO report on COVID-19 origins\n\nI wonder why America had left the WHO in the first place 🤔 https://t.co/rfKHIrErDh","date":"Tue Feb 16 20:47:59 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺Coming up near the top of the hour. Tune in to @FoxFriendsFirst!","date":"Mon Feb 15 10:46:18 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Straight from the guidance: \"K–12 schools should be the last settings to close after all other mitigation measures in the community have been employed, and the first to reopen when they can do so safely.\"","date":"Fri Feb 12 20:36:18 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The science is clear: reopen the schools. The CDC’s guidance today reiterates many of the precautions and strategies used by schools that have already reopened safely. \n\nhttps://t.co/evM4DodjfZ","date":"Fri Feb 12 20:36:17 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"YES! Whatever happened to \"trust the science\"?\n\nWe need to be listening to those who wear the white coats, not just those who write the \"white papers.\"","date":"Wed Feb 10 22:14:35 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We should be working together on policy to reopen schools and get vaccines to everyone who wants one — not rushing through partisan bills that are filled with unrelated spending.","date":"Wed Feb 10 19:44:40 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The science is clear: reopen the schools for the overall health and well-being of our children.\n\nRead our letter from members of the @GOPDoctors to @POTUS ⬇️ https://t.co/cqDZwuzUa7","date":"Wed Feb 10 14:30:58 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Democratic leaders have spent months promising to “listen to the scientists;” however, when it comes to reopening schools and getting children back to in-person learning, their actions do not match their words.\n\n@RepAndyHarrisMD @michaelcburgess @RepMMM \n\nhttps://t.co/srbVtzfGOe","date":"Tue Feb 09 22:57:46 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"For more information: https://t.co/3x7EMgwtUm","date":"Mon Feb 08 21:14:46 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You can find helpful guidance on protecting your identity here: https://t.co/nDx7K6mf0k","date":"Mon Feb 08 21:14:46 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you receive a 1099-G form from @OhioJFS for unemployment benefits that you did not file for, you can report it here: https://t.co/idCihJwIN9","date":"Mon Feb 08 21:14:45 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This weekend, I led a group of 38 of my colleagues in asking the administration to ensure those who may be victims of unemployment insurance fraud can file their taxes on time while waiting for their fraud claim to be adjudicated. \n\nhttps://t.co/aDMJFCNt7P","date":"Mon Feb 08 21:14:45 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You can find more information about how to receive a vaccine here: https://t.co/vMkhzZ5LmV","date":"Mon Feb 08 20:07:35 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thanks to the hard work of thousands of doctors, scientists, and researchers coordinated through #OperationWarpSpeed, we have two safe and effective vaccines and more on the way.","date":"Mon Feb 08 20:07:34 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Last Spring, we were told that it would take a miracle to develop a vaccine in under a year.\n\nhttps://t.co/6Bv1ijlz5D","date":"Mon Feb 08 20:07:34 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Rep. Wright was a true public servant. I am deeply saddened to learn of his passing. His wife, Susan, children and grandchildren, and the rest of the Wright family are in my prayers.","date":"Mon Feb 08 17:07:15 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I'm incredibly grateful to the men &amp; women who have been called up to provide enhanced protection to our Capitol, &amp; their continued presence should serve as a reminder that this legislation is needed now more than ever, &amp; Congress can and should address this issue without delay.","date":"Thu Feb 04 19:33:21 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our bipartisan legislation will alleviate some of the financial challenges that families face by incentivizing more employers to pay differential wages to those activated.","date":"Thu Feb 04 19:33:21 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I am excited for the opportunity to serve on the @WaysandMeansGOP Health subcommittee and to continue serving on the Worker and Family Support and Oversight subcommittees.\n\nMy full statement: https://t.co/rja5M4IIPI","date":"Wed Feb 03 22:55:58 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Officer Brian Sicknick served our country with honor and is one of many Capitol Police heroes. I was humbled and honored to pay my respects today as he laid in honor in the Capitol Rotunda. May he rest in peace. https://t.co/x8rzudKQ8h","date":"Wed Feb 03 17:46:20 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our entire system of government is structured around the idea that every human being has intrinsic dignity and worth, “endowed by their Creator with certain inalienable rights” – including the right to life.\n\nMy latest in the @highlandcopress: https://t.co/ENfoSgxnyC","date":"Fri Jan 29 14:23:29 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Always great to see the community coming together to support someone in need. Keep praying for Officer Behr to make a speedy and full recovery.\nhttps://t.co/KT2SD2a5ti","date":"Thu Jan 28 20:18:48 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺COMING UP on @FoxNews’s America Reports with @SandraSmithFox. Tune in!","date":"Thu Jan 28 19:13:02 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The IRS Taxpayer Advocate Service is hosting 3 webinars on Friday, January, 29:\n\nYou can register here using these links:\n11 a.m.: https://t.co/kEAzY6U6oa\n1 p.m.: https://t.co/CwpR4bv6d6\n3 p.m.: https://t.co/w2hO95cu11 https://t.co/7wNbx0j2Is","date":"Thu Jan 28 18:01:55 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Jim Caldwell served our Ross County community with distinction as a county commissioner for 40 years. He was a class act, and his dedication and work ethic were impressive. There’s no doubt in my mind that he has made Ross County a better place for generations to come.","date":"Wed Jan 27 20:07:37 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/INW5LljP9A","date":"Wed Jan 27 20:07:37 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today marks the anniversary of the liberation of the Auschwitz-Birkenau concentration camp near the end of World War II. \n\nOn this #HolocaustRemembranceDay, #WeRemember the six million Jews and millions of other victims of the Nazi regime. #NeverAgain https://t.co/8BXCuh9IEn","date":"Wed Jan 27 15:17:28 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to join @RepJimBanks, @SteveScalise, and 199 of my colleagues in this live-saving effort. #SaveHyde","date":"Tue Jan 26 15:20:47 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"⬇️","date":"Mon Jan 25 16:35:32 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Absolutely heartbreaking. Mitch — and all those that loved him — saw a young man turn an illness into a cause for the betterment of others. He was a treasured part of our community. Please join me in praying for his loved ones. https://t.co/aEA5wWKmZt","date":"Fri Jan 22 17:46:33 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Congressman Wenstrup has voted consistently to protect the lives of the unborn as well as the consciences of taxpayers who don’t want their hard-earned tax dollars paying for abortion domestically or internationally.\"\n\nThanks, @SBAList!\n\nhttps://t.co/BYDZUkgI5E https://t.co/RXnxhiZT0s","date":"Thu Jan 21 20:26:13 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I was proud to sponsor bipartisan legislation similar to the underlying language in that bill. https://t.co/dbrfOqr8IN","date":"Thu Jan 21 18:44:52 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m also glad to see the new administration will launch a public education campaign, which was authorized and funded by Congress in the end-of-the-year COVID relief bill.","date":"Thu Jan 21 18:44:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Working with governors across the nation to set up logistics plans, the Trump administration was able to deliver more than 35,000,000 doses to date.","date":"Thu Jan 21 18:44:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"While there have been and are still many challenges to vaccinating Americans quickly, we have reason to be hopeful about the progress we’ve made.","date":"Thu Jan 21 18:44:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"COVID-19 VACCINE THREAD:\n\nIt’s truly incredible that the world’s greatest doctors, scientists, and researchers have brought us multiple COVID-19 vaccines and begun distribution in less than a year through Operation Warp Speed.","date":"Thu Jan 21 18:44:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Trump administration set a goal to have one hundred million Americans vaccinated by the spring, and I’m pleased to see the Biden administration take up that mantel and continue striving toward that laudable goal.","date":"Thu Jan 21 18:44:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Ohio National Guard has represented our great state honorably during their mobilization to our Nation's Capital this week. I'm proud of their service and was glad to be able to deliver them some warm food on behalf of Ohio's Second District. https://t.co/AFPaKF6gdG","date":"Thu Jan 21 17:38:04 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I ask you to join me in praying that God grant strength and wisdom to President Biden, Vice President Harris, their families, and the entire United States of America. God bless. 🇺🇸 3/3","date":"Wed Jan 20 17:14:38 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m honored to represent Ohio’s 2nd District in Congress and will work with the new Administration – as I have with the previous two – to seek common ground and advance the causes of freedom and opportunity for all American citizens. 🇺🇸 2/3","date":"Wed Jan 20 17:14:38 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I have tremendous respect for the office of the President of the United States of America. 🇺🇸 1/3 https://t.co/sBsCo4RTEH","date":"Wed Jan 20 17:14:38 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character.”\n\n#MLKDay https://t.co/zHD5ESpDG6","date":"Mon Jan 18 14:38:42 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"NEW: Doctors and high-risk patients can use this helpful tool to locate monoclonal antibody therapeutic treatments: \nhttps://t.co/3BAOlJfgNx","date":"Thu Jan 14 18:33:07 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/7mI4VGYcKS","date":"Thu Jan 14 18:33:07 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Dr. Moncef Slaoui has led the greatest scientific feat in American history. The vaccines and treatments produced under Operation Warp Speed will save countless lives and allow us to defeat the pandemic. Our nation owes him our sincerest gratitude. 🇺🇸","date":"Thu Jan 14 18:05:48 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📻TUNE IN: I'll be joining @Willie700WLW in the coming minutes!\n\nhttps://t.co/62Aoz9gOor","date":"Thu Jan 14 18:04:04 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ATTN: Ohio Businesses ⬇️","date":"Thu Jan 14 17:29:41 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"READ my full statement on why I voted against impeachment here: https://t.co/Xc62ujkHi2 https://t.co/WtNb7bIOkw","date":"Wed Jan 13 21:29:04 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This morning, I asked the President to speak out against the reported planned violence. I'm glad to see he has heeded the call.\nhttps://t.co/WfRzormdzm https://t.co/Hm0dmuxrNA","date":"Wed Jan 13 19:16:14 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I will vote against the House resolution urging Vice President Pence to invoke the 25th Amendment. \n\nHere is my full statement why: https://t.co/flDgQ4Tv41 https://t.co/R3nJOGeZ8y","date":"Wed Jan 13 03:03:27 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My staff and I are proud to support ⁦@CapitolPolice⁩! \n\nWe are deeply grateful for their service and sacrifices that keep us safe. https://t.co/F0Zp7BBNom","date":"Tue Jan 12 17:39:41 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@lyndskelly Hi Lyndsay. You can contact my Peebles office at (513) 605 - 1380 for tax related issues.","date":"Mon Jan 11 19:49:36 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"SMALL BUSINESSES in need, please see the below information regrading the Paycheck Protection Program:","date":"Fri Jan 08 20:15:30 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Those responsible for his death must be brought to justice.\n\nIf you have any information regarding the violent activity at the Capitol Building, please share it here ⬇️\n\nhttps://t.co/HMvnhmGCM5","date":"Fri Jan 08 13:26:58 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Absolutely heartbreaking.\n\nPlease join me in praying for U.S. Capitol Police Officer Brian Sicknick's family, colleagues, and our Capitol Hill community.\n\nThis loss is so extremely personal to all of us.","date":"Fri Jan 08 13:26:57 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📻LISTEN: Here's my reaction to yesterday's events at the Capitol Building with @700wlw's @scottsloan ⬇️\nhttps://t.co/TDZ6MwpaVk","date":"Thu Jan 07 19:10:33 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My statement on the Electoral College Vote: https://t.co/lSUcfiMqAK","date":"Thu Jan 07 08:51:36 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"There is no excuse for what happened today. No one in a leadership position, including the President, should make any excuse for this violent and destructive behavior.","date":"Thu Jan 07 01:06:04 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This violence must stop. The criminals who have broken into the U.S. Capitol, injured law enforcement, and disrupted the constitutional process are not patriots. No matter what flag one is carrying, people violating the law need to be held accountable. 1/2","date":"Wed Jan 06 20:07:15 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I condemn these actions and stand behind Capitol Police and our law enforcement in restoring order. Again, the violence must stop. 2/2","date":"Wed Jan 06 20:07:15 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Any violence or threat of violence is completely unacceptable.\n\nAmericans can exercise their First Amendment rights, but must do so peacefully.","date":"Wed Jan 06 19:24:17 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Real-world experience is critical; we need to listen to patients and those who wear the white coats, not just those who write the white papers. \n\nLooking forward to leading the @gopdoccaucus along with @RepAndyHarrisMD in the 117th Congress! https://t.co/83Y1iJCcdJ","date":"Tue Jan 05 19:28:34 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If Americans can safely return to work, then their representatives in Congress can too.\n\nIf a presumably COVID-19 positive member can vote in-person for the Speaker, then we have no excuses.\n\nProud to sign this letter with my colleagues demanding an end to \"proxy voting.\"","date":"Mon Jan 04 16:16:51 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today might not have gone how we wanted it to go, but I’m proud of what these young men have accomplished this year. #GoBearcats","date":"Fri Jan 01 20:51:36 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy New Year! https://t.co/fy8K9pChpw","date":"Fri Jan 01 05:01:23 +0000 2021","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Absolutely devastating news. Monica and I are keeping the Letlow family in our prayers and ask you to do the same. \nhttps://t.co/uqBvmItYCI","date":"Wed Dec 30 17:51:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺COMING UP: I’ll be joining @DavidAsmanfox on @FoxNews around 10:15am!","date":"Sat Dec 26 15:02:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"From my family to yours, Merry Christmas!\n\nMy reflections for today: https://t.co/n2Qx4lgv2v https://t.co/cZP01En37K","date":"Fri Dec 25 14:33:29 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"More great news from #OperationWarpSpeed ⬇️","date":"Wed Dec 23 16:44:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Praying for a quick recovery for Ohio Division of Wildlife Officer Kevin Behr.\n\nhttps://t.co/VShXBWiJrm","date":"Tue Dec 22 22:41:24 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The historic Tax Cuts &amp; Jobs Act saved the typical Ohio family of four more than $2,000!\n\nSafe &amp; effective vaccines are critical to restoring our way of life. However, we'll need to continue enacting pro-growth policies to rebuild our economy.","date":"Tue Dec 22 17:08:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My full statement regarding last night's vote: https://t.co/IgutiCvYIH","date":"Tue Dec 22 17:00:16 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you've recovered from COVID-19, please consider donating your plasma.","date":"Mon Dec 21 14:44:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Beginning Monday, 5.9 million doses of the Moderna vaccine will go out in addition to 2 million more doses of the Pfizer-BioNTech vaccine, bringing a total of 7.9 million more doses to the nation, Perna said.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/qwgz1JqmeO","date":"Mon Dec 21 14:03:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations, @GoBearcatsFB! #AmericanAthleticConferenceChamps #PutThemInThePlayoffs","date":"Sun Dec 20 04:53:46 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My friend Lt. Herbert Heilbrun lived a remarkable life. He flew B-17 bombers in WWII in the Air Force. Perhaps even more impressive was the work he did later in life with his good friend and Tuskegee Airman Lt. John Leahr. https://t.co/Otk2Gv0a9r","date":"Sat Dec 19 15:50:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Lt. Heilbrun passed away yesterday at the age of 100. He was a true American hero.\n\nYou can learn more about his story: https://t.co/6QLJesG5Gh","date":"Sat Dec 19 15:50:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨🚨The @US_FDA has issued an emergency use authorization for a second COVID vaccine!\n\nThanks to #OperationWarpSpeed  even more Americans will be able to receive a vaccine soon!","date":"Sat Dec 19 00:48:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"At the recommendation of Congress's Attending Physician, I received @pfizer's safe &amp; effective COVID-19 vaccine today. I trust the science, and I trust the scientists who devoted the last year of their lives to developing it. \n\nMy full statement ➡️ https://t.co/mYDdmYfnnL https://t.co/f1tI1aJ4Gq","date":"Fri Dec 18 23:15:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Science should unite us, not divide us. I'm proud to work across the aisle on this bipartisan initiative to promote vaccine participation.\n\nhttps://t.co/Al2L4M95tZ","date":"Fri Dec 18 22:27:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Awesome!","date":"Fri Dec 18 17:59:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great to see leaders receive the COVID-19 vaccine!\n\nI look forward to receiving one as soon as it is available to me.","date":"Fri Dec 18 13:14:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The vaccine is a game changer, but it will take time to get it to everyone. The American people need relief now.\n\nIf there are sticking points in negotiations over a relief package, let's pass what we do agree on and keep debating the more contentious issues. https://t.co/onUcIkjtEp","date":"Thu Dec 17 22:54:36 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨The Vaccines and Related Biological Products Advisory Committee just voted to recommend the @moderna_tx vaccine for an emergency use authorization.\n\nWe're on the doorstep of having a 2nd safe &amp; effective vaccine!","date":"Thu Dec 17 22:11:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@RepJohnJoyce is spot on!","date":"Thu Dec 17 20:22:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📻Calling in to @Willie700WLW — I’ll be live in 5 minutes! https://t.co/N3EpzSqac8","date":"Thu Dec 17 18:02:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺COMING UP: I’ll be talking COVID relief on @FoxBusiness at noon. Tune in! https://t.co/A4peNR1YEn","date":"Thu Dec 17 16:56:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺TUNE IN: I’ll be joining @AmericaNewsroom at the top of the hour. https://t.co/DjDua5h7Y7","date":"Thu Dec 17 14:56:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great info on the rigorous testing process from @SteveFDA ⬇️","date":"Thu Dec 17 00:40:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great leadership by @VP, @SecondLady &amp; @Surgeon_General!\n\nI look forward to receiving a COVID-19 vaccine as soon as it's available to me.","date":"Wed Dec 16 23:49:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@DrPhilRoe, you will be missed!\n\nThank your service, good luck in retirement, and God bless! https://t.co/uLQkMXC7E9","date":"Wed Dec 16 23:15:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Classified information can be discussed in a classified setting...\nhttps://t.co/G7MAuk2Emg","date":"Wed Dec 16 23:09:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to see the Senate unanimously pass bipartisan legislation that @RepJoshHarder and I worked on together to help Gold Star Families.\n\nNext stop: the @WhiteHouse for 🖊️!","date":"Wed Dec 16 20:32:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#OperationWarpSpeed will go down as one of the greatest feats in American history! 🇺🇸","date":"Wed Dec 16 19:38:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This was a big deal for the American people. Before COVID-19 hit, our tax cuts &amp; regulatory reform helped us build the strongest economy in decades.\n\nAs we end the pandemic, these types of pro-growth policies will be key to rebuilding the greatest economy in the world!","date":"Wed Dec 16 14:27:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺TUNE IN: I'll be joining @MariaBartiromo on @FoxBusiness in the 7 o'clock hour!","date":"Wed Dec 16 11:55:49 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Even more help could be on the way by the end of the week! \n\nThe @US_FDA will meet on Thursday to consider @moderna_tx's COVID-19 vaccine, and another EUA could follow soon after.","date":"Tue Dec 15 14:57:28 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"A tragic situation for both men and their families. Please continue praying for the families and for the community in Adams County.\n\nhttps://t.co/lvbSUEmIsM","date":"Tue Dec 15 02:47:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"As Americans get vaccinated, we need to continue taking steps like washing our hands, social distancing, and wearing face masks to protect ourselves, our loved ones, and our communities.\n\nHope is here and the end of this pandemic is in sight.\"\n-@SecAzar \n\nhttps://t.co/WA3tSoBlLa","date":"Mon Dec 14 19:13:02 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🙏Today marks the beginning of the end of the COVID-19 pandemic.\n\nCongratulations and thank you to all of the doctors, scientists, &amp; researchers as well as President @realDonaldTrump, @VP, and the #OperationWarpSpeed team!","date":"Mon Dec 14 15:21:47 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"UC Medical Center, selected in November as one of 10 pre-positioned sites in Ohio, will receive 975 doses of the Pfizer-BioNTech today. On Friday, officials received the supply kits needed to administer the vaccine.\"\n\nhttps://t.co/PkVEnjU5zk","date":"Mon Dec 14 14:36:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great to see this expansion project completed! The Ronald McDonald House makes a big difference for families in our community.\n\nhttps://t.co/YH58a9qZ7n","date":"Mon Dec 14 01:21:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#OperationWarpSpeed has begun shipping the @Pfizer COVID-19 vaccine to zip codes all over the county! States have distribution plans in place, and we will start administering doses as soon as possible! https://t.co/1aWn9MsEkC","date":"Mon Dec 14 01:11:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"From the beginning, we set out to craft a bill to end Surprise Billing that would protect patients first. I think we got there with this bill: taking patients out of the middle of billing disputes, safeguarding patient access, and increasing transparency.","date":"Mon Dec 14 00:16:10 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m grateful to @RepRichardNeal and @RepKevinBrady for ensuring those priorities were met, and I look forward to hearing feedback from those who will be impacted.","date":"Mon Dec 14 00:16:10 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We need to restore our way of life, not irreparably destroy it.\n\nThanks to Operation Warp Speed, that is exactly what we are doing.","date":"Sun Dec 13 22:53:10 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Army wins!","date":"Sat Dec 12 23:29:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I will take a COVID-19 vaccine as soon as one is available to me.","date":"Sat Dec 12 03:31:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"More from the @US_FDA: \n\nhttps://t.co/810aa3ok5F","date":"Sat Dec 12 03:28:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"A key Food &amp; Drug Administration advisory panel on Thursday recommended the approval of Pfizer &amp; BioNTech’s coronavirus vaccine for emergency use in people over 16 years old, the last step before the FDA gives the final OK to broadly distribute the 1st doses throughout the US.\"","date":"Thu Dec 10 22:46:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨🚨@CNBC: FDA panel recommends approval of Pfizer’s Covid vaccine for emergency use🚨🚨\n\nhttps://t.co/DPAAyJrt11","date":"Thu Dec 10 22:41:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"➡️What did Speaker Pelosi know &amp; when?\n\n➡️What did Chairman Schiff know &amp; when?\n \n➡️What did Rep. Swalwell know &amp; when?\n\n➡️What did the FBI know &amp; when? \n\n#𝐖𝐞𝐍𝐞𝐞𝐝𝐀𝐧𝐬𝐰𝐞𝐫𝐬","date":"Thu Dec 10 22:20:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Honored to serve on @RepublicanStudy's Executive Committee alongside Chairman @RepMikeJohnson, Chairman-elect @RepJimBanks, @SteveScalise, &amp; @RepJeffDuncan. https://t.co/YkxQbdfTI1","date":"Thu Dec 10 21:50:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Over the past year, we've cut red tape without cutting any corners. We've prioritized collaboration and reduced bureaucratic delays.\n\n#OperationWarpSpeed \n\nhttps://t.co/iZQEKtVAOB","date":"Thu Dec 10 19:17:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"President @realDonaldTrump continues helping bring us closer to peace &amp; stability in the Middle East!","date":"Thu Dec 10 18:54:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Please continue praying for the workers and for the rescue team in Adams County.\n\nhttps://t.co/LG3FQ86gol","date":"Thu Dec 10 18:26:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Why is Speaker Pelosi trying to sweep this under the rug?\n\nRep. Swalwell needs to stop dodging questions and explain to the Intelligence Committee exactly what happened regarding the alleged Chinese spy.","date":"Thu Dec 10 17:03:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to stand for #SmallBiz with @GOPLeader, @SteveScalise, @RepLizCheney, @RepSteveChabot, &amp; my @HouseGOP colleagues.\n\nSpeaker Pelosi needs to end the gridlock and allow us to pass targeted relief for workers &amp; small businesses NOW!","date":"Thu Dec 10 17:01:18 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As we approach the first night of the Festival of Lights, I want to wish our Jewish friends a #HappyHanukkah ! Chag Sameach! https://t.co/qwtL0lNxGx","date":"Thu Dec 10 16:41:11 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺 Coming up on @FoxNews at the top of the hour to discuss China spying on US politicians. https://t.co/CImbNuuQx4","date":"Thu Dec 10 15:58:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨The @US_FDA will meet today to decide whether to approve the Pfizer COVID-19 vaccine today.\n\nWe are on the doorstep of having a safe &amp; effective vaccine!\n\nhttps://t.co/u6FjCrJqQO","date":"Thu Dec 10 14:39:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Speaker Pelosi — who has already admitted to blocking a deal due to the election — needs to stop playing politics and allow us to pass targeted, bipartisan COVID relief for American workers &amp; small business owners.","date":"Wed Dec 09 16:16:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I'm monitoring the ongoing situation in Adams County.\n\nPlease join me in praying for the safety of all those involved.","date":"Wed Dec 09 15:11:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As a physician, soldier, &amp; congressman, I have always made the health &amp; safety of my fellow Americans a top priority. \n\nI'm grateful for the incredible work done by President @realDonaldTrump &amp; #OperationWarpSpeed team &amp; am honored to attend today's @WhiteHouse Vaccine Summit. https://t.co/9tk8uyaOYE","date":"Tue Dec 08 20:46:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In less than a year, we now have multiple prospective vaccines that have demonstrated 90-95 percent efficacy in late-stage trials with plans for immediate distribution coming into place.\n\n#OperationWarpSpeed \n\nhttps://t.co/iZQEKtVAOB","date":"Tue Dec 08 19:18:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Grateful to join @realDonaldTrump, @VP, and the Coronavirus Task Force Team at today's #OperationWarpSpeed Vaccine Summit!","date":"Tue Dec 08 19:08:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"NOTICE: The @US_FDA will meet to consider granting an Emergency Use Authorization for the Pfizer vaccine on Thursday.\n\nIn the interest of transparency, you can find information about as well as a link to watch that meeting here:\n\nhttps://t.co/i2givdEgJi","date":"Tue Dec 08 16:29:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨🚨🚨Very positive news ahead of the FDA’s Thursday meeting to decide if they will grant an EUA for the @pfizer vaccine!\n\nhttps://t.co/4gl7qED0Gt","date":"Tue Dec 08 13:54:48 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We need to restore our way of life, not irreparably destroy it. Thanks to #OperationWarpSpeed, that is exactly what we are doing.\n\nMy latest: https://t.co/iZQEKtVAOB","date":"Tue Dec 08 12:35:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Rest In Peace.","date":"Tue Dec 08 05:10:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Safe and effective vaccines will allow us to restore our way of life.\n\nLike @RepWalorski, I will take a vaccine as soon as it's available!","date":"Mon Dec 07 23:50:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Will will never forget those who perished while defending our nation. Please join me in honoring their memory today. #PearlHarborRemembranceDay https://t.co/PRosXxxUeG","date":"Mon Dec 07 14:26:49 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@RepBrianBabin is absolutely right! \n\nAnti-Trump politicians need to stop misleading the public about the safety and efficacy of #OperationWarpSpeed vaccines, which have gone through the same rigorous testing as any other vaccine. \n\nI, too, will receive one as soon as possible.","date":"Mon Dec 07 01:34:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The Food and Drug Administration will consider Emergency Use Authorization (EUA) for Pfizer’s coronavirus vaccine candidate on Thursday and Moderna’s vaccine candidate on Dec. 17.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/d6T1Fg7vxp","date":"Sun Dec 06 23:14:25 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Safe and effective vaccines are critical to allowing our nation's elders to restore their way of life. That is why the first doses will be distributed to those most at risk, such as healthcare workers and our senior population.\n\nhttps://t.co/BLdfjuhIA5","date":"Sun Dec 06 23:06:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"⬇️","date":"Fri Dec 04 22:52:02 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Everyone whose business is struggling or who is unemployed due to the pandemic can thank Speaker Pelosi for playing politics with their livelihoods. \n\nShe just admitted it.","date":"Fri Dec 04 18:01:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great to see a Cincinnati native honoring a fallen hero!\n\nhttps://t.co/53RO8flTj4","date":"Thu Dec 03 17:50:39 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations to the @MNDCougars on winning the Division I state volleyball championship! \n\nhttps://t.co/y8GLvjzNbY","date":"Thu Dec 03 02:37:24 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I was saddened to hear of the passing of Scioto County Commissioner Mike Crabtree this morning. Commissioner Crabtree was a dedicated public servant and advocate for Scioto County. His commitment and love for his community and our nation were indisputable. He was a true patriot.","date":"Wed Dec 02 16:48:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I will miss working with this fine man and public servant. Monica and I are keeping his wife, Dianna, and his friends and family in our thoughts and prayers.","date":"Wed Dec 02 16:48:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great news for our friends across the Atlantic. I'm optimistic that we'll have similarly positive news about a safe &amp; effective vaccine here in the United States soon.\n\nhttps://t.co/QqXZwGRyuI","date":"Wed Dec 02 16:18:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thanks for having me on the show!","date":"Wed Dec 02 15:16:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"➡️If you have recovered from COVID-19 &amp; may be interested in donating plasma:\nhttps://t.co/mBm0g7Y5od","date":"Wed Dec 02 00:08:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"➡️If you're a doctor or other healthcare provider &amp; want more information to guide your patients who have COVID-19:\nhttps://t.co/QHhMvvYSBP","date":"Wed Dec 02 00:08:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"➡️If you've never had COVID-19 &amp; may be interested in joining a vaccine or other prevention trial: https://t.co/yYExp4C6Ob","date":"Wed Dec 02 00:08:12 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"THREAD:\n\nDo YOU want to help defeat COVID-19 on this #GivingTuesday?\n\n@HHSGov has ways for everyone to pitch in! https://t.co/0Y0JVKf8OS","date":"Wed Dec 02 00:08:12 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"➡️If you currently have COVID-19 &amp; want to participate in a treatment clinical trial: \nhttps://t.co/UYHwv22JT6","date":"Wed Dec 02 00:08:12 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Please keep Scioto County Commissioner Mike Crabtree and all those impacted by the pandemic in your thoughts and prayers this week. Commissioner Crabtree was recently diagnosed with COVID-19 and is currently being treated at a Columbus hospital. https://t.co/diGWhDePuI","date":"Mon Nov 30 18:45:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🔊It was a pleasure to join the @RonaldReagan podcast to discuss #OperationWarpSpeed's race to a COVID-19 vaccine &amp; violence in today's political climate.\n\nYou can listen here: https://t.co/kl5S03J3eH","date":"Mon Nov 30 18:20:05 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨 A second prospective COVID-19 vaccine is on the doorstep of approval for distribution!\n\nThe @moderna_tx vaccine has shown to be safe and over 94% effective.\n\n#OperationWarpSpeed","date":"Mon Nov 30 12:55:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations, @millermeeks!  The @HouseGOP looks forward to having another doctor &amp; servicemember in our Conference.","date":"Sun Nov 29 17:44:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It's important to support small businesses now more than ever!\n\nBe sure to:\n✅Shop small\n✅Tell a friend\n✅Write a review https://t.co/9T8bIltgBe","date":"Sat Nov 28 16:03:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We’re potentially one big step closer to defeating COVID.\n\nhttps://t.co/mLZLFrV2ZD","date":"Sat Nov 28 15:01:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy Thanksgiving!\n\nWe have much to fight for and, thus, so much to be grateful for. As deeply challenging as this year has been, it is no exception.\n\nMy latest in the @Enquirer:\n\nhttps://t.co/Yvj4uRLxig","date":"Thu Nov 26 16:03:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Good insight into how an #OperationWarpSpeed vaccine will be distributed:\n\nhttps://t.co/MYXmKdyCzr https://t.co/U78jKCYt9g","date":"Wed Nov 25 16:29:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We can get help to American workers and small businesses if these 23 representatives are willing to make good on their word and break Speaker Pelosi's partisan gridlock ⬇️","date":"Tue Nov 24 18:28:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is great news for Ohio students. School choice is an important tool that empowers parents to make education choices that are best for their children. 📗📏📐🍎","date":"Tue Nov 24 18:15:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Completely agree!","date":"Tue Nov 24 01:05:03 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Via @thehill: Vaccine czar predicts life could be back to normal in May\n\nGood diagnosis by #OperationWarpSpeed chief adviser:\n\nhttps://t.co/XQFZMZsprB","date":"Mon Nov 23 19:25:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Every servicemember understands that their sacrifice for our country is also their family’s. During Military Family Appreciation Month, we give a special thanks to the spouses, children, &amp; ext. family of our nation’s heroes for their challenges &amp; sacrifices for this great nation. https://t.co/SYmumYvfIg","date":"Fri Nov 20 18:10:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨BIG NEWS🚨\n\n\"Pfizer said Friday it is asking U.S. regulators to allow emergency use of its COVID-19 vaccine, starting the clock on a process that could bring limited first shots as early as next month and eventually an end to the pandemic [...]\"\n\nhttps://t.co/IgLr14vrwH","date":"Fri Nov 20 18:05:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We continue to learn more about how to treat COVID patients and save lives.\n\nHere is another positive development from #OperationWarpSpeed regarding therapeutics:\n\nhttps://t.co/KSCrU0Iwh6","date":"Thu Nov 19 23:59:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"GREAT video explaining the process behind #OperationWarpSpeed vaccine clinic trials from @SteveFDA ⬇️","date":"Thu Nov 19 21:40:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Ohioans in rural communities continue to band together and show great resiliency in the face of challenges. I serve on the Rural &amp; Underserved Health Task Force and will continue working to find solutions that expand access to quality care for small town Ohioans. #RuralHealthDay https://t.co/GxCcRLhR5D","date":"Thu Nov 19 19:39:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Providing for the health and safety of the American people is my biggest priority. \n\nI'm honored to serve as a conferee on the FY2021 #NDAA Conference Committee.\n\nRead my full statement:\nhttps://t.co/kRA28PrmUx","date":"Thu Nov 19 00:16:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations @StXFB on winning the 2020 Division I Ohio state championship! https://t.co/ipU50FRA4e","date":"Wed Nov 18 23:52:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Here is a good explanation of what an Emergency Use Authorization (EUA) is and why it is utilized:\n\nhttps://t.co/t3BgesIM3l","date":"Wed Nov 18 18:49:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"More on EUAs from the @US_FDA: \n\nhttps://t.co/61CxPI0bSg","date":"Wed Nov 18 18:49:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We're getting close to a COVID-19 vaccine!\n\n\"The companies said that they plan to submit to the Food and Drug Administration for an emergency use authorization “within days,” and will also submit to regulatory agencies around the globe.\"\n\nhttps://t.co/lQwZDT5fdc","date":"Wed Nov 18 18:49:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"⬇️","date":"Wed Nov 18 17:54:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Americans will receive the vaccine for free, under a $1.95 billion deal the federal government reached with Pfizer for 100 million doses.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/i4ZmoNMsFX","date":"Wed Nov 18 16:29:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The agency cleared the single-use test, which provides results within 30 minutes, for use by anyone aged 14 and over if their health-care provider suspects they may have Covid-19.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/epi3rRIdJl","date":"Wed Nov 18 14:49:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#CreditWhereCreditIsDue: We should all give @realdonaldtrump credit for #OperationWarpSpeed. By harnessing the power of public-private partnerships, we're on the doorstep of possibly having two safe &amp; effective vaccines. https://t.co/ZZO9GNJa4W","date":"Tue Nov 17 22:27:26 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@RepJohnJoyce is right! We owe our doctors, researchers, and the Trump administration a lot of credit for the incredible results we're seeing through #OperationWarpSpeed.","date":"Mon Nov 16 19:45:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ICYMI: \"Roughly 20 million people could be vaccinated against the coronavirus in December, the head of the Trump administration's vaccine and drug accelerator said Friday.\"\n\n#OperationWarpSpeed\n\nhttps://t.co/InWWRB0I6t","date":"Mon Nov 16 17:21:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As a co-chair of the Rural &amp; Underserved Communities Health Taskforce, I want to ensure that these communities are not overlooked when a vaccine is ready to distribute.\n\nThis is great news for folks in rural areas:","date":"Mon Nov 16 16:39:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨More encouraging news from #OperationWarpSpeed: \n\n“Mod­erna Inc. said its ex­per­i­men­tal coro­n­avirus vac­cine was 94.5% ef­fec­tive at pro­tect­ing peo­ple from Covid-19 in an early look at piv­otal study re­sults [...]”\n\nhttps://t.co/34bDJYGoda","date":"Mon Nov 16 12:40:32 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"None of this would have been possible without the leadership of the Trump administration.","date":"Fri Nov 13 21:47:16 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#OperationWarpSpeed has produced rapid tests and life-saving therapeutics. We're now likely on the doorstep of having the first vaccine candidate approved by the FDA.\n\nWe owe our doctors and scientists a great deal of gratitude.","date":"Fri Nov 13 21:47:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"November is #NationalAdoptionMonth. Adoption is an issue that is deeply personal to me. As a society, we must continue to spread the word on the importance of finding children happy, healthy, and safe homes. https://t.co/iwLLB4zz43","date":"Fri Nov 13 17:47:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If Americans across the country are willing to show up to work, then their representatives should be too.","date":"Thu Nov 12 16:22:51 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great #VeteransDay profile by @WLWT on how Owensville honors our heroes:\n\nhttps://t.co/vK8wwz1lOH","date":"Wed Nov 11 21:16:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"On this Veterans Day, we take the times to thank those brave servicemen and women who have given and sacrificed so much to protect our freedom. I personally would like to thank our veterans serving around the world for keeping our nation safe. https://t.co/S2by1vB2oC","date":"Wed Nov 11 14:00:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“Americans don’t like hypocrisy. If some gatherings are acceptable, then similar gatherings should also be deemed acceptable.”\n\nMy latest for @FoxNews\n\nhttps://t.co/bPQBv8fELG","date":"Tue Nov 10 17:43:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@gopdoccaucus statement: https://t.co/SBUqsmzea9","date":"Tue Nov 10 17:26:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy 245th Birthday to the @USMC! I want to thank all our brave marines for their courage, sacrifice, and dedication to our country.","date":"Tue Nov 10 15:22:16 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Eli Lilly &amp; Co.’s antibody therapy was granted an emergency-use authorization by U.S. drug regulators for treating Covid-19, widening access to a treatment that early data suggest is effective [...]\"\n\n#OperationWarpSpeed \n\nhttps://t.co/Ke0fYlia6J","date":"Tue Nov 10 15:07:47 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ICYMI: Here are the governor's irresponsible, anti-science comments: https://t.co/yUzrXSVEOh","date":"Tue Nov 10 00:34:44 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Americans can be assured that the @US_FDA will only approve a safe and effective vaccine. \n\nI spoked with @WLWT about today's @pfizer vaccine news and Gov. Andrew Cuomo's dangerous remarks about the distribution process: https://t.co/A0P40EacxW","date":"Tue Nov 10 00:34:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Because of  #OperationWarpSpeed, we will have 100 million doses ready for distribution upon @US_FDA approval!\n\nhttps://t.co/rta1xx9Kh2","date":"Mon Nov 09 16:18:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/rta1xx9Kh2","date":"Mon Nov 09 14:33:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨HUGE NEWS🚨\n\nThanks to private-public partnership through #OperationWarpSpeed, we will have 100 million doses of the @pfizer vaccine ready for distribution if the @US_FDA grants approval!","date":"Mon Nov 09 14:23:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"October was another great month for the economy! Our nation continues to rebound after the early setbacks from the pandemic.","date":"Fri Nov 06 15:02:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"There will be no shortcuts in developing the relevant phase 3 efficacy results. Any vaccine showing efficacy must also be very safe.\"\n\n#OperationWarpSpeed\n\nhttps://t.co/KF3lG25hK9","date":"Fri Oct 30 13:57:19 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨Never bet against the American people!\n\nOur resilient nation continues to beat expectations as we recover from the pandemic.","date":"Thu Oct 29 13:09:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The chief operating officer of #OperationWarpSpeed, the federal government’s project to develop a COVID-19 vaccine, said Tuesday he thinks about his own family in giving his assurances that any such vaccine will be safe. \"\n\nhttps://t.co/f1LyMnBupp","date":"Wed Oct 28 19:30:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@CBSNews: U.S. official leading COVID-19 vaccine distribution says \"no shortcuts\" are being taken on safety\n\n#OperationWarpSpeed \n\nhttps://t.co/gA3AWZQNMq","date":"Wed Oct 28 19:23:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"IMPORTANT piece from the director of the Center for Biologics Evaluation and Research at the @US_FDA:","date":"Wed Oct 28 18:57:28 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Trust means everything. Trust in vaccines facilitated the incredible positive impact that vaccination had on public health in reducing illness and death over the past century. \"\n\n#OperationWarpSpeed \n\nhttps://t.co/KF3lG25hK9","date":"Wed Oct 28 18:56:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This bipartisan legislation will help Americans save for a sound and secure retirement, and I’m pleased to see that it includes two provisions of mine that will:\n\n✅Help military spouses build savings\n✅Modernize the rules for certain insurance-dedicated investment products","date":"Wed Oct 28 16:04:49 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to lead this effort with my colleagues @MikeKellyPA &amp; @RepLaHood to help parents who are working to overcome challenges during the COVID-19 outbreak.","date":"Tue Oct 27 19:57:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great video from @SteveFDA on how the medical community develops vaccines⬇️","date":"Tue Oct 27 19:51:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“The Trump administration this week will announce a plan to cover the out-of-pocket costs of Covid-19 vaccines for millions of Americans who receive Medicare or Medicaid, said four people with knowledge of the pending announcement.”\n\n#OperationWarpSpeed \n\nhttps://t.co/mOT6McWttq","date":"Tue Oct 27 13:08:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations, #JusticeAmyConeyBarrett! https://t.co/H44POl9jKm","date":"Tue Oct 27 00:07:30 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Praying for all our men and women in uniform who are overseas on this #NationalDayoftheDeployed. \n\nHere's a throwback to 2006 when I served in Iraq as part of the US Army’s 344th Combat Support Hospital, Task Force 344. https://t.co/lqcpDurqOs","date":"Mon Oct 26 20:46:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"I've had absolutely no pressure, really, no pressure,\" Slaoui said, adding that he would have quit if that were the case. \"And I have [always] said, if I get undue pressure, I will say it and I will resign.\"\n\n#OperationWarpSpeed\n\nhttps://t.co/oeF07IJLVs","date":"Mon Oct 26 16:07:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Please check your medicine cabinets and do your part to help keep our families and communities safe!","date":"Sat Oct 24 16:53:12 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“…it is now highly credible that OWS will have produced up to 100 million doses of safe and effective COVID-19 vaccine doses, made in America, by the end of 2020...\"\n\nGreat op-ed by @SecAzar on #OperationWarpSpeed\n \nhttps://t.co/H2ltZUTZVp","date":"Fri Oct 23 20:20:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Another major step toward establishing peace in the Middle East thanks to President Trump! This agreement between Israel and Sudan puts us one step closer toward stabilization in the region.  https://t.co/fwZbsrboDm","date":"Fri Oct 23 17:29:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"BIG PICTURE: #OperationWarpSpeed is working! \n\nWe've developed effective therapeutics to treat many COVID-19 patients, and continue making progress on new treatment options.\n\nHowever, it's important that we continue physical distancing and wearing masks when necessary.","date":"Wed Oct 21 15:39:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“The progress has been pretty amazing,” said Deborah Fuller, a microbiologist at the University of Washington who is working on second generation vaccines for the novel coronavirus.\n\n#OperationWarpSpeed\n\nhttps://t.co/AXFWw38R5B","date":"Wed Oct 21 15:24:03 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Republicans have supported and will continue to support protections for people with pre-existing conditions. Period.","date":"Tue Oct 20 17:40:53 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The @gopdoccaucus condemns Governor Andrew Cuomo's anti-COVID vaccine statements in his interview with @ABC: https://t.co/inG3KNZhWn","date":"Tue Oct 20 00:24:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨Important #OperationWarpSpeed Vaccine Development Notification:","date":"Fri Oct 16 21:17:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today is #WorldFoodDay, and I want to thank all those at work across our country to help the millions of Americans who face food scarcity. Your work and dedication helps put food on people’s tables. #TBT to my visit to Freestore Foodbank earlier this Fall. https://t.co/paEqCJfx8w","date":"Fri Oct 16 21:14:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great news for many senior citizens:","date":"Fri Oct 16 21:12:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Trump Admin Partners with CVS, Walgreens to Provide COVID-19 Vaccine in Long-Term Care Facilities\n\n#OperationWarpSpeed\n\nhttps://t.co/ZHTcjPmnve","date":"Fri Oct 16 20:19:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Here is a very helpful update from the @CDCgov on #OperationWarpSpeed:\nhttps://t.co/VIojZKJveI","date":"Fri Oct 16 16:35:36 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"THIS ⬇️","date":"Fri Oct 16 16:18:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"APPALLING!\n\n@Twitter has decided that it's OK to publish:\n-Illegally leaked tax records\n-Threats to Israel\n-Chinese propaganda\n\nBut NOT OK to publish:\n-A major news outlet's story\n-@JudiciaryGOP's tweet about a matter that is under congressional investigation","date":"Thu Oct 15 17:01:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"MUST READ: \"Moncef Slaoui explains how a public-private partnership is overcoming technical and bureaucratic obstacles to find a way of inoculating against Covid.\"\n\n#OperationWarpSpeed\n\nhttps://t.co/g0jm2d6gAt","date":"Wed Oct 14 16:30:05 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@RepChuck is absolutely right! #OperationWarpSpeed is doing amazing things!","date":"Wed Oct 14 16:24:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy 245th Birthday to the @USNavy! I want to thank all the brave men and women who serve or have served in the Navy for their courage, bravery, and sacrifice! https://t.co/y8TLr8Ptk7","date":"Tue Oct 13 19:10:46 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thanks, @RiponSociety, for hosting me for this important conversation about #OperationWarpSpeed and how the @gopdoccaucus is working to help find a safe and effective vaccine.\n\nhttps://t.co/3Bx1NCopF6","date":"Tue Oct 13 18:21:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"George Washington considered farming to his most noblest calling. Thank you to all of the farmers and agriculture workers for keeping our shelves stocked and food on the table! https://t.co/nf56qqLqPN","date":"Mon Oct 12 23:46:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"✅SIGNED INTO LAW! https://t.co/tB3aoC3cRf","date":"Sun Oct 11 15:52:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"❌MYTH: The COVID-19 vaccine may be distributed without FDA approval\n\n✅FACT: The vaccine will only be distributed after undergoing every stage of research and trials that every other vaccine has gone through https://t.co/lQODQDfoIP","date":"Fri Oct 09 16:30:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"❌MYTH: The federal government will force you to take the COVID-19 vaccine\n\n✅FACT: The government does not have federally mandatory vaccinations, and this one will be no different https://t.co/QS6YRA9v44","date":"Thu Oct 08 16:39:03 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"❌MYTH: Our #OperationWarpSpeed vaccine process is being rushed by politics, threatening safety and effectiveness.\n\n✅FACT: Any vaccine approved by the FDA will have met the same safety and effectiveness protocols as any other drug. https://t.co/sVFztrEuu1","date":"Wed Oct 07 15:30:11 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The company said last month the drug reduced the rate of hospitalization compared with a placebo in a study.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/lkTucpUyFT","date":"Wed Oct 07 13:13:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great thread from my friend, @Surgeon_General ⬇️","date":"Tue Oct 06 18:02:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy birthday to my good friend, @SteveScalise—  Hope you have a great day. #TBT to the 2018 #CongressionalBaseballGame! https://t.co/VVVT8E7KgA","date":"Tue Oct 06 16:54:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨PASSED unanimously by the Senate! Next up: ✍️","date":"Thu Oct 01 02:02:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨PASSED unanimously by the Senate! Next up: ✍️","date":"Thu Oct 01 02:02:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Biotech company Moderna announced on Tuesday that its coronavirus vaccine candidate elicited immune responses in older adults from a Phase 1 study in levels comparable to those seen in younger adults.\" \n\n#OperationWarpSpeed\n\nhttps://t.co/dGuUL1Ak2Z","date":"Wed Sep 30 20:29:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Speaker Pelosi won’t allow us to vote to extend PPP relief, so I just signed onto @HerreraBeutler’s discharge petition that would force a vote on critical funding for our nation’s small businesses and employees. https://t.co/Lr6qVZKzrp","date":"Tue Sep 29 23:10:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today, on National VFW Day, we pause to celebrate the brave men and women who dedicated their lives in service of this nation overseas. Thank you for your service and your patriotism! https://t.co/gtwM0MHrhU","date":"Tue Sep 29 20:04:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Glad to see @RodneyDavis leading by example! Convalescent plasma donations are still very important. If you've recovered from #COVID19, you can help save lives.\n\nMore info: https://t.co/VPq4YGYd4g","date":"Tue Sep 29 15:57:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As Yom Kippur begins, I want to wish those observing a reflective, peaceful, and meaningful holiday. https://t.co/Quyy1JZ6bc","date":"Sun Sep 27 22:02:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Small businesses need more support! \n\nI will sign the discharge petition to force Speaker Pelosi to vote on more PPP funds so we deliver relief to American workers and businesses.","date":"Fri Sep 25 14:36:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud that @uchealth is playing such an important role in #OperationWarpSpeed vaccine clinical trials!\n\nhttps://t.co/l4GvV1Rx24","date":"Fri Sep 25 14:33:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Joined my @HouseGOP colleagues on a virtual tour of @NIH for an update on #OperationWarpSpeed this morning.\n \nThe 𝗸𝗲𝘆 𝘁𝗼 𝗿𝗲𝘀𝘁𝗼𝗿𝗶𝗻𝗴 𝗼𝘂𝗿 𝘄𝗮𝘆 𝗼𝗳 𝗹𝗶𝗳𝗲 is producing safe and effective vaccines and treatments for COVID-19. #CommitmentToAmerica https://t.co/0ucxMd4TeC","date":"Fri Sep 25 14:11:28 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The Gaithersburg, Md., company said the pivotal Phase 3 trial in the U.K. would track whether adults receiving its two-dose vaccine experience a lower rate of symptomatic Covid-19 compared with study subjects who get a placebo.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/JInEn7CRGa","date":"Thu Sep 24 22:14:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The study, launching Wednesday, will be one of the world's largest coronavirus vaccine studies so far, involving 60,000 volunteers in the U.S., South Africa, Argentina, Brazil, Chile, Colombia, Mexico and Peru.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/DMsgSY3DPG","date":"Wed Sep 23 19:25:29 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Wenstrup-backed Bill to Help Strengthen Trade Partnerships and Bolster American Jobs Passes House Unanimously\n\nRead more: https://t.co/iqsTVuU2W3","date":"Tue Sep 22 22:04:53 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to stand with @GOPLeader as the @HouseGOP works to better our country on behalf of the American people!\n\nVisit https://t.co/kYPxlNms73 for more info!","date":"Tue Sep 22 17:32:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Small businesses support tens of millions of American jobs &amp; have a huge impact on our nation’s economy. I proudly voted for the #paycheckprotectionprogram to help small businesses remain open through COVID-19 shutdowns, &amp; I’m proud to celebrate them this Small Business Week! https://t.co/AlgWac546M","date":"Tue Sep 22 16:54:28 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"✅PASSED unanimously by the House!","date":"Tue Sep 22 16:00:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺Tune in to @cspan: I'll be debating my bipartisan legislation with @RepTerriSewell to extend the Caribbean Basin Trade Partnership Act through 2030. https://t.co/JS84sFhHS1","date":"Tue Sep 22 15:32:53 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Though the timeline is accelerated, Operation Warp Speed is not eliminating any steps — it is simply allowing them to occur at the same time. All potential COVID-19 vaccines are undergoing the same rigorous testing just as any other vaccine[...]\"\n\nGreat read from @RepRickAllen⬇️","date":"Mon Sep 21 15:11:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Justice Ginsburg served our country honorably and with great distinction. Her friendship with the late Justice Scalia, despite their differing judicial philosophies, serves as a model for our nation. I am grateful for her service and join the nation in mourning for her loss.","date":"Sat Sep 19 02:39:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"People will have reasonable questions and fears, he said. The key is bringing them together with scientists and trusted community leaders for respectful, open conversations.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/UHWho4MKKP","date":"Fri Sep 18 17:51:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"'The goal of this vaccine — of all vaccines in this case — is to stop the pandemic we all want to get back to a normal life as best we can,' Hoge said.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/6ckpfkBBkw","date":"Fri Sep 18 17:32:53 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"BOTTOM LINE: 𝐈 𝐭𝐫𝐮𝐬𝐭 𝐭𝐡𝐞 𝐬𝐜𝐢𝐞𝐧𝐜𝐞, 𝐚𝐧𝐝 𝐈 𝐭𝐫𝐮𝐬𝐭 𝐨𝐮𝐫 𝐬𝐜𝐢𝐞𝐧𝐭𝐢𝐬𝐭𝐬. That's why the @gopdoccaucus chairs and vice-chairs have committed to receiving an #OperationWarpSpeed vaccine once the FDA grants approval. \n\nhttps://t.co/kolEYnORHW","date":"Fri Sep 18 16:25:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"By manufacturing doses of vaccines while they're still going through trials, we will be ready to distribute if a candidate is approved. 𝐖𝐞 𝐜𝐨𝐮𝐥𝐝 𝐡𝐚𝐯𝐞 𝐚 𝐥𝐢𝐟𝐞𝐬𝐚𝐯𝐢𝐧𝐠 𝐯𝐚𝐜𝐜𝐢𝐧𝐞 𝐚𝐬 𝐞𝐚𝐫𝐥𝐲 𝐚𝐬 𝐭𝐡𝐢𝐬 𝐟𝐚𝐥𝐥. https://t.co/nML9v8wmwL","date":"Fri Sep 18 16:25:03 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"But getting a vaccine in record time won't matter if it's not safe. That's why ALL #OWS vaccines are undergoing the same rigorous clinical testing as any other vaccine. 𝐀𝐧𝐲 𝐯𝐚𝐜𝐜𝐢𝐧𝐞 𝐭𝐡𝐚𝐭 𝐢𝐬𝐧'𝐭 𝐩𝐫𝐨𝐯𝐞𝐧 𝐭𝐨 𝐛𝐞 𝐬𝐚𝐟𝐞 𝐰𝐢𝐥𝐥 𝐧𝐨𝐭 𝐛𝐞 𝐚𝐩𝐩𝐫𝐨𝐯𝐞𝐝. https://t.co/8ZOZjJmszz","date":"Fri Sep 18 16:25:02 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#OperationWarpSpeed is 100% 𝐝𝐫𝐢𝐯𝐞𝐧 𝐛𝐲 𝐬𝐜𝐢𝐞𝐧𝐜𝐞 &amp; 𝐝𝐚𝐭𝐚. The combination of modern medicine and the greatest doctors and scientists in the world will make our success achievable. https://t.co/cTnx5MR9ZB","date":"Fri Sep 18 16:25:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We've lowered #COVID19 mortality rates significantly since this spring by using new therapeutics. Continuing to develop better treatments will 𝐡𝐞𝐥𝐩 𝐩𝐚𝐭𝐢𝐞𝐧𝐭𝐬 𝐠𝐞𝐭 𝐛𝐞𝐭𝐭𝐞𝐫 𝐬𝐨𝐨𝐧𝐞𝐫 and 𝐜𝐨𝐧𝐭𝐢𝐧𝐮𝐞 𝐬𝐚𝐯𝐢𝐧𝐠 𝐥𝐢𝐯𝐞𝐬. https://t.co/ynb9MrJ37R","date":"Fri Sep 18 16:25:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Vaccines and treatments are the 𝐤𝐞𝐲𝐬 𝐭𝐨 𝐫𝐞𝐬𝐭𝐨𝐫𝐢𝐧𝐠 𝐨𝐮𝐫 𝐰𝐚𝐲 𝐨𝐟 𝐥𝐢𝐟𝐞. They will protect our health, allowing us to fully reopen businesses, get back to school, attend church, and gather in our communities. https://t.co/cSurnqOS4u","date":"Fri Sep 18 16:25:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"THREAD: What is #OperationWarpSpeed?\n\nAn 🇺🇸 effort to defeat #COVID19 by our nation's best &amp; brightest who have been working around the clock to develop 𝐬𝐚𝐟𝐞 𝐚𝐧𝐝 𝐞𝐟𝐟𝐞𝐜𝐭𝐢𝐯𝐞:\n\n✅Vaccines \n✅Treatments \n✅Tests https://t.co/zzKJ7tg5YP","date":"Fri Sep 18 16:24:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Shanah Tovah to all celebrating Rosh Hashanah this weekend! I wish you a blessed new year. https://t.co/qkdcON20ZO","date":"Fri Sep 18 14:48:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today we remember the over 80,000 men and women who were, or currently are, Prisoners of War or Missing in Action. We honor the heroes who never returned from war, and we stand with the families of the servicemembers waiting to come home. #POWMIARecognitionDay https://t.co/Byl17DB2wW","date":"Fri Sep 18 13:57:39 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Meanwhile, Albert Bourla, Pfizer CEO, said there is a “good chance” Pfizer will know safety and efficacy results by late October, The Boston Globe wrote, citing comments made Sunday on CBS’ “Face the Nation.”\n#OperationWarpSpeed","date":"Thu Sep 17 19:54:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"[...]Moderna hoped to see results by October but a recent dip in the average national cases created difficulty in hitting the amount of infections among trial participants needed in order to see whether the vaccine candidate outperforms the placebo.\" \n\nhttps://t.co/qtFtR4VnCA","date":"Thu Sep 17 19:54:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"233 years ago, our Founding Fathers signed the Constitution, bringing forth a system of government that strives for freedom, liberty, &amp; justice—the likes of which the world had never seen before. Today, the U.S. remains firmly committed to these goals &amp; the American way of life. https://t.co/kx3cj6XsQX","date":"Thu Sep 17 16:06:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"While this is the fastest timeline for vaccine development – ever – it is important to remember that OWS does not allow vaccine manufacturers or the FDA to cut corners in the approval process.\"\nhttps://t.co/kolEYnORHW","date":"Thu Sep 17 15:22:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thanks, @SecAzar &amp; #OWS Chief Advisor Dr. Moncef Slaoui, for yesterday's briefing on vaccine development with @GOPLeader. \n\nI'm encouraged by the progress we're making and have full confidence that when we have an FDA-approved vaccine, it will be safe and effective. https://t.co/j2a2YAybeq","date":"Thu Sep 17 14:59:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The reason that America remains in the leading position is thanks to Operation Warp Speed (OWS), which was initiated in mid-May by President Donald Trump.\"\n\nGreat read on #OperationWarpSpeed from @TomColeOK04 ⬇️","date":"Wed Sep 16 17:48:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We’re confident enough in the science to commit to receiving an FDA-approved vaccine ourselves.\n\nMy latest for @FoxNews with fellow @gopdoccaucus members @DrPhilRoe, @RepAndyHarrisMD, @RepLarryBucshon ⬇️\n\nhttps://t.co/kolEYnORHW","date":"Wed Sep 16 16:57:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great information from @SecAzar on #OperationWarpSpeed vaccine distribution plans ⬇️","date":"Wed Sep 16 16:24:30 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@USRepLong is 100% right!","date":"Wed Sep 16 16:23:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Agreed! I'm proud to lead the effort to reauthorize the CBTPA with @RepTerriSewell.","date":"Wed Sep 16 16:09:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"We are committed to making decisions guided by the best evidence. Our approach has been and must remain the gold standard that all can rely upon.\" \n\n-@US_FDA Career Officials\n\nhttps://t.co/907ooHdUwH","date":"Tue Sep 15 21:49:48 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#OperationWarpSpeed is the key to returning to a normal way of life. Safe and effective treatments and vaccines will not only protect the health and well-being of all Americans, but it will also help more businesses, health care facilities, churches, and more reopen. https://t.co/hHPxSiBlhf","date":"Tue Sep 15 21:49:30 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I was honored to attend the Abraham Accords signing at the @WhiteHouse today. Today marks progress toward peace &amp; stability in the Middle East. President @realdonaldtrump continues to be a leader in brokering peace in the region, &amp; I am hopeful for more agreements in the future! https://t.co/Cki3Bv3g7S","date":"Tue Sep 15 19:51:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"For anyone interested in the science and strategy of #OperationWarpSpeed therapeutics, here's a great read in the @NEJM by Dr. Moncef Slaoui, Dr. Shannon Greene, and Dr. Janet Woodcock: https://t.co/ecJophHktR","date":"Tue Sep 15 17:01:19 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Republicans are committed to defending the American way of life and prosperity under the strongest economy in generations. We will:\n \n•Restore\n•Rebuild\n•Renew\n \nRead about our https://t.co/kYPxlNms73","date":"Tue Sep 15 15:31:28 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"A great day for peace and prosperity in the Middle East! See you there!   🇺🇸🇮🇱🇦🇪🇧🇭","date":"Tue Sep 15 15:21:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"There's nothing as resilient as the American spirit! 🇺🇸","date":"Mon Sep 14 21:18:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The @US_FDA will ensure that any Covid-19 vaccine is 𝐬𝐚𝐟𝐞 𝐚𝐧𝐝 𝐞𝐟𝐟𝐞𝐜𝐭𝐢𝐯𝐞.\n\n⬇️ THREAD ⬇️","date":"Mon Sep 14 21:00:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"There’s a “more than 60 percent” chance that the drugmaker’s clinical research will produce results by the end of October showing whether or not the shot works, Bourla said in a Sunday TV interview.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/imQCUCFOzl","date":"Mon Sep 14 20:21:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Read more about my bill here: https://t.co/oNC0d0BeqN","date":"Mon Sep 14 19:45:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great read from @steveFDA and Dr. Anand Shah. Our nation has a critical medical supply chain problem, and I’ve introduced legislation to help address these vulnerabilities and bring jobs back to the U.S. \nhttps://t.co/M96u89NEpb","date":"Mon Sep 14 19:45:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#OperationWarpSpeed\n \nhttps://t.co/C5nafHf1ti","date":"Mon Sep 14 18:51:36 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"What is #OperationWarpSpeed? Members of the @gopdoccaucus are here to tell you about the safe &amp; effective vaccines, treatments, &amp; tests that scientists &amp; researchers are developing right now. We’re optimistic that real solutions may be available to the public very soon. https://t.co/SxZ5H9QUf6","date":"Mon Sep 14 16:15:28 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today, tomorrow, and years from now, I know that “united, we will stand”— in the face of evil and in defense of our great nation. #NeverForget https://t.co/H3NH4Z2nop","date":"Fri Sep 11 14:49:19 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great read from @RepSmucker on #OperationWarpSpeed:","date":"Thu Sep 10 20:16:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Outrageous. It's time for @SpeakerPelosi and @SenSchumer to drop the partisanship so we can get targeted relief to the American people.","date":"Thu Sep 10 19:20:26 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Glad to have @RepFrankLucas join as a cosponsor of my bipartisan legislation to help military spouses and families.","date":"Thu Sep 10 19:11:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today, on World Suicide Prevention Day, I encourage you to check in on those you care about.\n \nIf you or someone you know is struggling, you can find support through the National Suicide Prevention Lifeline at 1-800-273-8255 or online at https://t.co/IzrYK04sAv https://t.co/99dPRzEu5n","date":"Thu Sep 10 18:16:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"'This is an example of how the conduct of clinical trials is supposed to work,' said Anna P. Durbin, M.D., a vaccine researcher and Professor at John Hopkins Bloomberg School of Public Health.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/kYWinZSIai","date":"Thu Sep 10 15:30:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The news is disappointing, but it shows the development process is happening as it should. It is not uncommon for drug or vaccine trials to hit snags, even at advanced stages.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/sCGqF4tN8d","date":"Wed Sep 09 17:31:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is spot on! \n\nLet's #TrustTheScientists, like Dr. Moncef Slaoui who has said there has been zero political interference in #OperationWarpSpeed, not politicians cheering for the President — and America — to fail so they can win an election.\n\nhttps://t.co/XpfyHWyZUL","date":"Wed Sep 09 14:40:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"What this shows is how seriously #OperationWarpSpeed researchers and scientists are taking the safety aspect of the vaccine trials.","date":"Wed Sep 09 00:22:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Temporary holds of large medical studies aren't unusual, and investigating any serious or unexpected reaction is a mandatory part of safety testing...\" https://t.co/gLqdwNQ80C","date":"Wed Sep 09 00:22:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"...AstraZeneca pointed out that it's possible the problem could be a coincidence; illnesses of all sorts could arise in studies of thousands of people.\" \nhttps://t.co/gLqdwNQ80C","date":"Wed Sep 09 00:22:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Speaker Pelosi is blatantly neglecting her leadership responsibilities. We need to be back in Washington next week, in the House Chamber, discussing the needs of the American people, not delaying the important work that needs to be done. \n\nhttps://t.co/sQ0NUCkFma","date":"Fri Sep 04 17:03:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“I would immediately resign if there is undue interference in this process,” Moncef Slaoui told Science Magazine. \"I have to say there has been absolutely no interference.”\n\n#OperationWarpSpeed \n\nhttps://t.co/XpfyHWyZUL","date":"Fri Sep 04 14:24:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Once again, monthly payroll increases surpass expectations and unemployment numbers fall as the U.S. economy continues to rebound toward pre-COVID shutdown numbers. https://t.co/DhabgMho5F","date":"Fri Sep 04 13:44:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thanks, @RepMikeTurner, for showing me around some of the important revitalization projects happening in our state.","date":"Thu Sep 03 22:41:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We want states to be ready to distribute a COVID-19 vaccine as early as November.\n\nHowever, we won't distribute any vaccine unless it is proven to be 𝐬𝐚𝐟𝐞 𝐚𝐧𝐝 𝐞𝐟𝐟𝐞𝐜𝐭𝐢𝐯𝐞. https://t.co/QBjfpXIett","date":"Thu Sep 03 21:59:32 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Why volunteer for a vaccine clinical trial? Duty, love and a willingness to experiment, participants say\"\n\n#ProfilesInCourage #OperationWarpSpeed  \n \nhttps://t.co/yIsslvXdx3","date":"Thu Sep 03 21:07:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We're making remarkable progress in record timing through #OperationWarpSpeed!\n\nI'm confident that we'll get a viable vaccine. But we'll only approve one IF &amp; ONLY IF it is 𝐬𝐚𝐟𝐞 𝐚𝐧𝐝 𝐞𝐟𝐟𝐞𝐜𝐭𝐢𝐯𝐞.","date":"Thu Sep 03 19:18:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Sanofi and GlaxoSmithKline Plc, two of the world’s biggest vaccine makers, began testing their experimental Covid-19 shot in the first patients on Thursday and aim to start late-stage trials before year-end.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/f0ZKZzADTW","date":"Thu Sep 03 14:24:47 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨\"Novavax coronavirus vaccine is safe, published results show\"\nhttps://t.co/HvNxWn6epV","date":"Thu Sep 03 01:22:53 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Important read from my colleagues @repgregwalden, @michaelcburgess, &amp; @RepGuthrie on the safety of #OperationWarpSpeed:\nhttps://t.co/HQ5AtG12mU","date":"Wed Sep 02 19:24:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"75 years ago, Japan formally surrendered to the Allies in WWII, effectively ending the war. Today, we celebrate this victory and honor the brave men and women who fought in the Pacific and across Europe against fascism during WWII. https://t.co/RAMy9PvxDY","date":"Wed Sep 02 16:48:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Here’s a great breakdown of Operation Warp Speed, which is working on getting a safe and effective COVID-19 vaccine to the American people—simple as that:","date":"Wed Sep 02 16:46:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Another #OperationWarpSpeed update ICYMI:\n\n\"AstraZeneca announced Monday its vaccine candidate has entered the final testing stage in the U.S.\"\n\nhttps://t.co/ODSFlPXDuK","date":"Wed Sep 02 16:46:03 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"More positive news: \"Large antibody study offers hope for virus vaccine efforts\" via @foxnews\n\nhttps://t.co/yg9vpdfeWa","date":"Wed Sep 02 16:43:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Headline: \"Federal health advisors assume four coronavirus vaccine trials backed by U.S. will likely fail\"\n\nNext sentence in quote: \"THREE OF THE TRIALS WILL SUCCEED...\"\n\nCome on, @CNBC. Do better.\n\n#OperationWarpSpeed  \n\nhttps://t.co/MYKFJoIVV4","date":"Wed Sep 02 16:39:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Praying for Officer Jordan, his family, and the entire Middletown community.","date":"Tue Sep 01 01:32:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"'We will make that decision only on the basis of science and data. We will not make that decision on the basis of politics - that's a promise,' Hahn told CBS News.\"\n\n#OperationWarpSpeed \n\nhttps://t.co/pVJV7MZfHS","date":"Mon Aug 31 21:20:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ICYMI: Perspective in the @NEJM: \n\n\"Developing Safe and Effective Covid Vaccines — Operation Warp Speed’s Strategy and Approach\"\n\nhttps://t.co/I3hQkQfcf8","date":"Mon Aug 31 19:49:30 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The United States expects to have four coronavirus candidate vaccines in large-scale clinical trials by the middle of September, a remarkable timeline considering the SARS-CoV-2 virus was only discovered in December.\"\n\n#OperationWarpSpeed\n\nhttps://t.co/Yln3iJBKP8","date":"Mon Aug 31 17:10:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Coming up soon on @FoxBusiness. Be sure to tune in!","date":"Mon Aug 31 11:12:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The first patient to receive a dose was 37-year-old Cincinnati resident Jarelle Marshall.\n\n'We’re all in this together,' Marshall said. 'We all want to get things back open and get back to as normal as possible.'\"\n\n👏👏 #OperationWarpSpeed\n\nhttps://t.co/SApr31Kfii","date":"Thu Aug 27 15:21:11 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The pilot program aims to address the health and economic impacts of widespread substance and opioid misuse, addiction and overdose by providing retraining and other services to workers in communities significantly impacted by the opioid crisis.\"\n\nhttps://t.co/UbgHTprqFp","date":"Thu Aug 27 15:11:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Pleased to see SUPPORT Act funding coming back to help Ohioans fight the opioid crisis!","date":"Thu Aug 27 15:03:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The test -- which is said to be the size of a credit card -- is the first antigen test where results can be read directly from the testing card, according to the FDA's Wednesday announcement.\"  \nhttps://t.co/5xPs8RHdDC","date":"Thu Aug 27 14:49:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Read about it here: https://t.co/hdbh8XJxVv","date":"Wed Aug 26 18:53:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you, @SecGeneScalia, for visiting Piketon &amp; for your work supporting our efforts to combat the opioid crisis. \n\nToday, @USDOL announced nearly $20m in funding for a pilot program in 4 states to help individuals with the health and economic impacts of opioid addiction.","date":"Wed Aug 26 18:53:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨Great news from #OperationWarpSpeed! ⬇️","date":"Wed Aug 26 18:40:28 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Now THIS puts lives in danger.\n\nBelieve me, I know firsthand. And, @SteveScalise knows better than anyone.\n\n(cc: @nytimes, @SpeakerPelosi, #MSM)","date":"Mon Aug 24 23:31:32 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"MUST READ on #OperationWarpSpeed:\n\n“While there may be some people attempting to dampen the enthusiasm of the announcement, any treatment that is proving safe and potentially efficacious after being administered in over 70,000 Americans deserves praise.”\n\nhttps://t.co/bnhJiNc0MV","date":"Mon Aug 24 18:14:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our physicians and researchers need to have a large supply of plasma from recovered COVID patients. Please consider donating if you can, and help others: https://t.co/bYvvKbBerD","date":"Sun Aug 23 21:35:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"While this is proven science revisited, we can continue to research its precise effectiveness. At the same time, we shouldn’t deny people of its benefits.","date":"Sun Aug 23 21:35:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Trump administration is absolutely right to give emergency authorizations for #convalescentplasma treatments, which have shown promise in saving lives.","date":"Sun Aug 23 21:35:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Click to read my op-ed about our nation’s battle with COVID-19 and our path forward as we combat this disease.\n\nhttps://t.co/qWtB6vE1P5","date":"Fri Aug 21 19:01:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“As a doctor, I firmly believe that the same spirit that has fueled our ability to eradicate diseases and bring hope to millions across the globe in the past will enable us to overcome this obstacle.”","date":"Fri Aug 21 19:01:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you've recovered from #COVID19, please consider donating your plasma. It's critical for researchers to have an adequate supply of convalescence plasma to continue researching life saving treatments!","date":"Thu Aug 20 20:09:10 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great explanation of #OperationWarpSpeed from my friend, @RepJohnJoyce!","date":"Wed Aug 19 14:01:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is a great move by President Trump on the 100th anniversary of the ratification of the 19th Amendment. Susan B. Anthony was a trailblazer for woman’s suffrage and staunch advocate for protecting unborn children!\n   https://t.co/bmt7A3sBDT","date":"Tue Aug 18 15:12:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to join @boblatta's effort to protect every Ohioan's Constitutional right to vote.","date":"Mon Aug 17 23:37:02 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Keeping the President and his family in my prayers. May they find peace and comfort. https://t.co/1ySDJVMy0X","date":"Sun Aug 16 14:31:48 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great to see @CincyChildrens will be receiving critical funding to continue helping care for patients and their families!","date":"Fri Aug 14 22:07:48 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The agreement between #Israel and #UAE is a historic accomplishment that demonstrates what building prosperity, fostering collaboration, and achieving conflict resolution can look like in the Middle East. https://t.co/4Lqp4WV2S4","date":"Thu Aug 13 22:30:18 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I commend this example-setting milestone and hope to see more like it as the journey towards peace in the region moves forward.","date":"Thu Aug 13 22:30:18 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"These Shawnee State students are an inspiring example of our community’s efforts to combat COVID-19. Their voluntary work in building face shields is helping protect those on the frontlines of the pandemic. Such selfless work!\nhttps://t.co/hmaA0T72Bj","date":"Wed Aug 12 20:47:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’ve introduced legislation that will\n \n☑️Strengthen our global position by investing in advanced medical manufacturing\n\n☑️Bolster our nation’s self-sustainability in critical medical production\n \n☑️Make us less reliant on importing life-saving goods from adversaries, like China. https://t.co/8iTytcRSg5","date":"Tue Aug 11 18:05:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Good news on the economy this morning!\n \nJuly’s jobs report beat expectations as we continue to rebuild our economy and ⬇️ unemployment numbers.\n \nhttps://t.co/6Bpb8BEVmV","date":"Fri Aug 07 15:33:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you or someone you know needs help obtaining a service medal you’re owed or replacing one that is lost, please don’t hesitate to contact my office at (513) 474 – 7777.","date":"Fri Aug 07 14:48:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The purple heart is our military’s oldest award, &amp; today, on #purpleheartday, Americans pause &amp; remember all of the servicemembers who were wounded or paid the ultimate sacrifice in defense of our great nation. God bless these brave men &amp; women &amp; I thank them for their sacrifice. https://t.co/gCAxsQA34b","date":"Fri Aug 07 14:48:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m proud to support @ConawayTX11 resolution to suspend the U.S. extradition treaty with Hong Kong until their judicial and political autonomy is restored from the grasps of the CCP. We cannot let communist China succeed in trying to silence pro-democratic voices!","date":"Thu Aug 06 20:23:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@US_FDA officials have declared that advanced medical manufacturing, central to a recent proposal by @WaysandMeansGOP, is key to supporting public health and preventing future pandemics.\nhttps://t.co/Q7OMXWpdQc","date":"Tue Aug 04 21:54:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is directly in line with my legislation to bring more jobs in advanced manufacturing of prescription drugs, medical devices, and biological products into the United States.\nhttps://t.co/oNC0d0BeqN","date":"Tue Aug 04 21:54:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great message from my colleague and fellow @gopdoccaucus member @RepGregMurphy on the science behind convalescent plasma therapies ⬇️","date":"Tue Aug 04 20:43:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"President Trump last week called on those who have recovered from covid-19 to donate their blood plasma as a potential treatment for help stem the pandemic... it could help millions of patients with the novel coronavirus both here and abroad.\"\nhttps://t.co/0FagvWNo7D","date":"Mon Aug 03 22:47:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Learn more at: https://t.co/GOYkMgRz7N https://t.co/q76msU2fy0","date":"Mon Aug 03 21:59:25 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Plasma donation ➡️ developing treatments for COVID-19.\n\nThe Trump administration is calling attention to the importance of plasma donation. \n\nCOVID-19 survivors, learn more about how you can save lives ⬇️⬇️⬇️\n\nhttps://t.co/OLdkmzQO07","date":"Fri Jul 31 17:58:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you’re interested in learning more about convalescent plasma donation and how it can be used to treat COVID-19, you can visit https://t.co/mlObJPSuUn","date":"Thu Jul 30 19:38:29 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Gathering plasma is becoming increasingly critical to further developing therapeutics to treat COVID-19. If you or someone you know has recovered from the virus, please consider donating! https://t.co/WZjb21kxG9","date":"Thu Jul 30 19:33:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Last week, I introduced legislation with @RepScottPeters to create a public awareness campaign encouraging patients who’ve recovered from COVID-19 to donate their plasma and help save lives! https://t.co/BUDdtdj4H3","date":"Thu Jul 30 19:30:25 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you @realDonaldTrump for spreading awareness about the importance of plasma donation in developing treatments for COVID-19.","date":"Thu Jul 30 19:12:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ALERT: If you or someone you know has received unsolicited packages of seeds from China, the Ohio Department of Agriculture is asking that you report the seeds and do not plant them.\n\nYou can report the seeds online here: https://t.co/ZTLVVGr5vI\n\nhttps://t.co/0lOvrqglNl","date":"Wed Jul 29 20:30:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Ohio's rural communities can use this useful toolkit to apply for competitive grant funding from @usdot to improve the safety of local roads. ⬇️","date":"Mon Jul 27 22:13:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You may have heard me talk about the importance of convalescent plasma before.\n\nWORTH THE WATCH: Here is a story of a selfless individual who donated his plasma to help save lives.\n\nYou can find more info about donating here:\nhttps://t.co/mlObJPSuUn","date":"Mon Jul 27 20:21:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We need to learn from recently exposed vulnerabilities in our medical supply chains. My legislation will bring more jobs in advanced manufacturing of prescription drugs, medical devices, and biological products into the United States.\n\nRead more here: https://t.co/oNC0d0BeqN https://t.co/qnBrMXrE0t","date":"Mon Jul 27 17:21:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨 Pop-up testing locations⬇️","date":"Mon Jul 27 15:37:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"1-0! #TakeTheCentral","date":"Sat Jul 25 02:54:36 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You could save lives!\n\nLearn more about my bipartisan bill with @RepScottPeters to create a national awareness campaign for convalescent plasma collection: https://t.co/BUDdtdj4H3 https://t.co/V5MBn5Od3V","date":"Fri Jul 24 19:56:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Nothing beats #OpeningDay at GABP! Go @Reds! #FBF https://t.co/2nLreARXzl","date":"Fri Jul 24 17:07:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thanks, @NTU, for helping to get the word out about my bipartisan Family Saving Flexibility Act, which allows families to rollover their FSA/DCFSA dollars!\n\nhttps://t.co/EJf8NL6Rp1","date":"Thu Jul 23 22:09:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/pPgEi4O6r7","date":"Tue Jul 21 23:04:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"While it’s far from perfect, it includes many important provisions that invest in critical infrastructure, give our troops a well-deserved pay raise, and help us continue to rebuild our military.\n\nRead my full statement: https://t.co/6aAb1frW8W","date":"Tue Jul 21 22:29:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"One of Congress’ most important constitutional duties is to provide for the common defense, ensuring our military is equipped to defend us against adversaries big and small. Today, I voted for the FY2021 National Defense Authorization Act. https://t.co/B0YB91eSLk","date":"Tue Jul 21 22:29:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As a doctor, I swore an oath to protect the well-being of all humans. In addition to ending an innocent life, deregulating abortion pills to allow for at home consumption will result in an increased risk of complications for women.","date":"Mon Jul 20 19:06:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"AG Barr, HHS @SecAzar, &amp; @SteveFDA should stand for life and repeal the ACOG v. FDA decision. #ProLife \nhttps://t.co/eEHqsUp01U","date":"Mon Jul 20 19:06:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I pray for his loved ones as we mourn his loss.","date":"Sat Jul 18 12:41:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It truly was my honor to have known Mr. Lewis and to have served alongside him in Congress. He was always the kindest gentleman whenever we engaged each other.","date":"Sat Jul 18 12:41:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"John Lewis devoted his entire life to fighting for equality and unalienable rights. Our nation owes him our deepest gratitude and respect. We will forever remember him as one of the great America icons.","date":"Sat Jul 18 12:41:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺Tune in now as I testify before @RulesReps on the FY2021 NDAA: https://t.co/WmvnpyiXWV","date":"Fri Jul 17 17:54:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Have you tested positive for COVID-19? \n\nYou should talk to your doctor about using a pulse oximeter to track your lung health.\n\nYesterday, I spoke with @JohnLondonWLWT about why we need to raise awareness of these important devices:  https://t.co/JDghLIGya1 https://t.co/mQ3jrYExt7","date":"Fri Jul 17 15:25:18 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Bringing Space Command to Ohio would stimulate our economy and bring more than a thousand jobs to our great state. I was proud to join @RepMikeTurner in showing @GOPLeader why Dayton would be the best location for the new headquarters! \nhttps://t.co/b90XiH8NjP","date":"Wed Jul 15 17:57:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"REMINDER: Today is #TaxDay2020! The IRS extended tax day to help relieve fiscal pressure through COVID-19. Make sure to file your 2019 taxes before the day's end if you haven’t already. https://t.co/y2rIxb9KKR","date":"Wed Jul 15 15:24:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Americans across the country are being treated for COVID-19 with convalescent plasma. If you have recovered from coronavirus, I encourage you to consider donating plasma. For more info on how plasma donation can help current COVID-19 patients, visit https://t.co/wndC8GzXk5","date":"Tue Jul 14 19:58:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great opinion piece in the @WSJ on the importance of reopening schools.\n\n“Opening the schools is essential to the well-being of students, and teachers and administrators have a duty to make it happen.”\n\nhttps://t.co/iGdmx5JXMB","date":"Tue Jul 14 17:08:53 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Paycheck Protection Program (PPP) application has been extended through August 8th. So far, PPP has already supported over 50 million jobs across America, and this extension will continue to help keep businesses open and employees on the payroll through COVID-19. https://t.co/KzdNUYyzMK","date":"Mon Jul 13 18:32:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"For more information on free COVID-19 tests visit @OHdeptofhealth's website: https://t.co/VZlIDDDVSe https://t.co/vZ5OLUK66C","date":"Wed Jul 08 21:30:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is a big win for religious freedom and the First Amendment!","date":"Wed Jul 08 14:30:05 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It’s vital that we get the right information to the 🇺🇸 people. This morning, the Trump administration invited me to join key officials at the @WhiteHouse to help explain how we can safely reopen the country.\n\nHere's a behind scenes sneak peek: https://t.co/JmnblsKsbh","date":"Tue Jul 07 16:37:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺Coming up next on @FoxBusiness with @DavidAsmanfox to talk about our brave military, dangerous leaks, and more.","date":"Mon Jul 06 22:19:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Last week, Congress extended the Paycheck Protection Program application deadline through August 8th! Small businesses now have additional time to access #PPP funds to help keep their doors open and workers on the payroll. https://t.co/v0Lj0r3e16 https://t.co/KahKWmYQkA","date":"Mon Jul 06 21:36:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today, as we commemorate the birth of our country, we are grateful for Americans of every color, race, and creed throughout our history who have sacrificed and spoken out, battled and bled for this nation.\n\nMy #IndependenceDay reflections in the @Enquirer:\nhttps://t.co/ItOpyO2fXn","date":"Sat Jul 04 20:23:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"God bless America! 🇺🇸 https://t.co/cymp3UNnZc","date":"Sat Jul 04 14:07:19 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺 I’ll be joining @FoxFriendsFirst at 5:30a. Be sure to tune in!","date":"Fri Jul 03 09:15:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Please consider making a blood or plasma donation. It could save lives! \n\nMore info:\n@HoxworthUC https://t.co/wFIhKBGFmv\n@RedCross https://t.co/jmSMuzpMSi","date":"Thu Jul 02 17:30:05 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you for the great work that you do and for having me on your show to share a little about what makes this country great! 🇺🇸","date":"Thu Jul 02 15:37:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"More signs that Ohioans are heading back to work as weekly claims for unemployment benefits are down for the ninth straight week, state officials said Thursday.\" https://t.co/PKOJXZfzCk","date":"Thu Jul 02 14:02:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨📈🇺🇸\nhttps://t.co/ILKBomnEwy","date":"Thu Jul 02 13:53:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The #USMCA goes into full effect today! \n\nRead my statement: https://t.co/bxZeWxCXqo https://t.co/uimRUyRr7s","date":"Wed Jul 01 14:52:44 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Meanwhile, Republicans are proposing solutions that support innovation, like my bill with @RepDavid to strengthen &amp; extend the 45Q carbon capture tax credit⬇️ https://t.co/IhhdUSnuw8","date":"Tue Jun 30 19:20:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"That time is now. We cannot afford to wait until the next national crisis to rectify the critical vulnerabilities that are already known.\"\n\nMy latest on #SupplyChains in @RCDefense: https://t.co/dxqAUZjaGe","date":"Tue Jun 30 14:30:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This was an incredibly disappointing ruling from #SCOTUS. Each and every human – including those in the womb – have inherent dignity and worth. I vow to continue fighting to stand up for unborn children.","date":"Mon Jun 29 16:40:47 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Some of my colleagues would rather keep this a political issue than pass a law with meaningful impact, as we saw when Minority Leader Chuck Schumer refused even to allow the Senate to debate the JUSTICE Act.\nhttps://t.co/tDNF5TBjNJ","date":"Fri Jun 26 17:56:26 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great work from our law enforcement officers! We must remain vigilant, as the battle against the opioid epidemic continues.\n\nIf you, or someone you know, is struggling with substance addiction, please know that help is available. Call 1-800-662-4357.\nhttps://t.co/CqhLduRIrA","date":"Fri Jun 26 17:41:24 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ICMYI: Yesterday, Christopher Smitherman and I joined Bill Cunningham’s show on @700wlw to discuss how important it is for people to have civil and sincere conversations with those who have differences of opinion: https://t.co/rwIB8eU3pi","date":"Thu Jun 25 16:57:32 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great opportunity to help:\n\n\"Blood drive at Great American Ball Park, donations also tested for COVID-19 antibodies\" via @FOX19  \n https://t.co/eJZ39Xe1Jy","date":"Wed Jun 24 16:11:39 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I'm proud to have signed this letter, and I continue to stand with our allies in Israel 🇺🇸🇮🇱","date":"Tue Jun 23 16:35:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy Father's Day! https://t.co/43aWoZTPBG","date":"Sun Jun 21 13:14:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Your plasma donation could save lives!\n\n\"In a new study of convalescent plasma transfusions in 20,000 coronavirus patients, authors say the data offers “robust evidence” the treatment is safe and associated with improved survival.\" via @FoxNews https://t.co/q9k2bS3cVC","date":"Fri Jun 19 21:18:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I'm proud to cosponsor this legislation led by @RepPeteStauber and @SenatorTimScott https://t.co/8eromiPZfP","date":"Fri Jun 19 20:38:47 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Juneteenth is the day on which we celebrate the true liberation of enslaved people in America.\n\nWe still have much work ahead of us, and, as it is sung in America the Beautiful, we must continue striving to \"mend our every flaw.\" https://t.co/FZAtaUKYvZ","date":"Fri Jun 19 13:50:49 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📻 Tune in to @55KRC to listen my friends Vice Mayor Christopher Smitherman, Brian Thomas, and me discuss the importance of building trust and having honest and civil conversations with people who may hold different views.","date":"Fri Jun 19 11:32:24 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"When people sit down face to face, we often find out that we have a lot more in common then we think.","date":"Fri Jun 19 11:32:24 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Tomorrow will mark 3 years since the tragic death of Otto Warmbier at the hands of the North Korean regime. Today, I introduced a resolution with @RepSteveChabot to commemorate Otto's life and condemn the Kim regime for their continued human rights abuses. https://t.co/NGCGyiGqnv","date":"Thu Jun 18 18:04:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"UPDATE: @POTUS has signed the Uyghur Human Rights Policy Act of 2020 into law. https://t.co/dkutkVPo8q","date":"Wed Jun 17 21:25:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Coming up next on @foxnewsradio with @kilmeade!\n\n📻Tune in: https://t.co/dEKLD6aB6O","date":"Wed Jun 17 14:08:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Monica and I are devastated by the loss of our friend Carol Barr. We pray for and grieve with Andy and his two girls.","date":"Wed Jun 17 02:35:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@POTUS is right to ensure China is included in any meaningful arms control efforts. \n\nChina's increasingly aggressive posture puts the U.S. on the cusp of a new Cold War, and that is why I am proud to join this effort with @RepLizCheney to keep the CCP in check.","date":"Tue Jun 16 16:14:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"UPDATE: You can get free COVID-19 tests at select locations in Southwest Ohio.","date":"Tue Jun 16 15:01:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Your plasma donation can save lives! If you’ve recovered from COVID-19, please consider donating your plasma to patients currently fighting the disease. https://t.co/u67y1IzZPK","date":"Mon Jun 15 15:07:11 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy 245th Birthday, Army! https://t.co/NB5rks8Way","date":"Sun Jun 14 19:51:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our nation was founded on religious freedom &amp; individual liberty, and those are two principles worth defending around the world. Today, I voted to hold the CCP accountable for the ongoing repression and human rights abuses of the Uyghurs and other ethnic minorities in China.","date":"Thu May 28 00:49:16 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"God was looking down on us that day.\n\nThank you to the law enforcement officers who on that day — and everyday — risk their lives to keep us safe.","date":"Sun Jun 14 13:46:10 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Part of the legacy of the American dream is that each generation works to create a better future for their children. \n\nIt is up to each and every one of us to live up to the values for which our flag stands.\n\nMy reflections on #FlagDay via @dcexaminer: https://t.co/MxWtEtMCj2","date":"Sun Jun 14 13:43:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"President Reagan’s bold challenge to the Soviet Union changed the course of history. To this day, America continues to advocate for freedom and liberty for all people around the world, denouncing communism.","date":"Fri Jun 12 14:42:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"IMPORTANT: @GovMikeDeWine has just announced that everyone in Ohio can now access a COVID-19 test by contacting their doctor. This would not be possible without the CARES Act funding. https://t.co/589diagKy1","date":"Thu Jun 11 19:04:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"A great piece highlighting Pranav, the viewer’s choice and 2nd place winner of the 2020 Congressional Art Competition for OH-02! \n\nHis impressive drawing will hang in my Washington, D.C. office. I can’t wait to see what other talented pieces he creates. https://t.co/EL59ssVx6N","date":"Wed Jun 10 14:55:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#TBT This was a BIG DEAL for veterans, and I'm proud to have helped it pass.\n\nThe Speaker needs to call the House back to work on more priorities for our veterans, like @DrPhilRoe's bill to help unemployed veterans get in-demand job training: https://t.co/gVRexZGcXs","date":"Tue Jun 09 21:34:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We need to empower Americans by giving them greater flexibility to use the pre-tax money they've saved for health care and child care.\n\nThank you @Tim_Andrews and @Protectaxpayers for hosting this conversation on my bipartisan Family Savings Flexibility Act.","date":"Tue Jun 09 21:00:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations, General Brown!","date":"Tue Jun 09 19:13:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Be on guard against tax fraud and other related financial scams! It’s unfortunate that bad actors would try to exploit Americans, and it’s important to help each other identify and avoid being scammed. https://t.co/T8dxmOA4Hc","date":"Tue Jun 09 15:18:29 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/F5OkmHYKBi","date":"Sat Jun 06 17:18:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"76 years ago, Allied forces stormed Nazi occupied beaches of Normandy in one of the most world-renowned amphibious invasions ever seen by mankind. Our troops fought in the name of freedom, liberty, &amp; justice—values America holds dear. May we never stop fighting to defend them. https://t.co/Fnz8xo56Ap","date":"Sat Jun 06 13:00:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The job numbers were really impressive and surprising today. Despite all the hazards in our way, Americans show tremendous resiliency &amp; ambition. Let’s work to continue to see better and better numbers and more and more Americans working again, each month. https://t.co/gDwUeLbVVC","date":"Fri Jun 05 14:05:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Looking forward to it! ☕️☀️","date":"Fri Jun 05 01:13:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"PPP Flexibility Act:\n\nHouse ☑️\nSenate ☑️\n\nNow on to the President’s desk!","date":"Thu Jun 04 13:41:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As the sun goes down, let’s remember https://t.co/Rya5Cll95Q","date":"Sat May 30 23:40:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you’ve recovered from COVID-19, please consider donating your plasma. It can help save lives.\n \nHere is another great tool to find plasma donation sites near you: https://t.co/0xo8ErgXrM","date":"Fri May 29 16:09:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#COVID19 testing update: CVS will open 34 testing sites across Ohio—including 4 in the Cincinnati area. Read more ⬇️ https://t.co/4WKisjVjfI","date":"Thu May 28 21:13:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@MacTXPress is absolutely right: We must prioritize bolstering our defenses in the Indo-Pacific theater. I'm proud to join the effort and cosponsor H.R. 6613.\nhttps://t.co/9ua8j8afhU","date":"Thu May 28 19:10:47 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great news! @TriHealth will receive $537,471 in @FCC funding to help treat patients through telehealth services. https://t.co/EwZlNbb25m https://t.co/36V29R0u0C","date":"Thu May 28 18:54:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Grateful to have @NTU's support for my bipartisan Family Savings Flexibility Act. It would allow employees to:\n\n☑️roll over their health FSA &amp; DCFSA 💲 to 2021\n⬆️contribution limit for HSAs\n⬆️their DCFSA contribution limit from $5,000 to $10,000.\nhttps://t.co/AJvUCPCrk0","date":"Thu May 28 17:52:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"BREAKING: The Paycheck Protection Program Flexibility Act passed the House with my support. Read my full statement here: https://t.co/ASSM7htMPi","date":"Thu May 28 17:29:36 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our nation was founded on religious freedom &amp; individual liberty, and those are two principles worth defending around the world. Today, I voted to hold the CCP accountable for the ongoing repression and human rights abuses of the Uyghurs and other ethnic minorities in China.","date":"Thu May 28 00:49:16 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Sam Johnson lived an incredible life, and it was an honor to know him. He was a war hero, an accomplished legislator, a dedicated husband, and a great man. For as long as I’m blessed to enter the \"Sam Johnson Room,\" I’ll smile knowing he is looking down us on from Heaven.","date":"Thu May 28 00:24:32 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m joining this lawsuit because every American deserves to have their voice represented in Congress. This requires their elected representative show up in Washington. Ohioans in my district can rest assured that I’m in DC, ready to represent them &amp; do my job by voting in person.","date":"Wed May 27 23:54:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thanks @bhweingarten for having me on your podcast to discuss:\n\n- China’s misinformation regarding the COVID-19 outbreak\n- FISA court system\n- Politicization of the IC\n- And more\n\nhttps://t.co/FNN64cEtj2","date":"Wed May 27 13:31:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thanks for having me on, Jon!","date":"Tue May 26 21:34:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We can’t expect grocery store workers, firefighters, police officers, and healthcare workers to go to work but then not do so ourselves. I’ll be in DC this week to give my constituents a voice.","date":"Tue May 26 15:31:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"On Memorial Day, we open our hearts in gratitude for all those that never returned from theaters of war. For some, the suffering and sacrifices made in defense of freedom do not result in loss of life immediately.\nhttps://t.co/kGeM2SxOCZ","date":"Mon May 25 19:13:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You can read my letter here: https://t.co/bst3QMTBK6","date":"Fri May 22 16:40:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I'm pleased to announce that, following a letter I sent to the administration, @HHSGov has announced they will release $4.9 billion in relief funds to skilled nursing facilities. This is a huge win, as senior citizens have been heavily affected by COVID19. https://t.co/m3p9Q3K7l6","date":"Fri May 22 16:40:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I stand with @POTUS's ongoing efforts to counter the CCP's malign behavior and will continue working with the Admin to protect the American people, promote American prosperity, preserve peace through strength, and advance American influence. https://t.co/Zh8fbmLoAE","date":"Thu May 21 20:22:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It was a great honor and privilege to call Bill Keating a close family friend and mentor. He served our country proudly as a veteran and public official. Bill was also an accomplished attorney, business executive, and athlete. 1/2\nhttps://t.co/KnH8WduGWN","date":"Thu May 21 17:15:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"He was a fixture of the Cincinnati community, and his legacy will last for generations. The Keating family is in my and Monica’s prayers. 2/2","date":"Thu May 21 17:15:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations @RepRatcliffe on your confirmation as the Director of National Intelligence. It’s been an honor to serve with you on the House Intelligence Committee, and I know you’ll continue to serve this nation honorably and honestly in your new post.","date":"Thu May 21 16:40:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Convalescent plasma donation continues to successfully treat COVID-19! If you’ve recovered from COVID-19, I encourage you to:\n \n- Talk with your doctor about plasma donation\n- Consider donating your own plasma\n- Help save lives!\n \nhttps://t.co/iGTXEs4LFP","date":"Thu May 21 16:12:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨🚨 Over $2 million dollars are going to Rural Health Clinics across Ohio to support and expand COVID-19 testing efforts for those in rural areas. https://t.co/AjhexbKdGu 🚨🚨","date":"Wed May 20 17:34:03 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’ve also joined @RepAGonzalez, @RepDaveJoyce, @RepLaHood, and @RepStephMurphy in introducing bipartisan legislation to give small businesses more time to meet PPP forgiveness requirements. https://t.co/2OGRJ3tFih","date":"Wed May 20 15:52:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Earlier this month I wrote to Congressional leadership and the admin asking for additional flexibility: https://t.co/j5f0Y0j8qx","date":"Wed May 20 15:52:36 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@GOPleader is absolutely right here. I’ve been working across the aisle and with the Trump administration to make sure PPP funds can accommodate the unique needs of our small businesses. https://t.co/3g3sGH7yps","date":"Wed May 20 15:52:36 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Joined @brianthomas1 on @55KRC to discuss the latest on: \n \n-Getting Ohioans back to work\n-Speaker Pelosi’s partisan messaging bill\n-General Flynn\n-Plasma donations\n \nAnd more. Listen here: https://t.co/s8biXWJD47","date":"Wed May 20 15:42:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We did what we were told to do. We flattened the curve. It’s time to focus on getting the American people back to work safely and smartly. https://t.co/uk3nqgVAUm","date":"Wed May 20 14:12:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The men and women who serve and have served in the U.S. Armed Forces throughout history have made countless sacrifices to keep us safe, and we owe them our gratitude. Thank you to our nation’s servicemembers for your steadfast commitment to defending America. https://t.co/MdiG444XZX","date":"Tue May 19 19:04:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m also pleased to report that, in addition to these efforts, the Department of Health and Human Services released an additional $11 billion to support testing, bringing our state’s total funding to over $278 million. You can find more information here: https://t.co/FNgEeNyUq6","date":"Tue May 19 15:34:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Over the last few months, I’ve been working with my colleagues and the Trump administration to ensure that Ohio’s doctors, nurses, and medical workers have access to the equipment and supplies they need to protect themselves and others from this disease. https://t.co/DQ4Ihr21qd","date":"Tue May 19 15:34:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is very positive news from @realDonaldTrump &amp; @stevenmnuchin1. I've been working across the aisle and engaging with the administration to help the restaurant industry and other small businesses fully utilize the Paycheck Protection Program.","date":"Mon May 18 21:14:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congress should be focused on Phase One of reopening and rebuilding the economy, not Speaker Pelosi’s partisan wish list. We have the opportunity to open our country smartly and safely, and Congress should be working to help the American people do so. https://t.co/9RyXniRG3o","date":"Mon May 18 20:22:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If grocery store workers, firefighters, police officers, and healthcare workers can go to work, then Congress should too. The House Democrats' proxy voting system sends the wrong message and will hinder our ability to serve the American people. https://t.co/8JIhjsk8ax","date":"Mon May 18 15:23:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺TUNE IN: I’ll be joining @foxandfriends within the hour to discuss our  progress reopening Ohio, the House’s latest action, and more!","date":"Sun May 17 10:17:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today, on Peace Officers Memorial Day, we recognize the law enforcement officers who have made the ultimate sacrifice protecting their communities. Their mark on this world is never forgotten, and their cause — defending our people and upholding our nation’s laws­ ­— lives on. https://t.co/Imrl3PEn2V","date":"Fri May 15 13:54:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Devastating news. Today we lost an American hero. Rest In Peace, SSG Shurer. https://t.co/6KPejOLBsQ","date":"Fri May 15 02:05:36 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Cincinnati hospitals are beginning to resume non-emergent procedures, and @hcollaborative is hosting a live webinar that is open to the public to provide information on how to safely reopen health care services.\n\nYou can access the webinar here: https://t.co/kBuz93k4oC https://t.co/0ioLdRnCBn","date":"Thu May 14 19:16:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"A heart-warming story of community outreach and selfless service from Cincinnati medical students in the @DispatchAlerts.\n\nhttps://t.co/upmkHiUpbh","date":"Thu May 14 17:05:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“Volunteers are assigned someone who is 60 years or older or who has health problems that make it particularly dangerous to risk exposure by leaving home. The volunteers do grocery shopping, pick up prescriptions or perform other errands — or just send cards and check in.”","date":"Thu May 14 17:05:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Convalescent plasma infusions are saving lives right here in our community. Ted Richardson was one of the first Americans to receive plasma donation as a treatment for COVID-19 thanks to the work at @ChristHospital and @HoxworthUC. \n\nhttps://t.co/1ZNPMoF6rE","date":"Thu May 14 14:47:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"For more information on convalescent plasma donation for recovered COVID-19 patients, visit: https://t.co/VPq4YGYd4g","date":"Thu May 14 14:47:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you, @MikeKellyPA! Plasma donation from recovered COVID-19 patients is so important because it can help save the lives of patients currently experiencing symptoms. Find more information on plasma donation here: https://t.co/VPq4YGYd4g","date":"Thu May 14 13:29:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is great news! The @FCC’s $719,098 grant to @CincyChildrens for telehealth services will help high-risk pediatric patients get access to care &amp; avoid potential exposure to COVID-19.","date":"Thu May 14 01:45:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m glad to see that the administration has moved forward with some of those requests.\n \nRead more about our request here: https://t.co/XpBol1LIPE\n\nhttps://t.co/Urlyhymdlw","date":"Wed May 13 20:51:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This only further highlights the need to hold the bad actors within the FBI and IC accountable so we can begin to restore the public’s trust. 3/3\n\nhttps://t.co/pJyVV9Hm48","date":"Wed May 13 19:55:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Now the American people can finally read the full story for themselves, including interview after interview where Obama Administration officials testified that they had no direct evidence of collusion, despite what some of those same officials said publicly to news cameras. 2/3","date":"Wed May 13 19:55:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"For years, some Democrats on the Intelligence Committee selectively leaked portions of the HPSCI depositions to willing members of the media in an attempt to paint a one-sided narrative to indict the President through the press. 1/3","date":"Wed May 13 19:55:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"With all of the interruptions that the COVID-19 outbreak caused, I recently sent a bipartisan letter with @RepLaHood and @RepTomSuozzi to the administration, asking them to provide more flexibility to individuals with FSAs and DCFSAs.","date":"Wed May 13 19:43:10 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Unfortunately, Adam Schiff let down his committee and his country. Now the American people know how and why.","date":"Wed May 13 13:49:49 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“Newly released Congressional testimony shows that Adam Schiff spread falsehoods shamelessly about Russia and Donald Trump for three years even as his own committee gathered contrary evidence.” Via @WSJ https://t.co/utzW6daUvi","date":"Wed May 13 13:49:49 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As Americans get back to work, the House should too. Speaker Pelosi has a responsibility to the American people to bring us back in session.","date":"Tue May 12 13:31:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"More businesses will begin reopening tomorrow. This is welcomed news, and we must continue to make progress getting all Ohioans back to work safely and smartly. https://t.co/OLPhduZk8O","date":"Mon May 11 20:32:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Last week, I asked @USTreasury to help restaurants take full advantage of the Paycheck Protection Program. \nhttps://t.co/HAgj6VCJ97\n\nI appreciate that @stevenmnuchin1 recognizes the industry's unique challenges and look forward to working with the Administration on a solution.","date":"Mon May 11 20:21:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The COVID-19 pandemic has thrown a wrench in many of our plans. Americans need added flexibility with their FSAs and DCFSAs, and I'm proud to lead the effort to get this done.\n\nhttps://t.co/xfE9gL3tS2 https://t.co/dDf9zNyor0","date":"Mon May 11 18:51:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Law Enforcement officers commit their lives to protecting our communities. Not unlike the superheroes in comic books, they strive to defend truth, justice, &amp; the American way. During this Police Week, I invite everyone to join me in honoring our nation’s law enforcement officers. https://t.co/EmP1DPho8Q","date":"Mon May 11 18:49:25 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy Mother's Day! https://t.co/5flewpSCIp","date":"Sun May 10 13:00:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My office is still accepting Congressional Art Competition submissions online through May 15th, 2020. More information on the rules for eligibility and submission can be found here:\nhttps://t.co/MsBqyQ4urB https://t.co/1XLHIUef6M","date":"Sat May 09 15:44:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"75 years ago, Nazi Germany surrendered to the Allied forces, effectively ending WWII in Europe. Today’s anniversary marks the end of one of our world’s darkest chapters, thanks to the bravery &amp; sacrifice of allied soldiers &amp; fueled by the commitment to justice &amp; freedom for all. https://t.co/44V4IPUYWi","date":"Fri May 08 15:23:11 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"They say when you join the military, your family does too. Thank you to all of the military spouses and families for your sacrifices and contributions to our great nation. We are here for you. Please don’t hesitate to contact my office if you ever need help with a federal agency. https://t.co/oc4luhuZHh","date":"Fri May 08 13:36:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Telehealth is becoming an increasingly important tool for our health care system. Great to see federal funding helping our community expand these capabilities! https://t.co/KN36wiSd3d","date":"Thu May 07 20:11:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"BIG: HHS just announced that 10 health centers across Ohio’s 2nd Congressional District will receive $4.9 million in funding for testing. It is important that we continue to beef up testing capacities as our state starts to reopen. https://t.co/tUgJDeMz1D","date":"Thu May 07 19:03:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Recently, there has been an uptick in IRS-related scams from people trying to access Economic Impact Payments. It’s important to know what to look for if a potential scammer contacts you. https://t.co/MPU5wIO39n","date":"Thu May 07 16:41:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"During these challenging times, teachers are stepping up to meet the needs of unprecedented educational settings, and parents and guardians are also helping to fill these roles. Join me in celebrating the incredible work our nation’s educators do for us all. #SendTeachersLove","date":"Thu May 07 14:52:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you believe, please join me in praying for the health, wellbeing, and strength of our nation as we continue to face unprecedented challenges. May God bless us all and God bless America. https://t.co/hxOeXjhDGz","date":"Thu May 07 14:08:16 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Here is a great explanation about Schiff's needless delay from @ByronYork: https://t.co/ggJpJZPQ5z","date":"Thu May 07 00:59:53 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Chairman Schiff needs to release the transcripts from the House Intelligence Committee's investigation into foreign meddling without any further delay. https://t.co/CCPrAXaTCQ","date":"Thu May 07 00:59:51 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Testing is critical to beating this coronavirus, and I'm pleased to see that the United States has made a lot of progress with testing. We need to continue the good work to make tests fast, accessible, and widely available. https://t.co/0jPqZ1xh3Y","date":"Wed May 06 20:49:12 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Now more than ever, we need to show appreciation and thank our nation’s nurses for their tireless fight to keep our loved ones safe and healthy. They are heroes in this battle. Please join me in celebrating #NationalNursesWeek and honoring their work. https://t.co/C5ijNGWUMs","date":"Wed May 06 16:26:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@BradeyWulfhorst Bradley, thank you for reaching out. Please call my Anderson Township office at (513) 474 - 7777, and we'll see what we can do to help you out with this issue.","date":"Wed May 06 16:02:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to see our Cincinnati medical community playing a leading role in this effort! We will get better together!","date":"Tue May 05 23:57:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is very useful information from @hcollaborative for anyone seeking medical attention ⬇️","date":"Tue May 05 19:41:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As American employees get back to work, Congress should too. I joined Bill Cunningham yesterday to discuss the Democrats’ delay in bringing the House back in session, Ohio’s plan to reopen, and more. Listen to the full episode below.\nhttps://t.co/VxuOYzI0Hl","date":"Tue May 05 17:39:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is great news for folks in Brown county! ⬇️","date":"Tue May 05 17:06:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"REMINDER: Today is the last day for SSI recipients who did not file a tax return in 2018 or 2019 and who have qualifying dependents to provide information to receive their full Economic Impact Payments. Be sure to file now! https://t.co/yDIwdFKJDD","date":"Tue May 05 17:01:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is welcomed news. We all must continue to take care of ourselves and that includes routine preventative care and cancer screenings. https://t.co/PsQ0clCje4","date":"Tue May 05 15:18:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As of last Friday, 58,834 Ohio businesses have been approved for a total $4,712,846,309 from the second round of Paycheck Protection Programs. We must continue to support local businesses and their employees as the country reopens and people get back to work.","date":"Mon May 04 19:01:26 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Millions of small businesses across the country have received loans through the #PaycheckProtectionProgram to help support them through these challenging times. https://t.co/Ed3ayDUJYH","date":"Mon May 04 19:01:25 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you’ve recovered from COVID-19, please consider donating your plasma to help treat current coronavirus patients. Last night, I spoke with @WLWT about the progress we’ve seen with plasma treatments.  https://t.co/0zcHgHtSlU","date":"Fri May 01 18:23:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Positively Cincinnati: La Soupe turning would-be wasted food into meals for kids, families via @WCPO:\nhttps://t.co/rAtsQ5f5ky","date":"Thu Apr 30 23:38:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺ICYMI: I gave an update on a variety of #COVID__19-related issues to @Local12: \nhttps://t.co/LQ5Yf9M5o3","date":"Thu Apr 30 20:28:03 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you, @MarioDB! \n\nIf you've recovered from #COVID__19, please consider donating your plasma. It could help save lives.\n\nMore info➡️ https://t.co/VPq4YGYd4g","date":"Thu Apr 30 18:36:47 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“The idea was to give him more soldiers in his body to fight this war,” said Dr. Diaz, who is part of the team treating Dr. Laroche at Palm Beach Gardens Medical Center in South Florida.\" \nhttps://t.co/BXfamQvQ5u","date":"Wed Apr 29 15:52:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you've recovered from COVID-19, your plasma donation could help save a life. You can find more information about who qualifies and where you can donate at: https://t.co/VPq4YGYd4g","date":"Wed Apr 29 15:52:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The first round of #PaycheckProtectionProgram funding provided billions of dollars to over 60,000 Ohio small businesses. Yesterday, the program reopened to continue providing resources to small businesses across the nation. Visit https://t.co/aSWfxHWj6r for more information. https://t.co/EodFvfdRqA","date":"Tue Apr 28 19:07:02 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@kenz24hamilton MacKenzie, will you contact my Anderson Township office at (513) 474 - 7777? We'll see what we can do to help.","date":"Tue Apr 28 16:34:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"However, there's still much more work to be done as we smartly reopen our state’s economy. 2/2","date":"Mon Apr 27 22:24:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m pleased to see Ohio moving in the right direction by reopening some businesses &amp; letting people get back to work safely &amp; efficiently. I’m also thankful that many non-emergency medical procedures will resume. 1/2","date":"Mon Apr 27 22:24:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Economic Impact Payments continue to hit bank accounts, and many people have already received their payment. Individuals who haven’t yet can check the status of their payment on the IRS’s updated online tool. https://t.co/IFeN0kBLxo","date":"Mon Apr 27 19:02:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The funding Congress approved for the #PaycheckProtectionProgram will be released today at 10:30AM EST. Small businesses wanting to participate can apply for the PPP here: https://t.co/EjSZ3SC2WR","date":"Mon Apr 27 13:55:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My statement on today’s vote to replenish the Paycheck Protection Program: https://t.co/GtouzLiE8o https://t.co/f1XCumnhNt","date":"Thu Apr 23 23:02:28 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"College, high school STEM teachers team up to 3D print face shields for healthcare workers @WCPO https://t.co/2A9Mewa9he","date":"Thu Apr 23 21:27:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today, after weeks of unnecessary delay, the House will finally vote to provide additional funding to the Paycheck Protection Program (PPP). https://t.co/iO4fa8YdFT","date":"Thu Apr 23 15:23:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Before the funding ran out last week, roughly 60,000 Ohio businesses had received a total of $14 billion from the PPP to keep their doors open and their employees on the payroll as we battle COVID-19.","date":"Thu Apr 23 15:23:38 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Through these challenging times, it’s important that we continue to support one another. These are just a few simple, easy, and effective ways to help local businesses. We will get better together! https://t.co/ddQFjVZxb4","date":"Wed Apr 22 17:14:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you, @realDonaldTrump, for bringing attention to #ConvalescentPlasma donations!\n\nFind out how you can make a lifesaving donation: \n\nOH-02: https://t.co/VPq4YGYd4g \nUSA🇺🇸: https://t.co/KWGXblWPxf\n\n#COVIDー19 @WhiteHouse @US_FDA https://t.co/WbZAfAhLd7","date":"Tue Apr 21 23:38:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"After the last few months, I think we can all agree that knowing exactly who and what enters our country is a matter of public heath concern and national security.\n\nHere’s a piece I wrote in 2018 that seems just as relevant today: https://t.co/5pcWfcQeq7","date":"Tue Apr 21 22:06:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Check out my latest with @SCClemons on the @WHO, rural hospitals, #convalescentplasma, and more ⬇️","date":"Mon Apr 20 21:35:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"GOOD NEWS: Hoxworth Blood Center collected its first convalescent plasma donations last week, but we still need more volunteers to come forward &amp; help. If you’ve recovered from COVID-19, your antibodies can help treat other patients.\nMore info on donation: https://t.co/VPq4YGYd4g https://t.co/ZrbjYYs0ZJ","date":"Mon Apr 20 15:48:05 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great read from my fellow @WaysandMeansGOP member @RepArrington in the @dcexaminer:\nhttps://t.co/sIyRYYZT6R","date":"Fri Apr 17 19:43:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Your plasma donation can help us treat COVID-19 patients and help save lives. Learn more at https://t.co/zXzMuLEAKT. We will get better together! https://t.co/8p1VaupVnj","date":"Fri Apr 17 15:37:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Another day has passed and Speaker Pelosi and Leader Schumer are still holding #PPP hostage.\n\nAmerica's small businesses need Congress to approve more funding ASAP!","date":"Fri Apr 17 15:28:30 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you purchase an alarm system, does it help if it only goes off after the thief is long gone?\n\nMy latest in the @dcexaminer about the WHO and China's coverup of #COVIDー19:\nhttps://t.co/You7Urwf3Z","date":"Fri Apr 17 13:06:25 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you or someone you know has recovered from COVID-19, I encourage you to consult your physician to discuss donating plasma to help current coronavirus patients. For more information on plasma donation, visit: https://t.co/jcM5YVFhzC https://t.co/EDybHq3Kx9","date":"Thu Apr 16 22:05:24 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you've recovered from #COVID19, please consider making a plasma donation. \n\nFor more information: https://t.co/mlObJPSuUn","date":"Thu Apr 16 15:41:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"⬇️","date":"Thu Apr 16 15:36:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Speaker Pelosi and Leader Schumer must stop holding the Paycheck Protection Program hostage. \n\nAmericans are counting on this program to keep their businesses open and employees on payroll.","date":"Thu Apr 16 15:24:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Economic Impact Payments have already begun hitting people’s bank accounts &amp; will continue to do so over the coming days. Most people don't need to take any action at this time, &amp; the IRS has created a tool for those who want to check their payment status: https://t.co/IFeN0kBLxo","date":"Wed Apr 15 18:46:30 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"REMINDER: The tax filing deadline is extended from April 15, 2020 to July 15, 2020. Those who can’t file by the July 15 deadline can request an extension, however, the IRS is urging those who expect a refund to file as soon as possible. More info here:\nhttps://t.co/O1W5BiMWmK","date":"Wed Apr 15 16:00:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ICYMI: I joined Brian Thomas on @55KRC this morning to talk about the latest updates regarding plasma donation, the World Health Organization, potential phase four legislation, and more.\n \nhttps://t.co/PGTXezCVx8","date":"Wed Apr 15 14:36:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you or someone you know is on Social Security or receiving Supplemental Security Income and curious about eligibility or filing requirements to receive an Economic Impact Payment, you can find more information here: https://t.co/z8GmXER97q","date":"Tue Apr 14 18:26:44 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Chillicothe comes together in spirit of giving @ChilliGaz https://t.co/IHqvHDJkjE","date":"Tue Apr 14 16:14:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The @RedCross is seeking people who are fully recovered from the new coronavirus to sign up to donate plasma to help current COVID-19 patients.\n\nFor more information on plasma donation: https://t.co/mlObJPSuUn\n\nFor Red Cross information: https://t.co/P2CT0heeLX","date":"Tue Apr 14 15:55:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you've recovered from COVID-19, your plasma donation could save lives. The FDA has established a protocol for the collection of convalescent serum from COVID-19 positive donors to help treat others fighting the disease.","date":"Tue Apr 14 15:55:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"US HHS Awards Relief Aid To Adena Health System\" via @wcho_fm https://t.co/axjdgqb5SX","date":"Tue Apr 14 15:51:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Together in hope: Local business gives back to the community, inspired by message of hope @ChilliGaz https://t.co/dy3dPz6Qhu","date":"Tue Apr 14 15:31:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Paint Valley teacher parade reconnects staff, students and Bearcats community @ChilliGaz https://t.co/r1VywuVeWc","date":"Tue Apr 14 15:31:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"That's a lot of buddy cards: LaRosa's coronavirus team member fund gets a boost @Enquirer https://t.co/PlBtjfux24","date":"Tue Apr 14 15:31:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Families, community gather to show nursing home residents they aren't forgotten @ChilliGaz https://t.co/BYb71K4wK2","date":"Tue Apr 14 15:31:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Charity, companies make medical masks for frontline workers @Local12 https://t.co/PjHn8keCMr","date":"Tue Apr 14 15:31:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"COVID-19: SON Ministries Food Pantry now offering drive-thru services @Enquirer https://t.co/pX6aR9iKt3","date":"Tue Apr 14 15:31:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Ohio Community Colleges donate ventilators and more than 200,000 PPE items @ClermontSun https://t.co/Cae4fI2uBz","date":"Tue Apr 14 15:31:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Centerpoint Church to provide free meals to community @ChilliGaz https://t.co/vkU3CnixHw","date":"Tue Apr 14 15:31:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"THREAD: We will get better together. Here are a few of the many Ohioans who are stepping up to make a difference in our communities as we battle COVID-19. #GoodNewsOhio","date":"Tue Apr 14 15:31:12 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Coronavirus in Ohio: St. Xavier student creates website for grocery delivery during pandemic @Enquirer  https://t.co/6KdrKqk7JO","date":"Tue Apr 14 15:31:12 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you to all of the Americans across the country who are doing their part in combatting this pandemic. If we keep up the good fight, I know we can get better together. https://t.co/y1MxRa9dXU","date":"Tue Apr 14 14:03:29 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The COVID-19 Telehealth Program, created by the CARES Act, will help providers across Ohio ensure they have the tools and resources necessary to continue aiding patients.\n\nYou can find the FCC COVID-19 Telehealth Program application here: https://t.co/dd4iCI1Dl1","date":"Mon Apr 13 16:12:49 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The FCC is now accepting applications for the COVID-19 Telehealth Program. The CDC recommends that providers and patients use telehealth during this pandemic to maintain proper social distancing measures, &amp; CMS has given providers additional flexibility to utilize these services.","date":"Mon Apr 13 16:12:49 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Happy Easter! https://t.co/akDGbraH8h","date":"Sun Apr 12 13:00:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If your business is in need of financial assistance, you can find the PPP application here: https://t.co/TJ6m1NO60Q","date":"Sat Apr 11 21:21:39 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Small businesses around the country are already utilizing the Paycheck Protection Program (PPP). Certain members must stop stalling &amp; let Congress fulfill President Trump’s request for additional funding to help small businesses cover their bills &amp; keep employees on the payroll. https://t.co/vnapilOPgG","date":"Sat Apr 11 21:20:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We desperately need plasma donation for patients who have recovered from COVID-19 right now. I’m working with local doctors to raise awareness and recruit eligible donors. You can find critical resources about plasma donation here: https://t.co/mlObJPSuUn https://t.co/yiCCV69vFh","date":"Sat Apr 11 19:41:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It’s clear that the Chinese Communist regime withheld information that could've helped us respond to COVID-19 earlier. The World Health Organization owes us an explanation for why they’ve seemingly covered for China’s lies, &amp; the President is right to question their credibility. https://t.co/KXPs3aYOHO","date":"Sat Apr 11 18:26:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺TUNE IN: I’ll be joining @foxandfriends to discuss the latest on #COVIDー19 and the need for those who have recovered to donate plasma. https://t.co/I793JtSlS6","date":"Sat Apr 11 12:19:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"📺Coming up in the top of the 6 o'clock hour on @FoxBusiness's @EveningEdit with @LizMacDonaldFOX to talk the latest on #COVIDー19.","date":"Fri Apr 10 21:53:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Rural hospitals and clinics are essential to supporting the health &amp; well-being of those in rural communities. \n\nWe must ensure they have access to the financial support outlined in the CARES Act. ⬇️ https://t.co/hc8fq0eqbJ","date":"Thu Apr 09 23:30:05 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨⬇️","date":"Thu Apr 09 14:58:18 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Defeating this coronavirus will take an all-hands-on-deck effort.  #InThisTogetherOhio","date":"Thu Apr 09 14:03:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Wishing all those who are going to be celebrating Passover a meaningful, reflective, and blessed time. https://t.co/Drgu4NCClc","date":"Wed Apr 08 18:36:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨 @HHSGov has awarded more than $4.6 million in grants to Community Health Centers in #OH02 to address #COVIDー19. \n\nRead more:\nhttps://t.co/2tFD8z9Ejt","date":"Wed Apr 08 18:02:16 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you to all the workers continuing to ship much-needed cargo across the country. Your efforts are helping deliver essentials like food, cleaning supplies, medical supplies, and more to individuals and families in need during this health crisis. https://t.co/2feDYiU5eP","date":"Wed Apr 08 16:39:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"FYI: The Department of Homeland Security has extended the deadline for Americans to obtain a REAL ID to October 2021 in light of the coronavirus pandemic. For more information on how to upgrade your license to a REAL ID, visit https://t.co/t3GzEMprJJ.","date":"Tue Apr 07 17:31:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our national response to this #coronavirus has placed a premium on supporting the efforts of states and localities. To that end, Congress appropriated $150 billion in the CURES Act specifically to help state and local governments. 1/2","date":"Mon Apr 06 20:56:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I'm working with my colleagues and local officials to ensure that all cities, including smaller and mid-sized municipalities, get access to their share of that funding. 2/2 https://t.co/FyWfqsHotW","date":"Mon Apr 06 20:56:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great work, Connor! This is another excellent example of Americans getting creative and using their talents to help us overcome this pandemic. #InThisTogetherOhio  via @ChilliGaz https://t.co/tcQ9EjJluy","date":"Sat Apr 04 16:51:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you have any supplies to donate, please contact Governor DeWine’s office at together@governor.ohio.gov.","date":"Sat Apr 04 16:51:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Good work, @ShawneeState, for stepping up to help keep our doctors and nurses safe during the #COVIDー19 pandemic!","date":"Fri Apr 03 22:07:28 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Starting today, small businesses can apply for loans through the #PaycheckProtectionProgram \n \nYou can find the program application here: https://t.co/XNxGLiBfdy\n\nYou can find additional resources regarding the program here: https://t.co/HAviEeWUzr https://t.co/3iHgnOF4wU","date":"Fri Apr 03 15:25:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Be on alert for scammers! No one will contact you directly asking you to sign up for anything or to verify your identity in order to receive your direct relief payments. If you need to communciate with anyone, do it directly at https://t.co/J9ZJuXmyP1","date":"Thu Apr 02 18:21:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to see @ProcterGamble and many other companies stepping up to help! #InThisTogetherOhio #COVIDー19   \nhttps://t.co/9BnnCshcpy","date":"Wed Apr 01 16:02:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#DidYouKnow Census information is used to determine how many seats each state will have in the House of Representatives as well as where to distribute federal funding and resources?\n\nBe sure to complete the 2020 Census at: https://t.co/3CecmePA4W https://t.co/tjHgh7CWgA","date":"Wed Apr 01 15:26:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you to all of the doctors and medical professionals out there on the frontlines of this battle against COVID-19. As a physician, I understand many of the challenges you’re facing and know you’re making a difference. We support you, and we’re praying for you! https://t.co/nj1wC1jZD6","date":"Mon Mar 30 23:14:26 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@OHdeptofhealth offers extensive resources for Ohioans to keep track of this coronavirus in our home state. You can see the most recent data breakdown on the COVID-19 dashboard here: https://t.co/VhzQAcQ4Hd","date":"Mon Mar 30 19:30:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Glad to see the private sector stepping up to help! Portsmouth based shoelace manufacturer Sole Choice is making bands for these masks. #InThisTogether","date":"Sat Mar 28 17:01:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Here are a few simple ways, in addition to social distancing, that you can keep yourself and others from getting COVID-19. Stay safe and healthy, everyone! #InThisTogetherOhio https://t.co/L4iMGMLmvD","date":"Thu Mar 26 16:58:36 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Remember, we’re all #InThisTogetherOhio. https://t.co/4srVOUqJLX","date":"Wed Mar 25 20:33:46 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#InThisTogetherOhio","date":"Wed Mar 25 19:34:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"During times of turmoil, it is critical that we unite, hold onto our humanity, and pull together – not apart. My latest in the @Enquirer on COVID-19.   https://t.co/afr2Fr5oEE","date":"Wed Mar 25 18:27:10 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#InThisTogether https://t.co/ElSLGu2PZ1","date":"Wed Mar 25 16:07:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Farmers and ag workers are important pillars in our great state of Ohio. Today, on #NationalAgDay, we thank hard-working farmers for feeding our families and friends and for their contributions to our nation’s robust food supply chain, especially during this coronavirus pandemic.","date":"Tue Mar 24 19:05:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We all have a part to play in stopping the spread of COVID-19 and it’s critical we have accurate information. Stay up to date with the CDC’s detailed resources and tips to keep ourselves and others safe from COVID-19. https://t.co/xpIYcPDya3","date":"Tue Mar 24 15:54:24 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You can find a list of government resources to help during this COVID-19 outbreak here: https://t.co/w4Lj0MEcRt","date":"Mon Mar 23 16:42:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Agencies at the federal, state, and local levels are working to support individuals, families, and small businesses through challenges during this coronavirus epidemic. We are all #InThisTogether.","date":"Mon Mar 23 16:41:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great news: “The Food and Drug Administration approved the first coronavirus test that can be conducted entirely at the point of care for a patient — and deliver results in 45 minutes.” https://t.co/B7vxJu6ZI8","date":"Sat Mar 21 17:11:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/apIXzdkGVY","date":"Fri Mar 20 14:52:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The ugliest of times bring out the best in Americans. Thank you to everyone who is working around the clock to keep us safe and healthy. #InThisTogether","date":"Thu Mar 19 20:58:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"https://t.co/V6kQ7P7yiU","date":"Thu Mar 19 14:37:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"There’s no country in the world that I’d rather be in than the United States of America! #InThisTogether 🇺🇸","date":"Wed Mar 18 17:06:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The administration has implemented travel restrictions for foreign nationals to help protect American citizens from coronavirus infection. For more information on the travel restrictions, you can visit, https://t.co/T5wMplqISw. https://t.co/As1osSGU4k","date":"Wed Mar 18 17:03:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#GodBlessAmerica 🇺🇸","date":"Wed Mar 18 15:49:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Glad to see @DeptofDefense stepping up to help in the #CoronavirusResponse: \n\nhttps://t.co/GTpjvQbLdw","date":"Tue Mar 17 21:36:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"⬇️ EVERYONE needs to do their part to #SlowtheSpread","date":"Tue Mar 17 19:13:19 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨Important Tax Update🚨\n\nBecause of the financial strain that this coronavirus has put on many Americans, the Treasury Department will permit certain individuals and businesses to defer tax payments without interest or penalties.\nhttps://t.co/hfVryecukt","date":"Tue Mar 17 18:38:24 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Read the latest from the @gopdoccaucus on this #CoronavirusOutbreak: https://t.co/ok6TCmEKvn","date":"Tue Mar 17 15:07:05 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Limiting your contact with large groups of people can help save lives down the line. We all have a part to play in limiting the spread of the #CoronavirusOutbreak. https://t.co/JDGNiYRATl","date":"Tue Mar 17 13:51:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"THIS⬇️","date":"Mon Mar 16 22:08:44 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Together, we can stop the spread of this #CoronavirusOutbreak. The administration and @CDCgov  released updated guidance on what we all can do. https://t.co/0V9bnuImo5","date":"Mon Mar 16 20:45:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This is great news! \n\nAmerican innovation &amp; entrepreneurship are prime examples of why there's no country in the world I'd rather be during this pandemic than the 🇺🇸!","date":"Mon Mar 16 19:59:30 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Latest update on #COVID19 from @GovMikeDeWine ⬇️","date":"Mon Mar 16 18:10:25 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@RepJoshG and I agree that it's important that we come together as a nation to help flatten the curve of the COVID-19 outbreak. This isn’t a partisan issue.","date":"Mon Mar 16 14:07:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our day-to-day lives may look different for a little while, but it’s important that we all do our part to keep ourselves and each other healthy as this pandemic plays out. https://t.co/XbzynKCn82","date":"Mon Mar 16 14:06:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"⬇️#COVID19OhioReady","date":"Mon Mar 16 13:52:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Please join in asking God to provide healing to those infected by this coronavirus and wisdom for all on this #NationalDayOfPrayer https://t.co/AFTsUJpDKZ","date":"Sun Mar 15 16:28:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As we continue addressing this new coronavirus, there’s no country I’d rather be in than in the US. We have lots of bright scientists and medical professionals at the CDC and other state and federal agencies who capable of handling this pandemic, and it’s critical we stay calm.","date":"Thu Mar 12 20:34:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I encourage everyone to take precautions as if we were all carrying the virus—wash our hands, cover our mouths when we cough or sneeze, and avoid large group gatherings whenever possible. These actions can help keep ourselves and others safe from infection.","date":"Thu Mar 12 20:34:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ICYMI: I joined Bill Hemmer on FOX News this afternoon to share tips for staying safe and discuss my perspective on COVID-19. https://t.co/fRYmQmHP1u","date":"Thu Mar 12 20:34:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Joining @BillHemmer on @FoxNews shortly. Be sure to tune in 📺 https://t.co/cKG8qAXXmU","date":"Thu Mar 12 18:56:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The @CDCgov and @OHdeptofhealth continue to share up-to-date information regarding COVID-19, which you can find here:\nhttps://t.co/BBUIqpcyIZ\nhttps://t.co/yetFXGMyTq","date":"Thu Mar 12 14:29:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Please use normal flu season precautions, especially if you are traveling at this time. It is important to cover your mouth while coughing and sneezing, avoid touching your face and eyes, and wash your hands with soap and water for a full 20 seconds.","date":"Thu Mar 12 14:29:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"UPDATE: Out of an abundance of caution, all @visitthecapitol, @WhiteHouse, Treasury, &amp; Pentagon tours have been cancelled for the time being. I apologize for the inconvenience. Please don't hesitate to contact my office if you have any questions.","date":"Thu Mar 12 14:29:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Well said, @RepChrisStewart!","date":"Wed Mar 11 21:08:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You can also find up-to-date information from the @OHdeptofhealth regarding this coronavirus here: https://t.co/RzgVIzN70f","date":"Wed Mar 11 15:45:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It is important that we continue taking regular flu season precautions. If you do start experiencing symptoms associated with COVID-19, you can reach licensed nurses and infectious disease experts from 9:00am to 8:00pm daily at 1-833-4-ASK-ODH (1-833-427-5634).","date":"Wed Mar 11 15:45:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Currently being briefed by @SecAzar in HHS's \"Coronavirus Command Center\" about ongoing efforts to combat the spread of the virus. https://t.co/OCRbNjIQgM","date":"Tue Mar 10 14:29:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Ohioans should not panic, but we should continue taking precautions.”","date":"Mon Mar 09 20:56:05 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congress passed, and the President signed, a bill providing an additional $8.3 billion to fight the spread of this coronavirus last week, and I am working to ensure that Ohio gets access to its share of those resources.","date":"Mon Mar 09 20:56:05 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My statement regarding the three positive COVID-19 cases that were confirmed in Cuyahoga County today:\n\n“Protecting Ohioans' health and safety remains my top priority. I will continue coordinating efforts with federal, state, and local officials.","date":"Mon Mar 09 20:56:04 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"While the risk of infection remains low in Ohio, It’s important to know what symptoms of COVID-19 to look for if you’re feeling ill. We’re seeing that patients with COVID-19 experience fever, shortness of breath, or sever coughing. https://t.co/m3fECkN8jN","date":"Mon Mar 09 18:14:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Please contact your doctor if you’re experiencing these symptoms. For more information, call the Ohio Department of Health’s call center at 1-833-4-ASK-ODH (1-833-427-5634).","date":"Mon Mar 09 18:14:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"PSA: The Ohio Department of Health (ODH) is operating a call center specifically to answer questions regarding this new coronavirus. You can reach licensed nurses and infectious disease experts from 9:00am to 8:00pm daily at 1-833-4-ASK-ODH (1-833-427-5634).","date":"Fri Mar 06 21:22:26 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As a reminder, while there have been no confirmed cases of COVID-19 in Ohio, I still encourage everyone to follow standard flu season protection protocol. You can find regular updates on this virus at https://t.co/RzgVIzN70f","date":"Fri Mar 06 21:22:26 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨🚨🚨","date":"Fri Mar 06 16:35:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The labor market turned in another strong showing in February as employers added 273,000 jobs…” Great economic news this morning as American businesses add more jobs than expected and the unemployment rate drops back down to a record breaking 3.5%. https://t.co/kXnHMgas1A","date":"Fri Mar 06 14:22:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You can find more information on this coronavirus at: https://t.co/HlcAY0D21b","date":"Thu Mar 05 15:06:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"COVID-19 is an emerging virus, and many Ohioans have questions about how to detect and treat it. Please help us educate the public by sharing these resources from the @CDCgov with your family and friends. https://t.co/QfSU1ic2jf","date":"Thu Mar 05 15:06:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My statement on voting for the #coronavirus funding bill: https://t.co/bhJ9fsNaRP","date":"Wed Mar 04 22:04:46 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"America needs Congress to come together &amp; pass a CLEAN funding bill to stop the further spread of this coronavirus. We can’t hold this up by attaching it to FISA reauthorization or partisan drug control measures. Speaker Pelosi, stop playing politics with our public safety!","date":"Wed Mar 04 17:10:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It was great meeting with @AIPAC representatives today. America has a long-lasting friendship with Israel, and we must continue to stand firmly with our allies. https://t.co/rVv1iJtQnU","date":"Tue Mar 03 20:19:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@RepDanCrenshaw is exactly right: We don't have to destroy the economy in order to reduce carbon emission. \n\nMy bill w/ @RepDavid to expand &amp; make permanent the 45Q carbon sequestration tax credit will help America remain a global leader in innovation. https://t.co/IhhdUSnuw8","date":"Tue Mar 03 19:59:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Companies like Nehemiah Manufacturing are bringing hard-to-hire individuals back into the workforce, giving a second chance to those with criminal records who would be invisible to other companies.","date":"Tue Mar 03 17:22:51 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Tax reform and the pro-growth agenda help companies like these succeed and help spread inclusive capitalism to more cities in Ohio and towns all across this country.","date":"Tue Mar 03 17:22:51 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In Ohio, we are seeing the impact of Republican economic policies firsthand—especially on low-income Americans. From 2017-2019, wages for the bottom ten percent of wage earners have increased at an unprecedented rate.\nhttps://t.co/zOJQtIN35y","date":"Tue Mar 03 17:22:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I have heard from many Ohioans who are concerned about this new COVID19 coronavirus and have lots of questions about how to stay safe. Here is a very helpful video from the Attending Physician of the United States Congress that answers some frequently asked questions.","date":"Mon Mar 02 16:27:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"There is no need to panic, but it is important that we all continue taking normal flu season precautions, like covering our mouths while coughing and sneezing and washing our hands. https://t.co/x1NsyVqNpj","date":"Mon Mar 02 16:27:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Rural Ohioans too often do not have adequate access to broadband in their areas. Yesterday’s @FCC’s vote on TV white space technology is a positive step toward delivering broadband solutions and bridging the digital divide for those in rural Ohio. https://t.co/rncsy3AK4x","date":"Sat Feb 29 15:10:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ICYMI: This morning, I joined Maria Bartiromo on Fox Business to discuss this coronavirus and FISA reform. https://t.co/z2Hi852nJa","date":"Fri Feb 28 18:14:24 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Tune in to @MariaBartiromo! @FoxBusiness https://t.co/kHY0YdS00I","date":"Fri Feb 28 12:01:42 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Looking forward to it! ☀️☕️","date":"Fri Feb 28 00:43:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"Bill would aid Gold Star families\" via @TheTimesGazette https://t.co/nvsC4pearY","date":"Thu Feb 27 23:55:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ICYMI: I joined Fox Business this afternoon to discuss the latest updates with this coronavirus and why Americans need to remain cautious and shouldn’t panic as we prevent further spread of the outbreak. https://t.co/fE17cUMHcG","date":"Thu Feb 27 23:19:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Coming up soon on @FoxBusiness with @DavidAsmanfox to talk #coronavirus https://t.co/VR5kHLqi6H","date":"Thu Feb 27 22:01:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I was proud to support @MarioDB's resolution today. As President Ronald Reagan famously said, “Freedom is never more than one generation away from extinction.\" We must continue to speak out boldly against socialism and communism.","date":"Thu Feb 27 21:24:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@RepLizCheney is 💯 right. Socialism doesn’t work. It’s the promise of a palace that is really built on quicksand.","date":"Thu Feb 27 15:42:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"America’s Phase One trade agreement with China is a major win for Ohio farmers, businesses and innovators as we look to expand exporting “Made in America” products. I caught up with @SpectrumNews1OH today to discuss our Ways &amp; Means Committee hearing on this important topic. https://t.co/exHjP2gvBh","date":"Thu Feb 27 00:38:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As I read through news coverage of the #BornAliveAct, I was disgusted that some outlets drew a distinction between \"a fetus that was born following an attempted abortion\" &amp; a \"newborn baby.\"\n\nHere's a good read about media bias and this critical topic via @dcexaminer:","date":"Wed Feb 26 22:40:32 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Congratulations, Tristan! Ohio is cheering for you-- make us proud.","date":"Wed Feb 26 20:22:26 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Under the Phase One agreement, we will expand our trade with China—a major step for our exporters selling \"Made in America\" products and services in China.","date":"Wed Feb 26 19:03:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Unlike prior agreements that ended in empty promises, Phase One ensures China delivers on promises made by containing a first of its kind enforcement mechanism.","date":"Wed Feb 26 19:03:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"These commitments will help our farmers, manufacturers, and innovators compete on a more level playing field.","date":"Wed Feb 26 19:03:17 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Phase One agreement with China contains critical structural reforms, including currency, forced technology transfers, intellectual property protection, and removing barriers to our great American agricultural products.","date":"Wed Feb 26 19:03:16 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You can read about our efforts here: https://t.co/BKIyUiWPL1","date":"Tue Feb 25 21:54:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m pleased to share that the House just unanimously passed legislation that I’ve been working on with @RepCheri https://t.co/pNcWixlcnc","date":"Tue Feb 25 21:54:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"We owe our servicemembers a debt of gratitude that extends to their spouses &amp; children as well. When a member of our military pays the ultimate sacrifice or is catastrophically injured, their loved ones need the flexibility to be able to move closer to family for care &amp; support. https://t.co/Kvb3RnCtba","date":"Tue Feb 25 21:54:21 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"On a serious note, best wishes to all those celebrating Mardi Gras tonight. I wish you a meaningful Lenten season.","date":"Tue Feb 25 18:48:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@SteveScalise thank you for the king cake, my staff was especially grateful. Finally found another use for my Ka-Bar knife—shout out @USMC! https://t.co/XBVZ8jbuZI","date":"Tue Feb 25 18:48:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Katherine Johnson was a pioneer in her field, playing a crucial role in landing a man on the moon along with a small group of African American women mathematicians.","date":"Mon Feb 24 21:28:18 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Her legacy lives on and her accomplishments at NASA and for the African American community will be remembered for generations to come. My prayers are with her family during this time. #BlackHistoryMonth https://t.co/Uqe8ttNz49","date":"Mon Feb 24 21:28:18 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"As a physician, I believe we should focus on extending one’s health span rather than just one’s life span. I encourage everyone to learn more about the steps you can take to stay heart healthy. Here are some useful resources: https://t.co/BCdHg5luxc https://t.co/6etLUJ8B4w","date":"Thu Feb 20 20:52:41 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"If you or someone you know is interested in attending a U.S. Service Academy, my staff will be joining the offices of @SenSherrodBrown  and @senrobportman man for an informational session at the Symmes Township Library in Loveland regarding the service academy nomination process. https://t.co/SaLRargnIE","date":"Fri Feb 14 16:24:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In 1877, Henry O. Flipper became the first African American man to graduate from West Point and later became the first commissioned black officer in the regular Army.","date":"Fri Feb 14 16:24:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Now, graduating West Point cadets who exhibit \"leadership, self-discipline, and perseverance in the face of unusual difficulties” receive the Henry O. Flipper Award. #BlackHistoryMonth","date":"Fri Feb 14 16:24:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@RepDavid and I introduced legislation to expand the 45Q carbon sequestration tax credits and make them permanent in the federal tax code.","date":"Wed Feb 12 23:30:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Here’s more info on the overall plan via @dcexaminer iner: https://t.co/5OCRiYFjcD","date":"Wed Feb 12 23:30:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"By incentivizing the private sector to invest in new technology, we can continue meeting our climate goals and solidifying America’s role as the leading exporter of climate solutions. https://t.co/4DPYVwOnYA","date":"Wed Feb 12 23:30:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to be join @GOPLeader in rolling out Phase One of @HouseGOP's Environmental Plan: Carbon Sequestration. https://t.co/ycd4XubRYI","date":"Wed Feb 12 23:30:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This morning, I spoke about the work we’re doing on the task force to improve the access, quality, and cost of health care in our rural areas at @ruralhealth\n31st Annual Rural Health Policy Institute Summit. I am grateful to accept the NRHA’s 2020 Legislative Award. https://t.co/f2cBwJCk9s","date":"Wed Feb 12 19:32:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"One of my biggest priorities is making sure rural and underserved communities have access to quality doctors. Yesterday, my colleagues and I on the bipartisan Ways and Means Rural and Underserved Task Force met to discuss solutions to address rural health issues.","date":"Wed Feb 12 19:31:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thanks for inviting me to speak and for all you do for rural communities!","date":"Wed Feb 12 16:08:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"According to NFIB, small business owners remain optimistic about our economy. We must protect these pro-growth policies that have given us a strong economy and ensure continued success. https://t.co/HtorI7Wxh8","date":"Tue Feb 11 16:23:09 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"For the last two years, tax cuts have helped Americans rebuild our economy and strengthen our nation. Tax reform has increased savings for individuals and small businesses across America, and it continues to pave the way for future prosperity.","date":"Tue Feb 11 16:23:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I'm proud to be a part of this bipartisan effort to protect families from surprise medical bills! https://t.co/hfzq5RSk6X","date":"Mon Feb 10 16:50:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I am proud to know Lt. Gen. West and am honored to have worked with her. #BlackHistoryMonth https://t.co/Vee6qMj3Dp","date":"Mon Feb 10 14:46:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Lt. Gen. Nadja West made history when she became the first black surgeon general of the U.S. Army in 2015 in addition to being named the first black female major general of the Army's active component and Army Medicine's first African American female two-star general.","date":"Mon Feb 10 14:46:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Here is another important update from Acting Homeland Security Deputy Secretary Cuccinelli on our nation’s efforts to contain this new coronavirus outbreak: https://t.co/Wf6AlUJK2E","date":"Sat Feb 08 17:34:37 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"“Employers added 225,000 jobs in January and the jobless rate was 3.6%, signs that the U.S. labor market is positioned to fuel economic growth in 2020. Wages increased 3.1% from a year earlier…” Great economic news from today’s jobs report! https://t.co/ggBZooywth","date":"Fri Feb 07 14:37:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨🚨🚨","date":"Fri Feb 07 14:33:19 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Another terrorist brought to justice. I’m grateful to our brave service members who conducted this operation, and I commend President Trump for his decisive leadership.","date":"Fri Feb 07 03:31:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Thank you for your dedicated service to our great nation! https://t.co/knWXAJlChL","date":"Thu Feb 06 15:13:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It was an honor to meet two of the U.S. Army’s famed Merrill’s Marauders, Gilbert Howland and Bob Passanisi. During World War II, Howland, Passanisi, and the rest of the 5307th Composite Unit displayed exemplary courage and perseverance in the South-East Asian theatre.","date":"Thu Feb 06 15:13:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#CaseClosed https://t.co/GtMod9bng9","date":"Wed Feb 05 21:47:01 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"My statement on @POTUS's #SOTU Address: https://t.co/YElQH60MOb","date":"Wed Feb 05 03:39:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The best is yet to come! God bless the United States of America! #SOTU","date":"Wed Feb 05 03:25:11 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@POTUS: \"We settled the new world, we built the modern world, and we changed history forever by embracing the eternal truth that everyone is made equal by the hand of Almighty God.\" #SOTU","date":"Wed Feb 05 03:24:03 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Welcome home, Sergeant Williams!","date":"Wed Feb 05 03:22:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"It's vital that we support military families! RT if you agree! #SOTU","date":"Wed Feb 05 03:18:53 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@POTUS: \"Our message to the terrorists is clear:  You will never escape American justice.  If you attack our citizens, you forfeit your life!\"","date":"Wed Feb 05 03:16:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@POTUS: \"Every day, America's men and women in uniform demonstrate the infinite depths of love that dwells in the human heart.\" #SOTU","date":"Wed Feb 05 03:13:13 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@POTUS: \"In America, we celebrate faith.  We cherish religion. We lift our voices in prayer, and we raise our sights to the Glory of God!\" #SOTU","date":"Wed Feb 05 03:07:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":".@POTUS: \" The United States of America should be a sanctuary for law-abiding Americans -- not criminal aliens!\" #SOTU","date":"Wed Feb 05 03:02:35 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I agree — we must rebuild America's infrastructure! #SOTU","date":"Wed Feb 05 02:58:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@POTUS is absolutely right: Every child is a sacred gift from God! RT if you support ending late-term abortion of babies! #ProLife #SOTU","date":"Wed Feb 05 02:55:27 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@POTUS: With unyielding commitment, we are curbing the opioid epidemic -- drug overdose deaths declined for the first time in nearly 30 years.  Among the States hardest hit, Ohio is down 22 percent. #SOTU","date":"Wed Feb 05 02:49:20 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Proud to have Hamilton County Heroin Task Force Commander, Tom Fallon, as my guest tonight. He is on the ground everyday helping fight the opioid epidemic! #SOTU","date":"Wed Feb 05 02:48:07 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@POTUS: \"We will never let socialism destroy American healthcare!\" #SOTU","date":"Wed Feb 05 02:43:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@POTUS: \"The American patient should never be blindsided by medical bills.\" RT if you agree! #SOTU","date":"Wed Feb 05 02:42:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@POTUS: \"The people are the heart of our country, their dreams are the soul of our country, and their love is what powers and sustains our country.  We must always remember that our job is to put America first!\" #SOTU","date":"Wed Feb 05 02:35:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@POTUS: \"To safeguard American Liberty, we have invested a record-breaking $2.2 trillion in the United States Military.  We have purchased the finest planes, missiles, rockets, ships, and every other form of military equipment -- all made in the United States of America.\" #SOTU","date":"Wed Feb 05 02:30:33 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#USMCA is a HUGE win for Ohio! I was proud to be a part of getting it across the finish line. #PromisesMadePromisesKept #SOTU","date":"Wed Feb 05 02:24:19 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great to see @POTUS recognize Cincinnati's Tony Rankin in #SOTU address tonight. Read more about him here via @WLWT: https://t.co/fWYELOOGcD","date":"Wed Feb 05 02:19:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@POTUS: \"Veterans unemployment rate has dropped to an all-time low.\" #PromisesMadePromisesKept #SOTU","date":"Wed Feb 05 02:15:34 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@POTUS: \"The state of our union is stronger than ever before!\" RT if you agree!","date":"Wed Feb 05 02:11:50 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Click to read more about the task force: https://t.co/tsmz6DZoZU","date":"Tue Feb 04 18:58:00 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I’m proud to share that Tom Fallon, Commander and a founding member of the Hamilton County Heroin Task Force will be joining me as my guest in the House Chamber. Tom plays a critical role in battling opioid addiction and saving lives in Ohio. https://t.co/MIevtvgIEk","date":"Tue Feb 04 18:57:59 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Tonight, President Trump will deliver his third State of the Union address. I expect him to highlight our booming economy, efforts in strengthening national security, successes in combatting the opioid epidemic, and more.","date":"Tue Feb 04 18:57:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Out of the goodness of his heart, Clermont Sun Editor @brett_milam recently donated one of his kidneys to a stranger in need. I applaud Brett for his selfless act of kindness that gave a new lease on life to someone in need. https://t.co/sbFLyNDyCA","date":"Fri Jan 31 16:21:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Via @WDTN : \"Several local and state leaders submitted a letter to the NCAA this week in support of the University of Dayton hosting the First Four in the years 2023, 2024, 2025, and 2026.","date":"Fri Jan 31 14:22:48 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Rep. Mike Turner, Sen. Rob Portman, and Sen. Sherrod Brown along with Reps. Steve Chabot, Warren Davidson, Marcia Fudge, Bill Johnson, David Joyce, Marcy Kaptur, Robert Latta, and Brad Wenstrup all signed off on the letter.\" https://t.co/XgYWu1zs6B","date":"Fri Jan 31 14:22:48 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"\"The biggest winners from the passage of #USMCA, he said, will be the farmers that he referred to as 'the true patriots' who endured much of the trade challenges and uncertainties that led up to the new agreement.\" via @TheTimesGazette https://t.co/G2NfEHdn11","date":"Thu Jan 30 22:33:23 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"ICYMI: I spoke with @FOX19 to talk about the positive impacts #USMCA will have on Ohioans – especially our farmers. https://t.co/XpUzUx3Bvs","date":"Thu Jan 30 15:24:44 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Rep. Wenstrup joins President Trump at White House for USMCA signing ceremony via @highlandcopress https://t.co/nFEV4sIPz7","date":"Thu Jan 30 14:23:55 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"🚨BREAKING🚨 ⁦@realDonaldTrump⁩ ⁦@POTUS⁩ just signed the #USMCA into law! #PromisesMadePromisesKept https://t.co/AyJyoTpLqN","date":"Wed Jan 29 16:53:49 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"#USMCA includes important provisions to ensure American innovators are able to do business in Canada and Mexico, while protecting them from intellectual property theft. With the USMCA, America will cement its place as the global leader in the digital economy. https://t.co/lVO8CmCCXC","date":"Wed Jan 29 16:40:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The #USMCA is a big win for SW Ohioans! I'm proud to represent them at the @WhiteHouse for this historic event! #PromisesMadePromisesKept https://t.co/jVlClFiEGj","date":"Wed Jan 29 16:18:11 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"You can tune in live to watch @realDonaldTrump sign the #USMCA here: https://t.co/qUZrryBxBP https://t.co/9d9IpopbJW","date":"Wed Jan 29 15:53:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Consumer behavior looks a lot different today than it did 25 years ago when our current trade agreement was established. The #USMCA modernizes &amp; improves our North American trade relationships to ensure American exporters &amp; importers can thrive in a growing, 21st-century economy.","date":"Wed Jan 29 15:50:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Just arrived at the White House to join @realDonaldTrump @POTUS for #USMCA signing. #PromisesKept https://t.co/b0QwtRROsd","date":"Wed Jan 29 15:30:53 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Ohio is the 12th-largest agricultural exporting state. The #USMCA will help Ohio farmers grow and compete in the global trading market by reducing the use of unfair trade-distorting policies and opening up new opportunities to sell products like poultry and dairy in Canada. https://t.co/1P9LeHFQZV","date":"Wed Jan 29 15:28:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"In 2018, Canada and Mexico were the top two markets for Ohio exports. The #USMCA will expand markets for American businesses and boost our Buckeye economy by improving our trade relationships with our North American neighbors. https://t.co/apIkOdVWo3","date":"Wed Jan 29 14:32:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"I applaud President Trump for his leadership and hope this proposal for peace between Israelis and Palestinians will reopen negotiations between the groups and, ultimately, result in stability in the region as well as safety for all who live there.","date":"Tue Jan 28 22:48:08 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Tomorrow, the President will sign the USMCA into law and deliver a much-needed update to our current North American trade deal. Trade with Mexico and Canada supports 428,400 jobs in Ohio, and USMCA will add an additional 176,000 jobs throughout America.","date":"Tue Jan 28 19:14:46 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"On this #InternationalHolocaustRemembranceDay, we honor the memories of the millions of victims who were persecuted &amp; killed by the Nazi Regime. Let's use this solemn day to reaffirm our commitment to fighting against anti-Semitism, persecution, &amp; discrimination across the world. https://t.co/2hewka7K5K","date":"Mon Jan 27 16:11:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Rest in peace and may the Lord be with you.\n\nThe Kobe Bryant family and the families of the other victims are in my and Monica’s prayers. \n\nMay God grant them all peace and healing during this incredibly difficult time.","date":"Mon Jan 27 01:53:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Todd Portune was a devoted public servant and a fixture of Hamilton County politics for many years. My relationship with Todd centered around trust &amp; respect. I am grateful for his many years of service, and I am saddened by his passing. Todd’s family &amp; friends are in my prayers.","date":"Sun Jan 26 13:18:31 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Today will point out the glaring “errors and omissions” from Schiff and the house managers, similar to the deceitful way the FBI did in the FISA court.","date":"Sat Jan 25 16:26:22 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Every human life is precious, and we must protect it—at all stages. If we as a society start to value one life over another, we will most certainly abandon our humanity. I stand with all those who choose to defend the lives of the unborn. https://t.co/GMdarFsk7U","date":"Fri Jan 24 14:41:26 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The Phase One agreement is a big step toward establishing fair trade practices with China. It will help our farmers, workers, &amp; businesses by pushing back on Chinese currency manipulation, strengthening American intellectual property rights, &amp; reducing unfair trade barriers. https://t.co/ZQRaTUEk7Q","date":"Thu Jan 23 17:54:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great news for Ohio manufacturers, farmers, workers, and more. USMCA is on its way to the White House for signing. https://t.co/FW6cwPgxVS","date":"Wed Jan 22 18:42:57 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great read in the @WSJ by @RepDougCollins as the Senate impeachment trial begins. https://t.co/1z4pXJP2gc","date":"Tue Jan 21 18:06:56 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"The President continues to secure better trade deals with our global trading partners. Click to read my full statement on the signing of the Phase One trade agreement with China yesterday. \nhttps://t.co/deTGc4bwEC","date":"Thu Jan 16 14:55:45 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"To doubt the reasoning behind the airstrike against Soleimani is an insult to every American who has sacrificed their life in defense of this nation. https://t.co/hfvHZn9A0c","date":"Wed Jan 15 17:39:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"killed and maimed. Like Rep. Mast, I served with some of the individuals whose names are etched on the wall honoring the fallen from the war on terror.","date":"Wed Jan 15 17:39:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"@RepBrianMast, a Congressman from Florida who lost both of his legs fighting in the war on terror, hits the nail right on the head. General Soleimani orchestrated attacks against American soldiers for decades, and his killing delivers long overdue justice for those Americans...","date":"Wed Jan 15 17:39:06 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Great news as the U.S. added 145,000 more jobs in December. https://t.co/CfxFnNQFCz","date":"Tue Jan 14 19:29:15 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Senator Arthur Vandenberg famously said, “politics stops at the water’s edge.” I’m sad to see that’s no longer the case. \n\nProtecting the American people is the president’s responsibility and within his authority.","date":"Fri Jan 10 02:11:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Declaring it all out war is a different situation; President Trump stated he acted to prevent a war, not start one.","date":"Fri Jan 10 02:11:40 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Instead of working for the American people, House Democrats spent today passing a political stunt to try to undermine the Commander in Chief’s legal authorities. This resolution cannot have the force of law, but it serves to embolden our enemies.","date":"Fri Jan 10 02:11:39 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Our nation’s law enforcement officers and first responders risk their lives to protect our communities and keep our loved ones safe. Today, on National Law Enforcement Appreciation Day, we recognize the hard, and often dangerous, work these men and women do on behalf of us all. https://t.co/ZzpGy4ZXsJ","date":"Thu Jan 09 16:29:52 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Click below to hear my interview with Brian Kilmeade after President Trump's address on Iran. https://t.co/qDaUlaLgRM","date":"Wed Jan 08 19:40:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Live now on the Brian @kilmeade Show with reaction to President Trump’s remarks.","date":"Wed Jan 08 16:44:44 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Click to read my op-ed, highlighting the benefits of USMCA and the importance of delivering this win for America, published in the Washington Examiner this morning. https://t.co/K7SvnK7xR9","date":"Tue Jan 07 14:45:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Last month, the House passed USMCA. Our farmers, manufacturers, and workers are so close to finally having a trade agreement that modernizes North American trade, boosts our economy, and strengthens our nation’s role in the global trading market.","date":"Tue Jan 07 14:45:58 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Looking forward to joining you today","date":"Mon Jan 06 19:13:14 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"This morning I spoke with Maria Bartiromo about President Trump’s decision to authorize the strike against Soleimani. https://t.co/ZSc8hUHJh5","date":"Mon Jan 06 17:08:43 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"When I was in Iraq, we had forensics to show who was orchestrating attacks and killing our men—and it was Soleimani. Click below to watch my interview on America’s Newsroom regarding today’s airstrike and Soleimani’s death. https://t.co/jf8UC7TdEc","date":"Fri Jan 03 20:04:54 +0000 2020","user_id":"518644221"},{"handle":"RepBradWenstrup","text":"Catch me on America’s Newsroom this hour.","date":"Fri Jan 03 16:01:00 +0000 2020","user_id":"518644221"}]