[{"handle":"RepBarryMoore","text":"Want evidence the sham J6 select cmte is pursuing a narrative regardless of the facts? Look no further than its continued attacks on @RepLoudermilk even after their ridiculous allegations against him were discredited by the @CapitolPolice. The entire cmte owes him an apology.","date":"Thu Jun 16 19:29:08 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I'm glad we passed a bill increasing security for #SCOTUS Justices, but why did @SpeakerPelosi hold this bill up for weeks after unanimous Senate passage? We should have acted immediately after the assassination attempt on Kavanaugh. And why did 27 House Dems oppose this bill?","date":"Tue Jun 14 21:54:48 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Watch @OANN in the 5pm hour for my discussion with @AddisonSmithOAN on the latest from Washington, including new efforts on the Hill to restrict your 2nd Amendment rights.","date":"Tue Jun 14 21:47:44 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It's not Vladimir Putin's strength. It's Joe Biden's weakness.\n\ncc: @KJP46","date":"Tue Jun 14 21:34:25 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Drug cartels are essentially detonating WMDs in our communities with the amount of fentanyl deaths they are causing. American families deserve better than Biden's border lawlessness.\n\nProud to sponsor @RepBoebert's \"Fentanyl is a WMD Act\" to get the admin to address this crisis. https://t.co/XNrMgkUuIV","date":"Tue Jun 14 19:53:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"⛽ Americans are now paying on average over $5.00 per gallon nationally – for the first time in history.\n\nWhat record will President Biden break next?","date":"Tue Jun 14 14:54:15 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"When you can’t miss a vote but have to call in to The @Yaffee Program https://t.co/ciG3U7arfD","date":"Fri Jun 10 20:50:48 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The American people want true leaders who will work for them both on- and off-camera. And they won’t be fooled by mainstream media propaganda, special effects, or dazzling script editing by Washington elites. Read my op-Ed on tonight’s “hearing” here: https://t.co/fPmObaTPO5","date":"Thu Jun 09 21:36:09 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Have Democrats ever held a prime time hearing on record inflation? The border crisis? Jimmy Carter-level energy prices?","date":"Thu Jun 09 16:47:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Hey folks! We're hosting a town hall Friday, June 10th at the Coffee County Republican Headquarters in Enterprise at 6:30 PM. Hope you join us! The movie “2,000 Mules” will be shown for free! https://t.co/ZwlyPQwLZ8","date":"Thu Jun 09 16:44:33 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"A single working mother desperate for formula can’t feed her child with a @SpeakerPelosi subpoena.","date":"Thu Jun 09 13:19:05 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wow! Powerful testimony from a mother who lost a son to violent crime. #2A","date":"Thu Jun 09 12:43:44 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Unhinged pro-abortion activists are so hell-bent on murdering unborn children that they tried to murder a SCOTUS Justice.\n\nThis is weeks after Jen Psaki stated Joe Biden's position that harassment at Justices' homes should continue.\n\nPresident Biden, do you stand by this?","date":"Wed Jun 08 15:43:49 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The courage displayed 78 years ago today on the shores of Normandy will never be outmatched. Never forget the bravery and sacrifice of the heroes of #DDay. And never forget what they fought and died for. https://t.co/OEfbqbBrpF","date":"Mon Jun 06 14:27:54 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In the last year, President Biden’s policies have wrecked havoc on our farmers, and now fuel prices are hitting our farmers hard. As production costs raise for farmers, the cost of groceries will likely go up too. \n\nBiden is making Americans pay more for gas every day.","date":"Thu Jun 02 14:03:07 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"4,000 illegal immigrants crossed the southern border over Memorial Day weekend. It's clear that the Biden admin has no plans of securing the border. Drug cartels, human traffickers, and illegal immigrants will continue to exploit our border. \n\nhttps://t.co/9EoGH6Y1GW","date":"Tue May 31 17:41:17 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On this Memorial Day, never forget the men and women who made the ultimate sacrifice to protect our freedom. God bless these heroes and their families.\n\nLand of the free BECAUSE of the brave. https://t.co/gzsu5zJ6Ko","date":"Mon May 30 12:12:47 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"As school lets out, families will have to consider the cost of gas before they can go on vacation and visits with friends and family.\n\nWe have to make these tough choices because of President Biden's anti-American energy agenda.","date":"Thu May 26 17:43:03 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"As a veteran and a small business owner, I know our veterans' unique experiences &amp; skillsets often dovetail perfectly with the demands and opportunities of being a franchisee. \n\nI'm proud to introduce a resolution with @RepMikeLevin to honor the 30th anniversary of @VetFranIFA. https://t.co/Exze07ZH2g","date":"Tue May 24 17:57:51 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today the national average is $4.598. \n\nWhile the American people battle crippling prices at the gas pump, we have a president waging war on American energy.\n\nThanks, Joe Biden.","date":"Tue May 24 15:08:55 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This is happening at our southern border every single day. Our border patrol agents are working overtime to protect our border, but illegal immigrants will stop at nothing to cross the border illegally and come into our communities.","date":"Mon May 23 15:44:41 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great news! This decision is a victory for the safety and well-being of the American people but also a sobering reminder of the dangers we face from an America Last administration.","date":"Fri May 20 21:33:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"If Pelosi can use the pandemic to justify continued proxy voting, we can use it to keep Title 42 in place.","date":"Fri May 20 14:48:36 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Fake news organizations, terrorists &amp; dictators are allowed a platform on Twitter, so why is Project Veritas banned?\n\n@elonmusk, can we do something about that?","date":"Thu May 19 21:35:07 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I agree, Coach! With Americans suffering so terribly from inflation, we shouldn't flood our overheated economy with billions of dollars in spending that lacks sufficient oversight mechanisms.","date":"Thu May 19 20:07:53 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I firmly believe that there are two genders. \n\nMale and Female. \n\nThe radical left doesn't. \n\nI joined my GOP colleagues to introduce the Women's Bill of Rights to reaffirm legal protection for women. https://t.co/EvpLdSYPnz","date":"Thu May 19 17:35:52 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I think Biden just found his next Minister of Truth!","date":"Wed May 18 18:27:09 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Under President Biden, drug smugglers and drug cartels have exploited our southern border to bring drugs into our country, killing dozens every single day. \n\nThis is extremely alarming. We need to secure our southern border. \n\nhttps://t.co/GOHsJEjDDK","date":"Wed May 18 17:20:37 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's Ministry of Truth is his most outrageous attempt to crush free speech.\n\nBut the American people don't want to be silenced and fought back, and now the Biden admin appears to be \"pausing\" their effort.\n\nThis is why we fight. Don't let them silence you!","date":"Wed May 18 15:49:37 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Trying to escape high gas prices? There's nowhere left to hide!\n\nGas now tops over $4 a gallon in every U.S. state. Another Biden record!","date":"Tue May 17 20:20:12 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"\"ultra-MAGA\" agenda &gt; Biden's agenda\n\nRT if you agree. https://t.co/NtgCXY8O98","date":"Tue May 17 18:52:00 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In 18 months, President Biden has taken our nation in the wrong direction:\n\n🚨Inflation has hit a 40-year high.\n🚨Border crossings in April hit the highest in history.\n🚨Gas prices reached all-time highs.\n\nOur nation cannot keep going in this direction. We need a leader.","date":"Tue May 17 13:57:54 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"How many illegal immigrants will have to breach our border for the Biden admin to admit that there is a crisis at the border?","date":"Mon May 16 22:14:23 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"A new Pew Research Poll shows around 70% of Americans view inflation as their biggest concern. \n\nEasing the pain in the pocketbooks every American is feeling must be our top priority.","date":"Mon May 16 20:51:54 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Congratulations, Dr. Roberts! I've enjoyed getting to know him, and I know Auburn is in great hands. #WarEagle","date":"Mon May 16 15:26:46 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden is lowering flags to half-staff to mark a million COVID deaths.\nHe should do the same - and more - for the 63 MILLION+ American babies aborted since Roe v. Wade.","date":"Thu May 12 21:31:12 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden admin has no plan for the baby formula crisis but will move mountains to get you a free crack pipe.","date":"Thu May 12 12:48:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Does anyone else remember a few months ago when Americans were forced out of their jobs because they didn't want to take a vaccine?","date":"Wed May 11 19:55:14 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Illegal immigrants are overrunning our border. They will overwhelm our public education systems &amp; public health.\n\nAmerican taxpayers who can't even afford goods for their families will be forced to support 2 million illegal immigrants. \n\nPresident Biden, please put America first!","date":"Wed May 11 15:29:23 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"How can our own president think returning this country to greatness is \"extreme?!\"\n\nBeing \"ultra-MAGA\" should be a requirement for every elected official.","date":"Wed May 11 13:08:24 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our law enforcement officers risk their lives every day to serve our nation. This #NationalPoliceWeek, I want to thank every law enforcement officer and honor over 120 officers that have fallen this year.\n\nI will always #BackTheBlue. https://t.co/xZ9f8kk1I7","date":"Tue May 10 21:15:10 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden cannot hide behind his talking points. Americans across the nation have less money under this administration. Inflation and gas prices are costing the average family $5,000 more this year.","date":"Tue May 10 16:33:04 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨The American people see the direct result of President Biden's anti-American energy policies at the gas pump. \n\nBiden's failed energy policies are hitting drivers right in the wallet. \n\nGas prices in #AL02 today👇 https://t.co/vxdGzqlWlJ","date":"Mon May 09 16:28:37 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden admin's actions are a slap in the face to every law-abiding gun owner, and I will not sit back at let the Democrats' false narratives strip our Second Amendment rights away.\n\nProud to join @RepLisaMcClain to fight for each American's constitutional freedoms.","date":"Mon May 09 16:20:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Small businesses are the backbone of our nation, and I am thankful for all the hardworking small business owners across Alabama. As a small business owner myself, I am proud to support small businesses &amp; I encourage you to stop by your favorite small business &amp; thank them! https://t.co/pYRWJ878kv","date":"Fri May 06 20:18:50 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The only working supply chain in America is at our southern border run by the drug cartels &amp; human smugglers. We need to act now to retake control.\n\n\n➡️Reinstate Remain in Mexico policy.\n➡️Keep Title 42.\n➡️Build the Wall.","date":"Fri May 06 16:12:40 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On this #NationalDayofPrayer, we reflect on the power of prayer that serves as a source of healing, guidance, and strength for so many Americans. In my personal life, prayer has shaped the direction of my life and faith.\n\nMy the Lord Bless our Nation. https://t.co/lPEh3a6t8T","date":"Thu May 05 16:52:45 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Two weeks ago, the Left refused to define a woman, but now they won’t stop talking about a woman's right to choose.\n\nThey continue to flip the script to fit their woke agenda.\n\nI will continue to fight to protect the sanctity of life.","date":"Tue May 03 17:36:57 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The same Democrats and media personalities now accusing Republican-appointed justices of lying to the Senate about Roe just spent weeks fawning over KBJ for the outrageous lie that she didn't know what a woman is.\n\nGive me a break.\n\nThe Left does not care about truth, only power.","date":"Tue May 03 15:41:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The leak from the SCOTUS is incredibly dangerous &amp; destructive. But if authentic, this upcoming decision by the Court could finally bring to a close this country’s tragic &amp; shameful era of widespread &amp; indiscriminate legal termination of the lives of millions of children.","date":"Tue May 03 14:50:39 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"DHS was created after 9/11 to protect Americans from terrorism and other threats.\n\nTwo decades later, its mission is shifting to suppressing the rights of those Americans it was created to protect.\n\nAnd yet Big Government elites and bureaucrats wonder why we don't trust them?!","date":"Mon May 02 21:37:12 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Sec. Mayorkas acknowledges that repealing Title 42 will lead to an even worse surge at our border.\n\nSo why does the Biden admin continue to put illegal immigrants above the safety of the American people? They are rolling out the red carpet for illegals to enter our country.","date":"Mon May 02 17:30:43 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The American people are scared for their safety, prosperity, and future.\n\nMr. President, this is NOT a laughing matter.\n\nRT if you aren’t laughing! https://t.co/tue3GMW7j5","date":"Mon May 02 16:27:57 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We need to lower the tax burden on Americans and their businesses, let them keep more of their money and reduce the regulatory burden so they can compete. Biden's policies are hurting the American people and our small businesses.\nhttps://t.co/a1ZCgjnInI","date":"Fri Apr 29 18:48:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Proud to receive this award from @ACUConservative! \n\nI will continue to fight for commonsense conservative policies and promote fundamental American values in Washington. https://t.co/w00mAvSDaZ","date":"Thu Apr 28 19:52:14 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Fentanyl, drug cartels, human smugglers &amp; potential terrorists are pouring across the border on Joe Biden &amp; Secretary Mayorkas' watch. The admin's surrender at our border is putting countless American lives in danger. We need leadership! Secure the border!","date":"Thu Apr 28 19:28:17 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Is anyone else concerned about Joe Biden?","date":"Thu Apr 28 15:59:03 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden admin is giving the green light to every illegal immigrant to come on in. They are not managing anything. They are creating complete chaos. Insanity.","date":"Wed Apr 27 16:20:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I’m fighting for everyone to have a voice, meanwhile Democrats are having a Chernobyl-level meltdown because *gasp* @elonmusk might end the censure of speech you don't like!\n\nNext year, Republicans will have the House and be fully united to fix the crises your party has created.","date":"Wed Apr 27 15:30:04 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"As a former guardsman, I'm disgusted by the White House's disdain for this hero who fell fighting the Biden administration's own border crisis. Instead of honoring the brave Texas National Guard member Bishop Evan, this is what we get. Shameful! https://t.co/QSIebRVarr","date":"Tue Apr 26 19:22:31 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"A secure border is a compassionate border. Under President Biden's failed policies, drug &amp; human traffickers are overrunning our border.\n\nOur communities are being invaded, and Biden is complicit.","date":"Tue Apr 26 17:05:28 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Secretary Mayorkas and President Biden have given the green light to every illegal immigrant that we don't enforce our border laws.\n\nTheir negligence has endangered every single American citizen.\n\nProud to join my colleagues in sending a letter to Secretary Mayorkas.","date":"Mon Apr 25 19:58:54 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Make free speech free again!\n\nhttps://t.co/d4cc0HHef1","date":"Mon Apr 25 19:40:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden promised to declare war on American energy. And how have things work out? \n\nSkyrocketing gas prices will now cost the average American household an extra $2,000 per year.\n\nSounds about right for Joe Biden's America Last agenda. \n\nUnleash American Energy! https://t.co/wahUqDui0D","date":"Mon Apr 25 18:55:36 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Big Tech silenced conservative voices that challenged the views of their left-wing CEOs.\n\nSpeech isn't truly free if the Left dictates every word.\n\nNow the Left is losing their minds that @elonmusk will allow free speech.","date":"Mon Apr 25 18:09:01 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I'm grateful for companies like @TysonFoods that reinvest in their workers in my district","date":"Mon Apr 25 17:11:38 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This is horrific news. My prayers are with this guardsman's family. As a former guardsman, I want to thank TX National Guard SPC. Bishop E. Evans of Arlington, TX, for his service to our nation during incredibly difficult circumstances.","date":"Mon Apr 25 15:24:16 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Government bureaucrats like Dr. Fauci are desperate for relevancy and continue to wage war against everyday American citizens and their constitutional freedoms.\n\nThe three branches of government according to Dr. Fauci: legislative, executive, and the CDC.","date":"Fri Apr 22 19:15:48 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I firmly believe biological men have no place in women's sports. I will continue to fight against woke liberals and organizations like the NCAA that are forcing a radical transgender agenda on the American people and women's sports.\n\nhttps://t.co/NdynmbuOqL","date":"Fri Apr 22 18:16:43 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden has woefully missed the mark to protect the American people. He needs to close our southern border NOW.\n\nBorder security is national security.","date":"Fri Apr 22 16:12:51 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday I recognized our 7A champion Enterprise High School men's basketball team! These men were the first Wildcats in the 64 year history of Enterprise High School to receive the state title. Congratulations! https://t.co/Hk2VqoX7Jg","date":"Thu Apr 21 18:44:38 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"So Biden wants to ask the scientists about the border - what?! Why don't we ask our CBP Agents that are being overrun at our border? Biden doesn't know what he is talking about.\n\nThis is embarrassing. We need an admin that cleans up America's problems, not a president's gaffes.","date":"Thu Apr 21 17:05:56 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"With our law enforcement at the border hamstrung and border security weakened by the Biden administration, how many slipped through the cracks?!\n\nBorder Security is National Security.\n\nhttps://t.co/IuXpNuzQ95","date":"Wed Apr 20 19:32:46 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We're one step away from @POTUS blaming his economic crisis on the aliens. https://t.co/5zAdhBztc9","date":"Wed Apr 20 14:37:18 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The #BidenBorderCrisis didn't appear out of thin air. President Biden reverted to Obama era catch-and-release, halted construction of the border wall, and now will end Title 42. \n\nAmericans deserve better than weak policies from a weak administration.","date":"Tue Apr 19 19:47:59 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It's about time that we follow the science. Freedom.","date":"Tue Apr 19 13:56:36 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We should be cutting taxes, not paying more for Biden's failed policies that fuel inflation.\n\nThat's why I introduced the HITS Act to provide an income tax holiday for millions of Americans who support the American economy. https://t.co/7OkYOcu6t3","date":"Mon Apr 18 21:15:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Join me today to #ThankALinemen! These men and women work hard to keep the lights on for every Alabamian. We salute you each and every day!","date":"Mon Apr 18 20:58:16 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨A federal judge just struck down the Biden admin's mask mandate for airplanes.\n\nWe all know this isn't about science anymore. It's time for the CDC to end its tyrannical mandates for all Americans.","date":"Mon Apr 18 17:59:44 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"And how many deadly fentanyl traffickers, dangerous criminals, or even suspected terrorists haven't been stopped? The situation at our border is complete chaos. The Biden admin needs to get serious and protect our homeland.","date":"Mon Apr 18 14:19:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"\"He is not here: for He is risen, as He said.\" -Matthew 28:6 KJV https://t.co/QpxbjpfUJ0","date":"Sun Apr 17 16:10:45 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It is finished. Wishing everyone a blessed Good Friday!\n\n“For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\" -John 3:16 KJV https://t.co/ZLxAOhkkmn","date":"Fri Apr 15 14:14:31 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Putin can sanction me all he wants, but it won't change my position that we need to continue supporting the Ukrainian people. It is in America's best interest to deter Russian aggression in the region, and I'll always put America first. https://t.co/m0dHcctBLO","date":"Thu Apr 14 22:19:26 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden must not prioritize foreign citizens illegally entering our country over our veterans.\n\nProud to join @CongressmanHice in working to ensure our veterans always come first.","date":"Thu Apr 14 17:14:56 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":".@SpeakerPelosi needs to bring the bill up for a vote immediately.\n\nWe need to protect our border and stop the flow of illegal immigrants at the southern border","date":"Thu Apr 14 15:47:25 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today I stopped by BastCore in Montgomery for an informative tour of their facility. BastCore specializes in separating the fiber from the wood in hemp stalk. Both products can be used to make over 28,000 products. Innovative technology coming out of AL02! https://t.co/7Qi7sjBbRs","date":"Wed Apr 13 20:12:19 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The only thing to blame inflation on is President Biden and House Democrats' reckless spending.","date":"Wed Apr 13 20:00:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Your taxpayer dollars should NEVER fund abortions.\n\nProud to join @RepRalphNorman in sending a letter to President Biden opposing his 2023 Budget Proposal on the basis of several anti-life and anti-family provisions.","date":"Wed Apr 13 18:09:15 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"So the Democrats want to end Title 42 because the pandemic is over but continue to make Americans wear masks on public transit. Someone, please explain their logic to me.\n\nPolitics over science.","date":"Wed Apr 13 16:13:52 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It was a pleasure to attend Austal's Turning on Steel Event for their new state-of-the-art steel facility. Thank you to the folks at @Austal_USA for the tour and for inviting me to help celebrate the opening!","date":"Tue Apr 12 22:42:42 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden’s nomination of a Far-Left gun control advocate to head the ATF is an attack on law-abiding Americans' Second Amendment rights.\n\nWe must protect every American's Constitutional freedoms.","date":"Tue Apr 12 17:04:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Inflation continues to hit record highs under Biden's failed leadership. Hardworking Alabamians are now facing inflation at a staggering rate of 🚨8.5%. When will the reckless spending in Washington stop? The American people cannot afford for inflation to soar month after month.","date":"Tue Apr 12 14:01:55 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Now that Joe Biden is president, Hunter's laptop is real? And the media expects us to gloss over it? I'm sick and tired of mainstream media censorship, and so are the American people.\n\nThis weekend I joined @TheBennyReport to discuss who I think the \"Big Guy\" is. https://t.co/42vWGfHYit","date":"Mon Apr 11 18:54:34 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We told Biden: If you defund the police, you're going to see rising crime.\n \nIf you do away with the border wall, you're going to see an invasion issue. \n\nIf you print money, you're going to see inflation. \n\nIf you rely on foreign oil, you're going to see a rise in gas prices.","date":"Mon Apr 11 17:52:37 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The people of Alabama are certainly not happy with this President, and neither is the rest of America. \n\nThe poll numbers don't lie. https://t.co/vkY9wEh5oY","date":"Mon Apr 11 17:11:14 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The biggest pile of garbage we need to take out in Washington is our nation's $30 trillion debt.\n\nAmericans can’t afford to pay for Democrats’ out-of-control spending any longer.","date":"Fri Apr 08 18:08:00 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Joe Biden is a disaster. After just one year, he is already one of the worst presidents in American history:\n\n❌Historic inflation\n❌A violent crime wave\n❌A humiliating surrender in Afghanistan\n❌A border crisis\n❌A war on American energy that has funded Putin’s war in Ukraine.","date":"Fri Apr 08 13:40:00 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"KBJ is the most radical Supreme Court nominee ever considered by the Senate, and her confirmation to our highest court woefully threatens our nation. Her leniency for child porn offenders, support of divisive CRT, and outright refusal to define what a woman is dangerous.","date":"Thu Apr 07 19:36:10 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Joe Biden must immediately disclose if his admin is considering sending VA doctors to the border to provide free medical care to illegal aliens.\n\nWe have veterans that have been waiting for months to receive the care they earned.\n\nInexcusable!\n\nhttps://t.co/qNsWyB6HQ3","date":"Thu Apr 07 18:23:34 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden killed the Keystone Pipeline, gave Russia the green light to build a pipeline, begged OPEC to increase production, and buy solar panels from China. \n\nAnd President Biden wonders why gas prices have spiked to over $4 a gallon.","date":"Thu Apr 07 15:51:31 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden presidency is one crisis after another, and the American people are fed up.\n\n⛽️ Gas prices hit historic highs\n📈 Inflation hit 40-year high\n🚨Historic border crisis\n\nAnd the list goes on...\n\nWe need to put America First!","date":"Thu Apr 07 14:59:18 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The long-term impacts will be irreversible, and the Biden administration must act now before it’s too late for our farmers. \n\nI'm proud to join my colleagues to advocate for lower fertilizer costs and relieve pressures on our farmers.","date":"Wed Apr 06 19:51:53 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨Democrats just BLOCKED my request to bring @RepHerrell's PAUSE Act to a vote.\n\nThis bill would halt HHS and DHS from weakening Title 42's implementation.\n\nCongress needs to pass this bill NOW to protect our nation. https://t.co/rSzrJCyNK8","date":"Wed Apr 06 17:55:36 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our country will be overrun with illegal drugs, cartels, and gang members if Biden doesn't take action and close the southern border.\n\nJust another example 👇","date":"Wed Apr 06 15:30:42 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It is crystal clear - President Biden hates American energy.   \n\nhttps://t.co/9lgawvxzFl","date":"Wed Apr 06 13:49:49 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Two weeks to flatten the curve has morphed into 731 days of political theater. Why are government bureaucrats still forcing Americans to wear a mask on public transportation? It's time to follow medical science, not political science.\n\nListen to my discussion on the @JeffPoorShow https://t.co/XQ6vS4EihB","date":"Tue Apr 05 20:41:36 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Woke liberal media outlets actively suppressed the Hunter Biden laptop story because it didn't fit their narrative. But now that liberal media outlets' ratings are plummeting alongside Joe Biden, the story is suddenly relevant.\n\nHunter Biden must answer to the American people.","date":"Tue Apr 05 18:59:21 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden is reportedly considering redirecting VA medical personnel to the border to treat illegal immigrants - including vaccinated them - robbing much-needed medical care from our veterans!\n\nThis is OUTRAGEOUS.\n\nHow can he put illegal immigrants before American veterans? #Title42 https://t.co/ew6n2NfaxW","date":"Tue Apr 05 17:41:59 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Has the Biden admin not learned their lesson after 2 MILLION illegal immigrants have poured across our border, making our communities less safe, allowing criminals, drug caters &amp; lawlessness into our nation?\n\nThis is insane.","date":"Tue Apr 05 16:14:49 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On this #GoldStarSpousesDay, we honor the husbands and wives of our fallen heroes. May we never forget the ultimate sacrifice their loved ones made for our nation. My prayers are with each family member who remains strong and courageous in the face of adversity. https://t.co/whNWrLRF1n","date":"Tue Apr 05 14:34:18 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"A huge congratulations! Rooting for @AuburnGym all the way. #WarEagle","date":"Mon Apr 04 15:56:33 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Ketanji Brown Jackson doesn't hold a position on natural rights?\n\nLet me define it for her - Natural rights are rights granted to all people by God that cannot be denied or restricted by any government or individual.\n\nThis is dangerous for every American.","date":"Mon Apr 04 15:31:27 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Joe Biden's inflation is hammering the American people's wallets &amp; will now cost the average American household OVER $5,000. \n\nAmericans overwhelmingly feel Biden's failing policies everywhere they turn at the gas pump, grocery store, local restaurants &amp; small businesses.","date":"Mon Apr 04 14:44:15 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Woke liberals who have a stranglehold on organizations like the NCAA are mindlessly forcing their agenda on the American people regardless of who it hurts. We cannot allow radical progressives to continue pushing their destructive agenda and harming women athletes.","date":"Thu Mar 31 20:55:13 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden announced he is releasing 1/4 of our nation's SPR. Our SPR should not act as a band-aid to lower gas prices for a few days.\n\nWe could be energy independent if President Biden would wake up. Drill here, drill now.","date":"Thu Mar 31 20:01:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"No American worker should ever have to choose between providing for their families and being vaccinated. Congress must prevent the federal government's future blatant overreach of any unlawful mandate.\n\nProud to join @Rep_Clyde in the fight for our freedoms.","date":"Thu Mar 31 17:03:26 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Joe Biden is preparing to order the release of millions of barrels of oil per day from the nation's SPR to control energy prices instead of unleashing American energy. This is insanity...\n\nOur SPR is for real emergencies, NOT political emergencies.","date":"Thu Mar 31 15:35:22 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The @FreedomCaucus represents the voice of the real people – not the process, not the special interests, but the people themselves.\n\nAnd there’s good news - HFC is continuing to grow, giving Americans a stronger conservative voice in Washington.\n\nhttps://t.co/vI1ZU1cWtZ","date":"Thu Mar 31 15:09:28 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden is attempting to deflect blame from the disastrous consequences of his many policy failures – skyrocketing energy costs, broken supply chains, even food shortages.\n\nThank you to my @HouseAgGOP colleague @AustinScottGA08 for shedding light on this critical food supply issue.","date":"Thu Mar 31 14:48:56 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It was a treat getting to visit with @AuburnU President Dr. Gouge, incoming President Dr. Chris Roberts, and Bob Dumas. As an alum, I'm so proud of all AU does for our state and beyond, and I appreciate the update on exciting new developments at the university. #WarEagle https://t.co/Rj0QF7bCVp","date":"Thu Mar 31 14:42:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Ending Title 42 would generate overwhelming &amp; terrifying chaos at our border from emboldened drug cartels &amp; human traffickers.\n\nI join my @freedomcaucus members in calling on @HouseDemocrats to stop this madness &amp; sign @RepChipRoy's discharge petition.\n\nhttps://t.co/RQPjwAog81","date":"Wed Mar 30 19:28:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"American families are forced to face $5,200 in additional costs this year as a result of rising prices. And the American people are now having to bend over backward to afford Biden's failed policies.","date":"Wed Mar 30 16:23:00 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The need for reliable broadband in rural communities for our farmers is the utmost important. I am proud to join my @HouseAgGOP members on this effort!","date":"Wed Mar 30 16:17:59 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today, I paid tribute to the brave Americans who served during the Vietnam War. Growing up in Enterprise, I was surrounded by Vietnam veterans, and each of them has a special place in my heart. We remember your sacrifice and service and are forever indebted to you. https://t.co/gDy4PqdWBs","date":"Tue Mar 29 22:05:27 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Ending Title 42 will be disastrous. The Biden administration needs to get serious before we see another mass migration at our southern border that will put communities across America in danger.","date":"Tue Mar 29 21:34:04 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"They know how damaging the truth is, and the media and Democrats' will continue down this destructive path.","date":"Tue Mar 29 20:47:03 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Joe Biden has repeatedly promised to nominate a Far-Left radical to the Supreme Court and deliberately leave out details in materials given to the Judiciary Committee to fit their woke agenda.🧵","date":"Tue Mar 29 20:47:02 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Ketanji Brown Jackson has a history of delivering soft-on-crime sentences, and when pressed during her confirmation, she could not adequately defend or explain her record on this issue. These were actions she took while being paid by the taxpayers.","date":"Tue Mar 29 20:47:02 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's budget would grow America’s debt to a shocking $45 trillion by 2032. Let's get this clear -  Biden will continue to spend money that we don't have, strapping our children and grandchildren with unthinkable debt that they cannot afford to please the left-socialist wing.","date":"Tue Mar 29 15:46:07 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What do the American people have to show for President Biden and House Democrats' outrageous spending: inflation, higher gas prices, empty shelves, and less money in your pocket.","date":"Tue Mar 29 13:55:25 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden admin released its $5.8 trillion budget. If the last year was any indication of the Dems' spending, then inflation will continue to rise. We need to get our country back on track, lower inflation, restore fiscal sanity that doesn't include higher taxes &amp; more spending.","date":"Mon Mar 28 21:41:03 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Since President Biden's first day in office, he has waged war on American Energy. The liberal media is working overtime to convince Americans that gas prices are rising because of the war in Ukraine. \n\nBut in reality, it's Biden's anti-energy policies. https://t.co/2Q56b3bcvy","date":"Mon Mar 28 16:42:48 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden gave Russia the greenlight to build a pipeline to Europe – giving them more leverage over our European allies – yet cancelled the Keystone XL pipeline that would have created jobs &amp; benefited both our country &amp; our ally Canada. \n\nUnleash American energy now! https://t.co/dMwC13vvVc","date":"Sat Mar 26 22:36:27 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Medal of Honor is the highest honor a servicemember in our nation can receive. On #NationalMedalofHonorDay, we commemorate American heroes who have earned this honor by defending our great country. \n\nThank you for your bravery &amp; service! https://t.co/diSnIT8rgS","date":"Fri Mar 25 16:33:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Russian energy must be replaced with American energy and the U.S. should be accelerating energy exports to our allies. Instead, President Biden's anti-energy agenda emboldens Putin. \n\nWe need to unleash American energy to lower prices here at home and support our allies abroad. https://t.co/qlA6ugwLw4","date":"Thu Mar 24 20:29:03 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The situation at our southern border is out of control. \n\nWe need to secure our border. Finish the wall. Fully reinstate the 'Remain-in-Mexico' policy. And Maintain Title 42 Authority.","date":"Thu Mar 24 16:26:06 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden's harmful economic policies and rising inflation are battering American farmers.\n\nWe need leadership that puts America first, and that starts with prioritizing our farmers. #NationalAgWeek","date":"Wed Mar 23 15:35:50 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Do you want the Biden Administration to renew the failed, Obama-era Iran Nuclear Deal with the world's leading state sponsor of terrorism?","date":"Tue Mar 22 14:45:59 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Farmers are facing unprecedented disruptions in the supply chain, skyrocketing energy costs, and difficulty transporting their commodities. Ensuring farm families have a strong safety net is vital to rebuilding a robust rural economy. #NationalAgWeek","date":"Tue Mar 22 14:36:46 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy #NationalAgDay to all of our hardworking farmers in the Wiregrass and across the nation. From growing up on a farm to now representing an agricultural district, I'm proud to celebrate the farmers, ranchers, and producers that work tirelessly to feed and fuel our world. https://t.co/TtP6qrclqW","date":"Tue Mar 22 14:12:59 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On #WorldDownSyndromeDay, we celebrate the precious gift of life. I am wearing crazy socks for Bowen Poss, one of many incredible individuals with Down Syndrome. Bowen brings so much joy and happiness right here in Enterprise. https://t.co/8BHqJjrc8X","date":"Mon Mar 21 17:51:03 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Trump was right, but media companies bent over backward to discredit Trump &amp; project lies over the truth. Now that Joe Biden is president, Hunter's laptop is real? And the media expects us to gloss over it? I'm sick &amp; tired of censorship, and so are the American people.","date":"Mon Mar 21 17:12:23 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The media lied. So did Democrats. And so did Big Tech. The mainstream media went to bat for Hunter Biden time &amp; time again claiming that his laptop wasn't real to advance their corrupt agenda.","date":"Mon Mar 21 17:12:23 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden admin is preparing for yet another crisis on the border. And like many they face, this crisis is a consequence of Biden’s policies.\n\nBiden officials fear a \"mass migration event\" if COVID policies end.\n\nWe need to secure our border NOW.\n\nhttps://t.co/GLSfpwB8wO","date":"Sat Mar 19 20:45:39 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I am deeply saddened by the news of Don Young passing away. The Dean of the House and a champion for Alaska will be greatly missed in the halls of Congress. My prayers are with his family and all Alaskans.","date":"Sat Mar 19 13:57:16 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In a world smoldering with countless crises of Biden’s making, the failed, Obama-era Iran nuclear deal represents perhaps the gravest threat to American security and safety. I am proud to join @RepJimBanks  resolution to condemn Biden’s attempt to negotiate with terrorists.","date":"Fri Mar 18 20:47:24 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"My staff and I are cheering for our Tigers today from Washington. I've got them winning the championship in my bracket - who do you have? #WarEagle https://t.co/V5dHlTVdWX","date":"Fri Mar 18 17:52:34 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Government bureaucrats are waging a war against everyday American citizens and their constitutional freedoms. I joined my good friend, @RepThomasMassie  Massie, to permanently end the mask charade.","date":"Thu Mar 17 19:29:20 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Steps Biden should take today: \n✅End federal freeze on all new oil &amp; gas projects\n✅Cut off the money pipeline to Putin\n✅Open the Keystone XL pipeline \n✅Remove US LNG export restrictions\n✅Restart oil/gas leasing on federal lands &amp; water\n✅Unleash American energy independence","date":"Thu Mar 17 15:16:30 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"If things keep up, Democrats will watch from the sidelines this November as Republicans run up the score. Read my full March Madness op-ed here. ⬇️\n\nhttps://t.co/SHtYTAoqCy","date":"Wed Mar 16 18:51:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Under President Biden, deportations dropped to the lowest level in 26 years last year despite record-high border crossings. This administration's refusal to uphold the law puts every American community at risk. #BidenBorderCrisis","date":"Wed Mar 16 17:41:07 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Just heard President Zelenskyy's address to Congress and the American people. He is a true leader and will not back down from Putin's aggression. https://t.co/LYF0p59qLr","date":"Wed Mar 16 14:26:28 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Why is Joe Biden playing into Russia's hands?\n\nHit Putin where it hurts - unleash American energy! https://t.co/Z99nTKpBun","date":"Wed Mar 16 13:29:56 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Inflation will cost Americans more than $3,500 this year. You'll pay an additional $2,000 just to fill up your gas tank.\n\nThese are real costs for American families that mean hard choices and canceled purchases.","date":"Tue Mar 15 20:27:40 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I introduced the Quality Education for Veterans Act to protect taxpayers &amp; obstruct bad actors to ensure veterans have a smooth transition through higher education. I am proud to fight for our veterans!\n\nRead the full release here.\n\nhttps://t.co/JtkK6j8M4V","date":"Tue Mar 15 19:03:46 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In a week, gas prices soared in EVERY single county in the Wiregrass. \n\nPresident Biden and Democrats' policies are responsible for putting hard-working Alabamians in this position. We need to unleash American energy and become energy independent. https://t.co/dCPZ39MbJ2","date":"Mon Mar 14 18:05:41 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"BELLA+CANVAS' investment in Elmore County will create new jobs and economic opportunities for the Wiregrass. This is welcome news and will restore manufacturing jobs right here in the United States!","date":"Mon Mar 14 15:28:18 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Americans are paying more for just about everything because of inflation:  \n\n🚗Used cars &amp; trucks are UP 41.2%\n⛽️Gasoline is UP 38.0%\n🥓Bacon is UP 18.8%\n🥜Peanut butter is UP 15.6%\n🐖Pork is UP 14.0%\n✈️Airline fees are UP 12.7%\n🚗New vehicles are UP 12.4%\n🥚Eggs are UP 11.4%","date":"Sat Mar 12 22:29:15 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Inflation is taxation, and it has gone up every month of Joe Biden's presidency.","date":"Fri Mar 11 20:31:55 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I stopped by Carroll High School to speak with a group of seniors. Thanks for having me and asking me tough questions. The future is bright for these students! Go Eagles! https://t.co/IO0pNbi8By","date":"Fri Mar 11 18:49:09 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Soaring gas prices &amp; out-of-control inflation should rest upon Joe Biden's shoulders not the American peoples.","date":"Thu Mar 10 18:41:55 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The last time inflation was this high? The year Michael Jackson released Thriller.\n\nIts time for @JoeBiden to Beat It. #Bidenflation","date":"Thu Mar 10 14:12:57 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"👇","date":"Wed Mar 09 23:42:11 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"House Dems will attempt to pass a 2700-page spending bill that was released in the DEAD of night and force us to vote on it in a few hours.\n\nOur nation is facing historic inflation &amp; wasteful spending &amp; Democrats want us to trust them with another $1.5 trillion on God-knows-what.","date":"Wed Mar 09 17:29:30 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"With a stroke of a pen, President Biden knowingly destroyed thousands of jobs by killing the Keystone XL Pipeline. Now Biden's radical America Last energy policies are directly causing our energy crisis.\n\nBiden MUST unleash American energy NOW!","date":"Wed Mar 09 15:56:55 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's energy policies are crystal clear: America LAST.","date":"Wed Mar 09 14:48:00 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In a world of penguins, @coachbrucepearl is a 🅿️eacock 🦚\n\nCongrats, my friend! https://t.co/koW2sJa5AX","date":"Tue Mar 08 19:51:08 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨These are the average gas prices right here in Alabama's Second Congressional District.⬇️\n\nHard-working Alabamians are paying the price for Democrats' radical America Last energy policies. https://t.co/VijeMSGrTv","date":"Tue Mar 08 17:29:02 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Democrats' policies were intended to drive up gas prices to force people into their electric car utopia. Pete Buttigieg dismissed the pain American families are suffering by saying they can simply solve the problem by buying electric cars! How out of touch can these guys be?","date":"Tue Mar 08 15:02:18 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden can't continue offering lip service to the country moving forward from COVID while forcing Americans to choose between a jab or their job. I will continue to stand up against these tyrannical mandates &amp; I pray my colleagues will do their right thing and join me.","date":"Mon Mar 07 22:06:19 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's war on American energy is hammering American families' pocketbooks. Gas prices are 🚨ABOVE $4 per gallon🚨for the first time since 2008. This is Joe Biden's America.","date":"Mon Mar 07 16:56:25 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Why won't President Biden unleash American energy?\n\nWhy would he rather buy oil from Russia, Iran, and Venezuela?","date":"Mon Mar 07 16:49:22 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Congrats to the Wildcats for winning their very first state boys basketball title in school history! Way to represent Enterprise and to go down in the history books. Super proud of each of your hard work and dedication. https://t.co/dWIprYUdCt","date":"Mon Mar 07 16:21:25 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Joe Biden, stop appeasing Russia. Be Churchill, not Chamberlain!","date":"Fri Mar 04 20:52:28 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"READ my thoughts on Biden's alternate reality during the State of the Union. ⬇️ \n\nhttps://t.co/Tx1CogMl1x","date":"Fri Mar 04 16:10:40 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The average gas price just reached $3.73 per gallon. \n\nThanks Joe Biden. https://t.co/oVcSrj9LVA","date":"Thu Mar 03 21:20:10 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It was a pleasure to catch up with Alabama farmers in Washington to discuss important issues they are facing. Working for our farmers is one of my top priorities, and its why I am honored to serve on the House Agriculture Committee. Thank you to @AlfaFarmers for having me! https://t.co/zWqhKWF72l","date":"Thu Mar 03 18:48:10 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨It’s NOT Pelosi’s House - it’s the PEOPLE’S House.","date":"Thu Mar 03 15:58:27 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I celebrated Read Across America Day by reading to a wonderful 5th grade class at Samson Elementary School! Growing up, I loved to read Dr. Seuss and enjoyed reading Green Eggs and Ham in honor of his Birthday today. https://t.co/4h0NtUe4V4","date":"Wed Mar 02 21:34:50 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The men and women of the Wiregrass are doing their part to stop Putin! I'm proud that the javelin missiles being used by the Ukrainians to defend their homeland from Russian aggression are made right here in Troy. #MadeinAlabama\n\nhttps://t.co/RBvki5RVdE","date":"Wed Mar 02 20:24:51 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Energy security is national security!","date":"Wed Mar 02 19:04:38 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"During last night’s State of the Union, President Biden claimed he wanted to buy American. But regrettably, that did not apply to oil and natural gas as Biden made crystal clear that his anti-energy agenda would continue. \n\nWe must unleash American energy independence NOW!","date":"Wed Mar 02 16:01:01 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We will NEVER stop the opioid epidemic until we close our southern border. \n\n#SOTUinCrisis","date":"Wed Mar 02 03:05:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Does Biden have a single plan to combat a single crisis that our nation is facing? \n\nNo - but he will continue to push his radical agenda on hard-working Americans.","date":"Wed Mar 02 02:58:35 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Build Back Broke","date":"Wed Mar 02 02:35:37 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Inflation is the highest level it's been in 40 years. \n\nAmericans are suffering from President Biden's out-of-control spending at their grocery store, the gas pump, and everywhere they spend their hard earned money.","date":"Wed Mar 02 02:27:11 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden needs to reverse his anti-American oil and gas policies and allow production to increase here in the United States. \n\nReopen the Keystone XL pipeline. \n\n#SOTUinCrisis","date":"Wed Mar 02 02:21:23 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I’ve been asked if I’ll be entering through Nancy Pelosi’s fence to attend tonight’s State of the Union Address from President Biden. Here’s my answer. https://t.co/vJRasB6bR0","date":"Wed Mar 02 00:00:01 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/PwITuGu9sx","date":"Tue Mar 01 22:10:34 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/tCOXFDC1FZ","date":"Tue Mar 01 22:10:33 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/XQqpsQAmxf","date":"Tue Mar 01 22:10:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/UBgdpZnFo0","date":"Tue Mar 01 22:10:31 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/TrNfrl4BNj","date":"Tue Mar 01 22:10:30 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/v505gyjzvm","date":"Tue Mar 01 22:10:30 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Tonight, President Biden and his speechwriters will spin and blame others for all the crises this administration has created. Don't buy it.\n\nHere's the REAL State of our Union told by my constituents.\n\n#SOTUinCrisis https://t.co/cyV5hnWqyC","date":"Tue Mar 01 22:10:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What if Joe Biden had given weapons to Ukrainians instead of the Taliban?","date":"Tue Mar 01 21:48:35 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This is a powerful message from my Ukrainian-American colleague. Thank you, @RepSpartz, for shedding light for the American people on what is really going on in Ukraine right now.","date":"Tue Mar 01 18:17:14 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨Play along tonight in an exciting game of #SOTUinCrisis Bingo (or as I like to call it, the \"Biden Blame Game)!\n \nIf you call a Bingo using the \"O” column, I’ll know you're cheating. https://t.co/FnLE795Rx8","date":"Tue Mar 01 17:17:30 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What Biden won't take responsibility for during the #SOTUinCrisis ⬇️ https://t.co/FOYcdT1x1P","date":"Tue Mar 01 14:55:08 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We spend roughly $50M on nearly 600,000 barrels of Russian oil each day. Russian energy must be replaced with American energy independence, and the U.S. should be accelerating energy exports to our allies. \n\nBut President Biden would rather buy Putin's oil.","date":"Mon Feb 28 22:57:54 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Americans should not be forced to spend their hard-earned money on Biden's failed policies.","date":"Mon Feb 28 20:32:11 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Birthday, @AubietheTiger01! You don't look a day over fabulous.","date":"Mon Feb 28 15:54:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Zelenskyy, in the face of adversity, is leading the people of Ukraine with courage and true leadership. Keep Ukraine in your prayers as they continue to fight for their freedoms.","date":"Sat Feb 26 18:30:04 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Lionel James was an Auburn legend, and his legacy will live on. \"Little Train\" was one of the toughest to ever play the game, and his contributions to the program were indispensable to Auburn earning the title \"Running Back U.\"\nhttps://t.co/m7IwHpdhNC","date":"Fri Feb 25 20:39:23 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden administration favors Russian energy over American energy.","date":"Fri Feb 25 20:26:27 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On President Biden's very first day, he canceled the Keystone XL Pipeline, banned drilling on federal land, and declared war on American energy production.","date":"Fri Feb 25 18:31:04 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"If President Biden was doing everything in his power to lower gas prices, he would reverse his anti-American oil and gas policies and allow production to increase here in the United States.","date":"Fri Feb 25 18:31:04 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"My statement on Russia's invasion of Ukraine. https://t.co/MzzzFej0dK","date":"Thu Feb 24 18:49:27 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Pray for the people in Ukraine.","date":"Thu Feb 24 13:39:23 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I will ALWAYS support our law enforcement officers while the Democrats raise money to undermine law and order.","date":"Wed Feb 23 20:41:01 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy #NationalFFAWeek!\n\nAs an FFA alum, I know how important FFA is for young folks in the Wiregrass, and I'm excited to join my colleagues in recognizing this week as National FFA Week! FFA is leading the future of Alabama Agriculture! https://t.co/yPC38Nag5m","date":"Wed Feb 23 16:37:12 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Germany halted approval of Nord Stream 2 pipeline in response to the Ukraine invasion. President Biden gave the green light to Nord Steam 2 last year. \n\nBiden should have never waived sanctions on Putin's pipeline in the first place.","date":"Tue Feb 22 18:57:39 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy #PresidentsDay! Today, we honor and celebrate America's presidents who have shaped our nation into the beacon of freedom and fought for our democracy. God Bless America! \n\nWho is your favorite U.S. President? https://t.co/sZvXfwsFQC","date":"Mon Feb 21 16:35:36 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It's time for the Biden Administration to fix the crisis they created.","date":"Fri Feb 18 19:04:53 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I am deeply saddened by the passing of Congressman Jim Hagedorn. He was a force to be reckoned with and a powerhouse for Minnesota's First District. My thoughts and prayers are with his wife, Jennifer, and the entire Hagedorn family during this difficult time.","date":"Fri Feb 18 16:23:36 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We owe it to every American to stand up and defund President Biden's tyrannical vaccine mandate.","date":"Thu Feb 17 20:42:21 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden's out-of-control spending is the cause for the historic inflation each American is facing. \n\nhttps://t.co/wFESkU0882","date":"Thu Feb 17 19:08:18 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It is costing farmers more money to run their farms than ever before.\n\nContact labor 🔺 45.1%\nFertilizer 🔺 18.8%\nLP Gas 🔺 226.7%\nMaintenance 🔺 89.3%\nSeeds 🔺 29.1%\nInsurance 🔺 33.9%\n\nInflation fueled by overspending Democrats continues to hurt hard-working Americans.","date":"Wed Feb 16 17:45:37 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thank you to the folks at Buy-Rite Drugs in Ozark for taking time out of your busy morning to show me around and learn about the issues our hometown pharmacies are facing! https://t.co/eg6AucPqaB","date":"Tue Feb 15 22:50:02 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I recently sent USDA Secretary Vilsack a letter to improve hurricane insurance protection for farmers. I know firsthand the damage that a hurricane can do to a farmer’s crops, and we must continue to push to improve USDA programs. \n\nhttps://t.co/Nm55yJrlEu","date":"Tue Feb 15 17:51:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Valentine's Day to the love of my life, who is always supportive and by my side. Wishing you and your loved ones a blessed day. https://t.co/HQsiSGMO9E","date":"Mon Feb 14 21:30:38 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Hillary Clinton's campaign was hell-bent on linking Trump to the now-debunked phony Russian collusion hoax. \n\nAnd now we found out that Clinton's spying was worse than we thought. Congress must investigate immediately.","date":"Mon Feb 14 19:44:06 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Hillary Clinton lied and President Trump was right.","date":"Mon Feb 14 17:12:00 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In the last year, Secretary Mayorkas leadership – or lack of – has fueled illegal immigration into our nation at never-before-seen levels. I joined my GOP colleagues in calling on him to step down. \n\nhttps://t.co/KIgTN7Paiz","date":"Mon Feb 14 15:54:29 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We need policies to drive inflation DOWN and wages UP.","date":"Thu Feb 10 17:35:18 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"COVID is no longer an excuse for the disastrous consequences of this administration’s destructive policies. We absolutely must reel in this out-of-control inflation before it hurts the American people more than it already has.","date":"Thu Feb 10 17:27:05 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨BREAKING: The inflation rate just hit a whopping 7.5%, the highest in nearly 40 years. Americans are suffering from Biden's out-of-control spending at their grocery store, the gas pump, and everywhere they spend their hard earned money. We cannot continue down this path.","date":"Thu Feb 10 15:27:56 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Americans are unsure of President Biden's mental fitness for office. My colleagues and I are calling on Biden to immediately undergo a formal cognitive screening exam.\n\nWhat is he so afraid of?🤔\n\nhttps://t.co/AX2w2GqmGs","date":"Wed Feb 09 20:41:59 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Even the Democrats are sick and tired of their mask mandate - the science says to unmask our kids.","date":"Wed Feb 09 19:48:57 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I refuse to sit quietly while this Congress oppresses the American people with these mandates, and I cannot condone this way of doing business by voting for this CR.","date":"Wed Feb 09 17:05:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last night, I voted NO on another continuing resolution which not only kicks the can down the road but funds President Biden's unconstitutional COVID vaccine mandates.\n\nIt’s said that the only thing necessary for the triumph of evil is for good men to do nothing.","date":"Wed Feb 09 17:05:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Doesn't the First Amendment protect your right to speak out and question the action of the government? This is America, not North Korea. \n\nBut Biden has forgotten the rights of the American people guaranteed by the Constitution.","date":"Wed Feb 09 15:47:36 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enough fentanyl was seized by CBP last year to kill every American nearly 7 times over. \n\nFentanyl is plaguing our communities. It's posing our kids. It's devastating families. It's beyond time for Congress to take permanent action to stop this deadly crisis before it's too late. https://t.co/u4mbYL2uy6","date":"Tue Feb 08 18:12:51 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden’s first mistake was halting the construction of the border wall – weakening a key tool to combat illegal entry. Now our border is overrun with illegal immigrants. We need to build the wall. \n\nThanks to my friend @RepBobGood for introducing this bill.","date":"Tue Feb 08 16:57:04 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Republicans must take a stand against President Biden &amp; Democrats who believe it’s more important to force their radical agenda on the American people instead of fulfilling basic duties of Congress like funding the gov.\n\nI stand with @RepChipRoy, vaccine mandates are tyrannical.","date":"Mon Feb 07 20:16:20 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Americans are exhausted from the politics of covid. \n\nAmericans are also tired of Democrats’ hypocrisy – enforcing rules for thee but not for me. It’s especially infuriating when it affects our children.\n\nWe have had enough. https://t.co/b01illQAtI","date":"Mon Feb 07 14:35:22 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Birthday to one of the greatest presidents our nation has known. Ronald Reagan was a leader, a constitutionalist, and God-fearing man.\n\n“If we ever forget that we’re one nation under God, then we will be a nation gone under.” - Ronald Reagan","date":"Sun Feb 06 22:04:27 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today is World Cancer Day. Join me in honoring the lives who have battled cancer and remembering loved ones lost. We must continue our effort to eradicate cancer worldwide. https://t.co/1L02nXUCIz","date":"Fri Feb 04 20:42:51 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's COVID vaccine mandates are a threat to the freedoms of every American &amp; I will oppose any government appropriations measure that funds the enforcement of vaccine mandates. Proud to join @RepChipRoy in the fight!\n\nhttps://t.co/UtWmDVSfev","date":"Fri Feb 04 16:21:19 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It's simple - Speaker Pelosi wants to put America LAST.","date":"Fri Feb 04 14:23:35 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I will vote against the Dems 'American CONCEDES Act,' which does NOTHING to hold China accountable. \n\nNow, @SpeakerPelosi  is taking that conceding spirit one step further by instructing American athletes competing in the Olympics not to \"speak out\" against the communist regime.","date":"Fri Feb 04 14:21:53 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We must confront the economic crisis facing America, but Speaker Pelosi and House Democrats are adding fuel to the fire by pushing more out-of-control spending.","date":"Thu Feb 03 16:02:04 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Dems are trying yet again to pass their disguised liberal wish-list, this time in the form of their 'America CONCEDES Act.' We won't even know the cost of this bill before voting on it. \n\n#NoScoreNoVote","date":"Thu Feb 03 15:08:24 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Dems' 3,000-page 'America Concedes Act' exposed:\n\n❌Invites more malign CCP actors into the country\n❌Ties our hands behind our back\n❌Distracts our military from focusing on China\n❌Lets China off the hook for their role in the pandemic","date":"Wed Feb 02 20:27:41 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The U.S. national debt is now almost DOUBLE China's GDP.\n\nBut what do Democrats want to do? Spend, baby, spend!\n\nHow long can this last?","date":"Wed Feb 02 16:53:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The United States debt just surpassed $30,000,000,000,000 for the first time in history. That's $30 TRILLION. \n\nThe reckless spending needs to be stopped. This will not only saddle our children and grandchildren but exacerbate the challenges our nation is facing right now.","date":"Wed Feb 02 15:22:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":".@freedomcaucus held a hearing on Biden's Border Crisis since Nancy Pelosi &amp; Dems refuse to give the American people a glimpse into the chaos Biden has unleashed at our southern border.\n\nThe only supply chain working in this country is the drug trafficking at our southern border https://t.co/jkQCrDogS4","date":"Tue Feb 01 23:18:30 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Fentanyl is freely flowing across our borders into our communities. Under President Biden, 9,917 pounds were seized in 2021, which is enough to kill up to 2.2 billion people, or every American almost seven times over.\n\nEvery state is a border state now because of Joe Biden.","date":"Tue Feb 01 20:49:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Jen Psaki is out of touch with the American people. She mocked Democrats' soft-on-crime policies saying, \"what does that even mean.\" \n\nI will tell you what it means - Biden's crime crisis is directly tied to radical Democrats' support for the defund the police movement.","date":"Tue Feb 01 18:25:49 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today is National Freedom Day! On this day in 1865, Abraham Lincoln signed a resolution outlawing slavery that would become the thirteenth amendment. I'm proud to live in the freest nation on earth, but we must fight to keep it that way! https://t.co/PSfXBWM1wM","date":"Tue Feb 01 15:18:56 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our Border Patrol agents deserve better from the Biden administration. They are understaffed and overwhelmed.","date":"Mon Jan 31 21:33:12 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The House heads back to DC this week, but rather than confronting the numerous crises facing America, Nancy Pelosi and House Dems will be pushing their socialist agenda: The \"China Bill,\" a legislative gift to the CCP.","date":"Mon Jan 31 18:35:33 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden and House Democrats have wiped out three years of Americans' wage gains with their out-of-control spending. Working families are watching their budgets shrink, and prices climb. Americans are spending their hard-earned paychecks to keep up with Bidenflation.","date":"Fri Jan 28 18:29:27 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Another leaked video shows that the Biden admin has given the green light for illegal immigrants to come into our communities. \n\nBiden is trying to hide the ongoing border crisis from the American people, but he has made every state a border state.\n\nThis is UNACCEPTABLE.","date":"Thu Jan 27 18:53:04 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today, we pause to remember and honor the lives of both victims and survivors during the Holocaust. \nWe must never forget the evil horrors that took place during the Holocaust or the sacrifices made to end this dark chapter in our world’s history.\nNever Forget. Never Again. https://t.co/Fq3W2kDOYB","date":"Thu Jan 27 16:07:44 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden remains weak on the world stage &amp; has failed to hold Russia accountable for the Nord Stream II pipeline or the cyber-attacks.\n\nNow he has all but rolled out the red carpet for the Russian Army in Ukraine, calling the potential invasion a “minor incursion.\" We need a leader.","date":"Wed Jan 26 23:00:57 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Birthday, @GOPLeader! Thank you for your leadership in Congress &amp; for fighting for our freedoms. 🇺🇸 https://t.co/FOYexhdX6g","date":"Wed Jan 26 17:16:34 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨BREAKING: The Biden administration withdraws the Covid vaccine mandate for businesses. It is clear that Joe Biden's vaccine mandate was blatantly unconstitutional. This is a win for the American people, but the fight against our freedoms is far from over.","date":"Tue Jan 25 22:26:17 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What’s really going on at the border⬇️","date":"Tue Jan 25 17:21:50 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Proud of this Auburn Team! As Coach Pearl would say ….Progress. #WarEagle","date":"Mon Jan 24 18:34:45 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden made a promise to the American people to unite the country. But instead of unity, our nation has suffered the impacts of Biden’s radical agenda.\n\nI asked my constituents their thoughts, and 75% agreed that he has failed the American people.","date":"Mon Jan 24 16:51:13 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The historic inflation plaguing American families threatens to derail all hope of future economic recovery and must be fought with every tool we possess. We must take action against this rampant inflation. I'm proud to stand by @RepMikeGarcia, @SenatorTimScott &amp; @SenJohnThune!","date":"Sun Jan 23 21:23:23 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In the 49 years since Roe. V. Wade, more than 63 million unborn children have lost their lives to abortion. \n\nI am proud to stand with @RepTedBudd &amp; @RepRalphNorman in recognizing National Sanctity of Human Life Day today.","date":"Sat Jan 22 21:27:39 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It was an honor to speak at the Veterans of Foreign Wars Winter Conference in Montgomery this morning. We discussed my first year in Washington and my work on @HouseVetAffairs. I enjoyed talking to so many selfless and courageous veterans who live in the community. https://t.co/nv2IxxxeVP","date":"Sat Jan 22 17:41:26 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I want to thank the folks that joined my Back the Blue Telephone Townhall last night. I enjoyed answering questions from the great people of AL-02. Be on the lookout for future events as we fight for conservative values in Washington! https://t.co/90b5FsuOne","date":"Fri Jan 21 23:04:08 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Every life is precious. #WhyWeMarch","date":"Fri Jan 21 18:28:41 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This morning, I spoke at the March for Life breakfast. Every life is precious &amp; I will always unapologetically fight to protect the sanctity of life at every stage. As a father of four, this issue is personal to me. \nI stand with the thousands marching today for life. #WhyWeMarch https://t.co/kvLLx7ehFG","date":"Fri Jan 21 16:03:25 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Joe Biden's first year in office has been an abysmal failure of executive leadership. The crises raging across our nation because of the incompetency of this administration threaten the lives and livelihoods of countless Americans.","date":"Thu Jan 20 21:37:43 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨REMINDER: Join me for a Back the Blue telephone townhall event this evening at 6pm CT.\n\n☎️ Dial in at 833-946-1554 \n📺 Watch live at https://t.co/Vg2099riwA.\nPlease reach out to my Washington, D.C. office if you have any questions: 202-225-2901. https://t.co/kZiIIHkqqm","date":"Thu Jan 20 19:18:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday, President Biden asked, \"What are Republicans for?\" Let's be clear: We are for freedom. For family. For security. For prosperity. And we fight for the American people. To secure our border. To stop Socialist tyranny. To save America. Can we say the same for Democrats?","date":"Thu Jan 20 14:47:50 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It is clear that President Biden is out of touch with the American people. During his press conference today, he touted that he has \"outperformed\" in his first year as president.","date":"Wed Jan 19 22:31:55 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Has he forgotten that he has created a border crisis, an economic crisis, an energy crisis, an education crisis, a crime crisis, a covid crisis, and a national security crisis?!? The American people deserve better!","date":"Wed Jan 19 22:31:55 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This is what one year of total Democratic Party control looks like.","date":"Wed Jan 19 19:27:19 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I'm honored to have earned an A+ rating from @SBAList for my pro-life voting record. As a proud pro-life conservative, I will never stop fighting to protect the unborn &amp; advance pro-life legislation in Congress. We must stop attacks to undermine the sanctity of life at all costs! https://t.co/rVQz09Parp","date":"Wed Jan 19 16:06:36 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We are approaching Biden's one-year anniversary in office &amp; the damage already inflicted by his many failed policies is staggering. But Biden and House Dems continue to unleash their unrelenting attack on American families with no end in sight.\n\nHow do you think year two will go?","date":"Tue Jan 18 22:52:07 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Proud to join @RepGregMurphy in urging NIH to examine the impact of COVID-19 lockdowns and closures on the American people. Lockdowns have kept our children out of the classroom and will have drastic impacts.","date":"Tue Jan 18 21:47:51 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Secretary Cardona should resign IMMEDIATELY and explain himself to the American people. \n\nThe Biden Administration’s war on parents is absolutely outrageous and should infuriate every family across this nation.\n\nhttps://t.co/2Bg0rUye1T","date":"Tue Jan 18 19:12:18 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Over the weekend, families across Alabama and the nation were met with the shocking sight of empty shelves &amp; soaring prices at grocery stores. \n\nBut Biden refuses to address his failed policies that have fueled inflation, broken our supply chain &amp; emptied our shelves. https://t.co/veOmaVZaMw","date":"Tue Jan 18 15:11:42 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It was an honor to speak at Enterprise City Hall yesterday celebrating the life of Martin Luther King Jr. Thank you, Mayor Cooper, for having me and for leading the community. It was great to listen to many stories about how #MLK  has shaped the lives of so many in our community! https://t.co/4RVnJXmS87","date":"Mon Jan 17 22:39:40 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Dr. Martin Luther King, Jr.’s courage, strength, compassion, and love for others took him on a mission to secure civil rights and equal opportunities for all Americans. \n\nAs we celebrate today, may we honor him by loving one another and working to heal our nation. https://t.co/Q3LSywl3c6","date":"Mon Jan 17 17:08:11 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Join me for a Back the Blue telephone townhall event this Thursday for law enforcement officers, families, and supporters! We will discuss issues facing law enforcement officers and our nations, ask questions, and participate in surveys during the call. All are welcome to join! https://t.co/geipKyBISH","date":"Sat Jan 15 19:10:08 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"#TeamMoore was on hand this week to celebrate the ribbon-cutting at the new Medical Air Rescue Company in Andalusia! The new site will provide safe, reliable medical air transport across the United States. Thank you for serving our community! https://t.co/O1pg9qYUbZ","date":"Fri Jan 14 16:14:32 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"My statement on the Supreme Court halting President Biden’s unconstitutional vaccine mandate.⬇️ https://t.co/4VziMaMSXO","date":"Fri Jan 14 01:00:21 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden was struck with two MAJOR blows against his socialist agenda today: \n\n1. SCOTUS blocks Biden's unconstitutional OSHA vaccine mandate\n2. Senate derails Biden's election takeover bill","date":"Thu Jan 13 20:37:50 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨BREAKING: The Supreme Court just blocked the Biden administration's unconstitutional vaccine mandate for businesses with over 100 employees. The American people will not stand for Biden's vaccine mandate. The final battle is not over - I will keep fighting for our freedoms!","date":"Thu Jan 13 19:48:05 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Democrats want to cancel out YOUR vote as an American citizen with their \"voting rights\" scheme.","date":"Thu Jan 13 15:30:15 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today my Republican colleagues brought my bill to expand GI Bill benefits to members of the National Guard to the House floor for a vote. Although we didn’t get a win today, I will not stop fighting for our veterans!\n\nhttps://t.co/ivau25IbrT","date":"Thu Jan 13 02:19:56 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"When is the last time we saw inflation like this? According to @BLS_gov, the University of Georgia football program had already begun its historic 40-plus year championship drought! https://t.co/SLQIdw8ZKA","date":"Wed Jan 12 20:21:57 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Pelosi is stepping on the gas with Dems' \"reform our elections system\" scheme to empower the fed government to unconstitutionally control local elections. This is the same party that wants non-citizens to vote in our elections yet they claim to be worried about election security?","date":"Wed Jan 12 19:42:31 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Speaker Pelosi needs to stop dragging her feet and take action to hold Big Tech accountable for its dangerous behavior.","date":"Wed Jan 12 18:55:35 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"No caption needed. https://t.co/XWIADqDsjP","date":"Tue Jan 11 18:15:39 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today is National Human Trafficking Awareness Day. Human trafficking is modern-day slavery and one of the fastest-growing criminal enterprises in the world.","date":"Tue Jan 11 17:03:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Unfortunately, under the guise of creating a \"compassionate\" open border policy, Biden has effectively ceded control of our southern border to human traffickers, putting our children &amp; communities in danger. We must secure our border to fully combat this scourge on our society.","date":"Tue Jan 11 17:03:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden has FAILED to deliver on his promises to \"shut down\" COVID-19 and that all Americans would \"have access to regular, reliable, and free testing.\" https://t.co/Bainyi8FPP","date":"Mon Jan 10 22:18:30 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our law enforcement officer risks their lives every day to serve Alabama’s communities and keep our families safe. Today and every day, we thank these brave men and women for their service. May God bless them and their families! #BacktheBlue https://t.co/3FY9Tgaydf","date":"Sun Jan 09 18:29:52 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today, the Biden administration is appearing before the Supreme Court to argue their unconstitutional vaccine mandate. \n\nIt is time for the courts to stand up against this mandate. Americans should not be forced to choose between taking a vaccine and providing for their families.","date":"Fri Jan 07 19:48:18 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This disappointing jobs report is just the latest unfortunate sign that Biden’s economic crisis will continue into 2022.","date":"Fri Jan 07 16:10:59 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Another discouraging jobs report under President Biden’s leadership. Just like his vow to \"shut down\" the coronavirus, President Biden has fallen short on his promise - reporting only 199,000 added in December- less than half of the jobs projected.","date":"Fri Jan 07 16:10:58 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The violence one year ago today has no place in politics, and all those who broke the law must face the legal consequences of their actions through our judicial system.\n\nMy full statement⬇️ https://t.co/ZlI24MnjcH","date":"Thu Jan 06 19:16:40 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Had a great meeting this morning with my friend Mayor Gillespie of Prattville! We discussed the city’s growth, exciting projects that are in the works, as well as the many challenges the city faces due to inflation and bad policies from this administration. https://t.co/doG6Kxg0z2","date":"Wed Jan 05 22:23:28 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It was a pleasure sharing our story of how the Lord has shaped our lives and led us to serve the great people of Alabama's Second District! Even through difficult times, the Lord has always guided us and comforted us, and I hope you’ll enjoy our story.\n\nhttps://t.co/94fbywWHwl","date":"Wed Jan 05 16:04:22 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We stopped by the legendary Bates House of Turkey yesterday afternoon! Enjoyed meeting with friends, local officials, and folks who stopped by to talk one-on-one with their Congressman. I look forward to being back in Butler County soon! https://t.co/9Q7gQkpr5i","date":"Wed Jan 05 00:29:49 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Regardless of the charges an incarcerated person faces, correctional authorities should respect and uphold their civil rights &amp; protect their health &amp; safety. In this country they have the presumption of innocence. \n\nProud to join my friend @RepAndyBiggsAZ!","date":"Tue Jan 04 21:41:27 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Tune in tomorrow at 9am CT to @700club to watch Heather and me share our testimony. God has led us down a long road to public service, and we are excited for the opportunity to share with you the pivotal moments that have shaped the direction of my life, faith, and my career. https://t.co/H0etgpiazz","date":"Tue Jan 04 20:54:22 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It was great to grab a bite to eat yesterday at the Chicken Shack in Luverne for some GREAT fried chicken. It was a pleasure talking with young future voters, local leaders, and folks just dropping in for some fine Southern food about issues that are important to them! https://t.co/oUzIxDpUxR","date":"Tue Jan 04 16:09:21 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"One year ago, I was sworn into Congress to serve the great people of Alabama's Second District. It remains an honor to fight in Washington for the people of Alabama and this nation. God bless this nation and you all! https://t.co/x7CYUViLy6","date":"Mon Jan 03 21:25:40 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We cannot become numb to Big Tech censorship and cancel culture. Big Tech began silencing conservative voices that challenged the views of their left-wing CEOs. Now Twitter suspended a sitting member of Congress. This is an attack on our freedoms!","date":"Mon Jan 03 19:09:45 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I want to wish you a happy and prosperous New Year! \n\nGod bless you all! https://t.co/GktntQ3LEe","date":"Sat Jan 01 19:45:22 +0000 2022","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"As we close out 2021, find out what I am looking forward to next year!⬇️ https://t.co/l5djZG6CK9","date":"Fri Dec 31 23:50:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This year, I was incredibly proud that we were able to turn what began as an idea to more fully honor our national commitment to our veterans into the law of the land! \n\nWatch to find out more about my biggest accomplishment as a freshman member! https://t.co/64Y28BkXwd","date":"Fri Dec 31 02:33:19 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Can you guess what my biggest surprise has been this year? \n\nWatch here to find out!⬇️ https://t.co/2XJJJPgIJb","date":"Thu Dec 30 00:40:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Tune in today to find out who my best friend in Congress is! https://t.co/EIYMjWnD8s","date":"Wed Dec 29 17:36:46 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/3o3GhiUpAk","date":"Mon Dec 27 22:01:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Throughout 2021, Team Moore has been committed to delivering results for families across the Wiregrass. It's truly an honor to represent you in Congress, and I look forward to continuing to serve the Second District! https://t.co/3adLaYwgLT","date":"Mon Dec 27 17:36:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On behalf of the Moore family, I want to wish everyone a Merry Christmas and a wonderful New Year! During this joyous season, I pray that you take time to celebrate the birth of our Lord and Savior, Jesus Christ. https://t.co/695nBI3Bq8","date":"Sat Dec 25 21:57:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed speaking with members of the Opp Rotary Club yesterday! We discussed the unprecedented crises that our nation is facing but also highlighted wins in Washington from my first year in Congress. Thanks for having me! https://t.co/JynmxCi4wE","date":"Thu Dec 23 16:15:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"3 days until Christmas &amp; @POTUS thinks he’s saved Christmas. But our nation continues to face labor shortages, rising prices &amp; increased inflation because of Biden’s socialist agenda. The American people are suffering, but White House spin won’t help them\n\nhttps://t.co/Nu52kb5HG0","date":"Wed Dec 22 23:34:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden’s year of crisis: \n\n🚨Border Crisis \n🚨Economic Crisis \n🚨Energy Crisis \n🚨National Security Crisis \n\nIt’s been a long year of unprecedented crises because of Joe Biden and House Democrats’ failed leadership and Far-Left socialist agenda.","date":"Wed Dec 22 21:04:18 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Here’s a special holiday message to our service members, veterans, and their families. Merry Christmas, and THANK YOU! https://t.co/rUx9675U4v","date":"Tue Dec 21 23:35:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's dangerous open borders agenda is a serious national security threat to our nation. It is clear that President Biden - and his Border Czar Kamala Harris - has no plan to address this crisis while he rolls out the red carpet for illegal immigrants &amp; potential terrorists.","date":"Mon Dec 20 21:49:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yep, you read that right. This is shameful fear-mongering from the President of the United States. Biden has resulted in targeting the unvaccinated Americans once again. This is disgusting and unacceptable and a clear attempt to divide Americans. https://t.co/j99fAZyNBl","date":"Mon Dec 20 16:05:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We didn’t let the rain get us down yesterday! It was wonderful shopping and dining in downtown Enterprise after participating in Wreaths Across America Day. https://t.co/jAHgsA8WL2","date":"Mon Dec 20 00:07:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"For months, I’ve said the #BBB agenda would increase our debt behind recovery and exacerbate our existing economic crisis. Joe Manchin’s announcement today that he will not support President Joe Biden’s radical far-left socialist spending bill is welcome news for all Americans.","date":"Sun Dec 19 20:03:11 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wreaths Across America Day is a chance to honor our veterans, those currently serving, and remember those who made the ultimate sacrifice. \n\nDuring the holiday season, let’s not forget about the families that have an empty seats for their loved ones.","date":"Sat Dec 18 22:44:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today, I had the privilege to join Wreaths Across America in Enterprise. It was a moving tribute to Hugh and Lesa Neenan, whose son Brenden tragically lost his life in Afghanistan. Special thanks to Travis Parker for organizing Wreaths Across America in the Wiregrass. https://t.co/XMdSNJ2GQi","date":"Sat Dec 18 22:43:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This morning I stopped by the Wetumpka Civic Center. Enjoyed getting in the holiday spirit with so many old friends and all the new ones I made. My Wetumpka office is right next door, so I asked everyone to come by &amp; see us and let us know whenever we can help them! https://t.co/ERW1Xfrvmr","date":"Fri Dec 17 22:44:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This fall, we have had four incredible interns assisting our DC office. Thank you, Mathew, Adam, JP, and Rue, for your hard work &amp; service to Alabama's Second Congressional Office. You will be greatly missed, but I wish each of you well in your future endeavors! https://t.co/rXXHMGiNB3","date":"Fri Dec 17 19:24:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"ICYMI: Check out my latest column for an update on my fight to fund our national defense and protect the rights of our servicemembers, the Democrats' neglect to fund the government, and the record-high inflation plaguing American families.\n\nhttps://t.co/8xnMDAn4C8","date":"Thu Dec 16 20:34:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats on how far into debt they’re willing to send our country. https://t.co/u1s28HexHT","date":"Wed Dec 15 20:43:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats have made it very clear they are out of touch with the needs and concerns of the American people.\n\nAmericans everywhere are staring down skyrocketing gas and energy prices, rising inflation, a supply chain crisis, and a border fiasco.","date":"Wed Dec 15 19:30:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Speaker Pelosi and her Big Government Democrats have made clear that there is no limit to how much of your money they are willing to spend to grow their own power. Last night, I voted against increasing the debt ceiling by $2.5 trillion.","date":"Wed Dec 15 17:02:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Bill of Rights Day! Our Founding Fathers created this document to safeguard our God-given rights and liberties that even today are under attack. We must never let up in the fight to protect what makes our Republic great! #GodBlessAmerica https://t.co/0w6y52aTun","date":"Wed Dec 15 16:21:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Speaker Pelosi must call a vote to nullify President Biden's destructive vaccine mandate for private businesses NOW!","date":"Wed Dec 15 00:24:10 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On this day, Alabama joined the union as the 22nd state! Happy Birthday Alabama. https://t.co/5hTJ5IadG0","date":"Tue Dec 14 18:31:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden told the American people that his #BBB plan was fully paid for. But this bill will not only cost the American people $4.9 trillion but also add over $3 trillion to crippling debt. This out-of-control spending will saddle our grandchildren with crippling debt.","date":"Tue Dec 14 00:37:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"For 385 years, the National Guard has kept its promise to America: Always Ready, Always There. As a former Guardsman, I think back fondly on all those I served with &amp; the experiences we shared. I hope you'll join me in wishing all members of the National Guard a happy birthday! https://t.co/i7JzEvRngs","date":"Mon Dec 13 15:50:35 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I just voted against Adam Schiff's reckless Protecting Our Democracy Act. Democrats are incapable of turning away from their fanatical obsession with President Trump and getting to work to fix the multiple catastrophes the Biden administration has unleashed on American families.","date":"Thu Dec 09 22:56:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last night the Chronic Wasting Disease (CWD) Research and Management Act passed the House with bipartisan support. Proud to co-sponsor this bill that will help research and prevent CWD from taking hold in Alabama and across the nation.","date":"Thu Dec 09 15:51:46 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"So the President is going to make sure the American people are paying their “fair share” at the gas pump?🤔\n\nThe American people are paying 55% more nationally for a gallon of gas because of Biden’s anti-energy agenda.","date":"Thu Dec 09 15:07:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Congrats to Suni Lee on being named Sports Illustrated's Athlete of the Year! From an Auburn grad to an Auburn student, War Eagle!","date":"Wed Dec 08 21:11:39 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wonderful meeting with the Alabama Cattlemen's Association. We discussed labor shortages and other challenges cattlemen are facing in Alabama. Always great to see friends! https://t.co/n7ViXPVREg","date":"Wed Dec 08 20:09:47 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden and House Democrats have FAILED to address \n\n❌Inflation \n❌Rising Gas Prices \n❌Border Crisis\n❌Fentanyl Crisis\n❌Supply Chain Crisis","date":"Wed Dec 08 19:01:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Tonight, I vote YES on the National Defense Authorization Act.\n\nRead my full statement here⤵️ https://t.co/biJH5mOyR5","date":"Wed Dec 08 03:11:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden's supply chain crisis and rising inflation are hitting home for farmers in Alabama. Farmers are the backbone of our nation, but the unprecedented challenges they are facing are almost insurmountable.\n\nhttps://t.co/04Nim8q9my","date":"Wed Dec 08 00:09:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Congrats to @AlfaFarmers for this remarkable milestone! Thank you for serving the hardworking farming families who keep America fed and clothed.\n\nhttps://t.co/nQpnGHQs7J","date":"Tue Dec 07 22:54:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"A huge victory for freedom! A federal judge in Georgia has blocked the Biden administration's mandate for federal contractors' employees to be vaccinated The final battle is not over - I will keep fighting!\n\nhttps://t.co/UNmChOZXRk","date":"Tue Dec 07 19:20:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On this National Pearl Harbor Remembrance Day, we remember and honor those who perished while defending our nation 80 years ago today. May we never forget the 2,403 Americans who lost their lives protecting our freedom. https://t.co/lkl86TjYcW","date":"Tue Dec 07 15:16:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great time at this weekend's Christmas parade in Rehobeth! It was an honor to talk with some constituents and join them in kicking off the holiday season. https://t.co/e38zPiPsr2","date":"Mon Dec 06 23:53:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden's reckless and dangerous federal vaccine mandate impacts Americans across the nation. Thank you @VernBuchanan &amp; @RepLarryBucshon for leading this effort for health care workers! I will continue to fight against the unconstitutional vaccine mandate.","date":"Mon Dec 06 17:09:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Heather and I send our deepest condolences to the family of Bob Dole. Senator Dole’s dedication and service to the United States has shaped our nation for generations to come. He was a true patriot and will be missed by many.","date":"Mon Dec 06 01:10:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I'm proud to officially join the Congressional FFA Caucus! Agriculture is so important in the Wiregrass, and I'm excited to support the caucus's mission of strengthening relationships between members of Congress and agricultural education students and FFA members.","date":"Fri Dec 03 19:49:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yet another miserable job report under this administration. The November jobs report missed the mark - reporting just 210,000 jobs created. Despite President Biden's promise for more jobs, his mishandling of the economy continues to fail American workers and families.","date":"Fri Dec 03 15:04:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I voted NO on the latest Democrat short-term spending bills. Democrats have been so focused on sticking the American people with their radical tax-and-spend agenda that they have once again neglected to perform the basic role of government.","date":"Thu Dec 02 22:43:35 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It took a federal court order to force the Biden administration to reinstate President Trump's \"Remain in Mexico\" policy. \n\nThe Remain in Mexico policy will alleviate law enforcement who have been working overtime to combat the crisis Biden has created.\n\nhttps://t.co/QAPDzqGXJI","date":"Thu Dec 02 21:44:18 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This holiday season, when you pay higher prices, shelves are empty, and your gifts arrive after Christmas, you can thank President Biden!","date":"Thu Dec 02 16:09:39 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today at the SCOTUS, I talked with a group of pro-life medical professionals about the major abortion case before the Court this morning. This is a monumental day in our nation's history as the Supreme Court considers striking down Roe v. Wade. https://t.co/QHNFIih4TM","date":"Wed Dec 01 21:10:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On December 1, 1955, Rosa Parks was arrested for refusing to give up her seat on a segregated bus in Montgomery. Her simple act of protest helped fuel a fight for equality that resonated worldwide and spurred our nation to more fully realize the ideals upon which we were founded.","date":"Wed Dec 01 20:51:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The American people, even those who have chosen to get vaccinated, are overwhelmingly AGAINST un-American government #VaccineMandates.\n\n@SenateGOP should use all weapons at its disposal to fight for freedom. This fight is too important to sit out.\n\n#DefundVaxMandates","date":"Wed Dec 01 16:05:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"As a father and a Christian, I will continue to fight for the rights of all Americans - born and unborn.","date":"Wed Dec 01 15:20:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"All life is precious and worth saving.","date":"Wed Dec 01 14:56:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today, SCOTUS hears a major pro-life case.\n\nRoe v. Wade was a terrible decision by an activist court that has allowed abortion to tragically end over 62 million lives. \n\nEvery life is precious &amp; I will always unapologetically fight to protect the sanctity of life at every stage.","date":"Wed Dec 01 14:51:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Americans will continue to face skyrocketing inflation and supply chain shortages because of House Democrats' out-of-control spending. \n\nWhat to expect this Christmas: \n\n🎄prices up \n🛍 shoppers will pay 9% more \n⛽️ prices up\n🏠 families will pay more to heat their home","date":"Tue Nov 30 21:40:35 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I’m incredibly proud that we were able to turn what began as an idea to more fully honor our national commitment to our veterans into the law of the land. It is humbling that the bill’s name honors the legacy of Col. John McHugh, whose family resides in the Wiregrass!","date":"Tue Nov 30 20:17:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"BIG News! Today, the President signed into law the Colonel John M. McHugh Tuition Fairness for Survivors Act of 2021, a bill that I was fortunate enough to introduce this year with Republican Senator Jerry Moran of Kansas.","date":"Tue Nov 30 20:17:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Americans are starting to feel the pain of Biden's anti-energy policies in their wallet. Last week Biden announced that the @ENERGY would release 50 million barrels of oil held in the U.S. Strategic Petroleum Reserve. This move was another failed attempt to salvage this crisis.","date":"Mon Nov 29 23:27:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden has banned travel from 8 countries in Africa due to the new COVID variant.\n\nBut when President Trump did the same thing, it was a \"disgrace\"\n\nInteresting.","date":"Mon Nov 29 15:26:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wishing all of those celebrating today a happy first day of #Hanukkah! I hope you have a safe and happy Hanukkah. https://t.co/O8mmMrpGQl","date":"Sun Nov 28 20:46:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today is #SmallBusinessSaturday! Small businesses are the backbone of our nation. I am thankful for all the hardworking small businesses owners in #AL02. I encourage you to join me and shop local this holiday season.","date":"Sat Nov 27 20:01:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Thanksgiving! We have so much to be thankful for in the greatest nation on earth. Our thoughts and prayers are with the loved ones who are unable to join and those in uniform, as we are forever thankful for their service. https://t.co/YZkfZLuueP","date":"Thu Nov 25 17:13:58 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We need to restore fiscal sanity to Washington!","date":"Wed Nov 24 21:44:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Proud to join my colleagues on @HouseAgGOP to better understand the scope and impact of @POTUS' vaccine mandate. \n\n@USDA supports our farmers, ranchers, consumers, and rural communities, and I have serious concerns that the vaccine mandate will jeopardize that mission.","date":"Tue Nov 23 22:19:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"There was nothing \"strategic\" about the SPR release. It was a desperate attempt to boost @POTUS's sagging poll numbers, not lower the energy prices hammering Americans.\n\nJoe Biden's economic ineptitude is the cause of our economic, energy, and inflation crises.","date":"Tue Nov 23 18:10:31 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":".@POTUS is now releasing oil from the nation's Strategic Petroleum Reserve to tame the price of gas. America is foreign oil-dependent because of Biden. He has destroyed our energy independence in less than a year, with the price of gas now over 60% higher than this time last year","date":"Tue Nov 23 16:01:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thanksgiving 2021 = Turkeys stuffed with inflation #ThanksgivingTax","date":"Mon Nov 22 18:49:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I want to thank everyone in AL-02 and across the nation who work to protect and advance public health. Thank you for your efforts in the last year and a half to meet the needs of communities across the nation. Happy #PHTYD! #PublicHealthHeroes https://t.co/siI6C2PKig","date":"Mon Nov 22 17:33:39 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"My heart is heavy for the Waukesha community and the families who lost loved ones. Thank you to the law enforcement and first responders for their swift action as they investigate and pursue justice. Please join me and Heather in praying for all those impacted.","date":"Mon Nov 22 14:35:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I voted NO on the Democrats’ massive multi-trillion dollar reconciliation bill. Read my full statement here ⬇️ https://t.co/0wj84IwEGm","date":"Fri Nov 19 23:25:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"America is in CRISIS, and the Democrats are about to vote on the most reckless tax and spending bill in our nation's history. \n\nMake no mistake: This bill is nothing more than a wish list of Far-Left Socialist policies that the American people have already rejected.","date":"Fri Nov 19 13:30:39 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This is NOT what unity looks like! #DemsinDisarray https://t.co/IZJSCIJ5R2","date":"Thu Nov 18 21:59:50 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yet ANOTHER incentive for illegal immigration from the Biden administration and @HouseDemocrats.\n\nDems are one step away from funding flashing neon signs.","date":"Thu Nov 18 18:02:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Too many politicians will gladly endorse trillions in new spending if a few pennies of pork come back to their district. They put their political futures above their country.\n\nI'm sick of it. And the American people are too.\n\nWe MUST put a stop to the out-of-control spending NOW! https://t.co/4YfZxThL4V","date":"Thu Nov 18 17:48:39 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I am proud to co-sponsor the bipartisan Chronic Wasting Disease Research and Management Act to help research and manage the spread of #CWD. I'll continue doing what I can in Washington to help prevent CWD taking hold in Alabama. \n\nhttps://t.co/UYxlErJgMj","date":"Thu Nov 18 14:26:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden's vaccine mandates are a blatant overreach of the federal government. Has Biden turned his back on individual liberties? This is a decision that the American people must make with their doctor, not Joe Biden. I joined members of the @freedomcaucus to discuss. https://t.co/ohbfRzXnYr","date":"Wed Nov 17 21:24:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The vaccine mandates on the American people is yet another overreach of this administration. \n\nFederal vaccine mandates will only further divide America and harm our national security.\n\nI joined my Republican colleagues to protect Americans’ freedom and liberties.","date":"Wed Nov 17 20:46:45 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Democrats have been caught red-handed telling the American people lies about their far-Left socialist spending spree. Biden claimed it would cost the American people ZERO dollars?! And now the White House is now telling House Democrats that it will NOT be fully paid for?","date":"Wed Nov 17 16:55:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrat Hypocrisy Alert: Rules for thee but not for me! Why do Democrat politicians continue to break their own rules when they mandate Americans follow them? People are sick and tired of the shameless hypocrisy. https://t.co/TxhYuXUeY9","date":"Tue Nov 16 20:33:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We are witnessing the worst border crisis in our history, with yet another month of record-high border crossings. The Biden administration continues to earn a failing grade in addressing one of the most important issues of our time.\nhttps://t.co/NCSVYOyK7s","date":"Tue Nov 16 19:13:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨Today, at 3:00 p.m. CT, I will be hosting a telephone town hall event on issues facing our veterans. Call in at the number below, watch on my website or Facebook. I look forward to answering your questions! https://t.co/QSsynyACnR","date":"Tue Nov 16 17:09:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The bill passed tonight will help ensure that the loved ones left behind by our fallen heroes can have the affordable education opportunities we have promised them. Thank you to my partner Senator @JerryMoran for his hard work on this legislation. Now to the President's desk!","date":"Tue Nov 16 00:27:10 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"BIG news! The House passed my bill, the Col. John M. McHugh Tuition Fairness for Survivors Act, that expands veterans benefits to surviving beneficiaries! Col. McHugh's family lives in my Alabama district, so it gives me great pride that the name of this bill honors his legacy. https://t.co/m08qcw2SnF","date":"Tue Nov 16 00:27:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Tune in Folks!","date":"Mon Nov 15 20:04:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Gas prices continue to soar under the Biden Administration. The national average price for a gallon of gasoline is now 🚨 61% HIGHER 🚨 than it was this time last year. And now President Biden's Energy secretary can't rule out a $4.00 national average for gas?!","date":"Mon Nov 15 14:34:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"#BritneyIsFree","date":"Sun Nov 14 02:29:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats are responsible for causing the worst crisis at our southern border we have seen in two decades. The proposals included in their so-called spending bill offers mass amnesty to up to 10 million illegal immigrants, and will drive even more migrants to our border.","date":"Sat Nov 13 19:48:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today, I toured Milstead Farm Group's cotton gin operation in Shorter. Cotton is the only agricultural crop that provides both food &amp; fiber for people around the globe. I am always proud to fight for our farmers! https://t.co/hXTdrIbVci","date":"Sat Nov 13 02:03:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Too many Americans have been wrongfully subjected to predatory conservatorships. I’m glad that Britney Spears’ conservatorship is finally over, and I hope this brings attention to the need for reform. #FreeBritney #FreedBritney\n\nhttps://t.co/lLN0vCnroa","date":"Fri Nov 12 22:47:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"COVID restrictions have been tough on everyone, including our small businesses. I wrote the Small Business Administration to bring attention to the challenges small businesses are facing with EIDL loans and requested an update on efforts to improve and streamline the program. https://t.co/kuvNHnC0KN","date":"Fri Nov 12 20:42:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Democrats are pulling out all the stops to punish right-to-work states like Alabama and pad the pocket of their union leadership pals. The tax-and-spend spree will give union members a tax deduction for their dues at the expense of taxpayers.","date":"Fri Nov 12 16:27:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today and every day we thank our veterans for  defending the freedoms we hold dear. I pray God's blessings on every veteran in Alabama and our nation. Happy Veterans Day! https://t.co/xwRQbM9pFr","date":"Thu Nov 11 13:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"More bad - but predictable - news for job-seeking Americans AND our supply chain crisis.\n\nWith expensive #VaccineMandates being forced on private businesses, \"[s]ome bosses are weighing whether to delay hiring to keep head counts in the 90s.\"\n\nWhy is Biden putting America last?!","date":"Wed Nov 10 19:34:45 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"📈#Bidenflation continues to rise. Last month the Consumer Price Index rose 6.2%. Inflation is now at a 30-year high. Americans are paying more for just about everything because of President Biden and the Democrats' insane spending.","date":"Wed Nov 10 19:30:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy birthday, U.S. Marine Corps! For 246 years, these brave men and women have fought to keep our nation safe. Thank you #USMC for your faithful service! https://t.co/WZIcV0geFS","date":"Wed Nov 10 15:37:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I was honored to speak at the annual Second Congressional District Municipal Association Dinner and Meeting. I discussed what my office is doing in Washington and how we can be helpful to constituents and veterans to the people in Alabama's 2nd District! https://t.co/TqZa6BTqXb","date":"Wed Nov 10 00:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday, we welcomed home the 908th Airlift Wing to Maxwell Air Force Base. It was the largest deployment in the history of the wing. Thank you to our airmen for their service to our great country! https://t.co/iORb0Vr6Ae","date":"Tue Nov 09 20:55:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thanksgiving 2021 is expected to be the most expensive meal in the history of the holiday, thanks to Biden’s #ThanksgivingTax on American families. \n\n🦃 up 27% \n🥧 up 17% \n🥔 up 13% \n🥕 up 47% \n🍎 up 7.8% \n\nAmerican families will feel the impact of President Biden's policies.","date":"Tue Nov 09 16:15:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Another \"hidden gem\" in Democrats' socialist spending scam: \n\nTax credits for journalists.\n\nDems' want to pay the salaries of the reporters who cover for them - instead of covering the news. This is a waste of your tax dollars and amounts to a federal subsidy for fake news. https://t.co/PVCSRUETZL","date":"Mon Nov 08 19:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden administration reopened our northern border to fully vaccinated Canadian travelers. \n\nBut this administration will not only help illegal migrants cross our southern border, but they’ll help you get to your final destination, no testing or proof of vaccination required!","date":"Mon Nov 08 15:19:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our Border Patrol released 283,000 migrants into the United States over the past year, leaving 95,000 untracked. \n\nFolks, this means that 95,000 illegal immigrants are roaming in the United States unaccounted for. \n\nhttps://t.co/0gZa3rg48M","date":"Sun Nov 07 18:01:58 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Dozens of my colleagues led by @repkevinhern stood together this week against vaccine mandates. American citizens should never be forced to choose between taking a vaccine and providing for their families! https://t.co/jVkYnt8ELy","date":"Sat Nov 06 22:07:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last night, I voted NO against President Biden and Speaker Pelosi’s $1.2 trillion “infrastructure” bill. Only about 10% of this bill will go to roads and bridges, and the other 90% of the bill is hijacked by the Democrats' radical progressive wishlist.","date":"Sat Nov 06 13:37:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"2/2 Don’t buy the talking points – despite their fancy names, the bills being considered are not about infrastructure or the American people, but POWER. I am a firm NO on both pieces of legislation!","date":"Fri Nov 05 21:43:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"1/2 The American people have already rejected Pelosi’s radical Far-Left agenda, but House Democrats are trying to ram through their massive socialist tax-and-spend bills anyway.","date":"Fri Nov 05 21:43:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Made in America tax is just one-more harmful and dangerous part of the Democrats' radical #BuildBackBroke bill. It's simple: Pelosi's Made in America tax will benefit foreign workers at the expense of American workers. https://t.co/AhiKULmxSr","date":"Fri Nov 05 19:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This reconciliation bill the Democrats are attempting to ram through is the most radical Far-Left piece of legislation ever, and it has not even been scored by the Congressional Budget Office, making it impossible to know how much it will cost. #NoScoreNoVote","date":"Fri Nov 05 18:19:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 PUBLIC SERVICE ANNOUNCEMENT 🚨 \nDon’t forget to do something you shouldn’t HAVE to do and set your clocks back an hour Saturday night. I’ve cosponsored legislation to permanently do away with time changes, and Congress needs to make it happen! #DaylightSavingTime #FallBack https://t.co/0CYMWR4DZ0","date":"Fri Nov 05 14:01:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The American people are pleading for secure borders and will not stand for the Biden admin turning ICE agents into \"law enforcement in name only.\"\n\n@SecMayorkas must reverse dangerous @DHSgov  policies that hamstring our law enforcement at the border from doing their jobs.","date":"Thu Nov 04 19:14:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I’m going live in a moment with @LelandVittert on @NewsNationNow to discuss how last night’s elections will impact Capitol Hill. I hope you can tune in!","date":"Wed Nov 03 23:19:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨🚨HAPPENING NOW: @HouseDemocrats are holding a hearing NOW on their far-Left socialist reconciliation package. They released the 2,000+ page bill ONE HOUR AGO. NO ONE could have read this bill. And its missing a @USCBO score, so its IMPOSSIBLE to know the bill's cost. SHAMEFUL!","date":"Wed Nov 03 21:10:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The people have spoken, but House Democrats aren't listening.\n\n@SpeakerPelosi, the American people want freedom, NOT Big Government.","date":"Wed Nov 03 19:26:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats LITERALLY want taxpayers to pay for illegal immigration.\n\nWill illegal immigrants get a $450,000 check too?","date":"Tue Nov 02 19:29:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I'm proud to stand with @GOPLeader and my Republican colleagues in fighting to protect small businesses from Democrats' radical reconciliation bill. Learn more about our fight here. ⤵️","date":"Tue Nov 02 18:57:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Check out my @dcexaminer op-ed on the Democrats' IRS surveillance scheme - and why it is so important we fight against it! ⤵️\nhttps://t.co/TOf2QK1sWW","date":"Tue Nov 02 17:15:45 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Most administrations have economic advisors, but apparently President Biden opted for a drum circle.\n\nAny wonder why we have an economic crisis?","date":"Mon Nov 01 21:26:11 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I hope you can tune into @newsmax Sunday at 10amCT!","date":"Fri Oct 29 18:54:50 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"If you're a foreign citizen on the fence about illegally entering the U.S., how would you react if you heard Biden would cut you a $450,000 check for the “trauma” of breaking our laws?\n\nBiden is intentionally making the #BidenBorderCrisis worse.\n\nhttps://t.co/m5r9kfvjzf","date":"Thu Oct 28 21:07:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Its unthinkable that the Biden admin would push out 100s of border patrol &amp; ICE agents during the middle of the #BidenBorderCrisis after hailing them as heroes during the early days of the pandemic.\n\nProud to join @RepTonyGonzales asking @SecMayorkas to cancel #VaccineMandates.","date":"Thu Oct 28 16:33:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Save my friends - fire Fauci! #FauciLiedBeaglesDied #BeagleGate https://t.co/8AzURfAQwh","date":"Thu Oct 28 15:35:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 The Democrats' plan to have the IRS spy on your family and small business must be stopped. Listen in on our Republican roundtable to learn more about their scheme and why we are fighting it!","date":"Thu Oct 28 14:13:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"⛽ Today in Montgomery, folks are paying $3.09/gallon of gas. In Enterprise, its $3.21. In Eufaula &amp; Troy, a staggering $3.29!\n\nThe average Alabamian will pay about $23/week more on gas than a year ago - that's $100 more each month, &amp; almost $1,200 more a year!\n#BidenEnergyCrisis https://t.co/eyYREwTldS","date":"Wed Oct 27 20:09:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The #BidenEnergyCrisis is driving up gas prices, but Democrats want to make it worse by restricting American energy production and ramming through their tax-and-spend agenda.\n\nJoin us live to hear how Republicans want to make it easier for you to fill up your tank!","date":"Wed Oct 27 19:25:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Folks in the Wiregrass agree with you, Coach!\n\nThe IRS should NEVER be given free reign to snoop through Americans’ bank accounts.","date":"Wed Oct 27 19:18:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Don't spill the gravy! \"Almost every ingredient\" in your Thanksgiving meal will cost more thanks to rising prices. \n\nThanks, #Bidenflation!","date":"Wed Oct 27 15:57:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats are doubling down on the #BidenEnergyCrisis by introducing a tax for heating your home - just in time for winter!\n\nBiden and his Democrats are determined to put #AmericaLast. https://t.co/bzV0cI1RIJ","date":"Tue Oct 26 22:16:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday the House passed a bill to award the #CongressionalGoldMedal to the 13 heroes we lost during our evacuation from Afghanistan. This is just a small way to honor these Americans &amp; I was proud to cosponsor this legislation. Thank you @RepLisaMcClain for leading the effort. https://t.co/oyFtS05EsP","date":"Tue Oct 26 16:48:58 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden is forcing unconstitutional #VaccineMandates on Americans while ignoring unvaccinated law-breaking illegal immigrants.\n\nBorder arrests of illegals this year are at a 10-year low: only 72K! During the last admin we averaged 148K/yr. #BidenBorderCrisis\nhttps://t.co/ec16SvHpiS","date":"Tue Oct 26 16:38:22 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Looking forward to joining you at 4:30 to talk military #VaccineMandates, @SenPhilWilliams!\n\nY'all can listen live here: https://t.co/iO7UzbcZoC","date":"Mon Oct 25 16:15:47 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"@USDA's #VaccineMandates for all state &amp; county FSA committee members/advisors is extremely short-sighted &amp; harmful to the communities USDA serves. I've asked @SecVilsack to exempt them or offer reasonable accommodations to allow them to continue their service while unvaccinated. https://t.co/7C432Peghq","date":"Mon Oct 25 14:44:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Too many policy changes – especially those impacting agriculture – occur far from those most often impacted. @SecVilsack should not hamstring USDA’s mission by punishing FSA leaders &amp; public servants with #VaccineMandates. Its the communities USDA serves who will suffer!","date":"Mon Oct 25 14:44:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden admin's $80 billion scheme to expand IRS data collection on millions of Americans is DANGEROUS.\n\nI'm proud to join 201 of my colleagues in standing with the American people against this outrageous proposal.\n\nThank you @RepTomEmmer for your leadership! https://t.co/OYLt294uZm","date":"Thu Oct 21 21:18:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats' mass amnesty plan affects each and every American. Join @GOPLeader Kevin McCarthy's roundtable discussion on how President Biden wants to make the #BidenBorderCrisis even worse, and how we should be handling this problem instead.","date":"Thu Oct 21 20:05:24 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":".@SpeakerPelosi, when reached in her gourmet ice cream cave, about rising prices for groceries https://t.co/TMDemVnSVq","date":"Wed Oct 20 15:14:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The only thing emptier than Joe Biden's campaign rallies are the Biden economy's grocery shelves. #SupplyChainCrisis","date":"Tue Oct 19 19:59:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden economy's rising prices are a tax on every American. #Bidenflation","date":"Tue Oct 19 19:55:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨We are in a ⚡#BidenEnergyCrisis 🔌\n\n⛽ $3.30 avg gas\n🚫Keystone Pipeline cancelled\n🛢️No new oil/gas leasing on fed land, triggering\n   📉U.S. GDP ⬇️ $700B and\n   💸$500B more for foreign energy through 2030\n⚖️Scales tipped to adversaries by begging OPEC &amp; Russia to ⬆️ output","date":"Tue Oct 19 14:26:39 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats think if they beat Americans over the head with this lie long enough and hard enough we will eventually accept it as true.\n\nDon't let 'em get away with it!","date":"Tue Oct 19 12:55:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"American citizens and servicemembers should not be forced to choose between taking a vaccine they don’t want and providing for their families. I'm thankful for my colleagues who were proud to stand alongside me and countless Americans in protesting these unjust mandates.","date":"Mon Oct 18 22:01:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"@TXRandy14 @RepMTG @RepClayHiggins @RepHerrell @RepAndyBiggsAZ @RepChipRoy @RepScottPerry @Rep_Clyde @RepMoBrooks @RepDanBishop","date":"Mon Oct 18 22:01:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I've written to @SecDef Austin requesting an immediate delay in implementing #VaccineMandates  on military servicemembers &amp; civilian contractors until concerns from the medical community re: potential health risks associated with the vaccine are more fully understood. https://t.co/icPzaUxdAc","date":"Mon Oct 18 22:01:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"So, @POTUS wants to spend BILLIONS in taxpayer $$$ to *checks notes* use the IRS to monitor taxpayers' everyday transactions?!\n\nThe American people won't stand for this latest overreach from the Biden admin. I'm proud to join the Prohibiting IRS Financial Surveillance Act.","date":"Mon Oct 18 20:29:16 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Colin Powell boldly chose a life of service to his country, and he should be remembered as one who persevered through incredibly difficult times in our history. Our nation is greater because of his service.\n\nRest In Peace, sir, and thank you! 🇺🇸","date":"Mon Oct 18 13:30:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"…as he intentionally divides us with vaccination requirements.","date":"Sat Oct 16 22:28:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Inflation is taxation!\n\n...but @HouseDemocrats want to raise taxes too.🤦🏼‍♂️","date":"Wed Oct 13 15:34:31 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In the middle of a crime epidemic, why is @TheJusticeDept is going after parents?!\n\nThe purpose of federal law enforcement is NOT to squash political dissent. Parents have every right to speak out against #CriticalRaceTheory and mask mandates for schoolchildren.","date":"Tue Oct 12 16:16:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden admin knew thousands of Haitians were coming to the border, but instead of taking decisive action, they squabbled amongst themselves and ultimately did nothing.\nUntil we get real leadership, the #BidenBorderCrisis will continue to get worse.","date":"Fri Oct 08 14:43:45 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Weaponizing DOJ to silence parents with legitimate concerns about the education of their children is a reprehensible abuse of power by the Biden admin. Big government must never supersede the role of parents in raising our children.\n\nThank you @RepLisaMcClain for your leadership!","date":"Thu Oct 07 19:24:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Candidate Biden's running mate said \"if Donald Trump tells us to take [the vaccine], I’m not taking it.\"\n\nBut now President Biden is making you choose between the vaccine and your job.\n\nIs this really about public health?🤔","date":"Wed Oct 06 19:49:46 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"After 8+ months of President Biden:\n\nEnergy crisis? ✔️\nBorder crisis? ✔️\nInflation crisis? ✔️\nCrime crisis? ✔️\nForeign policy crisis? ✔️\nLeadership crisis? ✔️✔️✔️✔️✔️\n\nThis isn't the \"return to normal\" we were promised. Its much, much worse.\n\nhttps://t.co/oTFus0Gx2T","date":"Wed Oct 06 19:08:10 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I am a proud believer in American exceptionalism. 🇺🇸","date":"Wed Oct 06 15:53:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Joe Biden wants his FBI to investigate parental involvement in the education of their own children as domestic terrorism, yet he insists protesters following his political opponents into bathroom stalls is \"part of the process.\"\n\nNothing will stop Democrats' pursuit of power.","date":"Wed Oct 06 14:10:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Hey @POTUS, if you were looking for the border, you missed it by 1,600 miles.\nNext time, don't ask your border czar for directions. @VP #BidenBorderCrisis https://t.co/1QrNJt0uc8","date":"Tue Oct 05 13:25:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"A multi-trillion dollar tax-and-spend scheme seems like a poor solution to record inflation, but that is the cornerstone of the Biden agenda.","date":"Sat Oct 02 19:34:12 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The #BidenBorderCrisis has shown no signs of letting up, yet the officials in the Biden Administration clown car, with Border Czar Kamala Harris riding shotgun, are rescinding President Trump's \"Remain in Mexico\" policy. \nDoes this admin WANT more illegal immigration?!?","date":"Fri Oct 01 19:19:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Hmm... think @SpeakerPelosi might be nervous about her deal falling apart?🤔","date":"Fri Oct 01 17:00:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our government runs out of funding hours from now, but House Democrats are spending their time holding a hearing celebrating the supposed majesty of abortions. Please pray for our nation. Lord knows we need it.","date":"Thu Sep 30 15:10:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Team GOP is well represented by Alabama tonight in the Congressional Baseball Game! @RepMoBrooks @USRepGaryPalmer https://t.co/YPOGhYgI3D","date":"Wed Sep 29 23:36:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Power-hungry, deceitful politicians like Pelosi and Biden want nothing more than a post-fact world in which they can thrive without accountability. Don't fall for their lies!","date":"Wed Sep 29 17:52:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Bureaucrats at the IRS do not need the authority to monitor Americans' personal banking activities. I'm proud to stand with @SenTuberville against this IRS overreach.","date":"Tue Sep 28 15:00:08 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 ICYMI: Check out my latest The Moore You Know column for my thoughts on: \n\n- Fauci &amp; Milley\n- Vaccine mandates\n- Democrats' tax hike\n\n⬇️⬇️⬇️\nhttps://t.co/JBgEJkKm22","date":"Sun Sep 26 21:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Research using abortive fetal tissue is reprehensible and must be stopped! Tax dollars should NEVER be used for such unethical and corrupt practices. I'm proud to join this important effort and demand a full investigation. https://t.co/v14SnMZLc3","date":"Sun Sep 26 18:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Despite the Squad's heartless attempts to block funding for Israel's Iron Dome, the House passed bipartisan legislation to approve funding for the missile defense system that continues to save countless innocent lives.\n\nI'm always proud to stand with Israel! 🇺🇸🇮🇱","date":"Sat Sep 25 21:00:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats' bizarre and dangerous attempts to cancel our country will NOT be tolerated.\n\nProud to join my conservative colleagues in rejecting the National Archives' weaponization of our founding documents and the men who wrote them. https://t.co/GDQBkdAFPJ","date":"Sat Sep 25 18:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I just voted NO on Democrats' Abortion on Demand Until Birth Act.\n\n⬇️ Full statement ⬇️ https://t.co/Vsaf6oLuPa","date":"Fri Sep 24 16:12:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Kamala Harris is heading to *checks notes* New York City to appear on The View...\n\nClearly the crisis at our southern border ISN'T a priority for our \"Border Czar\"","date":"Fri Sep 24 15:20:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Due to several alarming provisions unrelated - and even harmful - to our national security, I voted against the NDAA last night.\n\n⬇️ Full statement ⬇️ https://t.co/xoog8Ctjmu","date":"Fri Sep 24 13:04:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Sure, let's remove a helpful tool used to secure our southern border from Border Patrol agents, who are already overwhelmed and overworked due to the raging #BidenBorderCrisis.\n\nWhat a brilliant idea! 🙄","date":"Thu Sep 23 17:18:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"So the problem is horses - not the thousands of illegal immigrants living under a bridge? Or being released into the U.S.?\n\nThis Administration is a JOKE!","date":"Thu Sep 23 16:54:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Welcome to Joe Biden's America...","date":"Thu Sep 23 14:53:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great meeting with VA Secretary McDonough this morning.\n\nI’m honored to work with the Secretary to help our veterans receive the high-quality support and care they deserve. https://t.co/vzO6nLMaDZ","date":"Thu Sep 23 14:31:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"At the southern border:\n- NO masks\n- NO COVID testing\n- NO vaccine passports\n\nBut they want your children to wear masks at school.","date":"Thu Sep 23 13:55:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Left is claiming Border Patrol agents are using whips to control illegal immigrants at the southern border.\n\nThis is FAKE NEWS!\n\nBP agents don't even carry whips - they're holding reins.\n\nDems &amp; the liberal media will do anything to spread false narratives &amp; hide the truth.","date":"Wed Sep 22 18:30:11 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Instead of removing thousands of illegal Haitian immigrants from the southern border, the Biden administration is RELEASING them into the country.\n\nBiden continues to put Americans LAST! https://t.co/a5Odtr6pKJ","date":"Wed Sep 22 14:18:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I voted NO on Pelosi's CR, which dangerously hands Biden a blank check &amp; holds America's fiscal future hostage.\n\n⬇️ Full statement ⬇️ https://t.co/c9CP1eSEvJ","date":"Wed Sep 22 00:40:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I will ALWAYS #StandWithIsrael! 🇺🇸🇮🇱","date":"Tue Sep 21 18:02:08 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 BREAKING 🚨\n\nDemocrats no longer support the Iron Dome.\n\nAccording to their dangerous logic, appeasing anti-Semitic progressives is more important than protecting Israel - our greatest ally in the Middle East.\n\nSickening.","date":"Tue Sep 21 17:54:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats clearly have their priorities straight...","date":"Tue Sep 21 16:33:19 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What about her first appearance to the southern border?\n\nHINT: Kamala's earlier \"visit\" - to a CBP facility - doesn't count.\nhttps://t.co/nNzm6e4k6q","date":"Mon Sep 20 21:56:47 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"\"All international travelers\"...? 🤔 https://t.co/lqMNMDvNPs","date":"Mon Sep 20 20:00:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Welcome to Biden's America...","date":"Mon Sep 20 14:58:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden administration recently proposed a provision that would require credit unions and banks to report transactions of $600 or more to the IRS. \n\nI'm proud to join my Alabama colleagues in opposing this massive government overreach.\nhttps://t.co/9wNgxniX1f","date":"Sun Sep 19 20:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Birthday, @usairforce!\n\nThank you for 74 years of bravery and service to our country. 🇺🇸 https://t.co/apJ7UmPYmO","date":"Sat Sep 18 13:06:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today on #POWMIARecognitionDay, we honor our heroes who were held captive and returned home, as well as pay tribute to those who remain unaccounted for while serving our country.\n\nYou are not forgotten. 🇺🇸 https://t.co/9Q6hkyLOHg","date":"Fri Sep 17 18:09:03 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Constitution Day! 🇺🇸\n\nFor 234 years, this document has guaranteed that We the People have individual liberties and protections from the government.\n\nI will always fight to defend our God-given freedoms that make our country the greatest in the world. https://t.co/6MilcfpFhp","date":"Fri Sep 17 17:54:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"UNBELIEVABLE!\n\nBiden is working harder to hide his border crisis than he is to fix it.\nhttps://t.co/LVSCD2Qgbn","date":"Fri Sep 17 13:55:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed visiting my Alma Mater this morning to tour @AuburnAg! Their cutting edge program prepares students to excel in the agriculture industry, which is vital to Alabama’s economy and future. Thanks for having me! https://t.co/XagcBcRrGu","date":"Thu Sep 16 18:24:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"👀 Where is our \"Border Czar\"?","date":"Thu Sep 16 14:21:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Bidenomics is failing small businesses.\n\nPosted outside of Larry’s BBQ in my hometown, this message is a powerful example of the devastating reality many small businesses are facing under the Biden administration. https://t.co/TdiHutY7aC","date":"Wed Sep 15 18:35:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 BIDEN BORDER CRISIS 🚨\n\nIn August, there were 208,887 illegal encounters at our southern border.\n\nThis is the SECOND straight month with over 200k+ apprehensions.","date":"Wed Sep 15 17:10:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"If the reports about General Milley are true, he is a TRAITOR.\n\nAt the very least, Milley must RESIGN - ASAP!\n\nWe need congressional investigations to uncover the truth behind these unprecedented allegations.","date":"Wed Sep 15 14:50:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thanks to Joe Biden, Americans are paying MORE for just about everything...\n\n⛽️ Gasoline UP 42.7%\n🏨 Hotels UP 19.6%\n📺 TVs UP 13.3%\n🚗 Car rentals UP 52.6%\n🚘 Used cars UP 31.9%\n🪑 Furniture UP 12%","date":"Tue Sep 14 19:13:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The hypocrisy is PRICELESS!","date":"Tue Sep 14 14:30:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Let me get this straight...\n\nAOC wore a \"Tax the Rich\" dress to the Met Gala, where tickets are ~$30,000 a pop. \n\nI'm sure the Hollywood elites she sipped champagne with all night really got the message. https://t.co/qmwnNoaTpH","date":"Tue Sep 14 14:25:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Blinken must RESIGN.","date":"Mon Sep 13 21:15:47 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy #NationalPeanutDay! 🥜\n\nI'm proud to represent the \"Peanut Capital of the World,\" Dothan, AL, where nearly half of U.S. peanuts are grown within a 100-mile radius.\n\nThank you to all of our hardworking peanut farmers who produce this staple crop. https://t.co/MX6u8ADmXn","date":"Mon Sep 13 18:21:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden is forcing unconstitutional vaccine mandates on American workers - but NOT illegal immigrants flooding our southern border.\n\nMake it make sense!","date":"Mon Sep 13 17:08:46 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"ICYMI: Check out my latest The Moore You Know Column.\n\n⬇️⬇️⬇️\nhttps://t.co/Va0asuEG3m","date":"Sun Sep 12 18:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/5F7H1aKU6Y","date":"Sat Sep 11 19:00:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On this solemn day, our nation commemorates the 20th anniversary of the devastating attacks of September 11, 2001.\n\nWe must always remember the lives lost on that dark day and honor the sacrifices made in the two decades since. https://t.co/16iJKIBmB9","date":"Sat Sep 11 13:00:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 Ag Cmte Democrats just BLOCKED 3 amendments to oppose tax increases on farmers 🚨 \n\nFact: Pelosi’s socialist tax-and-spend reconciliation bill hurts all Americans, especially our farmers. @HouseAgGOP has our farmers backs, but despite their lip service, it’s clear Dems don’t.","date":"Sat Sep 11 00:37:24 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This *probably* isn’t how our Founders envisioned the American democratic experiment operating…","date":"Sat Sep 11 00:14:35 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Of course they are!\n\nFauci is a liberal media darling who cares more about his popularity and political theater than following the science.\nhttps://t.co/eU4ltVW3MM","date":"Fri Sep 10 18:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Afghanistan crisis fallout:\n\n❌ 13 fallen American heroes\n❌ Hundreds of Americans left behind\n❌ Billions of $ of equipment left to the Taliban\n\nIt's time for accountability, Mr. President. https://t.co/ZwQGWcJVEs","date":"Fri Sep 10 16:00:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/m1owDLoZWf","date":"Fri Sep 10 14:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This is blatantly unconstitutional!\n\nThe decision to get vaccinated lies between you and your doctor - NOT the federal government.\n\nWe must fight back against medical tyranny that dangerously violates Americans' individual freedoms.","date":"Thu Sep 09 21:05:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Fauci LIED to Congress.\n\nHe must be FIRED - ASAP!","date":"Thu Sep 09 16:55:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 BIG NEWS 🚨\n\nBiden is planning to withdraw his anti-gun nominee, David Chipman, to lead the ATF.\n\nThis is a MAJOR win for the Second Amendment!\nhttps://t.co/4puNPYgILd","date":"Thu Sep 09 13:39:31 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden administration is more concerned over the diversity of a terrorist organization than bringing the Americans they abandoned in Afghanistan home.\n\nLet that sink in.","date":"Wed Sep 08 18:02:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 NEW: The Moore You Know Column\n\nCheck it out for my thoughts on:\n➡️ Honoring our 13 fallen heroes\n➡️ Biden's shameful withdrawal\n➡️ Latest victory for the unborn\nhttps://t.co/wTJR6zFqn7","date":"Wed Sep 08 16:07:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"For over 40 years, the Hyde Amendment has ensured that American taxpayer dollars are NOT used to fund abortions - saving millions of innocent lives in the process.\n\nWe must save Hyde because #HydeSavesLives.","date":"Wed Sep 08 14:28:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"8.4 million Americans remain unemployed - despite there being 10.5 million jobs available.\n\nWhat a disaster!\n\nBiden's failed economic policies are hurting Americans, slowing our economic recovery, and incentivizing Americans to not work.","date":"Tue Sep 07 20:06:50 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Failures due to Biden's catastrophic withdrawal from Afghanistan:\n\nDEADLIEST attack on U.S. troops in Afghanistan since 2011.\n\nHUNDREDS of Americans abandoned behind enemy lines.\n\nBILLIONS of $$$ in U.S. military equipment handed over to the Taliban.\n\nBiden = Failure-in-Chief!","date":"Tue Sep 07 18:23:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What a remarkable act of patriotism.\n\nProud of my Alma Mater for honoring the 13 American heroes killed in Afghanistan.\n\n#WarEagle 🇺🇸\nhttps://t.co/OtYF31ToDM","date":"Tue Sep 07 17:03:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"REMINDER: Joe Biden abandoned Americans in Afghanistan.\n\nWe need a plan to evacuate them - ASAP!","date":"Mon Sep 06 18:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Labor Day, y'all! \n\nToday, we celebrate the millions of hardworking men and women who keep our country running. We're so thankful for America's resilient workforce. https://t.co/cmRUuRHIkM","date":"Mon Sep 06 14:00:03 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Congratulations to Geneva Police Chief Tony Clemmons on his recent retirement! Throughout his 34 years of service, Clemmons has kept our community safe and made AL02 proud. https://t.co/SrFka1ANM4","date":"Sun Sep 05 21:00:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Football is back! 🏈🐅\n\n#WarEagle 🦅 https://t.co/nGuNoIwkK8","date":"Sun Sep 05 01:26:19 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Honored to join @RepLisaMcClain's legislation to award our 13 fallen heroes with the Congressional Gold Medal.\n\nWe must NEVER forget their sacrifice, service, and bravery.","date":"Sat Sep 04 18:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This afternoon, I held a law enforcement roundtable featuring over two dozen law enforcement officers from Coffee, Covington, Dale, Geneva, and Houston Counties.\n\nI sincerely appreciate all those who attended our panel today for an open discussion about how we can keep AL02 safe. https://t.co/17ivCEg7e6","date":"Fri Sep 03 21:32:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 HUGE DISAPPOINTMENT 🚨\n\nAugust jobs report missed the mark - reporting just 235,000 new jobs vs. expectations of 720,000+\n\nBiden's economic crisis continues to fail American workers and families.","date":"Fri Sep 03 15:02:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden asked Ghani to LIE to the American people - and the world.\n\nWhere is the outrage?\n\nWe need a full investigation NOW.\nhttps://t.co/K2x9WNbWHq","date":"Thu Sep 02 20:13:16 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last week, we lost 13 American heroes who made the ultimate sacrifice in Kabul.\n\nGone, but never forgotten. 🇺🇸 https://t.co/MI9SuSuHKp","date":"Thu Sep 02 15:46:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 MAJOR NEWS 🚨\n\nThe Supreme Court voted 5-4 to leave Texas’ pro-life law in place.\n\nThis is a HUGE victory for the defenseless unborn and the pro-life movement.\nhttps://t.co/xN7Q4Iz0QZ","date":"Thu Sep 02 14:18:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The American people owe a great debt to our veterans - Congress cannot let them down during this painful period.\n\nProud to join @RepGregMurphy &amp; @RepBost in urging Chairman Takano to reconvene ASAP for a hearing on veteran mental health in the wake of failures in Afghanistan. https://t.co/9Mrjqjk0Zi","date":"Wed Sep 01 19:25:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It's time for answers and accountability. https://t.co/nVqCPyXBSb","date":"Wed Sep 01 14:54:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Don’t let the Biden administration give you a scapegoat, folks.\n\nWe MUST hold Biden, Blinken, Austin, and Milley accountable. https://t.co/oAyqY7A5Rk","date":"Tue Aug 31 20:58:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Always turning his back on the American people.","date":"Tue Aug 31 20:02:08 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"ZERO plans.\nZERO questions.\nZERO leadership.\n\nAmericans deserve better - it's time for Biden to go.","date":"Tue Aug 31 19:54:58 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"“Hello Mr. President: Save me and my family. Don’t forget me here.”\n\n@POTUS, you should be ashamed.\nhttps://t.co/FrTkFAuhKH","date":"Tue Aug 31 18:15:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Americans should NEVER be left behind.","date":"Tue Aug 31 14:25:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The gungrabbing Dems who fanatically demand your #2A rights must be abolished handed over hundreds of thousands of arms, including more than 64K fully automatic machine guns, to radical Islamists.\n\nAnd while they’re arming terrorists, they’re defunding American police. Shameful! https://t.co/bHscIP7kYf","date":"Sun Aug 29 23:25:08 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden Admin is blocking Americans stuck in Afghanistan from entering Hamid Karzai Airport - even ordering them to shelter at home - mere hours before the deadline. We should be moving heaven &amp; earth to get ALL our citizens out safely. This is outrageous &amp; we deserve answers!","date":"Sun Aug 29 21:30:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"ICYMI: Check out my latest The Moore You Know Column\n\n⬇️⬇️⬇️\nhttps://t.co/uJ8Wwcp4jQ","date":"Sun Aug 29 21:00:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"During our first The Moore You Know Veteran Workshop and Jobs Fair, I had the privilege of honoring World War II veteran, Richard “Dick” Schoof.\n\nMay we remember his life and service for years to come. 🇺🇸\nhttps://t.co/MPFhGJ9Wl2","date":"Sat Aug 28 15:00:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Praying for our troops.\n\nPraying for the families of our fallen heroes.\n\nPraying for the future of our nation. https://t.co/SLqBIyAFZ2","date":"Fri Aug 27 03:16:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Devastating.\n\nPraying for our troops and every American still stranded in Afghanistan.\n\nWe MUST bring them ALL home safely!","date":"Thu Aug 26 14:37:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Lies, miscalculations, and confusion from the start.\n\nMake no mistake, Biden is to blame. https://t.co/kYqSUE1oEj","date":"Wed Aug 25 20:20:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In his latest display of cowardice on the world stage, our Commander-in-chief is capitulating to terrorists and abandoning our allies.\n\nFull statement ⬇️ https://t.co/RUmYreV5ZP","date":"Wed Aug 25 16:46:03 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 MAJOR NEWS 🚨\n\nThe Supreme Court is forcing the Biden administration to reinstate President Trump’s “Remain in Mexico” policy.\n\nThis is a BIG win for Americans and the #AmericaFirst agenda.\nhttps://t.co/FVdRdHxrdg","date":"Wed Aug 25 14:15:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I voted NO on H.R. 4 - Democrats' second sinister scheme to federalize our elections.\n\nFull statement ⬇️ https://t.co/m92hDs2KHX","date":"Tue Aug 24 23:06:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I can assure you, Madam Speaker, that Americans stranded in Afghanistan couldn’t care less about your $3.5 TRILLION tax and spending spree. https://t.co/PreVi7uWd6","date":"Tue Aug 24 20:47:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Heather and I are deeply saddened to learn of the passing of Judge Bobby Ray Aderholt, a family man loved and respected throughout Alabama. \n\nWe're praying for @Robert_Aderholt and his family during this difficult time.","date":"Tue Aug 24 20:17:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden is letting the Taliban call the shots.\n\nLet that sink in.\n\nWe MUST safely evacuate every American still stranded in Afghanistan.\n\nAnything less is unacceptable and un-American.\nhttps://t.co/9fYbKBRqaa","date":"Tue Aug 24 17:27:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 NEW: The Moore You Know Column\n\nCheck it out for my thoughts on:\n➡️ Biden's botched Afghanistan withdrawal\n➡️ Ongoing crisis at our southern border\n➡️ Pelosi's latest unconstitutional power grab\nhttps://t.co/Uul7H7uEvs","date":"Tue Aug 24 13:59:31 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Currently:\n\n❌ Crime crisis\n❌ Border crisis\n❌ Inflation crisis\n❌ Afghanistan crisis\n\nYet Pelosi is focused on her $3.5 TRILLION Socialist spending spree.\n\nDemocrats need to get their priorities straight.","date":"Mon Aug 23 19:50:16 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"God bless our troops 🇺🇸 https://t.co/8Ay0ilrRoY","date":"Sat Aug 21 19:07:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"https://t.co/MNT2j506mm","date":"Fri Aug 20 21:42:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden: “I have seen no question of our credibility from our allies around the world.”\n\n🤔🤔🤔 https://t.co/h1Or5jSwNv","date":"Fri Aug 20 18:22:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Do you still think no mistakes were made, @POTUS?\nhttps://t.co/25nYp2cfHQ","date":"Thu Aug 19 20:17:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"God bless the brave men and women of @CapitolPolice.","date":"Thu Aug 19 19:00:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our Commander-in-chief has no clue how many Americans are stranded in Afghanistan—or how to safely evacuate them. He has NO plan.\n\nBiden's total lack of leadership is completely unacceptable.","date":"Wed Aug 18 18:55:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"ICYMI: Check out my latest column for my thoughts on the Left's hypocritical mask mandates, House Democrats' radical spending spree, and my latest legislation to help our veterans.\n\n⬇️⬇️⬇️\nhttps://t.co/wIclReuVh7","date":"Tue Aug 17 22:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"REMINDER: Democrats want to use your taxpayer money to fund abortion on demand. \n\nImportant read from @SteveScalise &amp; @RepKayGranger on House Republicans' efforts to defend the unborn.\nhttps://t.co/jqrUJhYQMY","date":"Tue Aug 17 21:00:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wrong answer, @PressSec.\n\nThere are currently THOUSANDS of Americans still in Afghanistan—and the Biden administration is responsible for bringing every single one home safely.","date":"Tue Aug 17 18:48:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"To all of our veterans and their families: You are #NotAlone.\n\nThe Veterans Crisis Line is available 24/7 if you or a loved one needs help.\n\n☎️ Call 1-800-273-8255 &amp; Press 1\n📱 Text 838255\n💻 Chat online https://t.co/sCZZbgklWL\nhttps://t.co/TUrX1tAfCm","date":"Tue Aug 17 16:31:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"God bless the men and women who have served our country in Afghanistan.\n\nTheir sacrifice was not in vain - and their bravery will not be forgotten.\n\n🇺🇸🇺🇸🇺🇸","date":"Mon Aug 16 19:51:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The difference is staggering. https://t.co/kEyXiohuPg","date":"Mon Aug 16 16:57:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In just 7 months, we've gone from America First to Americans Last.\n\nPresident Biden should be ashamed.","date":"Mon Aug 16 16:37:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"⚠️ Please stay vigilant, #AL02!\nhttps://t.co/9poVgA3u4u","date":"Mon Aug 16 15:25:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Taliban gave a press conference BEFORE the President of the United States.\n\nLet that sink in.\n\nIn fact, we still haven’t heard a word from our Commander-in-chief.\n\nPresident Biden needs to address the nation NOW.","date":"Mon Aug 16 13:35:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Commander-in-hiding.\n\nAmerica—and the world—deserves better.","date":"Sun Aug 15 17:40:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"As long as Biden's unconstitutional eviction moratorium remains, property owners will continue to struggle financially.\n\nProud to join @RepJacobs and @SenMikeLee in calling for an end to this massive government overreach.","date":"Sat Aug 14 17:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This week, Biden has shown he cares more about Venezuelan jobs than American jobs. He’s done more to help the Taliban than our ally Canada. And he’s waiving American laws for illegal border crossers while taking away your freedoms.\n\nNo one can be this naive. He is unfit to lead.","date":"Fri Aug 13 21:07:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Alabama's leadership to protect our children from the dangerous teachings of CRT is wonderful to see.\n\nBut the threat of CRT remains. \n\nWe must remain vigilant to keep CRT's divisive principles from seeping into our schools.\nhttps://t.co/MVhPkgxYGp","date":"Fri Aug 13 18:45:16 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The #BidenBorderCrisis will never end unless we take the first step of enforcing our existing laws. President Biden, make illegal immigration illegal again!","date":"Fri Aug 13 14:35:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Time to wake up, Biden. https://t.co/QjrLQ2Gojt","date":"Fri Aug 13 14:28:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The #BidenBorderCrisis is only getting WORSE.","date":"Thu Aug 12 19:13:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thanks to Biden's reckless spending, inflation remains at a 13-year HIGH - forcing Americans to pay more for just about everything.","date":"Thu Aug 12 17:52:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"\"For your own safety,\" Democrats are forcing mask and vaccine mandates on Americans.\n\nYet they ignore that 40% of illegal immigrants released in Texas have tested positive for COVID.\n\nDemocrat policies aren't meant to protect you - but to control you.\n\nDon't fall for it, America.","date":"Thu Aug 12 15:47:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We have a responsibility to protect young Americans from harmful predators on the internet. Proud to join @RepAnnWagner in demanding the DOJ investigate OnlyFans for child exploitation.","date":"Wed Aug 11 19:10:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 This is the #BidenBorderCrisis 🚨","date":"Wed Aug 11 17:22:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Why does Biden hate American energy independence?","date":"Wed Aug 11 16:49:31 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"As families prepare for the upcoming school year, many parents are feeling the costs of #Bidinflation. https://t.co/Lu8qNKluFL","date":"Wed Aug 11 15:47:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Do you know what's missing from the 2,700 page, $1.2 TRILLION \"infrastructure\" bill?\n\nBorder wall funding.","date":"Wed Aug 11 15:03:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed speaking with members of the Enterprise Rotary Club this afternoon! We discussed my first seven months in Washington, including partisan battles and introducing legislation to help our veterans. Thanks for having me! https://t.co/YGk6LtXeLD","date":"Tue Aug 10 19:26:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The #BidenBorderCrisis is only getting WORSE.\nhttps://t.co/V1Jba0LXJs","date":"Tue Aug 10 18:20:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great turnout at our Buffet with Barry event in Enterprise this morning! It’s always a blessing to connect with folks across #AL02. I enjoyed giving a legislative update on my work in Washington and answering tough questions about the future of our nation. 🇺🇸 https://t.co/GNTkdnnY8h","date":"Tue Aug 10 16:57:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Congratulations to Olympian and #AL02 constituent, Brandon Dickson, for bringing home a silver medal with @USABaseball! 🥈🇺🇸\n#TeamUSA #Tokyo2020 https://t.co/zRU2qHzwKT","date":"Mon Aug 09 19:25:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Heartbreaking.\n\nOfficer Ella French was just 29-years-old and leaves behind a 2-month-old baby.\n\nContinue to pray for our brave men and women in blue across the country.\nhttps://t.co/lJhNjJJQsZ","date":"Mon Aug 09 17:22:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"If Democrat elites won't follow their own rules, why should you? https://t.co/mEB0AMJYMS","date":"Mon Aug 09 15:12:12 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"No. https://t.co/Z5XPeFwzSD","date":"Mon Aug 09 14:08:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"God bless the USA! 🇺🇸 https://t.co/UvlKAjTCQi","date":"Sun Aug 08 21:46:11 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today on #NationalPurpleHeartDay, we honor the selfless men and women who were wounded in service or made the ultimate sacrifice for our country. \n\nMay we always remember their service, bravery, and sacrifice. 🇺🇸 https://t.co/47lAXvf3Dk","date":"Sat Aug 07 18:42:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden is claiming the July jobs report proves his failed economic policies are working.\n\nIn reality, this success is largely thanks to Republican governors ending their states' federal unemployment benefits - which incentivized many Americans to get back to work.","date":"Fri Aug 06 16:46:34 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"CBP encountered 834 unaccompanied migrant children on Wednesday.\n\nYep, you read that right.\n\n834 in a SINGLE DAY.\n\nThe #BidenBorderCrisis is only getting worse.","date":"Fri Aug 06 13:08:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"China lied - and MILLIONS of people have suffered and died.\n\nThey MUST be held accountable.\n\nTime to wake up, @POTUS.\nhttps://t.co/HW9OrHZOa3","date":"Thu Aug 05 20:59:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 BREAKING: @RepCori believes her safety is more important than yours. https://t.co/g91NWSpajO","date":"Thu Aug 05 16:18:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our servicemembers shouldn’t be unnecessarily forced into taking the vaccine just because overreaching politicians want to continue intervening in the private lives of the American people.\n\nFull press release ➡️ https://t.co/Zj7f7VmGUY https://t.co/PMPei0UZbe","date":"Thu Aug 05 14:25:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"If Biden actually cared about the spread of COVID, he would secure the southern border.","date":"Wed Aug 04 19:19:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 ICYMI 🚨\n\nWhile the majority of Americans OPPOSE taxpayer-funded abortion, House Democrats passed a partisan spending package last week that KILLED the Hyde Amendment.\n\nSICKENING. https://t.co/y0CgWYPQEY","date":"Wed Aug 04 17:44:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy birthday, @USCG! 🇺🇸 \n\nThank you for 231 years of serving and protecting our country. #SemperParatus https://t.co/AS6IW2i2ed","date":"Wed Aug 04 15:27:03 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 ICYMI 🚨\n\nCheck out my latest The Moore You Know column for my thoughts on the Biden border crisis, Pelosi's sham investigation, and calls for freedom in Cuba.\nhttps://t.co/BRYN5gMer3","date":"Tue Aug 03 21:14:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed meeting with @Michael_J_New and interns from @AUL last week, where we discussed my efforts to protect the defenseless unborn. As a proud pro-life advocate, it’s encouraging to meet young folks passionate about defending human life! https://t.co/TX22zfkNrY","date":"Tue Aug 03 17:33:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"REMINDER: Inflation has increased EVERY MONTH since Biden took office.","date":"Tue Aug 03 14:51:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"“Rules for thee, but not for me.” \n- Democrat elites https://t.co/yjeEHylzBj","date":"Mon Aug 02 20:55:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Honored to meet with folks from Military-Veterans Advocacy last week. From toxic exposure to streamlining the appeals processing system, we discussed many important issues facing veterans across the country. We must ensure our veterans receive the benefits they deserve. 🇺🇸 https://t.co/Na4GAjh7SZ","date":"Mon Aug 02 19:24:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last week, Biden said we would \"in all probability\" see more COVID restrictions - yet is doing NOTHING to secure our southern border, where COVID-19 cases are surging.\n\nSo much for putting Americans first.","date":"Mon Aug 02 16:42:08 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Whether it's Britney Spears or Mama B @bashinsky, toxic conservatorships cannot be tolerated.\n\nWe must examine guardianship abuse that unjustly traps and exploits Americans across our nation.\nhttps://t.co/yMiFIkuIpA","date":"Sun Aug 01 17:00:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Check out my latest column for an inside scoop on the Biden border crisis, Nancy Pelosi's sham investigation, and calls for freedom in Cuba.\n\n⬇️⬇️⬇️\nhttps://t.co/vmMGt6EIcm","date":"Sat Jul 31 16:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Still think this is about science? 🤔 https://t.co/Q3mNL73tRp","date":"Sat Jul 31 14:53:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"More #AmericaLast policies from Sleepy Joe...","date":"Fri Jul 30 14:54:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 Tune in, #AL02!","date":"Fri Jul 30 13:33:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Pelosi is no longer a benevolent dictator - she’s a tyrant.\nhttps://t.co/iGhParTO9x","date":"Fri Jul 30 13:22:45 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Glad to see my Democrat colleague @RepDeanPhillips believes in following the science too! #IWillNotComply https://t.co/QkDbpxdqCf","date":"Thu Jul 29 20:33:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy #NationalInternDay to our outstanding group of summer interns! I'm thankful for their hard work in helping Team Moore this summer and their willingness to serve #AL02. 🇺🇸 https://t.co/PYgN0jNUuO","date":"Thu Jul 29 18:42:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This isn’t about science - it’s about government control. https://t.co/Eh6eGvjw34","date":"Thu Jul 29 17:16:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It’s NOT Pelosi’s House - it’s the PEOPLE’S House. https://t.co/ctlzaIjbvf","date":"Thu Jul 29 14:54:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Nope. #IWillNotComply","date":"Thu Jul 29 13:22:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"All while they allow illegal immigrants to spread COVID-19 at our southern border.\n\nThe hypocrisy is outrageous.","date":"Wed Jul 28 18:08:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden logic:\n\n✅ Force vaccinated Americans to mask up again\n✅ Push vaccine and mask mandates\n❌ Stop the surge of illegal immigrants spreading COVID at the southern border\n\nThe Administration's double standard on COVID-19 is disgraceful.","date":"Wed Jul 28 14:17:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Huge shoutout to my good friend @RepBoebert for joining our online town hall tonight! Thankful to serve with freedom-loving patriots like Lauren who will never stop fighting for the future of our nation. 🇺🇸 https://t.co/mnUX57Rl8K","date":"Wed Jul 28 01:12:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In his effort to persuade Americans to get the COVID vaccine, Biden has now *checks notes* resulted to insulting unvaccinated Americans’ intelligence.\n\nSo much for unity!\nhttps://t.co/V1SXFEPAqK","date":"Tue Jul 27 20:31:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On National Korean War Veterans Armistice Day, we honor the 5.7 million heroes who bravely served in the Korean War.\n\nMay we always remember their sacrifice. 🇺🇸 https://t.co/V7t1ilPzge","date":"Tue Jul 27 16:44:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"From soaring inflation to rising crime, Americans are facing real issues across our nation due to Democrats' failed policies.\n\nBut instead of finding solutions to these crises, the House is focused on Pelosi's sham investigation.\n\nThe American people deserve better.","date":"Tue Jul 27 13:46:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Funny that Biden is flagging “misinformation” for Big Tech…as he spreads misinformation himself.\n\nRoll the tape 🎥 https://t.co/103BAasQgf","date":"Mon Jul 26 19:24:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Clearly, now is NOT the time to end Title 42.","date":"Mon Jul 26 15:48:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"June was the FOURTH straight month of 170K+ apprehensions.\n\nBiden's response?\n\nSpend *at least* $2 BILLION to WEAKEN border security.\n\nTalk about willful negligence.\nhttps://t.co/vW1E62y9Lr","date":"Mon Jul 26 15:30:50 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What an incredible story.\n\nGod bless Officer Newman Brazier and the late WWII veteran, Robert Lee Serling.\n\nMay we always honor our nation's heroes and remember their sacrifice. 🇺🇸\nhttps://t.co/8ldFQNPGPR","date":"Sun Jul 25 17:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What?!\n\nThis is highly concerning, folks.\n\nBy the way, Mr. President, the dangerous Democrat-led effort to defund the police is REAL. Refusing to condemn this radical policy makes Americans less safe. https://t.co/WGmo1iaibx","date":"Sat Jul 24 14:48:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Good luck, Team USA! You make our nation proud.\n\n🇺🇸🇺🇸🇺🇸","date":"Fri Jul 23 14:39:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Despicable.\n\nAmerican taxpayer dollars should NEVER fund abortions.\n\nWe must save Hyde because #HydeSavesLives.","date":"Thu Jul 22 18:30:58 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Proud to stand in solidarity with the brave Cuban people as they fight against the brutal communist regime.\n\nSocialism kills - but freedom ALWAYS wins.\n\n#SOSCuba 🇺🇸🇨🇺 https://t.co/qhHiNtyPZZ","date":"Thu Jul 22 16:31:35 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In her brazen attempts to hide the truth, Speaker Pelosi has forgotten a fundamental fact: This is the People's House - NOT Pelosi's.","date":"Thu Jul 22 14:09:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Pelosi's January 6 investigation is all about scoring political points - and she's rigging the game.\n\nIn what sport can a coach choose the other team's players?!\n\n@Jim_Jordan &amp; @RepJimBanks have consistently outplayed Pelosi, so she blocked them from taking the field. Outrageous!","date":"Wed Jul 21 20:17:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Pelosi's decision to block @Jim_Jordan &amp; @RepJimBanks from serving on the 1/6 committee isn't surprising.\n\nWe all knew her \"investigation\" was nothing more than a political witch hunt.\n\nHer latest partisan stunt proves it.","date":"Wed Jul 21 18:23:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"But don’t worry, at least he saved Americans $0.16 on hotdogs over Independence Day weekend…🥴","date":"Wed Jul 21 14:18:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Millions of Americans are concerned about inflation.\n\nWhat's Joe Biden's solution?\n\nSpend TRILLIONS more on partisan packages.\n\nWhen will he realize that his FAILED policies are causing this mess?","date":"Wed Jul 21 13:57:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The results are in: Biden is FAILING the American people. https://t.co/JmLW71OJwZ","date":"Tue Jul 20 21:43:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Border crossings are on the RISE.\n\nMarch ➡️ 173,265\nApril ➡️ 178,850\nMay ➡️ 180,641\nJune ➡️ 188,829\n\nNumbers don't lie. The #BidenBorderCrisis is getting WORSE.","date":"Tue Jul 20 17:09:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's reckless spending is fueling rising inflation - forcing Americans to pay more for just about everything.\n\n⛽️ up 45.1%\n🥛 5.6%\n🚗 87.7%\n🏨 16.9%\n🥓 8.4%\n📺 7.6%\n✈️ 24.6%\n🐟 6.4%\n\nInflation = taxation!","date":"Tue Jul 20 13:55:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Do you still think you've made \"progress\" at the southern border, @VP?\n\nLooks like chaos to me.","date":"Mon Jul 19 17:45:16 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"There’s a CRISIS at our southern border. https://t.co/uTEQEOc26Q","date":"Mon Jul 19 14:44:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 ICYMI: The latest The Moore You Know Column is here!\n\nCheck it out for my thoughts on the Left's attempts to defund our police, the spread of CRT, and more.\nhttps://t.co/BEEZLsxP18","date":"Sun Jul 18 18:00:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"CBP seized 1,053 POUNDS of fentanyl at the southern border last month.\n\nThat's MORE than the last 3 Junes COMBINED.\n\nThe #BidenBorderCrisis is dangerous - and deadly.","date":"Sat Jul 17 16:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Remember when Biden argued the startling surge of illegal immigrants was just \"seasonal\"?\n\nClearly, it's NOT.\n\nThe #BidenBorderCrisis is getting WORSE.","date":"Fri Jul 16 19:13:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 NEW 🚨\n\nCheck out my latest column for my thoughts on:\n- Democrats' calls to defund the police\n- Biden's weakness toward Russia\n- Dangers of Critical Race Theory\nhttps://t.co/BEEZLsPqpI","date":"Fri Jul 16 17:08:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Spot the difference? 🤔 https://t.co/bYIhpvyAr1","date":"Fri Jul 16 15:14:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Communists defending communists.\n\nI hope the mainstream media, Democrats, and woke corporations remember this the next time they spout unquestioning support for BLM's agenda.","date":"Thu Jul 15 17:05:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"For over 40 years, the Hyde Amendment has ensured that American taxpayer dollars are NOT used to fund abortions.\n\nYet President Biden and House Democrats are attempting to destroy this policy that has saved nearly 2.5 MILLION lives.\n\n#HydeSavesLives https://t.co/zajyCfDiNz","date":"Thu Jul 15 14:01:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"“Mismanagement”?\n\nI think you mean communism, @PressSec.","date":"Wed Jul 14 17:48:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last night’s MLB All-Star Game might’ve just been a game to Democrats—but it was a MAJOR loss for Georgia.\n\nBiden’s lies about the state’s election laws caused small businesses to lose over $100M in revenue.\n\nNow he’s lying about the voting reform bill in Texas.\n\nOutrageous.","date":"Wed Jul 14 17:45:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thanks to Bidinflation, American workers, families, and small businesses are paying MORE for just about everything.","date":"Wed Jul 14 13:22:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Let me get this straight...\n\nTexas Dems showed IDs to board private jets (maskless, I might add), and buy cases of Miller Lite - to travel to Washington, D.C. in protest of voter ID laws.\n\nThis is only about power, folks.","date":"Tue Jul 13 20:36:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"From Cuba to Hong Kong, the American flag serves as a beacon of freedom for millions facing brutal oppression.\n\nMeanwhile, in the USA:\n- Athletes disrespect our flag\n- The Left demonizes our flag\n- The media politicizes our flag\n\nEmbarrassing.\n\nNEVER take freedom for granted. 🇺🇸","date":"Tue Jul 13 16:51:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Bidinflation is a tax Americans can't afford.","date":"Tue Jul 13 13:17:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Toxic conservatorships are immoral.\n\nGuardianship abuse impacts more than one million Americans, including Alabamians like Mama B @Bashinsky. We must examine the system that unjustly traps and exploits Americans across our nation. https://t.co/PmXHniaqLE","date":"Mon Jul 12 21:34:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Newsflash, @VP: Rural Americans are perfectly capable of photocopying our IDs.\n \nArguing otherwise is ridiculously condescending, elitist, and wildly out of touch.","date":"Mon Jul 12 18:44:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"God bless the people of Cuba bravely fighting for their freedom.\n\nAmerica must stand with freedom over socialism—ALWAYS.","date":"Mon Jul 12 13:12:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Every “leader” that supports defunding the police is responsible for the crime crisis. https://t.co/gHgh8WOfW7","date":"Sun Jul 11 21:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden’s massive stimulus spending didn’t bring Americans the jobs he promised it would.\n\nIn fact, many jobs were LOST in June:\n⚠️ 7,000 construction\n⚠️ 13,000 food &amp; beverage \n⚠️ 7,000 health &amp; personal care\n⚠️ 11,000 heavy &amp; civil engineering\n\nPlus thousands MORE.","date":"Sat Jul 10 16:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"REMINDER: CBP has seized MORE fentanyl so far in 2021 than ALL of 2020.\n\nWe MUST secure the border.","date":"Fri Jul 09 19:00:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Left must STOP weaponizing the American flag.\n\nI will always unapologetically support and stand for Old Glory.\n\n🇺🇸🇺🇸🇺🇸\nhttps://t.co/3KsPMu09Lp","date":"Fri Jul 09 17:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden’s severely misguided policies have NOT delivered the pre-pandemic economic growth that he promised. https://t.co/as47XGpyma","date":"Fri Jul 09 14:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The racist teachings of Critical Race Theory will create modern-day tribalism—dangerously dividing our nation.\n\nWe must fight back against the spread of CRT before it’s too late.","date":"Thu Jul 08 22:49:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"⚠️ FYI: The left-leaning Tax Policy Center found that Biden’s tax plan would raise taxes on 75% of middle-class families next year and 95% by 2031.\n\nSo much for Biden's \"promise\" to not raise taxes on households making less than $400,000 a year.","date":"Thu Jul 08 18:16:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨🚨🚨\n\nIn the midst of a chaotic border crisis, @RepRashida believes we should “eliminate funding for CBP, ICE, and their parent organization DHS.”\n\nDemocrats continue to push radical policies that put American communities in danger. https://t.co/ZtvUhIf5wY","date":"Thu Jul 08 15:57:19 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed touring the backroads of Conecuh County yesterday with Rick Fletcher and Alex Owen of Fletcher Petroleum to learn more about oil and gas production in the region. Thanks for having me! https://t.co/mnivTTbgHW","date":"Thu Jul 08 13:55:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Critical Race Theory isn’t \"reasonable\" - it’s racist. https://t.co/JeiDTGBAvu","date":"Wed Jul 07 20:17:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Biden administration's inability to hold Russia accountable for their long history of cyberattacks has resulted in the LARGEST ransomware attack in HISTORY.\n\nBiden is too weak to stand up to Putin.","date":"Wed Jul 07 19:35:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Inflation is a tax on every single American.\n\nPass it on.","date":"Wed Jul 07 17:17:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We all knew @PressSec's claim that Republicans support defunding the police was a LIE. \n\nEven the Washington Post awarded her false statements THREE Pinocchios: 🤥🤥🤥\n\nIt has ALWAYS been Democrats that support defunding the police.\nhttps://t.co/EoIVH7QZ31","date":"Wed Jul 07 15:15:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed speaking with members of the Elba Rotary Club this afternoon!\n\nWe discussed troubling legislation, including HR 1 and HR 8, but also highlighted wins in Washington, such as passing two of our veteran bills as amendments to the GI Bill NEED Act. Thanks for having me! https://t.co/j12tkKV0Dp","date":"Tue Jul 06 20:15:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"\"We cannot use our troubled history as a rubber stamp to hold America hostage from her past sins and as a wedge between White and Black Americans.\"\n\nSpot on, @RepDonaldsPress. The Left's obsession with CRT is only meant to divide our nation.\nhttps://t.co/vNvoZrbhpf","date":"Tue Jul 06 19:42:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Still think it's just hysteria, @RepAOC?","date":"Tue Jul 06 14:14:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Welcome to President Biden's America:\n\n❌ High crime\n❌ High inflation\n❌ High unemployment\n❌ High illegal border crossings","date":"Mon Jul 05 20:04:31 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Perfect way to end the Fourth: Fireworks on Lake Jordan with family and friends.\n\nLet freedom ring! 🇺🇸 https://t.co/m0sXPmpbgx","date":"Mon Jul 05 02:58:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Independence Day! 🇺🇸\n\nToday we celebrate 245 years of the greatest nation in the world. May we never take our freedom for granted—or the price it takes to defend it.\n\nGod bless the USA! 🇺🇸 https://t.co/JiHVxEfwhk","date":"Sun Jul 04 13:38:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Unlike the failing @nytimes, I’m PROUD to be an American.\n\nGod bless the USA. 🇺🇸 https://t.co/PSLYYWdQ25","date":"Sun Jul 04 01:25:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"As we celebrate the greatest country on Earth this Independence Day weekend, let’s also remember:\n\nLand of the free BECAUSE of the brave.\n\n🇺🇸🇺🇸🇺🇸 https://t.co/sUQo0kKRTX","date":"Sat Jul 03 19:59:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In 2018, Pelosi called $1,000 bonuses from Trump's Tax Cuts &amp; Jobs Act \"crumbs.\"\n\nWhat does that make Biden's $0.16? 🤔","date":"Fri Jul 02 13:30:11 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Until Democrats get serious about prioritizing real needs of Americans over wasteful spending like artwork at train stations and duplicative government programs, our nation’s infrastructure will continue to fall behind our competitors.\n\nFull statement ⬇️ https://t.co/SrS39NVPi9","date":"Thu Jul 01 18:20:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"THIS is what real leadership looks like.\n \nTake notes, @VP. https://t.co/lowUALXXXM","date":"Thu Jul 01 17:53:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Shame on @CNN. No wonder their ratings are plunging.\n\nInstead of likening a despicable dictator to a celebrity, let's focus on the CCP's grotesque human rights violations.\n\nWith 100 years of torture, repression, mass imprisonment, and genocide, I'm sure there's plenty to cover.","date":"Thu Jul 01 15:08:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Earlier today, I voted against Speaker Pelosi's partisan political circus. \n\nFull statement ⬇️ https://t.co/F0EyJPluBS","date":"Wed Jun 30 23:52:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed seeing you today! Thankful for your leadership and friendship. 🇺🇸","date":"Wed Jun 30 23:16:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats: “Republicans want to defund the police.”\n\nThe American people know this is a LIE.\n\nIt's always been Democrats that support defunding the police.\n\nBut don’t just take it from me. 👀⬇️ https://t.co/J335lDq7c2","date":"Wed Jun 30 17:16:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The data is clear: Cutting off federally funded unemployment benefits is necessary to advance our economic recovery.\n\nProud of Alabama and 21 other states for empowering workers and removing incentives to stay home. https://t.co/my65phSA44","date":"Wed Jun 30 14:33:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"There are SO many unanswered questions surrounding the origins of COVID-19. \n\nAmericans deserve answers - and Republicans will not rest until we uncover ALL the facts.","date":"Tue Jun 29 18:21:12 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"cc: @PressSec","date":"Tue Jun 29 17:52:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last week, VP Harris claimed the Biden administration has made \"progress\" in addressing the border crisis.\n\nWHAT?\n\nThere were over 180,000 illegal border crossings in May - a new 21-year high.\n\nNumbers don't lie, but our Border Czar does.","date":"Tue Jun 29 15:38:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thomas Jefferson once said, \"When the people fear the government, there is tyranny. But when the government fears the people, there is liberty.\"\n\nI will always fight to protect #2A rights. https://t.co/a5Hh4ZsEov","date":"Tue Jun 29 14:01:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Concern over America's crime crisis isn’t “hysteria,” @RepAOC.\n\nDownplaying skyrocketing crime rates and defunding the police will only further endanger American property and lives. https://t.co/ld18SF47mV","date":"Mon Jun 28 18:51:18 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Unacceptable and un-American.\n \nU.S. Olympians represent the USA - not themselves. All Americans should celebrate our flag and national anthem, which represent patriotism, freedom, and sacrifice. 🇺🇸\n \nShame on Gwen Berry. https://t.co/PT6mU7JvDC","date":"Mon Jun 28 14:12:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"FYI: Kamala Harris did NOT actually visit the southern border yesterday. She visited a Border Patrol facility in El Paso—miles away from the real crisis.\n\nAmericans deserve true leadership, not a “Border Czar” merely checking a box on her to-do list…93 days late.","date":"Sat Jun 26 21:29:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed a fun dinner with @BillBubbaBussey and Betty in D.C. last night! https://t.co/VDgGI8vFqv","date":"Sat Jun 26 14:06:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I was saddened to hear that former Congressman Sonny Callahan passed away. Sonny represented the First District but was well known and respected throughout Alabama. Please join me in praying for his family and loved ones.","date":"Fri Jun 25 22:36:16 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It only took 93 days…\n https://t.co/9MQmZ38w4I","date":"Fri Jun 25 16:01:45 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The best welfare program in the world is a job - not the government. https://t.co/m211QaHmjb","date":"Thu Jun 24 21:58:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"A \"great job\"...?\n\nWhat a joke.\n\nVP Harris has FAILED to secure our southern border for MONTHS.","date":"Thu Jun 24 20:52:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden to struggling small businesses facing labor shortages: “Pay them more.”\n\nBusinesses shouldn’t have to compete with checks from the federal government.\n\nThis President is holding American businesses hostage.\nhttps://t.co/HHwIpYiMiG","date":"Thu Jun 24 20:12:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Hands down @AuburnFootball. 🐅\n\nWar Eagle! 🦅🏈","date":"Thu Jun 24 19:29:58 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden's dereliction of duty at our southern border is completely unacceptable.\n\nProud to join @RepBoebert in holding Biden accountable for putting politics over the people he has sworn an oath to protect. https://t.co/hXhV1H98uQ","date":"Thu Jun 24 13:43:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"FINALLY.","date":"Wed Jun 23 17:05:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Violent crime is surging across the country.\n\nHomicides are up:\n📍 533% Portland\n📍 58% Atlanta\n📍 37% Philadelphia\n📍 22% Los Angeles\n📍 13% NYC\n\nThis is what happens when you defund the police.","date":"Wed Jun 23 15:42:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Taxpayer dollars should NEVER fund abortions.\n\nBiden's decision to exclude the Hyde Amendment from his budget proposal is unconscionable. Proud to see Alabama @AGSteveMarshall fighting for religious freedom and the sanctity of life. https://t.co/vjOHw8MFPP","date":"Wed Jun 23 14:06:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"VP Harris has laughed off her duties as Border Czar for 90 days.\n\nThat's 90 days of:\n❌ 0 leadership\n❌ 0 trips to the border\n❌ 0 cares for the American people https://t.co/aFemEackon","date":"Tue Jun 22 17:45:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"While Democrats have shown ZERO interest in investigating the CCP’s role in COVID-19, Republicans have a plan to hold China accountable.\n\nCheck it out ⬇️\nhttps://t.co/7XfoXKSt0u","date":"Tue Jun 22 14:48:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Sickening but not surprising.\n\nThe Biden administration continues to heartlessly disregard the sanctity of human life. https://t.co/CmjITWXyQM","date":"Mon Jun 21 18:55:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"By excluding the long-standing Hyde Amendment from his budget, President Biden would force taxpayers to fund abortions.\n\nMaybe 2021 Biden should listen to 1994 Biden. https://t.co/nwbItrWze7","date":"Mon Jun 21 15:16:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Nothing beats being a father. Incredibly blessed for my beautiful family and all the wonderful memories we share.\n\nFrom my family to yours, Happy Father’s Day! https://t.co/R0BlAzs8Vo","date":"Sun Jun 20 15:30:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Heartbreaking. Heather and I are praying for the families who lost loved ones and a full recovery for those injured in the crash. https://t.co/N8dNkxBc4j","date":"Sun Jun 20 14:52:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Despite the WHO’s inability to hold the CCP accountable for its role in spreading COVID-19, Biden’s budget proposes giving the organization $124 million.\n\nUnbelievable. The Biden administration continues to put Americans last.","date":"Sat Jun 19 17:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 ICYMI: My latest The Moore You Know column is out! https://t.co/mHMQ4YRs4C","date":"Sat Jun 19 15:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday, I was honored to attend the groundbreaking ceremony for The Landing, a new subdivision that will include roads named after fallen soldiers from Enterprise. May our community honor these heroes, remember their sacrifice, and never forget the price of freedom.\n\n🇺🇸🇺🇸🇺🇸 https://t.co/Hrd3NGQe3k","date":"Sat Jun 19 14:31:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Human smugglers continue to take advantage of the Biden Border Crisis, putting young children in danger every day.\n\nCBP has already conducted 7,084 rescue missions this year, compared to 5,255 for all of 2020.\n\nSECURE THE BORDER.","date":"Fri Jun 18 17:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Sickening.\n\nFor the record, @SpeakerPelosi, a 15-week-old unborn baby IS a human being. https://t.co/lhqCNE4Z9b","date":"Fri Jun 18 14:38:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy birthday to my friend and colleague, @RepJerryCarl! It's an honor to fight for Alabamians with you in Washington. 🇺🇸","date":"Thu Jun 17 20:17:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This exchange is incredibly disturbing. I'll bet our Border Czar Kamala Harris doesn't know the answers either. #BidenBorderCrisis","date":"Thu Jun 17 19:11:18 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We've gone from America First to Americans Last.","date":"Thu Jun 17 17:58:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"During the Geneva summit, Biden gave Putin a custom pair of aviator sunglasses.\n\nBut let's not forget Biden's greatest gift to Putin:\nThe Nord Stream 2 pipeline\n\nClearly, Putin got what he *really* wanted.","date":"Thu Jun 17 14:26:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 Tune in, #AL02!","date":"Thu Jun 17 13:17:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden ➡️ The border is \"under control\"\nHarris ➡️ “Do not come”\nReality ➡️ Illegal border crossings just reached a 21-year high\n\nActions speak louder than words.","date":"Wed Jun 16 20:56:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Failure to follow the science is a failure of leadership.\n\nIt's time to fully reopen the People's House.\nhttps://t.co/RAVD6dggVR","date":"Wed Jun 16 16:02:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden is on track to bankrupt America. https://t.co/SnsnYYacfn","date":"Wed Jun 16 14:34:03 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"A record-high 48% of small businesses reported unfilled job openings last month.\n\nThis is the direct result of incentivizing Americans to stay home.\n\nBiden's failed economic policies will not usher prosperity - but reopening America will.","date":"Tue Jun 15 19:12:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The #BidenBorderCrisis is deadly.\n\nLast month, CBP seized 934 POUNDS of fentanyl at the southern border.\n\nThat's enough to kill 211,850,000 Americans.\n\nWe must secure the border NOW.","date":"Tue Jun 15 14:16:10 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"May 2020 border encounters: 23,237\nMay 2021 border encounters: 180,034\n\nFolks, that’s a 674% INCREASE - yet @VP is MIA.\n\nAmericans deserve better.","date":"Mon Jun 14 21:14:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy birthday, President Donald J. Trump!\n\nThank you for always putting Americans first. 🇺🇸 https://t.co/IxryPm6D1F","date":"Mon Jun 14 18:21:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy birthday, @USArmy! 🇺🇸\n\nFor 246 years, these brave heroes have fought to keep our nation safe. Thank you for your service! https://t.co/ISRWpRWzng","date":"Mon Jun 14 16:34:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"From gasoline to everyday grocery items, prices across the country are on the rise.\n\n⛽️ 56%\n🚗 7.3%\n🥓 13%\n🥛 7.2%\n🐟 7.5%\n🍳 3.81%\n\nWe simply can’t afford #Bidinflation.","date":"Mon Jun 14 15:33:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"For 244 years, the Stars and Stripes have served as the strongest symbol of patriotism, liberty, and sacrifice. This #FlagDay, please join me in honoring the American flag and the freedom it represents.\n\nGod bless the USA! 🇺🇸 https://t.co/iLlCuObVdk","date":"Mon Jun 14 14:05:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's disastrous economic policies are failing small business owners.\n\n⚠️ 48% have raised prices due to high costs\n⚠️ 83% have seen increases in operating costs\n⚠️ 81% say it's hard to recruit qualified workers","date":"Sat Jun 12 16:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"For 4 years, the media pushed lie after lie about Trump.\n\nThis week, another headline was proven FALSE.\n\n- Wuhan Lab COVID leak theory\n- Russian bounty on U.S. soldiers\n- Benefits of Hydroxychloroquine\n- Clearing Lafayette Square for a photo op\n\nThe truth ALWAYS prevails.","date":"Fri Jun 11 16:33:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The message is clear: Americans LAST. https://t.co/jUQ3qGa9by","date":"Fri Jun 11 15:25:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last month, consumer prices accelerated at their fastest pace in nearly 13 years.\n\nBidenomics continues to fail the American people.","date":"Thu Jun 10 19:40:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last week, I visited the Butterfly Bridge Children’s Advocacy Center in Wetumpka, where we discussed the support, healing, and resources they provide to children victimized by abuse. I’m thankful for the incredible work they do to assist Alabamians in need. https://t.co/2UlnLK8MUR","date":"Thu Jun 10 18:39:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 The truth ALWAYS comes out. 🚨\n\nYet another lie recklessly pushed by the media is proven false.\n\nWill the fake news media ever be held accountable? https://t.co/fvvmp8HSWd","date":"Thu Jun 10 14:41:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Don't let the Biden administration fool you - the #BidenBorderCrisis is only getting worse.","date":"Thu Jun 10 14:18:47 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"May is the third straight month of more than 170,000 apprehensions at our southern border.\n\nThis hasn't happened in 21 years.\n\nStill think this is a joke, @VP?","date":"Wed Jun 09 20:33:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Apparently, some folks are triggered by one of the greatest symbols of valor, freedom, and sacrifice.\n\nWhat a shame. I guess it’s hard to be patriotic with so much hate in their hearts for our country.\n\nI’m proud of our flag and the strong American values it represents. 🇺🇸 https://t.co/MdOpkxJ3x6","date":"Wed Jun 09 17:42:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Comparing the U.S. to terrorist organizations is outrageously disrespectful to our American troops that have heroically fought for our freedoms.\n\nThis hateful and un-American rhetoric has no place in Congress. https://t.co/fsxvzMR6ko","date":"Tue Jun 08 20:36:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What an embarrassment.\n\nEnough dodging. \nEnough laughing.\nEnough making excuses.\n\nIt's time for the \"Border Czar\" to visit - and secure - the southern border.","date":"Tue Jun 08 14:45:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"VP Harris is visiting *checks notes* Guatemala to address the \"root causes\" of migration.\n\nShe should've saved herself the trip, considering the root cause of the Biden Border Crisis is sitting at 1600 Pennsylvania Ave.","date":"Mon Jun 07 17:50:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The more we learn, the more it looks like Trump was right all along; China lied and millions of people have suffered and died.\n\nWe must hold the CCP accountable. https://t.co/LHL9Y6CIXS","date":"Mon Jun 07 15:20:16 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"You don't want to miss our May wrap-up newsletter!\n\nSubscribe to The Moore You Know ➡️ https://t.co/FN2pPa6aiJ https://t.co/uvupAGPRb5","date":"Sun Jun 06 18:01:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"77 years ago, thousands of brave Americans stormed the beaches of Normandy to protect the world from evil. Their heroic actions changed the course of history forever. Today, we honor and remember their selflessness and sacrifice in the fight for freedom. 🇺🇸 https://t.co/RbB4335QSR","date":"Sun Jun 06 15:04:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's budget would spend $69,000,000,000,000 and impose $55,000,000,000,000 in new taxes over the next 10 years.\n\nOur children and grandchildren will be paying for this nonsense for years to come.","date":"Sat Jun 05 19:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 ICYMI: While President Trump strengthened border security and weakened the cartels, Joe Biden opened up America’s borders and emboldened the criminals seeking to take advantage.\n\nMy latest with @MarkMeadows in @FoxNews ⬇ https://t.co/Tq6FPN7PzU","date":"Sat Jun 05 17:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What an incredible story. Congratulations, General Dickerson, and thank you for your service to this great nation! 🇺🇸 https://t.co/jnYC9ODhw6","date":"Sat Jun 05 15:00:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Just wrapped up an informative tour at Surgery Center South, where we discussed the various operations they perform, caring for our veterans, and their experience throughout the pandemic. Thanks for having me! https://t.co/DIlBoG4TSE","date":"Fri Jun 04 20:54:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Check out my latest column on the border crisis, Biden's energy hypocrisy, investigating the origins of COVID, and Alabama's impressive economic recovery. ⤵️\nhttps://t.co/X9vB8RRBKP","date":"Fri Jun 04 17:13:24 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wonderful meeting some of my incredible constituents this morning at our Breakfast with Barry event at Ray’s Restaurant in Dothan! I’m always grateful for the opportunity to address their concerns, including CRT, infrastructure, and border security.\n\nThanks to all who joined us! https://t.co/uxzoa9LNEw","date":"Fri Jun 04 16:00:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed meeting Trip Horne, a cattle farmer in Barbour County, yesterday. Special thanks to ALFA’s Mitt Walker and Guy Hall for organizing this informative tour! https://t.co/DMiKT3XYYo","date":"Fri Jun 04 15:07:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The May jobs report missed the mark by 100k jobs.\n\nEnough is enough.\n\nIt's time for Biden to stop incentivizing unemployment and get Americans back to work. https://t.co/xKsWTJi6Hn","date":"Fri Jun 04 12:54:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great to see some of my constituents and local leaders at our Eufaula Town Hall! From expanding access to rural broadband to securing our southern border, we had a constructive conversation about the future of our nation. 🇺🇸 https://t.co/hrEQaXQPJt","date":"Thu Jun 03 20:15:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Fauci's emails exposed his list of lies for the world to see.\n\nClearly, it's time to #FireFauci.\nhttps://t.co/MOTOy69yvc","date":"Thu Jun 03 17:49:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed meeting with the Millbrook Chamber of Commerce yesterday afternoon. We discussed how policies in Washington will affect #AL02, including Biden's \"infrastructure\" plan.\n\nAlabamians deserve real infrastructure, not Democrats' $1T liberal wish list.\nhttps://t.co/vLLcCQsIR5","date":"Thu Jun 03 14:58:22 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"By excluding the Hyde Amendment from his budget, Biden is forcing taxpayers to fund abortions.\n\nBiden's $6T budget isn't just bloated - it's immoral.","date":"Wed Jun 02 19:44:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"VP Harris has ignored the #BidenBorderCrisis for 70 days.\n\nThat is NOT leadership. Americans deserve better.","date":"Wed Jun 02 17:51:22 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Honored to join the Montgomery Chamber of Commerce Eggs and Issues event this morning. From helping our veterans through the GI Bill NEED Act to securing rural broadband for our farmers, I'm working towards delivering measurable change for Alabamians. Thanks for having me! https://t.co/nvBjghBZFQ","date":"Wed Jun 02 16:07:50 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Spend trillions of tax dollars to go back to anemic Obama-era economic growth?\n\nNo thanks, @POTUS.\nhttps://t.co/PxBzXOK5yR","date":"Tue Jun 01 20:18:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great town hall in Slocomb this afternoon! We discussed some of the toughest challenges facing our nation, including the crisis at our southern border. Special thanks to Geneva County Commissioner Weston Spivey for organizing such a wonderful event. https://t.co/oBD1dnBpLn","date":"Tue Jun 01 18:21:45 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"☀️🍳☕️ Another successful Breakfast with Barry this morning at the Porky Barn in Geneva! Great meeting some of my constituents and discussing the future of our nation. https://t.co/mFRijXutYa","date":"Tue Jun 01 16:08:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Check out my op-ed with @MarkMeadows on how Biden turned Trump's secure border into the #BidenBorderCrisis. ⤵️\nhttps://t.co/Tq6FPN7PzU","date":"Tue Jun 01 14:49:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Honored to deliver the invocation at the Wiregrass Memorial Day Ceremony at Sunset Memorial Park in Dothan.\n\nFreedom isn’t free. God bless our fallen heroes, those who have served, and those who are currently serving. 🇺🇸\n\n#MemorialDay https://t.co/byW25L2WIj","date":"Mon May 31 19:18:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Never forget the men and women who made the ultimate sacrifice to protect our freedom.\n\nGod bless these heroes and their families. 🇺🇸\n\n#MemorialDay https://t.co/ZE1PYGQEh1","date":"Mon May 31 13:08:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Want to stay up-to-date on my work in Congress?\n\nSubscribe to The Moore You Know Newsletter!\n\nSign up here ➡️ https://t.co/e3yRaeTgnq https://t.co/SGqmJeliGP","date":"Sun May 30 17:14:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Earlier this month, Troy’s @PikeLibPatriots baseball team won the 3A state championship! Congrats, @BaseballPike - way to make #AL02 proud! ⚾️🏆 https://t.co/UcpcMh0Tjx","date":"Sat May 29 20:01:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Special thanks to Max Bozeman for taking me on a tour of his farm yesterday. We discussed crop damage, conservation, and his production of corn and peanuts. 🌽🥜\n\nI always enjoy meeting the hard working farmers who feed and fuel our nation. https://t.co/0c1X1R0Nra","date":"Sat May 29 15:34:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"ICYMI: I joined the Chris Salcedo show on Newsmax to discuss my recent trip to the southern border, Biden’s outrageous $6 trillion budget, and anti-American values of socialists in Congress. https://t.co/BLKcWaIg8z","date":"Fri May 28 22:27:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"TUNE IN: I’m about to join @newsmax to discuss the Biden Border Crisis, Democrats’ reckless spending, and more.","date":"Fri May 28 21:03:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wonderful Memorial Day Ceremony at Fort Rucker this morning, where Heather and I met nine remarkable Gold Star families. Such a special event spent honoring our nation’s fallen heroes. 🇺🇸 https://t.co/Xp3zznoOLf","date":"Fri May 28 18:55:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"As we head into #MemorialDay weekend, we must remember to honor the brave men and women who gave their lives to protect our freedoms. 🇺🇸","date":"Fri May 28 18:20:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday, I had the opportunity to tour Jeremy Brown’s farm in Ramer, AL.\n\n🐓 As poultry farmers, the Brown family plays a vital role in the agriculture industry. I’m thankful for their hard work and grateful to ALFA for planning this incredible visit! https://t.co/gvNxNhRJsD","date":"Fri May 28 17:59:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great meeting with members of the Home Builders Association of Alabama yesterday! We had a productive discussion about their legislative priorities, including how inflation is impacting building materials and consumers. Thanks for having me! https://t.co/3nVZjI1Vfd","date":"Fri May 28 14:33:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Americans deserve the truth. \n\nChina unleashed the virus, covered it up, and killed millions around the world.\n\nWe must hold the CCP accountable.","date":"Fri May 28 13:53:58 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's pick to run the ATF doesn’t respect our Second Amendment rights.\n\nUnqualified is an understatement. https://t.co/85RYXjMsRj","date":"Thu May 27 20:17:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Migrants from overseas are taking full advantage of the #BidenBorderCrisis.\n\nYet our Border Czar's primary focus remains on the \"root causes\" of migration in Central America.\n\nThe Biden administration's severely misguided approach is only making matters worse. https://t.co/GlQECKQMHa","date":"Thu May 27 13:35:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"If it’s this easy for @RepGarretGraves, it’s no wonder how more than 178,000 illegal immigrants were encountered at the southern border in April alone.\n\nWe must secure the border.","date":"Wed May 26 17:35:12 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Does this look closed to you, @POTUS? https://t.co/j9fjU06Iih","date":"Wed May 26 17:27:50 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"ISO: @VP https://t.co/BBdu5KPu44","date":"Wed May 26 15:51:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"China lied and people died.\n\nWe must hold them accountable. https://t.co/p137zVsesO","date":"Tue May 25 18:59:10 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"If Biden wants to “build back better,” he should start with the Border Wall. https://t.co/n2oKFiUQAo","date":"Tue May 25 17:16:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"A secure border is a compassionate border. https://t.co/1zEEYtqiBo","date":"Mon May 24 21:34:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"HAPPENING NOW: My colleagues and I are in El Paso at our Southern Border giving you a live update. Tune in NOW! \n\nhttps://t.co/myHMel8FMe","date":"Mon May 24 19:55:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Take notes, @POTUS.","date":"Mon May 24 19:06:46 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In just four months, Biden has created four crises:\n\n❌ Biden Border Crisis\n❌ Economic Crisis\n❌ Energy Crisis\n❌ National Security Crisis\n\nThis administration is failing the American people.","date":"Mon May 24 15:04:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Want an inside scoop on my work in AL and DC?\n\nSubscribe to The Moore You Know Newsletter!\n\nSign up here ➡️ https://t.co/e3yRaeTgnq https://t.co/uXp2t3138D","date":"Sun May 23 15:00:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Honored to join my colleagues for the commissioning of the USS Mobile made right here in Alabama. May you have fair winds and following seas, Commander Christopher Wolff, USN! https://t.co/LVLm9YRN1K","date":"Sat May 22 17:12:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great visiting Ravenwood Sporting Clays yesterday! Enjoyed touring their course and discussing the importance of protecting our #2A rights. 🇺🇸\n\nThanks for having me! https://t.co/EotWKRu4RS","date":"Sat May 22 15:08:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"After two weeks in the Swamp, it’s good to be home.\n\nEnjoyed our Henry County town hall this morning, where we discussed some of the toughest challenges facing our nation. It’s an honor to fight for them in Congress! 🇺🇸 https://t.co/YltfK1bXFa","date":"Fri May 21 18:39:10 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wonderful meeting with Judge David Money and Mayor Jimmy Money in Abbeville this morning! Great conversation about how we can work together to serve #AL02. https://t.co/uc3CclZj7Z","date":"Fri May 21 17:08:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Rules for thee but not for me. Classic, @SpeakerPelosi. https://t.co/E8K1cL9oZ9","date":"Thu May 20 23:44:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🇺🇸🇺🇸🇺🇸","date":"Thu May 20 20:08:22 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"My friend, @RepCawthorn , and I came here to fight for our Veterans, and we’re proud to announce our pro-veterans bills passed out of the House this week. \n\nOur nation’s heroes deserve the best, and we’re proud to advocate on their behalf. https://t.co/GykvK3Gm4X","date":"Thu May 20 19:57:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great meeting with the Home Builders Association of Alabama and hearing about their legislative priorities. Thanks for taking the time to meet with me! https://t.co/WeBtGGFadX","date":"Thu May 20 18:30:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden’s failed economic policies will not usher prosperity - but reopening America will.","date":"Thu May 20 18:20:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Strong rural America starts with strong connectivity.\n\nThat's why @HouseAgGOP is taking action to end the digital divide.","date":"Thu May 20 17:58:12 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I will always #StandWithIsrael. 🇺🇸🇮🇱 https://t.co/L6w5lPNVml","date":"Thu May 20 14:24:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Tune in, #AL02!","date":"Thu May 20 14:11:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden told P.M. Netanyahu that he wants to see a ceasefire. \n\nI'm sure Israel would love that, they just need Palestine to stop lobbing bombs at them.  \n\nCeasefires are a two-way street. \n\nhttps://t.co/7lrWZlcABM","date":"Wed May 19 18:34:10 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last month, 178,622 illegal immigrants attempted to enter the U.S.\n\nThat’s 21-year-high.\n\nYet our Border Czar STILL hasn’t visited the southern border.","date":"Wed May 19 15:56:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"When my constituents sent me to Washington, I promised them that I would fight for our veterans.\n\nI'm honored to keep that promise.\n\nLearn more ➡️ https://t.co/3f5LvcPAqu https://t.co/Y8aWei4HO3","date":"Tue May 18 22:53:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"No matter how hard Biden tries to spin the numbers, inflation is on the rise.\n\n📈 Meat 4%\n📈 Copper 36%\n📈 Lumber 124%\n📈 Used cars 21%\n📈 Gasoline 49.6%\n📈 Fresh fruit 6.2%\n📈 Furniture &amp; bedding 7.8%\n\nBidenomics is failing the American people.","date":"Tue May 18 18:39:50 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden follows teachers unions instead of science.\n\nParents and students deserve better.","date":"Tue May 18 16:50:58 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The science is clear.\n\nWe must reopen the People's House. https://t.co/DAq71kWM21","date":"Tue May 18 16:33:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This is 2mg of fentanyl - a lethal dose for most Americans.\n\nSo far, CBP has seized 6,494 pounds of fentanyl in the first FIVE months of 2021 - more than ALL of 2020.\n\nWe must SECURE THE BORDER. https://t.co/Hg7Rlcjzbk","date":"Tue May 18 15:17:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thank you, @RepMarkTakano &amp; @RepBost, for your leadership and support for this vital legislation.","date":"Mon May 17 19:54:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We have a responsibility to take care of our nation's heroes.\n\nH.R. 2167 includes two of my bills, the Col. John McHugh Tuition Fairness for Survivors Act &amp; the Overseeing the GI Bill Act of 2021, which bring us closer to securing long-overdue support for our veterans.\n\nWatch ⤵️ https://t.co/zJplaxp9GZ","date":"Mon May 17 19:53:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"We must stand with Israel - not embolden their enemies. https://t.co/5PXWPOEjxM","date":"Mon May 17 17:29:39 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 Reminder: Today is the final day to file your individual federal and state income taxes. \n\nMore #TaxDay information ➡️ https://t.co/mjcZ80AoKw https://t.co/gDErZQVN9A","date":"Mon May 17 14:15:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On #ArmedForcesDay, we honor the men and women in uniform who courageously keep our nation safe.\n\nGod bless these heroes for sacrificing so much to defend our freedom both at home and abroad. 🇺🇸 https://t.co/U0m16gtK3B","date":"Sat May 15 19:19:03 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"TUNE IN: catch me on #SpicerAndCo TONIGHT on @Newsmax at 5pm ct/6pm et https://t.co/7kBX9GcYmm","date":"Fri May 14 21:50:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Every member of Congress should stand with Israel - not defend terrorists.\n\ncc: @RepAOC @Ilhan @RepRashida @RepPressley","date":"Fri May 14 19:13:35 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Spoiler alert: You don't have this kind of power, Mr. President.\n\nThe choice to get vaccinated lies with the American people - not the government.","date":"Fri May 14 16:09:12 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The science is clear, @SpeakerPelosi. \n\nIt's time to REOPEN Congress. https://t.co/b6y4UY22UN","date":"Fri May 14 15:17:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"To be clear, the science never changed.\n\nBut I'm glad the CDC finally started following the science instead of playing politics.","date":"Thu May 13 20:58:11 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It's simple, folks.\n\nWhen Democrats defund the police, our communities are LESS safe.\n\nI'm proud to #BackTheBlue. https://t.co/UKpYhvhX9s","date":"Thu May 13 15:55:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"VP Harris was named \"Border Czar\" 50 days ago.\n\nSince then, we've had 50 days of:\n\n0 results.\n0 leadership.\n0 trips to the southern border.","date":"Thu May 13 14:12:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"2,000,000 illegal immigrants are expected to cross the border this year.\n\nYep, you read that right - 2 million.\n\nThis is the #BidenBorderCrisis. https://t.co/QenTPvG5qX","date":"Wed May 12 20:16:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Through the Abraham Accords, Trump made historical steps towards peace in the Middle East.\n\nIn comparison, Biden's weakness is fueling violence, as Israel is under attack from Hamas terrorists.\n\nNow is the time for strong leadership, Mr. President. \n\nWe must stand with Israel.","date":"Wed May 12 17:21:22 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"❌ Soaring inflation.\n❌ Rising unemployment.\n❌ Skyrocketing gas prices.\n❌ Surging illegal border crossings.\n\nThis is Joe Biden's America.","date":"Wed May 12 15:23:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Republican leadership should unify the party, not divide it. \n\nRep. Cheney’s decision to focus her efforts on attacking former President Trump instead of uniting our party proves that she lost sight of our common goals. \n\nIt was time for her to go.","date":"Wed May 12 13:51:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The April jobs report was a HUGE disappointment.\n\nWhat’s Biden’s solution?\n\nRaise taxes, spend trillions, and incentivize unemployment.","date":"Tue May 11 19:01:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"77% of voters want Biden or Harris to visit the southern border immediately.\n\nAmericans deserve leadership - not inaction.\n\n#BidenBorderCrisis https://t.co/JiPUSBhoEI","date":"Tue May 11 15:41:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Paying people not to work is crippling our economic recovery.\n\nHere's a glimpse into the heartbreaking reality small businesses are facing around the country. (Courtesy of 1220 Cafe | Tallassee, AL) ⤵️ https://t.co/UfRy7a2vwi","date":"Tue May 11 13:24:22 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Critical Race Theory doesn’t chip away at inequity, it perpetuates it. \n\nI'm proud to work with my colleagues to prohibit the government-sponsored spread of CRT.\n\nLearn more ➡️ https://t.co/RmwsVTg9TF https://t.co/s2uRFVjLyn","date":"Mon May 10 19:56:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The United States will always stand with Israel and the Jewish people. 🇺🇸🇮🇱\n\nIsrael has every right to defend itself against the violent attacks from Hamas. \n\nPraying for their safety and peace.","date":"Mon May 10 18:26:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 The Biden admin estimates that they'll need an additional $4 billion for conditions at the southern border by the end of September.\n\nBut the President still refuses to publicly admit that the #BidenBorderCrisis is real. So much for leadership. https://t.co/gVjG4ZX00c","date":"Mon May 10 17:29:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"During #NationalPoliceWeek, we honor and remember law enforcement officers who lost their lives in the line of duty.\n\nEvery day, police officers risk their lives to keep our communities safe. Please join me in thanking these brave men and women for their service. https://t.co/ZiXtW7wSJJ","date":"Mon May 10 14:31:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"To the incredible women in my life and mothers everywhere, I hope you have a very happy Mother’s Day. https://t.co/XM6BctmB4g","date":"Sun May 09 15:02:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 Check out my latest column for my thoughts on Biden's first 100 days, Democrats' latest power grabs, and more. https://t.co/rEaCAXaE7u","date":"Sat May 08 18:00:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On this day 76 years ago, the Allied Forces declared victory over evil, ending WWII in Europe. We honor those who gave the ultimate sacrifice for peace and freedom. #VEDay https://t.co/8YZYuXTu8i","date":"Sat May 08 17:46:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Championship bound! Troy's @PikeLibPatriots are playing in the State Championship series this Wednesday.\n\nGood luck, team! ⚾️ https://t.co/plWbByxnua","date":"Sat May 08 15:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"DHS Secretary Mayorkas visited the southern border today.\n\nMaybe he should've invited our Border Czar to join him.","date":"Fri May 07 19:43:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today’s disappointing jobs report proves it's time to REOPEN AMERICA.","date":"Fri May 07 15:38:11 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thank you to all of the military spouses who care, support, and sacrifice so much for our service members. #MilitarySpouseAppreciationDay 🇺🇸 https://t.co/zbibsQfkqu","date":"Fri May 07 14:29:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The disastrous reality of massive spending, greater government regulation, tax hikes, and disincentivizing Americans to get back to work.\n\nBiden is to blame. https://t.co/LwJKmQDrVz","date":"Fri May 07 14:05:35 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"REMINDER: We're seeking a Wounded Warrior or medically retired veteran for a paid fellowship in our Dothan District Office through December 2022.\n\nInterested veterans can find more information and apply here: https://t.co/X3El7MW3tw https://t.co/O26DEMtGr0","date":"Thu May 06 21:05:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"During #NurseAppreciationWeek, we recognize nurses in #AL02 and across the country who work tirelessly to care for others. These healthcare heroes have been on the frontlines of the pandemic, and I'm grateful for their dedication and resiliency in battling against COVID-19. https://t.co/lBBuNGITcg","date":"Thu May 06 19:56:22 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's mismanagement of the southern border has empowered cartels to flood our country with fentanyl. Seizures of the dangerous drug are soaring at an alarming rate, but the President continues to ignore the crisis he created.\n\nWe MUST secure the border.","date":"Thu May 06 18:54:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The VA’s growing backlog is unacceptable and raises serious doubt about the government’s ability to care for our nation’s heroes.\n\nI'm proud to join my colleagues to demand transparency and answers so that our veterans receive the care they deserve.","date":"Thu May 06 18:07:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On this #NationalDayofPrayer, we reflect on the power of prayer that serves as a source of healing, guidance, and strength for so many Americans.\n\nPlease join me in praying for prosperity and safety for our great nation. 🇺🇸 https://t.co/PoufUEHYVu","date":"Thu May 06 14:36:35 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"While illegal border crossings are at a 20-year high, deportations are at an all-time low.\n\nIncentivizing illegal immigration only adds fuel to the fire, Mr. President.\nhttps://t.co/MAk4nWl7wl","date":"Wed May 05 20:16:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"$6,000,000,000,000 in 100 days.\n\nHow will Biden pay for his socialist spending spree?\n\nBy imposing tax hikes that will devastate American families and businesses.\nhttps://t.co/xbOpPga56e","date":"Wed May 05 18:27:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wonderful news for AL02 veterans! 🇺🇸 https://t.co/8KnK3HmKXZ","date":"Wed May 05 16:01:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Facebook’s tyrannical message is clear—they won't stop censoring conservative voices that go against far-left Silicon Valley elites.\n\nBig Tech is a threat to free speech.","date":"Wed May 05 14:38:08 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"You should be on the ground at the southern border to discuss the #BidenBorderCrisis.","date":"Tue May 04 20:47:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Disrespectful and sickening. This is a direct result of the Left's smear campaign against our law enforcement.\n\nThe vilification of police must STOP.","date":"Tue May 04 19:42:08 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Since earmarks are back, let's look at a few outrageous requests:\n\n$300,000 dog park\n$4,000,000 elevator repairs\n$300,000 theatre renovations\n$3,000,000 park and pedestrian bridge\n$3,000,000 environmental resilience study\n\nYour tax dollars should NOT pay for pet projects.","date":"Tue May 04 17:47:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our adversaries are laughing at us. https://t.co/mrm30qBLZR","date":"Tue May 04 13:55:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy #TeacherAppreciationWeek! 📚🍎📝\n\nDespite facing incredible challenges over the last year, educators went above and beyond to ensure students received a quality education. Thank you to all of our teachers in #AL02! https://t.co/0hPXzgRZUj","date":"Mon May 03 20:13:19 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Days since Kamala Harris became Border Czar: 40\n\nNumber of times she's been to the border: 0\n\nSo much for taking this crisis seriously.","date":"Mon May 03 17:21:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden isn’t following the science, he’s following teachers unions.\n\nShameful.\n\nPut students first. Reopen schools. https://t.co/MfTNSLv5F3","date":"Mon May 03 15:11:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Over the last few months, we’ve had two fantastic interns assisting our office in Washington.\n\nBoth Thomas and Dave did excellent work and served the people of Alabama’s Second Congressional District well. I wish them success in their future endeavors! https://t.co/3eTl8Jfwp8","date":"Sat May 01 17:08:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great tour of the @AAC_Ozark this afternoon. Thank you to Director Stan Smith for taking the time to show me all of the excellent programs offered right here in the Wiregrass. https://t.co/OIJvHfRcms","date":"Fri Apr 30 20:32:22 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Thanks so much to Steve Frailey and Adam Carson for taking me around @LockheedMartin's Troy, AL facility. Many of the missiles supported by Lockheed Martin’s missile program are manufactured, assembled, and tested right here in ##AL02. Thanks for showing me around! https://t.co/U4MeLVePMm","date":"Fri Apr 30 17:53:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"“Close private detention centers!”\n\n“Abolish ICE!”\n\nBiden: “I agree with you. I’m working on it, man. Give me another five days.”\n\nHe’d rather fuel the crisis than fix it.\n https://t.co/Ckm4GgcDwh","date":"Fri Apr 30 17:01:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The radical Green New Deal will cost families $65,000 each year.\n\nHardworking Americans should not have to pay for Democrats’ socialist dream.","date":"Fri Apr 30 14:43:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed a wonderful lunch with the outstanding city officials of Brundidge. Thank you, Mayor Boyd, for having me and for presenting me with a key to the city! https://t.co/NYboSF1u9A","date":"Thu Apr 29 19:25:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In his first 100 days, Biden has proposed $6,000,000,000,000 in new spending. \n\nThis is getting out of control.","date":"Thu Apr 29 18:01:24 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Please join me in wishing @jeff_poor a very happy birthday today. Thanks for all you do for our great state, Jeff!","date":"Thu Apr 29 17:36:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"100 days in office.\n\n0 trips to the southern border.\n\nMissing the mark is an understatement.","date":"Thu Apr 29 15:32:46 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The only thing America needs to be rescued from is this administration’s socialist policies that will leave hardworking Americans out in the cold.\n\nRead my full response to President Biden's #JointAddress below ⤵️ https://t.co/V13fYkyLRC","date":"Thu Apr 29 13:58:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"“Our best future won’t come from Washington schemes or socialist dreams. It will come from you — the American people.”\n\nFact check: TRUE\n\nGreat job, @SenatorTimScott! 🇺🇸","date":"Thu Apr 29 02:52:19 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Oh great, more empty rhetoric about unity.\n\nActions speak louder than words.","date":"Thu Apr 29 02:12:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our “Border Czar” still hasn’t been to the southern border.\n\nI wouldn’t be so confident in her abilities to fix this crisis, Joe.","date":"Thu Apr 29 02:07:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"\"No responsible American president can remain silent when basic human rights are violated.\" \n\nSo does that mean you're finally going to acknowledge the humanitarian crisis you created at our border, Mr. President?","date":"Thu Apr 29 01:56:55 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"So is Biden just going to pretend he didn't eliminate THOUSANDS of jobs on his first day in office when he #KilledKeystone? \n\nTalk about a hot take.","date":"Thu Apr 29 01:29:31 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats better hope VP Harris does a better job spearheading the “American Jobs Plan” than she’s done managing the crisis at the border.","date":"Thu Apr 29 01:24:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Tonight, Biden will tout vaccinating 200 million Americans.\n\nJust remember, that goal was achieved thanks to Trump's successful Operation Warp Speed.\n\nGive credit where credit's due.","date":"Wed Apr 28 16:26:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Numbers don't lie.\n\nBiden’s lack of leadership and bad immigration policies have forced our southern border in the wrong direction. #BidenBorderCrisis https://t.co/uZ7ZmmrPHX","date":"Wed Apr 28 14:26:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Ten years ago, Alabama endured unimaginable loss and destruction from a series of tornadoes.\n\nToday, we remember the lives lost and recognize our great state's resiliency.\n\nWe will never forget. #27April10yr","date":"Tue Apr 27 19:54:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats will stop at nothing to quench their thirst for power. https://t.co/IdU0F8a9A3","date":"Tue Apr 27 18:35:33 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Completely unacceptable.\n\nIf these reports are true, @JohnKerry is a national security threat and should resign immediately. https://t.co/w48jCRl63u","date":"Tue Apr 27 16:25:10 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden’s first 100 days:\n\n❌ America last\n❌ Radical policies\n❌ Negative results\n❌ Bitter partisanship","date":"Tue Apr 27 14:37:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Kamala Harris hasn't been to the border - but her book has.\n\nIs she capitalizing on the #BidenBorderCrisis?\n\nAmericans deserve answers.\nhttps://t.co/RDLxXXJlSq","date":"Mon Apr 26 18:26:24 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats' $1.9 trillion \"COVID relief\" was never about COVID - @GOPLeader does the math to prove it.\n\nWhat a slap in the face to the American people.","date":"Mon Apr 26 17:24:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Expectation: Biden will be a Trojan horse for the radical Left.\n\nReality: AOC says Biden 'exceeded' progressive expectations in first 100 days.\n\nWhat a nightmare for the American people.\nhttps://t.co/bdbqyDZdt0","date":"Mon Apr 26 15:03:19 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Incredible news! Glad to see our great state is on the right track. https://t.co/zx9rJFoHTD","date":"Sun Apr 25 18:00:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Check out my latest column for my thoughts on Kamala Harris' absence at the southern border, the woke MLB, and more.\n\n⬇️⬇️⬇️\nhttps://t.co/r2aAFngH1v","date":"Sat Apr 24 16:00:02 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"172,331 illegal crossings in just ONE month.\n\nBut our \"Border Czar\" still hasn't visited the border.\n\nIt's time for the Biden Administration to fix the crisis they created. https://t.co/DutuN0a9JN","date":"Fri Apr 23 18:25:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy 113th birthday, @USArmyReserve! 🇺🇸\n\nThank you for your courageous service and sacrifice. https://t.co/JybGROKaBc","date":"Fri Apr 23 14:07:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"D.C. Statehood and court packing open the floodgates to reckless liberal policies.\n\nWe cannot allow Democrats to ruin our country.","date":"Thu Apr 22 19:57:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Since @PunchbowlNews has ignored my requests to set the record straight on Twitter, I will. I didn’t join the America First Caucus and hadn’t even seen that document until it was published.\n\nMaybe next time they’ll call me first to verify. https://t.co/ySK6YgcfOk","date":"Thu Apr 22 17:02:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Don’t be fooled.\n\n#HR51 isn’t about people - it's about Democrat power. https://t.co/CtgHfBfdSA","date":"Thu Apr 22 13:30:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"While the #BidenBorderCrisis rages on, Democrats are focused on:\n\nProviding lawyers to illegal immigrants &amp; limiting the president's ability to secure our borders.\n\nWe need real solutions - not liberal legislation.","date":"Wed Apr 21 18:20:46 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The truth about D.C. Statehood:\n\n- Unconstitutional\n- Fiscally irresponsible\n- Expands Dems' razor-thin majority\n- Gateway to passing radical policies\n\n#HR51 is about power - not people.","date":"Wed Apr 21 15:22:18 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats just BLOCKED @GOPLeader's resolution to censure @RepMaxineWaters - effectively excusing her reckless rhetoric.\n\nClearly, Democrats condone her calls for violence.","date":"Tue Apr 20 20:39:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Border Patrol has reported a 233% increase in fentanyl seizures over last year.\n\nBiden is aiding and abetting a public health catastrophe. https://t.co/FUgoIXjGhN","date":"Tue Apr 20 16:59:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats’ priorities: \n\n- Attacking 2A\n- Open borders\n- D.C. Statehood\n- Green New Deal\n- Defunding the police\n- Federalizing elections\n- Packing the Supreme Court\n\nThis liberal fantasy is America’s worst nightmare.","date":"Tue Apr 20 15:46:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":".@RepMaxineWaters' poisonous rhetoric poured fuel on a fire that's been burning cities down for the last year.\n\nWe must hold her accountable for dangerously inciting violence, looting, and arson.","date":"Tue Apr 20 13:52:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden is more concerned with what we call illegal immigrants than stopping them from flooding our southern border.\n\nFocus on the border crisis - not political correctness.\n\n#BidenBorderCrisis \nhttps://t.co/zaQ2LGUw5q","date":"Mon Apr 19 18:50:36 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden FINALLY admitted there is a crisis at our southern border.\n\nThen he sent Kamala Harris to...North Carolina.\n\nFor the sake of the American people, I hope this Administration gets its priorities straight.","date":"Mon Apr 19 15:57:44 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Over the weekend, @RepMaxineWaters told violent rioters to \"get more confrontational.\"\n\nThis rhetoric is dangerous, irresponsible, and unbecoming of a sitting member of Congress.\n\nDoes @SpeakerPelosi agree?","date":"Mon Apr 19 14:34:11 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This month, we #CelebrateDifferences by honoring the millions of Americans living with Autism and the countless ways they contribute to our communities, our nation, and the world. #AutismAwarenessMonth https://t.co/B4Yt4iZcgS","date":"Sun Apr 18 15:49:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"I fully support President Trump’s America First agenda &amp; policies that prioritize hardworking Americans. But I will not agree to join any caucus until I’ve had an opportunity to research their platform—which I haven’t done with the America First Caucus &amp; therefore haven’t joined.","date":"Sat Apr 17 13:09:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Packing the Supreme Court isn't just a \"bonehead idea,\" it's also a \"terrible, terrible mistake.\"\n\nWouldn't you agree, @POTUS?\n\n#KeepTheNine","date":"Fri Apr 16 15:27:24 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great virtual visit with students from Greenville High School who are participating in @SIFMAFoundation’s 2021 #CapitolHillChallenge. \n\nImpressive discussion on the importance of improving personal finances through saving and investing. https://t.co/oeamPs9SC8","date":"Thu Apr 15 21:14:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"According to Fauci, the Biden administration imposes COVID guidance on:\n\n✅ Americans\n❌ Illegal immigrants\n\nHypocritical COVID standards directly contribute to the health crisis at our southern border.","date":"Thu Apr 15 18:10:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This you, @POTUS? https://t.co/b4o6Smvn5I","date":"Thu Apr 15 14:58:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Build the wall.\n\nSecure the border.\n\nPut Americans first. https://t.co/UPzKrPjXsI","date":"Thu Apr 15 14:04:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Babies born alive through a botched abortion deserve protection.\n\n77% of Americans agree - including me.\n\nProud to sign this discharge petition to force a vote on the Born Alive Abortion Survivors Protection Act. It's time for Democrats to join our efforts to #EndInfanticide.","date":"Wed Apr 14 19:21:58 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"In less than 4 months in office, Biden plans on spending $4 TRILLION.\n\nFirst, it was nearly $2,000,000,000,000 on “COVID relief”\n\nNow, it’s another $2,000,000,000,000 on “infrastructure”\n\nTalk about reckless - and partisan - spending!","date":"Wed Apr 14 16:54:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Proud to introduce the Col. John McHugh Tuition Fairness for Survivors Act w/ @RepDavidTrone, @JerryMoran &amp; @SenatorTester to secure in-state tuition benefits for dependents &amp; survivors of eligible veterans.\n\nWe must ensure families of fallen heroes receive equitable benefits. https://t.co/ZNOyE53yLw","date":"Wed Apr 14 15:30:45 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy birthday, @USAFReserve!\n\nThank you for valiantly serving our great nation for the last 73 years. 🇺🇸 https://t.co/Vv5FhkxFco","date":"Wed Apr 14 14:37:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Your silence is deafening, @VP.\nhttps://t.co/6yzvmhhD0W","date":"Wed Apr 14 13:08:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Americans should have the freedom to choose whether or not they accept the COVID vaccine, and I'm proud to stand with @RepRosendale to preserve that right. \nhttps://t.co/qIwAmoYyv9","date":"Tue Apr 13 18:33:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats' \"infrastructure\" bill is NOT about infrastructure.\n\nIt's the Green New Deal in disguise. https://t.co/nb1SfTLZWh","date":"Tue Apr 13 16:43:17 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Let me get this straight.\n\nOur “Border Czar” has managed to visit:\n- A bakery\n- A yarn shop\n- A water facility \n- A community center\n\nBut HASN’T visited...the BORDER. https://t.co/v2lr1Bxfiu","date":"Tue Apr 13 15:01:39 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Less than two weeks ago, USCP Officer Billy Evans died protecting the U.S. Capitol.\n\nToday, we honor his life and bravery as he lies in honor in the Capitol Rotunda.\n\n\"No more policing\" smears his name and the millions of men and women in blue who selflessly serve our nation.","date":"Tue Apr 13 13:24:18 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"\"Anyone paying attention to the news knows the situation on the U.S.-Mexico border is terrible. Anyone who actually visits the border discovers it is worse than that.\"\n\nGreat read from @ByronYork ⬇️\nhttps://t.co/k2hrzk214n","date":"Mon Apr 12 18:38:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Joined Sen. Chesteen, Rep. Lee &amp; Rep. Sorrells at Wiregrass Electric Cooperative’s Youth Leadership Conference, where we enjoyed answering thoughtful questions from students representing schools across Houston &amp; Geneva counties. Thanks to COO, Brad Kimbro, for a great event! https://t.co/smJY8QyfA9","date":"Mon Apr 12 17:31:30 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The truth behind Biden's $2T \"bipartisan\" \"infrastructure\" bill:\n\n❌ 0 GOP support in Congress\n❌ Only 6% goes to roads, highways, and bridges\n❌ Only 2% for airways, waterways, and ports\n\nRedefining words to fit a liberal narrative is dangerous and dishonest.","date":"Mon Apr 12 14:38:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":".@RepDanCrenshaw truly is a fighter and American hero. Heather and I are praying for a full and speedy recovery.","date":"Sat Apr 10 19:12:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed hosting our first Team Moore staff retreat!\n\nGreat to have both our DC and District staff together for a fun and productive week. So many creative ideas on how we can best serve #AL02! https://t.co/lUfvsvfZuH","date":"Sat Apr 10 18:53:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"📺 Tune in, #AL02!","date":"Fri Apr 09 22:32:18 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"0 leadership.\n\n0 trips to the border.\n\n0 cares about the American people. https://t.co/5jaUVCkzHk","date":"Fri Apr 09 15:59:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"New York is shamelessly rewarding &amp; incentivizing illegal immigration.\n\nThe message is loud &amp; clear: America Last.","date":"Thu Apr 08 15:25:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Actually, no.\n\nThe Border Wall is infrastructure.\n\nLet’s finish it.","date":"Wed Apr 07 19:54:23 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed being back at the State House today, where I had the opportunity to introduce my staff to many of my former colleagues. Productive and informative visit focused on how we can all work together for the great people of Alabama! https://t.co/uiogYwm1PT","date":"Wed Apr 07 19:27:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On Yom Hashoah, we honor and remember the six million Jews lost due to Nazi Germany’s evil actions.\n\nWe must never forget the horrors of the Holocaust. #HolocaustRemembranceDay https://t.co/8a8IBzpaQm","date":"Wed Apr 07 17:51:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Our Wetumpka Office is officially up and running! We had a great turnout at our grand opening and town hall yesterday.\n\nPlease reach out to our office if we can help you or your family in any way. https://t.co/rAYFtDPybW","date":"Wed Apr 07 14:51:16 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday, I visited Children’s Harbor at Lake Martin, where they provide a place of comfort and fun to seriously ill children and their families.\n\nTruly enjoyed learning more about their services and the incredible work they do to assist families across Alabama. https://t.co/5Ozj8SrE0d","date":"Tue Apr 06 18:28:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Saddened to hear about the passing of my colleague, Rep. Alcee Hastings. Sending my thoughts and prayers to his family during this time.","date":"Tue Apr 06 16:33:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Grateful for the opportunity to ride along with State Troopers on Lake Martin yesterday.\n\nThank you for all you do to keep Alabamians and our waterways safe! https://t.co/A1vuyywwqf","date":"Tue Apr 06 15:32:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Georgia ➡️ 17 days of early voting\nColorado ➡️ 15 days of early voting\n\nBOTH ➡️ Voter ID\n\nLooks like the Woke @MLB didn't do their homework...again. #MLBAllStarGame","date":"Tue Apr 06 14:45:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Two more terrorists on the FBI’s watchlist were arrested after illegally crossing our southern border.\n\nHow many others go unnoticed?\n\nYet President Biden continues to turn a blind eye to the alarming border crisis and national security threat.","date":"Tue Apr 06 14:11:20 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Stopped by 1220 Cafe for lunch today! Enjoyed discussing how Sen. Will Barfoot and I can best serve #AL02.\n\nAlso great to see the owners, Noah and Pam Griggs. I always appreciate the chance to connect with hardworking small business owners like these two! https://t.co/Fitp5LYFt9","date":"Mon Apr 05 23:17:14 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great turnout at our Tallassee Town Hall today with Mayor Hammock. I appreciated getting to hear directly from my constituents about what’s keeping them up at night. Thank you, Mayor Hammock, for hosting such a successful event &amp; I look forward to working w/ you to serve #AL02 https://t.co/RyjdLXFbGq","date":"Mon Apr 05 22:39:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"171,700 - that's the highest number in 15 years, folks.\n\nWill Kamala Harris visit the border now? https://t.co/9NQn7COHbe","date":"Mon Apr 05 20:40:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Facts matter, Mr. President.\n\nUnder GA's election integrity law, polls close:\nEarly Voting ➡️ 5pm with the option to extend to 7pm\nElection Day ➡️ 7pm\n\nBlatantly lying to the American people as an excuse to push Democrats' radical HR 1 is reprehensible.\nhttps://t.co/Rr3gBUsJDU","date":"Mon Apr 05 17:12:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today on #GoldStarSpousesDay, we honor the husbands and wives of our fallen heroes.\n\nIn the face of unimaginable heartbreak, these family members remain strong and courageous.\n\nWe must never forget the ultimate sacrifice their loved ones made for our nation. https://t.co/QlsKpUtCs5","date":"Mon Apr 05 16:25:06 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"💉 Don't forget - @AlabamaNG is setting up mobile COVID-19 vaccination sites in rural counties across Alabama.\n\nFor more information: https://t.co/jqr4k98FEi\n\nFind #AL02's dates and locations for this week below ⬇️ https://t.co/DDt7gPaeZP","date":"Mon Apr 05 13:11:32 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wishing you and your family a blessed Easter. https://t.co/mfFCPblvcI","date":"Sun Apr 04 17:00:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy Easter - He is Risen!\n\n\"He is not here: for He is risen, as He said.\" -Matthew 28:6 KJV https://t.co/CwyI6YBVFl","date":"Sun Apr 04 14:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Heartbroken by the news that one of the U.S. Capitol Police officers succumbed to his injuries today. Heather and I are praying for his family during this difficult time.","date":"Fri Apr 02 18:50:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Praying for everyone’s safety at the Capitol. God bless @CapitolPolice for their bravery and service.","date":"Fri Apr 02 18:05:43 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"It is finished. Wishing everyone a blessed Good Friday!\n\n\"For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\" -John 3:16 KJV https://t.co/byZweIYp1n","date":"Fri Apr 02 14:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"“Make no mistake: This is an attempt at a Blue Coup that favors Democrats.”\n\nThe TRUTH about HR 1 ⬇️ https://t.co/lqbBAxIiNA","date":"Thu Apr 01 23:19:40 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Build Back Better?\n\nMore like Build Government Back Bigger.\n\nAfter spending nearly $2T on COVID \"relief\" - Biden now hopes to drop another $2.3T on \"infrastructure.\" https://t.co/jbMOyhXY8c","date":"Thu Apr 01 18:13:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 BREAKING NEWS 🚨\n \nLiberals are finally on board with voter ID!\n \nApril Fools.\n \nOh, but they do support a mandatory vaccine passport for you to return to normalcy.","date":"Thu Apr 01 14:18:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Nice try, @SpeakerPelosi - but @RepMMM is here to stay.\n\nGreat day for #IA02 and our democracy!","date":"Wed Mar 31 20:50:31 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"First, Big Tech began silencing conservative voices.\n\nThen, they permanently banned Donald Trump.\n\nNow, they’re blocking @LaraLeaTrump from sharing content \"in the voice of Donald Trump.\"\n\nAm I next? Are you? Where does it end?https://t.co/ZpWA8WgttP","date":"Wed Mar 31 19:50:42 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Special thanks to @alasecofstate, @RepMoBrooks, @USRepGaryPalmer &amp; @RepJerryCarl for joining our efforts to call out this partisan power grab.","date":"Wed Mar 31 14:55:46 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"This is the People's House - not Pelosi's.\n\nThis week, I sent a letter to @SpeakerPelosi regarding her attempts to silence #IA02 voters by replacing the rightfully elected @RepMMM in order to expand Democrats' razor-thin majority.\n\nRead the letter here➡️https://t.co/x4Ss0IvSWH https://t.co/tESgqcvcbz","date":"Wed Mar 31 14:52:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Illegal immigrants don't need a passport to cross our southern border - but Biden wants Americans to have one to leave their homes.\n\nThink about that.","date":"Wed Mar 31 14:02:13 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden downplays it.\n\nVice President Harris laughs at it.\n\nThe press is blocked from accessing it.\n\nThis is the reality of the #BidenBorderCrisis. https://t.co/AxtNZ2TwYM","date":"Tue Mar 30 16:14:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Using this logic, following the science is good enough for migrant children - but not American students.\n\nShameful.","date":"Tue Mar 30 14:47:38 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Alabama is home to many music legends - including Hank Williams, who brought us hits like “Lovesick Blues”.\n\nToday, we toured the Hank Williams Boyhood Home and Museum in Georgiana. Special thanks to Mayor Betterton and the City Council for a fun and informative afternoon! https://t.co/5O0bf7OvfT","date":"Mon Mar 29 22:33:24 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Stopped by Bates House of Turkey for lunch this afternoon!\n\nEnjoyed meeting with the owner, Rebecca Bates Sloane. We discussed small businesses’ perseverance - especially during COVID. Great to see Alabamians continue to come back stronger than ever. https://t.co/UM2Srhs3uA","date":"Mon Mar 29 21:21:47 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"What a special surprise. Congrats, Sawyer!\n\nGod bless you and your family.\nhttps://t.co/n88S5kZUAt","date":"Mon Mar 29 20:25:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Biden's rhetoric + actions =\n\nPublic health crisis.\n\nHumanitarian crisis.\n\nNational security crisis.\n\nWe MUST secure the border.","date":"Mon Mar 29 18:55:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Today on National Vietnam War Veterans Day, we honor the brave men and women who served our nation.\n\nPlease join me in thanking these American heroes for their service and sacrifice. 🇺🇸 https://t.co/xAkcWWQYr6","date":"Mon Mar 29 15:33:34 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed the 60th Annual Rattlesnake Rodeo in Opp this weekend! 🐍\n\nBig turnout, awesome music from the Oak Ridge Boys, and delicious food from local vendors. We had a blast! https://t.co/9Gknj7JcZn","date":"Mon Mar 29 13:39:46 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Have a blessed Palm Sunday! \n\n\"Hosanna to the Son of David. Blessed is he that cometh in the name of the Lord. Hosanna in the highest.\" - Matthew 21:9, KJV https://t.co/tTzJhY623s","date":"Sun Mar 28 15:00:01 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday, I had the incredible opportunity to meet with several men and women of the @AlabamaNG. \n\nAs a former member myself, visits like this one have a special place in my heart. Thank you for your dedication to our great state and nation.\n\n🇺🇸🇺🇸🇺🇸 https://t.co/qPFoqeLIs3","date":"Sat Mar 27 19:13:59 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The Moore You Know, the better.\n\nSign up for our newsletter for regular updates on all things AL ➡️ DC.\n\nVisit https://t.co/YNKycd1Q2b to subscribe. https://t.co/AYaOuOenMh","date":"Sat Mar 27 16:30:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Wishing everyone a happy and blessed #Passover! https://t.co/bePBYYsSXj","date":"Sat Mar 27 14:00:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"@alcacountry No ma’am. These events are open to all of my constituents. Please check out my Facebook page or my website’s events calendar for  updates: https://t.co/MsQoFcthGY","date":"Fri Mar 26 21:36:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Had the privilege of meeting with the great team at the Central Alabama Veterans Health Care System to discuss how we can best serve our heroes. I look forward to working with them to help get our Veterans the assistance and support they need. https://t.co/siUl0g0grf","date":"Fri Mar 26 20:44:00 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great turnout for the first of many Burgers with Barry. I thoroughly enjoyed getting to meet with my constituents and hear their concerns about what’s happening in Washington. https://t.co/eoXnn9gyxn","date":"Fri Mar 26 20:00:34 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday, I had the privilege of meeting with a great group of citizens and community leaders in Luverne. Wonderful company and conversation.\n\nThanks for having me! https://t.co/iLGAjpCvbH","date":"Fri Mar 26 19:53:05 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"@SunnySouthAL @RepMoBrooks @ALGOP @replouiegohmert Thanks, Bob! One of the nicest things anyone’s ever said about me. Proud to be compared to a great patriot like @replouiegohmert  🇺🇸🇺🇸🇺🇸","date":"Fri Mar 26 18:36:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last month, 100,441 illegal immigrants entered the southern border. To put that alarming number in perspective, that’s more than the population of Dothan, Wetumpka and Andalusia combined...\n\nKeep reading my latest \"The Moore You Know\" column below ⤵️ https://t.co/r8ISz6x660","date":"Fri Mar 26 17:45:24 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"My Andalusia office is officially open and ready to serve #AL02. We had a great turnout, and I appreciated getting to connect with my constituents and our local city officials. https://t.co/F1kIvUq7fp","date":"Fri Mar 26 15:27:26 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Absolutely heartbreaking.\n\nPraying for the victims' loved ones and all Alabamians impacted by the destructive storms. https://t.co/dyzqLzPdPu","date":"Fri Mar 26 13:59:57 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"⚠️ Alabama is expected to face more severe weather today. Stay safe and informed on local conditions.\n\nLive updates ⬇️ https://t.co/XhzHNRMU4n","date":"Thu Mar 25 18:36:47 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"No one is buying the Biden administration's 'blame Trump' narrative - including Mexico's president.\n\nEnough gaslighting. \n\nAmerica needs leadership - not empty excuses.  https://t.co/uitsZZUbkk","date":"Thu Mar 25 15:48:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great catching up with Robert Boothe on WOPP AM 1290’s the Morning Show. Thanks for having me on! https://t.co/sBIt6dpuPv","date":"Thu Mar 25 13:51:48 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On #NationalMedalofHonorDay, we commemorate American heroes who have earned our nation's highest medal of valor.\n\nThank you for your bravery &amp; service. 🇺🇸 https://t.co/WVEwGTUGEM","date":"Thu Mar 25 13:34:18 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Incredible work being done at Fort Rucker to protect our nation &amp; uphold our Constitution.\n\nIt was an honor to visit &amp; learn more about Army aviation training. I’m so grateful for the patriots there who serve our country with true sacrifice and humility.\n\n🇺🇸🇺🇸🇺🇸 https://t.co/u1DJi1z8OZ","date":"Wed Mar 24 21:52:25 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"My prayers are with all those impacted by the senseless violence in Atlanta &amp; Boulder.\n\nIt's important to remember that it's never really about the weapon they use - it's about the heart of the man that uses it.\n\nWe cannot use these tragedies to punish law-abiding gun owners.","date":"Wed Mar 24 16:10:09 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enjoyed visiting with Ricky Brown of Brown Manufacturing in Ozark this morning. His parents started the company 76 years ago &amp; he now runs it with his two daughters.\n\nI’m grateful for family-owned businesses like this one - they are the lifeblood of the American economy. https://t.co/Cjl99nCt2D","date":"Wed Mar 24 15:39:54 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"☕️🍳🥞 We held our inaugural #BreakfastWithBarry town hall in Ozark this morning at Our Place Diner. \n\nGreat people with real concerns and questions about the trajectory of our nation. It’s an honor to represent them! https://t.co/zk7LtyVynD","date":"Wed Mar 24 14:27:49 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Excellent questions this evening from farmers in our district. My thanks to ALFA for hosting me and my team tonight, and to the hardworking farming families who keep America fed and clothed. \n\nThis was the best way to finish up #NationalAgDay! https://t.co/cyY75thB7A","date":"Wed Mar 24 00:31:50 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great meeting today at the Alabama College of Osteopathic Medicine in Dothan. Learned more about their philosophy of practicing medicine and how it impacts students, patients and the community. \n\nVery impressive facility and staff! https://t.co/wnLqkt7CMF","date":"Tue Mar 23 19:26:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The votes in #IA02 were counted, recounted, and certified.\n\nYet @SpeakerPelosi is shamelessly attempting to steal @RepMMM’s seat.\n\nProud to join my colleagues in calling this out for what it truly is ➡️ a dangerous power grab aimed to expand their razor-thin majority.","date":"Tue Mar 23 17:19:16 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"VP Harris responding to immigration crises -\n\nUnder the Trump admin: outrage\n\nUnder the Biden admin: laughter\n\nDisingenuous, distasteful, and disappointing.\n\n#BidenBorderCrisis","date":"Tue Mar 23 16:12:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"💉 Starting today, the @AlabamaNG will set up mobile COVID-19 vaccination sites in rural counties across Alabama.\n\nFor more information: https://t.co/DtBhWR4lP8\n\nFind #AL02's dates and locations below ⬇️ https://t.co/qESYSbn2vH","date":"Tue Mar 23 15:23:52 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy #NationalAgDay to all of our hardworking farmers who work tirelessly to feed and fuel our world.\n\nThank you, #AL02 farmers! https://t.co/woGkiouzEv","date":"Tue Mar 23 14:34:07 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"‘I Care a Lot’ exposes a terrible reality for far too many Americans like @bashinsky. It’s time we #FreeBritney and countless other Americans wrongfully subjected to predatory conservatorships.\n\nhttps://t.co/Kt4uCnLCMG","date":"Tue Mar 23 02:09:21 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Great to be back in Alabama!\n \nWe spent a productive day meeting with Mayor Gillespie, Prattville Chamber of Commerce, Central Alabama Electric Cooperative, and Mayor Kelley. It's always an honor to work with community companies and leaders to find ways we can best serve #AL02. https://t.co/3VY7T8DqZ6","date":"Mon Mar 22 20:17:45 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Special thanks to @RepBost, @RepNancyMace, @RepMann, &amp; @RepCawthorn for joining our efforts.","date":"Mon Mar 22 17:02:29 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Last week, I introduced my 1st piece of legislation, which would expand the number of National Guard members eligible for GI Bill benefits.\n\nWe must remove bureaucratic hurdles to ensure these heroes receive the vital benefits they deserve. 🇺🇸 https://t.co/WTM2vsFcig","date":"Mon Mar 22 16:58:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Are you finally ready to call this a crisis, @POTUS? https://t.co/7xMpQWeEmA","date":"Mon Mar 22 13:51:34 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"On #WorldDownSyndromeDay, we celebrate the lives of millions of individuals born with Down Syndrome by wearing #LotsOfSocks.\n\nSuch a powerful reminder that every life is precious. https://t.co/dUCwiKJFpM","date":"Sun Mar 21 22:08:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"First, they created chaos at the southern border.\n\nNow, they’re blocking the press from covering it.\n\nWhat is Biden hiding?\n\n#BidenBorderCrisis https://t.co/FiGWabvp2q","date":"Sat Mar 20 19:44:03 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Yesterday, I introduced my 1st piece of legislation, which would ensure all members of the National Guard serving under federal active-duty orders are eligible for Post 9/11 GI Bill benefits.\n\nFull statement ⤵️ https://t.co/6adhKmegeO","date":"Fri Mar 19 17:01:28 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Democrats' answer to the #BidenBorderCrisis = amnesty for MILLIONS of illegal immigrants.\n\nWe need real solutions to secure our southern border - not liberal legislation that only exacerbates the chaos.","date":"Thu Mar 18 18:12:37 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"President Biden might shy away from confronting the crisis he created - but the @freedomcaucus isn't.\n\nWe must secure our southern border and fight for immigration policies that put Americans FIRST.\n\n#BidenBorderCrisis https://t.co/eH4ZiI9poy","date":"Thu Mar 18 15:47:31 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 Important update for #AL02 tax filers: The deadline to file your federal income taxes is now May 17. State tax filings are still due April 15. https://t.co/B9iqXvKRRt","date":"Thu Mar 18 14:07:35 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Instead of joining Republicans to pass a clean reauthorization of the Violence Against Women Act, Democrats continued pushing their radical agenda.\n\nFull statement on H.R. 1620 ⬇️ https://t.co/dNcuJ41Dbb","date":"Wed Mar 17 21:22:15 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"The public health, humanitarian, and national security crisis at the southern border is on President Biden's hands.\n\n#BidenBorderCrisis https://t.co/9GpR2Fj4SI","date":"Wed Mar 17 20:52:04 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"⚠️ Severe weather is expected across the state throughout the afternoon and into the night.\n\nPraying for Alabama. Please stay safe!","date":"Wed Mar 17 19:49:27 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Happy #StPatricksDay, y'all! https://t.co/OpNMdnF6Nk","date":"Wed Mar 17 13:26:41 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Border security IS national security.","date":"Tue Mar 16 20:56:22 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Ridiculous.\n\nPresident Biden should be down at the southern border to witness the chaos he created. #BidenBorderCrisis","date":"Tue Mar 16 19:14:51 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Numbers don't lie, Mr. President.\n\n#BidenBorderCrisis https://t.co/gcvLlSeBNk","date":"Tue Mar 16 17:03:24 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Here comes the invoice for President Biden's $1.9 trillion COVID \"relief\" package... https://t.co/aMKMotSBFJ","date":"Tue Mar 16 14:37:53 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"🚨 Important AL vaccine update: \n\nOn March 22, @ALPublicHealth will extend eligibility for COVID-19 vaccinations to include: individuals 55+, additional frontline workers, &amp; residents with certain chronic health conditions.\nhttps://t.co/RglfFjjeOU","date":"Mon Mar 15 20:32:56 +0000 2021","user_id":"1339006078688825344"},{"handle":"RepBarryMoore","text":"Enough of the gaslighting.\n\nBiden didn't inherit this crisis - he created it.\n\n#BidenBorderCrisis https://t.co/EfSVDMbOAl","date":"Mon Mar 15 18:34:41 +0000 2021","user_id":"1339006078688825344"}]