[{"handle":"RepBlakeMoore","text":"Pro-life centers have been vandalized in attempts to intimidate those who stand for life. I joined my colleagues in sending a letter urging the DOJ to investigate these attacks &amp; provide info on how they will address these instances of domestic terrorism. \nhttps://t.co/Q7UH1gTQQp","date":"Fri Jun 17 15:46:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"UT’s agricultural sector has struggled for too long, and it’s past time for Congress to reduce input costs and provide relief to the farmers who feed our communities. I’m proud to cosponsor this bill, which will cut red tape, streamline regulations, and address inflation. #utpol","date":"Thu Jun 16 22:07:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am honored to be named a 2022 Fiscal Hero by @BudgetHawks. How we address our nation's economic crisis has been one of my top priorities during my first term. I will continue to seek solutions, both short and long term, for the sake of our next generation. #utpol","date":"Thu Jun 16 16:42:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Learn more about my Debt and Deficit Task Force here:\n\nhttps://t.co/jpDJyfI9Z6","date":"Thu Jun 16 01:36:03 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I made a commitment to bring Utah’s fiscally sound values to Washington, and I am grateful to colleagues like @RepArrington for recognizing the work my team and I have done to address our economic crisis and convene a Debt and Deficit Task Force in Ogden. #utpol https://t.co/gBKtZZ8pZR","date":"Thu Jun 16 01:36:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined @RepArrington for a Special Order on the House floor to speak about our current economic crisis, which is our nation's most pressing issue today. The Biden Admin's blatant economic mismanagement has put us on a path toward recession. #utpol \nhttps://t.co/6smZfA9soT","date":"Tue Jun 14 21:59:36 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Grocery &amp; gas prices continue to skyrocket, &amp; Utahns are hurting. Due to inflation, the average household pays an additional $460/month for the same goods and services they purchased just last year. We must change course for the sake of the next generation's financial outlook.","date":"Tue Jun 14 21:59:36 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Watch my floor speech from 16 months ago (February 2021) calling on the Biden Administration to approve domestic oil and gas leases here. #utpol \n\nhttps://t.co/hKQPvxE8vh","date":"Mon Jun 13 18:02:11 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The national average for a gallon of gas is now over $5, and economists are projecting it will hit $6 by August. This crisis was avoidable, and I have been articulating the dangers of President Biden's anti-domestic energy agenda since my first weeks in office. #utpol (1/3)","date":"Mon Jun 13 18:02:11 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Granting our pending oil and gas leases and unleashing US energy sources would have prevented these record high gas prices that are directly hurting every Utahn. We must bolster our domestic energy production so we can relieve this major cost burden on hardworking families.","date":"Mon Jun 13 18:02:11 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I urge @NatResources to pass my bill requiring energy leases to be completed in 30 days. That is the first step to alleviate this record inflation. #utpol","date":"Sat Jun 11 13:39:13 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We cannot go on like this. Hardworking families are suffering as inflation hits a 40-year high with no end in sight. The American people deserve better.","date":"Sat Jun 11 13:39:12 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/3gCV4zk0f9","date":"Fri Jun 10 19:18:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Jane &amp; I were deeply saddened to hear of Taylor Connors’s passing. A native of Pleasant View, he exemplified the best of UT at the UT Military Academy, as a Marine Corps Infantryman, &amp; then as a Midshipman at the Naval Academy with selfless service, duty &amp; honor. #utpol","date":"Fri Jun 10 19:18:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was great to meet with @ALPAPilots representatives, including two @Delta pilots from the First District, Jennifer Fiederer and Bart Wilbanks. We discussed reforms to our air travel systems that would better keep passengers and pilots safe. Thank you for your hard work! #utpol https://t.co/tuCBF47YFT","date":"Thu Jun 09 22:14:18 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am participating NOW in a radio telephone town hall with @KVNUftp to give an update from Washington and talk about the issues that matter most to Utahns. Tune in! #utpol","date":"Wed Jun 08 23:15:46 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congratulations to Greg Poulsen on his appointment to the Medicare Payment Advisory Commission! Greg is a valuable member of my Debt and Deficit Task Force, and I know he will bring his strong expertise and Utah’s values to the table. #utpol\n\nhttps://t.co/IPIQxnmV5s","date":"Wed Jun 08 19:58:19 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m grateful for all they are doing to keep our communities safe. #utpol","date":"Fri Jun 03 19:55:38 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was an honor to join @GovCox at the Utah Peace Officers Association awards banquet, where I delivered the keynote address. In a time of increased scrutiny and criticism, UPOA’s role has never been more important for the support of law enforcement officers. https://t.co/QHBzenXLmv","date":"Fri Jun 03 19:55:37 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Due to drought, hundreds of acres of dry farmland will not produce wheat this year, leading to a decrease in healthy livestock. \n\nWhile there is no simple answer for the challenges we face, I am committed to finding productive, long-term solutions for our state’s drought issues.","date":"Thu Jun 02 16:58:41 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week, I had the opportunity to visit Corinne, Park Valley, Snowville, and Howell on a tour of northern Box Elder County. At each stop, I met with local ranchers to discuss how the industry is impacted by current agricultural policies and water scarcity. #utpol https://t.co/rOLeGUKbFM","date":"Thu Jun 02 16:58:40 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for hosting me, Intuitech! #utpol","date":"Wed Jun 01 20:08:16 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week, I toured Intuitech with CEO Brock Emerson and learned about their pilot water treatment plants, how water treatment needs vary by city, the effects of pollution and droughts on water treatment efforts, and the impact supply chain disruptions are having on the company. https://t.co/m1pjtRPjY4","date":"Wed Jun 01 20:08:15 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was so special to send off veterans on their Honor Flight from the SLC airport this morning. They deserve every bit of recognition and celebration. Thank you for your service! #utpol https://t.co/WodSBGuEWy","date":"Tue May 31 14:35:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This weekend was uniquely special because I connected w/ family members of Medal of Honor recipients George E Wahlen &amp; Bernard Francis Fisher. These heroes left a lasting legacy, &amp; I’m thrilled there will soon be a monument to honor them, their families, &amp; the lives they saved. https://t.co/g9MIY1kGVS","date":"Mon May 30 23:01:17 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Tomorrow I will greet veterans as they depart on an Honor Flight to celebrate their service to our nation. Utah appreciates and celebrates our veterans, and we are thankful to show our appreciation for their sacrifices. #utpol","date":"Mon May 30 22:56:44 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My message this Memorial Day has been about gratitude. I was grateful to participate in events honoring veterans this weekend. My sons &amp; I were fortunate in meeting a 98-year-old WW2 veteran in Ogden, &amp; I got to share the stage w/ Vietnam POW Colonel Jay Hess in Kaysville. https://t.co/NLwt8JbZjg","date":"Mon May 30 22:56:43 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I cleared my schedule to walk my boys to school this morning. As a dad, that was the best I could do today. I don’t yet know how to talk to them about what happened yesterday in Uvalde. (1/3) #utpol","date":"Wed May 25 15:14:38 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Our nation is mourning and our communities are struggling. I want my constituents to know that I am someone who seeks unity, not division; avoids divisive rhetoric; and focuses on creating the type of world we want for our kids. (2/3) #utpol","date":"Wed May 25 15:14:38 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Jane and I are heartbroken by this tragedy. Our hearts go out to each impacted family and pray they find peace. (3/3) #utpol","date":"Wed May 25 15:14:38 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"With all that's at stake, we cannot compromise our efforts towards energy independence or exacerbate the financial crisis of American families across the nation. #utpol","date":"Tue May 24 21:14:39 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week, I joined 50 of my colleagues to urge the @USTreasury against implementing a windfall profits tax on American oil and gas producers.","date":"Tue May 24 21:14:39 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday I visited @MatiaRobotics, a team of expert engineers dedicated to creating innovative robotic mobility products. They design technology that enhance the lives of individuals with walking disabilities so they have more housing options and mobility independence. https://t.co/idAXrHkbdH","date":"Tue May 24 20:36:47 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Companies like Matia are changing people's lives, and it was a privilege to learn about their impactful work. #utpol","date":"Tue May 24 20:36:47 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My visit to the Catalyst Center in Kaysville made me excited about the great educational opportunities my boys will have when they reach high school. The dynamic skills-based training they offer their students is exceptional and exactly what our education system needs. #utpol https://t.co/clipmZ6qEG","date":"Tue May 24 20:17:26 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today we recognize #ArmedForcesDay and the Americans who devote their lives to defending our freedom. We are grateful for your service! #utpol https://t.co/YX5Y7uqYt0","date":"Sat May 21 23:28:45 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"One of the biggest flops, or unforced errors, we've seen from the Biden Admin was to even propose this nonsensical \"disinformation governance board\" that even many Dems found ridiculous. I signed a letter to @DHSgov weeks ago raising ethical concerns.\n\nhttps://t.co/a605sX3BmV","date":"Fri May 20 15:56:48 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"While I'm relieved to see it paused, it is still incredibly worrisome that a communist-style \"Ministry of Truth\" was even considered by this administration. #utpol","date":"Fri May 20 15:56:48 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I introduced the Protecting American Energy Act, which will ensure domestic energy production can continue w/o political interference &amp; hold the admin accountable as we seek to understand their unwillingness to work w/ domestic energy producers on solutions to our energy crises.","date":"Thu May 19 20:34:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"If the Biden Administration is so sure unleashing domestic energy production would not solve our skyrocketing gas prices and national security concerns, Americans deserve to know why. #utpol \n\nRead more about the Protecting American Energy Act here:\nhttps://t.co/KhcHt8sk5P","date":"Thu May 19 20:34:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Link to admendments here:\n\nhttps://t.co/QHQ8Pnq6oA","date":"Wed May 18 15:20:41 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Two of my amendments that would lower gas prices for Utahns and bolster domestic energy production were blocked by Democrats today. \n\nOur crippling energy prices are directly hurting Utahns, and we need action now. #utpol","date":"Wed May 18 00:35:37 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Our debt crisis is one of the most pressing crises our nation faces. I was grateful to speak to @housebudgetGOP about my Debt &amp; Deficit Task Force, which aims to create solutions to our economic challenges, including focusing America’s spending &amp; fixing our budgeting process.","date":"Tue May 17 21:16:47 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was inspired by @WinsomeSears’s successful election for Virginia Lt. Gov, becoming the first Black woman elected to statewide office in VA. I enjoyed her remarks at our Whip Team meeting. She’s a strong voice for conservatism, and I look forward to watching her succeed. #utpol https://t.co/z1eCVHeh0Q","date":"Tue May 17 18:27:40 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week we held a productive hearing, and I am pushing my Democrat colleagues to focus on provisions that will enhance our competitive advantage and strengthen American technology, manufacturing, and more. #utpol","date":"Tue May 17 13:46:37 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am honored to serve as the House Republican Conferee from @HASCRepublicans to the conference negotiating a bill between the House and Senate to bolster our competitiveness with China. #utpol https://t.co/dVUXf92LbT","date":"Tue May 17 13:46:37 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The 1,200+ reservists in the 419th, men and women living and working in Utah but who remain committed to the mission, are indispensable to our nation’s armed services. Thank you for letting me join and be a part of your training weekend! #utpol","date":"Sun May 15 12:37:26 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday, George and I got to welcome the 466th Fighter Squadron of the 419th Fighter Wing home from their training deployment, and I received a mission brief from the unit that just returned from Europe supporting the NATO mission. #utpol https://t.co/hm8V1hLsMA","date":"Sun May 15 12:37:25 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The U.S. produces the cleanest energy in the world, so there is no reason to do this. We need to unleash our domestic energy supply now so we can relieve this major financial burden on hardworking Americans. #utpol","date":"Sat May 14 14:35:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"U.S. natural gas prices are the highest they’ve been in over 13 years, yet the Biden Administration continues to restrict domestic access to oil, failing to ease costs on American families. #utpol \n\nhttps://t.co/l3Y9RnZCJJ","date":"Sat May 14 14:35:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/ALi4opAEMa","date":"Fri May 13 15:20:54 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I will continue to push for answers and help families in Utah and across the country get the resources they need. #utpol (3/3)\n\nYou can view my remarks on this issue here:\nhttps://t.co/HrQQCsuHLp","date":"Fri May 13 15:20:54 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My wife and I have a 6-month-old son, Franklin, who is dependent on formula. He was born a month early and had to undergo a rare and invasive surgery to separate his esophagus and trachea. A shortage is tough for us, but far worse for many Americans. #utpol (2/3)","date":"Fri May 13 15:20:54 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This baby formula shortage we are currently facing is a major crisis for many American families with infants.\n\nI signed a letter to the Biden Administration and FDA requesting information on this shortage and what they are doing to address this crisis. #utpol (1/3) https://t.co/EQj43tKucf","date":"Fri May 13 15:20:53 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This morning I joined @GOPLeader for the Back the Blue Bike Tour to honor the sacrifices of our nation’s fallen law enforcement officers. During this #NationalPoliceWeek, &amp; every day of the year, we recognize &amp; thank the men and women who keep our communities safe. #BacktheBlue https://t.co/tGGlULzLDt","date":"Thu May 12 20:27:59 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congratulations to Aliahu K. Bey &amp; @haightbey of West Haven for winning the Small Business Prime Contractor of the Year award! Small businesses play an essential role in Utah’s economy, and I appreciate the work SBA does to highlight entrepreneurs #utpol \nhttps://t.co/iGo9vJBAVs","date":"Wed May 11 22:28:31 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"153 years ago, the 1st transcontinental road was completed in Promontory Summit, Utah. We had a great time at the Golden Spike Family Days learning about the Golden Spike Ceremony &amp; how this railroad’s completion marked a critical turning point in our nation’s history. #utpol https://t.co/EpQEvCVtma","date":"Tue May 10 18:50:04 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was so grateful Matt Gwynn invited me to be the keynote speaker for Friday’s @RoyCityPD Banquet. These men &amp; women are amazing and dedicated public servants to their community, &amp; I applaud them for their impactful work. It was a fun &amp; casual evening with plenty of good banter. https://t.co/FkAHzoZgGK","date":"Mon May 09 21:40:25 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"For Winnie to thrive in traditional kindergarten took an extra dose of TLC, and Jane and I are so grateful to these teachers. Happy belated Teacher Appreciation Week to all of Utah’s amazing school teachers! #utpol","date":"Mon May 09 15:12:10 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week was Teacher Appreciation Week, and along with meeting Utah’s Teacher of the Year, my boys’ teachers deserve recognition. In addition to Max’s amazing 3rd grade teacher Mrs. Leys, George and Winston’s kindergarten teachers Mr. Holt and Mrs. Lee are true heroes. #utpol https://t.co/ljchmR03kR","date":"Mon May 09 15:12:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I always look forward to meeting w/ local chambers of commerce. I enjoyed talking to the @DavisChamberUT’s legislative affairs committee last week abt what my team is accomplishing for the 1st District &amp; issues including supply chain disruptions, water supply, &amp; inflation. #utpol https://t.co/jJv8RapDzJ","date":"Mon May 09 14:46:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"An extra special year for our family. Happy Mother’s Day to Jane and a sincere thanks for working double time for our boys!  #utpol https://t.co/8iE32vAvRy","date":"Mon May 09 01:16:37 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I will always look up to Sen. Hatch and wish his family the best during this time. #utpol","date":"Sat May 07 00:51:43 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was an honor to attend the late Sen. Orrin Hatch’s funeral today. Hearing stories about his accomplished life and meeting his family made for a great afternoon. I especially loved hearing President Oaks’s comments about him being an effective legislator. #utpol","date":"Sat May 07 00:51:43 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read more about the Better Cybercrime Metrics Act here:\nhttps://t.co/sYf6pnLMzh","date":"Fri May 06 17:02:50 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday @POTUS signed my Better Cybercrime Metrics Act into law! Cybercrime is one of the top threats facing Americans. It's imperative that we equip the gov to understand &amp; address the challenges of cybercrime so we can improve our national cybersecurity infrastructure. #utpol","date":"Fri May 06 17:02:50 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As we work to reshore our manufacturing, strengthen our supply chains, and prioritize national security, we are confronted by the immediate need to rebuild and bolster our entire microelectronics ecosystem. This bill will help us do just that. #utpol","date":"Fri May 06 16:28:18 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today I introduced the Supporting American Printed Circuit Boards Act with @RepAnnaEshoo in order to fuel the resurgence of American manufacturing through incentivizing the purchase and production of domestically-sourced printed circuit boards. #utpol \n\nhttps://t.co/2inDiWuIFY","date":"Fri May 06 16:28:18 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I stopped by the @HAFB Fire Station this week to view the progress on the new west interchange and gate. I also met with 388th &amp; 419th Fighter Wings leadership to receive updates on F-35 operations and the “Sentinel” Ground Based Strategic Deterrent. Thanks for having me, HAFB! https://t.co/XEQZl1K9tm","date":"Thu May 05 21:32:13 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for having me on, @kslnewsradio! #utpol \n\nhttps://t.co/7ltVS9Mc7A","date":"Thu May 05 16:18:41 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Protecting life is among my greatest responsibilities in Congress. If a variation of this draft opinion ends up becoming SCOTUS’s final ruling, as I pray it does, it'll be a major step forward in restoring the authority of the people’s representatives to regulate abortion. #utpol","date":"Tue May 03 18:29:57 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was disheartened that Democrats in Congress voted for abortion on demand up until birth, and I believe our country can and must do far better for the most vulnerable members of our society. #utpol\n\nhttps://t.co/PN7hZ3zJCQ","date":"Tue May 03 18:29:57 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It doesn't get much better than touring the White House with @JStuartAdams as my MAPLand Act was signed into law on the other side of the building! \nThank you to President Adams and grandson, Hunter, for sharing this special moment. #utpol https://t.co/BlHj2zGtEz","date":"Fri Apr 29 21:48:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today @POTUS signed the MAPLand Act into law! This is a major win for all who enjoy our public lands. I look forward to the many ways this bill will improve our access to public land records so we can better hunt, fish, hike, &amp; more. #utpol","date":"Fri Apr 29 20:40:50 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks to all who helped get this across the finish line! Read more about the MAPLand Act here:\n\nhttps://t.co/rTT8jbqmgw","date":"Fri Apr 29 20:40:50 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The LODGE Act will do just that by providing the @natlparkservice w/ the tools to staff &amp; manage these lands by improving access to housing &amp; addressing recruiting &amp; retention challenges, thus enhancing the overall experience for all who work in &amp; enjoy our national parks. #utpol","date":"Thu Apr 28 20:27:04 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Utah is known for our incredible national parks that attract millions of visitors each year. As visitation levels continue to skyrocket, we must pursue creative solutions to add efficiency to our system, lower costs, and serve the needs of our communities. #utpol","date":"Thu Apr 28 20:27:03 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I just introduced the bipartisan LODGE Act w/ my friend @RepJimmyPanetta. This bill will foster innovative public-private partnerships to increase the availability of housing in and around our nation’s parks. #utpol \n\nhttps://t.co/kwdY7OhHUe","date":"Thu Apr 28 20:27:03 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Some evenings in Congress are more special than others. It was an honor to attend the Washington DC Temple Open House hosted by @ChristoffDTodd. Thanks to my colleagues and their spouses for joining. https://t.co/KWYzYTVrDl","date":"Thu Apr 28 15:30:15 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for having me on!","date":"Tue Apr 26 23:03:12 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I visited TX today w/ @GOPLeader to learn more about the crisis at our southern border &amp; the devastating impact it’s having on our communities’ safety. @POTUS’s decision to reverse Title 42 will exacerbate the overwhelming challenges our @CBP officers are already facing. #utpol","date":"Mon Apr 25 22:09:56 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/eil0Fut2v4","date":"Mon Apr 25 22:09:56 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/k2ZgxyRW7K","date":"Sat Apr 23 15:26:03 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My Debt &amp; Deficit Task Force released our recommendations for how our nation can address our debt &amp; deficit crisis. I look forward to sharing these w/ my colleagues in DC as we push for reforms in our federal spending processes. #utpol \n\nRead more here:\n\nhttps://t.co/jpDJyfHC9y","date":"Sat Apr 23 15:26:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined UT’s elected representatives in voicing my objection over S&amp;P Global’s issuing of political ESG ratings for UT. Rather than focusing on the fundamentals of UT’s financial strength, @SPGlobalRatings is allowing political judgments to cloud objective financial assessments.","date":"Fri Apr 22 16:25:12 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am looking forward to speaking as a panelist at the @MaloufFdn Summit today. I admire their work to raise awareness and education on human trafficking and sexual exploitation in Utah. #utpol https://t.co/afqyawCtGd","date":"Fri Apr 22 12:30:48 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congratulations to @thermofisher on their brand new manufacturing facility in Ogden! This facility will help produce COVID therapeutics and vaccines, bring 400 new jobs to the Ogden area, and serve as a great economic boost to Utah. #utpol https://t.co/amA8QTdnlB","date":"Thu Apr 21 13:20:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I enjoyed attending the ribbon cutting ceremony and look forward to watching the @thermofisher team do great work here in the Beehive State. #utpol","date":"Thu Apr 21 13:20:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Beginning next week, the political blackout begins and my office can only communicate with those who have opted-in to hear from us. We'll send you one e-newsletter per week with updates, announcements, and in-depth explanations on recent votes and legislation. #utpol","date":"Wed Apr 20 15:52:06 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Fun fact: we have nearly 3x the number of newsletter subscribers than we do Twitter followers, proving that folks are looking for real, substantive updates. Be sure you are subscribed! #utpol \nhttps://t.co/3WPtYezKRi","date":"Wed Apr 20 15:52:05 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to visiting Eagle Pass, TX with @GOPLeader and my colleagues to learn more about the crisis at our southern border and the devastating impact it has on our communities. #utpol","date":"Wed Apr 20 14:10:25 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Huge congrats to @maggiem_sports of Fremont High for being awarded the High School Female Athlete of the year at the @StateofSport's awards dinner. She’s off to Nebraska to play volleyball and basketball. Go Huskers! And it’s weird to feel short in a picture. #utpol https://t.co/HWKyJOLOY8","date":"Tue Apr 19 21:15:56 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"And suddenly, my four flights next week are much more bearable thanks to the brave judge who removed the mask mandate. It's past time. #utpol \n\nhttps://t.co/2ACHB3rxZt","date":"Tue Apr 19 17:43:35 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I signed a letter in March urging the @TSA to end its mask mandate as COVID-19 infections have become more manageable and localities lift mandates. I am pleased to see this take effect. #utpol \n\nhttps://t.co/UbTD9s0hAZ","date":"Tue Apr 19 17:43:35 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"They created a pair of headphones designed by a young man with Autism, and we love them! Many thanks to all who support my son and the extraordinary people who navigate Autism. #utpol","date":"Mon Apr 18 22:32:07 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"April is World Autism Month. As I think about my own son Winnie, I’d like to recognize the many First District businesses and organizations who support the Autism community, including @Skullcandy. https://t.co/wHoUyx69cz","date":"Mon Apr 18 22:32:06 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"ICYMI: watch my interview with @WillHurd on his new book, American Reboot, on @BookTV here! #utpol \n\nhttps://t.co/2Ry0mlFI9p https://t.co/xzxZdRV4FJ","date":"Mon Apr 18 20:49:01 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"He is not here. He is risen! Happy Easter! I hope you all have a special day with loved ones. \n\nI don’t know the first thing about photography, but I captured my favorite photo ever a couple months ago while on my trip to Israel. #utpol https://t.co/43D3FHdFqz","date":"Sun Apr 17 19:57:05 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"And how can she brag that “no one has had to pay a penny of debt under Biden?” This administration’s approach to economic policy is a joke. (3/4)","date":"Sat Apr 16 22:09:32 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We need real solutions to reverse the skyrocketing tuition costs that are negatively affecting students. Utah’s universities and tech colleges are leading the charge on this by tailoring curricula to workforce needs and focusing on ROI. (4/4)","date":"Sat Apr 16 22:09:32 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Biden’s decisions have increased costs for working class families. What about the plumbers &amp; electricians who stayed out of debt &amp; worked their tails off to create careers w/o student loan debt? Do they get a check from Uncle Sam because they chose a different path? (2/4)","date":"Sat Apr 16 22:09:31 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"And the hits keep on coming. Amidst the worst inflation in 40 years, Psaki announces more executive action to potentially “cancel” student loan debt just to pander to voters. #utpol (1/4)\n\nhttps://t.co/5QvKV4q7MI","date":"Sat Apr 16 22:09:31 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Tune in to my @BookTV interview on Sunday with @WillHurd where we discuss his new book, American Reboot. He also gives a great shoutout to the best district in the country! 🏔#utpol","date":"Sat Apr 16 12:14:04 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thursday evening was a journal entry event at The Other Side Academy. This organization is having a profoundly positive impact on our community, &amp; the stories from the students are inspiring. I spoke on hard work, optimism, &amp; how our entire community is cheering them on! #utpol https://t.co/ej0dt5ghdH","date":"Fri Apr 15 14:53:53 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Stopped for a bagel sandwich at Old Grist Mill and ran into the entire student government of Box Elder High!  They convinced me they weren’t sluffing class 🤔 #utpol https://t.co/NC8MxX7bkh","date":"Thu Apr 14 20:32:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Their contemporary solutions to fill the gap in our budgets as they modernize the KC-135 Tanker are a prime example of why American servicemembers are the best in the world. #utpol","date":"Wed Apr 13 19:53:14 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I recently had the opportunity to highlight the innovative work being done by the 151st refueling wing out of Roland R. Wright Air National Guard Base in a @HASCRepublicans hearing with General Van Ovost from Transportation Command.\n\nhttps://t.co/tphdasNbhD","date":"Wed Apr 13 19:53:14 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We desperately need to rein in our federal spending levels so hardworking families can keep more money in their pockets. It doesn’t have to be this way. #utpol","date":"Tue Apr 12 20:15:13 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Data released today by @USDOL confirms what we’ve already known: inflation has hit historic levels and is directly hurting each and every American. #utpol \n\nhttps://t.co/kWNa8FlkrJ","date":"Tue Apr 12 20:15:13 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Without first establishing a plan to address the hundreds of thousands of people who will flow over the border in the upcoming months, our border crisis will further deteriorate, burdening already overwhelmed CBP officers and leaving our borders open to more bad actors. #utpol","date":"Tue Apr 12 15:43:23 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The Biden Admin is moving to end Title 42, one of our most effective tools against illegal immigration in the current political environment. We cannot afford to further weaken our border security, and Biden is terminating Title 42 without a plan in place to deal with the fallout.","date":"Tue Apr 12 15:43:22 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I used this opportunity for a productive exchange on how to help the F-35 joint strike fighter reach its full potential by ensuring these 5th generation jets are paired with equally modern and advanced weaponry. I will always advocate for the needs of our airmen at @HAFB","date":"Mon Apr 11 21:17:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I will always advocate for the needs of our airmen at Hill Air Force Base and will continue fighting for the 388th and 419th fighter wings to maintain their standing as the tip of the mighty Air Force spear. #utpol","date":"Mon Apr 11 21:17:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week the @HASCRepublicans hosted Secretary Lloyd Austin for a posture hearing on the Department of Defense’s budget request for Fiscal Year 2023. \nhttps://t.co/hdcb7zaB3d","date":"Mon Apr 11 21:17:01 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was honored to receive the Guardian of Seniors’ Rights Award from @60PlusAssoc. Many senior citizens are struggling to make ends meet, which is why I am committed to finding productive solutions to support our most vulnerable population. #utpol https://t.co/DxzKTGMnxj","date":"Mon Apr 11 17:42:49 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The Sentinel is not only the keystone of our nuclear triad and the future of American nuclear deterrence, but it is also the first major acquisition program based out of Hill Air Force Base, bringing 4,000 jobs to Northern Utah and the construction of 6 new buildings. #utpol","date":"Fri Apr 08 20:17:47 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I love the new GBSD name change. With a name like Sentinel, no one is going to mess with us! \nhttps://t.co/2rZJYekmjH","date":"Fri Apr 08 20:17:47 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/81NNBIo6F2","date":"Fri Apr 08 17:48:17 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It's far past time that Congress comes together on legislation that will counter China’s efforts to weaken our economy, stifle our innovation, &amp; compromise our security. I'm looking forward to working on solutions that will bolster US dominance on the global stage.","date":"Thu Apr 07 21:51:49 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Learn more here:\n\nhttps://t.co/O8I8v487oa","date":"Thu Apr 07 21:51:49 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today I was selected by @GOPLeader to serve as the House Republican Conferee from @HASCRepublicans to the Conference Committee to negotiate a compromise bill between the House and Senate to bolster U.S. research and technology and counter and compete with China. #utpol https://t.co/eS5sDwXJGX","date":"Thu Apr 07 21:51:48 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/eCPC69I4fk","date":"Thu Apr 07 19:47:55 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/gZXulWFHBv","date":"Thu Apr 07 19:44:05 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read more here:\nhttps://t.co/qVUEfqBTyr","date":"Thu Apr 07 02:36:04 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m thrilled my MAPLand Act passed the Senate and is on its way to @POTUS's desk. I thank my colleagues for their display of support for our efforts to modernize &amp; digitize critical public land records. I'm grateful we can deliver this major win for Utah and our nation at large.","date":"Thu Apr 07 02:36:04 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you for your support!","date":"Wed Apr 06 18:25:06 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to hearing from folks during my tele-town hall soon! Join us! #utpol","date":"Wed Apr 06 18:19:40 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today on #GoldStarSpousesDay, we honor spouses of those who paid the ultimate sacrifice to protect our freedoms. I think of my friend @mrsbrenttaylor, who is a Gold Star wife and has powerfully used her story to make an amazing impact on military families in our community. #utpol https://t.co/b8zT3TvodZ","date":"Tue Apr 05 22:24:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Many thanks to our scheduler, Tara Kay, for her amazing service to our office and the First District. We wish her the best of luck in the next step of her career! #utpol https://t.co/Fl3fDi3KeB","date":"Tue Apr 05 18:24:19 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I loved having two of my boys with me in DC last week. While most kids enjoy a week away from school, the Moore boys spent their Spring Break getting several lessons in civics! They loved it...mostly. #utpol https://t.co/cc2XiL9ory","date":"Tue Apr 05 16:32:23 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"and fails our service members. We must deliver an NDAA that prioritizes national security and keeps Americans safe. #utpol\n(2/2)","date":"Mon Apr 04 21:07:36 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"After last year’s bipartisan rebuke of the President's defense cuts, I had hoped this administration would readjust in response to Russia's war against Ukraine, an ever-aggressive China, or even inflation. Sadly, the President's FY23 budget is weak (1/2)\nhttps://t.co/rSMoQGXnFW","date":"Mon Apr 04 21:07:35 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/olAAKdan1m","date":"Mon Apr 04 15:06:23 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m deeply concerned about our national debt crisis, and I’ve convened a Debt and Deficit Task Force in Ogden to create a framework of solutions. \n\nJoin me and a special guest for a tele-town hall on April 6 at 1pm MT to talk about my vision for a better economic future. #utpol https://t.co/EfVZO9y3sX","date":"Mon Apr 04 15:06:23 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congrats to Lily Galbraith, from the legendary Galbraith family, for winning her Ogden High Student Body Officer election! I was able to give them a Capitol tour right before the results came in—but it opens up a wound when I suffered my SBO defeat in ’97…#thanksCritt 🙇🏼‍♂️ #utpol https://t.co/xnQ7KGMecC","date":"Sat Apr 02 21:40:46 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This bill would strengthen our energy security, bolster our economy, and counter Russian aggression in Ukraine by prioritizing domestic energy. Along with the bill I introduced to streamline the permitting process, this will move us away from relying on foreign adversaries.","date":"Thu Mar 31 20:40:08 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I spoke on the House floor today urging my colleagues to support H.R. 6858, the American Energy Independence from Russia Act. Today in Utah, gas is $4.30, causing each family to spend roughly $110 just to fill up their tank. This is unacceptable. #utpol https://t.co/AnbJAj7c8c","date":"Thu Mar 31 20:40:07 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/FFUiaH8PMJ","date":"Thu Mar 31 13:47:42 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/5f0WsvKrG9","date":"Thu Mar 31 13:43:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Great to host congressional interns from @USUAggies in my office last night for pizza! Go Aggies! #utpol https://t.co/PtXLKDlW07","date":"Wed Mar 30 20:19:20 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"There are over 4,600 permits to drill pending at @Interior. This bill will require timely issuance of permits that have completed environmental review &amp; hold the Biden Admin accountable for delays when we desperately need to lessen our dependence on foreign energy.","date":"Wed Mar 30 16:48:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am proud to introduce the Protecting Energy Independence and Transparency Act today to hold the Biden Administration accountable for their consequential delays in the domestic energy permitting and leasing process. #EndtheBidenBan\nhttps://t.co/UHT9OK3s3V","date":"Wed Mar 30 16:48:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As we watch the global instability in Eastern Europe &amp; experience pain at the pump, it's clear why we must unleash America’s energy production capabilities &amp; hold the Biden Admin’s feet to the fire so we can become energy independent &amp; keep more money in Americans’ pockets.","date":"Wed Mar 30 16:48:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I will always listen to the needs of my constituents and enhance their hard work in Utah with good policy in Washington. #utpol","date":"Wed Mar 30 16:26:48 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last year, I hosted a cybersecurity roundtable to learn how government can integrate with private industry to maintain &amp; protect our cyber superiority. I then co-led the Better Cybercrime Metrics Act w/ @RepSpanberger. Last night, this bipartisan legislation passed the House.","date":"Wed Mar 30 16:26:48 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Learn more about the Better Cybercrime Metrics Act here:\n\nhttps://t.co/zMWKo4wUst","date":"Wed Mar 30 16:26:48 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to this conversation. Join us today at 10am MT! #utpol","date":"Tue Mar 29 14:51:05 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Passage of the National Medal of Honor Monument Act is my proudest moment in Congress! Thank you to all who serve, and especially today to the 3,525 MOH recipients and their families. #utpol","date":"Fri Mar 25 16:21:46 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today is National Medal of Honor Day, and I am so proud to support the @MOHMuseum and our brave Medal of Honor recipients. Pictured here is Utah’s own George E. Wahlen and recent recipient LTC Will Swenson. https://t.co/4S5J8C9fGj","date":"Fri Mar 25 16:21:45 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Next week, my staff will be traveling throughout the 1st District hosting mobile office hours to address casework &amp; hear how we can best serve you. Come bring questions, thoughts, or any issues with federal agencies to Team Moore. #utpol \nSee schedule:\nhttps://t.co/nlK2yHiRmc","date":"Thu Mar 24 17:02:38 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I had a great time showing the Clearfield Youth Delegation around the Capitol. With restrictions finally easing up around DC, I am looking forward to the return of public tours in the near future. #utpol https://t.co/fOx7wALBDr","date":"Wed Mar 23 22:56:12 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/UnKZhc01Q2","date":"Tue Mar 22 19:10:02 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am deeply saddened by the news of Congressman Don Young’s passing. His legacy and his impact on Alaska and our nation will live on for many years to come. #utpol","date":"Sat Mar 19 15:08:10 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I had the privilege to serve with Congressman Don Young on @NatResources. His passion and service as the Dean of the House inspired us all. My thoughts are with his family during this difficult time. #utpol","date":"Sat Mar 19 15:08:10 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I appreciate any chance to speak to the @UtahFarmBureau. The agriculture industry is a vital component of Utah’s economy, and I admire all they do for our communities. #utpol https://t.co/vIYTfBfOqZ","date":"Fri Mar 18 21:30:06 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On Tuesday, the MAPLand Act passed the House! America is home to some of the most beautiful natural wonders in the world, and it is essential that we have up-to-date information on how to best access our public lands. #utpol https://t.co/tPS8VY09lP","date":"Thu Mar 17 16:35:03 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I thank @RepRussFulcher, @RepJoeNeguse, and @RepKimSchrier for co-leading this effort, and I look forward to seeing this legislation soon pass the Senate. #utpol","date":"Wed Mar 16 01:15:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Tonight the MAPLand Act passed the House! This bill will digitize tens of thousands of records so fishers, hikers, hunters, bikers, &amp; those who spend time enjoying our outdoors have all the info they need to have great experiences and make fond memories.\nhttps://t.co/EY9GZBWnV9","date":"Wed Mar 16 01:15:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"A really neat tribute at my boys’ school to celebrate the nation’s first female state senator, Dr. Martha Hughes Cannon. Excited for her to finally get sent to the Capitol! #utpol\n\nClick here to learn more: https://t.co/X0AzPrNUL6 https://t.co/ggm7FWlTHV","date":"Tue Mar 15 22:50:16 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"3. House Natural Resources Committee hearing: \"Examining the History of Federal Lands and the Development of Tribal Co-Management.\"\n\nhttps://t.co/XWJdN8BKxi","date":"Mon Mar 14 17:45:47 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"2. During a House Natural Resources Committee hearing, I had opportunity to reemphasize the absurdity of continuing to outsource our energy needs when America is fully capable of self-sufficiency. \n\nhttps://t.co/Ld6l1hjOIg","date":"Mon Mar 14 17:45:47 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"ICYMI: Recent hearing roundup #utpol \n1. I joined my colleagues on the HASC for a hearing that emphasized the importance of allies abroad. Now, more than ever, the United States must aggressively initiate, cultivate and expand partnerships and alliances.\n\nhttps://t.co/0ByXPpwJ5Y","date":"Mon Mar 14 17:45:46 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you @BoydMatheson for having me on the show to discuss current issues at home and abroad. #utpol\n\nhttps://t.co/Nie9UtyD2w","date":"Fri Mar 11 21:27:52 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you, @MohMuseum &amp; LTC Swenson, for presenting me with the inaugural Mission Inspire Award. The National Medal of Honor Monument Act is my greatest accomplishment in Congress so far, &amp; I can't wait to see the monument come to life as we immortalize our heroes' sacrifices.","date":"Thu Mar 10 21:59:20 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It's imperative that House Republicans are united in our efforts to push legislation that promotes fiscal responsibility, supports our military, strengthens our national security, &amp; fights for energy independence. Many thanks to @SteveScalise for this opportunity. #utpol","date":"Thu Mar 10 17:44:57 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday, I was appointed by @SteveScalise to serve as an Assistant Whip on the House Republican Whip Team! I am thrilled to serve my colleagues in this capacity. #utpol \n\nhttps://t.co/zEXZyntPDJ","date":"Thu Mar 10 17:44:57 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It’s no wonder Jane’s birthday falls during a month honoring women—she deserves the whole month to herself… but she only celebrates it for about a week 😉 Happy Birthday to the very best! #utpol https://t.co/rblDsU4SiH","date":"Wed Mar 09 21:41:01 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Tune in now!","date":"Wed Mar 09 12:36:27 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Coming up at 7:30am ET! Tune in!","date":"Wed Mar 09 12:19:40 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Tune in and ask a question at the link below! #utpol \n\nhttps://t.co/VduztxAod8","date":"Tue Mar 08 02:05:13 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to hearing from folks tonight at my tele-town hall! Be sure to join us! #utpol","date":"Tue Mar 08 01:14:43 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was great to meet with volunteers in the USO lounge at SLC Airport. Kudos to the Governor’s team for donating their space to give veterans a place to relax while they travel!  #utpol https://t.co/tFfSPoRJ5j","date":"Mon Mar 07 20:56:05 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"In a few weeks, House election rules will disallow my office from sending communications to folks who are not opted in to our newsletter. Be sure you are signed up! We will send you updates on my legislative efforts, committee hearings, and more. #utpol\n\nhttps://t.co/3WPtYezd1K","date":"Fri Mar 04 16:10:16 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Speaker Pelosi is playing politics with our veterans’ healthcare. I wanted to provide context on what happened on the House floor today that will further delay care for our veterans impacted by toxic burn pits. #utpol https://t.co/Tn2RIoaIG7","date":"Thu Mar 03 19:38:05 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Great to hear from @robertcobrien at our @RepublicanStudy lunch. It’s also been inspirational to learn more about @RepSpartz and her perspective on the situation in Ukraine. #utpol https://t.co/SBQURS6UQr","date":"Thu Mar 03 15:45:54 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My statement on President Biden’s State of the Union address: https://t.co/9r66j3DN8N","date":"Wed Mar 02 03:38:22 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Putin’s aggressive attacks on the West must be met with equally robust American policies. The American Energy Independence from Russia Act will enable us to hold Russia accountable for their unprovoked invasion of Ukraine &amp; put us back on the track to energy independence. #utpol","date":"Tue Mar 01 20:35:38 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join us on March 7th at 7pm MT for a tele-town hall! We will discuss the situation in Ukraine, inflation, @HAFB, and more. Please call in! #utpol https://t.co/5KFFaSuknJ","date":"Tue Mar 01 20:09:18 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As #BlackHistoryMonth comes to a close, I’ve enjoyed talking to my boys about members of the Black community who helped shape America, including baseball legend Jackie Robinson. We remember these heroes not just in February, but throughout the year. #utpol https://t.co/Der0s6pUIF","date":"Tue Mar 01 03:11:13 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Utah stands with Ukraine. Please consider joining the rally at the Utah State Capitol tonight at 5:00pm. #utpol","date":"Mon Feb 28 21:42:40 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My office will also assist those from Utah’s First District seeking help on casework related to Ukraine. #utpol (5/5)","date":"Thu Feb 24 14:51:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I join the world in praying for Ukraine during this abhorrent, unjustified attack, and I will work with Congress, the White House, and our European allies to support Ukrainians in their fight for freedom. #utpol \n(4/5)","date":"Thu Feb 24 14:51:08 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I believe that Putin advances when he senses weakness. That is why he acted to extend Russia’s borders during the Obama administration and is now trying it again even more forcefully. #utpol (2/5)","date":"Thu Feb 24 14:51:08 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I vehemently condemn Putin’s horrific invasion of Ukraine &amp; continue to stand ready to work w/ the Biden Admin to enact crippling sanctions &amp; immediately reverse failed energy policies to rebuild America’s energy independence &amp; assist our partners &amp; allies in Europe. #utpol (1/5)","date":"Thu Feb 24 14:51:08 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We simply can’t rely on Russia as an energy source, and @POTUS clearly should have implemented tougher sanctions on Russia and Nord Stream 2 prior to Putin’s forces firing on Kyiv. #utpol (3/5)","date":"Thu Feb 24 14:51:08 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The Biden Administration's disturbing decision to halt new oil and gas drilling permits amid $4 gas prices and escalating conflict with Russia could not have come at a worse time. I am baffled by this move against American citizens and the economy. #utpol\n\nhttps://t.co/Cp8Q0ICSaI","date":"Wed Feb 23 17:39:44 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Now is the time for strength and leadership from the White House. I strongly urge the passage of the Never Yielding Europe’s Territory Act, legislation I cosponsored that would bolster Ukraine’s capabilities, impose crippling sanctions, and hold Russia accountable. #utpol (3/4)","date":"Wed Feb 23 16:42:40 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We must continue working with our allies to permanently terminate the Nord Stream 2 pipeline. The United States, NATO, and friends of democracy across the world must come together to stand with Ukraine and deter further Russian aggression. #utpol (4/4)","date":"Wed Feb 23 16:42:40 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday’s additional sanctions on financial institutions and oligarchs are appreciated but continue to fall short. I hope to see further measures that fulfill President Biden's commitment to a swift and severe response to the violation of Ukraine’s sovereignty. #utpol (2/4)","date":"Wed Feb 23 16:42:39 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Russia’s wanton onslaught against Ukraine’s sovereignty undermines decades of the U.S.-led world order. The sanctions announced this week by the Biden Administration targeting solely the separatist movements in Eastern Ukraine did not go far enough. #utpol (1/4)","date":"Wed Feb 23 16:42:39 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Needless to say, our visit to the @yadvashem Holocaust Memorial and Museum was deeply moving. It’s always difficult, but very important, to reflect on this painful time in our global history. #utpol https://t.co/IIdJB3CKe8","date":"Wed Feb 23 01:39:22 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Amazing experience to be in the Holy Land! I’m honored to visit Jerusalem this week and meet with Israeli and Palestinian leaders as Congress works to strengthen the special U.S.-Israel partnership and promote regional security. #utpol https://t.co/k1TbZ4jh2Y","date":"Mon Feb 21 22:28:57 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy Presidents’ Day! We are thankful to all those who answered the call to serve and lead our nation throughout history. #utpol https://t.co/Y6SsEztsIR","date":"Mon Feb 21 19:40:22 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for hosting our town hall! Great to meet you and your daughter.","date":"Sun Feb 20 12:24:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Putin must be held accountable for his wanton disregard of Ukraine’s sovereignty. #utpol","date":"Fri Feb 18 20:36:04 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I cosponsored the Never Yielding Europe’s Territory (NYET) Act. Failing to act on behalf of our Ukrainian partners in the face of a Russian invasion would be a catastrophic moral failure with huge implications for global democracy.  \nhttps://t.co/2CVX9JmZoO","date":"Fri Feb 18 20:36:04 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@utahhousedems Thanks for having me!","date":"Fri Feb 18 19:47:39 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepEWeight I enjoyed meeting with you all!","date":"Fri Feb 18 19:47:03 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@utahhousereps Thanks for having me!","date":"Fri Feb 18 19:45:31 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@eric_stutzman5 Hi Eric- please reach out to my D.C. office at (202) 225-0453 with your request. Thanks!","date":"Fri Feb 18 19:30:50 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"\"Candy Bomber\" Col. Gail Halvorsen was a hero, and he leaves behind a legacy of kindness that will endure far beyond his 101 years. Thank you Col. Halvorsen. #utpol\n\nhttps://t.co/Ls76RyegzP","date":"Fri Feb 18 00:27:22 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you to everyone who joined us for my in-person town halls last night in Davis and Weber counties! I enjoyed engaging with you and appreciate your participation. #utpol https://t.co/xayKb72fG5","date":"Thu Feb 17 23:25:48 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This month, @RideUTA is offering free rides on all public transportation, including buses, TRAX and the FrontRunner. This is a productive solution to address Utah's poor air quality. \n\nFollow the link for more details:\nhttps://t.co/OHLYAk6zEW","date":"Thu Feb 17 02:32:55 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to seeing folks at my town halls tonight! #utpol","date":"Wed Feb 16 22:23:12 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today I hosted a town hall at @davistechcolleg and engaged with the driven and bright students there. Thanks for hosting me—I look forward to coming back soon! #utpol https://t.co/Gs3rn2os4v","date":"Wed Feb 16 21:18:16 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Roundtable discussions are one of the best ways for me to listen to our community’s priorities. This week I met with leaders in our veterans community and @UTHighwayPatrol. They are doing great work, and I look forward to working with them to achieve our shared goals. #utpol https://t.co/ATgwsHm8T6","date":"Wed Feb 16 20:29:46 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Had a great time with the @UtahFarmBureau &amp; the many volunteers who made the Share the Love event possible! They provided food to our military families as a token of our appreciation for their service. The ag &amp; military communities coming together—a very Utah thing to do! #utpol https://t.co/ZWv3MD5KqH","date":"Tue Feb 15 14:47:44 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Jane and I took this photo during freshman member orientation- the start of a whirlwind year. She has kept me sane since! 🙃 Happy Valentine’s, hun! #utpol https://t.co/ufyQsIpoJP","date":"Tue Feb 15 01:38:53 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Great event!","date":"Tue Feb 15 00:43:32 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read about my Afghanistan Accountability Act here: https://t.co/rcUtbQBnw7","date":"Mon Feb 14 17:28:42 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Anytime @CNN showcases a willingness to hold @POTUS accountable is worth highlighting. I appreciate @jaketapper’s segment. Portions of my Afghanistan Accountability Act will be incorporated into the commission to investigate last August’s withdrawal #utpol\nhttps://t.co/JcRxpChN8v","date":"Mon Feb 14 17:28:41 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"For more information, please refer to the travel advisory. \n\nhttps://t.co/faMK5sfPxp","date":"Sun Feb 13 20:53:10 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The @StateDept has issued an updated travel advisory for Ukraine stating that Americans must leave Ukraine due to the growing risk of a Russian invasion. If you or someone you know is in need of assistance, please see the link below or contact our office.\nhttps://t.co/NA3Apx3sHU","date":"Sun Feb 13 20:53:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"For those of you tuning into the Super Bowl this Sunday, don’t miss @officialhillafb F-35A fighter jet flyover during the national anthem. This 5-jet team will be led by Major Kristin “BEO” Wolfe and will celebrate 75 years of Air Force service. #utpol\nhttps://t.co/YluohAkdm8","date":"Sat Feb 12 01:50:31 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined @KVNUftp in-studio last night to talk about my reflections on my first year in Congress, the RNC censure, my new leadership role on @natresources, and more.\nListen here: https://t.co/RoptPNbxHx","date":"Fri Feb 11 19:16:11 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday, I spoke on the House Floor to honor Haven J. Barlow. After serving in the U.S. Navy and as a state legislator for 42 years, Haven’s contributions to Utah and Davis County were immeasurable. We will miss Haven and are thinking of his family during this time. #utpol https://t.co/Y5h30DYvMZ","date":"Fri Feb 11 02:02:18 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m hosting town halls in Weber and Davis counties this Wednesday, and I’d love to see you there! Please join us! #utpol\n\nhttps://t.co/EiK0YHKrDO https://t.co/808pIYXDMh","date":"Thu Feb 10 20:55:52 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"To add to the many tributes of the Ingles family, I want to thank @Joeingles7 and @RenaeIngles for their wonderful voice on raising a child with autism. It’s been a powerful example and has meant more to Jane and me than you’d ever know. #utpol \n\nhttps://t.co/OtVjBnKvdA https://t.co/EPI8mF2fvl","date":"Thu Feb 10 18:26:52 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congratulations to @colbyskier for his silver medal in Men’s Freestyle Skiing! Utah’s First District couldn’t be more proud. #TeamUSA","date":"Wed Feb 09 17:31:47 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As we enter this new year, it is becoming increasingly clear to all Americans that this Administration is on the wrong track, and I look forward to serving in this leadership role to hold it accountable and get us on the right track. #utpol","date":"Tue Feb 08 17:40:12 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Under @RepWesterman's leadership, @NatResources Republicans have conducted rigorous oversight over the Biden Admin’s harmful policies that are driving up energy prices, mismanaging our lands, &amp; making us dependent on foreign countries for energy products &amp; critical minerals.","date":"Tue Feb 08 17:40:12 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am honored to be appointed the new Ranking Member of the @NatResources Subcommittee on Oversight &amp; Investigations. #utpol","date":"Tue Feb 08 17:40:12 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My team is hosting mobile office hours this week! Check out my website to see when they will be in your area. #utpol","date":"Mon Feb 07 23:02:10 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Haven Barlow was a true public servant who dedicated his life to improving the lives of others, from his time in the @USNavy to his 42-year tenure in the Utah Legislature. I admire how well he spent his 100 years. The First District and all of Utah will deeply miss Haven. #utpol","date":"Mon Feb 07 15:24:03 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today's mobile office hours in the Uintah Basin and Duchesne are being postponed to a later date. We will keep you updated on the new dates and times as soon as possible. #utpol","date":"Fri Feb 04 18:00:59 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to hearing from you at my tele-town hall at 1pm MT today! Call in at (833) 305-1678 or tune in here:\n\nhttps://t.co/VduztxAod8","date":"Thu Feb 03 17:25:26 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@cmooresfi Hi Clayton, there is a link to the resolution text at the bottom of our press release:\nhttps://t.co/0xEGRIkkVp","date":"Thu Feb 03 16:14:43 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read more about the resolution here:\nhttps://t.co/0xEGRIkkVp","date":"Wed Feb 02 20:31:32 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I've heard from community &amp; business leaders alike that these programs simply work. Not only do they deepen ties between our communities &amp; allies abroad, but they allow employers to fill important vacancies &amp; address the workforce shortages that exist in UT &amp; across the US.","date":"Wed Feb 02 20:31:32 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today I introduced a resolution with @RepAnnieKuster reaffirming Congress' bipartisan support of the BridgeUSA programs. #utpol https://t.co/GhLyyvf7WR","date":"Wed Feb 02 20:31:31 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My staff is coming to you! They will be throughout the 1st District hosting mobile office hours to address casework &amp; hear how we can best serve you. Bring questions, thoughts, or any issues w/ agencies straight to Team Moore. View the schedule here:\nhttps://t.co/2Yb64iqM7J","date":"Wed Feb 02 17:35:19 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"After 35 years of service, Tage Flint has retired from @WeberBasinWater. Tage has become a good friend &amp; resource, &amp; he’s been helpful in my work on @NatResources &amp; @HASCRepublicans. Congrats to Tage on a productive career. Something tells me his days of serving aren't over.","date":"Tue Feb 01 19:05:24 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join me this Thursday at 1pm MT for an interactive tele-town hall! I look forward to answering your questions. Call in at 833-305-1678. I look forward to hearing from you on Thursday! #utpol https://t.co/R6zK4jCLr2","date":"Mon Jan 31 23:37:43 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This is great news for Weber County as we continue to recover from the economic impacts of the pandemic. Many thanks to our local officials who are leading efforts to get our workforce back on track. #utpol \n\nhttps://t.co/Pw0zz9TGnC","date":"Sat Jan 29 17:54:13 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Had a great lunch at Chris’ Cafe in Clearfield with Mayor Mark Shepherd! He is working on great initiatives for the area, and I love being able to support Clearfield’s priorities. #utpol https://t.co/x2fMIMNl6u","date":"Fri Jan 28 18:29:22 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This is what it's all about! Meeting with community leaders to identify the best ways we can help. Many thanks to the Weber County Commissioners for highlighting the work of my team- they don't get enough credit for how hard they work. #utpol \n\nhttps://t.co/zLup6K3eyS","date":"Thu Jan 27 14:45:05 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for having me!","date":"Wed Jan 26 18:04:15 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"ICYMI: I joined @BoydMatheson to reflect on @POTUS's 1st year in office. He has not been the leader he campaigned to be, &amp; his hyper-partisan policies are creating poor outcomes across the board. I don't revel in this; I don't want America to fail. #utpol\nhttps://t.co/90TN9GmVAs","date":"Tue Jan 25 18:37:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"A moment of bipartisan camaraderie last week: during our @NatResources hearing, @RepDebDingell &amp; I discussed UT's beautiful public lands, &amp; she shared an experience fishing in UT that meant a great deal to her. Moments like these help us find common ground &amp; productive solutions. https://t.co/kYYcON7bY7","date":"Mon Jan 24 16:09:49 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Protecting life and advocating for expecting mothers is among my top priorities in Congress. It is essential that we support life at all stages. #utpol https://t.co/WQ4JX2CUSp","date":"Fri Jan 21 22:36:05 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"With Russian troops amassing at the Ukrainian border &amp; the similar threat of aggression we saw from Putin during the Obama/Biden admin, I'm urging @POTUS to enact sanctions that impose real costs on Putin to deter Russia &amp; ensure stability in the region.\nhttps://t.co/scMsMrN7Wg","date":"Fri Jan 21 20:26:31 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congrats to my friend @RepJohnCurtis for unanimously passing his bill through @natresources! This bill will greatly improve recreational access to the Bonneville Shoreline Trail. #utpol","date":"Thu Jan 20 23:13:20 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was happy to speak in support of this great legislation that will serve Utahns across the state. #utpol \n\nhttps://t.co/Y5HBeyHbql","date":"Thu Jan 20 23:13:20 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Soon joining @BoydMatheson on @kslnewsradio to talk about @POTUS’s first year in office. Tune in! #utpol","date":"Thu Jan 20 20:13:37 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Since joining Congress, I have appreciated the @SBAList’s positive and inclusive approach to pro-life issues. I’m honored to earn an A+ rating on their National Pro-Life Scorecard. #utpol https://t.co/4zPASyET3u","date":"Thu Jan 20 15:50:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We're live! Join me for my tele-townhall now! #utpol\n\nhttps://t.co/VduztxAod8","date":"Thu Jan 20 02:05:08 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to hearing from folks tonight during my telephone townhall! Be sure to join us! #utpol","date":"Wed Jan 19 18:23:03 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join us TOMORROW for a tele-townhall event! We’ll talk inflation, @HAFB, this ridiculous attempt to bypass the filibuster, the Democrats’ spending agenda, &amp; what I plan to accomplish on behalf of UT this year. Call in at 7pm at (833) 305-1678. I look forward to hearing from you! https://t.co/2cRTXITufe","date":"Tue Jan 18 14:48:27 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today we honor and remember the legacy of Dr. Martin Luther King, Jr. His heart for service, justice, and equality made our nation stronger and a better place for all. #MLKDay #utpol https://t.co/qg939aYQee","date":"Mon Jan 17 17:47:20 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am thankful we have @GovCox and @LGHendersonUtah at the helm as we navigate this pandemic. They are working hard to keep Utahns safe, restore our local economy, and keep the Beehive State the greatest place to live in our nation. #utpol https://t.co/OwqyD2RkZZ","date":"Sun Jan 16 20:52:00 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The Supreme Court’s ruling today is a major win for businesses and individual freedom. I am proud to have pushed to reverse this mandate with my congressional colleagues as we continue to uphold our constitution’s principles. #utpol","date":"Thu Jan 13 23:41:03 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This excerpt is a solid summary: \n\n“Mr. Biden’s filibuster foray is likely to fail amid bipartisan opposition, but the more he fails the more partisan and distorted his speeches get. It’s a bad presidential look.” #utpol","date":"Thu Jan 13 03:07:19 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This is an incredibly important read. @POTUS has been staunchly supportive of the filibuster, until now. This week has been disturbing as we watch the majority blatantly lie about voter laws in GA &amp; TX &amp; then use that to try &amp; nuke the filibuster. #utpol \nhttps://t.co/IFnXRg64la","date":"Thu Jan 13 03:07:19 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Best of luck to Team USA competing in the @Intermountain Freestyle International this week, taking place at @Deer_Valley. The athletes are competing on the '02 Salt Lake Olympic courses. UT-01 is proud to host these amazing events &amp; athletes. #utpol \n\nhttps://t.co/91m02vy2OW","date":"Wed Jan 12 22:46:45 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We can embrace commonsense precautions, but our kids need to be in the classroom for both their academic success and mental health. #utpol","date":"Tue Jan 11 23:19:24 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I spoke on the House floor today in support of the Reopen Schools Act. In-person learning is critical for our children’s well-being, and students are struggling as we persevere through the challenges presented by COVID-19. #utpol \n\nhttps://t.co/4TOfci8rWG","date":"Tue Jan 11 23:19:24 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"There are countless reasons why it’s important to acknowledge our officers on #LawEnforcementAppreciationDay. From finding Madelyn Allen from Snow College to daily putting themselves in harm’s way, these men and women do amazing, challenging, &amp; dangerous work in our communities. https://t.co/HtSZz8KM6p","date":"Mon Jan 10 00:37:09 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congratulations to all the public servants who were recently sworn in to their city council and mayoral positions! I was honored to attend the Layton swearing in ceremony on Monday and the Kaysville ceremony yesterday. #utpol https://t.co/HjSEW1X8Is","date":"Fri Jan 07 18:52:14 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"3) Congress must clarify our constitutional role with respect to counting electoral votes. Election authority must remain at the local level, and Congress must abide by that principle to ensure election integrity is never leveraged by political gain. #utpol","date":"Fri Jan 07 01:44:49 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"2) Political violence of any kind is 100% unacceptable, and we need to drastically tone down rhetoric that harms our relationships and communities. #utpol","date":"Fri Jan 07 01:44:49 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"In addition to what I have previously communicated to press regarding January 6, 2021, I have three final thoughts as we move forward: \n\n1) Our law enforcement and first responders continue to deserve our utmost respect; the @CapitolPolice were heroes that day. #utpol","date":"Fri Jan 07 01:44:48 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"3) Congress must clarify our constitutional role with respect to counting electoral votes. Election authority must remain at the local level, and Congress must abide by that principle to ensure election integrity is never leveraged by political gain. #utpol","date":"Fri Jan 07 01:42:08 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"2) Political violence of any kind is 100% unacceptable, and we need to drastically tone down rhetoric that harms our relationships and communities. #utpol","date":"Fri Jan 07 01:42:08 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy 100th birthday to a community legend! #utpol","date":"Wed Jan 05 02:17:38 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy Birthday to the greatest state in the union, the Beehive State! #utpol https://t.co/RcD9OlI6Wd","date":"Wed Jan 05 02:06:51 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"With the Supreme Court slated to consider the Biden Administration's vaccine mandate this week, I joined over 170 of my Republican colleagues urging the Court to reverse the mandate. #utpol \n\nhttps://t.co/UObKK843Fk","date":"Tue Jan 04 00:58:12 +0000 2022","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It’s hard to believe 2021 is already coming to a close! My team &amp; I have worked hard every day to deliver results to Utah’s 1st District, &amp; it has been an honor to serve you. Thank you for your input this year, &amp; we look forward to further delivering on your priorities in 2022. https://t.co/63uYCC5hNP","date":"Fri Dec 31 17:20:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"You can read more about our 2021 accomplishments here:\n\nhttps://t.co/f7EpImD0Pe","date":"Fri Dec 31 17:20:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was a great first year serving on @NatResources!","date":"Thu Dec 30 19:34:40 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you for your support on this important issue, @RepDLesko!","date":"Wed Dec 29 21:18:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Click here to learn more about the National Medal of Honor Monument Act:\n\nhttps://t.co/D35o5H0vop","date":"Tue Dec 28 00:37:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Signed, sealed, &amp; delivered to our heroic Medal of Honor recipients! @RepVeasey's &amp; my National Medal of Honor Monument Act was signed by @POTUS today. This bipartisan win will immortalize the sacrifices of America's brave servicemembers. #utpol \nhttps://t.co/z9vQA2IPJC","date":"Tue Dec 28 00:37:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congrats to @USUAggies for achieving the prestigious R1 classification, giving it the mark as one of the top research universities in the nation. I'm glad to see Utah State's amazing contributions in the research field recognized at this level. #utpol \n\nhttps://t.co/yvIb2J3pcj","date":"Mon Dec 27 17:23:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Wishing everyone a very Merry Christmas and a great day with family and loved ones. #utpol","date":"Sat Dec 25 21:32:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for the feature in @thedispatch! #utpol","date":"Wed Dec 22 15:43:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congratulations, @LGHendersonUtah! #utpol","date":"Tue Dec 21 16:25:23 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Grateful to have been part of this historic effort to commemorate our Medal of Honor recipients with a monument in DC. This bipartisan legislation is off to the president’s desk, and we are one step closer to immortalizing the sacrifices of our nation’s greatest heroes. #utpol","date":"Sun Dec 19 18:19:55 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/NtRLbrNLai","date":"Thu Dec 16 21:11:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"These 13 fallen servicemembers gave the ultimate sacrifice to our nation on foreign soil, and I am grateful their service will be forever remembered. They each represent the best of America’s strength, and we extend our gratitude to them and their families. #utpol","date":"Thu Dec 16 21:11:17 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"In a @NatResources forum on the supply chain crisis, I invited Jack Hedge of the UT Inland Port Authority to report on innovative solutions to our supply chain crisis, which is contributing to this inflation that is crunching businesses &amp; family budgets.\nhttps://t.co/cZ0m5ag3DW","date":"Sat Dec 11 15:00:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday’s inflation report yielded a Consumer Price Index increase of 6.8%— a serious reminder of the economic turmoil American families are facing. #utpol \n\nhttps://t.co/ZG9fBeY6Bs","date":"Sat Dec 11 15:00:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I deeply appreciate the work @FLETC is doing in Utah to equip our law enforcement officers to combat human trafficking. #utpol","date":"Thu Dec 09 19:32:30 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was thrilled to vote for the House's final passage of the NDAA this week, as it delivers wins for our national security &amp; UT's defense community by reversing the Biden Admin's spending cuts &amp; investing in depot modernization &amp; nuclear deterrence. #utpol\nhttps://t.co/OKrmyBTQO6","date":"Thu Dec 09 17:26:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The removal of 2A restrictions, female draft requirements, &amp; vaccine mandates demonstrates that the legislative process can be trusted. I urge my Senate colleagues to rapidly move this legislation so we can give our service members the assistance they need to keep Americans safe.","date":"Thu Dec 09 17:26:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for having me on!","date":"Wed Dec 08 02:46:28 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On this 80th anniversary, may we never forget the attack on Pearl Harbor. #ussutah https://t.co/DfOrVQzJQi","date":"Wed Dec 08 02:45:53 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to today's telephone townhall at 1pm MT! Join us by dialing in at (833) 305-1678. #utpol","date":"Tue Dec 07 17:05:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Reflecting on Bob Dole's life, I read about his support for the WWII memorial on the National Mall. This is a neat connection to our effort to build memorials for America's Medal of Honor recipients &amp; veterans who bravely fought the War on Terror. Onward!\nhttps://t.co/JrTHnWiB1V","date":"Mon Dec 06 15:48:38 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Click here for more information on the National Medal of Honor Monument Act that passed the House earlier this year:\nhttps://t.co/8Llm0GmCSO","date":"Mon Dec 06 15:48:38 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Let’s go Aggies!","date":"Sun Dec 05 16:14:19 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join us on Tuesday at 1pm MT for my last telephone townhall event of the year! There’s lots to discuss after a whirlwind 2021, so call in to chat about the issues that matter most to you. Dial in at (833) 305-1678. I look forward to hearing from you! #utpol https://t.co/EwhMBLIVRp","date":"Fri Dec 03 16:03:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"https://t.co/76vJmyHDHU","date":"Fri Dec 03 16:03:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepPfluger Thanks August!","date":"Fri Dec 03 16:01:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@CongMikeSimpson Thank you so much!","date":"Fri Dec 03 15:46:51 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepTomEmmer Appreciate it!","date":"Thu Dec 02 22:46:45 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepChrisStewart Many thanks!!","date":"Thu Dec 02 22:46:32 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@SenMikeLee Thank you! We are thrilled!","date":"Thu Dec 02 22:46:17 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepTenney Thank you!","date":"Thu Dec 02 22:46:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@NatResources Thank you!","date":"Thu Dec 02 22:45:45 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Christmas came early for the Moore family! Franklin Garr Moore arrived on Nov. 30th at 6lbs and 19in. Mom and baby are doing great, and we are bracing for life with 4 boys! 👶🏼 #utpol https://t.co/Gv66u7McqM","date":"Thu Dec 02 20:33:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congratulations and thank you for your important work, Steven! #utpol","date":"Wed Dec 01 18:39:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Got a warm greeting at the @ProcterGamble facility in Box Elder yesterday! This P&amp;G site is a prime example of Northern Utah’s commitment to manufacturing quality products for our communities in Utah and across the country. #utpol https://t.co/ufuorDK25Y","date":"Tue Nov 30 21:24:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I'm about to join @kslnewsradio to talk about the reconciliation spending package, Covid variant, and more. Tune in! #utpol","date":"Mon Nov 29 16:50:14 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy Chanukah to all, but especially to the amazing Jewish community in Utah! Grateful to hear from Rabbi Benny Zippel tonight as we celebrated the start of this special holiday. #utpol https://t.co/pU6VuOc003","date":"Mon Nov 29 06:10:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy Thanksgiving from our family to yours! #utpol https://t.co/cq5Dvqd7IK","date":"Fri Nov 26 00:35:49 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"ICYMI: I spoke to @BoydMatheson on @kslnewsradio about the Biden Administration's decision to tap into our Strategic Petroleum Reserve. Listen here:\n\nhttps://t.co/rEF9W3b1qR","date":"Thu Nov 25 00:50:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am soon joining @BoydMatheson on @kslnewsradio at 1:35pm MT to talk about the Biden Administration's decision to tap into our Strategic Petroleum Reserve. Tune in! #utpol","date":"Tue Nov 23 20:23:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We must do better to prioritize our national security and economic outlook. #utpol","date":"Tue Nov 23 17:03:44 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"America has both the obligation and the capacity to be energy independent. As gas prices continue to rise, the Biden Administration's policies are exacerbating the inflationary pressures felt by Utahns and Americans across the nation. #utpol\nhttps://t.co/Cda2eujEyA","date":"Tue Nov 23 17:03:43 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@deckershimai Yes! We can’t wait!","date":"Sat Nov 20 20:13:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The last 24 hours have worn out the Moore crew… However, watching an 8.5 hour magic “minute” is still easier than chasing our 3 boys while 8 months pregnant… #utpol https://t.co/8wSDYnawXA","date":"Sat Nov 20 13:20:49 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My statement on my vote today against the reconciliation spending package: https://t.co/gMOHdLKi10","date":"Fri Nov 19 15:43:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy to back up the @GOPLeader tonight as we stand up in opposition to the majority’s radical spending agenda. Going on 5 hours. #utpol https://t.co/MfrSlATfwL","date":"Fri Nov 19 07:05:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"One step closer to enactment! I am grateful to be involved in such an important cause and look forward to working to get this bill to President Biden’s desk. #utpol","date":"Thu Nov 18 18:47:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The COVID vaccines are effective and have saved many lives, but we must uphold the principles enshrined in our Constitution that protect an individual’s ability to make their own decisions. #utpol","date":"Thu Nov 18 17:31:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I spoke on the House floor last night in opposition to @potus’s vaccine mandate on businesses issued by the @OSHA_DOL, which the Fifth Circuit Court of Appeals confirmed is a major misuse of power. #utpol https://t.co/QcbNRgXGlR","date":"Thu Nov 18 17:31:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am thrilled the @NatResources Committee passed my Saline Lake Ecosystems in the Great Basin States Program Act today. The value of Utah’s Great Salt Lake and its neighboring, regional saline lakes cannot be overstated. #utpol \nhttps://t.co/JRks0bIfJC","date":"Wed Nov 17 23:47:49 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I introduced this bill to help us study &amp; better understand what is happening in our saline lake ecosystems to ensure that our water users, animals, habitats, and industry can stay healthy far into the future. You can read more about this legislation here:\nhttps://t.co/46KTn2xhyf","date":"Wed Nov 17 23:47:49 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My team is traveling throughout the First District this week hosting mobile office hours to address casework and hear how we can best serve you. Check out my website to see when Team Moore is coming to you! #utpol \n\nhttps://t.co/Z5qpvaDP3z","date":"Tue Nov 16 23:17:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Many thanks to all who joined us for my in-person townhalls in Weber and Davis counties last week! I enjoyed engaging with you, addressing concerns, and collecting input. #utpol https://t.co/F2Jza2zqYx","date":"Tue Nov 16 23:17:33 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Next week, my team will be hosting mobile office hours to address casework and hear how we can best serve you. Come bring questions, thoughts, or any issues with federal agencies straight to Team Moore. Go to my website for the full schedule: #utpol \nhttps://t.co/Z5qpvaDP3z","date":"Fri Nov 12 14:22:30 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today was one of the most special days of my time in Congress. I was able to honor veterans at various events this week, &amp; my message was simple: I’ll commit to using my roles on @HASCRepublicans &amp; other groups to honor veterans not just on Veterans Day, but throughout the year. https://t.co/6vBTui8e2I","date":"Fri Nov 12 00:52:48 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"You can read about my Retain Skilled Veterans Act in my latest op-ed in the @standardex here:\n\nhttps://t.co/UWJNGsyWiu","date":"Fri Nov 12 00:52:48 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"From my bill that would establish a Medal of Honor monument in DC to my advocacy for our veteran workforce &amp; mental health initiatives, engaging with our veterans community is one of my favorite aspects of this job. I’m honored to celebrate our vets today &amp; every day. 🇺🇸🎖#utpol","date":"Fri Nov 12 00:52:48 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@GUATEMAXmations @WeberStateU Thanks for coming and for your question!","date":"Thu Nov 11 13:10:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to my townhall in Davis County tonight! I’ll see you at @WeberStateU’s Davis campus at 7:30pm. #utpol","date":"Thu Nov 11 01:24:33 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for hosting me! #utpol","date":"Thu Nov 11 01:20:02 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@pe_trevor Thanks for coming and for your question! I appreciate your consistent engagement on energy issues.","date":"Wed Nov 10 20:17:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to seeing folks tonight at my in-person townhall in Weber County! Join us at 5:30pm MT at Weber High School's auditorium. #utpol \n\nYou can find more details on tonight's townhall as well as tomorrow's townhall in Davis County here: https://t.co/9DJw3xaiRf","date":"Tue Nov 09 21:23:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@TinaCannonUtah Locations can be found here: https://t.co/9DJw3xaiRf","date":"Tue Nov 09 21:13:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join us this week at one of my in-person townhall events in Weber and Davis counties! We’ll talk inflation, immigration, vaccine mandates, Hill Air Force Base, infrastructure and reconciliation, and anything else you’d like to discuss. I look forward to seeing you there! #utpol https://t.co/NaOgs74E3k","date":"Sun Nov 07 16:23:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"You can find location details on my website. #utpol \n\nhttps://t.co/9DJw3xaiRf","date":"Sun Nov 07 16:23:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My statement on tonight’s infrastructure vote: https://t.co/xjxrDDlRju","date":"Sat Nov 06 03:59:49 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@WillifordBobbi Hi there, we are happy to assist you. Please call my office at 801-625-0107 and we will address your questions. Thank you for joining the townhall!","date":"Thu Nov 04 21:28:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to speaking with folks soon during my Medicare telephone townhall. Be sure to join us! #utpol","date":"Thu Nov 04 18:04:38 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":".@GordonMLarsen and I spoke to @BoydMatheson on @kslnewsradio about our new debt and deficit task force that is designed to tackle our nation's financial challenges by providing Utah-based solutions.\n\nTake a listen here:\nhttps://t.co/kXJeTjZJ5W","date":"Thu Nov 04 14:21:43 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"There's a lot to be done here, and I am committed to reversing our debt culture in Washington. #utpol","date":"Thu Nov 04 14:21:43 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Great piece from @CVDaily on the House's passage of my Bear River National Heritage Area Study Act! #utpol \n\nhttps://t.co/sTptyOfnRC","date":"Thu Nov 04 14:11:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined my @RepublicanStudy colleagues in highlighting the harmful provisions in the majority’s multi-trillion dollar spending plan. These proposals will make it harder for businesses to succeed, drive up costs for families, &amp; worsen the inflation we’re experiencing. #utpol https://t.co/0pwk7WddnU","date":"Wed Nov 03 01:22:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Ensuring that this history can be fully preserved and remembered will promote tourism and shine a light on the local heritage. #utpol","date":"Tue Nov 02 22:03:24 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Medicare Open Enrollment ends on Dec. 7th, &amp; I want to help you make the choice that meets your needs. Join me &amp; experts from @CMSGov for a tele-townhall this Thursday at 1pm MT to answer questions about the program, coverage, or any issues you have encountered. #utpol https://t.co/b7Kr6FPIUr","date":"Mon Nov 01 15:28:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I'm immensely proud the House passed my Bear River National Heritage Area Study Act today. In working closely w/ communities in the Bear River Basin, I've been struck by the historical significance this region brings to our state &amp; nation’s story. #utpol\n\nhttps://t.co/YlScoGpY6l","date":"Tue Nov 02 22:03:23 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m about to join @BoydMatheson on @kslnewsradio to talk about my new debt and deficit task force. Tune in! #utpol","date":"Tue Nov 02 19:51:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Dial in at (833) 305-1678. We look forward to speaking with you soon! #utpol\n\nhttps://t.co/LVx7z8naXF","date":"Mon Nov 01 15:28:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Medicare Open Enrollment ends on Dec. 7th, &amp; I want to help you make the choice that meets your needs. Join me &amp; experts from @CMSGov for a tele-townhall this Thursday at 1pm MT to answer questions about the program, coverage, or any issues you have encountered. #utpol https://t.co/b7Kr6FPIUr","date":"Mon Nov 01 15:28:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We cannot afford to compromise our national security, and I join my colleagues in urging the Administration to reverse this contractor mandate. #utpol","date":"Fri Oct 29 00:06:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Our national security relies on our defense contractors at the @DeptofDefense, and the Biden Administration’s vaccine mandate may push experienced contractors to leave the DOD and cost us invaluable expertise. #utpol \n\nhttps://t.co/FiWz7OAbjg","date":"Fri Oct 29 00:06:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am thrilled the House passed bipartisan legislation to award the Congressional Gold Medal to the 13 servicemembers killed in the attack at the Kabul airport in Afghanistan. We will continue to honor and remember their sacrifice and devotion to our nation. #utpol","date":"Wed Oct 27 20:05:30 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am gravely concerned about the ongoing crisis at the southern border, and it is essential we implement and support policies we know work. This is an effective and compassionate policy that deters cartels from dangerous and illegal activities at the border. #utpol","date":"Tue Oct 26 16:48:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As the situation at the southern border deteriorates, I joined my colleagues in calling for a vote on the Remain in Mexico Act, which would codify the program that returns eligible immigrants to Mexico as they await their asylum claim proceedings. #utpol \nhttps://t.co/OWCQeidP35","date":"Tue Oct 26 16:48:07 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined @BoydMatheson on @kslnewsradio to talk more about this issue. Listen in here: \n\nhttps://t.co/fBjlbzAEd9","date":"Thu Oct 21 16:24:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I oppose this unconstitutional federal overreach, and I stand with Utah families who depend on the security and privacy their financial institutions provide. #utpol","date":"Thu Oct 21 16:24:14 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This levies an outrageous compliance cost on our community banks and credit unions, lowers savings yields for our First District families, and poses major privacy concerns—all without even closing the tax gap. #utpol","date":"Thu Oct 21 16:24:14 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I spoke on the House Floor to oppose the majority’s $3.5T reconciliation package that includes an expansive IRS mandate that would force our neighborhood banks and local credit unions to hand over constituents’ private financial information to the IRS. #utpol https://t.co/BsuegYefHb","date":"Thu Oct 21 16:24:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":".@uammi_utah does great work to ensure our advanced material industry can thrive and bolster our statewide economy, and I thank them for meeting with me. #utpol","date":"Tue Oct 19 13:58:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I enjoyed meeting members of the @uammi_utah to discuss current supply chain challenges, reshoring efforts, and ways my team and I can help Utah's advanced material and manufacturing industry recover from the pandemic on the federal level. #utpol https://t.co/BozvgmaTCQ","date":"Tue Oct 19 13:58:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for having me! #utpol","date":"Tue Oct 19 13:15:32 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"In the late ‘90s, I attended an event honoring Gen. Colin Powell, and I will never forget meeting him. I always respected his leadership, and my thoughts are with his family on this sad day. #utpol https://t.co/Efclaiy86h","date":"Mon Oct 18 16:26:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m hosting townhall events in Weber and Davis counties on November 9th and 10th, and I’d love to see you there! Head to my website below for details. #utpol \n\nhttps://t.co/9DJw3xaiRf","date":"Wed Oct 13 16:36:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you to all who joined us for my townhalls in Cache and Box Elder counties yesterday! We had a good turnout despite the snowstorm, and I enjoyed engaging with you and answering your questions. #utpol https://t.co/UgWKZeCxdX","date":"Wed Oct 13 16:36:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to seeing folks in Cache and Box Elder counties tonight! Join us! #utpol","date":"Tue Oct 12 17:35:28 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I will be holding in-person townhalls in Cache and Box Elder Counties next Tuesday, and I’d love to see you there! Please join me as we discuss issues that matter most to Utahns. Click the link below for location details. #utpol\n\nhttps://t.co/9DJw3xaiRf https://t.co/kus4AP3n9x","date":"Fri Oct 08 19:35:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RickyHatchUT @RodneyDavis @NACoTweets @IntGovOfficials @EACgov Thanks for having us!","date":"Fri Oct 08 20:43:54 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I will be holding in-person townhalls in Cache and Box Elder Counties next Tuesday, and I’d love to see you there! Please join me as we discuss issues that matter most to Utahns. Click the link below for location details. #utpol\n\nhttps://t.co/9DJw3xaiRf https://t.co/kus4AP3n9x","date":"Fri Oct 08 19:35:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am proud of all the cutting edge research happening at the @USUAggies BioInnovations Center. A big thanks to all of the researchers and scientists who do amazing work for our community, our state, and the nation. #utpol","date":"Fri Oct 08 15:21:28 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Cache Valley is a hub for Bioscience, &amp; I thank @BioUtah for showcasing the amazing things happening in UT. I’m honored to represent this industry in UT-01, home to companies like @quansysbio &amp; ELITech, which lead in COVID-19 antibody research &amp; manufacture diagnostic products. https://t.co/brtzysWhY3","date":"Fri Oct 08 15:21:28 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":".@POTUS is delivering a devastating blow to our efforts to find a permanent, legislative solution to the boundaries and management of the Bears Ears and Grand Staircase-Escalante national monuments. #utpol \n\nRead our full delegation statement: https://t.co/94T81hnb3Q","date":"Fri Oct 08 00:08:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Many thanks to @RodneyDavis for coming to Utah to meet with @WeberElections and local officials to discuss how we can bring Utah's gold standard election processes to other states. #utpol \n\nhttps://t.co/etbx3hXsN7","date":"Thu Oct 07 18:31:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@HASCRepublicans has passed the NDAA every year for nearly six decades. Provisions like Section 529 stand in the way of HASC remaining the most bipartisan committee in Congress &amp; simply have no place in the NDAA. #utpol \n\nRead my full statement here:\nhttps://t.co/kHvQtVZCSi","date":"Wed Oct 06 17:40:47 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined 160 colleagues demanding Section 529’s removal, &amp; I trust @RepMikeRogersAL's commitment to strip this language from the NDAA in conference w/ the Senate. @HASCRepublicans removed this language from last year’s bill, &amp; I'm confident we will remove it again this year.","date":"Wed Oct 06 17:40:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I share the concerns of many over Section 529 in the NDAA. This Democrat-sponsored provision permits military judges to issue ex parte gun confiscation orders, violating 2A rights for our men and women in uniform and depriving them of due process. #utpol \nhttps://t.co/kHvQtWhegS","date":"Wed Oct 06 17:40:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":".@POTUS, is “part of the process” to harass a US Senator in a restroom? This is a double standard. No elected official should be harassed for representing the interests of their constituents.  #utpol \n\nhttps://t.co/3U7j7HHBvv","date":"Wed Oct 06 14:20:07 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week’s batting average: .500\nThis week’s skeet average: .880\n\nSo great to meet with the @BrowningArms team, hear about their priorities, and get to the range. Thanks for having me!  #utpol https://t.co/XhYODlFAyx","date":"Wed Oct 06 14:10:47 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"If you missed my radio townhall with @KVNUftp last night, you can listen at the link below. Many thanks to all who participated! I enjoyed engaging with you and answering your questions. #utpol \n\nhttps://t.co/NyrYyhqv0M","date":"Fri Oct 01 15:10:23 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"About to go live on @KVNUftp for our radio townhall! Join us! #utpol","date":"Thu Sep 30 23:04:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to tune in! #utpol","date":"Thu Sep 30 22:37:55 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Brought the boys to pre-game batting practice this morning! ⚾️ Be sure to watch tonight’s Congressional Baseball Game for charity tonight on FS1 at 7pm ET/5pm MT! #utpol https://t.co/g6IBKQ7WSt","date":"Wed Sep 29 17:21:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The Ground Based Strategic Deterrent and triad modernization are essential to our national security, and I was pleased to advocate for its funding in the National Defense Authorization Act. #utpol \n\nhttps://t.co/HJjOiAdC7Z","date":"Mon Sep 27 19:23:51 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My team and I are deeply saddened to learn of Staff Sgt. Paul Lincoln Olmstead’s passing. We send our condolences to his wife and children, and we are grateful for his service to Utah and our nation. #utpol \n\nhttps://t.co/A2i4bUTIJq","date":"Sat Sep 25 14:57:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Sign up for my e-newsletter to stay updated on our in-person townhall events this fall. #utpol \n\nhttps://t.co/3WPtYezd1K","date":"Fri Sep 24 18:45:38 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Nothing like a tele-townhall right before a late-night practice for next week’s Congressional Baseball Game! ⚾️ Many thanks to all who participated. I enjoyed engaging with you &amp; answering your questions.\n\nI’m still a Mets fan— don’t be fooled by the hat. #utpol https://t.co/1tXB0K6zSV","date":"Fri Sep 24 18:45:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We must regain control of our spending &amp; national debt, just as leaders from both parties did in 1997. For those of us committed to fiscal responsibility, it's time to put our money where our mouth is. \n\nRead my full opinion piece with Doug Hervey here: \nhttps://t.co/UDdxcVxgAW","date":"Fri Sep 24 17:12:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As Utah’s sole representative on the House Armed Services Committee, I will continue advocating for @HAFB and fight to ensure the interests of Utah’s defense community remain in the final bill. #utpol","date":"Fri Sep 24 15:21:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last night, the NDAA passed the House. I'm proud of the bill my @HASCRepublicans colleagues &amp; I prepared. This bill rebukes the Admin's defense cuts by restoring funding to adjust for inflation, maintain an edge over power competitors, &amp; modernize depots. \nhttps://t.co/2y0JqMptbz","date":"Fri Sep 24 15:21:07 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The majority included several amendments at this stage in the process I voted against, but I will work w/ the Senate &amp; conference committee to further refine this bill &amp; keep the NDAA focused on its primary intent: to support military members, their families, &amp; the warfighter.","date":"Fri Sep 24 15:21:07 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I look forward to hearing from you tonight! Be sure to call in at 7pm MT! #utpol","date":"Thu Sep 23 22:43:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I introduced the Saline Lake Ecosystems in the Great Basin States Program Act w/ @RepHuffman to create a cooperative program at the @USGS to study and find solutions to historically low levels of the West's saline lakes and threatened habitats. #utpol \n\nhttps://t.co/sJKdfaWvC5","date":"Thu Sep 23 22:42:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My wife is 6 months pregnant, so this issue is heavy on my heart. We should focus on ensuring every child has opportunities, no matter the circumstances of their conception or birth, &amp; that pregnant women &amp; mothers have the resources they need to support their families. #utpol","date":"Thu Sep 23 20:26:22 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I spoke on the floor to express my opposition to H.R. 3755. States have long had the right under Roe v. Wade to pass laws to protect life &amp; women’s health, but this bill would throw out UT laws that are actually in line with Roe v. Wade &amp; legalize abortions in UT until birth. https://t.co/WCx0oDl2cc","date":"Thu Sep 23 20:26:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"In UT, we appreciate the value of our lands, &amp; we understand the importance of proactive management actions that protect these lands. As fires continue to threaten our communities &amp; natural resources, we must act to improve our ability to effectively manage these forests. #utpol","date":"Thu Sep 23 02:59:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I'm proud to introduce the Save Our Forests Act with my friend @RepJimmyPanetta, which will fill important vacancies in the @forestservice to help reduce the risk of wildfire &amp; improve our overall land management. #utpol \n\nhttps://t.co/YJQoUHYGhb","date":"Thu Sep 23 02:59:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We know that war crimes have proliferated in the wake of the Taliban takeover. The American people deserve a a comprehensive report on their misconduct to ensure the Taliban faces full accountability for their crimes. #utpol","date":"Tue Sep 21 17:32:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I testified before the Rules Committee yesterday to offer a floor amendment to the National Defense Authorization Act requiring the Secretary of State and Director of National Intelligence to report on incidents of human rights violations by the Taliban. #utpol https://t.co/2jve2qd4QE","date":"Tue Sep 21 17:32:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"There is broad support among Americans for a strong nuclear deterrent to bolster our national security. I’ve been working with @HASCRepublicans and the team at @HAFB to secure funding for the Ground Based Strategic Deterrent at HAFB. #utpol \n\nhttps://t.co/Bs6cUJIHv7","date":"Mon Sep 20 18:01:53 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It is essential that we continue modernizing the nuclear triad to deter our adversaries and maintain international order. #utpol","date":"Mon Sep 20 18:01:53 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join me for an interactive telephone townhall this Thursday at 7pm MT! We will talk inflation, immigration, the Afghanistan crisis, @HAFB, updates from Washington, and more. Be sure to call in at (833) 305-1678. I look forward to hearing from you on Thursday! #utpol https://t.co/UJ1MNbFEb9","date":"Sun Sep 19 18:48:40 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined @RepTomEmmer's letter expressing concern over a provision being considered in the reconciliation bill that would force banks &amp; credit unions to give Utahns’ private financial info to the gov, including info on the inflows &amp; outflows on their bank accounts. #utpol","date":"Wed Sep 15 17:27:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This provision will particularly hurt Utah families that depend on credit unions and banks in rural and low-income areas by making it more expensive for credit unions to serve these customers. #utpol\n\nhttps://t.co/MCvruTxvZi","date":"Wed Sep 15 17:27:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"A special thanks to HAFB Museum Manager Robb Alexander for all he does! #utpol","date":"Wed Sep 15 15:43:31 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It's been a great few weeks with the folks at @HAFB! From taking my kids to the HAFB Museum to participating in an F-16 familiarization flight to playing in the Commander's Cup benefitting the HAFB Museum, I'm grateful to represent this integral part of our community. #utpol https://t.co/vRwEgIhoHg","date":"Wed Sep 15 15:43:30 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Very glad to see no officers were harmed during last night’s active gunman incident. As we continue to reflect on the events of 9/11, we’re grateful for those who daily risk their lives to ensure our safety. Many thanks to @UTHighwayPatrol &amp; your great service to our communities.","date":"Tue Sep 14 15:26:16 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"\"We need to put tools in the hands of local leaders &amp; reduce bureaucratic hurdles to protect our forests. We'll continue to work w/ @NatResources &amp; local leaders as they address our wildfire crisis.\" \n\nRead my op-ed w/ @RepWesterman in the @Parkrecord:\n\nhttps://t.co/xXpb64j0rZ","date":"Mon Sep 13 17:35:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We will never forget the tragedies of 9/11. Innocent lives were lost, first responders paid the ultimate sacrifice, and families were changed forever. #utpol  \n\nhttps://t.co/5K77CzanmJ","date":"Sun Sep 12 01:34:39 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today and every day, we are thankful for those in our communities who have humbled themselves to live in service to those around them. #utpol","date":"Sun Sep 12 01:34:39 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I will be on @kslnewsradio with @BoydMatheson in a few moments talking about my involvement in the National Defense Authorization Act and Care for Her Act. Tune in! #utpol","date":"Fri Sep 10 19:51:13 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"\"Americans should be shouting from the rooftops to stop this steamroller before they wake up to a government that dominates their lives in a country they don't recognize.\" #utpol \n\nhttps://t.co/SW67jxegEY","date":"Fri Sep 10 15:02:56 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Learn more about the WEber Remembers 9/11 event here:\n\nhttps://t.co/wxcohc8x9j","date":"Thu Sep 09 14:56:31 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"What @mrsbrenttaylor and the Major Brent Taylor Foundation have created is sensational. Thank you for remembering and honoring our nation’s sacrificial heroes. #utpol https://t.co/n8U3E68JsG","date":"Thu Sep 09 14:56:30 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"After attending last night's WEber Remembers 9/11 opening event, I strongly encourage all Utahns to visit this interactive and commemorative museum experience today, Friday, or Saturday at the Weber County Fairgrounds. #utpol \nhttps://t.co/5K77CzanmJ","date":"Thu Sep 09 14:56:29 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"An overwhelming majority of my provisions to the National Defense Authorization Act passed through the Armed Services Committee last week, and they will directly impact Davis County’s job growth by funding and maintaining key programs for our national security. #utpol","date":"Wed Sep 08 19:25:57 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was grateful for the chance to speak with Davis County Commissioners about ways I am advocating for the county’s priorities, including on @HASCRepublicans. #utpol https://t.co/JMP4sectGy","date":"Wed Sep 08 19:25:56 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I'm honored to be an original cosponsor for @JeffFortenberry's Care for Her Act. Every child should be given equal opportunities, no matter the circumstances of their conception or birth. I support comprehensive resources for low-income mothers &amp; children.\nhttps://t.co/Zv44boOJZz","date":"Fri Sep 03 20:28:44 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We must empower women by giving them the resources they need to provide healthy, safe, and stable outcomes for their families. #utpol","date":"Fri Sep 03 20:28:44 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We must pass this bill and establish this monument as soon as possible so families and veterans can visit this physical remembrance of their service. #utpol","date":"Fri Sep 03 14:39:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I proudly cosponsored @RepJasonCrow's Global War on Terrorism Memorial Location Act to immortalize the sacrifices made by our nation's heroes as well as honor Gold Star families, including @mrsbrenttaylor and her children in Utah. #utpol \n\nhttps://t.co/kNdGUSOoYG","date":"Fri Sep 03 14:39:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I'm pleased that an overwhelming majority of my provisions were included in the NDAA passed thru @HASCRepublicans last night. Republicans succeeded in reversing @POTUS's harmful defense spending cuts, maintaining a competitive edge over China, &amp; more. \n\nhttps://t.co/uMHXVEc55U","date":"Thu Sep 02 21:15:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I look forward to working with my colleagues to get the NDAA passed so we can provide servicemembers, including those at @HAFB, policies worthy of their immense sacrifices. #utpol","date":"Thu Sep 02 21:15:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Tune into the @HASCRepublicans markup of the National Defense Authorization Act for FY 2022 as we debate this critical legislation &amp; advocate for the resources our service members need to maintain a strong national defense. It’s expected to go until 4am, so settle in 🍿 #utpol","date":"Wed Sep 01 15:15:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"These 13 fallen servicemembers demonstrated profound bravery and an unwavering commitment to our nation. I am proud to cosponsor this legislation to honor their ultimate sacrifice to our country. #utpol","date":"Tue Aug 31 21:17:44 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"There will be a memorial vigil to honor Staff Sergeant Taylor Hoover tomorrow evening at the South Steps of the Utah Capitol Building at 8:30pm. #utpol https://t.co/EeKmD5n4DO","date":"Sat Aug 28 18:21:43 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We just received word that Staff Sgt. Taylor Hoover of UT lost his life to the attack at the Kabul airport yesterday. We’ll be forever grateful for his sacrifice &amp; legacy. He spent his last moments serving our state &amp; nation, &amp; we’ll never forget his unwavering devotion. #utpol","date":"Fri Aug 27 21:28:17 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"To our brave servicemembers: your sacrifices will never be forgotten. You are the greatest representation of America’s strength. #utpol","date":"Thu Aug 26 21:02:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As the situation in Afghanistan becomes more and more heartbreaking, my team and I send prayers to our citizens, troops, and Afghan allies impacted by today’s attacks. Please know our team remains steadfast in supporting however we can. #utpol","date":"Thu Aug 26 21:02:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Weber County, I’ll see you tomorrow night at 7:30pm MT at the Marshall White Center! Be sure to join us for our townhall event. #utpol https://t.co/N12UR4omCz","date":"Thu Aug 26 02:43:06 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m excited to be back in Utah this week for a townhall event in Morgan County tomorrow evening! Please join us at the Morgan County Building Auditorium at 5pm MT. #utpol https://t.co/b7u1nGf4u4","date":"Thu Aug 26 01:46:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"If you need assistance regarding the situation in Afghanistan, please call my Ogden office at 801-625-0107. #utpol","date":"Wed Aug 25 18:49:49 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My team has been working around the clock helping American citizens &amp; our Afghan partners leave Afghanistan. My name may be on the door, but they have been the hands &amp; feet of this effort. My sincerest thanks to my team &amp; every congressional office for doing their part. #utpol https://t.co/v5S44IyaEN","date":"Wed Aug 25 18:49:48 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"There’s a lot going on here in Washington, and I wanted to provide an update on the $3.5T budget bill and what my team is doing to help get Americans and our Afghan partners out of Afghanistan. \n\nWatch the full video update on my Instagram or Facebook pages. #utpol https://t.co/jbEIBuD37H","date":"Tue Aug 24 22:32:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for coming to Utah, @RepWesterman! #utpol","date":"Tue Aug 24 22:18:16 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Regardless of what is happening in Washington, our team is working hard for Americans abroad and at home. #utpol","date":"Tue Aug 24 20:51:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"While our focus needs to be on getting Americans &amp; our Afghan partners out of Afghanistan, the majority is rushing a $3.5T spending bill without debate. This bill will raise taxes &amp; add to our inflation crisis, hurting the middle class &amp; reversing their wage increases. #utpol https://t.co/t55t5mM7dQ","date":"Tue Aug 24 20:51:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Making good use of time and cheering on Utah’s very own @tonyfinaugolf at the Northern Trust tournament while waiting for votes tonight. Huge congrats, Tony!! #utpol https://t.co/4Ir2nChVab","date":"Tue Aug 24 00:04:52 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"❗️Tuesday Townhalls Postponed❗️Since the House has been called into session this week, we unfortunately will have to reschedule tomorrow’s townhall events in Cache &amp; Box Elder Counties. Check my website for an updated schedule in the coming weeks! #utpol \nhttps://t.co/XBotQPi5tG","date":"Mon Aug 23 14:35:13 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read more about the Afghanistan Accountability Act here:\n\nhttps://t.co/rcUtbQBnw7","date":"Sat Aug 21 15:21:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"In addition to the work my team has been doing to bring home our citizens &amp; Afghan partners, we introduced legislation to uncover how this withdrawal from Afghanistan went so wrong &amp; to ensure that a humanitarian and geopolitical crisis on this scale never happens again. #utpol","date":"Sat Aug 21 15:21:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I introduced the Afghanistan Accountability Act to require the intel community to assess the effectiveness of intel &amp; info provided to the President &amp; to impose sanctions on Taliban officials &amp; others threatening peace &amp; committing human rights violations in Afghanistan. #utpol","date":"Sat Aug 21 15:21:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to join us tonight in Summit County! #utpol","date":"Fri Aug 20 20:23:53 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am soon joining @mrsbrenttaylor on @kslnewsradio to talk about the ongoing situation in Afghanistan. Be sure to tune in. #utpol","date":"Fri Aug 20 19:58:32 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We discussed some of the most pressing issues facing our lands, including our ongoing drought, forest and habitat health, energy production and transmission, and more. Thank you for coming to Utah, @RepWesterman! #utpol","date":"Fri Aug 20 15:16:06 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was honored to show Ranking Member of @NatResources Bruce Westerman some of what and who makes Utah’s First District so special. #utpol https://t.co/E02vBiha4g","date":"Fri Aug 20 15:16:05 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to my townhall event in Summit County this Friday! Please join us! #utpol https://t.co/6QOZonawFx","date":"Wed Aug 18 13:50:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Had a packed day in Duchesne County last week visiting the Dollar Ridge area with commissioners, participating in the rodeo, and meeting with local mayors and businesses. Dedicated county days are the best part of this role. #utpol https://t.co/gxfBP6oVm4","date":"Tue Aug 17 23:09:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined my @HASCRepublicans colleagues in sending @POTUS a letter yet again asking for a plan to protect Afghanistan from becoming a safe haven for terror groups. We must protect the Afghan people and our national security. #utpol","date":"Tue Aug 17 21:22:40 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to join us tonight in Davis County! #utpol","date":"Tue Aug 17 17:45:58 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I, along with several officials I met with on the ground yesterday, am grateful @fema approved a Fire Management Assistance Grant to help first responders in Summit and Salt Lake Counties respond to the #ParleysCanyonFire. #utpol","date":"Mon Aug 16 22:26:58 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This funding will help officials and responders mitigate the impacts of this wildfire as it burns through acres of land and and displaces thousands from their homes. #utpol","date":"Mon Aug 16 22:26:58 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for having me! #utpol","date":"Mon Aug 16 21:31:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I'm about to go live on @D2KSL to discuss the situation in Afghanistan. Tune in! #utpol","date":"Mon Aug 16 16:32:28 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Davis County is up next! Join me on Tuesday for a townhall event at Kaysville City Hall at 6pm. I look forward to seeing you there! #utpol https://t.co/RmQFdsKsa3","date":"Mon Aug 16 00:27:14 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"#ParleysCanyonFire response officials just briefed all aspects of the fire. From city, county, state to federal, the response has been exceptional. Thank you to all involved. Follow @UtahWildfire for up-to-date info. #utpol https://t.co/kCv1QiUeBF","date":"Sun Aug 15 18:35:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The President owed it to our homeland security and trapped Afghan families who aided the U.S. government to establish a responsible exit plan, not a desperate evacuation that has left our diplomats, loyal interpreters, and other allies in mortal danger. #utpol","date":"Sun Aug 15 13:56:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"W/ the lack of a residual coalition force, no strategy, &amp; a withdrawal date that was clearly ceremonial, the Taliban has eroded decades of progress in just 4 months. Terrorist safe havens threaten the security of the Afghan people, our regional partners, &amp; US diplomats &amp; troops.","date":"Sun Aug 15 13:56:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am devastated by the Taliban's onslaught on the Afghan people. Our major concerns with @POTUS's hasty withdrawal have come to pass. #utpol \n\nhttps://t.co/DPcKGbSYaW","date":"Sun Aug 15 13:56:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to seeing folks in Duchesne County tonight! Please join us! #utpol","date":"Fri Aug 13 17:58:43 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This is bewildering. While I have served on @NatResources, we have only seen an unwillingness from the Biden admin to work with us on domestic energy solutions, and now they are turning to foreign sources. This greatly disadvantages Utahns and Americans across the country. #utpol","date":"Thu Aug 12 19:09:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My August townhall events kick off Friday in Duchesne County! Join us at 5pm MT at the Duchesne County Commission Chambers to discuss issues that matter most to Utahns. I look forward to seeing you there! #utpol https://t.co/WBNvtlDTmo","date":"Wed Aug 11 20:13:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Utah comes out on top yet again! Proud of the work Utah has done to become an economic powerhouse and model for the rest of the US. I’ll make sure my US House colleagues see this article. 🥇 #utpol \n\nhttps://t.co/hZVo4hn67a","date":"Wed Aug 11 18:30:59 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to tune in! #utpol","date":"Wed Aug 11 12:33:22 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Had a great time in Layton yesterday at the Davis County Farm Bureau picnic! I had informative conversations with leaders in our agricultural community, including Layton Mayor Joy Petro, about drought, labor shortages, farmland preservation, and more. #utpol https://t.co/Cwnb7Qh4NG","date":"Tue Aug 10 21:32:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":".@RepJuliaLetlow is one of the most impressive people I know in Congress, and I deeply appreciate how she is using her story to encourage COVID-19 vaccinations. I echo her call to all who are eligible— get vaccinated so no one has to experience tragedy from the virus. #utpol","date":"Tue Aug 10 00:31:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Family days at @HAFB and the @UtahAirGuard were a huge success! The defense community in Utah is top notch. Many thanks to all our military families! #utpol https://t.co/PgAxl6U8qd","date":"Sun Aug 08 19:51:19 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I'm proud to join my friends @RepSpanberger, @JacksonLeeTX18, &amp; @RepGarbarino, in pursuing cybersecurity policy that equips our law enforcement and cyber warriors to better understand the scope of the cybercrime challenge. Now is the time to act. #utpol\n\nhttps://t.co/VvJJp5gkss","date":"Fri Aug 06 19:45:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am honored to co-lead the Better Cybercrime Metrics Act, a critical first step in helping both government and private industry better understand and address the growing challenge of cybercrime and attacks to our cybersecurity. #utpol\n\nhttps://t.co/zMWKo4wUst","date":"Fri Aug 06 19:45:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congrats to Morgan County for coming in at #9 in @usnews &amp; @CVSHealth's ranking of the healthiest communities in the US! Morgan County's local officials have worked hard to keep their community healthy, especially during this challenging past year. #utpol \nhttps://t.co/65q44Jsh9F","date":"Fri Aug 06 02:27:13 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you, @RaiseFuture, for inviting me to fill 250 backpacks for foster children as they head back to school. Northern UT has an amazing foster care &amp; adoption community, &amp; I was honored to serve today alongside @AbbyPalmerCox, @KatieHeigl, &amp; other community leaders. #utpol https://t.co/L12ut0VBYp","date":"Thu Aug 05 01:33:58 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Utah is experiencing its worst drought in modern history and a rapid uptick in population growth. I spoke on the House floor emphasizing the need to pursue creative water policies that respond to the crises of today while preparing for the challenges of the future. #utpol https://t.co/8CDkw72cyO","date":"Fri Jul 30 20:10:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On #NationalInternDay and every day, Team Moore is grateful for our DC interns Anthony and Ben, and our Ogden intern Kaylei! They are a huge help and have bright futures ahead. #utpol https://t.co/2bvu5z2gJd","date":"Fri Jul 30 02:13:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I thought there was a misunderstanding with this bulletin, but my team verified its legitimacy. I'm a reasonable guy, but threatening to arrest my constituents &amp; staff goes way too far. This is why @SpeakerPelosi can't be trusted to supervise House security &amp; admin procedures.","date":"Thu Jul 29 21:50:49 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Col. Gail Halvorsen epitomizes UT's humanitarian spirit. He brought hope to a German nation suffering from the wrath and destruction of WWII. I'm proud to join my colleagues in honoring his compassion &amp; creativity. #utpol https://t.co/sb7dIwKk4p","date":"Thu Jul 29 16:20:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today is my team’s last day hosting Mobile Office Hours! If you are in Morgan or Summit County, head to my website to see where Team Moore will be ready to answer your questions and hear your concerns. Many thanks to all who have come out! #utpol \n\nhttps://t.co/XBotQPi5tG https://t.co/HCxlz1Ti2m","date":"Wed Jul 28 14:37:43 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Flying back to Miami from Cuba several years ago was the 1st time I recognized firsthand the shocking contrast between communism &amp; free market capitalism. I joined @RepMariaSalazar’s resolution condemning socialism to support the Cuban people as they fight for liberty. #SOSCuba https://t.co/gq3BK6gFGg","date":"Tue Jul 27 14:17:16 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My staff is wrapping up our mobile office hours this week with stops in Weber, Davis, Morgan and Summit counties! Bring your questions, thoughts, and issues with federal agencies straight to Team Moore. Check out my website for more details! \nhttps://t.co/XBotQPi5tG #utpol","date":"Tue Jul 27 01:39:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This is my first bill to pass the House; I’m excited to be a part of this bipartisan win! #utpol","date":"Tue Jul 27 00:31:11 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The House just passed the National Medal of Honor Monument Act without a single no vote! I’m proud to join @RepVeasey as co-lead of this legislation that will authorize the establishment of a monument in DC to honor Medal of Honor recipients &amp; immortalize our nation’s heroes. https://t.co/t0laRngqEH","date":"Tue Jul 27 00:31:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to tune in! #utpol","date":"Mon Jul 26 23:56:22 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy Pioneer Day! Great to celebrate today at Utah’s Days of ‘47 Parade with local officials and community leaders. Hope you and your family have a great holiday! #utpol https://t.co/EKNci6jINB","date":"Fri Jul 23 23:11:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week, I was honored to host a Refugee Roundtable in Utah. Utah has a storied history of accepting refugees and vulnerable peoples into our state, and I support efforts to welcome our Afghan partners into our communities. #utpol","date":"Thu Jul 22 20:26:38 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Since @POTUS's decision to withdraw all troops from Afghanistan, the Taliban’s brutal resurgence necessitates the need to increase the SIV cap, address the existing backlog, and make it easier for Afghan translators and their families to get out of harm’s way. #utpol","date":"Thu Jul 22 20:26:38 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The Afghan Special Immigrant Visa (SIV) program was created to protect the brave translators and contractors that stood with American and coalition forces from retribution from violent extremists. #utpol","date":"Thu Jul 22 20:26:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today the House passed a bill I proudly cosponsored, H.R. 3985, the ALLIES Act of 2021, which upholds promises made to our Afghan partners in the fight against terror. #utpol","date":"Thu Jul 22 20:26:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The FIRESHEDS Act is a great example of how data drives good policy making. This legislation uses cutting edge data, mapping, and research to help us create management policies that keep our forests healthy and communities safe. #utpol https://t.co/Jn1jX9ODBd","date":"Thu Jul 22 16:04:45 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read more about this bipartisan and bicameral legislation introduced alongside @RepCuellar and @SenatorRisch here: https://t.co/o06cNtCFg3 #utpol","date":"Thu Jul 22 16:04:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Over a billion acres of land in the U.S. are at risk for wildfires, and this is a major problem in UT &amp; across the West. I am proud to lead on the FIRESHEDS Act, which would give our land managers the tools they need to better prevent, mitigate, and respond to wildfires. #utpol","date":"Thu Jul 22 16:04:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Great piece from @MeatEaterTV on the MAPLand Act! #utpol https://t.co/GqvBslI1qM","date":"Wed Jul 21 21:42:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"In DC, we're experiencing unusual haziness as a result of wildfires in the west. My deepest thanks to the response teams working to mitigate these wildfires. I encourage all Utahns to do their part in preventing wildfires during this drought season. #utpol https://t.co/RoJe5iHysq","date":"Wed Jul 21 17:39:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week I attended the Ogden Air Logistics Change of Command Ceremony and witnessed Major General C. McCauley von Hoffman relinquish command to Brigadier General Richard W. Gibbs. It is an honor to represent the hardworking men and women at @HAFB in Congress. #utpol https://t.co/v4e6PiMwZ0","date":"Tue Jul 20 21:38:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My staff's Mobile Office Hours start TOMORROW with visits to Rich, Cache, and Box Elder counties. Bring your thoughts, questions, and issues with federal agencies straight to Team Moore. Check out my website for exact times and locations: https://t.co/XBotQPi5tG \n#utpol","date":"Mon Jul 19 18:33:47 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It is imperative that we continue to fight for life and the Hyde Amendment. #HydeSavesLives #utpol","date":"Fri Jul 16 00:46:33 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today the @AppropsDems considered a major funding bill and rejected the inclusion of the Hyde Amendment, the bipartisan agreement in place for over 50 years that prevents taxpayer dollars from paying for abortions. #utpol https://t.co/lpo6sWhzCy","date":"Fri Jul 16 00:46:32 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Since 1976, the Hyde Amendment has saved nearly 2.5M precious lives. #utpol","date":"Fri Jul 16 00:46:32 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Americans across the country of different faiths and values care deeply about this issue. I recently met with the Catholic Diocese, and this was their top concern. #utpol","date":"Fri Jul 16 00:46:32 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I promised my constituents to work across the aisle on legislation that will directly benefit Utahns and Americans across the country, and I am grateful to deliver on this commitment. #utpol","date":"Thu Jul 15 18:08:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"These bills will allow us to enhance an important historical area, improve access to our public lands, and honor our nation’s heroes. You can read more about each bill on my website: https://t.co/tOPCGDVdbO","date":"Thu Jul 15 18:08:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m thrilled to announce that 3 of my bills— the Bear River Heritage Area Study Act, the MAPLand Act, &amp; the National Medal of Honor Monument Act, which I introduced with @RepVeasey— were among the 12 bills unanimously passed through the @NatResources Committee yesterday. #utpol https://t.co/ljtFgLsuio","date":"Thu Jul 15 18:08:17 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Save the date for this event taking place from September 9-11 at the Weber County Fairgrounds. #utpol","date":"Wed Jul 14 22:25:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I had a great meeting with @mrsbrenttaylor and Lynda Cox of the Major Brent Taylor Foundation to talk about their 9/11 remembrance event, WEber Remembers. I appreciate their work honoring our fallen heroes, both local and nationwide. #utpol https://t.co/SVERXg6ExC","date":"Wed Jul 14 22:25:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Had a great day in Daggett County on Friday touring the Dutch John municipal water system and Flaming Gorge recreation area, attending the Cow Country Rodeo, and hosting a county townhall event. Many thanks to all who came and asked questions! #utpol https://t.co/97W0GJgaNm","date":"Mon Jul 12 21:23:53 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I had a great time riding with the Uintah High School Mountain Bike Team, but I stayed in the stands for the Uintah County Rodeo! But I did get to hear some old Bronc riding stories from Rep. Scott Chew. This is such an amazing community! #utpol https://t.co/vC8Zgi7hWI","date":"Fri Jul 09 19:13:23 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join me for my Daggett County townhall event tonight at 5pm MT at the Daggett County Building! I look forward to seeing you there. #utpol https://t.co/uLUCNvk1HF","date":"Fri Jul 09 16:42:19 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks to all who came to my Uintah County townhall! It was a great kick off to my summer townhall events. I enjoyed engaging with you, hearing your concerns, and answering questions. #utpol https://t.co/lkziaGypan","date":"Fri Jul 09 04:27:57 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My team and I continued our Summer Roundtable Series today with a meeting at the Utah State Capitol to talk to community leaders about Utah’s affordable housing situation. #utpol https://t.co/xnhvCLuAhq","date":"Thu Jul 08 00:10:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This is a critical issue and there are many people working on solutions to better improve the livelihoods of Utahns across the state. Thanks to all who participated. #utpol","date":"Thu Jul 08 00:10:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to speaking to folks in Uintah County tomorrow! Please join us! #utpol https://t.co/JgLyzpCKI4","date":"Wed Jul 07 16:01:02 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The Moore crew had an awesome day at the Layton City Liberty Days Parade! 🇺🇸 #utpol https://t.co/97eDx3rSED","date":"Tue Jul 06 00:57:38 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join me on Thursday, July 8th at 5pm MT at the Uintah County Conference Center and Friday, July 9th at 5pm MT at the Daggett County Building. I look forward to seeing you there! #utpol","date":"Mon Jul 05 15:48:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This summer, my team and I are coming to you! I'm thrilled to travel across the 1st District to listen to your thoughts and answer your questions. To kick it off, I'm hosting two in-person townhalls in Uintah and Daggett counties this week, and I'd love for you to attend. #utpol","date":"Mon Jul 05 15:48:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy Independence Day! 🇺🇸 It is an honor to serve the greatest country in the world. Max and I were glad to attend the Park City Police memorial during the Fourth of July festival this morning. I hope you and your family had a fun and safe holiday. #utpol https://t.co/O3EKE9efA0","date":"Mon Jul 05 02:02:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Had a great time at the Kaysville Parade today! Many thanks to all who joined us. 🇺🇸 #utpol https://t.co/skSwc12yKT","date":"Sun Jul 04 00:14:52 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Many thanks to all who tuned in to my telephone townhall last night! I loved engaging with you &amp; answering your questions. Be sure to sign up for my weekly e-newsletter at https://t.co/tOPCGDVdbO to learn more about my in-person townhalls in the First District this summer. #utpol https://t.co/sFNePf1oYa","date":"Thu Jul 01 21:58:24 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to join us TONIGHT at 7pm MT! #utpol","date":"Wed Jun 30 22:10:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to tune in! #utpol","date":"Wed Jun 30 11:35:35 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks to the @UtahBankers for inviting me to speak at their convention. Banking is one of UT’s key industries that continues to support families across the state, especially in the wake of the pandemic. I’m grateful for UBA members’ hard work on behalf of UT families. #utpol https://t.co/11xjOfva5G","date":"Tue Jun 29 00:30:19 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join me for an interactive telephone townhall this Wednesday at 7pm MT! We will talk jobs, immigration, my visits to @HAFB, updates from Washington, and more. Be sure to call in at (833) 305-1678. I look forward to hearing from you on Wednesday! #utpol https://t.co/FDmbdxbK0G","date":"Mon Jun 28 01:38:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As the rescue work continues in Florida, our nation gets another opportunity to see the selfless work of responders and emergency teams. My heartfelt prayers to all those impacted by this tragedy. #utpol","date":"Sat Jun 26 11:10:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We’ll take you on any track, any time. 🛵💨 https://t.co/1Pb7B1FEnh","date":"Thu Jun 24 17:28:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It is essential that we attract and retain qualified and skilled veterans in our civilian workforce. #utpol","date":"Wed Jun 23 19:54:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday I proudly introduced the Retain Skilled Vets Act w/ @SenatorLankford to provide a pathway for most military vets to immediately transition to civilian work &amp; use their invaluable knowledge &amp; skills to make our federal workforce stronger. #utpol \nhttps://t.co/IXBrI8ssLi","date":"Wed Jun 23 19:54:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Industry is working hard to prioritize conservation and environmental stewardship while promoting economic growth and maintaining low energy costs for American families. I am excited about the great work we will accomplish on behalf of Utah and the nation. #utpol","date":"Wed Jun 23 17:07:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m thrilled to be a part of the new @climate_caucus — many thanks to @RepJohnCurtis for organizing &amp; leading this effort. For too long the majority has villainized the private sector, and it is time that conservatives better highlight our balanced, productive solutions. #utpol https://t.co/OKHcMKMDv2","date":"Wed Jun 23 17:07:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Many thanks to my family, staff, and colleagues for making my first birthday in Congress a great one! Here’s to another year! #utpol https://t.co/jkS2RvpaFq","date":"Wed Jun 23 03:38:16 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@NatResources Thank you!","date":"Tue Jun 22 19:30:58 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy #FathersDay to a great dad and an even better grandpa! #utpol https://t.co/DnutWfsMnc","date":"Sun Jun 20 22:37:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Gettysburg has been a bucket list item for a while, and it was great to visit this weekend and celebrate Juneteenth becoming a federal holiday. #utpol https://t.co/PRSIKLBFQn","date":"Sun Jun 20 01:21:02 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepBice Thank you!","date":"Thu Jun 17 18:31:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepLisaMcClain Thank you!","date":"Thu Jun 17 16:20:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepMikeRogersAL Thank you!","date":"Thu Jun 17 15:42:56 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepMMM Thank you!","date":"Thu Jun 17 14:57:23 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@SenMikeLee Thank you!!","date":"Thu Jun 17 14:49:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepYoungKim Thank you!!","date":"Thu Jun 17 14:16:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepMeijer Thank you!","date":"Thu Jun 17 14:03:53 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepFeenstra Thank you!!","date":"Thu Jun 17 14:03:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The blue Gatorade says it all... Team Moore is growing! Excited to welcome boy #4 to our bunch later this year. 👶🏼 #utpol https://t.co/jL4wedWZlo","date":"Thu Jun 17 13:15:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congrats to @SaltLakeCC’s soccer teams for winning first and second place at nationals! Oh, and I also chatted workforce development policy with President Deneece Huftalin and VP of Government Relations Tim Sheehan. Go Bruins! #utpol https://t.co/ZqN6StYxDA","date":"Wed Jun 16 23:01:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I visited the @WeberMorganHD mass vaccination site in March and was thoroughly impressed by the volunteers' dedication to efficiently vaccinating as many northern Utahns as possible. Thank you for your impact! #utpol","date":"Wed Jun 16 19:45:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Votes are more fun when these two tag along! #utpol https://t.co/123ZS4KDN7","date":"Wed Jun 16 13:42:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I spoke on this bill at today’s @NaturalResourcesGOP hearing, which would authorize the Secretary of the Interior to conduct a study to determine its suitability for designation as a National Heritage Area. #utpol","date":"Wed Jun 16 02:04:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am pleased that this bill enjoys significant local support in both Utah and Idaho, and I urge my colleagues to support this important legislation. #utpol","date":"Wed Jun 16 02:04:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The Bear River area has long been an important part of Utah and Idaho’s shared history, and I was proud to introduce the Bear River Heritage Area Study Act with my friend @CongMikeSimpson. #utpol https://t.co/vhiMHNUh7I","date":"Wed Jun 16 02:04:35 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy #FlagDay, America! 🇺🇸 Today we honor our nation’s symbol of freedom and opportunity. #utpol","date":"Tue Jun 15 00:51:29 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined my fellow House Depot Caucus Co-Chair @RepCheri in sending a letter to @SpeakerPelosi requesting that depot facilities be included in any upcoming infrastructure package. #utpol \n\nhttps://t.co/45PBdGf3IJ","date":"Fri Jun 11 15:34:55 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Much of the work happening in UT-01 to sustain the @usairforce's readiness is done in antiquated WW II-era facilities. While the professionalism &amp; expertise of our workforce exceeds high standards of readiness, maintenance backlogs are increasing costs &amp; hurting morale. #utpol","date":"Fri Jun 11 15:34:55 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This @WSJ article highlights the urgency for the U.S. to lead out on this issue and share extra #covidvaccines to allies like India and other developing nations. A return to normalcy and an end to this pandemic will require global cooperation. #utpol \n\nhttps://t.co/KWwEKlc2vb","date":"Thu Jun 10 20:29:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This is a great opportunity for a collaborative and legislative solution. #utpol","date":"Thu Jun 10 00:37:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined the Utah delegation in requesting a meeting with @POTUS to discuss @SecDebHaaland's report on the Bears Ears and Grand Staircase-Escalante national monuments before he makes his final decision. #utpol https://t.co/HOCGKvryi7","date":"Thu Jun 10 00:37:03 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to join us tonight! #utpol","date":"Tue Jun 08 21:32:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was thrilled to speak during the @NaturalResourcesGOP hearing on the MAPLand Act today. This legislation will allow Americans to better access and enjoy the great outdoors, and I am honored to promote this effort. #utpol","date":"Tue Jun 08 21:27:13 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The bipartisan MAPLand Act would bring mapping records into the 21st Century by digitizing paper files and modernizing our record systems so fishers, hunters, bikers, and all who seek to enjoy our federal lands have better access to the information they need. #utpol https://t.co/YyOZnArd1w","date":"Tue Jun 08 21:27:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m grateful to engage with and learn from the great folks at @northropgrumman— thanks for all you do! #utpol","date":"Tue Jun 08 00:13:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The First District is lucky to have @northropgrumman as a vital member of our business and military communities. NG has put Northern Utah on the forefront of aerospace and composite work while employing thousands of Utahns and boosting our economy. #utpol https://t.co/gRadMUC2Wu","date":"Tue Jun 08 00:13:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On June 6th, 1994, the 50th anniversary of D-Day, I visited Normandy with my grandfather, a WWII veteran. A customs official signed my passport, and it is still one of the greatest and most meaningful memories of my life. #utpol https://t.co/DmH46bcgw3","date":"Sun Jun 06 20:07:51 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Our state and federal delegations supported this effort in 2017, and I am pleased to see it come to life. Many thanks to @JaniIwamoto for her work on this important project. #utpol","date":"Sat Jun 05 18:22:54 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Americans will always remember those who sacrificed and fought for our freedoms. I join in celebrating the Go For Broke Soldiers commemorative postage stamp to honor the Japanese Americans who served in WWII. #utpol","date":"Sat Jun 05 18:22:54 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Our public safety officials work around the clock to keep the Weber-Ogden community safe, and I am grateful for their brave and dedicated service. #utpol","date":"Fri Jun 04 03:01:29 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On Friday, I attended a commemoration ceremony in Ogden to honor the life of Nathan Lyday one year after he passed away in the line of duty. His sacrifice will never be forgotten. #utpol https://t.co/JR0bvyrrH1","date":"Fri Jun 04 03:01:28 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I also met with Sheriff Ryan Arbon at the Weber County jail to hear about his team’s current challenges and priorities. #utpol https://t.co/15Oj3szzXp","date":"Fri Jun 04 03:01:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am thankful for the opportunity to meet some of the public safety officials who do great work for the Weber-Ogden community. Last week, I visited the Francom Public Service Center in Ogden to meet with leaders from our police and fire departments. #utpol https://t.co/QWzZjnXDhF","date":"Fri Jun 04 03:01:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today I had the opportunity to visit @KIHOMAC, a veteran owned company that creates a variety of products essential to @HAFB, including the F-35 Advanced Travel Pod. Many thanks to Kihomac for hosting me and supporting Team Hill! #utpol https://t.co/RlL2fzQ2lO","date":"Tue Jun 01 21:34:17 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today we honor and remember those who gave their lives to protect our freedoms. Our military’s sacrificial spirit is the heartbeat of our nation, and we are eternally grateful for their service. #utpol https://t.co/rK1RumLCY0","date":"Mon May 31 20:59:07 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Great to meet with @USAClimbing and the Utah Office of Outdoor Recreation at the World Cup being held this weekend in Utah. Go USA! #utpol @BusinessUtah https://t.co/XmDuCVO7ZJ","date":"Sun May 30 00:37:54 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This would elevate this important land to a more distinguished classification, protecting local heritage and boosting the area's tourism industry. #utpol","date":"Sat May 29 01:27:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Those familiar w/ the Bear River area appreciate its rich cultural &amp; historical heritage. I'm proud to introduce the Bear River Heritage Area Study Act w/ @CongMikeSimpson, which would be a first step in establishing the Bear River Heritage Area. #utpol \nhttps://t.co/KA3EzwwwTs","date":"Sat May 29 01:27:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Americans deserve to know the origins of COVID-19. This virus devastated our families &amp; communities. I proudly signed on to this letter requesting committee chairs to investigate China's role in the pandemic's spread. We must seek accountability. #utpol  https://t.co/nyRQjdWL0Y","date":"Fri May 28 19:42:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Many thanks to @RonWyden, @RepDebDingell, @RepDerekKilmer, and @repdonyoung for their support on this important effort. #utpol","date":"Fri May 28 18:03:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday I was proud to introduce the bipartisan Recreation Not Red-Tape Act with my colleagues to streamline our permitting processes and give our federal agencies the tools they need to respond to the major surge in outdoor recreation nationwide. #utpol https://t.co/zNUDMSKCny","date":"Fri May 28 18:03:33 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Honoring our military is one of my priorities in Congress, &amp; it’s a privilege to be part of the bipartisan National Medal of Honor Act &amp; do just that. We salute our nation’s heroes every day, but especially during this Military Appreciation Month. #utpol \n\nhttps://t.co/YCmZBlMW0N","date":"Wed May 26 14:25:19 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I had a great conversation on @ABC4GMU this morning about my first months in office and the work my team and I have been able to accomplish. Thanks for having me on! #utpol\n\nYou can watch the full interview here: https://t.co/yrPnaKZzBn https://t.co/cn9JNEmzOU","date":"Tue May 25 22:32:06 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On Friday, I toured the Huntsville monastery with property managers and members of the Ogden Valley Land Trust. We discussed their efforts to preserve this historic site, which was established by WWII veterans in 1947. #utpol https://t.co/9qIZlxBUiy","date":"Sun May 23 17:10:33 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Many thanks to the @KemGardnerInst for putting together this comprehensive report on race, ethnicity, and sex in Utah. Knowledge is power, and we will be able to better lead Utah with this critical information. #utpol \n\nhttps://t.co/jFp5MpYhbO","date":"Mon May 17 21:52:38 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am proud to support our men and women in uniform every day, but especially on #ArmedForcesDay. Thank you for your sacrifice and commitment to defending our nation. #utpol","date":"Sun May 16 02:27:51 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for stopping by! Go Aggies! #utpol","date":"Sat May 15 12:26:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined @BoydMatheson today to talk about something that really frustrates me- liberal and conservative cable media distorting reality. We all know it happens, and I hope my commentary provides a unique perspective. #utpol\n\nhttps://t.co/dVRBShK2TJ","date":"Thu May 13 22:42:51 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This morning I joined my @HouseGOP colleagues and rode with police officers to the National Law Enforcement Officers Memorial. Together we honored the sacrifices of those who have lost their lives to protect their communities. #NationalPoliceWeek #utpol https://t.co/ChJxZBOrpf","date":"Thu May 13 19:38:59 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"If we continue to criticize and demonize our police officers as a whole, we may find ourselves in a position where good, honorable men and women- professionals like fallen Ogden Officer Nathan Lyday- are no longer willing to wear the badge. #utpol","date":"Thu May 13 01:47:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am proud to support our nation’s police officers during this #NationalPoliceWeek. We must reject the narrative that the actions of a dishonorable very few should dominate how we view our police force. #utpol https://t.co/yR9fNTnxz9","date":"Thu May 13 01:47:45 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am firm in my support of Israel and their ability to defend themselves. The US will continue to stand up for Israel. There has been so much to celebrate recently with Israel and Arab states forming diplomatic relations- we must ensure that continues. #utpol","date":"Tue May 11 23:43:30 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read the full press release here:\nhttps://t.co/OJlikuO6LV\n\n@RepRussFulcher @RepJoeNeguse @RepKimSchrier #utpol","date":"Tue May 11 21:26:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I'm proud to sponsor the bipartisan MAPLand Act, which would digitize tens of thousands of land access data records to ensure that all who seek to enjoy our federal lands have access to the info they need to fully experience our country's natural wonders. #utpol","date":"Tue May 11 21:26:07 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I spent the last 2 weeks meeting w/ industry leaders, &amp; I heard their need for workers loud &amp; clear. I support @GovCox's efforts on this &amp; will continue to advocate for the 1st District's job opportunities as we get Utahns back in the workforce. #utpol \nhttps://t.co/jYjTtcoynM","date":"Mon May 10 16:09:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am committed to advocating for the First District’s interests and will continue to vocalize my concern for excessive federal spending that is stalling Utah’s economic rebound and growing our national debt. #utpol","date":"Fri May 07 21:06:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The jobs are there, but enhanced federal unemployment benefits are paying people an additional $300 per week on top of regular unemployment benefits to stay out of the workforce. These checks will continue through August despite Utah’s surging workforce opportunities. #utpol","date":"Fri May 07 21:06:19 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"In UT, our kids are back in school, vaccines are widely available, &amp; our businesses have opened their doors. While federal unemployment bonuses may make sense for states still under mandated shutdowns, these sweeping federal payments are undercutting UT’s economic growth. #utpol","date":"Fri May 07 21:06:19 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This week, I had the privilege of meeting with several members of Utah’s business community. While their businesses offer a diverse range of services and products, their greatest concern was the same: there are not enough workers to fill their job vacancies. #utpol https://t.co/9Nr4LbYqLu","date":"Fri May 07 21:06:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Earlier this week, I joined @AveloAir for their ribbon cutting event at the Ogden-Hinckley Airport. As we look to revive our tourism industry, we are grateful to have Avelo as an affordable and accessible option for travelers. #utpol https://t.co/5cR62QhLYS","date":"Fri May 07 15:12:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I spoke with @D2KSL about the positive impact this will have on our community- be sure to take a listen! #utpol \n\nhttps://t.co/ci3QHHg1wl","date":"Fri May 07 15:12:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I'm honored to join my colleagues on the Bipartisan Wildfire Caucus in requesting funds that will provide Utah's firefighters and land managers the resources they need to ensure we effectively prevent and mitigate the devastating effects of wildfire. #utpol","date":"Thu May 06 21:12:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was an honor to greet and welcome Dr. Biden to the greatest state in the Union! I hope you enjoyed your time here, @FLOTUS. Thank you for visiting. #utpol \n\nhttps://t.co/QkJaYTWt5e \n\n(Photo credit: @DeseretNews) https://t.co/HPuEs5KfvR","date":"Thu May 06 17:21:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for hosting me for a tour of your impressive facility, @Lifetime! I enjoyed meeting the team and learning about your daily manufacturing &amp; distribution operations. This company is a true Northern Utah success story! #utpol https://t.co/Vo2yShONLi","date":"Wed May 05 17:39:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday I had the opportunity to speak to students in the advanced debate program at Mount Ogden Junior High, where I attended years ago. I was blown away by their questions, and my big takeaway is that our future is bright! Go Rams! #utpol https://t.co/xxXVgYO0tJ","date":"Tue May 04 16:00:40 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congrats, @research_usu! Go Aggies! #utpol","date":"Tue May 04 15:22:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It’s been a great first 100 days in Congress representing Utah’s First District! My team and I are proud of the work we have accomplished on your behalf, and we look forward to what the next 100 days will bring. It is a privilege to serve you. #utpol https://t.co/7D7zvrP0t3","date":"Sat May 01 14:10:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"A big highlight was touring the expansion project at Mike’s Market. After years of serving Rich County, Mike’s Market will soon become the area’s first full-size grocery, complete with a bank, hardware store, and coffee shop. I look forward to visiting again soon! #utpol https://t.co/hZm9FkzpKk","date":"Fri Apr 30 14:40:29 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday was a great day in Rich County! I enjoyed meeting with local leaders to learn about the area’s goals and priorities. #utpol https://t.co/sNaznetJQI","date":"Fri Apr 30 14:40:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read my full statement on tonight's joint address here: https://t.co/cj7AigkGir #utpol","date":"Thu Apr 29 02:55:02 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Since my 1st day in office, I've looked forward to working w/ @POTUS &amp; finding common ground on issues including immigration, infrastructure, &amp; economic recovery. But despite his calls for unity, President Biden has not exemplified the values or principles on which he ran. #utpol","date":"Thu Apr 29 02:55:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I applaud and echo @SenatorTimScott's outlook for America's future. Americans need us to work together now more than ever, and I am committed to focusing on the future of our nation and advocating for the interests of northern Utah. #utpol","date":"Thu Apr 29 02:55:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"His EO halting oil &amp; gas leases has threatened the livelihoods of Utahns living in our rural communities, and his corporate and federal tax hikes will stunt our nation's economic growth. @POTUS's first 100 days have revealed one of the most partisan admins in our history. #utpol","date":"Thu Apr 29 02:55:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I appreciated listening to @POTUS's vision for America, but I have grave concerns about his agenda items that will adversely impact Utah's First District and Americans across the country. #utpol","date":"Thu Apr 29 02:55:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The fight against COVID-19 has no borders. It is in the best interest of the @WHO to allow Taiwan to participate in the World Heath Assembly. Taiwan has demonstrated its commitment to helping other nations fight the pandemic, and we must do our part to #LetTaiwanHelp. #utpol https://t.co/WvezgG9c7y","date":"Tue Apr 27 17:19:54 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@KaliNicole4 @NickSSolheim Saddle up everyone, we’ll do a monument night ride 🛵","date":"Sun Apr 25 01:58:17 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am proud to join my colleagues in calling for the @UN to immediately implement an arms embargo against the Burmese military. The entire international community should be united in this. #utpol","date":"Fri Apr 23 21:35:30 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy #EarthDay! UT is home to some of America's most beautiful natural wonders. I'm excited to support @BusinessUtah's Every Kid Outdoors Initiative, which encourages kids to spend time outside for better well-being &amp; development. Get outside today! https://t.co/1eaW6t5sQI","date":"Thu Apr 22 22:16:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"With respect to today’s verdict: I am grateful justice has been served in what I believe was a fair trial. I sincerely hope we can use this critical moment to better listen and build respectful dialogue as we seek unity across our nation. #utpol","date":"Wed Apr 21 00:18:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks to all who joined us for our radio townhall event with @KVNUftp! I enjoyed engaging with you and answering your questions. You can listen to the full townhall event here: https://t.co/sSh5O5N2vx #utpol","date":"Tue Apr 20 17:41:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am honored to have my Forest TECH Improvement Act included in the bipartisan #TrillionTreesAct as we strive to reach our goal of restoring 1 trillion trees by 2030. Thank you for your leadership on this critical effort, @RepWesterman! #utpol","date":"Mon Apr 19 21:57:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join us tonight at 5pm MT! #utpol","date":"Mon Apr 19 16:59:56 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today I had the privilege of participating in the @MaloufFdn Human Trafficking Policy &amp; Education Summit. I was honored to meet survivors of trafficking and @JohnRichmond1 and talk about ways to promote education and awareness across UT. #utpol https://t.co/0Ca0uvqyS4","date":"Sun Apr 18 00:53:57 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I thank the @MaloufFdn for their impactful work. #utpol","date":"Sun Apr 18 00:53:57 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I worked w/ @TheBushCenter prior to joining Congress, &amp; I’m encouraged by its leadership on immigration. This op-ed by George W. Bush communicates a positive &amp; productive way forward, and I’m committed to being part of this vision. Thank you, #43! #utpol https://t.co/vBOseW5m8E","date":"Sat Apr 17 12:11:51 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Vespas are infrastructure? #utpol https://t.co/ogpbk6I5P5","date":"Fri Apr 16 17:52:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"By incentivizing the use of innovative tech in our reforestation efforts, we can mitigate catastrophic wildfires, improve wildlife habitats, &amp; reach our goal of planting 1T trees worldwide by 2030. Read my op-ed with @RepWesterman. https://t.co/w4Uoe78Mvh #utpol @NatResources","date":"Thu Apr 15 22:34:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Earlier this week, I had the great opportunity to tour the Utah Test and Training Range at @HAFB. My team and I enjoyed learning about the UTTR’s missions and complex infrastructure. Thanks for having us, Team Hill! #utpol https://t.co/Gckp3Caop6","date":"Thu Apr 15 21:55:44 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"#utpol https://t.co/raawpwZvQY","date":"Wed Apr 14 22:17:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am thrilled to introduce the Forest TECH Improvement Act as we seek to integrate innovative technology into our critical reforestation efforts to quickly plant more trees, accurately track growth rates, &amp; effectively manage our forests. #utpol https://t.co/GmQQCJ8VkR","date":"Wed Apr 14 22:17:14 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am proud to be an original cosponsor of the Wage Equity Act to support working women across Utah by upholding equal pay for equal work. This bill pushes businesses to eliminate pay discrimination and empowers women to negotiate wages with their employers. #utpol","date":"Wed Apr 14 01:27:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today we pay our respects to Officer Billy Evans, a true hero who devoted his life to protecting the US Capitol and all who work here. We are deeply grateful for his sacrifice and send our condolences to his family. #utpol","date":"Tue Apr 13 19:44:16 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am honored to serve as Co-Chair of the Congressional Future Caucus and advocate for millennial interests in Utah’s First District &amp; around the country. Congress needs to put country first and forge bipartisan agreements on budgets, infrastructure, immigration, &amp; growth. #utpol","date":"Tue Apr 13 13:59:56 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"United as the Utah delegation, we strongly support Congress making these land designation decisions because legislation is the only way to give a voice to all stakeholders. #utpol\n\nRead our delegation op-ed:\n\nhttps://t.co/ZdjTj5NT9X","date":"Sat Apr 10 00:37:52 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We continue to urge the Admin to work with us on national monument designations to craft a collaborative plan that reflects the input of the people most directly impacted &amp; ends the political back-and-forth. #utpol\n\nRead our full delegation statement:\nhttps://t.co/TP3SNlC8Vt","date":"Fri Apr 09 19:30:29 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was a privilege to tour the Bears Ears National Monument today with @secdebhaaland, @govcox, @LGHendersonUtah &amp; @senatorromney. We are hopeful for a balanced and collaborative solution to this land designation. #utpol https://t.co/2FELh3h7Io","date":"Fri Apr 09 01:50:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The Utah delegation had a productive meeting with @SecDebHaaland regarding the Bears Ears and Grand Staircase-Escalante National Monument land designations. We are grateful for her time and efforts as we seek a collaborative and balanced solution. #utpol","date":"Fri Apr 09 01:32:54 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"\"We ask our nation's largest corporations to act credibly and refrain from boycotting states in order to maintain a productive national discourse.\"  \n\nRead my joint statement with @RepChrisStewart on corporate responses to Georgia's voting law: \n\nhttps://t.co/Ie8O9twcD5","date":"Tue Apr 06 20:26:48 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Adoption can be emotionally, physically, and financially challenging, and the resources that will be made available through the Improving Adoption Outcomes and Affordability Act will help alleviate these difficulties. #utpol","date":"Tue Apr 06 18:53:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congrats to the Ogden Air Logistics Complex at @HAFB  for winning the 2020 Maintenance Effectiveness Award! Team Hill works hard to effectively manage their equipment and aircraft, and they are well deserving of this distinguished honor. #utpol\n\nhttps://t.co/qhBxytMz6D","date":"Mon Apr 05 21:01:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"April 4th in Utah is Dan Jones Day. I had the pleasure to both take his Political Science course and work with him for seven years. He’s a legend in Utah politics and greatly missed! #utpol https://t.co/nmWKZOtjm6","date":"Mon Apr 05 02:08:40 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"He is Risen! Wishing you and your family a wonderful Easter Sunday. #utpol","date":"Sun Apr 04 15:01:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"For #AutismAwarenessMonth, I’d like to give a sincere thank you to the community that has supported my son Winnie! #utpol https://t.co/yX46YDg47E","date":"Sat Apr 03 16:21:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The news from the Capitol is heartbreaking. Our @CapitolPolice have been through way too much this year, and they continue to sacrifice for our protection. My sincerest condolences to the families of the fallen and injured officers. #utpol","date":"Fri Apr 02 19:46:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Utahns in Summit County are excelling in their business ventures and humanitarian efforts, and I am grateful to support them in Congress. #utpol","date":"Tue Mar 30 20:55:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I stopped by the @abilitycenter, which serves over 7,000 individuals to get them involved in over 20 adaptive recreational experiences, including rafting, camping, and rock climbing. #utpol https://t.co/J5Jm7YBh3K","date":"Tue Mar 30 20:55:03 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I then visited @skullcandy’s state of the art headquarters. Skullcandy’s founders came up with the idea for the audio accessory brand while on a chairlift in Park City, and their business is committed to sustainability, activism, and their love of music. #utpol https://t.co/ztkQ83uygS","date":"Tue Mar 30 20:55:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday was a great day in Summit County! I first met with Summit Co. commissioners to learn about the area’s current challenges and priorities. They are doing great work to ensure Summit Co. recovers economically in the wake of COVID-19. @VisitParkCity #utpol https://t.co/OVg61b4Umb","date":"Tue Mar 30 20:54:59 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Surrendering critical manufacturing capabilities and losing our position as the world’s No. 1 innovator would erode our ability to hold the CCP accountable and defend our free system. Read my full joint op-ed here:\n\nhttps://t.co/VX9UgWYTNr #utpol","date":"Tue Mar 30 18:41:07 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was great to speak with students yesterday at @USUAggies! I appreciate their political engagement and interest. Special thanks to Aaron Oborn for inviting me. Go Aggies! #utpol https://t.co/2vYmO2KIiv","date":"Sat Mar 27 23:43:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today, I went to Logan’s @walmart &amp; @samsclub to speak with pharmacists coordinating their joint vaccine operation. Utahns are doing their part in our fight against COVID-19, and I am grateful for their efforts. #utpol https://t.co/RhLOepgpI0","date":"Sat Mar 27 01:09:40 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The First District is doing great work to vaccinate northern Utah! Yesterday, I visited the @WeberMorganHD vaccine clinic where they administer 60-70 COVID vaccines every 15 mins. #utpol https://t.co/TRb7r19Eud","date":"Sat Mar 27 01:09:39 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was an honor to welcome Acting Secretary Roth to @HAFB yesterday. Team Hill did an incredible job sharing information about their impressive daily operations and contributions to the defense community. Thanks to all involved. #utpol @SecAFOfficial https://t.co/bDA0S4kv0W","date":"Thu Mar 25 22:28:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today we celebrate #NationalMedalOfHonorDay to acknowledge those who have gone above the call of duty to protect our nation. We are deeply grateful for the heroism and bravery displayed by Medal of Honor recipients. #utpol @MohMuseum https://t.co/7yD2r9VIq0","date":"Thu Mar 25 20:33:38 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I also visited @Storm_Nation in Brigham City and tested out their newest bowling balls. And yes, that was a strike! #utpol https://t.co/tRRNVaEtOG","date":"Tue Mar 23 18:45:06 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday was a great day in Box Elder County! I enjoyed meeting with Weber Basin Water Conservancy District Trustees and Box Elder Commissioners to learn about their current priorities. #utpol https://t.co/UeQi6Tfny7","date":"Tue Mar 23 18:45:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The recent violence in GA and CO is senseless and horrific. I wish these families comfort during this time of grief and loss. A sincere thank you to the responders and to Officer Eric Talley and his family for his heroic service. #utpol","date":"Tue Mar 23 16:51:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Well done, Red Raiders. Go get 'em! @RepArrington","date":"Fri Mar 19 20:10:05 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today, a bipartisan resolution passed the House to condemn the military coup in Burma. I was a proud cosponsor of the bill, and I stand with the people of Burma in their fight for freedom and democracy. #utpol","date":"Fri Mar 19 00:57:56 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined @westerncaucus members in sending a letter to @POTUS expressing concern over the ambiguity of the \"30 by 30\" initiative. We value responsible stewardship of our lands, &amp; we remain hopeful for a bipartisan solution that prioritizes conservation &amp; multiple use #utpol","date":"Thu Mar 18 15:44:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read our joint delegation statement here:  \nhttps://t.co/ptrEZFaGjN #utpol","date":"Thu Mar 18 00:18:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am very excited @SecDebHaaland has agreed to visit Utah prior to making a decision on the monument designations. I look forward to working with the Biden admin, my delegation colleagues, and stakeholders in Utah on a legislative solution for these important areas. #utpol","date":"Thu Mar 18 00:18:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Immigration reform is an opportunity for collaboration, &amp; I believe in aspirational, pro-growth, &amp; inclusive proposals that strengthen the US. I am proud to join @RepMariaSalazar to craft compassionate &amp; workable reforms to welcome legal immigrants while protecting US jobs #utpol https://t.co/BNXA3r5COz","date":"Wed Mar 17 16:52:54 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you, Captain Matt Schnappauf, for gifting our office a @USNavy crest! This will hang proudly in my office. It is an honor to support our armed services in Congress. #utpol https://t.co/cZCXxcEWTa","date":"Tue Mar 16 23:04:06 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I joined fellow Depot Caucus co-chair @RepCheri in sending @POTUS a letter advocating for military arsenals, depots, and ammunition plants to be included in our nation's supply chains &amp; defense strategy. Read our joint release &amp; full letter here: https://t.co/tYj5X9Vb6R #utpol","date":"Mon Mar 15 18:41:07 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Great news! All veterans in Utah enrolled in VA healthcare are eligible to schedule their COVID-19 vaccine. To register, call (801) 582-1565 ext. 5657. Visit the @vasaltlakecity site for more information: https://t.co/s3HxK9IaI1 #utpol","date":"Mon Mar 15 15:59:22 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read the joint release here: https://t.co/mpOVYHSs9V #utpol","date":"Thu Mar 11 22:34:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Our government works best when we listen to those impacted by major decisions such as these, and it is my hope that the Biden Administration will include Utah’s local and state leaders in these important conversations in the future. #utpol","date":"Thu Mar 11 22:34:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was grateful for the opportunity to discuss a legislative solution for national monument designations with @Interior. The Bears Ears &amp; Grand Staircase monument designations were decided upon by unilateral executive action without any meaningful input or consultation from UT.","date":"Thu Mar 11 22:34:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We’re live with @SenMikeLee! Join our townhall event at https://t.co/Vh8w64V5oJ #utpol https://t.co/3Qyjx79jdW","date":"Thu Mar 11 01:21:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Utah tops all 50 state economies in the latest @usnews ranking! This is great news for the Beehive State. Utah continues to lead the way and provide pathways for businesses and individuals to thrive. #utpol \n\nhttps://t.co/1Y7RmSUklH","date":"Wed Mar 10 16:29:40 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am proud to cosponsor the bipartisan National Medal of Honor Monument Act with @RepVeasey that will begin the process of elevating the Medal of Honor to its proper place in our nation's capital. Read our full release here: https://t.co/8Llm0GmCSO #utpol","date":"Wed Mar 10 14:45:24 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to working with @RepCheri on the bipartisan House Depot Caucus! #utpol \n\nhttps://t.co/gffjjpUPDl","date":"Wed Mar 10 01:09:07 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As our population continues to grow, we must commit to creative approaches that ensure our infrastructure is ready. The TRAIN Act is a great example of how resourceful thinking will enable Utahns to travel more safely, quickly, and efficiently. #utpol","date":"Tue Mar 09 03:43:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am excited to co-chair the bipartisan House Military Depot &amp; Industrial Facilities Caucus with @RepCheri as we seek to ensure depots across the country receive the investment they need. Full press release here: https://t.co/GkYhA36MFN #utpol","date":"Mon Mar 08 21:42:52 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This role will allow me to further advocate for @HAFB &amp; our nation's defense community at large. #utpol","date":"Mon Mar 08 21:42:52 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"As I included in my newsletter, this article from @utahpolicy gives a great comparison of state vs federal approaches in recent budgeting decisions. I know which one I prefer. #utpol \n\nhttps://t.co/YawEPVLuCg","date":"Mon Mar 08 18:47:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week @SteveScalise gifted my office a custom plate. This week he surprised us with a Louisiana King Cake! Thank you for the warm welcome and support, Whip Scalise! It’s an honor to serve alongside you. #utpol https://t.co/ZVJR49b9vW","date":"Fri Mar 05 21:09:13 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Full @fox13 story: https://t.co/gJwOmla3N5 #utpol","date":"Thu Mar 04 21:03:29 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The moratorium on oil and gas leases threatens the livelihoods of Utahns in the energy industry. The process in which we transition to cleaner energy must protect their jobs and wages, and I will use my position on the @NatResources to advocate for their interests. #utpol https://t.co/MkM3XXIP32","date":"Thu Mar 04 21:03:29 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I had a great conversation with @RepWesterman on @BoydMatheson's radio show about our joint op-ed and the need for increased collaboration on @NatResources. Check it out! #utpol  https://t.co/17iJ8jihc5","date":"Thu Mar 04 02:40:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@thenextvinnie We are working on posting it to my website. Keep an eye out for it soon!","date":"Wed Mar 03 21:18:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you to all who joined us for tonight’s telephone townhall event! I loved engaging with you and addressing your questions. If you had a question we were unable to get to, please reach out to our district office at (801) 625-0107. #utpol","date":"Wed Mar 03 04:54:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to sign up for our weekly e-newsletter to stay updated on upcoming townhalls and other events. #utpol https://t.co/3WPtYezd1K","date":"Wed Mar 03 04:54:34 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join us at 7pm MT tonight! I look forward to hearing from you soon! #utpol","date":"Wed Mar 03 01:37:39 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Great news coming out of Ogden! Northern Utah continues to answer the call to fight the COVID-19 pandemic. #utpol @standardex @timvandenack   https://t.co/kvqC5nz0pk","date":"Tue Mar 02 23:49:19 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The highlight of my day! It was great to spend the morning reading with students to celebrate Read Across America Day. #utpol","date":"Tue Mar 02 20:05:58 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Ranking Member @RepWesterman and I are committed to putting productivity over partisanship on @NatResources to deliver meaningful results for our constituents #utpol @DeseretNews  https://t.co/QjvyzoLm9M","date":"Mon Mar 01 20:05:45 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I encourage election officials across the US to follow @WeberCounty’s strong example. #utpol","date":"Mon Mar 01 18:54:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week I was honored to introduce @RickyHatchUT, Weber County’s Clerk and Auditor, to @HouseAdminGOP’s hearing on election security. It was a privilege to speak on Ricky’s invaluable work to ensure elections are fair, inclusive, and secure. #utpol https://t.co/QIx2YC6Y2b","date":"Mon Mar 01 18:54:15 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Shortly after his commissioning into the Navy Reserves at age 48, he deployed to NYC and used his medical background to respond to the COVID-19 crisis. Michael Hall embodies Ogden’s giving spirit, and we thank him for his service. #utpol","date":"Mon Mar 01 03:11:49 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Last week, I had the privilege of honoring Lieutenant Commander Michael J. Hall on the House floor for his service to his community, country, and the fight against COVID-19. #utpol https://t.co/e20kuk1oFe","date":"Mon Mar 01 03:11:48 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join us on Tuesday, March 2nd at 7pm MT for a telephone townhall! I will be discussing COVID-19 relief, legislative priorities, and my first months in Washington. Would love for you to call in and ask a question. Looking forward to hearing from you! #utpol https://t.co/XaOgkCStgv","date":"Sun Feb 28 20:33:01 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congrats to @RepJohnCurtis and his team for getting an amendment to H.R. 803 passed with bipartisan support! #utpol","date":"Sat Feb 27 16:15:44 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am disappointed my Democratic colleagues did not agree with what I believe to be a very commonsense and collaborative approach to ensuring local constituents have a voice in their federal land management in H.R. 803. #utpol https://t.co/bXQ5z44nf8","date":"Sat Feb 27 03:54:23 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you, Lieutenant General L. Neil Thurgood, for this @USArmy seal that I will display in my office. It was great to have a fellow Utahn and @UUtah grad stop by, and I am proud to support our nation’s armed services in Congress. #utpol https://t.co/Y3yleLhmEf","date":"Fri Feb 26 23:39:41 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today I spoke on the House floor in opposition to H.R. 803. This major lands package disregards input from local officials, increases risk of wildfires, and costs jobs and livelihoods. #utpol @NatResources https://t.co/o0mtiidwQH","date":"Fri Feb 26 03:26:44 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am thankful for the work @RemoteWorkUSU is doing to invigorate Utah's rural workforce and overall economic development. Internet access and co-working spaces are essential to ensuring our rural communities have equal opportunities to thrive. #utpol https://t.co/qL8oPmx4lk","date":"Thu Feb 25 22:59:44 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On Tuesday, I had the amazing opportunity to attend a KC-46 Brief and Demo Flight out of Andrews Air Force Base with the @usairforce. It was great to meet the team and learn about their operations as we flew to SC and back. Thanks for having me on board! #utpol https://t.co/KTuvSX6oP2","date":"Thu Feb 25 16:40:49 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to sign up for my weekly e-newsletter for regular updates and announcements from my office! #utpol https://t.co/3WPtYezd1K","date":"Mon Feb 22 22:14:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"We swore after 9/11 that we would never forget, and organizations like Honor 365 are upholding that commitment. #utpol https://t.co/LxSc4yuW8i","date":"Sat Feb 20 22:13:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was grateful to speak at Honor 365’s 9/11 Honor Walk today in Layton. Together we recognized those who have served and continue to serve their country and communities, including the late Officer Nate Lyday and Major Brent Taylor. @LaytonFYI #utpol https://t.co/OpybyaNzKy","date":"Sat Feb 20 22:13:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy Landing Day to the \n@NASA Perseverance Rover! A Northrop Grumman Utah site contributed to the building of the rover. Follow along and watch coverage here: https://t.co/4VZfhMjkjh #CountdownToMars #utpol","date":"Thu Feb 18 21:00:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"This is great news! Utahns, for COVID-19 updates and resources, go to https://t.co/KM2NVaZGr4 #utpol https://t.co/SY4JSoj60R","date":"Thu Feb 18 19:44:17 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thrilled to see Utah cities recognized for their growing economies, especially in the wake of the pandemic. This is great news! It’s important that we also focus our recovery efforts in the rural areas of the state. Congrats, UT! #utpol https://t.co/nzKhKyqzhO","date":"Thu Feb 18 03:27:23 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thanks for hosting me, @HAFB! #utpol","date":"Wed Feb 17 22:59:39 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you for having me! It was great to be with you all. #utpol","date":"Wed Feb 17 22:58:14 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday, I had the opportunity to visit @HAFB and get an overview of their impressive daily operations. It’s an honor to serve HAFB in Congress on @HASCRepublicans, and I will represent their interests so Team Hill can make vital contributions to our national defense. #utpol https://t.co/u50ptTqQFV","date":"Wed Feb 17 22:55:44 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On Oversight and Investigations, I look forward to using this leadership opportunity to hold federal agencies accountable as we work across the aisle for more effective management of our lands and resources nationwide. #utpol","date":"Wed Feb 17 22:01:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Likewise, I am looking forward to working with my colleagues on the National Parks, Forests, and Public Lands Subcommittee to promote sound policies of conservation, access, and economic development for our nation’s federally owned lands. #utpol","date":"Wed Feb 17 22:01:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read my full press release on these subcommittee assignments here: https://t.co/3gIGGnZVjm #utpol","date":"Wed Feb 17 22:01:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It is imperative that we conduct proper oversight of the administration’s policies regarding our resources, and I will advocate for the interests of the First District and Utah as we demand transparency and efficiency. #utpol","date":"Wed Feb 17 22:01:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"These issues are particularly important to Utah, which is home to some of the richest and most valuable resources in the country. Utahns know our lands can be managed better, and I am ready to work on their behalf to make that a reality. #utpol","date":"Wed Feb 17 22:01:10 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It is an honor to be Vice Ranking Member of the @NatResources Oversight and Investigations Subcommittee and on the National Parks, Forests, and Public Lands Subcommittee. #utpol https://t.co/yhBTNVPcHl","date":"Wed Feb 17 22:01:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am proud to join my UT colleague @RepJohnCurtis and @RepJoeNeguse as they launch the Bipartisan #WildfireCaucus. Wildfire prevention and recovery are top priorities for the First District, and I am looking forward to being a part of this crucial effort. #utpol","date":"Wed Feb 17 01:18:53 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Join us tomorrow! @hinckleyinst #utpol","date":"Tue Feb 16 21:06:52 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy #PresidentsDay! I'm so glad we have this day to reflect on the leadership of Presidents Washington and Lincoln. #utpol","date":"Mon Feb 15 19:37:43 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Utahns, go to https://t.co/gj0hCRJrj1 to see how you can get involved in our vaccination efforts! #utpol","date":"Fri Feb 12 22:00:33 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Be sure to sign up for my weekly e-newsletter for more updates! #utpol https://t.co/3WPtYezd1K","date":"Fri Feb 12 03:46:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I visited @NHSHousing to learn about their work providing affordable housing to Utahns in need through their mutual self-help program &amp; funding from @HUDgov &amp; @USDA. They're doing amazing work to benefit the living situations of low-income families across the 1st District. #utpol https://t.co/IfjvXScPyZ","date":"Fri Feb 12 03:45:59 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Yesterday, I met with Cache County Executive David Zook. I also talked to @USUAggies leadership to hear about how they are ensuring their students excel in the midst of the pandemic. Go Aggies! #utpol https://t.co/Ju1I67KZ5H","date":"Fri Feb 12 03:45:56 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I also spoke to @basin_now about the Basin's unique economic challenges and how I plan to use my position on @NatResources to protect jobs and conserve Utah's public lands. You can listen to the full interview here: https://t.co/p3W4pMd6gB #utpol","date":"Fri Feb 12 03:45:55 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It's been a great week in northern Utah! On Tues, I headed to the Uinta Basin to meet with local leaders &amp; tour the Ashley Springs water treatment facility. It's great to see local gov operate the Basin's water supply after @Interior transferred the land earlier in 2020. #utpol https://t.co/fEHW0mwvJh","date":"Fri Feb 12 03:45:54 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Glad to be visiting constituents in the Uintah Basin today! #utpol https://t.co/mhg2v02f0z","date":"Tue Feb 09 17:40:53 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Joined @undergroundUT Stokes &amp; Folks podcast last week to discuss my first month in Congress and committee assignments. Check it out! #utpol  https://t.co/NmgERAVz2H","date":"Mon Feb 08 22:14:18 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am deeply saddened by the passing of Rep. Ron Wright. I send my condolences to his family, loved ones, constituents, and colleagues in the Texas delegation.","date":"Mon Feb 08 17:29:56 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The First District of Utah is a welcoming, inclusive community, and our children should learn and celebrate Black history without controversy. We cannot learn American history without learning Black history. Read my full statement here: https://t.co/4H829eGcy4 #utpol","date":"Sun Feb 07 21:12:21 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On the Cyber Subcommittee, I will get to work with an exciting group of people on a new subcommittee focused on addressing issues of the future as we oversee acquisition of computer software, cyber security, and cyber operations. #utpol","date":"Fri Feb 05 15:07:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"On the Readiness Subcommittee, I will advocate for the Ogden Air Logistics Complex and the Utah Test and Training Range as we advance the civilian workforce and depot operations. #utpol","date":"Fri Feb 05 15:07:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am excited to be assigned to the @HASCRepublicans  Readiness and Cyber Subcommittees and champion the priorities that matter most to the First District’s defense community. #utpol","date":"Fri Feb 05 15:07:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The 309th Software Maintenance Wing at @HAFB  contributes to the capability and prowess of America’s cyber warriors, and I look forward to ensuring they have the tools to keep America safe. #utpol","date":"Fri Feb 05 15:07:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Tune in now! #utpol","date":"Thu Feb 04 23:11:33 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Officer Brian Sicknick lost his life protecting this building, the many who work here, &amp; our democratic process. It was an honor to pay my respects to him and his sacrifice today. I will never walk through these halls without thinking of his service. #utpol https://t.co/RnLSByaE6V","date":"Wed Feb 03 16:38:55 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m about to go live on @cspanwj, tune in! #utpol https://t.co/lgpvI4SW4b","date":"Wed Feb 03 14:28:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"May we remain committed to standing up to indifference and changing the world around us for good. #utpol https://t.co/r62mXu8081","date":"Sun Jan 31 14:04:23 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I had the privilege of speaking at the Bear River Massacre Memorial on the anniversary of the dark day that ended hundreds of lives at the Shoshone winter camp. #utpol","date":"Sun Jan 31 14:04:22 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"@RepChrisStewart Grateful for this opportunity to work together!","date":"Sat Jan 30 02:49:24 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Proud to join my @HouseGOP colleagues in the many ways to support life. #utpol","date":"Fri Jan 29 15:33:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am proud to support the POWER Act with my colleagues on @NatResources. We must work across the aisle to both preserve our lands and protect our energy independence &amp; jobs. #utpol","date":"Fri Jan 29 14:13:27 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I’m thrilled to welcome MicroGEM to Ogden as the 1st District becomes part of their critical work to provide rapid COVID tests to thousands of Americans daily, allowing northern UT to keep answering the call to the pandemic’s pressing challenges. #utpol https://t.co/jJ0SOLjNIB","date":"Thu Jan 28 23:39:46 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I was proud to join my colleagues &amp; sign this letter from @RepublicanStudy in support of the Hyde Amendment. Serving those who are at their most vulnerable &amp; advancing the pro-life cause are among my most sacred duties in Congress. #SaveHyde #utpol https://t.co/A3sYYBwwqx","date":"Tue Jan 26 22:31:37 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I sat next to @RepChrisStewart on a flight 3 years ago when he was flying back to vote on this. This is an example of the good we can do in Congress. #utpol","date":"Tue Jan 26 20:56:36 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy Birthday, @GOPLeader!","date":"Tue Jan 26 17:55:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Excited to get to work! #utpol https://t.co/DWfymiLnqr","date":"Tue Jan 26 16:14:14 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read my full press release on this announcement here: https://t.co/Wfz4sFRya4","date":"Tue Jan 26 00:48:26 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am looking forward to spearheading Utah's representation on the Committee to address our unique values and interests, including recreation, conservation, energy, and development. #utpol","date":"Tue Jan 26 00:48:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am honored to represent Utah on @NatResources. Utah ranks 2nd in the country for percentage of land owned by the federal government, and with that reality comes many challenges and opportunities. #utpol","date":"Tue Jan 26 00:48:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I look forward to working with my colleagues to advocate for our national security interests and prioritize pressing issues such as readiness, funding allocations, &amp; modernization efforts. #utpol","date":"Mon Jan 25 19:57:05 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read my full press release on this announcement here: https://t.co/ou8hKyYZYp #utpol","date":"Mon Jan 25 19:57:05 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The 1st District’s continued representation on HASC is key to ensuring tens of thousands of constituents who work at @HAFB have the necessary resources to make vital contributions to our national defense. #utpol","date":"Mon Jan 25 19:57:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It’s an honor to be selected to serve on @HASCRepublicans, and I’m thrilled to be able to deliver on this promise to my constituents. #utpol","date":"Mon Jan 25 19:57:04 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congratulations to @JonHuntsman! This is great news for Utah as we continue to further accelerate our statewide economy. #utpol","date":"Sat Jan 23 00:47:20 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"There’s a dire need for rural economic development. This is NOT a rural issue, this is a UT issue! State organizations like @BusinessUtah, @edcutahorg, &amp; @JobsUT have programs to help UT companies hire a rural workforce. The Innovation Hub in Vernal is a great example! #utpol https://t.co/qZYk2Ok2cU","date":"Fri Jan 22 20:48:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Economic recovery for the First District and Utah at large will always be one of my top priorities, and I join with Utah’s leadership in highlighting the damaging effects of the administration’s decision to suspend oil and gas leasing on federal lands. #utpol","date":"Fri Jan 22 16:08:58 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was great to speak with members of the @UTNationalGuard yesterday after the inauguration. From UT to DC, thank you for your service and sacrifice. #utpol https://t.co/pdsuOvVBb0","date":"Thu Jan 21 15:19:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Congratulations to President Joe Biden &amp; Vice President Kamala Harris! It was an honor to witness the inauguration today and support a peaceful transfer of power. I look forward to working with this administration to reach America’s common goals. #utpol https://t.co/tu0mOsBsVr","date":"Wed Jan 20 20:51:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Team Moore is grateful for the service of our @CapitolPolice every day, but especially this month. Was happy to share our thanks in the Cannon Tunnel last week. Thank you for all you do! #utpol https://t.co/T7LIQpMCmg","date":"Wed Jan 20 00:54:50 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you @UTNationalGuard #utpol","date":"Mon Jan 18 19:46:51 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Reading Dr. King’s speech, this stood out as most relevant for today. #MLKDay #utpol https://t.co/j48otGjQWA","date":"Mon Jan 18 14:29:58 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"A rushed impeachment will set a dangerous precedent, &amp; without a single hearing I cannot reach the high bar of impeachment. I have joined 9 colleagues in introducing a censure resolution to provide a constitutional path to accountability. #utpol","date":"Thu Jan 14 01:41:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My role in DC is bigger than just me. I am a representative of the First District, and I commit to objectivity &amp; constitutionality. #utpol","date":"Thu Jan 14 01:41:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I demand justice for January 6th. It was a tragic day for our nation. We have to do better. I am committed to doing my very best to restore unity &amp; move forward. #utpol","date":"Thu Jan 14 01:41:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read my full statement here: https://t.co/PpJrNHbZqL","date":"Thu Jan 14 01:41:09 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I am committed to being objective as I uphold my oath to defend the Constitution, and today’s vote was one of the most difficult decisions I’ve ever had to make. #utpol https://t.co/ml8lxg6QoV","date":"Thu Jan 14 01:41:08 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"If you’re interested in an objective conversation about January 6th, this is well worth a listen. ⁦@RepDanCrenshaw⁩ #utpol  https://t.co/z7bU7wo5Kb","date":"Mon Jan 11 00:41:25 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"My heart goes out to officer Howard Liebengood and his family. We deeply appreciate and honor his 15+ years of committed service and sacrifice to Capitol Hill. #utpol","date":"Sun Jan 10 21:21:30 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"First thought on this #LawEnforcementAppreciationDay is for local fallen @OGDEN_POLICE officer, Nathan Lyday &amp; his wife Ashley. Thank you for your service. #utpol","date":"Sun Jan 10 00:41:39 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"It was an honor to speak at today’s @EagleForum conference in Lehi about my first week in Congress, my commitment to advancing pro-life values, the Administration’s key federal court appointments, and more. Thank you for hosting me! #utpol https://t.co/w41OgWQw0m","date":"Sat Jan 09 20:03:00 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I want to personally thank @CapitolPolice fallen officer Brian Sicknick's family for his sacrifice to me, my colleagues, and our country. I pray the families of all 5 lives lost and those injured are comforted. #utpol","date":"Fri Jan 08 13:00:45 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"After collecting input &amp; listening to both sides of the issue, I voted not to object to the certification of the electoral college votes for the 2020 presidential election. #utpol","date":"Thu Jan 07 16:01:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"I urge states across the USA to follow Utah’s secure &amp; efficient election process to address serious concerns about the integrity of their systems. #utpol","date":"Thu Jan 07 16:01:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Fed. intervention in state-certified elections is not allowed by the Constitution, but as I stated in August, many states made rushed decisions that we must investigate &amp; fix. #utpol","date":"Thu Jan 07 16:01:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Read my full statement on the vote here: https://t.co/kuZb94DKaj #utpol","date":"Thu Jan 07 16:01:12 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"The assault on the U.S. Capitol yesterday was deeply upsetting. Violence &amp; intimidation against the Legislative Branch are unacceptable and un-American, &amp; I urge Americans to unite &amp; welcome a peaceful transfer of power. #utpol","date":"Thu Jan 07 16:01:11 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Thank you for your outreach &amp; support. I was evacuated from the House Floor. My team &amp; I are safe. Appreciative of Capitol Police and their service. This saddens &amp; troubles me greatly.  #utpol","date":"Wed Jan 06 21:56:35 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Looking forward to working with my fellow freshmen colleagues in the 117th Congress! 🇺🇸 https://t.co/yHPC4eOrd5","date":"Mon Jan 04 23:06:28 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Happy 125 years of statehood, Utah! As Jane &amp; I looked at the suffragettes’ statue in the Capitol yesterday, we got even more excited to #SendMartha. The Capitol will soon welcome a statue of Martha Hughes Cannon, Utah and America’s 1st female state senator. Utah leads the way! https://t.co/PNlCS0QqGV","date":"Mon Jan 04 21:22:42 +0000 2021","user_id":"1337452596093587462"},{"handle":"RepBlakeMoore","text":"Today, with my wife &amp; eldest son by my side, I was sworn in as a Member of the 117th Congress to represent the 1st District of Utah in the U.S. House of Representatives. I'm grateful for all who got us here, &amp; I look forward to bringing the values of UT-01 to DC. #utpol https://t.co/o6WUDvel3m","date":"Sun Jan 03 23:49:58 +0000 2021","user_id":"1337452596093587462"}]