[{"handle":"RepCloudTX","text":"- Inflation is skyrocketing\n- Gas prices are through the roof\n- Our border is in chaos\n- Fentanyl is plaguing our communities\n- Violent crime runs rampant\n\nYet, Democrats avoided these issues and held a hearing on pet collars, yes, pet collars. https://t.co/dVMB7h3zcA","date":"Thu Jun 16 15:43:33 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We must focus on what is affecting Americans the most, not barking up the wrong tree and holding a hearing on pet collars.","date":"Wed Jun 15 13:27:43 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Americans are suffering from 40-year high inflation, record-breaking gas prices, an ongoing border crisis, and out-of-stock baby formula.\n\nWhat are Democrats on the Oversight Committee focusing on?\n\nFlea collars for pets...\n\nhttps://t.co/VtwqVPtKL6","date":"Wed Jun 15 13:27:42 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"27 Democrats voted to continue to allow Supreme Court Justices and their families, amidst unprecedented threats, to continue to go without police protection. \n\nI wonder if the liberal media will bombard them with questions on why they voted No?","date":"Tue Jun 14 20:27:13 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today we celebrate Flag Day and the U.S. Army's 247th birthday.\n\nBecause of their sacrifice, our flag still serves as a bright beacon of liberty and limitless opportunity. https://t.co/jlhQqn82sD","date":"Tue Jun 14 15:10:59 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Under the Biden admin, our brave border patrol agents are overwhelmed and demoralized.\n\nOur southern border is in complete chaos.\n\nWe must return to Trump-era immigration policy to secure our border and alleviate the burden placed upon Border Patrol.\n\nhttps://t.co/VdsWJ1tjwa","date":"Mon Jun 13 22:00:16 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"According to @SecMayorkas, the Biden administration has \"operational control\" of our southern border.\n\nUnbelievable. \n\n#ImpeachMayorkas","date":"Fri Jun 10 17:28:49 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"- Record Inflation\n- Soaring Gas Prices\n- Stagnant Wages\n\nHardworking Americans are feeling the detrimental effects of Democrats’ failed economic policies.","date":"Fri Jun 10 16:54:38 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"When you study the rise and fall of nations, usually, great nations crumble from within.\n\nOne of the biggest reasons is fiscal irresponsibility.\n\nThat's why @RepublicanStudy's Budget and Spending Task Force is proud to unveil our FY 2023 Budget as a \"Blueprint to Save America.\" https://t.co/Qi8OnGcoMi","date":"Thu Jun 09 16:12:59 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Fake Jan 6 Committee hires a fake news organization to produce a fake hearing.\n\nIn reality, Americans are facing:\n- Record Inflation\n- Soaring Gas Prices\n- Record Crime\n- Mass Illegal Immigration\n\nThe Jan 6 committee is a complete sham and a perversion of justice.","date":"Tue Jun 07 15:45:37 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Gas prices have officially DOUBLED since the Biden administration took office. \n\nAs of today, the national average is $4.91. \n\nAmericans simply can't afford this administration's self-sabotaging energy policy.\n\nhttps://t.co/KLnDu41hZx","date":"Tue Jun 07 14:55:59 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today, on the 78th anniversary of D-Day, we remember and honor the heroes who risked and even sacrificed their lives to fight for freedom.\n\nLet us never forget their sacrifice. https://t.co/3fT6tmqtcJ","date":"Mon Jun 06 18:33:39 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today, Gun Owners of America revealed that ATF has, in fact, built a searchable and centralized firearms database.\n\nIt is now more important than ever for Congress to pass my No REGISTRY Rights Act to dismantle this database and protect Americans' Second Amendment right.","date":"Tue May 24 17:55:42 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden administration has turned what is supposed to be our border security apparatus into a human trafficking delivery system. \n\nThey've continued to advocate for lawlessness over a lawful society. \n\nWe must reverse this course and return to Trump-era border policies. https://t.co/9t14rPwpyB","date":"Mon May 23 19:49:46 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Everything the Biden administration touches turns into a crisis.\n\n@RepJamesComer and I are leading an investigation regarding this administration’s failure to prevent this tragic baby formula shortage.","date":"Fri May 20 20:14:18 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Left will do everything in their power to intimidate SCOTUS and pro-life advocates across our nation.\n\nThe Justices must remain strong. \n\nRoe v. Wade should be overturned.\n\nhttps://t.co/dm07jS5t2h","date":"Wed May 18 18:21:50 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden administration shouldn't be \"pausing\" its Disinformation Governance Board, they should terminate it.\n\nFree societies don't implement \"Ministries of Truth.\"\n\nShut it down.","date":"Wed May 18 17:33:03 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Under President Trump, we were a nation of Law and Order.\n\nUnder the Biden administration, we are a nation of lawlessness.\n\nThis administration's open-border agenda has created historic levels of illegal immigration and is putting countless Americans in harm's way.","date":"Mon May 16 21:37:51 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Ever since the draft opinion from the Supreme Court was leaked, pro-abortion advocates have taken to vandalizing churches, disrupting church services, and in one instance, stealing a tabernacle.\n\nhttps://t.co/Hq23cWY4Ne","date":"Wed May 11 21:28:50 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The DOJ has defined hate crime as “a crime motivated by bias against race, color, religion, national origin, sexual orientation, gender identity, or disability. \n\nThis definition puts religious hate crimes squarely in the DOJ’s purview.","date":"Wed May 11 21:28:50 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today I sent a letter to Attorney General Merrick Garland urging the DOJ to investigate the recent attacks on Christian churches and to prosecute them to the fullest extent of the law. https://t.co/Ba1KzHKr9F","date":"Wed May 11 21:28:49 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As National Police Week begins, let us recognize and honor the men and women in blue who protect and serve our communities.\n\nWe're grateful for everything you do to keep us safe.\n\n#BackTheBlue https://t.co/1RH1FbfQVn","date":"Wed May 11 18:07:17 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Our justice system cannot tolerate these continued attacks on our places of worship.\n\nThe rule of law, including the right of the People to freely worship must be defended.","date":"Wed May 11 14:13:27 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"What we are seeing is unacceptable and illustrates the radical Left’s contempt for Christians and our way of life.\n\nUnfortunately, undermining Christianity has become a key part of the Left’s totalitarian agenda.","date":"Wed May 11 14:13:27 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"They burned down churches during the Black Lives Matter protests.\n\nThey shut down churches during the pandemic.\n\nNow they’re targeting churches due to the draft SCOTUS opinion.","date":"Wed May 11 14:13:27 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Those who are targeting, harassing, and vandalizing churches across our nation must be investigated. \n\nI believe these actions are hateful and should be prosecuted to the fullest extent of the law.","date":"Wed May 11 14:13:26 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today is #NationalFentanylAwarenessDay. \n\nFentanyl is the leading cause of death for adults in the U.S. between the ages of 18-45.\n\nWe can save lives by securing our southern border and preventing this lethal drug from plaguing our communities.","date":"Tue May 10 18:28:04 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden administration has a database of nearly a BILLION gun records and has already finalized a rule to rapidly expand it.\n\nCongress must pass my bill, the No REGISTRY Rights Act, to eliminate the ATF's gun registry and protect the 2nd Amendment.\n\nhttps://t.co/Vn13m1jePc","date":"Mon May 09 16:34:04 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As early as 5 weeks, unborn babies in the womb have a heartbeat.\n\nBy 10 weeks, the child has formed arms, legs, fingers, and toes.\n\nAt 15 weeks the child has a fully developed heart, facial features, and can even yawn and hiccup.\n\nThis is a child, and it deserves protection. https://t.co/eyxF5ctQSx","date":"Mon May 09 14:53:53 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Yesterday I joined @frankgaffney with @RealAmVoice to discuss the ongoing Biden Border Crisis.\n\nBorder security is national security.\n\nUnder the Biden administration, we have neither.\n\nhttps://t.co/nyxyKr9bqM","date":"Fri May 06 17:56:08 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"It is no coincidence that the Biden administration created a \"Disinformation Governance Board\" less than a week after Elon Musk purchased Twitter. \n\nDemocrats lost their favorite tool to control political narratives, therefore they're creating their own.\n\nhttps://t.co/drYuDiGdci","date":"Thu May 05 21:56:10 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I'm joining @RepFranklin to demand answers on the true purpose of Democrats' \"Ministry of Truth.\"\n\nThis Disinformation Governance Board is unacceptable, and I will continue to advocate for its elimination.","date":"Thu May 05 21:56:10 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden administration has caused the biggest border crisis in our nation’s history and instead of mitigating the issue, they’re gifting no-bid contracts to their friends—allowing them to profit off the mismanagement at our border.","date":"Wed May 04 16:09:20 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This is a corrupt practice and the Biden administration must be held accountable.","date":"Wed May 04 16:09:20 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today, @RepJamesComer and I led our House Oversight colleagues in pressing the Biden administration about a no-bid contract they gave to an unqualified political ally, resulting in the waste of millions of taxpayer dollars. \n\nhttps://t.co/Lv80ameenz","date":"Wed May 04 16:09:19 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This move is meant to rally the anti-life movement of the Left in opposition of the potential decision. \n\nThe Justices must remain strong. Roe v. Wade should be overturned.","date":"Tue May 03 01:41:53 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We are at a critical time in our nation as the public’s trust in government is at an all time low. \n\nNow we’re seeing a major breach of confidentiality among our Supreme Court.","date":"Tue May 03 01:41:52 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"If we were to ask the cartels to design a border policy for the United States, it would look very similar to what the Biden administration is doing.\n\nThis is tragic.\n\nWe must revert back to Trump-era immigration policies to secure our border and protect our homeland. https://t.co/uyZ1s7L7XJ","date":"Thu Apr 28 14:33:18 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As inflation rips through America's economy, it is now more important than ever to ensure Congress understands the true cost of the spending bills they're voting on. \n\nTo do that, we must begin by including debt servicing costs in official cost estimates. https://t.co/46MjoZ4ffA","date":"Wed Apr 27 20:40:19 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Nations can rise and fall due to fiscal responsibility.\n\nToday @SenMikeLee and I led 40 of our Republican colleagues in an effort to require the Congressional Budget Office (CBO) to include debt servicing costs in each official cost estimate that they publish.","date":"Wed Apr 27 20:40:18 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"- Over 2 million border encounters\n- 42 Terrorist Encounters\n- Over 400k known gotaways\n- Fentanyl pouring into our country\n- Record level drug overdoses\n\nHow can Mayorkas think DHS has effectively managed our southern border?\n\n#Impeach","date":"Wed Apr 27 19:43:56 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Secretary Mayorkas has abandoned his duty to protect the American people by securing our Homeland.\n\nHis open-border agenda has created historic levels of illegal immigration and has put countless Americans in harm's way.\n\nHe must be impeached.","date":"Wed Apr 27 14:15:49 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"There were over 500,000 known got-aways in 2021 and the 2022 numbers are on track to be much worse. \n\nRescinding Title 42, which is set to end next month, will cause these numbers to explode, endangering the security and well-being of Americans across our nation.","date":"Mon Apr 25 21:15:35 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"March was the 13th straight month where over 150,000 illegal immigrants were encountered at our southern border.\n\nOver 2.4 million encounters in total, including 42 that were on the TERROR WATCHLIST.\n\nBorder security is national security. Under the Biden admin, we have neither.","date":"Mon Apr 25 21:15:34 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Heartbreaking. \n\nGod bless Specialist Bishop Evans, a true hero, who died in service to his nation.\n\nhttps://t.co/YiVpJvurLp","date":"Mon Apr 25 19:01:21 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Earlier this week I joined Fox Business to discuss Jack Dorsey's comments opposing CNN's media bias as well as Elon Musk's effort to purchase Twitter and restore free speech principles to the platform.\n\nCheck it out below⤵️ https://t.co/Mdx20gU4hS","date":"Thu Apr 21 20:31:29 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden administration continues to allow drug smugglers, human traffickers, and even terrorists to invade our country. \n\nNow they've prematurely stopped enforcing Title 42 a month early. \n\nEvery action they've taken indicates they want more illegal immigration, not less.","date":"Wed Apr 20 16:45:51 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"A free phone and a free ticket to any American city of their choice, what a deal.\n\nAll paid for by American taxpayers dealing with record-high inflation.\n\n#ImpeachMayorkas","date":"Thu Apr 07 18:05:52 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden administration's inflation crisis is costing the average American household OVER $5,000 this year.\n\nMass spending and Leftist priorities have damaged our economy and have Americans paying more for just about everything. https://t.co/bHhmJx4BIy","date":"Tue Apr 05 16:51:54 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This is a complete dereliction of duty.\n\nWithout Title 42, our Border Patrol officers will experience an illegal immigrant surge at record-shattering levels.\n\nThe Biden administration knows this, and they're complicit in this continued invasion.\n\n#ImpeachMayorkas\n#SecureOurBorder","date":"Fri Apr 01 19:05:47 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This administration has shown ZERO interest in safeguarding our communities and securing our homeland.\n\nTitle 42 is one of the only remaining tools to enforce our immigration laws. \n\nWithout it, CBP will experience a surge at record-shattering levels.\n\nhttps://t.co/y2ZeovYdo3","date":"Thu Mar 31 12:42:07 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This has been a year-long dereliction of duty and our leaders must be held accountable.\n\nWe must impeach Secretary Mayorkas and return to the Trump-era policies which secured our border and increased the safety in our communities.","date":"Tue Mar 29 22:02:03 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Now they're planning to repeal Title 42, a critical tool used to expel illegal immigrants, fully opening the floodgates to enable more massive amounts of illegal immigration.\n\nThis administration clearly has ZERO intention of solving this border crisis and securing our homeland.","date":"Tue Mar 29 22:02:02 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Since taking office, the Biden administration has empowered over 2 MILLION illegal border crossings by:\n\n- Halting border wall construction\n- Reinstating the failed Obama-era \"Catch-and-Release\"\n- Formally ending Trump's \"Remain in Mexico\" policy\n- Dropping deportations by 68% https://t.co/wVTQqYxmzp","date":"Tue Mar 29 22:02:02 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Happy National Agriculture day to all the farmers, ranchers, and producers across the state of Texas who continue to feed and fuel our country!\n\n#NationalAgDay\n#NationalAgWeek https://t.co/97ylf8e1Km","date":"Tue Mar 22 18:31:19 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Banned from Twitter:\n- The Babylon Bee\n\nNot Banned:\n- The Kremlin\n- Pro-China Propagandists\n- The Taliban\n\nTwitter bans have nothing to do with misinformation, only power.","date":"Tue Mar 22 15:39:06 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The most important role of the federal government is to keep its citizens free.\n\nWe must protect the Second Amendment by dismantling ATF's database of nearly a billion gun records, restoring privacy to law-abiding American gun owners in the process.","date":"Fri Mar 18 14:13:43 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Illegal immigration is occurring at record levels yet the Biden administration's deportation rates are at record lows.\n\nThis administration continues to threaten the rights of law-abiding Americans while turning a blind eye to criminal illegal aliens.\n\nhttps://t.co/hQJisw3CJH","date":"Wed Mar 16 14:33:32 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"In January, @RepJamesComer and I led our Oversight Committee colleagues in an effort to demand data from ICE on why the agency, which has not lost any funding, is arresting and deporting illegal immigrants \nat a much slower pace.\n\nStill no response.\n\nhttps://t.co/S1kEuLjhDW","date":"Wed Mar 16 14:33:32 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The #BidenBorderCrisis continues.\n\nThe Biden administration has failed to safeguard the American people and protect our homeland. \n\nOur communities are being destroyed because of this administration's unwillingness to enforce the law.\n\nSecure our borders. Protect our homeland. https://t.co/kMVbXL0M4u","date":"Tue Mar 15 14:54:05 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden administration’s war on American energy has emboldened our adversaries abroad and driven up energy prices at home. \n\nIt's time to unleash American energy with full force. https://t.co/PJa5pRcsD3","date":"Mon Mar 14 18:20:38 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Inflation is a tax on everyone, and it hurts the working class the most.\n\nThis problem was predictable and avoidable.\n\nWe must rein in Washington's reckless spending and alleviate the price burden American families across our nation are experiencing.\n\nhttps://t.co/dekWbDmDlj","date":"Fri Mar 11 16:35:48 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Why would the U.S. spend hundreds of millions of taxpayer dollars overseas for this nonsense?\n\nWorking-class Americans are struggling to pay for gas, groceries, and other everyday necessities due to Bidenflation.\n\nMore massive spending will only prolong this economic crisis.","date":"Wed Mar 09 21:50:26 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"A federal firearms registry is explicitly banned by law, yet ATF has accumulated and digitized nearly a BILLION gun records.\n\nMy No REGISTRY Rights Act would dismantle this database to prevent this Administration from continuing to constrain the rights of law-abiding Americans. https://t.co/shOsJRdBJR","date":"Wed Mar 09 17:22:16 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"My bill dismantling ATF's database of nearly a billion firearm records has the full support of the Second Amendment Caucus.\n\nThe Second Amendment protects our families, protects us from tyranny, and enables our freedom.\n\nIt must be fought for at all costs. https://t.co/WdbK3wbUp3","date":"Tue Mar 08 22:52:38 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden administration continues to threaten the rights of law-abiding Americans.\n\nTexas gun owners are rightfully concerned that this administration is willing and able to create a federal gun registry, and it’s Congress’ job to ensure that doesn’t happen.","date":"Tue Mar 08 18:38:30 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"About time.\n\nNow unleash American energy at full force.\n\nOil production must be increased on American soil. \n\nWe can't continue the reliance on foreign countries for our energy needs.\n\nhttps://t.co/V8KDil3lBN","date":"Tue Mar 08 16:40:38 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"ATF's database of nearly a billion gun records must be DISMANTLED immediately.\n\nA federal gun registry is explicitly banned by law.\n\nMy bill would dismantle ATF’s database, restore privacy for gun owners, and reverse the groundwork laid to create a federal firearms registry.","date":"Tue Mar 08 14:43:44 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today marks 720 consecutive days that the Capitol has been closed to the American public.\n\nAmericans across our nation attend sporting events, concerts, and other large gatherings daily.\n\nIt's time to end Speaker Pelosi's authoritarian rule and reopen the People's House.","date":"Thu Mar 03 19:13:37 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today we celebrate Texas Independence Day!\n\nGod Bless Texas! https://t.co/YF5q3KLtN2","date":"Wed Mar 02 20:23:52 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden admin shut down American energy production while enabling the Russians to expand their international stronghold. \n\nThe U.S. imports 595,000 barrels of Russian oil daily.\n\nWe must end our reliance on foreign oil and finally unleash the full strength of American energy.","date":"Mon Feb 28 22:19:04 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden admin eagerly slandered our brave Border Patrol officers by falsely claiming they were \"whipping\" illegal immigrants.\n\nThis was an absolute lie meant to vilify law enforcement.\n\nDHS must release its investigative report and grant our officers the justice they deserve.","date":"Mon Feb 28 19:52:50 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration's refusal to enforce our laws has emboldened violent cartels and other criminals. \n\nThe force of law is critical. \n\nWe must do everything we can to protect our borders and safeguard American citizens. https://t.co/zcDHKwcwwY","date":"Fri Feb 25 22:03:46 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Monoclonal antibodies are proven to be effective in combating COVID infection and saving lives.\n\nThe Biden admin has no right to restrict this treatment.\n\nMy bill puts states back in the driver's seat in navigating what's best for the health and well-being of their citizens.","date":"Fri Feb 25 18:39:56 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Mayorkas accuses Border Patrol of speaking ‘unprofessionally’ while he continues to act criminally.\n\nHe's disregarded the law on a daily basis, allowing increased abuse by violent cartels and fentanyl to kill thousands of American citizens. \n\n#DefendBorderPatrol\n#ImpeachMayorkas","date":"Fri Feb 18 18:50:44 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"HOLD THE LINE! https://t.co/xPp42dvYps","date":"Thu Feb 17 22:33:32 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Glad to see @SenMikeLee leading the charge in the Senate to oppose a Continuing Resolution while millions of Americans are still subjected to tyrannical COVID vaccine mandates.\n\nFree societies don't force people to choose between a vaccine or losing their job.\n\n#DefundVaxMandates","date":"Tue Feb 15 20:24:53 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thank you to my subcommittee colleagues for signing on @RepFredKeller @RepFranklin @Rep_Clyde @RepDonaldsPress","date":"Tue Feb 15 19:18:13 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"https://t.co/gfpryq8JhJ","date":"Tue Feb 15 19:18:13 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"In 2021, inflation cost the average American family $3,500.\n\nInflation spiked 7.5% in January, reaching a 40-year high.\n\nAmericans are paying higher prices on basic necessities while their wages stay stagnant.\n\nWe must pull out every tool possible to address this ongoing crisis.","date":"Tue Feb 15 19:18:11 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today I led Republicans on the Economic and Consumer Policy Subcommittee in calling for committee Democrats to immediately hold a hearing on the Biden Administration’s inflation crisis and its impacts on middle-class America. https://t.co/B36MbmOLEu","date":"Tue Feb 15 19:18:09 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"13 officers across our nation were shot and wounded over the weekend.\n\nDemocrats demonized and called for the defunding of law enforcement and its had disastrous effects.\n\nThey've enabled lawlessness and it's putting our police officers in harm's way.\n https://t.co/dAHRUaFjKH","date":"Tue Feb 15 14:20:08 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Democrats continually weaponize misinformation for political gain with ZERO accountability from mainstream media. \n\nTrump was right, this was all a hoax.\n\nEveryone involved in this partisan witch-hunt must be held accountable.","date":"Mon Feb 14 21:37:27 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Tyrannical COVID-19 vaccine mandates have no place in a free society, especially not in our nation's capital.\n\nD.C. is meant to represent the land of the free. \n\nIt's unacceptable that these restrictions were implemented in the first place.","date":"Mon Feb 14 21:29:35 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We must not allow Mayor Bowser to treat our nation's capital city as her own social experiment. \n\nThe Constitution gives Congress authority over our capital.\n\nKeeping the DC government in check will be a priority of R's on the Oversight Committee when the gavels are in our hands.","date":"Fri Feb 11 21:45:16 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Nearly 2 MILLION illegal immigrants were apprehended at our southern border last year.\n\nCriminals, terrorists, and human smugglers are entering our country daily and the Biden Administration is doing everything they can to limit ICE's ability to deport them.\n\n#ImpeachMayorkas","date":"Fri Feb 11 18:48:49 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Admin's lack of enforcing our laws has enabled criminal cartels to flood our country with mass amounts of fentanyl-related substances.\n\nThere's an overdose epidemic underway in America and fentanyl is at the heart of it. \n\nHappy to join @RepBryanSteil in this effort.","date":"Thu Feb 10 17:42:36 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Inflation has spiked to 7.5%, the highest since 1982.\n\nAmericans are paying more at the pump, grocery store, and everywhere else they shop.\n\nInflation is a tax on everyone, and it hurts the working class the most.\n\nhttps://t.co/9Zf5ojT7Sx","date":"Thu Feb 10 16:25:32 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Texas is well-positioned to help put America back on the path of energy independence while also providing our European allies with the crude oil and natural gas they'll need.\n\nWe must end our reliance on foreign countries and start looking at the solutions here at home.","date":"Thu Feb 10 14:22:53 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration has made clear that lawful immigration, protecting Americans, and securing our homeland are no longer a priority of theirs. \n\nThis is a complete dereliction of duty.","date":"Wed Feb 09 19:14:51 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The first step to empowering Border Patrol to enforce our laws is simple:\n\nImpeach DHS Secretary Mayorkas.","date":"Tue Feb 08 19:44:32 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration continues to do everything it can to impede Border Patrol's ability to do its job.\n\nOur brave Border Patrol officers are eager to enforce our laws to secure our nation.\n\nThe Biden Administration needs to just get out of the way.\nhttps://t.co/HxRMChconl","date":"Tue Feb 08 19:44:31 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This is a direct result of the Biden Administration pushing for a wide-open southern border.\n\nDHS Secretary Mayorkas' decisions have empowered violent cartels to smuggle mass amounts of deadly drugs with ZERO threat of repercussion.\n\nHe must be impeached.\nhttps://t.co/0M9bYcbXGH","date":"Tue Feb 08 14:18:36 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"73 police officers were targeted and killed in 2021, the highest total since 1995.\n\nThis was undoubtedly fueled by the repeated calls by Democrats to defund and even dismantle police departments.\nhttps://t.co/AZRdSI9Yoy","date":"Mon Feb 07 23:19:33 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Democrats encouraged mass lawlessness and labeled police officers as the enemy.\n\nNow we're seeing them targeted at record levels.\n\nWe must do everything we can to EMPOWER our brave law enforcement officers, never the opposite.","date":"Mon Feb 07 23:19:33 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"COVID-19 vaccine mandates are anti-American.\n\nFree societies don't impose tyrannical vaccine mandates on their citizens.\n\nI'll stand with @RepChipRoy in opposing any government spending that helps enforce the Biden Administrations' unconstitutional mandates.","date":"Mon Feb 07 17:20:52 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I am continuing to lead the investigation as to why ATF has accumulated nearly a billion gun records when a federal firearm registry is explicitly banned by law.\n\nLaw-abiding American gun owners are rightfully concerned, and it's up to Congress to investigate further.","date":"Thu Feb 03 22:30:46 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today marks Mayorkas' one-year anniversary as DHS Secretary.\n\nYet, every decision he's made has decreased our national security and damaged communities.\n\nHe has failed his core responsibility to enforce our laws and defend our homeland. \n\nHe must be impeached.\n\n#ImpeachMayorkas","date":"Wed Feb 02 16:25:06 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"https://t.co/edV8OadgsN","date":"Wed Feb 02 16:12:28 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"A federal firearm registry is explicitly banned by law.\n \nThe Biden Administration continues to empower criminals while diminishing the rights of law-abiding Americans.\n\nThe ATF is shamelessly circumventing existing law to accumulate these records.\n\nThey must be held accountable.","date":"Mon Jan 31 18:22:01 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I brought attention to these midnight drops months ago.\n\nNow we have evidence that taxpayer dollars are funding the mass release of criminals into the U.S.\n\nThe Biden Admin continues to side with criminals, cartels, and illegal immigrants over law-abiding Americans.\n\nDisgraceful.","date":"Fri Jan 28 17:25:49 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Secretary Mayorkas has failed to faithfully execute Americas laws and has eroded our national security in the process.\n\nHe must be impeached.\n\nMore from @RepChipRoy and myself:\n\nhttps://t.co/C4Hk5w3hsK","date":"Tue Jan 25 20:48:53 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Admin has ignored a year-long invasion at our southern border but is considering risking the lives of U.S. soldiers to protect Ukraine's border?\n\nUkraine is thousands of miles away.\n\nDrugs, crime, and cartels enter our own backyard every day.\n\nhttps://t.co/J1swSLt2Cc","date":"Tue Jan 25 00:22:18 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I suspected this could be true. That's why I sent a letter to Sec. Mayorkas on this topic last July.\n\nVetting requirements must not be stricter for American citizens than illegal immigrants.\n\nUnsurprisingly, they didn't respond to my request. They know this endangers Americans. https://t.co/NEMCajokgk","date":"Fri Jan 21 20:14:01 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This morning was full of prayer and preparation at the @PrayVoteEngage March for Life breakfast hosted by @A1Policy. \n\nI’m grateful to see the growing movement to support life, protect babies, and end the ugly practice of abortion.\n\nLooking forward to the march! https://t.co/KLm4Zw7Obf","date":"Fri Jan 21 16:08:31 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"President Biden has shattered records in his first year in office.\n\n- Record level inflation\n- Record level crime\n- Record level illegal immigration\n\nThis is not building back better!","date":"Fri Jan 21 15:57:15 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Easy:\n- Sanctity of Life\n- Ending COVID Mandates\n- Border Security\n- Strong Economy\n- 2A Rights\n- Energy Independence\n- Lower Taxes\n- Education Freedom\n- Empowering Law Enforcement\n- Small Government\n- Putting America First\n\nAnd most important, FREEDOM from tyrannical government!","date":"Fri Jan 21 14:39:06 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration continues to try and mask the damage done at our southern border.\n\nOver 2 million encounters in President Biden's first year. A historic record.\n\nOur Department of Homeland security has failed. Secretary Mayorkas must be impeached.","date":"Wed Jan 19 20:39:33 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration continues to disregard the safety of American citizens while protecting illegal immigrants from deportation.\n\nWe must commit to empowering our law enforcement officers, including ICE.\n\nOur national security depends on it.\n\nhttps://t.co/LlLuOBzyhn","date":"Tue Jan 18 18:25:30 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"SCOTUS struck down the OSHA mandate and freed millions of workers from a COVID-19 vaccine mandate.\n\nNow I'm working with @RepAndyBiggsAZ's to ensure federally funded entities are barred from issuing a vaccine mandate on their employees and those utilizing their services.","date":"Fri Jan 14 21:18:28 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Democrat-initiated crises left President Biden's approval rating at a record low 33%.\n\nPredictably, Dems’ focus is on a Federal takeover of our election process. \n\nThey’re not working to solve the critical issues Americans face.  \n\nThey’re working to consolidate and retain power.","date":"Thu Jan 13 21:13:13 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Big win, but much more work to do. \n\nThere should be ZERO COVID-19 vaccine mandates forced upon the American people.\n\nFree societies don't impose experimental vaccines upon their population. \n\nNo American worker should be forced to choose between a vaccine or losing their job.","date":"Thu Jan 13 20:41:50 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration burdened Americans with:\n\n-Record inflation\n-Border chaos\n-Afghanistan debacle\n-Bare shelves\n-Increased crime\n-Authoritarian mandates\n-Covid spikes\n-Broken supply chains\n-School closures\n-Energy dependence\n\nAll in less than a year.","date":"Thu Jan 13 14:00:51 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration is directly responsible for the year-long chaos we’ve experienced at our southern border. \n\nIllegal immigration is detrimental to America.\n\nThe President should empower our ICE agents, not circumvent Congress to block them from doing their jobs.","date":"Wed Jan 12 22:03:51 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Vaccine passports have no place in a free society. \n\nThis order requires the unvaccinated, or even those with natural immunity, to be discriminated against and live as second-class citizens in a city that's supposed to represent the land of the free.\n\nThis is unacceptable.","date":"Wed Jan 12 21:39:39 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I joined my @GOPoversight colleagues in calling on Mayor Bowser to end her tyrannical D.C. vaccine mandate.\n\nOur nation's capital must be accessible to the American People, regardless of their vaccination status.\n\nThe continuation of the Left's vaccine mandates must be stopped.","date":"Wed Jan 12 17:15:07 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Americans overwhelmingly agree that Members of Congress should not be enriching themselves off their positions in government. \n\nOur representatives must make decisions based on what is best for our nation, not what's best for their stock portfolio or some special interest. https://t.co/OAFBUShKux","date":"Tue Jan 11 15:48:40 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration with another disappointing jobs report.\n\nUnfortunately, this comes as no surprise.","date":"Fri Jan 07 21:37:56 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Inflation is a tax on all Americans and affects the working class the most.\n\nIt's gone up every month under the Biden Administration.","date":"Fri Jan 07 20:52:34 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Biden's open border policies encourage some of the most heinous criminals imaginable to trek to America. Fortunately, CBP got these guys.\n\nBut with about 1,000 \"got aways\" occurring daily, how many convicted criminals are making it through?","date":"Tue Jan 04 19:39:36 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"🚨Big News🚨 \n\nThe judge stated \"there is no COVID-19 exception to the First Amendment. There is no military exclusion from our Constitution.\"\n\nHe's right.\n\nNo American should be mandated to receive a COVID-19 vaccine.\n\nhttps://t.co/w2r1Z5srPT","date":"Tue Jan 04 17:08:27 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Twitter bans have nothing to do with misinformation, only power.\n\nBanned:\n- Former US President\n- Sitting GOP Congresswoman\n- Expert Virologist with a dissenting opinion\n\nNot Banned:\n- The Taliban\n- Communist China propagandists\n\nIt's always the bad guys who silence opposition.","date":"Mon Jan 03 21:16:05 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"https://t.co/GTP5uAKzUR","date":"Mon Jan 03 20:30:15 +0000 2022","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"“Trying to unconstitutionally mandate an experimental vaccine on Americans without allowing them legal recourse if they are adversely affected is one of the most egregiously tyrannical abuses of power in America’s history,” Cloud said.\n\nhttps://t.co/TullNR2hVj","date":"Wed Dec 22 19:59:09 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Good to finally see someone held to account in the Biden Administration! \n\nAll jokes aside, it’d be nice to get this kind of accountability in regard to our southern border crisis and our Afghanistan debacle. https://t.co/xUv4VfE51I","date":"Wed Dec 22 15:29:49 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"It is completely unjust for the Biden Administration to MANDATE an experimental vaccine while offering minimal legal recourse if there are adverse effects. \n\n@POTUS must retire the idea of forced vaccination and allow Americans to decide what health options fit their needs.","date":"Mon Dec 20 21:09:15 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thank you to those who signed on @cathymcmorris @RepGusBilirakis @RepLaTurner @RepBenCline @RepHuizenga @boblatta @RepWalberg","date":"Fri Dec 17 21:11:51 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today I led members of the GOP Big Tech task force in a letter to Facebook CEO Mark Zuckerberg regarding our concerns about violent cartels using the Facebook platform to aid in human trafficking and illegal immigration. https://t.co/UxqH67wKrr","date":"Fri Dec 17 21:11:50 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Facebook seems all too eager to combat information from conservative viewpoints.\n\nMeanwhile, cartels have free rein to use their platform to recruit, advertise, and mobilize their human trafficking operations.\n\nThat must not continue.","date":"Fri Dec 17 21:11:49 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"American leaders are expected to fight for freedom, not tyranny. \n\nWe cannot sit by and let this go unchecked.","date":"Fri Dec 17 16:15:44 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Everything about this message is unamerican.\n\nApparently \"your paycheck\" and \"your ability to enjoy life\" depends on abiding by tyrannical vax mandates pushed by individuals like De Blasio who've forgotten we’re governed by a Constitution that limits the governments' authority.","date":"Fri Dec 17 16:15:44 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Open borders are not humane, lawlessness is not compassion, chaos is not justice. \n\nDon’t fall for the left’s attempts to rebrand societal decline.","date":"Wed Dec 15 18:44:47 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration has ceded our southern border to the control of cartels.  \n\nThey're smuggling humans and drugs with only a facade of enforcement from this Administration - destroying lives and devastating communities.","date":"Wed Dec 15 18:44:47 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":".@MarkMeadows is a patriot who served his country honorably. It’s despicable that Democrats are wasting time, resources, and taxpayer dollars to target political opponents and criminalize opposition.","date":"Wed Dec 15 00:28:50 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"-Drug and human smuggling continue to rise\n-Violent cartels are empowered\n-Thousands continue to flood into our country\n\nToday I joined Sean Hannity to discuss the continued catastrophic failures of the Biden Administration's handling of our southern border. https://t.co/3irpyqv05M","date":"Wed Dec 15 00:26:43 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"\"The American worker has been abused and left out to dry by the federal government,\" Cloud said, accusing “corporate overlords” of eagerly serving as this Administration’s enforcement arm.\n\nEmployers complicit in unconstitutional and authoritarian demands must be held accountable","date":"Tue Dec 14 15:37:32 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"🚨Important Thread🚨\n\nOpen borders consistently result in increased cartel activity, human &amp; sex trafficking, fentanyl addiction, and crime spikes in American communities.\n\nThese are the victims of the Biden Administrations' immigration policies.\n\nWe can't let this continue.","date":"Mon Dec 13 22:07:16 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration is enforcing the reinstated \"Remain in Mexico\" policy with the same energy and efficiency as a petulant child not wanting to do their chores.\n\nWe must secure our border to end this national security and humanitarian disaster. https://t.co/CVM3Z13Hpe","date":"Mon Dec 13 19:42:30 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"CBO just released their findings on the final price tag of Democrats' \"Build Back Better\" spending bill.\n\nThe bill would increase the deficit by $3 trillion over 10 years!\n\nBBB would WRECK our country.","date":"Fri Dec 10 22:08:17 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Inflation is a hidden tax on everyone, and it hurts the working class the most.\n\nAs we hit historic inflation levels and basic necessities continue to climb in price, the Biden Administration continues to push massive spending.\n\nA recipe for disaster for working Americans.","date":"Fri Dec 10 15:45:32 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Further proof that this Administration is more interested in promoting a woke ideology than they are in solving real issues in America.\n\nPolling has shown over 70% of Americans believe our border is in crisis mode and must be addressed immediately. \n\nSecure our border, end CRT.","date":"Fri Dec 10 15:03:22 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Democrats’ “Protecting Democracy Act” (misleading name) is simply a response to Trump living rent free in Democrat heads. \n\nThey know this bill would weaken the President while supercharging the bureaucracy.  \n\nThey just can’t get over President Trump!\n\nI voted No.","date":"Fri Dec 10 00:55:46 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration is out of touch and seems unwilling to work on behalf of everyday Americans. This is where an America Last agenda gets you, reliant on others with no sense of self-sufficiency.\n\nThey've sabotaged our energy independence and must be held accountable.","date":"Thu Dec 09 21:33:36 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"President Biden's anti-energy agenda is having a terrible effect on working Americans.\n\nThe price of gas is up 55%.\nHeating costs are projected to be up 54%.\nTens of thousands of jobs have been killed or shipped overseas.\n\nThis is unacceptable.","date":"Thu Dec 09 21:33:36 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We must address the real issues at hand. Our president has been derelict in his duty to secure our nation.\n\nHe must be held accountable. At the very least, DHS Secretary Mayorkas must be impeached.","date":"Thu Dec 09 15:27:44 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Also of concern, encounters for the Rio Grande Valley sector since October 1, 2021, are over 100k.\n\nSince October 1st, RGV has arrested:\n\n26 sex offenders\n103 gang members\n291 criminal migrants","date":"Thu Dec 09 15:27:43 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden Administration has dramatically curtailed removals from the interior of the country through executive action.\n\nA report from the Center for Immigration Studies says a 90% reduction in removals has happened since 2019 when removals were historically steady.","date":"Thu Dec 09 15:27:43 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Before we talk about protecting the borders of other nations we should protect our own.\n\nCBP has encountered over 1.7 MILLION illegal aliens this fiscal year.\n\nWe have our own invasion to focus on.","date":"Thu Dec 09 15:27:42 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today we recognize the 80th anniversary of the attack on Pearl Harbor and the 2,403 Americans who lost their lives protecting our freedom.\n\nLet us honor them and the generation of Americans that heeded the call to push back against forces of authoritarianism and totalitarianism. https://t.co/jAW4YIeawc","date":"Tue Dec 07 14:52:48 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"America works when we let America work! 🇺🇸\n\nEnd the mandates\nEnd the lockdowns.\nStop sending US jobs overseas.\n\nWe must allow the American people back to work. https://t.co/W5EU32HWLG","date":"Mon Dec 06 14:32:26 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Removing the crude oil export ban opened the gates for investment around Texas ports.\n\nReimposing this ban would reverse this economic growth—killing jobs and disincentivizing investment. \n\nProud to join @RepPfluger and @RepRWilliams to oppose this continued war on U.S. energy.","date":"Sat Dec 04 15:21:24 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"''Let's follow the science,'' Cloud said.\n\n“Kids are very, very low risk when it comes to the pandemic. Let's free them. Let's get them back to learning. Let's stop this fearmongering. They're being raised in daily fear, and that's tragic.''\n\nhttps://t.co/4hna9yQpWf","date":"Sat Dec 04 14:28:24 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"My statement on voting in opposition to the Continuing Resolution: https://t.co/6TZONOJ4a0","date":"Fri Dec 03 00:30:34 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Military preparedness must not be sacrificed by the sword of “woke” bureaucrats.\n\nHappy to join my colleagues in crafting this important message.","date":"Thu Dec 02 22:52:17 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The video shows the Taliban parading in the streets to show off the equipment acquired from our botched exit.\n\nWe need accountability for the disastrous actions taken by the Biden Administration, and we shouldn’t massively fund a military that's satisfied with results like this.","date":"Thu Dec 02 13:59:24 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"A primary responsibility of our federal government is to protect American citizens. To do that, we fund the best-equipped defense force in the world. Our FY22 NDAA has many flaws, but most notably, it provides ZERO accountability for the debacle of the Afghanistan withdrawal.","date":"Thu Dec 02 13:58:41 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We must always stand for the life of the unborn!\n\nToday I went to the Supreme Court to join so many patriots in a STAND FOR LIFE during the oral arguments in Dobbs vs Jackson Women’s Health Organization. https://t.co/y303b7g5vT","date":"Wed Dec 01 23:31:53 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Last night I took to the House Floor to recognize the 80th anniversary of National Bible Week and to speak about how the Bible has influenced the identity of our nation. https://t.co/qmu3oMQbFb","date":"Wed Dec 01 20:53:41 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The American people overwhelmingly OPPOSE unconstitutional COVID-19 vaccine mandates.\n\n@SenateGOP must use every weapon at its disposal to fight for our freedom.","date":"Wed Dec 01 18:26:09 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"🚨Big news🚨\n\nA federal judge just blocked the Biden Administration's vaccine mandate for health care workers citing it as unconstitutional.\n\nHe stated that “indefinite states of emergency pose grave risks” to civil liberties.\n\nThis is the correct decision and good for America.","date":"Wed Dec 01 14:12:32 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"“Americans have the constitutional right to keep and bear arms. The proposed rule by the Biden Administration would put our country on the path to a federal gun registry, which infringes those second amendment rights.\"\n\nhttps://t.co/wYxcPLx3wE","date":"Tue Nov 30 16:13:14 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Out-of-control government spending is spiking inflation to record highs.\n\nUnder President Biden's leadership:\n\n-Used cars and trucks are up 26.4%\n-Steaks are up 24%\n-Eggs are up 11.6%\n-Electricity is up 11.2%\n\nInflation is taxation. And it hurts working Americans the most.","date":"Mon Nov 29 22:07:58 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Proud to cosponsor @RepJamesComer's bill to block the Biden Administration from forcing a COVID-19 vaccine on employees of federal contractors.\n\nAmericans should not be forced to choose between a vaccine and keeping their job.\n\nNo mandates, more freedom.","date":"Mon Nov 29 19:45:51 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The ATF collected 54.7 million gun records in 2021 alone, giving many gun owners cause for concern.\n\nToday I led 51 Republicans in opposition to a proposed rule which would lead to the collection of MORE gun records and could enable the creation of a national gun registry.","date":"Mon Nov 22 16:58:01 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today I voted NO on President Biden’s “Build Back Better” spending bill.\n \nFull statement below: https://t.co/Ci7Lj1aTnL","date":"Fri Nov 19 20:17:54 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This bill is NOT paid for and will add HUNDREDS OF BILLIONS of dollars to our national debt.\n\nRemember, Democrats said this would cost $0.\n\n#Math","date":"Fri Nov 19 00:06:35 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Congressional Budget Office confirmed that President Biden and his Democrat enablers have lied yet again to the American public.\n\nhttps://t.co/g4n4wZnsG1","date":"Fri Nov 19 00:06:02 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Employers should refrain from requiring their employees to receive the vaccine and fight the Biden Administration’s authoritarian mandate as it works its way through court. \n\nThis mandate was unconstitutional from the beginning, and I’m extremely pleased to see it suspended.","date":"Wed Nov 17 22:57:29 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This is great news for our nation and shows the influence outspoken Americans can have on their country.\n\nWorking Americans should not have to choose between their livelihoods and a vaccine mandate.\n\nhttps://t.co/AKQozd1cl6","date":"Wed Nov 17 22:56:30 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Biden administration inherited a solution and created a crisis.\n\nThat’s why last month I joined many of my Texas colleagues in calling for the impeachment of DHS Secretary Mayorkas who has failed to secure our border and has endangered Americans in the process.","date":"Wed Nov 17 21:07:43 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Over 160,000+ illegal immigrants were encountered at our southern border last month. The highest amount ever recorded for the month of October.\n\nAnother record-breaking month for President Biden at our southern border.\n\nhttps://t.co/xSeFyPV1W5","date":"Wed Nov 17 21:06:51 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This may be the most important speech I've given on the House Floor: \n\nhttps://t.co/IqJAzAy9hv","date":"Fri Oct 29 16:49:44 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We are honored to partner with FreedomWorks and Americans across the country who are working hard to restore America’s promise and preserve freedom and opportunity for generations to come.","date":"Thu Oct 21 21:57:01 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today we celebrate the signing of our Constitution, which forever enshrined the freedoms that we have today. May we live each day grateful for what it means to be an American and fulfill our responsibility to ensure the Constitution is preserved for future generations. https://t.co/d6iu6SSU67","date":"Fri Sep 17 20:24:29 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This is what Biden, Border Czar Harris and Homeland Security head Mayorkas call “Progress”.","date":"Thu Sep 16 18:11:35 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today we honor a promise we made 20 years ago - To never forget. We honor the first responders who serve our communities and daily embody the spirit of those who ran into the twin towers to help those trying to get out.  God bless you and thank you for your service. #NeverForget https://t.co/xIwNVD3H8O","date":"Sat Sep 11 13:22:19 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"America is the home of the free because of the brave. These service members exhibited bravery and courage of the highest order, and we should never forget their stories. \nhttps://t.co/RbKMKg1dWs","date":"Wed Sep 01 18:35:38 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"My statement on the situation in Afghanistan below ↓ https://t.co/soJszTBAxa","date":"Thu Aug 26 22:04:42 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Science according to Pelosi https://t.co/HyFx4jPXZa","date":"Thu Jul 29 22:34:20 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Americans go through heavy background vetting by the government  in order to fly domestically. Are the requirements the same for illegal immigrants?  Recent reports suggest otherwise. Why should the background standards differ for illegal immigrants? We want answers.","date":"Tue Jul 20 20:13:22 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As a constituent of the Texas House, I want my representative to show up for work.","date":"Fri Jul 16 21:26:16 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thank you to Senator Braun (R-IN) for pushing to get a vote on the Senate floor yesterday on S. 1916 https://t.co/FxHAYOUAL5, the Senate version of my House bill, H.R. 1524, Protecting the Right to Keep and Bear Arms Act of 2021. Great to see the Senate working to protect our #2A","date":"Thu Jul 15 15:04:19 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As we celebrate our great nation's 245th anniversary, we can be thankful for our inalienable rights, not instituted by government, but given to us by God. Let us always be working towards a more perfect union with liberty and justice for all. God bless you today. 🇺🇸 https://t.co/o71OtY0j8I","date":"Sun Jul 04 13:35:12 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"A quick Border 101 Brief for the Border Czar: \n\nCriminal cartels bad.  Border security good. https://t.co/z72GXleEeY","date":"Fri Jun 25 15:29:45 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"So many lives and livelihoods hung in the balance of what seemed to be Fauci’s personal science fair project.  Fauci seems to have been driven by political science more than actual science. I joined @FoxFriendsFirst with @jillianmele and @GriffJenkins to discuss. https://t.co/IzvvROHmtj","date":"Tue Jun 08 21:07:16 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"On this day in 1944, more than 160K Allied Troops accomplished the largest seaborne invasion in history to begin liberation of Western Europe. Today, the 77th anniversary of D-Day, we remember &amp; honor the heroes who risked &amp; sacrificed their lives to turn the tide of the war. https://t.co/1ROH9CgD9I","date":"Sun Jun 06 17:43:32 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The cartels control all of our southern border. Our Border Patrol have been turned into the last mile delivery system for the cartels. That is horrific by any standard. https://t.co/EOYkMDeLjp","date":"Thu Jun 03 19:03:15 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Trump inherited a border crisis and implemented a solution. Biden inherited a solution, all he had to do was nothing. Biden took away the solution and created a crisis. https://t.co/fUC9txC94l","date":"Wed Jun 02 14:06:07 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Nancy Pelosi once said, “Show me your budget, I’ll show you your values.”  We see no budget coming from the left, so I guess there are no values as well. I joined @stinchfield1776 @newsmax to talk about RSC budget being the antithesis to the spending spree coming from the left. https://t.co/nRE5Qx60OZ","date":"Fri May 21 14:01:48 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The federal government is over $28 trillion in debt.  I worked with @RSC Budget Task Force to propose a conservative budget that eliminates the deficit and cuts taxes:\n\n1️⃣ Provides legislation cost transparency \n2️⃣ Pro-life \n3️⃣ Protects 2A\n4️⃣ Sunsets inefficient federal agencies https://t.co/1IUHCV7JsY","date":"Wed May 19 19:16:11 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"These terrorist actions should not be tolerated, and Congress should condemn Hamas and stand with the Israeli people.\n\nThe U.S. must continue to back Israel in its right to defend itself from terrorists, which is why I signed onto @RepCarlos' resolution.","date":"Mon May 17 19:05:59 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"With the federal government already $28 trillion in debt, we need commonsense solutions to monitor the effectiveness of government.  \n\nI joined @BenShapiro @realDailyWire to talk about my bill, the Federal Agency Sunset Commission Act, which would prevent wasteful spending. https://t.co/pM9P8AZSZk","date":"Wed May 12 14:22:43 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Texas communities are experiencing sharp increases in vehicle thefts and dangerous pursuits that put Americans in harm's way, but “Border Czar” Kamala Harris has yet to even hold a press conference about the border. The Biden Administration and Congress need to act. (2/2)","date":"Mon Apr 19 19:18:50 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As the crisis at our southern border continues, the security implications are becoming readily apparent.  Recently, deputies from my hometown in Texas apprehended a human smuggler with ties to ISIS and MS-13. (1/2)\n\nhttps://t.co/Rao4d5eXfA","date":"Mon Apr 19 19:18:50 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Congrats @OralRobertsU!\n\nhttps://t.co/TcSc8BTkxe","date":"Fri Mar 19 23:57:26 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Follow me on Gab and Parler @RepCloudTX.","date":"Sat Jan 09 18:23:12 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Getting word that we will soon be convening to continue our work. I’m now getting a chance to review the video of what has been going on outside the Capitol &amp; it is absolutely heartbreaking. We have inherited such a gift as Americans, and I am grieved by what we have seen today.","date":"Thu Jan 07 01:42:15 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The violence and intimidation we’ve seen today undermines the very objectives of a free and functioning Republic and has absolutely no place here.\n\nA number of Capitol Police have taken the brunt of the violence. Please continue to keep them and their families in their prayers.","date":"Thu Jan 07 01:42:15 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thank you all who are praying for our nation’s capital at this time. \n\nWe are safe, but please pray for our Capitol Police who are taking the brunt of this senseless violence.","date":"Wed Jan 06 21:39:42 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"These unilateral actions — not taken by the state legislatures but judges and election officials — are not supported by the Constitution. Therefore, I will object. 6/6","date":"Wed Jan 06 17:48:35 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Three days ago, I once again took a solemn oath to 'support and defend the Constitution of the United States.' Today, I will be taking one of the most important votes in Congress regarding the Constitution and the Republic which rests upon it — certifying the election. 2/6","date":"Wed Jan 06 17:48:34 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Constitution establishes the framework upon which our Republic rests. The constitutional restraints on those in authority are not suspended in crisis — but are established, in part, to ensure that even in a crisis those authorities remain defined. 3/6","date":"Wed Jan 06 17:48:34 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Article II of the Constitution (reaffirmed in the 12th Amendment) makes clear that it is the state legislatures who define how electors are selected — in other words, how elections are managed within their state. 4/6","date":"Wed Jan 06 17:48:34 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"In many states, however, judges and election officials at varying levels instituted their own election processes. These new processes implemented, sometimes weeks leading up to Election Day, violated established state election laws. 5/6","date":"Wed Jan 06 17:48:34 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today, I will act on my obligation to ensure a constitutional republic by objecting to those of the contested states which unconstitutionally usurped the authority of their state legislatures to govern the election. 1/6","date":"Wed Jan 06 17:48:34 +0000 2021","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"It's been quite the year for our country and the world. As it comes to a close, Rosel and I want to wish you and yours a very merry Christmas. We've got so much to be thankful for as Americans.\n\nI pray that you would know peace in every way this Christmas season. https://t.co/EZERouz1ou","date":"Fri Dec 25 13:00:01 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"After Congress passes an Omnibus, we find out what was really in it. Yesterday’s bill included:\n\n- $14 million for the Kennedy Center\n- $10 million for gender programs in Pakistan\n- $4 million pilot program to kill murder hornets\n- A tax break for racehorse owners","date":"Tue Dec 22 18:12:06 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"5/ In a brief moment of candor, Speaker Pelosi recently admitted to playing political games with these bills, proving she and Senator Schumer were not negotiating in good faith before the election. \n\nThis broken process is a big reason America is in debt and fed up with Congress.","date":"Tue Dec 22 03:35:43 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"4/ Congress is supposed to ​first pass a budget and then pass 12 appropriations bills each year to fund the federal government. Most of this wasn't done in 2020 while Congress was consumed with impeachment hearings and Speaker Pelosi’s political negotiations over COVID relief.","date":"Tue Dec 22 03:35:43 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"3/ A basic duty of Congress is to manage the people’s checkbook, and Democrat leadership has shown yet again that rushing multiple-thousand-page bills through is preferable to the due diligence required for legitimate legislating, which is why I voted against the Omnibus.","date":"Tue Dec 22 03:35:42 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"1/ After months of delay, COVID relief has finally passed. I've supported additional funding for the PPP, as well as utilizing $500 million in funds set aside in the CARES Act that has so far not been used. ​I would have supported this bill had it been presented on its own.","date":"Tue Dec 22 03:35:42 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"2/ Unfortunately, the COVID relief was tied to a massive $1.4 trillion Omnibus spending bill that was introduced just hours before voting on the over 5,500-page bill. The Omnibus followed a pattern: it was negotiated by Democrat House leadership behind closed doors.","date":"Tue Dec 22 03:35:42 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Omnibus bill just posted - only 5592 pages to go before tonight's vote.","date":"Mon Dec 21 19:01:20 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Congrats to St. Paul Catholic for winning their third TAPPS Division IV State Championship with a 63-13 victory!","date":"Sat Dec 19 00:18:29 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Congratulations are in order for @ShinerISD on their championship win! Way to make Lavaca County proud!","date":"Sat Dec 19 00:14:46 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I introduced the Small Business Emergency Savings Account Act to help American businesses better prepare for the future and develop a built-in resiliency to deal with an unexpected crisis. Read about it in my op-ed @thehill ⬇ \n\nhttps://t.co/9EhLO4Rywb","date":"Mon Dec 14 15:27:28 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Washington is broken. This week provided us even more examples of that fact. https://t.co/PSCqq1ypDf","date":"Wed Dec 09 22:46:08 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I continue to support extending the Paycheck Protection Program as well as a targeted Covid relief package. It's unconscionable that Speaker Pelosi has continued to use the PPP as a political football when the lives and livelihoods of so many are at stake.","date":"Wed Dec 09 15:43:23 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"It also restricts funding that can be spent on a national emergency — like the border security crisis — and adds an unnecessary provision that would require small businesses to report information regarding ownership. Because of these provisions, I couldn't support the bill. (4/4)","date":"Wed Dec 09 00:58:57 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This final NDAA, however, stripped that prohibition. U.S. involvement must end, and Congress must reassert its constitutional role in dictating military activities. (3/4)","date":"Wed Dec 09 00:58:56 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Additionally, Congress did not authorize military support in Yemen, yet the U.S. has been helping a Saudi coalition of troops in the region for years. Over the summer, the House passed an NDAA that would prohibit logistical support to the Saudi-backed coalition. (2/4)","date":"Wed Dec 09 00:58:56 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This year's NDAA had key provisions that I could not support. To begin with, it would hinder the president's ability to withdraw troops from the Middle East. President Trump has made bringing our troops home a priority, and I stand with him in that. (1/4)","date":"Wed Dec 09 00:58:56 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We must ensure election integrity.\n\nhttps://t.co/iuJ6WJBdp2","date":"Tue Dec 08 16:49:33 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"My prayers are with those involved in the oil storage tank explosion in Corpus Christi today. I am deeply grateful to the first responders and frontline hospital workers assisting on the ground. My office has been working with local officials to monitor the situation.","date":"Sat Dec 05 23:45:47 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Unfortunately, too often the American people have seen many of our most powerful institutions corrupted. In the case of alleged election improprieties, justice delayed truly would be justice denied. The American people deserve, and justice demands, action now. (4/7)","date":"Tue Dec 01 22:01:25 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"@RepCarolMiller @RepGregMurphy @WarrenDavidson @RepJeffDuncan @CongressmanHice @replouiegohmert @RepMeuser @RepHagedorn @RepFredKeller @RepRussFulcher @RepTedYoho @RepDanCrenshaw @RepArrington @repkevinhern @RepBobGibbs @RepDavidRouzer (6/7)","date":"Tue Dec 01 22:01:25 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thirty-six Members of Congress joined the letter including @RepAndyBiggsAZ @congbillposey @RepRalphNorman @DesJarlaisTN04 @RepTedBudd @RepDanBishop @RepMarkGreen @RepBrianBabin @GReschenthaler @RepAndyHarrisMD @Lancegooden @TXRandy14 @RepRickAllen @RepJohnJoyce @ConawayTX11 (5/7)","date":"Tue Dec 01 22:01:25 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"@RepGregSteube @RepScottPerry @RepBillFlores @RepTimBurchett @RepTiffany (7/7)","date":"Tue Dec 01 22:01:25 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I appreciated the news that AG Barr had authorized federal prosecutors to pursue substantial allegations of election fraud.\n\nI sent an additional letter today because I'm concerned about the shocking lack of action from @TheJusticeDept following AG Barr's directive. (1/7) https://t.co/KsGFNvQBeW","date":"Tue Dec 01 22:01:24 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"If any investigative activity is currently taking place at any level of @TheJusticeDept, it has not been made known to the American people. (3/7)","date":"Tue Dec 01 22:01:24 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"There is no doubt it is the duty of @TheJusticeDept to ensure that the right to vote is sacred. There is also no doubt that the DOJ must investigate violence or threats of violence against election officials and any citizens participating in the election process. (2/7)","date":"Tue Dec 01 22:01:24 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"In spite of all we have faced this year, we still have much to be thankful for as Americans. From our family to yours, prayers and best wishes for a Happy Thanksgiving. https://t.co/yyHw8hPcJy","date":"Thu Nov 26 23:11:07 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today we honor our nation's veterans – those who have given of themselves for a cause greater than each of us. We also remember that the blessings of liberty we all enjoy are often preserved at a high price. \n\nMay God bless our veterans and their families! https://t.co/9jwMFEk3fL","date":"Wed Nov 11 15:03:17 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thank you, AG Barr, for responding to the concerns in our letter. A full and fair accounting of this election is important to restore the American people’s confidence in our election system.","date":"Tue Nov 10 00:34:36 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"@RepTomEmmer @RepJohnJoyce @RepJohnRose @Lancegooden @RepArrington @RepDanCrenshaw","date":"Fri Nov 06 21:53:02 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"My questions to AG Barr: What are you doing to ensure the integrity of the voting &amp; counting process right now? Will you commit to using all resources at your disposal to ensure only legal votes are being counted &amp; being counted in a fully transparent manner immediately?","date":"Fri Nov 06 21:48:36 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The U.S. Marshals Service is also available to ensure that judicial orders are carried out. When it comes to a federal election, it should not matter whether those judicial orders come from a state or federal court.","date":"Fri Nov 06 21:48:36 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Find the full letter here: https://t.co/tFs5k0m4zI\n\nThirty-eight members of Congress joined me: @RepAndyBiggsAZ @RepGregSteube @RepBobGibbs @congbillposey @RepRalphNorman @RepMGriffith @RepJeffDuncan @RepTedBudd @RepMarkGreen @RepAndyHarrisMD @DesJarlaisTN04 @RepDanBishop","date":"Fri Nov 06 21:48:36 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"@JodyHice @MikeKellyPA @TXRandy14 @RepBrianBabin @RepChipRoy @boblatta @RepBenCline @RepJamesComer @GReschenthaler @WarrenDavidson @RepScottPerry @RepJimBanks @RepRickAllen @RepMarshall @RepLaMalfa @RepBillFlores @RepBillJohnson @ConawayTX11 @repkevinhern @RepGrothman","date":"Fri Nov 06 21:48:36 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The letter reads \"@TheJusticeDept's Civil Rights Division Voting Section’s responsibility is to ensure that the right to vote is sacred. This not only means access to the ballot box, but it also means ensuring that no one’s vote is devalued by any means of voter fraud.\"","date":"Fri Nov 06 21:48:35 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The allegations of irregularities in the vote counting process should be concerning to everyone. I asked AG Barr to use the resources of @TheJusticeDept  to ensure that the process is conducted in a manner that is fully consistent with state and federal law.\n\n@realDonaldTrump https://t.co/uRghDtEVBJ","date":"Fri Nov 06 21:48:35 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"It's been three years since Hurricane Harvey wreaked havoc on Texas, and we are still working with some communities in TX-27 to fully recover to this day. My bills would encourage a culture of savings by making it easier to be financially prepared. (6/6)","date":"Tue Oct 27 18:49:44 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The coronavirus pandemic has caused disastrous economic impacts. Despite borrowing and spending trillions of federal dollars to provide direct financial assistance to the American people, many families still find themselves in precarious financial positions. (5/6)","date":"Tue Oct 27 18:49:44 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"With these new emergency savings accounts, individuals would be able to deposit and withdraw money from that account tax-free when they use it for qualified expenses, such as mortgages, rent, utilities, property taxes, child care, and health care. (4/6)","date":"Tue Oct 27 18:49:43 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The second bill would provide small businesses with the ability to save up to 25% of their payroll expenses tax-free in an emergency savings account. (3/6)","date":"Tue Oct 27 18:49:43 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The first bill would provide individual taxpayers with the ability to save up to $5,000 per year by making tax-free contributions to an emergency savings account. A married couple would be able to save up to $10,000. (2/6)","date":"Tue Oct 27 18:49:43 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I recently introduced two bills: the Emergency Savings Account Act and the Small Business Emergency Savings Account Act to help Americans to better prepare for the future. (1/6)\n\nhttps://t.co/48TzPpLB9Y","date":"Tue Oct 27 18:49:42 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Congratulations to our newest Supreme Court Justice, Amy Coney Barrett!\n\nJudge Barrett is an exemplar legal scholar &amp; judge with an impeccable record who holds the Constitution in high regard. She will continue to be a great public servant for America as a Justice.","date":"Tue Oct 27 00:09:51 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I sent a letter to @AjitPaiFCC addressing the latest incident where Facebook and Twitter censored or otherwise manipulated algorithms affecting the distribution of a New York Post story about alleged emails from Hunter Biden. (1/3)","date":"Tue Oct 20 18:44:22 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Exercising editorial control of the news is ultimately not the role of an online platform which should remain neutral if it wishes to enjoy Section 230 protections. \n\nNineteen Members of Congress joined the letter. Read it here: https://t.co/NkMeJEXHaB. (3/3)","date":"Tue Oct 20 18:44:22 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I commend @AjitPaiFCC for his statement that the FCC would move forward with a rulemaking process to clarify Section 230 of the Communications Decency Act. (2/3)","date":"Tue Oct 20 18:44:22 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"My bill would create a bipartisan Sunset Commission. Each year, the Commission would provide recommendations on whether agencies should be consolidated, continued, or abolished. Congress would take an up or down vote. (3/4)","date":"Wed Oct 14 13:57:23 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We owe today’s taxpayers, as well as future generations, to spend their money wisely. While no single $100 million or even $1 billion program is responsible for our nearly $27 trillion national debt, they all add up. They should be subject to regular oversight and review. (4/4)","date":"Wed Oct 14 13:57:23 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"One of the reasons Washington continues to mortgage the future of America is the massive size and scope of the federal gov't. Many programs are stood up to address an urgent issue but later outlive their usefulness. Others launch with the best of intentions but don't work. (2/4)","date":"Wed Oct 14 13:57:22 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"With the federal government nearly $27 trillion in debt with no plan on the horizon to ever pay it back, I introduced the Federal Sunset Commission Act. This legislation would reign in some of Washington's uncontrolled spending. (1/4)\n\nhttps://t.co/ZlCJMfn3qG","date":"Wed Oct 14 13:57:22 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Important information from @txglo⬇️","date":"Thu Oct 01 14:22:12 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":".@realDonaldTrump signed an executive order stating that a baby born after an abortion attempt will be given life-saving care. It’s shocking that Congress voted down a bill last year that would do this very thing. Thank you @POTUS for directing the federal gov't to protect life!","date":"Tue Sep 29 13:20:44 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I would like to congratulate @POTUS on a stellar Supreme Court nominee in Amy Coney Barrett. Judge Barrett embraces an originalist interpretation of the Constitution, which will serve our nation well. I look forward to a speedy confirmation process in the Senate.","date":"Sat Sep 26 21:55:33 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Rosel &amp; I are praying for @RonPaul and his family. He is a great patriot and honorable man. I hope he continues to recover well.","date":"Fri Sep 25 20:08:44 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Liberal policies often attempt to dismantle our oil &amp; gas markets, which in turn results in soaring electricity prices &amp; financial harm. I'll continue to promote fair policies in Congress while encouraging private sector innovation &amp; cutting burdensome federal regulations. (3/3)","date":"Fri Sep 25 17:24:19 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I firmly believe the United States must maintain energy independence and dominance. Rather than turning to our adversaries, our allies can now rely on us for energy, further strengthening our position as a leader on the global stage. (2/3)","date":"Fri Sep 25 17:24:19 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":".@AEA named me an Energy Campion in Congress after releasing its 2020 energy scorecard, which tabulates scores based on voting &amp; co-sponsorship decisions on legislation affecting energy &amp; environmental policy. (1/3) https://t.co/enwF2LV4E3","date":"Fri Sep 25 17:24:19 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":".@SenatorLankford and I are seeking to empower states to end federal subsidies for abortion providers and to ensure quality healthcare is made available to women. (4/4)","date":"Wed Sep 23 18:08:36 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"A non-partisan @USGAO report revealed that Planned Parenthood received $1.2 billion in Medicaid reimbursements over a three year period, accounting for 80 percent of the abortion provider’s joint federal-state funding stream. (3/4)","date":"Wed Sep 23 18:08:36 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"60% of Americans object to taxpayer-funded abortions. Yet abortion providers, like Planned Parenthood, have access to billions in state Medicaid dollars — which the taxpayer reimburses at 90 percent for family planning services. This is a problem. (2/4)","date":"Wed Sep 23 18:08:35 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"For too long, abortion providers have operated on the taxpayer’s dime, while performing elective abortions in the name of \"healthcare.\" @SenatorLankford &amp; I introduced the Women’s Public Health and Safety Act to address this issue. \n\nRead more here ⬇️(1/4)\nhttps://t.co/qqHnDZRcSn","date":"Wed Sep 23 18:08:35 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The U.S. should take a global leadership role in developing AI. Doing so will help put our country on a stronger footing as we recover from the coronavirus pandemic and rebuild towards a better future. That's why I joined @HurdOnTheHill's resolution as an original cosponsor.","date":"Fri Sep 18 14:44:05 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Constitution, the greatest political document ever written, is inspiring to this day. Perhaps more importantly, it reminds us of our liberties as Americans while at the same time limiting the reach of our federal government. May we never take it for granted. #ConstitutionDay https://t.co/uK2XvTCqE2","date":"Thu Sep 17 20:39:17 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Chinese Communist Party commits human rights abuses against Uyghurs, yet @Disney filmed parts of Mulan in the region where Uyghur internment camps are located. The film credits thank 4 Chinese propaganda departments.\n\nI joined my @GOPoversight colleagues on this letter:","date":"Tue Sep 15 17:03:26 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Our office is closely monitoring the situation regarding the pipeline explosion in the Port of Corpus Christi. Local authorities have responded and we’re actively engaged, ready to assist in any way we can. My prayers are with everyone involved.","date":"Fri Aug 21 18:21:39 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"It was a pleasure to work with FEMA and Aransas County on the Cedar Bayou recovery project. \n\nThis is one of the many examples where Texas gets it. We understand the importance of protecting the environment and strengthening our local economy.\n\nhttps://t.co/BNUOyDHRju","date":"Fri Aug 21 14:13:15 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Violence and riots have continued throughout our country in cities like Portland and Seattle. For nearly two months there's been daily chaos. This, of course, should not be allowed in any city, yet many mayors have refused to stand up. (1/2) https://t.co/lxaIOrWyIU","date":"Wed Jul 29 20:26:39 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We respect law enforcement in our part of Texas but that's not the case in many cities with leadership that has allowed lawlessness. The federal government has sent in forces to restore safety and security. \n\nThe anarchy needs to stop. (2/2)","date":"Wed Jul 29 20:26:39 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":".@realDonaldTrump looking out for coastal Texas. https://t.co/Z6BZQXDVPF","date":"Mon Jul 27 01:21:34 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We remember those who put their lives on the line when signing the Declaration of Independence and those who have worked through the generations to preserve and advance these liberties. We have so much to be grateful for as Americans.\n \nHappy Independence Day!! (2/2)","date":"Sat Jul 04 15:04:39 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"🇺🇸 Let Freedom Ring 🇺🇸\n \nToday we celebrate the birthday of this great nation. A nation founded on the proposition that we are all created equal.  That our right to life, liberty and the pursuit of happiness is not a grant from Government but is God-given. (1/2) https://t.co/IUosi0Jkas","date":"Sat Jul 04 15:04:38 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today, the United States-Mexico-Canada-Agreement goes into force! \n\nThroughout my time in Congress, one of the topics that we have often discussed back home in Texas is trade. \n\nThis new trade agreement is a win for our state and the American people! 🇺🇸","date":"Wed Jul 01 20:52:57 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Israel is an ally and a reliable friend of the United States, as we share many common democratic values. \n \nOur country must continue to back Israel in its right to make sovereign decisions independent of outside pressure.","date":"Fri Jun 26 20:15:22 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Most concerning is the CDC assumed”contact tracers would get consent from patients. I authored a letter to HHS requesting they correct the record clearly and quickly. Americans must be protected from encroaching government surveillance. https://t.co/Y7ClI46HbF","date":"Fri Jun 26 20:10:19 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"While contact tracing can be an effective method of identifying potential cases of COVID, the CDC has not provided substantial parameters for how contract tracers should use smartphone technology with respect to individual privacy.","date":"Fri Jun 26 20:10:19 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I asked him to move as swiftly as possible to complete this investigation and to report back to Congress and to the American people with DOJ's findings so that we can make better-informed policy decisions as we seek to move forward. (3/3)","date":"Mon Jun 22 14:57:23 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Congress is responding to recent events by looking at proposals to reform policing in America.\n\nI wrote a letter to Attorney General Barr regarding @TheJusticeDept investigation into potential civil rights violations by police in the senseless death of George Floyd. (2/3) https://t.co/gtKHEFcvWe","date":"Mon Jun 22 14:57:23 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Many Americans have taken to the streets to exercise their First Amendment rights to peacefully assemble and protest in the midst of national turmoil. Sadly, other Americans have taken advantage of these protests to incite violent riots. (1/3)","date":"Mon Jun 22 14:57:22 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I toured Goudeau Farms and JD Hudgins Ranch to catch a glimpse of the hard work they put in each and every day.\n\nThey're ready for whatever comes their way, whether it's a pandemic or economic downturn. They’re constantly working to be stronger &amp; better than before! https://t.co/2ZNWFuuLND","date":"Fri Jun 19 15:01:00 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Many have faced economic and physical hardships as a result of COVID-19. I volunteered with @foodbankofGC to help meet some of those needs. Thanks to the folks at the food bank, hundreds of families in the Golden Crescent have been served. https://t.co/aNblfkbkBT","date":"Thu Jun 18 16:37:33 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Excited to watch today's @SpaceX launch at @NASA! 🇺🇸 https://t.co/cBDXjQjoze","date":"Sat May 30 16:39:56 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":".@POTUS is right about FISA.\n\nThe American people should be very concerned about the abuse of power and the potential for it to happen again. @realDonaldTrump has said this a number of times: If they can do this to him, they can do this to you.","date":"Fri May 29 20:20:48 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Joined this lawsuit because as an elected representative, we  have a constitutional obligation to represent our constituents and honor the public trust we have been given. \n\nWe should not run away from this responsibility, especially in adversity.","date":"Wed May 27 19:02:55 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Farmers &amp; ranchers whose operations have been impacted by COVID-19 can apply for direct financial relief through the Coronavirus Food Assistance Program. More info here: https://t.co/BN3Hj4xw64\n\nI am grateful for their work – especially throughout the pandemic.","date":"Tue May 26 16:16:40 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"It’s important in times like these that we remember what matters most and continue to honor those who’ve sacrificed so much for our nation. Outdoor activities like this one carry an extremely low risk of exposure and are completely voluntary.","date":"Fri May 22 14:41:58 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Mothers make a tremendous impact in the lives of their children through their strength, love, and care. Grateful to my mom and my wife for being there for their kids.\n\nTo all the Moms in our country, thank you for all you do to bless the people in your life! https://t.co/boQMfhKSTZ","date":"Sun May 10 15:00:00 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"To our nation's teachers during Teacher Appreciation Week: Thank you!\n\nNow, more than ever, you've found creative and unique ways to help students learn, contributing ultimately to the success of the entire country. We are grateful for you!","date":"Tue May 05 20:31:40 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Millions in taxpayer dollars sent to the WHO, as they've seemingly turned a blind eye to COVID-19 propaganda from the Chinese Community Party and at times parroted the same talking points.\n\nWhy should the U.S. fund an entity that does not further the interests of our republic?","date":"Thu Apr 30 18:11:11 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Yesterday, two of the @GOPoversight subcommittees I'm on met via teleconference with @US_FDA to discuss pharmaceutical supply chain security.\n\nWe must work together to secure our critical supply chains and reduce our reliance on China for our drugs and essential ingredients.","date":"Tue Apr 28 13:10:44 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Small Business Administration reopened the Paycheck Protection Program this morning. Small business owners should apply to this loan program as soon as possible. \n\nI want the families across our part of Texas who depend on small businesses to know there is help available.","date":"Mon Apr 27 15:36:34 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The government of China has taken advantage of the good will the U.S. has shown for years. Now the Chinese Communist Party has manipulated the coronavirus pandemic at every turn — in spite of the heartbreaking human toll. \n\nDiscussed the latest with @OANN:\nhttps://t.co/fESJzfp05x","date":"Fri Apr 24 15:00:35 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Small businesses owners in Texas and across the country: more funding is available to deal with the economic shutdown imposed by coronavirus.\n\nNext up – reopening our economy.","date":"Fri Apr 24 01:41:50 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Many small businesses in Texas benefitted from the Paycheck Protection Program, and thanks to the passage of additional funding today, many stuck in limbo will now have access to the loans they need to support their employees through this economic shutdown.","date":"Fri Apr 24 01:37:18 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Social Security beneficiaries with dependent children under age 17 who did not file a tax return in 2018 or 2019 need to go the IRS Non-filer tool at the link below so they can receive the $500 payment for each child. Deadline is TODAY.\n\nhttps://t.co/qUo1NxKvML","date":"Wed Apr 22 15:02:08 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Good news for today ➡️ Cheniere announced it has pledged more than $1 million to organizations that provide essential services to those most in need and at risk during the COVID-19 outbreak.\n\nhttps://t.co/vnDpTR1x2v","date":"Mon Apr 20 14:37:34 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Paycheck Protection Program is serving as a lifeline to our nation’s small businesses and workers during this pandemic. Now it's run dry. Congress should prioritize American small businesses and families instead of political agendas. What’s the hold up, Speaker Pelosi?","date":"Thu Apr 16 17:34:17 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"You can submit your information at the link below if you did not file taxes in 2018 or 2019 in order to receive your rebate check. \n\nNo further action is needed by taxpayers who filed tax returns in 2018 and 2019 and most seniors and retirees.\nhttps://t.co/WvVm6dXc08","date":"Thu Apr 16 13:36:00 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As we work to mitigate COVID-19, we must be careful to ensure our constitutional rights are preserved.\n\nJoined my @freedomcaucus colleagues in signing this letter to @POTUS encouraging individual privacy protections be respected — even by Big Tech — and especially in a crisis.","date":"Wed Apr 15 19:02:00 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This week, I've spoken with a number of healthcare providers across south Texas. These folks are daily on the frontlines of the national response to COVID-19. I'm working to ensure their story is being heard. \n\nI signed onto this letter to ensure they get the support they need:","date":"Wed Apr 15 14:07:43 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The American spirit has been evident despite the COVID-19 pandemic as communities all across the country have pulled together to take care of each other. \n\nHere's a good news story from Jackson County:\nhttps://t.co/RG33tVVQM3","date":"Tue Apr 14 16:10:25 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This Easter Sunday, may we reflect on the importance of faith as we remember the death and resurrection of Jesus Christ. He is risen!\n\nJohn 11:25-26 https://t.co/6BgwebkNGp","date":"Sun Apr 12 18:52:15 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The government acted to effectively shut down our economy to fight the coronavirus. So, it is critically important that we provide this much needed assistance to the American people as quickly as possible to act as a bridge to the other side of this crisis. (2/2)","date":"Fri Mar 27 21:30:07 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Our country is facing an unprecedented epidemic that threatens our public health and our economic security. While I have reservations about some of the provisions in the CARES Act and the enormous cost, I was on the House floor and answered yes to the voice vote. (1/2)","date":"Fri Mar 27 21:30:06 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Small businesses across the nation and at home in Texas are suffering as a result of the coronavirus. I've heard from many local business owners who don't know what the future may hold.\n\nThere is more in the works, but @SBAgov is offering disaster loans: https://t.co/ODB1LFoCfE","date":"Tue Mar 24 16:57:23 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"After decades of unethical trade practices and human rights violations, the coronavirus crisis should be the final straw against China’s case for global leadership.\n\nRead more in my op-ed:\n\nhttps://t.co/6HISEInORn","date":"Mon Mar 23 16:54:41 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As the federal government continues to mitigate issues arising from the spread of the coronavirus, please be aware of this good news:\n\nTax Day has been changed from April 15 to July 15. \n\nhttps://t.co/kIr6bHJ9lR","date":"Fri Mar 20 16:10:00 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I explained in more detail why I voted no on the Families First Coronavirus Response Act in the @Vicadvocate :\n\nhttps://t.co/kLhdKRoms5","date":"Tue Mar 17 15:50:38 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"If you were planning to travel to Washington, D.C., please also be aware of other closures in the city, including a number of traditional historic sites:\n\nhttps://t.co/h4f04DPInk","date":"Mon Mar 16 16:06:43 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The U.S. Capitol will be closed to all public tours through March 31 as a precautionary measure against the coronavirus. Please contact my office at (202) 225-7742 if you have any questions.","date":"Mon Mar 16 16:06:42 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"After two days of closed door negotiations between Speaker Pelosi and the Secretary of the Treasury, Members of Congress were given less than 30 minutes to review the 124 page text before taking a midnight vote. (2/3)","date":"Sat Mar 14 18:54:13 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Last week, I voted in favor of $8.3 billion to support the recovery effort surrounding the COVID-19 pandemic and would have liked to have been able to vote yes again, but last night’s bill and the process surrounding it represents everything that is broken in Washington. (1/3)","date":"Sat Mar 14 18:54:13 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Although some provisions were things I would support, others were harmful, including new burdens on small businesses while large businesses were exempt. The bill language left too many questions unanswered with no opportunity to debate, amend, or even ask questions. (3/3)","date":"Sat Mar 14 18:54:13 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"TX-27: Here's where to get updated information on coronavirus developments and answers to FAQs:\n\n@TexasDSHS | https://t.co/7SRE2xTzJf\n@CDCgov  | https://t.co/exG6qctUqf\nhttps://t.co/qkPDzwmilL\n\nIf you need further assistance, don't hesitate to contact my office.","date":"Thu Mar 12 22:17:52 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The federal government continues to work with state and local officials to contain the spread and impact of the coronavirus. Here are some things you should know ⬇️ https://t.co/zlGaI08895","date":"Mon Mar 09 13:40:14 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Happy to sign onto an amicus brief in support of the Little Sisters of the Poor as they fight to uphold religious liberty in our country. https://t.co/bxgmYvOV2K","date":"Fri Mar 06 17:26:49 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Good news for Seadrift, Texas! Improving the infrastructure of the harbor there is a win for local businesses.\n\nhttps://t.co/6qHUCKWPt6","date":"Tue Mar 03 14:38:29 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"#OTD in 1836: The Texas Declaration of Independence was adopted by 59 delegates, each representing one of the settlements in Texas.\n\nGod bless Texas! https://t.co/pP710wndoA","date":"Mon Mar 02 16:39:28 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Great to see folks with the USA Rice Group! \n\nSome of these farmers traveled from El Campo &amp; Ganado, Texas to DC. We discussed the issues they’re concerned about and trade policy. We're going to keep working for strong international trade agreements that help our farmers. https://t.co/WQezFieBu4","date":"Thu Feb 27 20:19:32 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"TOMORROW: A veteran with no known next-of-kin will be laid to rest at 2pm this Thursday at the Coastal Bend State Cemetery. The public is invited, so if you have the opportunity please join our staff and help honor U.S. Navy Veteran Don Lesley Ward.","date":"Wed Feb 26 16:10:14 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The tie between the U.S. and India is strong. \n\nThank you @POTUS for continuing to develop the relationship between our countries 🇺🇸🇮🇳 #NamasteTrump\n\n@WhiteHouse @realDonaldTrump","date":"Tue Feb 25 19:06:01 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I had the pleasure of hearing from representatives from Del Mar &amp; Wharton County Junior Colleges, both of which are located in south Texas.\n\nCommunity colleges provide flexibility for people looking to strengthen their education and help drive our state and national economy. https://t.co/p8JBgOQSY6","date":"Fri Feb 14 18:58:25 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Honored to be recognized by @SBAList for helping drive policies like removing hidden abortion surcharges &amp; ending federal funding for research that uses the body parts of aborted babies.\n\nWe’ve made progress, but we must continue to support a culture of life in Congress. https://t.co/B2ja2cfTjD","date":"Fri Feb 14 15:27:53 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"“In January, the share of Americans aged 25 to 54 working or looking for work ticked up to 83.1% from 82.9% in December, the highest rate since 2008.”\n\nConservative economic policies are placing more Americans in stable, full-time jobs.\n\nRead for yourself ⬇️","date":"Thu Feb 13 22:22:06 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Stopped by the Pentagon for a briefing on global threats to the U.S., from China to the situation at the southern border. Thankful for those in our Armed Forces who protect our country. https://t.co/abjSqet7mC","date":"Tue Feb 11 17:38:11 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Great news for Texas and the entire country! @POTUS allotted $100 million in the FY21 budget for the channel improvement project at the Port of Corpus Christi.\n \n@realDonaldTrump has shown strong leadership as he's strategically worked towards American energy dominance.","date":"Tue Feb 11 16:58:34 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I look forward to finally continuing the work we're doing to ensure effective representation for our district and to move the ball forward on issues of real importance to the people in our part of Texas.","date":"Thu Feb 06 15:15:22 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The partisan effort to impeach the president began long ago. \n\nFor months, Washington has wasted American taxpayer dollars, putting politics above the needs of the country. It’s past time for Congress to get things done for the American people so that we can move forward.","date":"Wed Feb 05 22:11:44 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We've made tremendous gains that are uplifting and providing opportunities for middle-class families in Texas 🇺🇸🇺🇸🇺🇸\n\nI especially appreciated @realDonaldTrump's message acknowledging our unique place in history % challenging us to continue to work toward an even brighter future.","date":"Wed Feb 05 14:54:26 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":".@POTUS is about to sign the United States-Mexico-Canada Trade Agreement here at the @WhiteHouse. I'm looking forward to the resulting economic growth at home in Texas and across the nation.\n\nFinally getting something done in Washington! https://t.co/g9X6XuTMY5","date":"Wed Jan 29 16:55:29 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"75 years since the liberation of Auschwitz.\n\nRosel and I were recently in Israel and visited Yad Vashem in Jerusalem. It was heartbreaking to walk among remnants of the Holocaust and moving to witness the effort to remember the names of those that evil tried to destroy. https://t.co/ofNYHJCkxR","date":"Mon Jan 27 23:11:29 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Every life has value. That’s why people across the country gathered today to be a voice for the voiceless. It’s essential that we protect the right to life, liberty, and the pursuit of happiness. https://t.co/8Jg98sE3D5","date":"Fri Jan 24 22:12:22 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"On January 22, 1973 — in a historic moment of judicial overreach and without legislative action — 9 justices declared abortion a so-called “right\" in the case of Roe v. Wade.\n\nSince then, 61 million babies have been robbed of the right to life, liberty, &amp; the pursuit of happiness https://t.co/BHbUK3SmrR","date":"Wed Jan 22 15:07:06 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The border wall system includes more walled sections in key locations, but also:\n\n- updating surveillance technology\n- improving the accessibility of roads\n- increasing the manpower necessary to monitor the entire length of it","date":"Tue Jan 21 16:28:57 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Southern border wall update:\n\n▫️ 101 miles completed\n▫️ 133 miles under construction\n▫️ 342 miles in pre-construction\n\nPhoto credit: U.S. Border Patrol https://t.co/GfLirOsque","date":"Tue Jan 21 16:21:55 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"At great personal cost, Dr. Martin Luther King Jr. led a life marked by moral conviction and strove to make our country a better place.\n\nI pray that his willingness to stand for truth continues to challenge and inspire us. https://t.co/rbDAbRjB7S","date":"Mon Jan 20 15:26:15 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"United States-Mexico-Canada Trade Agreement:\n\n☑️ Passed the House\n☑️ Passed the Senate\n☑️ On its way to President Trump's desk to be signed into law\n\nhttps://t.co/CVwEDcXs8g","date":"Fri Jan 17 20:25:04 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Founding Fathers forever enshrined the inalienable right of religious liberty in the U.S. Constitution.\n \nToday, we are truly blessed to have the freedom to worship as we choose and preserving that liberty is one of our most important tasks in Congress.\n\n#ReligiousFreedomDay https://t.co/WMm9nhvQ3F","date":"Fri Jan 17 02:12:07 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Washington spends taxpayer dollars without counting the full cost. \n \n@SenMikeLee, @RepEdCase, and I are requesting that Congress weigh the real price of legislation instead of  ignoring costs to make new programs seem like they’re not as expensive. \n\nhttps://t.co/5bwwn1OJIr","date":"Thu Jan 16 15:59:25 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Impeachment proceedings have never been about a honest search for truth, and today, after withholding her Articles of Impeachment for weeks, Speaker Pelosi's finally sending them to the Senate.\n\nLet's end this charade &amp; get back to doing the work we were sent to Washington to do. https://t.co/JLZyDaHXyE","date":"Wed Jan 15 15:16:08 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"ICYMI: Two big news items for Congress this week.\n\n☑️I voted against the War Powers Resolution. Congress should take up serious legislation to clearly address constitutional war powers.\n☑️We're calling on Speaker Pelosi to finally send the impeachment articles to the Senate. https://t.co/SHW5iwPRwT","date":"Fri Jan 10 16:37:12 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I can tell you there's a bipartisan effort in Congress to address constitutional war powers authority, but the resolution at hand today is simply a reactionary effort by Speaker Pelosi to criticize the president’s proper and decisive actions against Iranian aggression.","date":"Thu Jan 09 23:33:37 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"My take on the situation with Iran ⬇️⬇️⬇️ https://t.co/rDyPGSU0rP","date":"Thu Jan 09 18:58:33 +0000 2020","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This is a victory for American taxpayers. We're making sure their hard earned dollars aren’t unknowingly used to pay for another person’s abortion:\n\nhttps://t.co/TrjSnuhmWa","date":"Fri Dec 20 19:17:17 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Despite unfair and, even at times, secret hearings, this impeachment investigation uncovered no evidence that the president committed impeachable offenses. This is a single-party effort in Congress to remove a sitting president. (1/2)","date":"Thu Dec 19 01:47:32 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Historically, impeachment proceedings have been very deliberate, defined, and transparent, but this investigation was conducted in a top-secret room in the basement of the Capitol, having neither bipartisan support nor the basic norms of due process and fairness. (2/2)","date":"Thu Dec 19 01:47:32 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I voted no. \n\nIt’s a basic duty of Congress to maintain a budget, cut the deficit, and provide a long-term spending plan, and the votes today did not accomplish any of those goals.\n\nThe people of south Texas didn’t send me to Congress to recklessly spend taxpayer dollars.","date":"Tue Dec 17 21:53:08 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Excited to see my bill to help our veterans pass today with bipartisan support. It's going to improve the quality of healthcare veterans receive from the VA.\n\nIt's now on its way to the Senate where it will hopefully pass and then head to @POTUS' desk!","date":"Tue Dec 17 21:47:21 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Truth, transparency, and justice have been lacking throughout this entire process.\n\nDenying the minority a hearing is just the latest example.","date":"Tue Dec 10 22:55:46 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I asked the Chief Medical Director of Missouri’s Planned Parenthood to describe a typical abortion procedure in medical terms @GOPoversight. She refused. Pro-abortion advocates cloak their language in euphemisms like “right to choose” to avoid the tragic reality of abortion. https://t.co/azG2KrQBvV","date":"Fri Nov 15 18:58:53 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Despite what’s going on in Washington, my goal is transparency and keeping you informed. One way to do that is by signing up to receive my eNewsletter in which I share important updates and ask your opinion on issues Congress will be considering.\n\nhttps://t.co/IonnaVuoYf","date":"Wed Nov 06 17:21:35 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This news from the Administration today is a win for religious freedom! Faith and family are essential to our society &amp; we must protect the constitutional rights of faith-based adoption agencies.\n\nhttps://t.co/kF0mTQCH2a","date":"Fri Nov 01 21:05:29 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Every day it’s only more obvious that Washington is corrupt and broken.\n\nI voted against the so-called impeachment resolution. It doesn't grant rights to the minority or guarantee transparency for the American people. Our country should not continue down this path.","date":"Thu Oct 31 19:29:45 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Unborn children have a right to life and taxpayer money should never be used to take that right away. (3/3)\n\nRead the letter here: https://t.co/X7g26FMnDs","date":"Fri Oct 25 20:07:13 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Obamacare passed with the promise that taxpayers wouldn't have to subsidize abortion. Yet hidden abortion surcharges were still included. Without realizing it, many people’s hard-earned dollars have supported abortion. \n \nThis needs to stop and time is running out. (1/3)","date":"Fri Oct 25 20:07:12 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I sent a letter to HHS Secretary Alex Azar requesting that his department put an end to this practice. If it isn't made final before November 1st, health insurance plans will be able to continue billing the hidden abortion surcharge through 2020. (2/3)","date":"Fri Oct 25 20:07:12 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I support resolution to censure Rep. Adam Schiff because I believe that he should stop holding secret hearings in the basement of the Capitol and instead give the American people the transparency they deserve. He must be held accountable for refusing access to the public.","date":"Tue Oct 22 13:22:46 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I was sad to learn this morning of the passing of Oversight Committee Chair Elijah Cummings.  I appreciated of him that his service was driven by a deep personal faith and desire to see the best in our nation — and in the kind and respectful way he treated others.","date":"Thu Oct 17 19:48:35 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Impeachment proceedings should be deliberate, defined, and transparent. The \"impeachment\" proceedings happening in Washington right now are being conducted in a top-secret room in the basement of the Capitol.\n\nThe American people deserve access to the complete story. https://t.co/apoxK3lpLp","date":"Thu Oct 17 01:31:19 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":".@POTUS has selected a capable Texan in @RepRatcliffe to be the Director of National Intelligence. I hope @senatemajldr moves quickly to ensure his confirmation.","date":"Mon Jul 29 21:07:02 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thank you @realDonaldTrump for working to keep taxpayers dollars from funding the abortion industry. In the past, abortion businesses like Planned Parenthood have used Title X grant money as an abortion slush fund. But this new rule will change that. https://t.co/gdzRAZDlvo","date":"Wed Jul 17 19:03:25 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Wednesday marked the one year anniversary of when I was sworn into office. What have I learned in that year? That many Members of Congress would rather talk about a problem rather than actually fix it.\n \nThankfully, the President has made the crisis at the border a priority. https://t.co/00fVXkgIZ9","date":"Fri Jul 12 20:19:13 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"There is no end to the border crisis in sight. Congress is allowing cartels to massively profit because we refuse to close off the avenues they are using to smuggle migrants. We must act now.\n \n-Fix the Flores Settlement\n-Build the border wall\n-Reform broken asylum laws https://t.co/MeEem4LsLO","date":"Fri Jul 12 17:20:46 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"(1/2) @SenHydeSmith and I are pushing for an end to an Obama-era regulation that snuck a hidden abortion surcharge into the healthcare plans of many unsuspecting Americans.","date":"Tue Jul 09 18:46:56 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"(2/2) We sent a letter signed by 25 senators and 103 representatives to HHS Secretary Alex Azar urging him to finalize the removal of the abortion surcharge before 2020 Open Enrollment begins. You can read the letter here: https://t.co/D28vxVHJBs","date":"Tue Jul 09 18:46:56 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Standing firm has paid off, and emergency funding is headed to the border without the harmful restrictions on border enforcement that liberals in the House had originally insisted on. However, it’s only a temporary stopgap so Congress must do more. https://t.co/hi6LTf7k0k","date":"Fri Jun 28 19:39:36 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"A phrase I heard repeatedly from Border Patrol agents when I toured the southern border was “no end in sight.” What’s already a crisis will only get worse unless Congress acts. That's why we must fund the President’s $4.5 billion emergency supplemental request. It’s time to act.","date":"Wed Jun 12 19:32:34 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"refuses to deal with our $22 trillion national debt and cannot even be bothered to provide humanitarian aid for the crisis on our border, feels that Congress deserves a pay raise. 2/2","date":"Sat Jun 08 18:56:11 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I am 100 percent OPPOSED to House Leadership's attempts to pass a pay raise for Congress.\n \nYesterday I filed an amendment to prevent any funds in the upcoming appropriations bill from being spent on a congressional pay raise. It is unbelievable that House Leadership, which 1/2","date":"Sat Jun 08 18:56:10 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This expansion of the Port of Corpus Christi is critical for U.S. jobs and for strengthening our global energy dominance.\n\nIt took a real team effort to make this happen, and I'm esp. thankful for @realDonaldTrump recognition of this great opportunity.\n\nhttps://t.co/bUmYYpGM4x","date":"Fri Jun 07 20:53:53 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"This is a positive development for protecting the dignity of human life. No one should be profiting from the tragedy of abortion, and the government has no business funding this unethical research.","date":"Thu Jun 06 19:46:58 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Good news! A while back, I &amp; other Pro-Life reps sent a letter to Sec. of @HHSGov urging an end to federal contracts that fund experiments on aborted babies. Thankful for @realDonaldTrump's announcement that this inhumane practice will be ended.\n\nhttps://t.co/ihjZ47qqAO","date":"Thu Jun 06 19:46:57 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"At the @PoccaPort groundbreaking ceremony, we celebrated the beginning of the channel expansion project. For those in Texas, this means more jobs and a thriving economy. For our country, exporting American energy helps our balance of trade. https://t.co/1Mfos9sm2N","date":"Thu May 30 17:22:50 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"as well as to address the loopholes and long-term issues with our immigration system that have led to the current crisis. 3/3","date":"Fri May 17 18:03:36 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I’m encouraged that the President continues to make the issue of border security a top priority, and his recent immigration proposal would go a long way toward fixing many aspects of the immediate crisis on the border. 1/3","date":"Fri May 17 18:03:35 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"What’s going on at the border is not lost on Texans in my district. This is an urgent national humanitarian crisis that needs immediate action, and I will continue to work alongside the President and in Congress to fix our nation’s border security problems, 2/3","date":"Fri May 17 18:03:35 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"U.S. ally Israel is under attack—both in its own homeland and in ours. Even in Congress, anti-Semitic statements have become a regular occurrence. I made the case today @DailySignal that America must continue to #StandWithIsrael against foreign threats and anti-Semitism here.","date":"Thu May 16 20:49:02 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"We must do more to uphold the dignity and inherent worth of human life at every stage. This should not be a partisan issue. (2/2)","date":"Wed May 15 21:33:23 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The Born Alive Abortion Survivors Protection Act would ensure that babies born alive despite an abortion attempt are guaranteed life-saving medical care. I asked House leadership to bring this important legislation before Congress for a vote, yet my request was denied. (1/2) https://t.co/CKaCPNLv1D","date":"Wed May 15 21:33:22 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Israel is a committed ally and a reliable friend of the United States, one which shares our commitment to peace and liberty. America must continue both to support Israel against foreign threats and to stand up against anti-Semitism here at home. #StandWithIsrael","date":"Wed May 15 20:07:22 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The national debt has been spiraling out of control, and it’s Congress’ duty to fix the problem. Responsible spending is the first step. That’s why I cannot in good conscience support busting the budget caps and passing the buck to our kids and grandkids.","date":"Wed May 08 16:34:32 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Prayer has played such an important role in our nation's history, and today on the #NationalDayOfPrayer I want to encourage you to join me in praying for our nation's leaders and for peace around the world. https://t.co/WihJHBoK6T","date":"Thu May 02 18:38:08 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"While I have not yet had a chance to fully review the Mueller Report, indications are that it is consistent with the Attorney General’s summary: that an incredibly thorough investigation that cost $25 million and lasted nearly two years established that there was no collusion, 1/","date":"Thu Apr 18 20:48:25 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"and Special Counsel Mueller is not recommending any more indictments. It’s past time for Congress and its committees to move on to pressing issues like securing the border, fixing our broken immigration system and addressing our $22 trillion national debt. 2/2","date":"Thu Apr 18 20:48:25 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Talking with @claireculwell, an abortion survivor from Texas who is in Washington in support of the Born-Alive Abortion Survivors Protection Act.\n\nThere should be no debate that someone like Claire who was born alive deserves care and protection #EndInfanticide https://t.co/pTsXO30IHb","date":"Wed Apr 03 20:13:05 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"On the @DailySignal podcast with @JDaniel_Davis to discuss the national emergency on the border and today's effort to #EndInfanticide \n\nhttps://t.co/5uXnmDP0L6","date":"Tue Apr 02 13:50:17 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"After 22 months, we now know what many suspected all along: There was no collusion.\n\nI coauthored an article w/ @Jim_Jordan, @RepMarkMeadows, &amp; ranking members of @GOPoversight: time for Congress to move on, address the challenges facing our great nation.\n\nhttps://t.co/rsQk1Pfe17","date":"Fri Mar 29 19:35:04 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"After a thorough investigation, and despite the wishful thinking pushed by the President’s detractors in Congress and the media over the past two years, Special Counsel Mueller’s report has confirmed that there was no collusion with Russia on the part of the President or his 1/","date":"Mon Mar 25 22:16:19 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"concerns like getting our $22 trillion national debt under control and fixing the humanitarian crisis on our border. 3/3","date":"Mon Mar 25 22:16:19 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"campaign personnel. I voted recently in favor of releasing all legally disclosable portions of the report and believe that transparency is in the best interests of the American people. I am looking forward to Congress moving forward now and focusing on important legislative 2/","date":"Mon Mar 25 22:16:19 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thank you to everyone who came out to celebrate the grand opening of our new Victoria office! Call or come by if there's anything I can do to help: https://t.co/REc9NlWG64 https://t.co/vaPu6W6NAh","date":"Fri Mar 22 20:34:14 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thanks @QShepherd! Find out about Rep. Cloud's events in Corpus Christi and Victoria here: https://t.co/CfPWBw4SRb","date":"Fri Mar 22 20:27:44 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Join me on Wednesday 3/20 for the official Grand Opening of our new Victoria office!\n\nSay hello, discuss the issues, and see how my office can assist with Veterans Affairs, hurricane recovery and more! https://t.co/4HridAG18n","date":"Tue Mar 19 15:38:22 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"My office will be hosting info sessions on March 23 for 8-12 grade students interested in learning about military academies &amp; nomination process.\n\nStudents, parents &amp; educators are encouraged to attend. For more info call (361) 884-2222 or see our website: https://t.co/ZwX1KMgNzC https://t.co/WvhLDWzTlB","date":"Tue Mar 12 21:50:17 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Last night I stood in support of the Born-Alive Abortion Survivors Protection Act. It should shock our consciences that Congress voted down this bill.\n\nThere should be no debate that a child who is born alive should be cared for and protected. https://t.co/dwCwvS9f8O","date":"Tue Feb 26 16:03:22 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"In today's “compromise” – Congress could not find $5.7 billion for a barrier that Customs and Border Protection has requested to help end the humanitarian crisis on our border.\n\nYet the bill contains more than $12 billion in international assistance.\n\n#CongressIsBroken","date":"Thu Feb 14 22:06:28 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Turns out it costs $396 billion","date":"Thu Feb 14 22:02:56 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Party leaders sent us an 1169-page bill this morning. Vote is this evening.\n\nAs of 1pm, congressional offices were calling each other to see if anyone even knew the total cost\n\nI cosponsored a 1-week extension to fund the gov't while we #ReadTheBill &amp; negotiate a real compromise","date":"Thu Feb 14 22:02:29 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"SURVEY: The support shown for the “Green New Deal” – including from several presidential candidates - is alarming. It would be nothing short of an unprecedented socialist reorganization of our society.\n\nPlease let me know what you think: https://t.co/nQ8W9ONPyv","date":"Wed Feb 13 20:25:28 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"During #SOTU, I appreciated the discussion of how we came together during WWII - there’s more that unites than divides us. Congress must put aside party politics, recognize that ending the humanitarian crisis on our border should not be a partisan issue\n\nhttps://t.co/c7C7SqRWyf","date":"Wed Feb 06 16:25:00 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"My Washington team and I were honored to be presented with the official U.S. Army seal. I will proudly display this in my office as a small show of support to our nation's oldest military branch. https://t.co/41cAyrKGnj","date":"Fri Feb 01 18:12:12 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"While some things have changed in Congress, my commitment to serving the people of our district &amp; defending our Texas values remains the same\n\nPlease take this survey &amp; let me know your opinion on several important issues expected to come before Congress:\n\nhttps://t.co/UOg324eLY5","date":"Fri Jan 11 17:21:54 +0000 2019","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Was on House Floor to discuss humanitarian crisis at border. Cartels abuse U.S. generosity &amp; profit from trafficking drugs/humans. Border wall would push back on these crimes, ensuring migrants cross at port of entry protected by law enforcement\n\nWatch: https://t.co/lmxOgir0Xn","date":"Fri Dec 21 19:21:37 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"SURVEY: Last night, the House (with my support) passed a spending bill that included funding for a border wall. As we wait on the Senate to pass or reject the bill, please share your thoughts with me on the construction of a border wall: https://t.co/WVBiyDMtRD https://t.co/yz8qDWmhBr","date":"Fri Dec 21 19:09:17 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"To fix the FEMA process, we need change at the federal level. In the meantime, families and communities need help navigating this complex system.\n\nCheck out this guest column in @Vicadvocate for my take on this complicated issue. \n\nhttps://t.co/Q0P1FiiQdW","date":"Tue Dec 11 20:21:15 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Our part of Texas is fueling the world! Today the first ship full of Liquified Natural Gas left Cheniere Energy’s new facility in San Patricio County!","date":"Tue Dec 11 20:05:01 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Big thanks to CEO Strawbridge, along with Exec. Dir. John LaRue and the Port Commissioners led by Chairman Charles Zahn, for their tireless work to make this important project a reality. This project is going to have a huge impact on job growth across our entire region.","date":"Wed Dec 05 19:34:09 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Productive meeting with the National Association of Insurance and Financial Advisors to discuss retirement security issues &amp; how to ensure stability for retirees. https://t.co/LUZp6gPdaS","date":"Fri Nov 30 15:50:07 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Today I questioned FEMA Administrator Brock Long about the hurricane recovery process at an Oversight and Gov't Reform hearing. After dozens of mtgs with local leaders &amp; residents I was able to discuss our concerns with Mr. Long.\n\nVideo: https://t.co/FP9KFYnyay","date":"Thu Nov 29 22:38:22 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Great to talk infrastructure and transportation solutions with the Corpus Christi Regional Transit Authority!\n\nFind out more about my positions on infrastructure and transportation: https://t.co/1H6vqp0zUM https://t.co/eNMgMQQPWB","date":"Thu Nov 29 16:40:35 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"SURVEY: Newly elected Members of Congress will take office in January, but the current Congress will continue through December. As the 115th Congress wraps up, which issues do you feel are most important to address?\n\nTake the SURVEY here: https://t.co/hf5mEbwWgA https://t.co/2gvnpNnLb3","date":"Wed Nov 28 20:54:29 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Had a chance to talk with @kiii3news about meeting with President Trump to make the case for the Port of Corpus Christi's Channel Improvement Project...\n\n...and what this week's BIG announcement will mean for jobs across our entire region!\n\nhttps://t.co/UUdEqI5Z3w","date":"Wed Nov 28 15:28:39 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Great news! $71 Million was announced to improve the ship channel at the Port of Corpus Christi! @PoccaPort \n\nThis will create jobs across our district, increase exports of Eagle Ford oil, &amp; protect allies from dependence on Russian/Iranian energy\n\nVideo: https://t.co/md7fMs9Ylu","date":"Mon Nov 26 17:58:09 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"The American economy is booming! And it's making a real difference in the lives of workers and their families.\n\nhttps://t.co/0cFueHHixt","date":"Tue Nov 06 16:02:31 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Great to see everyone at the Texas Agricultural Cooperative Council conference! I was able to give an update on legislation affecting agriculture and to hear from farmers and ranchers about the issues they're concerned about. https://t.co/ThFQAiEr9x","date":"Fri Nov 02 19:57:26 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Thanks to the 4th grade class at DeLeon Elementary in Victoria for having me out to talk! A wonderful audience with some great questions! https://t.co/DdvVmvzy6W","date":"Fri Nov 02 16:40:21 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I'm happy to report that Port Aransas ISD has received $1.2 million in hurricane recovery funds!\n\nHelping schools, families &amp; communities navigate the complex FEMA process is a priority for me as your representative. Read more about PAISD's story here: https://t.co/YTalmzFfMn https://t.co/m5b1l7z6kI","date":"Thu Nov 01 15:12:33 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"After our discussion aboard Air Force One, President Trump called for action to improve our ports during a speech this past week!\n\nhttps://t.co/UMg22nbGqz","date":"Wed Oct 31 18:00:19 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I had a great time talking with everyone who came out to Mobile Office Hours in Luling to share their input and get assistance from my office!\n\nCouldn't make it? Let me know how we can help at https://t.co/k7eq7HIOX5 https://t.co/vGQOsnQc9t","date":"Tue Oct 16 14:12:30 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As we debate healthcare reforms and brace for even higher Obamacare-driven premium increases, I’d like to hear how this law has impacted you.\n\nDo you have a story that illustrates the state of healthcare in America? Tell me about it here:\n\nhttps://t.co/VKNLypu71k","date":"Tue Oct 16 14:10:31 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Great to see that Pastor Andrew Brunson has been released. Pastor Brunson ran the Resurrection Church in Izmir, Turkey, until he was wrongfully imprisoned and held under house arrest in 2016. It's wonderful to see him go free today.","date":"Fri Oct 12 22:06:28 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"I applaud @POTUS for his efforts to combat human trafficking. This modern slavery affects adults and children of all backgrounds and must come to an end.","date":"Fri Oct 12 21:57:08 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Happy #NationalManufacturingDay! American manufacturing is growing at its fastest rate in 23 years! Check out this video celebrating recent job creation and the great work being done in our region.\n\nhttps://t.co/T9RNjyDns6","date":"Fri Oct 05 17:31:10 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Teachers have a demanding, thankless, critically important job. As the husband of a teacher &amp; father of 3 students, definitely appreciate the vital contribution teachers make to our nation's success. Happy World Teachers Day to all teachers making a difference in students' lives! https://t.co/2RUWkTzWbL","date":"Fri Oct 05 17:27:29 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"On Gold Star Mothers Day, we remember mothers whose children gave their lives for our nation. I pray for God's peace for these mothers who have sacrificed so much - today and every day. We as a nation are indebted to you. https://t.co/ubE8uMCV5s","date":"Sun Sep 30 14:34:29 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Yesterday I voted to make this year's tax cuts permanent for middle class families, workers, and small businesses. \n\nThis year we've seen more jobs, bigger paychecks, and historic economic growth - let's keep it that way! https://t.co/QNO4bNueUf","date":"Fri Sep 28 18:34:05 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"A @WSJ op-ed highlights how conservative economic policies are placing more Americans in stable, full-time jobs.\n\n“Over the past year...the number of people working full time increased by more than three million.”\n\nhttps://t.co/VSUAv9ESED https://t.co/UhETKvgzKJ","date":"Tue Sep 25 20:44:38 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"On #NationalPOWMIARecognitionDay we remember those who have sacrificed so much for our country. #YouAreNotForgotten https://t.co/qO5fNzFJ8o","date":"Fri Sep 21 23:02:15 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"What an honor to be able to assist Mr. Gonzalez in receiving his long-overdue medals!","date":"Fri Sep 21 20:33:34 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"As a small business owner myself, I can tell you that cutting taxes and burdensome federal regulations leads to job creation and economic growth! https://t.co/aklNih8Y2U","date":"Tue Sep 18 21:25:32 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"Happy Constitution Day! Today as we celebrate the greatest political document ever written, let each of us do our part to return our government to the founding principles and limits set by the Constitution. \n#wethepeople https://t.co/9TxGiPHzy3","date":"Mon Sep 17 19:20:49 +0000 2018","user_id":"1039879658400112640"},{"handle":"RepCloudTX","text":"To represent you well, I need your input! I will be sending an occasional eNewsletter to keep you informed and to ask your opinion on important issues Congress will be considering.\n\nSign up here to receive my eNewsletters &amp; make sure your voice is heard.\n\nhttps://t.co/C4p5lOO05b","date":"Thu Sep 13 14:34:20 +0000 2018","user_id":"1039879658400112640"}]