[{"handle":"RepCohen","text":"“Mike Pence, I hope you’re going to stand up for the good of our Constitution and our country” – Trump on January 6\n \nPence did do the right thing and stood up for the good of our Constitution and our country by not following Trump’s orders.\nhttps://t.co/tR5xkRMs94","date":"Thu Jun 16 20:15:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Do you think some of those given pardons by Trump through Kushner vetting have become clients of Jared’s?","date":"Thu Jun 16 17:58:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I thank @POTUS for taking steps to reverse Trump’s cruel anti-Cuban policies and restore Obama-Biden’s approach of mutually beneficial engagement. We ask he ensure sanctions do not harm Cuba’s efforts to share COVID vaccines with low-income countries around the world. https://t.co/9bLlc8IgTk","date":"Thu Jun 16 16:33:15 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Reports that @navalny was moved to IK-6 prison—notorious for torture. It’s unconscionable that Russia should send political prisoners to such a facility. It is an invitation for malign activity and is unacceptable government activity, which had to be approved by Putin.","date":"Thu Jun 16 13:08:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Republicans have solidified their role as a radicalized party of government control. They want to control what women do with their bodies, what we teach in schools, who you marry and how workers organize.","date":"Wed Jun 15 20:42:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"This is why I plan to introduce @POTUS’s proposed Billionaire Minimum Income Tax so that billionaires pay their fair share of taxes every year just like everyone else.","date":"Wed Jun 15 19:19:01 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Explosion of mass shootings after ban lifted","date":"Wed Jun 15 02:28:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proudly a co sponsor…","date":"Wed Jun 15 02:25:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@accidntlmystic Republicans fearful that they’ll be tossed","date":"Tue Jun 14 02:20:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Adam has understood the sinister core of Trump as does cousin Mary Trump and a host of others. Trump is rotten to the core!👹👺🤡🤮","date":"Tue Jun 14 02:18:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Ida B Wells, John Kennedy, Dr.King,Abraham Lincoln, Nelson Mandela, Frederick Douglass, Jefferson,quite a few grizzlies and Tigers","date":"Mon Jun 13 18:50:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The Humane Society honored me with the Humane Horseman of the Year Award. My furriest staffer approved. https://t.co/J72EPConui","date":"Mon Jun 13 17:52:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@jaredalthouse https://t.co/4s4UFafg7F and order.the Constitution.Upholding one’s oath.A psychologically damaged man at the head of our government and 1 of our primary political parties.\nWe are also addressing inflation,gas prices,healthcare,school kids and grocery shoppers getting butchered","date":"Mon Jun 13 17:15:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Obviously I didn’t catch subnuclear which I tried to type as abundantly clear","date":"Mon Jun 13 16:06:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"What the January 6 hearings are making subnuclear is that Mary Trump knew Donald Trump is severely detached from reality. A narcissistic sociopath who accepts nothing that doesn’t serve his needs.Facts don’t matter,nor does truth. He developed HIS “truth.” Alternative facts.","date":"Mon Jun 13 16:03:38 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@yarmuth Congrats! You’ve made your Father very happy","date":"Sun Jun 12 23:32:20 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"These folks marched in Charlottesville…you know..Trump said,”very fine people.”","date":"Sun Jun 12 22:52:20 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Trumps’Americanfreedomtour coming to north Mississippi Saturday not selling well. 5 ticket prices now 2 for 1 and while prices are beyond what a Live Elvis comeback show would ask there are $9 tiks being touted on ads.\nThis is not political contribution but carney grift;PT Barnum","date":"Sun Jun 12 15:53:16 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"My newsletter quote of the week.\nLiz Cheney is a profile in courage. https://t.co/TEc0sd2QaN","date":"Sun Jun 12 13:40:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Only member being investigated for sex with a minor is on Trumps team!","date":"Sun Jun 12 00:36:17 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"He’s nuts","date":"Sun Jun 12 00:12:17 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Elvis lives!And not just in Memphis.Austin Butler sounds like Elvis.Looking forward to the Elvis movie June 24.Good rocking that night!","date":"Sat Jun 11 22:44:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Speaking of moral inferiors….","date":"Sat Jun 11 22:38:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via @NYTOpinion Indict the monster Trump! https://t.co/UAVCk2JkOO","date":"Sat Jun 11 19:39:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"History will accept only one Jan. 6 narrative. This committee has it.\nMichael Gerson is a smart and honest columnist and a REPUBLICAN !\n https://t.co/1kmqtlnZ06","date":"Sat Jun 11 19:32:23 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@JohnFromCranber Ask the Oath keepers and “the sit back but stand by “ patriots.","date":"Sat Jun 11 18:28:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@RetDETPD isn’t comparable except that there were large crowds at both capitols and both occupied.But one was an attempt to overthrow an election and install an unelected president,a coup and the other was a Protest re:https://t.co/lkmlLmx19t one was killed in Wisc.","date":"Sat Jun 11 18:25:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@KyleGra80051774 @TheTNHoller No,Gus’ or Jack Pirtle or Cost Plus on Madison Ave.\nBut limited availability in DC and the bucket is good signage","date":"Fri Jun 10 23:07:18 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to cosponsor @RepPeterDeFazio’s bill to remove the indefensible cap on Social Security taxes so millionaires pay a fair share to fully fund Social Security through the 21st century and increase benefits — all without raising taxes by one penny on over 93% of Americans.","date":"Fri Jun 10 20:16:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@KyleGra80051774 @TheTNHoller Not enough of em get lottery scholarships?Or know why they were able to get them?","date":"Fri Jun 10 17:47:59 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@KyleGra80051774 @TheTNHoller Must not have been widely seen that way as I received 85% of vote in Dem primary against Dem county chair and in general 77%.","date":"Fri Jun 10 17:20:10 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@KyleGra80051774 @TheTNHoller No no no;in committee,while not convened,and to punctuate Bill Barr chickening out/refusing to attend committee hearing. Most Dems liked the humor and messing w Barr. Most Maga didn’t like as it was messing w Trumps guy. Also don’t like anything a Dem does &amp; they’re humorless.","date":"Fri Jun 10 17:10:08 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The Fox/Tucker Carlson alternative universe. Or the Big Lie coverup and denial. Truly disgusting!!","date":"Fri Jun 10 11:57:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Last night I attended the January 6 hearing. Though I knew Trump was the center of this violent,horrific anti-American coup attempt, it was still chilling to watch. Trump, Guiiani, Flynn, Bannon, Stone,and other principals( including Rep’s who were in on it) need to be indicted..","date":"Fri Jun 10 11:33:05 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@ChiTownTiger @JarvisGreerWMC Because they honor their oath of office and by doing so they’ve sacrificed or at least risked their positions and political life.","date":"Fri Jun 10 02:54:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Liz Cheney and Adam Kinzinger are profiles in courage! Honored to serve with these American heroes","date":"Fri Jun 10 00:19:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Bennie Thompson tells it straight","date":"Fri Jun 10 00:15:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"“The worst nightmare for a political prisoner is to be forgotten” – Vladimir Kara-Murza\n\nI raise @VKaraMurza’s name at hearings and posted his picture on my office door. I am fighting for his memory, his mission and his release.\nhttps://t.co/r8aGymT49z https://t.co/qz1SaQy4nm","date":"Thu Jun 09 23:01:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Today I voted for a Red Flag Law to prevent those who are intent on harming themselves or others from accessing lethal weapons. It might have prevented Uvalde and we must get it and other legislation through the Senate before more children are senselessly murdered. https://t.co/PDwDezxTWV","date":"Thu Jun 09 22:11:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Jim Jordan claimed guns were a “God-given right.” I don’t know about that, but I do know the Ten Commandments said thou shalt not kill and the New Testament said you shall beat your swords into plowshares. God surely wouldn't endorse killing His children. https://t.co/04h7mRIput","date":"Thu Jun 09 21:22:52 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Replay of 1/6 when I spoke to @AliVelshi. Let's see how close I was to what the January 6th Committee reveals tonight. https://t.co/kFaUQSRDDG","date":"Thu Jun 09 20:38:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to be named the @HumaneSociety’s Horseman of the Year for leading the Prevent All Soring Tactics (PAST) Act, advocating for wild horses and championing protections for horses and animal welfare! https://t.co/qKtiR4vm4s","date":"Thu Jun 09 18:26:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Fox News can’t handle the truth.","date":"Thu Jun 09 16:35:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Steve Cohen: Getting news about Jan. 6 hearings to Fox News will be like getting news about Ukraine to Russian TV https://t.co/5DcV6ggE08","date":"Thu Jun 09 15:26:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I was in the House Gallery when Trump’s insurrectionists came to overthrow the election. I shouted to my Republican colleagues: “Call Trump! Tell him to call off his revolutionary guard!”\n\nI look forward to hearing what the January 6 Committee has found.\nhttps://t.co/ODzn5pTryQ","date":"Thu Jun 09 12:26:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Movie theaters, churches, schools and grocery stores all need to be protected. This country is wild with guns and we need to restrict them! https://t.co/4HERkG1giq","date":"Thu Jun 09 01:57:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to join @HouseDemocrats in passing legislation to improve our water infrastructure, including two projects in downtown Memphis and investments in ports, harbors and inland waterways that will improve our supply chains to help boost our competitive edge and lower prices.","date":"Thu Jun 09 01:09:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin thinks that if the war ends soon enough, we’ll forgive him because we need his oil and gas. But we don’t. We need to find alternatives and must transition here and abroad to clean energy independence! https://t.co/bumxGIUtfE","date":"Tue Jun 07 23:23:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"In Europe, gas prices have risen even higher than here and inflation is running at 8-10 percent. Inflation is a worldwide problem. It is not Joe Biden’s fault but we are doing what we can. https://t.co/vmgARqSUcQ","date":"Tue Jun 07 22:26:54 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Job Opportunity! My office is hiring a Gold Star Family Member for a two-year paid position in my Memphis office to assist with veteran and military casework and outreach. Interested Gold Star Family members should go to https://t.co/RVfUwjO4bp to find more information and apply.","date":"Tue Jun 07 17:39:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"JANUARY 6 is Watergate with capital letters and exclamation points! Nixon was a crook who sent his people to break into the DNC headquarters. But he didn’t send his people to break into the Capitol, take over the government, and intimidate, threaten and possibly kill legislators. https://t.co/vepYyznWNk","date":"Tue Jun 07 16:34:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It’s harder to get the news through Fox than Russian television. Fox won’t run the 1/6 hearings and it’s hard to get the news across to Trump voters, but there’s an audience who will listen and recoil at what they learn about the President’s direct involvement and direction. https://t.co/Kkos9LCbps","date":"Tue Jun 07 15:07:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@ResisterForever Subscribe to the @nytimes . Put tube on only after Joe and Mika go home","date":"Tue Jun 07 13:57:23 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@michaelshure good luck today","date":"Tue Jun 07 13:40:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Kids don’t vote or run PACs. It’s up to us to make children a priority and protect their best interests. I’m honored to be in the top 20% of Congress named a Defender of Children this year by the @Campaign4kids. https://t.co/ZJ6wDt749F","date":"Mon Jun 06 20:48:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Normandy Beach monument to our brave soldiers. June 6,1944. Thank you troops and Ike. https://t.co/wtfpZnHdEI","date":"Mon Jun 06 14:55:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"He drunk his own Kool Aid. Way out there with Trump,conspiracies, and pro Russia propaganda.","date":"Sat Jun 04 15:32:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"In 2022, more children have been killed in school shootings than police officers have been shot fatally in the line of duty. We must #EndGunViolence.","date":"Fri Jun 03 20:19:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Democrats have pursued gun reforms for decades, but whether we give Republicans a long time to think or very little notice, they vote the same way.\n \nThey will always vote no. There's nothing we can do to bring them along. We must act while we can to prevent gun violence. https://t.co/yEvKQPm7mJ","date":"Thu Jun 02 23:43:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"AR-15s Are ‘Weapons of War,' Rep. Steve Cohen Says https://t.co/UDaxHsPrqM via @YouTube","date":"Thu Jun 02 22:47:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We need to ban assault weapons and I look forward to working with @RepCicilline to pass it.","date":"Thu Jun 02 19:51:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"There is something gun-crazed about our country that we need to deal with.","date":"Thu Jun 02 18:14:16 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"NRA-funded Republicans have blocked gun law reforms for decades. The public is demanding action. We must pass the Protecting Our Kids Act. https://t.co/2N1RUHywRF","date":"Thu Jun 02 17:52:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Appreciate the Speaker’s leadership.I had amendment drawn for tomorrow’s judiciary committee markup to reinstate 1994 assault ban (law til 2004).It is imperative that we debate and vote on this life saving measure. The guns are made to KILL and aren’t for sport or defense.","date":"Thu Jun 02 00:28:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Earlier today I talked with the #CleanUpTVACoalition about how the nation’s largest utility should be working feverishly to meet the President’s goal of Zero Carbon by 2035. Failure to do so just gives private utilities and other corporations an excuse to burn more fossil fuels.","date":"Tue May 31 19:32:26 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The 'Mona Lisa' has been caked in attempted vandalism stunt - CNN\nFrance, as the USA should, has a thoughtful policy to put people with disabilities at the front of a line. This stuntser who feigned disability does harm to disabled.He should be jailed! https://t.co/cOl8iW4BJh","date":"Tue May 31 12:27:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"'Now That We're Woke, We Should Stay Woke': Dem Lawmaker Discusses Polic... https://t.co/8MDzO39zs7 via @YouTube","date":"Mon May 30 22:07:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@J2daakob Averted world war during Cuba missile crisis.Started the Peace Corps,moon landing quest,nuclear test ban initiative,civil rights,New Frontier accomplishments,equal pay act,good&amp;honest cabinet(esp.Adlai Stevenson as UN Ambassador)and inspired me /thousands to get into politics!!!","date":"Sun May 29 20:44:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"He is in a runoff for Senator from Alabama.I imagine he is appealing for votes.What does this say about Alabama republicans?Scary!","date":"Sun May 29 20:24:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"My inspiration to get into politics.","date":"Sun May 29 20:02:16 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Zero support for any new gun laws….😢","date":"Sun May 29 19:59:08 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Scary talk from a fellow who took oath to defend the Constitution….","date":"Sun May 29 19:47:55 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Great video. Brilliant young lady. Important message. Give a watch!","date":"Sun May 29 17:43:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We have a right to free speech, but not the right to scream fire in a theater. We also don’t have a right to an assault weapon or bazooka.\n\nThe 2nd Amendment talks about a well-regulated militia. We can and must regulate militias and the use of handguns to protect the public. https://t.co/1dKecXT9Mx","date":"Sun May 29 17:43:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Joe Biden is showing up and calling for action.\n\nTed Cruz isn’t even there. Enough Senate Republicans need to step up and act. https://t.co/APXQvtvvLg","date":"Sun May 29 16:02:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Opinion | The Uvalde Shooting Shows America May Be Broken Beyond Repair - The New York Times https://t.co/TonZTol3vv","date":"Sun May 29 12:07:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@DanMulhall @MayorMemphis Ambassador  you shrunk. You were taller in the picture you took with me.\nBtw: our mutual friend, Andrew tells me I just missed you Thanksgiving ago.","date":"Sat May 28 16:30:53 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Without accepting his numbersI don’t believe they used AR15’s to save their lives or had high capacity magazines. Get Rid of them. Blood money weapon and paraphernalia that blood sucking NRA defends for bloodied money.\nAnd Trump says laws wouldn’t matter.If he couldn’t buy AR15!!","date":"Fri May 27 23:05:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@phoebeblue Siri or whatever and my failure to edit","date":"Fri May 27 21:02:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Met with Irish Ambassador to America Today and we had much to talk about. I loved my visits to the Emerald Isle and have mini mini mini Irish friends including Memphis’ number one son of Ireland Mark Flanagan","date":"Fri May 27 21:00:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Not just the flu. Trump put truth of danger and preventive tools aside for his political aspirations.A total abhorrent human being responsible for hundreds of thousands of American deaths!","date":"Fri May 27 20:57:40 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Anyone who has minimized COVID needs to take a hard look at the spike in total annual deaths, which was inflamed by MAGA Republicans’ catastrophic response to the pandemic. https://t.co/25unRdgM5A","date":"Fri May 27 14:03:59 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Uvalde Texas law enforcement- all hat no guts!","date":"Thu May 26 22:41:53 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Like Johnny Nash, Steve Kerr can see clearly while Republican Senators are blind to the dark clouds hanging over schools and movie theaters because of uniquely American mass killings.\nhttps://t.co/ecN1aUWW2P","date":"Thu May 26 20:21:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ 400 Russians DEAD and tens of thousands of others andPUTIN COULDN’T CARE LESS as he pursues his ego driven legacy “operation “. https://t.co/fpEHpK4xqt","date":"Thu May 26 19:21:03 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"And he’s going to be their nominee against Senator Warnock! Trump and the Republicans fumbled the ball With this guy who doesn’t seem to be as smart as the ball","date":"Thu May 26 19:05:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The murder of George Floyd was a watershed in our history, propelling police killings of unarmed black men to center stage.\n\nRepublicans blocked our legislative solutions, but President Biden issued an executive order that will make strides and includes the substance of my bill.","date":"Thu May 26 18:54:17 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Dear Senators: Unless you’ll do what it takes to pass gun reform, I couldn’t care less about your “thoughts and prayers.”","date":"Thu May 26 17:44:22 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Notice a common https://t.co/GKoZ2mtIJa acolytes who don’t have solutions for America’s myriad social problems,only propaganda to appeal to the radical right.","date":"Wed May 25 13:53:49 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Russia’s continually destroying venerable cultural sites in Ukraine is added proof of their desire to destroy Ukrainian identity and memory from the Earth.This is genocide in the making.War crimes are being carried out daily by Putins’ henchmen.Justice for Ukraine!","date":"Wed May 25 13:50:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Vladimir Kara Murza is a political prisoner of Putin.He must be released immediately. Putin is afraid of Vladimir because he has a voice and speaks the truth to the Russian people about the Kleptocrats who commit financial crime and their leader who is a  https://t.co/noyKW5nY33!","date":"Wed May 25 10:29:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Tennessee has gone beyond in allowing anyone to LEGALLY carry. NO TRAINING OR BACKGROUND CHECKS ! Wild West mentality. Boot Hill !","date":"Tue May 24 20:57:29 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Thoughts and prayers don’t work. Republicans need to stop genuflecting to NRA and help pass some gun laws,mental health, and red flag laws ( Buffalo). People need guns to kill! Wake up and let’s pass some laws to bolster safety.","date":"Tue May 24 20:47:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Vlady I wouldn’t go to Russia if you gave triple frequent flyer points and free borscht (yuk).You’ve made Russia the armpit of the world! Worse than https://t.co/xiKePXSlpR values,no humanity. Just lemmings cold to genoocidal sufferings and crooks living high while people suffer","date":"Tue May 24 20:30:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Living! And serving Tennessee 9 and America and it’s democratic values","date":"Tue May 24 07:24:03 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Соединенные Штаты Америки (США) - Министерство иностранных дел Российской Федерации \nRussia finally got around to banning me! I thought this had been done years ago but I guess they’re a little slow on the uptake just as they are in #Ukraine! #Russiagof… https://t.co/kK8TUnezoN","date":"Sun May 22 15:41:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Gorsuch, Barret and Kavanaugh all said that Roe was settled law when they were confirmed. It was right then and it’s right now! https://t.co/yT54nTQV8k","date":"Thu May 19 19:59:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@AngelaDanovi @timburchett Oh ! This was directed to Tim. Was shocked Angela but I didn’t read upstream before tweeting.\nTennessee Hope lottery scholarships are best thing that happened to education in our states history. Yes it’s been messed up since I’ve been gone but it still produces $’s for students","date":"Thu May 19 19:33:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@AngelaDanovi @timburchett Respectively you don’t have knowledge of the lottery scholarships that have provided over $6 billion for Tennessee students. None of this would’ve occurred but for my work over 18 years to bring it to the people.Sponsor of constitutional amendment and bills to make it law.","date":"Thu May 19 19:29:53 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I'm deeply concerned about the baby formula shortages I've seen. House Dems are working to pass emergency funding to address this shortage immediately and @POTUS is working to boost supply. Here also is a guide to help you find formula during the shortage.\nhttps://t.co/fmavbuiAA1","date":"Thu May 19 18:43:05 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"If the Supreme Court lets red states outlaw abortion, half the country will lose access to abortions unless you have enough time and money. In Memphis, you’ll have to go to Illinois, and Tennessee could even put a bounty on your head for being involved with an abortion. https://t.co/YsX2oKduC3","date":"Thu May 19 18:22:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Big Oil is exploiting Putin's war in Ukraine to raise prices and boost its profits by pouring money into stock buybacks and dividends instead of increasing supply. Today, House Dems voted to prohibit exploitative price increases and hold price-gouging companies accountable.","date":"Thu May 19 16:58:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Last year’s traffic fatality spike emphasizes the need for major road safety improvements, which is why I worked to include Complete Streets policies in the Infrastructure Law. 42,915 deaths is absolutely unacceptable, and we must continue to prioritize making our roads safer.","date":"Thu May 19 15:51:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"If Republicans take control of Congress, they will outlaw abortion in all 50 states. Not just Mississippi, Texas and all these red states, but EVERYWHERE. We can’t let that happen. https://t.co/Jcf0vouLVx","date":"Wed May 18 23:54:53 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Our democratic system is built on checks and balances. As Chairman of the Subcommittee on the Constitution, Civil Rights, and Civil Liberties, I continue to examine reforms to ensure no President can misuse or abuse emergency authorities. https://t.co/05L5IQci12","date":"Wed May 18 15:32:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I was proud to sponsor this $3 million project to improve Tom Lee Park, along with 9 other projects to bring nearly $12 million back to Memphis and Shelby County.","date":"Wed May 18 14:04:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The Kremlin weaponized Russia’s deposit insurance system to target opponents and shield sanctioned oligarchs, so I sent a letter with @RepJohnCurtis recommending @POTUS and @SecBlinken sanction the Deposit Insurance Agency to help fight Russian kleptocracy and protect dissidents.","date":"Tue May 17 21:52:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We’d have a President!","date":"Sat May 14 02:11:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@TigersAthletics And the  iconic Scripps-Howard American flag?Not party of Liberty Stadium?","date":"Sat May 14 01:57:51 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Return to sender…address unknown","date":"Sat May 14 01:37:08 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"DeJoy was no joy to the postal employees and customers.Hit the road Jack….","date":"Sat May 14 00:45:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"If only…","date":"Sat May 14 00:30:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@JTStacy @therowanator62 @memphistigerjeb @jmtigers1974 @jayharvey1 University has given me two of its most prestigious awards, the eye of the tiger award and the most distinguished alumni award. So I have to say  that I’ve been there since day one ,every day as both of state senator when I passed the lottery for scholarships","date":"Fri May 13 23:28:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@hsvtiger1 @JTStacy @therowanator62 @memphistigerjeb @jmtigers1974 @jayharvey1 Always advocating for U of Memphis. Never have refused a request and have helped with many grants and earmarks. @uofmemphis my law alma mater.","date":"Fri May 13 18:14:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"For four dark years, the United States turned its back on our allies in Europe and genuflected to Putin. But President Biden and Congressional Democrats will resolutely oppose Putin’s criminal war, uphold the Helsinki Accords and support brave Ukraine. https://t.co/Ciudmbc0NH","date":"Wed May 11 17:31:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Take big money out of politics. It would solve so many problems.","date":"Wed May 11 15:49:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Women deserve to control their own bodies, not the government. This is 2022, not the Dark Ages of 1235, whether Justice Alito understands that or not. And this is why you have to VOTE.","date":"Wed May 11 13:25:21 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Yesterday, @POTUS signed into law the Ukraine Democracy Defense Lend-Lease Act, which I was proud to co-lead in the House with @RepJoeWilson. Glory to Ukraine and to the United States of America!","date":"Tue May 10 20:01:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"COVID has surpassed a million deaths in the US, but Republicans are doubling down on their Trumpian do-nothing strategy and refuse to vote to fund COVID vaccines, tests and therapeutics.","date":"Tue May 10 18:56:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Democrats delivered FREE high-speed internet to 40% of American households. Call 1-877-384-2575 or visit https://t.co/qDRYrmSWgZ to see if you qualify.","date":"Tue May 10 18:11:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ Isn’t this a bit of overkill for a few bakers that don’t wanna make a wedding cake? But the base of the republican Maga party will be for it and so the Republicans will be for it https://t.co/TOekaSSIo4 = gone overboard party! https://t.co/PqbMMUx88o","date":"Mon May 09 15:37:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"My Mother and I 1952 as pictured in Memphis Press Scimitar .\nHappy Mothers Day. https://t.co/Da5qkxNvZ2","date":"Sun May 08 16:41:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/iHUqmSby3Z","date":"Sun May 08 03:20:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Another political prisoner in Russian colony, Belarus. Good luck in Putin appeal. Lukashenko is Charlie McCarthy to Putins’ Edgar Bergen. \nNote to millennia .. google them or ask Candice Bergen or( sadly) Google her too. https://t.co/gvUYgHCWtd","date":"Sat May 07 22:08:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Yesterday, as Co-Chairman of the @HelsinkiComm, we held a briefing to investigate Swiss enablers. See the full video below.\nhttps://t.co/ErDgzuGeLK","date":"Fri May 06 21:13:55 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"All democracies need to work together to freeze and seize every cent of Russian blood money. This includes Switzerland which reportedly harbors hundreds of billions. Switzerland can start by doing right by the Magnitsky case and not returning stolen funds to the Russian culprits.","date":"Fri May 06 21:13:55 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"If you don’t ask, you don’t get. My job is to ask for my constituents and after I ask — I ask again and again and again. That’s how I got all 10 of our community projects funded with $11.7 million.\nhttps://t.co/csmbrZyaaC","date":"Fri May 06 19:51:58 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to be joined yesterday by representatives from all 10 of the local organizations that received federal funds. That’s $11.7 million for Memphis and Shelby County to fund community projects that I was proud to sponsor.\n\n⬇️Full story from @WMCActionNews5⬇️ https://t.co/s8Hlkk5gY0","date":"Fri May 06 18:50:25 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to celebrate in Memphis delivering $11.7 million directly to our district’s community projects! https://t.co/K0zXk5pH05","date":"Thu May 05 22:09:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Around the world, countries are increasingly legalizing abortion, including in mostly Catholic nations. Meanwhile, in the U.S. unelected judges seem to be going in just the opposite direction. Expand the court and codify the right to bodily autonomy!\nhttps://t.co/B4b4B8UDaH","date":"Thu May 05 19:21:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Trump was elected by 46% of voters.\n \nMcConnell’s Senate “majority” represented only 44% of Americans.\n\nTogether, they created a 6-3 Supreme Court majority, which is so unrepresentative it’s considering overturning #RoeVWade. Only 28% of Americans want #Roe overturned.","date":"Thu May 05 15:54:15 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Right-wing extremists have worked for decades to pack the Supreme Court with a majority willing to impose a small minority’s views on a country that’s overwhelmingly opposed to banning abortion, contraception, gay marriage and who knows what else.","date":"Thu May 05 13:48:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"REDEMPTION?TROUBLED PAST? WE AREN’T TALKING ABOUT THE END OF SLAVERY OR JIM CROW BUT THE REPEAL OF A 50 YEAR RIGHT OF AMERICAN WOMEN","date":"Thu May 05 02:30:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"“If the federal courts return …to the states,Tennessee’s laws will automatically… offer a glimmer of redemption as America reconciles our troubled past” said Gov.Bill Lee of Tn. Re:\nOver ruling of Roe v Wade.","date":"Thu May 05 02:24:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"In my opinion, what Russia has done to Ukraine is genocide. Putin wants to destroy Ukraine and its people and turn whatever is left into Russia. We must collect evidence of Russian war crimes and do whatever we can to save Ukraine. https://t.co/HgU9du6a8E","date":"Wed May 04 22:27:01 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It’s past time for @FAAnews to establish minimum seat size standards on planes, as Congress mandated over 3 years ago! I can’t imagine public comments will say that people want smaller seats. There aren’t that many contortionists in America. @FlyersRights","date":"Wed May 04 00:00:58 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proudly at the 2017 Memphis Women’s March from the courthouse to the National Civil Rights Museum. The fight never stops. #CodifyRoeNow https://t.co/78JuOoVHyK","date":"Tue May 03 20:39:54 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Memphis lost a radio hall of famer in Bobby O’Jay, who died today. A icon of legendary WDIA he was a fixture in the community lending his talents to a multitude of community events. Thanks for the shout outs and friendship","date":"Tue May 03 19:18:22 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":".@iamjohnoliver covered polluters' plan to target Black neighborhoods in Memphis since they assumed the community couldn't stop the Byhalia Pipeline.\nBut Memphis doesn’t back down &amp; I'll never stop fighting alongside my community for environmental justice.\nhttps://t.co/d5R4o2TPv4","date":"Tue May 03 18:11:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The comments are pretty much what I expected. American people are fed up with the Senate confirmation hearings and senators responding with a wink and a nod.\nHouse has passed Roe/Wade law, Senate not. Prez elections have been about Roe for R’s.2022 will be about Roe for D’s too!","date":"Tue May 03 16:44:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The leaked draft is another sad indication that the Alito Supreme Court is considering eliminating constitutional protections for abortion and logically by extension gay marriage.\n\nIf the Senate needs a reminder: they must pass the House-passed Women’s Health Protection Act NOW!","date":"Tue May 03 16:29:03 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Justices Kavanaugh and Gorsuch should apologize to Senator Collins for lying and Alito and Barrett should join them in apology to the American people and the United States Constitution.\nNot confirm and consent but get lied to  and vote your politics with false assurances to women","date":"Tue May 03 14:31:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Exclusive: Supreme Court has voted to overturn abortion rights, draft opinion shows - POLITICO// TRUMP APPOINTEES ALL FOLLOWING THEIR FEDERALIST SOCIETY’S WISHES.THE FAUSTIAN BARGAIN THAT MADE A GRIFTER AND LIAR AND MISOGYNIST “president”. https://t.co/rqPcJ0qHyc","date":"Tue May 03 01:48:49 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Israel demands apology after Russia says Hitler had Jewish roots | Reuters \nAS the Ukrainian sailor replied,”Russian …..go f—k yourself.”\n https://t.co/C8QfoJ7ika","date":"Mon May 02 14:42:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Refs let warriors win.Calls on  JJ were way wrong and Curry was allowed to travel so much he should be written up in Travel and Leisure.","date":"Mon May 02 01:09:21 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@NBA @NBAonTNT","date":"Sun May 01 23:46:18 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@IslandOdilia03 Jordan Poole was great. Drayvon Green\n Embarrassed self, Warriors, and NBA. He should be banned from the next game and fined a large amount of money.","date":"Sun May 01 23:40:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Play ball.Go Grizz! https://t.co/Kztx0JC1J0","date":"Sun May 01 19:54:26 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"What a jerk","date":"Sun May 01 03:33:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"This week we expanded efforts to fight kleptocracy and support Ukraine by passing 2 bills I worked on:\n\n✅Asset Seizure for Ukraine Reconstruction Act: seize &amp; sell Putin cronies’ assets to help Ukraine\n✅Ukraine Lend-Lease Act: more efficiently send weapons &amp; supplies to Ukraine","date":"Fri Apr 29 18:07:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Republicans contorted themselves into framing ethics reform as an attack on Clarence Thomas, but everyone should agree that #SCOTUS should have ethical guidelines. If Justices have a conflict, they should recuse themselves or disclose. Clearly, that hasn't always been followed. https://t.co/BZ3zD71NAj","date":"Fri Apr 29 15:29:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"America doesn’t have to give up its blood in Ukraine. We can give our treasure. Proud that today we passed the Lend-Lease Act, which I co-led in the House with @RepJoeWilson and already passed in the Senate. https://t.co/pqrFWjeZb3","date":"Thu Apr 28 22:46:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Never forget the 6 million Jews and countless others murdered during the Holocaust. On #YomHashoah, pause to think of their memories, renew our commitment to democratic pluralism, and vow to stand up against violence, intolerance and mistruth. #NeverAgain","date":"Thu Apr 28 22:07:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I introduced the Oligarch Asset Forfeiture Act, and I’m pleased that today the House passed similar legislation calling for the President to seize U.S. assets from Russian oligarchs and repurpose them for the benefit of the Ukrainian people.\nhttps://t.co/rIDB4yqZB7","date":"Wed Apr 27 22:57:20 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The SPEECH Act was my first substantive bill signed into law by President @BarackObama, which went after abuses of the legal system that are used by enablers of kleptocracy to intimidate. https://t.co/nZ0QBmZSd6","date":"Wed Apr 27 19:04:41 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"And it has recently become more apparent that several Republican members wore Kevlar vests on January 6 as they had reason to believe life threatening violence might occur.They both knew of the coming coup and failed to warn other(non GOP) members !","date":"Wed Apr 27 14:55:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"As sate senator,in 1986,I passed a bill to create  the Tennessee Holocaust Commission .It has proven to be one of the best in the country.Teachers are trained to teach Holocaust history.Never Forget!","date":"Wed Apr 27 14:51:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"ELEVATION","date":"Wed Apr 27 04:44:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"A Ja breaker!The incomparable Mr.Morant with a coming attractions DUNK","date":"Wed Apr 27 04:41:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"MEMPHIS GRIZZLIES WIN! JA MORANT JUST WOW!🐾🏀","date":"Wed Apr 27 02:19:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"And then when I get off the plane I hear a republican congressman say to one of his constituents ,”I’m so happy they did get rid of those masks. It was for stupid people.”I thought no it was done by doctors and nurses/health professionals To protect people, both smart and stupid","date":"Tue Apr 26 18:49:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"On flight to DC.About 10 of us are masked. I’ve heard at 30,000’ or so filtration on plane makes it safe but boarding and in airport should still mask. This won’t last. A matter of time and another wave.","date":"Tue Apr 26 15:29:24 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I recognize the weight of these words, but it's clear that Putin's regime is engaging in acts of genocide against Ukraine. As Co-Chair of @HelsinkiComm, I'm joined by @SenatorCardin @RepRichHudson @SenatorWicker @RepJoeWilson in urging @oscepa to formally recognize this genocide. https://t.co/xbQeqRrZnW","date":"Mon Apr 25 21:25:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We reiterate our call to President Biden from earlier this month to sanction Putin’s girlfriend Alina Kabaeva and oligarch Roman Ambramovich.\nhttps://t.co/3cTCNZycEK","date":"Mon Apr 25 20:04:10 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@GuethlieD @briantylercohen Must use phrases she’ll understand . MTG Isn’t very good with history or grown up communications or interactions","date":"Mon Apr 25 18:23:08 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Liar liar pants on fire","date":"Mon Apr 25 17:59:16 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@AnneMCosgrove2 His undies? Or hers(?)","date":"Sun Apr 24 03:51:54 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Ted Cruz Warns Disney Programming Will Soon Depict Mickey and Pluto F--king | Vanity Fair .This should be a privileged conversation between therapist and patient. https://t.co/NS1KeVQ6Cn","date":"Sun Apr 24 03:44:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I prefer not to see him","date":"Sun Apr 24 03:23:40 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I think it’s important that we all see the hypocrisy of so many of the Republicans who claim to have such conservative Christian values but are just liars and hypocrites. They cannot take the majority and run this country. It’s nothing but performance art politics.","date":"Sun Apr 24 03:16:59 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"GOP lawmakers were deeply involved in Trump plans to overturn election, new evidence suggests - POLITICO \nTHESE &amp; OTHER GOP MEMBERS WERE PART OF THE COUP ATTEMPT AND VIOLATED THEIR OATH TO THE CONSTITUTION. THEIR LOYALTY ( if they have any)TO TRUMP NOT USA https://t.co/asGib0Ryxc","date":"Sat Apr 23 19:58:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Not exactly well acquainted with American history","date":"Sat Apr 23 16:35:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The world is drowning in plastic and we can limit it by reducing wherever possible. The government should lead the way, which is why I worked to pass a single-use ban on Capitol grounds and am again leading a letter with @RepLowenthal &amp; @RepMikeQuigley to ensure it's implemented.","date":"Fri Apr 22 21:50:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"There is nothing political about wanting to breathe clean air and keep your community safe from rising tides and increasingly extreme weather. The future of our species and our planet depends on bold climate action. For #EarthDay, more people need to see that and act.","date":"Fri Apr 22 20:44:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Just last month, Russian opposition leader Vladimir Kara-Murza compared Russia to the dystopian novel 1984. Now he’s been imprisoned by Putin for speaking his mind and faces up to ten years in prison.\n\nThe whole world is watching: @vkaramurza must be released.","date":"Fri Apr 22 18:29:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin is a mafia boss. A bully. He can only be stopped with power. We must supply Ukraine with weapons to counter Putin and bring him to a peace treaty.\nhttps://t.co/Pl1kJ8Y3lO","date":"Wed Apr 20 21:52:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Y’all, it’s time. #LegalizeIt","date":"Wed Apr 20 20:20:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@McFaul We also had that great Russian citizen Steven Seagal along with us.what a bloviating over the hill actor who had rest of codel at his feet and wanting to go with him to Chechnya.","date":"Wed Apr 20 18:20:15 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I hereby appoint Putin as “slime of the highest order”","date":"Tue Apr 19 20:41:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@SeanMil78158970 @MalcolmNance Thanks.Lots of success.6 billion $’s scholarships(lottery)millions for arts(license plates)new public hospital(Med)1st federal apology slavery/Jim Crow,most Black recommendations Tn9 Fed judgeships/TVA,Tiger grant(walking bridge&gt;Ms. River)Choice grant($30mln)Urban renewal/housing","date":"Tue Apr 19 15:25:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I have the highest respect for Ambassador @McFaul, whom I met on a congressional delegation to Moscow where I traveled with Rohrbacher, Michelle Bachman, Steve King and Louie Gohmert. I was the American among our crowd…","date":"Tue Apr 19 14:31:57 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"On March 1 Malcolm and I chatted on the dm of twitter. Told me he was thinking of joining the international legion. WELL HE DID! Has my utmost admiration.Fair winds and following seas my friend .@MalcolmNance #SlavaUkraine #StopRussia","date":"Tue Apr 19 04:05:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin’s oligarchs hire Western enablers to do their bidding, including suing journalists into silence. To deter people from working for these corrupt oligarchs, the United States should place travel bans on them. That's what I'm urging @SecBlinken to do. https://t.co/gbLOx7tYGb","date":"Mon Apr 18 23:06:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@OmerAYusuf Go Grizz!!!!!","date":"Fri Apr 15 22:08:55 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Vladimir Kara-Murza from jail: Russia will be free. I’ve never been so sure.\nA HERO FOR FREEDOM AND JUSTICE SPEAKS FROM JAIL,SIMILAR TO DR. KING,AND RETAINS HIS OPTIMISM AND DEFIANCE. https://t.co/hR0MHeX3Jv","date":"Fri Apr 15 18:55:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Why Jackie Robinson was an even better baseball player than you realize - ESPN// 42 brought AMERICA forward on and off the field!! Thank you Jackie Robinson! https://t.co/eK2dnV9KAf","date":"Fri Apr 15 14:30:40 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@ceschulzke @apmassaro3 Navalny is a courageous foe of Putin and his and his oligarch friends corruption. He favors rule of law and is anti war. Glory to Navalny and Kara-Murza! Brave and courageous Russians standing up and out!!","date":"Fri Apr 15 02:38:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I renew my suggestion that we sanction Abramovich just like the UK, EU and Canada already have! Some thought he might have been helping with peace negotiations, but that’s clearly not true. Sanction the billionaire oligarch now!\n\nhttps://t.co/UZsb5Vi3eR","date":"Thu Apr 14 22:40:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Russian warship Moskva has sunk - defence ministry - BBC News IT WAS SUNK!Another indices of Russian military decay. A victim of the corruption of Russia as much of military approps were stolen. Navalny spoke of the corruption that is destroying Russia. https://t.co/rV16qMSHb0","date":"Thu Apr 14 21:15:25 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The U.S. has the worst maternal health outcomes in the industrialized world, and Black mothers are 3-5x likelier to die from a pregnancy-related cause than white women.\n\nTo address the #BlackMaternalHealth crisis, we must pass the NEWBORN Act, #Momnibus and universal health care. https://t.co/RnTTNS1DAc","date":"Thu Apr 14 20:47:41 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Thanks to @POTUS fixing the “family glitch,” a typical family of four will now save more than $4000 on their health insurance costs. I’m proud to continue working to strengthen the ACA and ensure that health care is affordable for all.","date":"Thu Apr 14 18:50:55 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@DavidKillion4 I didn’t find my name on the 398 sanctioned which means I’d already been sanctioned(which I’d suspected designated png/ persona non grata,for sometime) I have been their nemesis for https://t.co/01ks2U3ePM ‘18 filed sanctions bill.Spoke truth to Duma members n Moscow and Berlin.","date":"Thu Apr 14 04:43:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Russia was not on my dance card.\nYippie Ki Yay Putin https://t.co/EOgwUQ9Gk1","date":"Thu Apr 14 01:50:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@joe_c_giles Damn clever them Russian sailors","date":"Thu Apr 14 00:53:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"There was a fly in the ointment ;Yippie Ki Yay","date":"Thu Apr 14 00:47:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Mal  voyage and yippee ki yay","date":"Thu Apr 14 00:44:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Well four not three","date":"Wed Apr 13 22:17:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Three truths : \n1.Trump and co.were behind Jan.6 coup against US . \n2.Putin helped Trump win in ‘16 through polling data from Manafort and social media posts by Russia \n3. Russia and Saudi’s will be for Trump ‘24\n4. Democracy in danger","date":"Wed Apr 13 22:16:20 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"HR 4907 bankruptcy for student debt","date":"Wed Apr 13 20:23:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Arizona Iced Tea still costs 99 cents after 30 years. Why? The company is taking less profit (but still a ton).\n \nSkyrocketing global prices are mostly driven by the supply chain and corporate greed. I'm working with House Dems to stop the price gouging.\nhttps://t.co/l5yr6VOTmh","date":"Wed Apr 13 19:21:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@LoneCourier2281 @tamisawyer It will be centered centered. I believe the day we’re having a formal ceremony of the name change is June 28. Look forward to your attendance","date":"Wed Apr 13 18:12:03 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We're fortunate to have the Ukrainian army fighting Putin’s war against Ukraine and the West. All we need to do is send the weapons. Pleased Biden is stepping up military aid but copters and tanks are needed now!\nhttps://t.co/NgrmvN9RXT","date":"Wed Apr 13 17:59:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"President Biden says it like it is. Putin is a war criminal and this is a genocide.","date":"Wed Apr 13 16:20:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ // Putins’main man in Ukraine. Putin is god father of his daughter.A likely Putin puppet if regime change occurred.Only better prisoner would would have been Putin’s gymnastics mistress. https://t.co/P746ZVuvkD","date":"Wed Apr 13 01:53:53 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Rep. Marjorie Taylor Greene has a new defense of the Capitol attack: It only happened once, and it's time to get over it. https://t.co/ZLuCzzYqPc # via @HuffPostPol//AND JFK AND MLK,JR WERE ONLY ASSASSINATED ONCE.","date":"Tue Apr 12 12:42:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Just 2 weeks ago, Vladimir Kara-Murza testified to me that those who speak out against Putin’s war are liable for criminal prosecution in Russia. Now he’s been detained.\n\nHe’s a true patriot striving for democracy. He must be allowed access to his lawyer and released immediately. https://t.co/cv5NUYgVC9","date":"Tue Apr 12 02:21:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"NOTICE: What you're about to see, is a condensed version of a 1+ hour hearing chock full of info. To defeat Putin’s army in Ukraine, we must also defeat his army of enablers and oligarchs in the West who fuel his war machine. https://t.co/6Aap6UM9hc","date":"Mon Apr 11 20:12:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"He was bailed on 666 fifth ave. by Middle East money and now 2BILLION$ from Saudi’s .When he and Crown Prince met state dept.personnel were not allowed to monitor meetings!Stinks!","date":"Mon Apr 11 05:28:16 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Trump  knew Jeffrey Epstein and Ghislane Maxwell very well and wished Maxwell luck.I thought Republicans detested child sex offenders.","date":"Mon Apr 11 05:18:16 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Two champions in and out of the ring.","date":"Mon Apr 11 05:11:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Kirill and Putin are in bed together","date":"Mon Apr 11 05:07:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"KBJ’s confirmation is so important to this country that it cannot be over estimated. To African Americans it means you are part of this nations decision making and consciousness. Presidents &amp; Veeps are for terms but  Supreme Court justices are for life!The gallery of AA women 😀","date":"Sat Apr 09 21:01:58 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Judge Ketanji Brown Jackson speaks from the @WhiteHouse the day after being confirmed to #SCOTUS. PC: CNN.","date":"Fri Apr 08 17:28:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/zTxV4EI9ym","date":"Fri Apr 08 17:28:29 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"No that’s sold out and  clueless Clarence","date":"Thu Apr 07 23:58:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin’s war has placed Ukrainian refugees in jeopardy and made women and children more vulnerable to exploitation. I co-chaired a @HelsinkiComm hearing on how we can protect refugees from being trafficked by people who have about the same conscience &amp; concern for others as Putin. https://t.co/N6EGn8q58S","date":"Thu Apr 07 20:29:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I witnessed the historic vote to confirm Justice Ketanji Brown Jackson from the Senate Gallery. It was particularly fitting and inspiring to observe so many African-Americans and women in the gallery. Certainly an historic day for America.","date":"Thu Apr 07 18:13:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Justice Ketanji Brown Jackson. Proud to witness the confirmation of such an outstanding nominee to the Supreme Court.","date":"Thu Apr 07 18:02:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Restaurant relief was a lifeline during the peak of the pandemic, but funds ran out before many restaurants received relief. Today, House Democrats are passing a targeted small business relief bill to replenish the restaurant funds and support other hard-hit businesses.","date":"Thu Apr 07 17:22:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Today will be the first time that an African-American woman is confirmed to serve on the Supreme Court. Justice Thurgood Marshall will finally have a successor.","date":"Thu Apr 07 16:26:52 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":".@POTUS has unified our allies and led the way with unprecedented sanctions and military aid, but we must continue to keep the pressure on. We need to do more because if Ukraine falls, we all lose. https://t.co/34D7bgt8gT","date":"Thu Apr 07 14:51:31 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to announce a $124 million investment in Tennessee transit, thanks to the infrastructure law. That's on top of Biden's proposal to boost Memphis transit with a $46 million investment in the first bus rapid transit system in Memphis.\nhttps://t.co/3X5N21wARu","date":"Wed Apr 06 22:11:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Massive killing contests on public lands for money and prizes are neither wildlife-management nor sport. They are unnecessary bloodbaths and ending them is the right thing to do.\nhttps://t.co/kTUdIeKFUH","date":"Tue Apr 05 21:29:58 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"One of our nation's greatest tragedies occurred in my hometown. Dr. King was assassinated in Memphis the day after he delivered his 'Mountaintop' speech on April 3, 1968. At that site, the @NCRMuseum celebrates his life and mission—a phoenix risen from the ashes. https://t.co/4VnS6R3i5m","date":"Tue Apr 05 18:20:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Jackson on course for confirmation, with 2 more GOP senators in favor//.NOTHING BUT RESPECT FOR MURKOWSKI AND ROMNEY. RISE ABOVE THE CHAOS AND VITRIOL!👏 https://t.co/xEIJvgKz9P","date":"Tue Apr 05 03:43:53 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The science said it was time for a second booster and so I got it. If you’re 50+ you can too, and everyone should get the first shot/booster if you haven’t already! https://t.co/osXd4jRgZo","date":"Mon Apr 04 20:11:54 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Praise for Lithuania, the first European country to stop importing Russian gas. They are standing up and not only talking the talk but walking the walk.","date":"Mon Apr 04 19:24:54 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin’s lies can kill and the @HelsinkiComm hearing I chaired shines a light. https://t.co/Co6u4kOguJ","date":"Mon Apr 04 18:43:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Memphis will always be remembered for being the site of one of America’s worst crimes. Fifty-four years after Dr. King  was shot on the balcony of the Lorraine Motel, the nation mourns his loss and dreams of what might have been and what should have been.","date":"Mon Apr 04 17:52:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":".@POTUS is focused on growing the economy from the bottom up and middle out. With the #AmericanRescuePlan, we've created the most jobs in recorded history, grown the economy faster than in the last 40 years, and are set to shrink the deficit by the largest-ever one-year drop.","date":"Mon Apr 04 13:14:45 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It’s no secret that the War on Drugs failed. Congress has been out of step for decades, but House Dems voted again to decriminalize marijuana and expunge prior convictions. https://t.co/xxAT0TERjx","date":"Sat Apr 02 23:41:18 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Democrats voted this week to cap the cost of insulin at $35 while all but 12 Republicans stuck with Big Pharma’s talking points and voted no. https://t.co/KnL5HYo5K2","date":"Sat Apr 02 18:05:51 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The House has voted to decriminalize weed. That’s not an April Fools.","date":"Sat Apr 02 04:05:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"My whole career I’ve supported decriminalizing marijuana and expunging the records of those affected by the War on Drugs. Tomorrow, the House will vote to get it done. #MOREAct","date":"Thu Mar 31 23:32:21 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Americans with diabetes are dying because they cannot afford their medicine. Today, I voted with House Dems to cap the cost of insulin at $35 per month.","date":"Thu Mar 31 22:50:17 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"If Walter Cronkite, the most trusted man in America, were here to see CBS hiring Mick Mulvaney: https://t.co/N5L5xcRPUw","date":"Thu Mar 31 22:08:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"If you believe that, Putin also has a bridge in Brooklyn to sell you.","date":"Thu Mar 31 21:44:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I look forward to voting for this bill as the need for insulin should never impose the financial burden it does today.","date":"Wed Mar 30 14:52:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Transportation Dept. recommends $46M for proposed bus rapid transit route in Memphis. A big win for MEMPHIS from infrastructure bill I supported and project I pushed for!! https://t.co/XT2djbvHsd","date":"Wed Mar 30 13:52:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Sure, Vladimir Putin is accused of slaughtering children and committing various other war crimes in Ukraine. But that doesn’t mean Donald Trump won’t ask him to dig up dirt on a political opponent. Again. https://t.co/uiZuSaTkft # via @HuffPostPol//TRUMP &amp; PUTIN R ROSEMARY BABIES","date":"Wed Mar 30 13:21:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The #BidenBudget shows how investing in the middle class has powered the strongest economic growth in nearly 40 years and put the deficit on track to drop by more than $1.3 trillion this year – the largest-ever one-year drop.","date":"Wed Mar 30 13:01:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Senator Tillis is correct however if not true he should enter time out for a few years and (maybe)grow up.","date":"Wed Mar 30 03:21:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Madison Cawthorn is going to get a talking-to from Kevin McCarthy over his latest volatile comment: that he's seen cocaine use and gotten invited to orgies since arriving in Washington.//NAME NAMES, IF TRUE. IF NOT TRUE,RESIGN! https://t.co/k2Fmdoet83","date":"Wed Mar 30 02:49:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Billionaires pay a lower tax rate than their secretaries. I plan to help ensure they pay their fair share.","date":"Tue Mar 29 19:32:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Not one oil company executive has agreed to testify before my committee and explain to the American people why they are raising gas prices at the same time that oil prices fall and their companies experience record profits.","date":"Tue Mar 29 18:28:20 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Every day I walked through the doors of the House chamber, Don Young would be sitting on the aisle and we'd talk. He was an outstanding Congressman, a good human being and my friend who worked across the aisle. For the first time in my career, he isn't here. He'll be very missed. https://t.co/pRt9eu2LV0","date":"Tue Mar 29 17:23:26 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Pleased the President's Budget includes $46 million for MATA's bus rapid transit project, which will transform Memphis transit. When @SecPete visited, I pressed him to make this investment and appreciate @USDOT calling to let me know it was going through!\nhttps://t.co/gQn3YUTkap","date":"Tue Mar 29 16:12:59 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Madison Cawthorn Casually Claims He’s Been Invited to Orgies and Seen Lawmakers Do Coke - The Daily Beast// This guy is fantasizing and/or lying and is a disgrace to the House and the Republican conference whose members would be the drug/orgy participants  https://t.co/adNIkm5Z5r","date":"Tue Mar 29 03:04:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Tonight the House passed my criminal justice reform bill to once and for all end an unfair sentencing practice that violates due process and has contributed to mass incarceration.\nhttps://t.co/l8JlsDWvki","date":"Tue Mar 29 02:36:31 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We impeached Donald Trump the first time because he was withholding military aid from Ukraine to extract political dirt. Now Trump is praising Putin’s invasion. Trump and Putin have always been fond of each other.","date":"Mon Mar 28 20:32:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Oops Dr.Ronny  did you forgot about , “Do no harm.” They taught that in med school.","date":"Mon Mar 28 02:06:21 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"And I was with Dr. Jill @StJude Friday. What a wonderful difference an election can make.","date":"Mon Mar 28 02:04:03 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Marijuana doesn’t kill you. Heroin and meth do, and until you deal with the truth, the kids won’t believe you at all! Absurd to criminalize marijuana like other drugs! https://t.co/Mmk8vfamt7","date":"Sat Mar 26 15:38:53 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to lead the effort in the House to increase #CerebralPalsy research at the @CDC and @NIH in. I urge my colleagues to join me. #CerebralPalsyAwarenessDay\nhttps://t.co/6g7zDGE0cS","date":"Fri Mar 25 23:56:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I was proud to welcome @FLOTUS Jill Biden to Memphis today and join her on a visit to @StJude. Some patients told her St. Jude is heaven on earth and she praised the hospital for treating children evacuated from Ukraine and advancing the Biden Admin's Cancer Moonshot. https://t.co/NketosZCWn","date":"Fri Mar 25 21:40:15 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"From the time Manuel Duran was arrested while he was covering a protest related to immigration, I have been in contact with the relevant government officials. The First Amendment protects the free press and I’m pleased Mr. Duran won asylum.\nhttps://t.co/zXWLlLdKU5","date":"Fri Mar 25 00:32:18 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The US should be clear: If Russia uses chemical, biological or nuclear weapons against Ukraine, it would be a crime against humanity and consequences would follow.\nhttps://t.co/xzILRBngae","date":"Thu Mar 24 23:44:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The Ukrainian Air Force has done a spectacular job defending against Russia, but they need more planes! They say Ukraine could have more pilots than planes. We need to do everything we can to get them more fighter jets. https://t.co/9vSn86pBOB","date":"Thu Mar 24 15:45:05 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin’s oligarchs can’t operate without enablers who give them access to western financial and political systems. The ENABLERS Act I co-led closes loopholes to laundering blood money. It isn’t rocket science – it's commonsense policy to protect democracy.\nhttps://t.co/dnE278O7MC","date":"Thu Mar 24 14:20:23 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@NilesHardy Oh that wasn’t gang rape by Justice Kavanaugh it was sexual assault and only by him . No gang .And he did lie about those yearbook terms and drinking. And there was lots of proof re : the assault.\nIt’s you who posted a lie  about gang rape. Stand up and admit it.Or drink Kool Aid","date":"Wed Mar 23 22:44:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@NilesHardy Gang rape? Refresh my recollection as I believe you’re wrong. Trump ?not a gang rape re: Ms.Carol.Gaetz ? Never accused?","date":"Wed Mar 23 20:11:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Judge Jackson has responded with poise, knowledge and skill to every racist dog whistle and meritless attack by Republicans. The GOP is shameless but #KBJ will make a phenomenal Supreme Court Justice.","date":"Wed Mar 23 16:57:41 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The ironic horror","date":"Wed Mar 23 15:44:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ // Just us with the ground forces our intelligence under rated Ukrainian Military. Their Air Force is successful but they need more planes. I will once again call on the president for more planes Through Poland or whoever or wherever https://t.co/ZlSzR5wZI7","date":"Wed Mar 23 14:42:22 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Spring training . Baseballs back.","date":"Wed Mar 23 02:01:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Judge Ketanji Brown Jackson exhibits unbelievable restraint.A confirmation lynching.","date":"Wed Mar 23 01:56:41 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Judge Jackson would have the broadest legal experience of any #SCOTUS Justice. She's served as a federal appellate judge, district court judge, private attorney, public defender and member of the U.S. Sentencing Commission.","date":"Tue Mar 22 18:32:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The baseless attacks on Judge Jackson’s qualifications are a familiar experience for millions of brilliant, talented and highly qualified Black women.","date":"Tue Mar 22 16:40:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@DrydenNovelette Wait til the rest of Senators on his side of aisle do their https://t.co/ErdSR6UO1g’ll miss “ boring”","date":"Tue Mar 22 14:19:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Senator Grassley,is doing an honorable and fair questioning of Judge Ketanji  Brown Jackson. Setting a standard that the younger Republicans will have difficulty equaling. #Grassley ‘s wife was right!","date":"Tue Mar 22 14:11:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"#freeNavalny ,an heroic Russian freedom fighter. Like Zelensky he is confronted by an obdurate narcissist dictator YET they boldly speak out for justice and truth. #Navalny should be Prime Minister.","date":"Tue Mar 22 13:43:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"True 12 days ago and true today with additional proof. And more depraved attacks coming.Chemical war and limited nukes to get the prizes UKRAINE AND ZELENSKY . Putin is an amoral psychopath.","date":"Tue Mar 22 05:19:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@OwnceaSr @johncusack No she was federalist society acolyte opposed by the Leadership group on CivilRights and no friend of people with disabilities, civil rights,lgbqt. Not eminently qualified but a female Clarence Thomas.","date":"Tue Mar 22 05:08:55 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"War is Hell and Putin is Satan","date":"Tue Mar 22 04:50:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"So why would anyone vote against this   eminently qualified nominee? The first Black woman nominated for Supreme Court? https://t.co/pDHECC99S3","date":"Tue Mar 22 04:37:03 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin’s war of killing civilians and carpet bombing cities assures that Ukrainians will always HATE PUTIN,as will people of the free world, and eventually RUSSIANS WILL HATE HIM TOO. #PutinWarCriminal #RussianUkrainianWar","date":"Mon Mar 21 14:23:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@Bluetwilightstr I would respectively disagree.We  voted different mostly.But I never believe he voted to benefit himself unless it was political because he was voted to benefit Alaska.\nPersonally we were https://t.co/oHzSRgv9SE Congress you can be cordial and social yet vote differently.","date":"Sat Mar 19 16:12:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Don Young, dean of the House, dies at 88 - CBS News// Don Young was a gentleman.He built friendships across the aisle.He voted for transportation bill.When I needed Republican co lead on marijuana reform Don was there! He was a friend to me.I’ll miss him.  https://t.co/2Ss2a9sFmE","date":"Sat Mar 19 15:38:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Repeatedly run on Russian television. This guy is a danger to America,Ukrainians,and democracy.Move to Moscow!!","date":"Sat Mar 19 03:48:49 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@ampersine Nothing “weird” in Memphis memorabilia in my DC office but lots of it including the JFK in https://t.co/ZaUUrUdTUB I took,a Tiger football helmet,a Pat Summit autographed Lady Vols cap,DeAngelo Williams bobble head, Z-Bo doll,Isaac Hayes’ Manassas Hi cap,Rodney Carney bobblehd &amp;.","date":"Sat Mar 19 03:40:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin wants to destroy UKRAINE and drive Ukrainians out of the country and kill the others by bombs, bullets, and starvation.I’m convinced THIS IS GENOCIDE.Putin is a sociopath.","date":"Fri Mar 11 00:44:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"US Rep. Madison Cawthorn calls Ukrainian president a 'thug'  :: https://t.co/MjsGcaF4KX https://t.co/Ida6WzqgTQ\nMORE  BONKERS!! \nNEVER FORGET HE FALSELY CLAIMED ADMISSION TO US NAVAL ACADEMY BUT IS A DROPOUT.","date":"Thu Mar 10 20:58:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@hotdogken @JohnLow16891107 Ventura is bonkers.West brilliant.","date":"Fri Mar 18 22:42:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Birds of a feather flock together.","date":"Fri Mar 18 21:46:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"With RT shut down, Trump can still get his pro-Russia coverage on Kremlin-endorsed Fox News.","date":"Fri Mar 18 21:00:01 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"You are just as smart, just as effective, and just as caring regardless of your natural hair or hairstyle. African Americans have been discriminated against because of their hair. The #CROWNAct will put an end to that. https://t.co/nmJvzwebhC","date":"Fri Mar 18 19:58:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"“Their only motherland is their Swiss bank accounts. And whatever they say about patriotism is a myth — as well as an enormous threat to us all. It’s actually clear what we need to do. It’s every person’s duty right now to oppose the war.” (2/2)\nhttps://t.co/ZxeMt405lt","date":"Fri Mar 18 19:16:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Russian opposition leader Navalny is unjustly imprisoned but bravely spoke out while being tried again: Putin and his cronies are “just a group of sick, crazy old men. They don’t have sympathy for anyone or anything. And our country is the very last thing they care about.” (1/2)","date":"Fri Mar 18 19:16:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Through forced arbitration, companies have created what amounts to a rigged, pro-business system of justice. By passing the FAIR Act, we ensure consumers and employees can get their cases heard before a judge and jury and receive a rightful judgment. #EndForcedArbitration https://t.co/W4PZyUsqYR","date":"Fri Mar 18 17:27:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"What Russia has done in Ukraine is immoral, illegal and against the word, acts and intensions of every godly character. It deserves the entire condemnation of the world and everything we can do to condemn them and put them out of organized, civilized society is appropriate. #WWJD https://t.co/xYlgVrq48x","date":"Fri Mar 18 13:01:29 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@texasinafrica Week of March 28 in Dc . Love to help","date":"Fri Mar 18 03:13:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Mr. Putin, if you’re truly an Orthodox Christian, then ask yourself as Christians in America and others of good will often say: #WWJD, What Would Jesus Do? And Mr. Putin, DO IT! https://t.co/B2hA0XO5Oz","date":"Thu Mar 17 17:21:26 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@dforsthoffer Voting rights legislation hearings have all came out of the Judiciary subcommittee I chair, Constitution,civil rights,and civil liberties.I’ve sponsored and argued for the John R Lewis Voting https://t.co/9kpDmzbO2J state Senator in 90’s sponsored Election Day registration.","date":"Wed Mar 16 17:55:25 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Even before the pandemic, Trump presided over soaring deficits. By the end of this year, Biden will have cut the deficit in half from what it was before he took office — all while providing historic middle class tax refunds, slashing child poverty and investing in infrastructure.","date":"Wed Mar 16 15:44:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We are not living in ordinary times. The wealth of Putin’s oligarchs should be liquidated and used to bolster Ukraine’s defense and rebuild after this terrible war ends.","date":"Wed Mar 16 14:06:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Yesterday I introduced the bipartisan Oligarch Asset Forfeiture Act with @RepJoeWilson and @RepMalinowski.\nhttps://t.co/fNAxpLsXvY","date":"Wed Mar 16 14:06:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Americans are tired of changing their clocks twice a year and spending winter afternoons in the dark. Let’s make Daylight Saving Time permanent by passing the Sunshine Protection Act I’m proud to cosponsor in the House.","date":"Wed Mar 16 13:06:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Calls to help Ukraine get louder ahead of Zelenskyy’s speech - CNN Politics IHAVE WRITTEN AND TWEETED OFTEN FOR PLANES, other weapons, and more sanctions. WILL WATCH SPEECH AND LEAD HELP FOR UKRAINE!!🇺🇦🇺🇦👍🇺🇸🇺🇸👍 https://t.co/sGiYtiFHQr","date":"Wed Mar 16 12:04:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The #AmericanRescuePlan created a fund to close the #DigitalDivide and helps students, schools and libraries access the internet. In the year since we passed it, I’m proud to announce my district has received $18.4 million to get students online.\nhttps://t.co/QaxsvylkG2","date":"Tue Mar 15 21:13:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"NEWS: @POTUS signed our spending package into law. Pleased to announce that after pushing to fund our community projects, I helped bring home $12 million for Memphis to support everything from Black business development and job creation to health care, housing and food security. https://t.co/QTPU96nfFL","date":"Tue Mar 15 20:00:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"March 15 is how far into the year women must work to break even with what men made last year. For Black women and Latinas, #EqualPayDay with white men is not until September and December. Outrageous!\n \nThe Senate must pass the Paycheck Fairness Act we passed in the House.","date":"Tue Mar 15 18:49:45 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Heroine","date":"Tue Mar 15 16:16:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I’ve always held Amnesty Int. in the highest regard but this was wrong,not true,not necessary.The Holocaust and centuries of antisemitism to this hour speak to the need a Jewish homeland.I hope Amnesty admits their error and issues a mea culpa.","date":"Mon Mar 14 23:33:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@repjimcooper Felicitations and congrats","date":"Mon Mar 14 16:18:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"You read it first here!Tom Brady , like Sinatra,MJ,Ali,Farve,is unretiring! Tom in ‘22/23!🏈","date":"Mon Mar 14 00:05:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@klilley12 @NBCNews @MeetThePress But he did ask the hard( though obvious) questions . But somebody ( probably higher up) put ratings/ sensationalism above integrity of program. \nBarr and most all excTrump officials/ authors are pigs and whores.","date":"Sun Mar 13 20:24:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@TheJusticeDept","date":"Sun Mar 13 15:19:05 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I wrote Attorney General Merrick Garland last week about decision of Justice to represent Trump and foil Ms. Carroll’s case. It was wrong for Barr and wrong for Garland. Defaming a woman who is alleging rape is outside the role of president.⁦Justice!! https://t.co/sflKYa48Wc","date":"Sun Mar 13 15:07:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@TimbercreekNW @NBCNews @MeetThePress He says elections are binary but he’d vote for lying, impaired, grifter Trump over any Democrat. That attitude is why he sought AG job to help Federalist society control Supreme Court. 🐷","date":"Sun Mar 13 14:55:57 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@NBCNews Having Bill Barr,a liar and rationalizer, on your program is beneath the reputation of @MeetThePress).He decided to lie about mail in voting (Texas) ,stymie E. Jean Carroll pursuit of justice,prosecute Michael Cohen but not Individual One.Shilling his book! A pig 🐷","date":"Sun Mar 13 14:46:31 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"If Putin is contemplating using chemical weapons in Ukraine, @POTUS and the global community must speak in one voice that such a course of action will not be tolerated and take whatever measures are necessary to deter Russia from even considering such dark and destructive action.","date":"Sat Mar 12 21:20:40 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Poland offered to provide Ukraine with fighter jets, and I join my colleagues in asking that the U.S. help make this delivery happen. Ukraine needs these aircrafts. We can’t sit by and watch as Putin’s army commits war crimes, murder and genocide. https://t.co/lDsYx2Y9mL","date":"Sat Mar 12 18:47:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@smerconish @POTUS @JoeBiden @CNN @cnni I’m adding my name to the 15 House members.We shouldn’t  sit back and watch war crimes and murder and genocide.,YES. RepCohen","date":"Sat Mar 12 14:29:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Roman Abramovich is one of Putin’s wealthiest oligarchs and pals. All his blood money in the US is a flight risk. I urge @POTUS to immediately seize his assets and sanction him before he pulls the money out to fund Putin’s war. https://t.co/zyx2KbBso4","date":"Fri Mar 11 22:57:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin wants to destroy UKRAINE and drive Ukrainians out of the country and kill the others by bombs, bullets, and starvation.I’m convinced THIS IS GENOCIDE.Putin is a sociopath.","date":"Fri Mar 11 00:44:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Almost 12 million for important community projects in #Memphis. Programs that stretch the #901,the new downtown river park to Melrose in the Mound and help for the sick,the homeless,people in recovery, home repairs and black businesses.Regional One, Church Health,Collin’s Chapel.","date":"Thu Mar 10 23:22:03 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/phrrLywdF0","date":"Thu Mar 10 22:45:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"House Democrats passed a spending package that leaves behind Trump’s budget and tackles our nation’s most pressing needs, including funding for education, climate resilience, health care and jobs.","date":"Thu Mar 10 22:31:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"US Rep. Madison Cawthorn calls Ukrainian president a 'thug'  :: https://t.co/MjsGcaF4KX https://t.co/Ida6WzqgTQ\nMORE  BONKERS!! \nNEVER FORGET HE FALSELY CLAIMED ADMISSION TO US NAVAL ACADEMY BUT IS A DROPOUT.","date":"Thu Mar 10 20:58:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Rep. Madison Cawthorn charged with driving with revoked license for second time and speeding .My Senator would say he has a rap sheet. https://t.co/xZ03SJM5UC","date":"Thu Mar 10 20:44:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@sgbigdog1945 You can’t be so detached to not know that was a joke. I said,”she’s so into Trump that if he asked her to jump off the Harahan bridge she probably would.”\nNow if she actually would …but Marsha has a very good life and wouldn’t jump.\nLighten up","date":"Thu Mar 10 20:34:24 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Bonkers","date":"Thu Mar 10 20:25:22 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"My first thought was rats I wanted him  to play next year and win another Super Bowl. But then I realized he’s young enough to come back so maybe this will just be like Sinatra or Ali or Streisand or Brett Farve or MJ. Let’s hope https://t.co/Nbgauy5ypB","date":"Sat Jan 29 20:11:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The House just passed a ban on Russian oil. It’s time to Stick It To Putin At The Pump! #StickItToPutin","date":"Thu Mar 10 04:49:26 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Republicans scream about “Defund the Police” but not one voted for a once-in-a-generation investment in police and violence prevention. Not one Republican voted to fund cash-strapped local governments and public safety programs. Action speaks louder than words. https://t.co/PpDwJQJVYK","date":"Wed Mar 09 18:49:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Savannah Guthrie Grills Bill Barr Over Trump Concerns/: Barr says he’d vote for Trump if nominee despite being dangerous and off the rails.What a sad deluded fascist liar billy/bully barr is! https://t.co/mB4jsqa0sv","date":"Wed Mar 09 01:20:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"No I didn’t forget , I remembered how they subjected Ukrainian and Baltic people to repression and East Germans and others to KGB thugs like Putin. Thanks but no thanks.","date":"Wed Mar 09 01:06:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"What the Nazi’s and Soviets did to subjugate and minimize Ukrainians is being amplified by 10 by Putin the terrible.Glory to Ukraine!🇺🇦🇺🇦 https://t.co/cgJjois7Rr","date":"Tue Mar 08 23:47:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Ja Morant’s Sudden Ascent to NBA Superstardom - Sports Illustrated Ja is the very best! Showtime every time he plays! https://t.co/PmjP33m9x8","date":"Tue Mar 08 20:30:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I’m voting for the resolution condemning the rise of despicable, cowardly bomb threats to HCBUs. Congress must continue to recognize #HCBUs contributions by providing the support, infrastructure and investment to keep them safe, secure and successful. #HCBUStrong","date":"Tue Mar 08 20:22:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"3%’er , Proud Boys, Oath keepers are all going down.\nTrumps’ “Stand down but stand by” statement coming into focus. Trump conspired to overthrow the government. Treason! #14th amendment","date":"Tue Mar 08 20:01:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Good news from Poland.","date":"Tue Mar 08 19:29:22 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Not one Republican voter for the American rescue plan that made the largest investment in community police ever. $350 billion. Not one Republican vote. Defund the Republican campaign committee","date":"Tue Mar 08 19:25:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin is out of touch with humanity. He will listen to no one. He’s living with Peter the Great and wants to be “preserved# in death ala Lenin. The sooner the better!","date":"Tue Mar 08 18:45:21 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"STICK IT TO PUTIN AT THE PUMP","date":"Tue Mar 08 18:13:59 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/WmOsD38AEF","date":"Tue Mar 08 15:02:52 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Better idea- Put “Trump Shuttle” on the planes and Russians would provide them an escort to the bomb sites. https://t.co/JszjKSWgQC","date":"Tue Mar 08 14:30:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@AnneMCosgrove2 @QasimRashid Hate to differ with a good and compassionate constituent ( or nearly) but my tweet was totally acceptable.Prohibition request was DURING PROGRAM not Other time.I supported Ukraine, gave info to constitution/flower and Jared the medium.Hope you agree","date":"Mon Mar 07 23:27:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"BAN RUSSIAN OIL AND GAS! Americans may spend more at the gas pump but that is a small price for democracy, freedom and doing what’s right. If banned, we can 𝗦𝘁𝗶𝗰𝗸 𝗶𝘁 𝘁𝗼 𝗣𝘂𝘁𝗶𝗻 𝗮𝘁 𝘁𝗵𝗲 𝗣𝘂𝗺𝗽. #StickItToPutin\nhttps://t.co/LS1w3ES5RA","date":"Mon Mar 07 20:37:51 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ Barr’s book is lies, mistakes,misrepresentations,selected and limited recall ,and a fairytale of Maga love and unity.\nBS or BarrS… https://t.co/6F55JJNeHJ","date":"Mon Mar 07 17:25:25 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin had no fear of Ukraine or NATO. He just misses the power of the Soviet Empire and wants to go down in history along with Peter the Great. To do that, he needs to expand Russia’s land. Now people are dying for one despot’s sick fantasy of how he’ll be remembered. https://t.co/R8EVSidXtL","date":"Mon Mar 07 16:31:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Russia’s main product is oil and gas. It’s what they have and we shouldn’t be buying anything that supports Putin’s economy.\n\nStick it to Putin when you fill up your car with non-Russian fuel. https://t.co/nDerDHtcAT","date":"Mon Mar 07 15:29:53 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@LoveyTex The picture was irrelevant. It was about opportunity for Russians to know there was a transmission that possibly could have been detected and traced to sight. That is why only during the call was it important. The picture was irrelevant","date":"Mon Mar 07 14:45:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@tressiemcphd @grubreport Fake news","date":"Mon Mar 07 13:32:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@tressiemcphd is unwilling to acknowledge her tweet was off kilter and  should delete and correct.\nWorse than Duke coach not shaking UNC coach hand.He didn’t stand by a false calumny","date":"Mon Mar 07 13:31:29 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Two GOP senators share photos of Zelenskyy during call after lawmakers asked not to by Ukraine https://t.co/BCSteA2MkX via @nbcnews","date":"Mon Mar 07 01:33:25 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin will undoubtedly hold Brittney as political leverage.This is very bad .Despite her having played in Russia for years,she is charged with a drug crime which is sternly  dealt with in Russia.And now this Queen of the WNBA is a pawn in Putins’ war. https://t.co/bzpNNU9DFu","date":"Mon Mar 07 00:38:18 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@tressiemcphd It’s fake news. The only security concern was DURING THE ZOOM. Most who errantly thought my tweet was against Ukrainian requests and since learned that it was not, have apologized on Twitter or to me in a note. I request all to either retract or tweet a correction.RIGHT THING !","date":"Sun Mar 06 22:37:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@NorwoodCreech There was no request or prohibition after the zoom cast only DURING. So I appreciate concern but I knew the rules and follow them.","date":"Sun Mar 06 20:03:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@TheePurity @NicoleKowalski5 I’m just doing my job.Attending meetings/zoomcasts,Informing my constituents/followers and reporting the medium by which information was relayed.All without violating the do not post DURING THE ZOOM request and accordingly not jeopardizing anyone.🇺🇦🇺🇸","date":"Sun Mar 06 19:59:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@LoveyTex You are wrong. Totally and completely.","date":"Sun Mar 06 15:30:31 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I’ll be on @CNN at 6:07 central time this morning w Kaitlyn Collins","date":"Sun Mar 06 11:59:40 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Once KGB ALWAYS KGB","date":"Sun Mar 06 00:56:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin is a mad dog","date":"Sun Mar 06 00:11:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Dear Big Tech: Your companies are fanning the flames of the war in Ukraine by spreading Kremlin-backed disinformation through your various platforms. \nhttps://t.co/LxhMThbhwI","date":"Sat Mar 05 19:59:59 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We’ve watched Putin’s invasion with horror, but the fossil fuel saw an opportunity to turn violence and bloodshed into oil and gas profits, pushing a narrative that the U.S. needs a drilling free-for-all on public lands. @RepRaulGrijalva and @NRDems set the record straight.","date":"Sat Mar 05 16:51:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@ekennedie @SpeakerPelosi We were all asked not to do anything during the meeting. After the meeting no problem. Nothing in the photo would identify him or location. Republicans Senators Dane and Rubio published during meeting. My tweet was after meeting was over and reportage had already been made on CNN","date":"Sat Mar 05 16:45:22 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Morning  bicameral,bipartisan call w President Zelinskyy.He needs planes and drones. Most sanctions inc. no credit cards in Russia.Mentioned nuclear plant threat and civilian deaths,50 children.Chechnyian hit squad killed a Mayor.All should live free. \nA great and brave man🇺🇦 https://t.co/HTRxWiMomZ","date":"Sat Mar 05 16:04:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"ChickenBarr doing interviews to sell his book. \nBill Barr, You lie down with dogs you get up with fleas.Even Frontline can’t help you.","date":"Sat Mar 05 05:39:29 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I am writing #POTUS @JoeBiden to not purchase gas or oil or any energy product from Putin’s Russia.Let’s stick it to Putin every time we gas up. Gas prices will increase because of Putins war. STICK IT TO PUTIN AT THE PUMP","date":"Fri Mar 04 22:05:16 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Saddened about the shooting in Whitehaven and closely following news of the three children’s conditions. Gun violence cannot be the norm and leaders at every level of government cannot turn away from our duty to protect our children and public safety.\nhttps://t.co/NS8zI9TwYv","date":"Fri Mar 04 21:56:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Pleased to see the Governor finally request federal assistance for Tennesseans recovering from the devastating ice storm following continued calls from myself and others. I’m continuing to monitor progress on the delivery of this necessary federal aid.\nhttps://t.co/LQvH0G2hJb","date":"Fri Mar 04 20:42:55 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Many countries sell citizenship in exchange for an “investment” such as a million-dollar penthouse. Traffickers often take advantage of this to purchase a passport and escape accountability. Proud to join with @RepBurgessOwens to stop this with the No Travel for Traffickers Act.","date":"Thu Mar 03 19:13:16 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"After last week's ice storm left nearly 120,000 residents of Shelby County without power, including tens of thousands still today, I’m calling on @GovBillLee to swiftly request disaster assistance to ensure our region receives the necessary support. https://t.co/GOonDVZX9g","date":"Mon Feb 07 20:45:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"#POTUS Joe Biden years ago looked into Putins eyes and said ,”You don’t have a soul”.When I see his eyes in pictures I know Joe was right.","date":"Thu Mar 03 13:30:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"An amazing and brave thread from Alexei Navalny,imprisoned Russian opponent of Putin,calling for revolution against the government led by “insane czar.”","date":"Thu Mar 03 02:47:51 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I am proud to stand with the Ukrainian people who are showing astonishing strength and resolve in the face of Russia’s cruel and relentless attack. My thoughts are with President Zelensky and his great nation.\nhttps://t.co/E19BTq6a41","date":"Thu Mar 03 01:20:57 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"As if one weren’t too many https://t.co/X9Ul8HRinD","date":"Wed Mar 02 13:19:15 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Voted for all these bills for our vets","date":"Wed Mar 02 13:05:10 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Boebert's outburst came moments before Biden mentioned his son Beau, who died of brain cancer in 2015. https://t.co/RYBBnuT2tw # via @HuffPostPol\nBoebert is disgusting and stupid. Embarrassment to Colorado,Republicans,and her family.A show business,money absorbed terrorist.","date":"Wed Mar 02 12:21:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@just_dial_truth @cyndilenz She is nuts.","date":"Wed Mar 02 03:41:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Joe hitting it out of the park. #POTUS","date":"Wed Mar 02 02:58:57 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Today, I’m introducing the Ukraine Democracy Defense Lend-Lease Act with @RepJoeWilson.\nhttps://t.co/YYl7qO4Rib","date":"Tue Mar 01 20:00:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"FDR’s Lend-Lease program helped Britain keep fighting the Nazis in WWII and ultimately helped roll back tyranny across Europe. The lend-lease bill I'm co-leading will, I hope, allow the Ukrainian people to defend themselves against Russian aggression without obligating US troops.","date":"Tue Mar 01 20:00:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin destroys memorial that reminds Ukrainians and world of Nazi’s horrific conduct.Jewish victims attacked again by Inhumane,horrific sociopath.","date":"Tue Mar 01 18:40:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Despite more than 200 attempts to pass antilynching legislation since 1900, lynching has never been designated a federal hate crime. The Emmett Till #AntilynchingAct would change that — and I voted last night to pass it on the House floor.","date":"Tue Mar 01 14:29:23 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I can’t sleep thinking about the onslaught coming to Ukraine. Can’t imagine what life is like there. The determination and spunk while missiles drop and food is scarce. F Putin and His Russia.\nGoing to be a long day with many meetings and SOFTU.","date":"Tue Mar 01 09:25:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Russian war is killing women and children as their missiles enter residential areas. Russia has overwhelmingly advantage in personnel and equipment/ weapons. I foresee &amp;fear blood bath as Putin relishes force and destruction. He is a son of a bitch.The sociopath will enjoy horror","date":"Tue Mar 01 02:48:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@walters8082 @ArtsyAnglican @LuapNibar @HouseJudiciary No you fool it’s not just Trumps politics I don’t like , it’s his grifting,lying,misogynistic,amoral,irreligious, and insipid life. Grab ‘em by the …,?what a roll model! Ok with you I guess but not with me!","date":"Tue Mar 01 02:03:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Last week I led a delegation to the @oscepa and met with US troops 8 miles away from Russian troops.\n\nI #StandWithUkraine and applaud Presidents Zelensky and Biden. The transatlantic community is united against Putin's invasion. He's a delusional, paranoid and dangerous tyrant. https://t.co/Dm8Ma35Lrr","date":"Mon Feb 28 21:50:38 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The greatest path to energy independence is a faster transition to green energy.","date":"Mon Feb 28 21:08:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I’m proud to introduce the Latonya Reeves Freedom Act with @RepYvetteClarke &amp; 45 bipartisan cosponsors.\n\nCongress must ensure that Americans with disabilities aren’t forced into institutional settings and have the freedom to choose how and where they live.\nhttps://t.co/mgTvqBPuIS","date":"Mon Feb 28 20:24:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The Latonya Reeves Freedom Act I introduced today with @RepYvetteClarke is a major civil rights bill, which affirms people with disabilities' right to receive services wherever they choose, including their homes. Passing it will help ensure all are free to lead independent lives.","date":"Mon Feb 28 20:24:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Remove Russia from the UN Security Council.","date":"Mon Feb 28 16:25:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"In awe of his courage https://t.co/oJ6Ko91fYS","date":"Mon Feb 28 15:06:40 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"From my neighborhood: https://t.co/u4ch6Z4jPn Hernando De Soto bridge in Memphis honors Ukraine!","date":"Mon Feb 28 15:05:15 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Another Maccabee for Ukraine and the free world! However while  the candles lasted an amazing 8 days , this Maccabee needs more weaponry… NOW! https://t.co/9Mog30FD69","date":"Mon Feb 28 14:29:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Paying my R-E-S-P-E-C-T to Aretha Franklin, the Memphis-born Queen of Soul. #BlackHistoryMonth https://t.co/HvYZUtdTFf","date":"Mon Feb 28 13:14:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@LuapNibar @HouseJudiciary Yes I mocked Barr and I was in Trump’s face from day one;boycotting his inaugural and state of the unions. “Good trouble” w John Lewis.Never shook his fat short fingered hand. Very proud of authoring and introducing first impeachment articles.Was/is aberrant prez and person.🇺🇸👍","date":"Mon Feb 28 13:06:31 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Chicken Barr was afraid of being questioned in @HouseJudiciary but is now publishing his account of Trump-Barr error(sic).Yes Trump went off the rails but ok w Barr as he kept the federalist society prez going to get right wing/fed.soc.Supreme Ct. judges!Evil twin dolts.","date":"Mon Feb 28 12:54:02 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@johncusack Have heard of kill lists( decapitate leadership) for week. Putin is a sick one. I’m sure he’ll find a way to View Zelenskyy murder. Since his sick, “my beauty it’s going to happen…” it was clear the sociopath would kill possibly ala Khashoggi. An SOB.","date":"Sun Feb 27 20:38:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Important and courageous move by Turkey to take initial steps to limit passage of Russian warships into the Black Sea.\nhttps://t.co/tK9RDpmmWy","date":"Sun Feb 27 20:26:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin is getting more isolated and paranoid and delusional.The soulless dictator is a prisoner of his KGB training which is cold, detached, and ruthless.","date":"Sun Feb 27 18:02:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Real dumb and wrong for Donald to “think” or say","date":"Sun Feb 27 17:51:31 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I met with Madame President Tsikhanouskaya last week in Lithuania and recognized her as President.She won the election that was stolen by Lukashenko ,who holds her husband and thousands of other Belarusian political prisoners.RESPECT!!","date":"Sun Feb 27 16:14:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Barr sabotaged Mueller report for Trump and stomped on free speech for Trumps’ political Bible show and lied on voting in Texas to help Trump election https://t.co/gN1rhxZ7mj John Bolton he didn’t act or speak right til he waned to make money through book sale.\nDON’T BUY THE BOOK","date":"Sun Feb 27 16:04:21 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Not wanting to call anyone a Nazi, even if their propaganda,their use of the military, and their authoritarian style and demeanor is eerily reminiscent,I say\nPUTIN IS A PUTZ!!","date":"Sun Feb 27 13:06:57 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@JGaffneyUSN A complete embarrassment to our country and the presidency","date":"Sun Feb 27 11:54:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin’s power is rooted in international dependence on Russian oil and gas. A global transition to clean energy would save the planet from the climate crisis AND Putin's Russia.","date":"Sat Feb 26 19:40:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I’ve written to congressional leadership urging an immediate vote on the Counter-Kleptocracy Act I introduced with @RepJoeWilson, @RepMalinowski and @RepJohnCurtis. We must expose and purge the blood money fueling Putin and his cronies.","date":"Sat Feb 26 18:39:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Corruption is the lifeblood of the Putin regime and he seeks to turn Ukraine into an autocratic kleptocracy dependent on his regime. We must become deadly serious about exposing the blood money that fuels Putin’s wars and repression. The Counter-Kleptocracy Act is the answer.","date":"Sat Feb 26 18:39:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Who knows? But I’m all in as the man or the myth encompasses the spirit of the Ukrainian people!🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦","date":"Sat Feb 26 09:11:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Ukraine is the Berlin of the 21st century. It’s citizens fight for freedom is reminiscent of Tianmen Square,standing up to the tank of oppression.\nWe must have further and SWIFT sanctions,more weapons, and support for refugees.\nNever forget Putins lies and evil, sociopathic acts","date":"Sat Feb 26 08:42:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to introduce this bill with @RepAndreCarson and @RepRoybalAllard to prevent evictions related to the COVID-19 pandemic from appearing on credit reports.\nhttps://t.co/lGgODdddA1","date":"Fri Feb 25 20:47:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin will invade and bring death to Ukrainian citizens and soldiers as well as Russian soldiers and it won’t phase him.Sociopaths don’t have feelings. He must be communing w Peter the Great. Reportedly 45,000 body bags delivered to Odessa.","date":"Wed Feb 23 18:40:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Americans have faced COVID's economic consequences for two years and shouldn't be denied future housing because of it. A prior eviction can affect your access to housing and credit for years to come. I introduced The Keep Evictions Off Credit Reports Act to help change that.","date":"Fri Feb 25 20:47:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The brave President Zelensky and his command team!Courageous leader. \nThe murderer Putin is secluded in his luxurious graft paid-for mansion threatening  Ukraine’s  women and children. What a “man”?","date":"Fri Feb 25 20:31:45 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I have been so proud to represent the USA as head of our delegation @OSPC parliamentary assembly and or supportive journey to Lithuania where we visited our troops 5 km.from Russians,met w prime minister and President. &amp; Belarusian leaders in exile. UKRAINE 🇺🇦🇺🇦🇺🇦!!Russia REVOLT!","date":"Fri Feb 25 20:05:57 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to be leading this environmental justice letter to @TransportDems with @RepBarragan and 24 other Democrats.\nhttps://t.co/ATOunUfgaP","date":"Fri Feb 25 16:49:41 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"As Congress considers upcoming legislation to manage our water resources, I’m leading the push to ensure the bill includes critical environmental justice provisions that redress the challenges facing our nation’s most vulnerable communities.","date":"Fri Feb 25 16:49:41 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Judge Ketanji Brown Jackson is a brilliant, analytical and experienced judge. She's ready to make a difference and would be the 1st Black woman to sit on the highest court. With a history as a public defender and as a district &amp; appellate court judge, she'll make a great Justice.","date":"Fri Feb 25 15:51:24 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"To paraphrase Trump.Russia,if you’re listening,President Zelensky is the bravest of leaders while Putin is in his billionaire mansion secluded and letting his soldiers do his blood work.","date":"Fri Feb 25 10:02:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The bravest leader on Earth","date":"Thu Feb 24 23:38:15 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It offends me to no end that Russia claims Ukraine is run by Nazis. Like me, Ukraine's President Zelensky is Jewish! They lie! The only consistent thing from Russia is lying, bullying and trying to reclaim what they had ~75 years ago when Russia fought the Nazis. https://t.co/qW5H7EPh9w","date":"Thu Feb 24 18:04:57 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@HeartlandSignal @KiarKini You offended millions and millions ,Jews and non Jews. Shame on you!","date":"Thu Feb 24 10:44:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Attending @OSCE parliamentary assembly in Vienna and listening to Russian lies about their support of Ukrainian people.However all but Russia and its vassal,Belarus, support Ukraine.Russian throws out antiNazi blather.Zelensky who is Jewish is Nazi ? KGB propaganda is in Putin.","date":"Thu Feb 24 10:34:58 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin is a wild dog and won’t stop at Ukraine. Hitler didn’t stop at the Sudetenland.Learn from history!\nThe United States and all NATO must immediately provide as much military support as possible to the Baltic countries,to Poland, and other allies at risk.","date":"Thu Feb 24 08:40:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The horror of war has commenced in Ukraine.Putin has joined Hitler as an evil, amoral individual who the World needs to cripple with ultimate sanctions and condemnations. UKRAINE STAY RESOLUTE!!YOU ARE NOT ALONE!","date":"Thu Feb 24 07:05:29 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Trump Refers to Russian Aggression Toward Ukraine as ‘Genius’ - The New York Times. Trump and Putin are two of a kind except  no would ever think of Trump as a genius.Pathetic traitor! https://t.co/Wm3XVfXMwU","date":"Wed Feb 23 20:00:52 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin will invade and bring death to Ukrainian citizens and soldiers as well as Russian soldiers and it won’t phase him.Sociopaths don’t have feelings. He must be communing w Peter the Great. Reportedly 45,000 body bags delivered to Odessa.","date":"Wed Feb 23 18:40:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"After 3 days in Lithuania and a visit with our brave troops,who are only 5 KM’s from Russian troops, it is clear Baltic states are rightly concerned about Putin and his dream of a new USSR. \nIn Vienna for OSCE meeting as tensions are understandably rising.","date":"Wed Feb 23 13:54:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Lithuania prime minister speaking frankly and expressing my thoughts. Meeting with her and other Lithuanian leaders in Vilnius. https://t.co/OOXoMbM3wP","date":"Tue Feb 22 07:40:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Freeing heroic/ courageous Sviatlana Tsikhanouskay,who succeeded her husband as candidate for president of Belarus, when he was arrested by The authoritarian Lukashenko simply for running. She won but he counted votes and abused protesters. She lives in exile in Lithuania.HEROINE https://t.co/QTcCXAENpt","date":"Tue Feb 22 07:27:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@JohnLow16891107 😂","date":"Sun Feb 20 17:11:08 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It’s a (w)rap ! Brilliant put down of this traitorous monster.","date":"Sun Feb 20 13:37:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The spirit of the Heavenly Hundred, Ukrainians killed at the Maidan, to secure freedom from Russia in 2014 , unites people courageously united to resist an invasion from an overwhelming powerful Russia.RESPECT! https://t.co/Y21mKyzkxf","date":"Sun Feb 20 13:32:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Zelensky. Good fortune in Munich and travel home tonight to Kiev!","date":"Sat Feb 19 14:34:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via @NYTimes Proud to be a plaintiff in this suit. Court affirms no one is above the law.\nThe arc of the moral universe is long but it bends toward justice.MLK,jr. https://t.co/wKrwk9o87K","date":"Fri Feb 18 23:00:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It appears the end of the #Beijing Games will be followed by Putins’ deadly and unlawful game with Ukraine and Zellinski.#UkraineConflict #russianinvasion","date":"Fri Feb 18 22:45:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to be joined in this effort to increase the transparency and accountability of @TVAnews by @RepTimBurchett.","date":"Fri Feb 18 17:52:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"My repeated requests to the TVA for salary information have been rebuffed. As a federal agency, its lack of transparency is unacceptable. The public, and the utility’s ratepayers, have a right to know what these public servants are being paid.\nhttps://t.co/3YLM6YAMnx","date":"Fri Feb 18 17:52:35 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"As Co-Chair of @HelsinkiComm, I’m leading a delegation to the Org for Security &amp; Co-Op in Europe, which initially included a visit to #Ukraine that was canceled. I sent a message pledging my support for the people of Ukraine assuring them we’d raise their security at the meeting. https://t.co/j2gPBwojph","date":"Fri Feb 18 00:19:26 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Going live soon! Get your burning tax questions answered and learn more from IRS experts how to file your taxes and maximize your refund.\nhttps://t.co/BEjcPVrFhz https://t.co/tM2gIA7XoV","date":"Thu Feb 17 17:40:26 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"She probably would have won gold but for the psychological trauma of the doping scandal which likely caused her four mishaps in todays #FigureSkating at #Beijing2022 \nRussia needs to play by the rules!","date":"Thu Feb 17 15:17:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"According to today’s Republican Party, it’s radical to believe prescriptions should cost less, parents should have access to child care, voters should be protected and billionaires should pay more taxes.\n \nI think it’s radical for Republicans to disagree. #BuildBackBetter","date":"Wed Feb 16 18:38:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"For decades, corporations have dumped pollution in low-income, minority communities. An oil company tried in southwest Memphis but was defeated by a grassroots effort that halted the Byhalia Pipeline.\n\nI’m fighting to ensure #EnviroJusticeNow for every community. https://t.co/BSQYmXNZsS","date":"Tue Feb 15 20:43:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The young Russian skater was likely the victim of Russia's routine use of performance-enhancing drugs and someone must be held accountable. We need better enforcement of anti-doping rules so Russia can't keep getting away with this. That's why Congress should pass our GOLD Act. https://t.co/PBHjQwKIty","date":"Tue Feb 15 18:34:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I was proud to introduce Guaranteeing Oversight and Litigation on Doping (GOLD) Act last summer alongside @SenWhitehouse, @SenatorWicker, @RepJoeWilson, @RepRichHudson, @JacksonLeeTX18, @michaelcburgess and @Repmalinowski.\n\nhttps://t.co/IU2zlVjaLr","date":"Tue Feb 15 18:34:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The ADA guarantees equal opportunities for individuals with disabilities, which is why I'm leading a bipartisan group of more than a dozen of my colleagues urging @TheJusticeDept to reinstate critical ADA-related guidance that the Trump Administration rescinded. https://t.co/dlD5otVWic","date":"Tue Feb 15 14:40:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"As “Lift Every Voice” was sung at #SuperBowl as it was @Memphis_MBB game I was pleased America is being more familiar with this inspiring hymn and of chairing the committee that had the hearing to make Lift a national hymn","date":"Sun Feb 13 22:58:49 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"As president, Trump did nothing but grift and destroy records to cover up misdeeds. His party won’t say anything about it because they live in fear of his political wrath. I don’t see how they can look at themselves in the mirror. https://t.co/1AyY2UJMXx","date":"Sat Feb 12 17:27:25 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Any questions or concerns about your taxes? Join me and local taxpayer advocates next Thursday to discuss newly expanded tax credits, free tax prep resources, and how to file your returns and maximize refunds.\n\nReply with your questions or send them to Cohen.Press@mail.house.gov! https://t.co/1VhqXVkymr","date":"Fri Feb 11 23:15:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I happen to believe everyday Americans shouldn’t be padding pharmaceutical companies’ profits by paying higher prescription drug prices than any other country.","date":"Fri Feb 11 21:13:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"This week I reintroduced the #FreshStartAct, which provides for the expungement of certain nonviolent offenses. Allowing those who made mistakes earlier in their lives, and already served their sentences, to wipe the slate clean is essential to creating a more just system.","date":"Fri Feb 11 17:28:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"In America, even a nonviolent offense can be a life sentence. That's because the stigma of a conviction will follow you for the rest of your life. Employment, education, and housing–the very things necessary for a fresh start–can all be denied on the basis of a past conviction.","date":"Fri Feb 11 17:28:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Last morning for @SRuhle means @MSNBC will own the 11 o’clock hour as she’ll close the day in her intelligent,factual,and insightful manner.She is truly an ace and I look forward to her March 2 premier as SOTU is given in the House chamber.🎤📺👍","date":"Fri Feb 11 15:15:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Additionally, you may be interested to know that there will be another mobile food pantry tomorrow, February 11, 10 a.m to 1 p.m. at Dave Wells Community Center, 915 Chelsea Avenue, Memphis, TN 38107.","date":"Fri Feb 11 03:07:58 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"If you have renters or homeowners insurance, you may want to inquire if you are eligible for reimbursement for damage or lost food. Those who are eligible for SNAP, may also become eligible for reimbursement.","date":"Fri Feb 11 03:07:58 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Following my request, Tennessee has asked @FEMA to conduct a damage assessment, which is a necessary first step in bringing federal assistance to Memphis and West TN. Too many have suffered from this storm and I'm doing all I can at the federal level to help and share info.","date":"Fri Feb 11 03:07:57 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Glad @TVAnews rolled back their threats to medical marijuana, which is now a lawful business in Mississippi. TVA’s mission is to help the people!","date":"Thu Feb 10 22:07:48 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"And we don’t dope our athletes or kill our political opponents ( ok you imprison some) or interfered with U.S. elections. Just a cuddly,friendly bear like Yogi! https://t.co/HsbBms5yzs","date":"Thu Feb 10 20:44:22 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Pleased and proud that @uofmemphis and @memlawschool grad Andre Mathis is the first black man from Tennessee nominated and advanced by Senate Judiciary to the 6th Circuit Court. #BlackHistoryMonth","date":"Thu Feb 10 19:01:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ . Trump continuously illegally destroyed papers(remember the stenographers notes from his Putin meeting?)and avoided call logs.\nA CRIMINAL MIND DOING CRIMINAL THINGS! https://t.co/HQTDsOWqoI","date":"Thu Feb 10 17:25:59 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Starbucks corporate executives are sipping on fresh venti cappuccinos while their employees have yesterday’s lukewarm brew. I stand in solidarity with unionizing Starbucks employees and affirm the right of all workers to organize without fear of retaliation.","date":"Thu Feb 10 15:10:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"After Mississippi joined 36 other states in legalizing cannabis for medical use, TVA is reportedly threatening to turn in Mississippi's legal cannabis businesses to federal agents. These policies are outdated, unpopular and scientifically baseless and that's what I told @TVAnews. https://t.co/wpWSn5ATF2","date":"Thu Feb 10 14:01:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Every worker deserves the right to organize and bargain collectively. That includes Congressional staff.\n \nThat’s why I’m a proud original cosponsor of @RepAndyLevin’s resolution to allow Congressional employees to unionize without fear of retaliation.\nhttps://t.co/ROIpvqrv1Y","date":"Thu Feb 10 02:15:10 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Not a pretty picture but what would you expect.Grifters .","date":"Wed Feb 09 19:43:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to have worked on advancing these major pieces of the bipartisan Counter-Kleptocracy Act with fellow @KleptoCaucus members @RepJoeWilson, @RepFrenchHill, @RepJohnCurtis and @RepMalinowski.","date":"Wed Feb 09 14:33:29 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Countering corruption and autocracy is critical to restoring America’s global leadership. With the inclusion of major parts of my Counter-Kleptocracy Act, the #AmericaCOMPETESAct will root out corruption, invest in innovation and bolster U.S. competitiveness on the world stage.","date":"Wed Feb 09 14:33:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"My deceased owl was necropsied ( brief not full).results indefinite.Was thin and young and may have just not been effective https://t.co/SXCb602LJN internal bleeding which would have been present if rodenticide.NEVERTHELESS I URGE NOT TO USE POISON .RAT POISON KILLS RAPTORS TOO.","date":"Tue Feb 08 23:03:25 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The #PostalServiceReformAct will:\n📪 Ensure USPS is finally on a sustainable financial footing.\n📪 Require USPS to deliver both mail and packages at least 6 days per week.\n📪 Develop an online system to track performance and promote accountability.\n\nI'm voting YES on its passage.","date":"Tue Feb 08 21:33:59 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@Tigerfan64 @GaryWiner5 @GovBillLee No wasn’t sent before my request and still hasn’t","date":"Tue Feb 08 19:50:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@Tigerfan64 @GovBillLee The request wasn’t made before I submitted my letter and hasn’t been made yet. Somebody has to light a fire!\nSometimes you seem almost friendly but more often than not you’re knee-jerk Republican. Why do you make statements that the governor has done something when he hadn’t ?","date":"Tue Feb 08 19:49:20 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"On #SaferInternetDay, I'm joining @RepSusanWild in calling on @YouTube to take a simple yet potentially lifesaving action: take down videos about how to tie a noose. At a time when teen suicide rates are on the rise, taking this step could save lives.","date":"Tue Feb 08 19:00:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"From your apartment lease to a rideshare app’s terms and conditions – forced arbitration clauses are everywhere, protecting those in power. But when it comes to sexual harassment &amp; assault, the #EndForcedArbitration Act puts the power in survivors’ hands.","date":"Tue Feb 08 18:06:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"After last week's ice storm left nearly 120,000 residents of Shelby County without power, including tens of thousands still today, I’m calling on @GovBillLee to swiftly request disaster assistance to ensure our region receives the necessary support. https://t.co/GOonDVZX9g","date":"Mon Feb 07 20:45:37 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@julie63pbc Julie\nI care greatly about the lack of utilities that my constituents have endured  cause of ice storm. However it is a city responsibility to clear fallen trees and renew utilities. I am looking into federal disaster aid for damages.","date":"Mon Feb 07 17:19:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"There was info from State dept. folk that TFG was leveraging foreign aid for political dirt! ILLEGAL!! Even for “regular folk” tho TFG was/is IRREGULAR!","date":"Mon Feb 07 15:06:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Call me a radical, but I don’t think those who lift themselves out of poverty should lose everything because of one medical diagnosis. We need affordable health care for all.","date":"Mon Feb 07 14:47:22 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Only the ones who actively aided what their party calls January 6,“legitimate political discourse”,but what objective people call —INSURRECTION!","date":"Sun Feb 06 22:33:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@JohnLow16891107 No I’ve voted no on nearly all defense budgets and appropriations . Appreciate your “shake stick” positions but please don’t misrepresent my record.","date":"Sat Feb 05 15:16:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Watching surreal Winter Olympics opening in Beijing with Xi and Putin in attendance while John Lennon’s “Imagine” fills the Bird’s nest with “..Imagine there’s no countries.. nothing to kill or die for.. All the people livin’life in peace.”Talk about a deaf audience of two.","date":"Sat Feb 05 03:53:14 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It’s unbelievable we’re even talking about the possibility of a major war as Russian forces mass at Ukraine’s border in preparation for what could be the largest invasion in Europe since WWII. This subject should have been left in the Dark Ages, not part of the future of mankind. https://t.co/pUckXF1lTi","date":"Fri Feb 04 23:30:52 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Proud that the House passed major pieces of my Counter-Kleptocracy Act as part of the #AmericaCOMPETESAct, which will strengthen global order and democracy, bolster American manufacturing, fix our supply chains, and invest in the next generation of cutting-edge technology.","date":"Fri Feb 04 20:54:10 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Well written and proper accounting of Rep. Jim Cooper and Tennessee redistricting that virtually cancels Nashville","date":"Fri Feb 04 16:12:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I represent one of the biggest transportation and distribution hubs in the country. I'm proud to have helped pass one of the largest infrastructure laws in decades—an historic investment in Memphis and the entire country, which we passed without a single TN Republicans' vote.","date":"Wed Feb 02 18:48:01 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Putin couldn’t have a better mouthpiece.Trump should move to Moscow.","date":"Tue Feb 01 22:34:49 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Trump called 3 Black prosecutors “vicious horrible people”,” racists and they’re very sick” “mentally sick” and called for “biggest protests .. ever … because our country and our elections are corrupt.”","date":"Tue Feb 01 22:33:18 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Sadly and unfortunately, I learned today that the barred owl didn’t make it. First thought is he might have eaten a poisoned rat. When I have more knowledge of the cause, I’ll share it with you. Meanwhile, I appreciate—as I'm sure all animal lovers do—your expressions of concern. https://t.co/0xJsljGY6C","date":"Tue Feb 01 19:49:38 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"To start #BlackHistoryMonth, I’m recognizing Benjamin Hooks, who was born in Memphis and led the fight for civil rights as Executive Director of the @NAACP. https://t.co/YLZyNiA056","date":"Tue Feb 01 14:51:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@MarkMe27048355 @AmoneyResists Doing both. Chew gum /walk. Tweet/think.Watch a game/eat .","date":"Tue Feb 01 14:46:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Black History Month is a time to celebrate the courage, creativity and resilience of Black Americans and pay special attention to the extraordinary political, scientific, artistic and cultural contributions made by Black Americans even under the most trying circumstances.","date":"Tue Feb 01 14:28:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@ZOOmility @MemphisZoo Folks said maybe damaged wing but no break .vet will do thorough exam in morning","date":"Tue Feb 01 01:21:44 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@ZOOmility @MemphisZoo Early word is seems ok but they mentioned poison as a possibility. Is that common from eating a poisoned rat?","date":"Tue Feb 01 00:40:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"After decades of talk about rebuilding our infrastructure, @POTUS, the Democratic Caucus &amp; a handful of Republicans delivered. The @WhiteHouse released a guide to ensure communities can take full advantage of the infrastructure law’s funding opportunities.\nhttps://t.co/DQ0MytrcfZ","date":"Mon Jan 31 23:50:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Came home to injured or sick owl. Living close to ⁦@MemphisZoo⁩ was able to get https://t.co/PZrOTXI6M4 will get care and hopefully fly again. Thank you Zoo raptor unit! https://t.co/q2ejRjLOIt","date":"Mon Jan 31 21:51:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Came home to injured or sick owl. Living close to ⁦@MemphisZoo⁩ was able to get https://t.co/PZrOTXI6M4 will get care and hopefully fly again. Thank you Zoo raptor unit! https://t.co/q2ejRjLOIt","date":"Mon Jan 31 21:51:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I reintroduced the Civil Rights Legacy Protection Act earlier this year to enact the first-ever federal protections for civil rights memorials.\nhttps://t.co/U6JH8MTRJB","date":"Mon Jan 31 18:26:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"There’s been a disturbing pattern of vandalizing markers dedicated to Black Americans and civil rights, most recently Jackie Robinson, which I’ve been working to end by passing my Civil Rights Legacy Protection Act.\nhttps://t.co/wr0bZTzf0e","date":"Mon Jan 31 18:26:27 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Biden’s handling of Supreme Court vacancy has been 'clumsy at best': Sen. Collins - ABC News via @ABC - https://t.co/qXJcPneYhm // However Trumps pact  w Evangelicals to have anti Roe nominees as vetted by Federalist society was OK ?","date":"Mon Jan 31 16:17:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"GOP politicians are rooting for democratic decline and chaos, preferring to hurt Americans than lose elections.\n\nBut even in these conditions, Dems lifted millions of children out of poverty, sent stimulus checks to nearly every American and passed an historic infrastructure law.","date":"Mon Jan 31 14:35:10 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"RAFA RAFA RAFA RAFA RAFA\n🐐Comeback for the ages. Old guys don’t quit! They win titles ! \nMedvedev is the future Putin. Don’t send him to the front! In fact don’t have a front. Get your vicarious thrills from sport not war! 🎾☮️ https://t.co/A5QmK8CaHl","date":"Sun Jan 30 22:10:54 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"My first thought was rats I wanted him  to play next year and win another Super Bowl. But then I realized he’s young enough to come back so maybe this will just be like Sinatra or Ali or Streisand or Brett Farve or MJ. Let’s hope https://t.co/Nbgauy5ypB","date":"Sat Jan 29 20:11:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Australian Open colossal title match of veteran star,Rafa Nadal and temperamental Daniil Medvedev, Putin with a tennis racket.Cheering for Rafa to claim 21st Grand Slam! https://t.co/x6CuvNprj1","date":"Sat Jan 29 16:54:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via @NYTimes Both Mitchell and Young , like myself, had polio as youngsters before Salk and Sabin vaccines became available to prevent polio. Those who suffered from that viral epidemic don’t suffer liars and fools well. Out damn Spot(ify) https://t.co/qkvo8YlCOb","date":"Sat Jan 29 16:17:13 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Democrats have already delivered the American Rescue Plan and the historic Infrastructure Investment and Jobs Act. Republicans have no agenda but to obstruct our efforts and degrade our democracy. They will stop at nothing to claw their way back to power.","date":"Fri Jan 28 21:49:45 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The Infrastructure Investment and Jobs Act is a huge deal for Memphis and the entire country. #DemocratsDeliver","date":"Fri Jan 28 16:58:01 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"In 2022, we’re talking about more than Republicans enacting obstacles to voting. They are systematically closing polling locations in minority communities and changing election laws that could allow partisan actors to interfere with vote counts and even overturn results.","date":"Fri Jan 28 14:42:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Memphis has produced some of the greatest musicians and artists. Great to see Democrats’ American Rescue Plan help Memphis sustain a thriving arts scene even during COVID, including grants today to @BCCCMemphis, @StaxAcademy, @StaxMemphis &amp; @tscsmemphis. https://t.co/23JMY8FeLX","date":"Fri Jan 28 01:13:52 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The McMinn County School Board's unanimous decision to remove Maus from its curriculum is typical of a trend around the country of rightwing politicians attempting to shield themselves from the painful truths of history. Thanks @jaketapper for covering this important issue. https://t.co/DE013EP5Kf","date":"Thu Jan 27 23:31:49 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@RepJohnYarmuth @LouisvilleMBB Just don’t come for Penny!He is at home in Memphis!","date":"Thu Jan 27 22:33:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Democrats have already delivered the American Rescue Plan and the historic Infrastructure Investment and Jobs Act. Republicans have no agenda but to obstruct our efforts and degrade our democracy. They will stop at nothing to claw their way back to power.","date":"Thu Jan 27 20:04:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"U.S. GDP grew by 5.7% in Biden and the Democrats’ first year, faster than any year in decades and than any other major advanced economy. #BidenBoom\nhttps://t.co/QKyPj7q26x","date":"Thu Jan 27 18:41:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Nearly 100 years since a teacher was prosecuted in the Scopes Trial for teaching evolution, the neighboring county bans a book about the Holocaust.\n\nThe Holocaust should never be forgotten, and children can learn easier from a Pulitzer Prize-winning comic book than anything else.","date":"Thu Jan 27 17:38:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"On #HolocaustRemebranceDay, it is especially important to reflect on how 6 million Jews and millions of other people were murdered, when just years earlier Germany had been a thriving liberal democracy. We must never forget that history and never let it happen again.","date":"Thu Jan 27 14:03:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Tonight at 10pm ET @CNBC is continuing the investigation into what brought down the Boeing 737 Max planes. Included is my grilling of the Boeing CEO in search of answers and accountability for corporate greed.\nhttps://t.co/MFibKOqtn6 https://t.co/lQm4Q9IXgw","date":"Wed Jan 26 23:40:25 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@BeschlossDC A prejudiced and hateful misanthrope.However he was representative of the attitudes of many others back then and still a few now.Fortunately they don’t appear in my party any longer.Nor I hope at our university","date":"Wed Jan 26 23:04:20 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The arc of the  moral universe is long but it bends toward justice MLK,JR","date":"Wed Jan 26 22:35:26 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"In the first year of Biden’s Presidency, we've vaccinated more than 200 million Americans, created more jobs than in the previous 80 years, lifted millions of children out of poverty, and started rebuilding our roads, bridges and infrastructure.\nhttps://t.co/pns4WXbPKW","date":"Wed Jan 26 22:13:40 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Right around 1:17 in @POTUS’s video, Memphis’s Hernando de Soto Bridge is featured, where I invited Secretary Pete last year to discuss its reopening and stress the urgent need for investing in our infrastructure.","date":"Wed Jan 26 22:13:40 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It seems many on the other side of the aisle have come to the cynical conclusion that it no longer pays to protect voting rights. They seem to believe that they can only win if they suppress the right to vote for certain Americans. https://t.co/wIXiEQnKK4","date":"Wed Jan 26 18:16:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It was a Washington GOP redistricting and not a Tennessee one. Nashville , like Memphis, has had and should have, their own Congressman.Enough for state rights/supremacy.","date":"Wed Jan 26 17:19:51 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The media is happy to parrot Republican talking points about inflation, but won’t mention that historic inflation is hitting the entire world or that the US economy is growing faster than almost any other major economy. https://t.co/DFyMlXQYAS","date":"Wed Jan 26 16:36:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The American Rescue Plan, delivered solely by Democrats, provided the resources that schools needed to reopen, stay safely open and make up for lost time. The Shelby County School District received $503 million to bring kids safely back into classrooms.","date":"Wed Jan 26 14:03:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Tucker AMERICA likes democracies and Allie’s.We don’t particularly like autocrats who threaten others with military strength,who dope their athletes and lie about it,and where political opponents conveniently are murdered and others https://t.co/VML1NVS49I do you get in Tuckster?","date":"Wed Jan 26 05:05:51 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I asked AG Garland same question during Judiciary Committee interview.I received a stock,”We don’t talk about cases” https://t.co/JQ7DdTAfRi least he knows some of us care and believe Individual  One should be indicted!","date":"Wed Jan 26 00:55:09 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It’s unfortunate that it has come to this, but Congressman Cooper will be long remembered for his service and will be greatly missed.","date":"Tue Jan 25 23:19:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Jim Cooper is one of my best friends in Congress and has brilliantly represented his district and our state. Smart, diligent and studious, he has unquestioned integrity and is much respected by his colleagues. His voice will be missed even more than his vote. It is a great loss.","date":"Tue Jan 25 23:19:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Davidson County deserves to have its own voice in Washington, but Republican redistricting plans never took that into consideration. The @TNGOP simply want to take that seat by any means necessary.","date":"Tue Jan 25 23:19:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":".@POTUS and @TheDemocrats have been working to improve supply chain issues, lower costs and beat the pandemic with masks, vaccines and tests. Already, the US economy has grown faster than almost any other country and we created more jobs in 2021 than in the past 80 years.","date":"Tue Jan 25 16:48:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Home in Memphis, I see the pain of rising prices. Working families have been hit hard by inflation here and around the world, since the pandemic has kept workers at home or out of work, especially in China, and caused global supply chain issues.","date":"Tue Jan 25 16:48:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We find our democracy on the precipice not only because of the Senate’s procedural anachronism, but because one party has decided to reverse its historic support for strong voting rights protection and chosen voter suppression as a political strategy. https://t.co/vyUeuBzY3k","date":"Tue Jan 25 15:47:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@AdamParkhomenko I thought it was a spoof . Had to watch twice and then realized it was her making a fool.","date":"Tue Jan 25 07:37:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@Acyn At first I thought this must be some one doing a spoof on her. But ….","date":"Tue Jan 25 05:25:19 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@yomzking As Horace Greeley said, “Go West Young Man” .As Rev. Al Green song,” Take it to the River.” That’s @MemphisFB !","date":"Tue Jan 25 05:17:36 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Warren Zevon would have been 75 today.He was a great friend and under appreciated singer/ songwriter of immense insight and talent. He wrote about layers of life often avoided  but essential parts of the 20th C and about relationships and the inevitable! https://t.co/2uZ5rekPuA","date":"Tue Jan 25 03:40:34 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Top Jan. 6 Investigator Fired From Post at the University of Virginia https://t.co/KbWY9i7Ghm. Where there’s a smell that’s a stink there’s a foul deed involved.","date":"Tue Jan 25 02:17:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"16 of the Republican Senators who voted in 2006 to reauthorize the Voting Rights Act in an overwhelming 98-0 vote are still in the Senate today. Not one of them voted this time for the John Lewis Voting Rights Advancement Act.","date":"Mon Jan 24 15:06:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Been on the downhill since Covid.But for Covid you use a mask,for Maher earplugs.@billmaher","date":"Sat Jan 22 21:54:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Even *with* #RoevWade, abortions are largely unavailable depending on where you live and how much you make. If Roe is overturned, half the country will be even worse off. That’s why my colleagues must join me to call for a YES VOTE on the Women’s Health Protection Act.","date":"Sat Jan 22 15:03:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Ida B. Wells has been immortalized by Barbie with the Memphis Free Speech in her hands. The newspaper played an important role in her anti-lynching campaign, and just this week Memphis named a street in her honor alongside her recently erected statue. https://t.co/xb8NEOXptB","date":"Fri Jan 21 20:06:58 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Yesterday I chaired a hearing on voter suppression sitting under a portrait of Senator Dirksen, the Republican leader who worked with non-southern Democrats to pass the Voting Rights Act of 1965. Are any of those Republicans left? https://t.co/NK9nMvNJCI","date":"Fri Jan 21 18:16:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"In 1965, Republicans joined with Democrats to defeat southern segregationists’ filibuster and passed the Voting Rights Act. Now the entire Republican Party is filibustering voting rights legislation.","date":"Fri Jan 21 16:57:45 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"His dissenting vote re: Trump records release in 8-1 SupremeCourt decision , when he should have recused himself as his wife was part of January 6 pep rally to overturn the election,is a painful reminder that George Herbert Walker Bush appointed him to Justice Marshall’s seat.","date":"Fri Jan 21 05:00:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"You’ll note Dirksen’s torn head. The artist,Ted Faiers, knew he was conflicted as he was liberal on social Justice yet conservative on spending. He would be torn asunder to see Republicans oppose voting rights.","date":"Thu Jan 20 17:31:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Senator Everett Dirksen Republican of Illinois. He led the first successful cloture vote in the Senate on a civil rights act and was responsible for the passage of the 1964 civil rights act and was sponsor of the 1965 voting rights act. When Republicans were the party of Lincoln. https://t.co/RMCLlSBu20","date":"Thu Jan 20 17:23:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The Safer Streets Act I’m reintroducing today is intended to provide additional funding to address violent crime in places where the rate is significantly above the national average – places like Memphis.","date":"Thu Jan 20 16:01:25 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Spread the word to your friends and family about free COVID tests. Anyone who does not have access to the internet can call the https://t.co/cf6BVL0oFx hotline 1-800-232-0233 to request their home test kits.","date":"Wed Jan 19 19:16:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"If you’re privately insured, you can now also get up to 8 home tests per individual per month at zero cost to you. \n\nMost public and private plans will cover lab tests for free.\n\nMillions of free tests are also being distributed to community health centers, clinics and schools.","date":"Wed Jan 19 19:16:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"NOTE: If you live in an apartment and run into issues with ordering on https://t.co/Y4tk9FL7L9, try including your apartment number in the FIRST address line or put APT in front of it. You can also call 1-800-ASK-USPS to get your home correctly categorized as multi-unit.","date":"Wed Jan 19 19:16:11 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":".@POTUS followed through on making more COVID tests available. You can request four free rapid tests per household, shipped to your door, in less than 30 seconds.\nhttps://t.co/e2H2fgBedp","date":"Wed Jan 19 19:16:10 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Democrats are delivering again for the American people—this time with $40 billion to upgrade crumbling bridges.\n\nFor Tennessee, the infrastructure law is already delivering $302 million to improve our bridges and create jobs. We know too well how badly our bridges need repairing. https://t.co/LjKLxACltn","date":"Tue Jan 18 15:55:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Senate Republicans don’t want every eligible American to vote because they fear more people might vote for Democrats. That isn’t election protection – it’s minority rule.","date":"Tue Jan 18 13:49:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We must continue MLK’s work to protect voting rights, eliminate poverty, end unfair policing practices, expand healthcare access, and ensure workers’ right to organize. As he said in Memphis the night before he was killed, “We have an opportunity to make America a better nation.”","date":"Mon Jan 17 15:58:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":".@POTUS echoed the words of MLK in urging the Senate to get on the right side of history and pass voting rights. It seems 2 Democratic Senators and all 50 Republicans don’t share Dr. King’s dreams of ensuring voting rights, but we won’t stop pushing.","date":"Mon Jan 17 15:58:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Dr. King’s dream inspired a movement that continues today, but the concerted effort to curb voting rights at the state level shows just how far from his dream we have strayed.","date":"Mon Jan 17 15:58:32 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Outrageous that Trump would associate with anti- Semitic frauds? \nNo , business as usual. Breeding chaos and disinformation and deception","date":"Sun Jan 16 16:42:24 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Agree with my Louisville colleague and brother.  \nLast night could have ended in death of hostages but federal, state, local law enforcement jointly brought crisis to safe conclusion. 🧢’s off!","date":"Sun Jan 16 16:36:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Reality not sinemaplistic","date":"Sun Jan 16 15:18:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Eliminating the political divide manifested and exacerbated by Trump is very complex not sinemaplistic","date":"Sun Jan 16 15:15:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I spent a good share of the morning listening to kinky’s music. What a great songwriter. A new song about Nelson Mandela and all the old ones :they don’t make Jews like Jesus anymore to the ballad of Charles Edward Whitman and that El Paso song. Kinky sings of freedom and fun.","date":"Sun Jan 16 02:15:31 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via @NYTimes A good  member of Congress in a caucus gone hay wire and mired in American/Trumpian division and disinformation. \nWith accreditation to Paul Simon,”Where have you gone Joe DiMaggio.” https://t.co/j1gXhXB1fg","date":"Sat Jan 15 19:52:55 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The @CityofMemphis and Shelby County are joining with the @NCRMuseum and @memgrizz to host a weekend of commemoration, celebration and action in Dr. King’s memory, culminating in a symposium and Grizzlies celebration game.\nhttps://t.co/n7LU3jp26n","date":"Sat Jan 15 14:01:51 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The @NCRMuseum is more than the site where Dr. King lost his life to an assassin’s bullet. It is a living, nationally recognized museum dedicated to civil rights and teaching Dr. King’s dream.","date":"Sat Jan 15 14:01:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"On Dr. King’s birthday, we in Memphis have a special commitment to his dream as he lost his life in our city at the Lorraine Motel, now the site of the National Civil Rights Museum.","date":"Sat Jan 15 14:01:50 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Republicans talk a lot about cutting taxes. Well, starting this year every single House and Senate Republican is HIKING your family’s taxes by up to $3,600 PER CHILD by refusing to extend the expanded Child Tax Credit.","date":"Fri Jan 14 21:20:15 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Trump deserves credit for signing the First Step Act, an important piece of criminal justice reform. But it’s unfortunate his own administration failed to implement it. I applaud the Biden Administration for getting the job done and providing relief for unduly harsh sentences.","date":"Fri Jan 14 19:30:40 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Thank you @FrankPallone,@RepDianaDeGette, @RepBobbyRush and @RepPaulTonko for recognizing the importance of this issue and committing to lower Memphians’ energy costs and hold the Tennessee Valley Authority accountable.","date":"Fri Jan 14 17:07:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I commend the leaders of @EnergyCommerce for questioning TVA about Memphians paying some of the highest energy costs in the country and TVA's apparent resistance to renewable energy. I've raised these issues many times and look forward to @TVAnews' reply.\nhttps://t.co/yWw7nJYtKw","date":"Fri Jan 14 17:07:29 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"People died for the right to vote. The Senate can change its rules for it.","date":"Fri Jan 14 14:36:03 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We delivered on the American Rescue Plan and historic infrastructure, but only the Democratic House passed the Build Back Better Act as well as the For the People Act, John Lewis Voting Rights Act, Women’s Health Protection Act, PRO Act and more.","date":"Thu Jan 13 21:20:01 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Senate Republicans are blocking these bills from even being debated, including the John Lewis Voting Rights Act and Freedom to Vote Act we passed today.\n\nSenate Democrats must reform the filibuster to allow for a vote. Our democracy is at stake.","date":"Thu Jan 13 21:20:01 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The American people elected Democratic majorities to reverse a cynical, years-long Trumpian agenda that put the wealthy and well-connected above working people and threatened our very democracy.","date":"Thu Jan 13 21:20:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"via @NYTimes Remember Trump : “Stand back and stand by” Proud Boys next? https://t.co/OdLkmkEZT7","date":"Thu Jan 13 18:47:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Half of the successful filibusters between 1917 and 1994 were civil rights legislation. The Jim Crow filibuster is still holding back voting rights today.","date":"Thu Jan 13 18:47:23 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"TN's proposed gerrymander is disappointing, but if enacted I’ll proudly represent Shelby and Tipton Counties, where I have many friends and supporters. I've known the Tipton County Executive for years and will reach out soon to discuss how I can address county needs &amp; priorities.","date":"Thu Jan 13 15:13:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"State legislatures are restricting the right to vote with simple majorities, while the Senate’s antiquated rules mean we need a supermajority to protect it. The filibuster can’t stand in the way of protecting voting rights.","date":"Wed Jan 12 19:59:47 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@maddow","date":"Wed Jan 12 19:56:39 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":".@LucianPera, fellow native and lifelong Memphian who has served in @ABA leadership, says Andre Mathis represents “the best of our bar and that he is exceptionally prepared to be among the best who have served on our bench.” Will make America proud!\nhttps://t.co/BU3sAcsjsY","date":"Wed Jan 12 18:12:08 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Fred Smith, the CEO of @FedEx, calls Andre Mathis a “credit to the profession of law” and urges the Senate to confirm him. FedEx makes Memphis proud and Andre Mathis will as well.\nhttps://t.co/9HNZEvkPq2","date":"Wed Jan 12 18:12:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The Memphis @AFLCIO recognized Andre Mathis’ record as a champion for labor rights and indigent criminal defendants. Andre Mathis will make Tennessee proud.\nhttps://t.co/Te2CLS4cUo","date":"Wed Jan 12 18:12:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"The @MemphisLawDean describes how he distinguished himself at the @UofMemphis and has led a career as a “stellar attorney and a demonstrated community servant,” dedicated to the Tennessee Innocence Project, mentorship and giving back to the community.\nhttps://t.co/0pzsUkJ5Ti","date":"Wed Jan 12 18:12:06 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Pleased to see more than 100 members of the @MemphisBar write in support of Andre Mathis’s nomination to succeed Judge Bernice Donald on the Sixth Circuit Court. Memphis Proud!\nhttps://t.co/Z8bbqRU6IU","date":"Wed Jan 12 18:12:05 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Growing up in South Memphis, Mathis didn’t have it easy, and the @NAACPMemphis recognizes the odds he overcame, the work he’s done with the Boys and Girls Club and the experience and qualifications he’ll bring to the 6th Circuit.\nhttps://t.co/SKOARw2epo","date":"Wed Jan 12 18:12:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"For integrity, professional competence, and judicial temperament the American Bar Association gave Andre Mathis a unanimous “Well Qualified” rating to serve on the 6th Circuit Court. https://t.co/N103LSJ0Zs","date":"Wed Jan 12 18:12:03 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":".@POTUS’s Circuit Court nominee and proud Memphian Andre Mathis would be the first black man to serve on the Sixth Circuit from Tennessee. I look forward to his confirmation to the bench, where he will continue to make Memphis proud and serve all Americans.","date":"Wed Jan 12 18:11:56 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Here’s what the gun lobby doesn’t want you to know: More Guns = More Murder.","date":"Wed Jan 12 14:28:12 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@LauraOkmin @kevinkugler @Mark_Sanchez @NFLonFOX I think I see some Berkowitz across those eyes","date":"Wed Jan 12 05:44:01 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I don’t think she’s high","date":"Wed Jan 12 05:20:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Two arrested in murder of Young Dolph  . Let justice prevail.#Memphis #youngdolph","date":"Tue Jan 11 23:28:15 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Environmental justice communities like those in Memphis have borne the brunt of pollution &amp; need justice. I commend the Biden @EPA for taking the first steps since Obama’s presidency to protect communities from toxic coal ash &amp; hold companies accountable.\nhttps://t.co/GlenILQH11","date":"Tue Jan 11 22:19:42 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"In the hometown of John Lewis, @POTUS makes clear that the Senate must protect the right to vote — and the filibuster can't stand in the way.\n \nAs John Lewis said: \"The vote is precious. It is almost sacred. It is the most powerful non-violent tool we have in a democracy.\"","date":"Tue Jan 11 21:39:07 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"All my career I've worked to end gerrymandering. As a lifelong Memphian, I believe my community will be best served by remaining in a compact, contiguous district that includes the entirety of the City of Memphis.\nhttps://t.co/AnMVXTtjmM","date":"Tue Jan 11 20:05:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Maya Angelou is the first black woman to appear on a US quarter. The coins started going out today. https://t.co/iqh65t2M8k","date":"Mon Jan 10 23:19:26 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"King coming home to America and welcomed by show biz royalty #ElvisPresley","date":"Sun Jan 09 17:30:20 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"As one of the greatest actors of his time, Sidney Poitier was the first black actor to win the best actor Oscar. Through his singular talent, barrier breaking roles and civil rights activism he helped reshape the world. https://t.co/bw9wGoQxgG","date":"Fri Jan 07 22:30:57 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It’s a year since the insurrection and no major bill to protect our democracy has become law. It’s past time for the Senate to act.","date":"Fri Jan 07 17:30:38 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"People who seek power by trying to overturn elections cannot be trusted to preserve, protect and defend the Constitution of the United States.\nMy bill #HR1405 to prevent those who engaged in insurrection from holding public office needs your support.\nhttps://t.co/aiBghNtYXZ","date":"Thu Jan 06 22:14:49 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"It’s important that we remember what really occurred on #January6th and how close our democracy was to collapsing. Below is my account of being in the Capitol during the insurrection. https://t.co/4hznspPGlY","date":"Thu Jan 06 20:41:30 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Around 2:20pm on #January6th, in the House gallery during the insurrection, I recognized who was responsible.      https://t.co/zDTJMh9Otg","date":"Thu Jan 06 19:07:00 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"When I spoke with @AliVelshi the night of #January6th, I suspected already what Stephanie Grisham just revealed. Trump was “gleefully” watching “all those people fighting for me” and refused to call off the attack.\nhttps://t.co/GNYn8eIMqJ https://t.co/3jS3Zli3F7","date":"Thu Jan 06 16:28:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Exiting the Capitol gallery January 6,2021. https://t.co/lc9gcWYxix","date":"Thu Jan 06 15:00:23 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"President Joe Biden at his best https://t.co/BuY1vZcn8U was necessary to address the constant lies of the DEFEATED FORMER https://t.co/kzYLlHomEW allow these lies to continue,without response,is to let an ongoing attack on our democracy live and grow.America is on trial!🇺🇸🇺🇸","date":"Thu Jan 06 14:50:04 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Capitol rioter compares attacks on her to treatment of Jews in Germany https://t.co/Y92ZIgqePl via @nbcnews/ Hope she uses her prison time to read about the Holocaust. May I suggest, Night, by Elise Wiesel and his internment by the Nazis","date":"Wed Jan 05 22:09:33 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Thumbs up #MerrickGarland !\nGarland gets it!! He has my full confidence and support!\n⚖️🇺🇸","date":"Wed Jan 05 20:06:45 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Extremists attacked our democracy at the Capitol with arms and are attacking our democracy in the states with voter suppression. The Senate must overcome the filibuster and protect our democracy.","date":"Wed Jan 05 16:42:20 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"We delivered on the American Rescue Plan and infrastructure. The Senate needs to follow through on Build Back Better.","date":"Tue Jan 04 14:31:59 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Trump isn’t hiding his vision for America. He fully supports a rightwing, pro-Putin authoritarian who is undoing Hungarian democracy and giving unqualified friends major government contracts. Remember 2017-2020.","date":"Mon Jan 03 17:51:46 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@HarleyRouda You have been a good Representative. Fair winds and following seas","date":"Mon Jan 03 16:51:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Twitter permanently suspends Marjorie Taylor Greene's personal account https://t.co/RuO290rJkl via @nbcnews// This child of Trump is a danger to democracy and the health of fellow Americans. When one has been elected and sworn an oath to the Constitution you have duty to protect.","date":"Sun Jan 02 17:42:08 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"I will be in Washington Thursday to commemorate/ memorialize the Trump attempted coup against our nation. He was behind the attack and attempted take over of our election and our Constitution! Never again ! Wake up AMERICA it was a wake up call. The burning of the Reichstag!🔥🔥","date":"Sun Jan 02 17:33:43 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"@GOPisComplicit Mistakes happen. Not sure how, why. Corrected. Happy New Year","date":"Sun Jan 02 01:12:28 +0000 2022","user_id":"162069635"},{"handle":"RepCohen","text":"Will Donald Trump Get Away With Inciting an Insurrection? https://t.co/V04J6fNxkg #MerrickGarland PLEASE ANNOUNCE INVESTIGATION OR APPOINT SPECIAL COUNSEL This is the most serious  attack on the USA since the Civil War!What would RFK do?Robert Katzmann?\n@tribelaw @TheJusticeDept","date":"Wed Dec 29 21:44:29 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"“I am a Christian man” but on Christmas I trash the President and First Lady with an obscene slogan as my children and others are listening for Santa sightings. \nA Christian man would say:”Peace on Earth and Goodwill to all.. “  but you’re Schmeckdrick","date":"Wed Dec 29 04:12:07 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"He and Franklin Haney, a Tennessean and great success story from poverty to riches, went to George Washington law school at night w Harry,and later Franklin helped with Harry’s political fundraising. Two determined men who succeeded greatly when no one could have foreseen it.","date":"Wed Dec 29 03:22:22 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ Senator Harry Reid was a legislative lion. He knew how to get legislation into law and he was a political pro who couldn’t be taken. He was also a kind and caring soul. Proud to have known this icon of Congress. https://t.co/6FhyTDzcnI","date":"Wed Dec 29 02:52:56 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"During the insurrection, it was already clear to me who was responsible and it’s clear that’s where the January 6 investigation is headed. https://t.co/zDTJMgSd4G","date":"Thu Dec 23 14:07:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Still true as it was January 6,2021!Trump was the leader of the insurrection.He said he’d walk with ‘em but didn’t because he knew chaos and violence was to occur and he didn’t want to get hurt.our bone spur commander in chief.","date":"Tue Dec 28 05:25:04 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Was fortunate to be invited on trip to South Africa with Kennedy family for anniversary of RFK’s ripples of hope speech. Was seated opposite these two legendary civil rights angels. Took this photo and knew it was a jewel for the ages.","date":"Sun Dec 26 20:53:10 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Two angels!\nDesmond Tutu r.i.p! https://t.co/n7R7zdqrMk","date":"Sun Dec 26 20:46:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@YeOldeScribbler Well Donne","date":"Sun Dec 26 04:57:10 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"On Christmas I reflect on Jesus, “what is a man profited, if he shall gain the whole world, and lose his own soul? “ And then I think of autocrats around the world and at home and their enablers.\nHope all are having a peaceful and thoughtful day.","date":"Sat Dec 25 19:46:53 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"During the insurrection, it was already clear to me who was responsible and it’s clear that’s where the January 6 investigation is headed. https://t.co/zDTJMgSd4G","date":"Thu Dec 23 14:07:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I’ve continually called on @TheJusticeDept to ensure prisoners released to home confinement are not reincarcerated. I’m pleased AG Garland made this decision, and I'll continue to push to commute these sentences for those convicted of victimless crimes.\nhttps://t.co/tjirLN4Va7","date":"Thu Dec 23 01:12:29 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"One of many reasons why it is critical we pass the Build Back Better Act. ↓\nhttps://t.co/mDRnqcxzBW","date":"Wed Dec 22 20:49:15 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Great holiday gift from @POTUS! Student loan pause extended until at least May 1, 2022!","date":"Wed Dec 22 17:46:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":".@POTUS signed my bill into law to remove the name of a segregationist and Klansman from Memphis’ federal building and name it solely in honor of Judge Odell Horton. It's time we fully recognize his impact and public service as TN's first Black federal judge since Reconstruction.","date":"Wed Dec 22 00:21:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@calebcalhoun glad you are following your passion. Enjoyed reading your piece. And it was jest as it was clearly UM Covid issue. Happy holidays from Memphis where we love our Tigers.Beat Purdue!","date":"Tue Dec 21 14:37:53 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Biden Boom. https://t.co/MxQvre7Dnr","date":"Mon Dec 20 23:28:41 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Even Goldman Sachs is estimating that failing to pass the Build Back Better would slow down our recovery. That’s no way to tackle inflation.","date":"Mon Dec 20 22:24:24 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Former Georgia Republican Sen. Johnny Isakson, a moderate known for his ability to work across the aisle, has died after a yearslong battle with Parkinson's disease. https://t.co/9VQskaCeA7 # via @HuffPostPol A GENUINELY NICE AND EASY TO WORK WITH SENATOR.WE WERE FRIENDS.","date":"Mon Dec 20 20:12:13 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Disappointed but not totally surprised by Manchin “No” on #BuildBackBetter . A real challenge for Joe to salvage parts of or reduced #BBB . Many,many Americans need the help as well as the Earth.","date":"Sun Dec 19 19:42:14 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@Mike_Cycles @ClayTravis Picture w Lucero was years ago and Mark and I are both boosted","date":"Sat Dec 18 21:16:50 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@westTNvol79 @briancrice Any of y’all or your kids get a lottery scholarship? You’re welcome.","date":"Sat Dec 18 21:14:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@briancrice That was a joke with some ribbing. Never imagined it would send so many into orbit. Clearly Covid . We all missed what would have been an intense and exciting game. It’s a shame. Look forward to game next year!","date":"Sat Dec 18 21:12:34 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@ClayTravis I wear my mask indoors and outdoors unless in a park.I took mask off for 10 seconds for photo but you’ll see the mask is in my hand.I’m double Vaxed &amp; boosted.I don’t shake hands but elbow.We all need to vax to boost and mask up as the omicron is very https://t.co/qcMwmnyxjB SAFE","date":"Sat Dec 18 19:53:19 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Disappointed. Very disappointed Memphis UT game cancelled #Covid . Here with Tiger freshman star Emoni Bates. #GoTigers https://t.co/vBsx7B40Hu","date":"Sat Dec 18 16:30:57 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We must boldly tackle climate change and a green energy future. For a start, end taxpayer-funded handouts to fossil fuel companies.","date":"Fri Dec 17 16:56:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Americans ration their prescriptions because of astronomical prices. Reducing prices has been shown to improve patients' health and adherence to treatment. In other words, our current health care system is HARMING patients. Lower drug costs and pass Build Back Better!","date":"Fri Dec 17 14:48:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Voting Rights OR Build Back Better?\n \nEnough delay. Enough false choices. The Senate needs to pass BOTH bills NOW!","date":"Thu Dec 16 21:11:01 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Today is the 50th anniversary of the Wild Free-Roaming Horses and Burros Act, intended to preserve these “living symbols of the historic and pioneer spirit of the West.” I’m proud to continue fighting for the protection and preservation of these iconic animals.","date":"Wed Dec 15 15:24:52 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"A group which makes Nixon the most admired.","date":"Wed Dec 15 01:16:10 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Scary","date":"Tue Dec 14 23:54:08 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Armageddon is approaching. It’ll be Trump or America!! I’M FOR AMERICA! I wish most Republicans were also.","date":"Tue Dec 14 22:18:26 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The texts to Mark Meadows from Trump’s family and supporters begging him to call off the attack on the Capitol and bemoaning the failed coup are damning evidence. They knew who was behind it. It was Trump’s last effort to hold onto power.","date":"Tue Dec 14 21:01:02 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"If the Senate could agree on a one-time majority vote for the debt limit, they must agree to a majority vote on saving our democracy and passing voting rights.","date":"Tue Dec 14 14:32:41 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"“Memory has become a sacred duty of all people of goodwill” President Obama quoting Eli Wiesel.Wiesel’s testaments to the horrors of the Holocaust flowed from that mantra, “Never Forget.”-","date":"Tue Dec 14 01:32:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ Every individual from individual one down needs to testify before committee and/or go to jail for contempt and more if guilty of trying to overthrow the Constitution!🇺🇸🇺🇸🇺🇸 https://t.co/Ry8dkTk6G9","date":"Tue Dec 14 01:06:19 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ many of my contemporaries and seniors died because Trump refused to put health of Americans above his political life. He was in a self imposed stupor as the virus raged. It will be over by Easter, magically disappear,be cured by light! https://t.co/ajSEvdWQn8","date":"Tue Dec 14 00:42:33 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"“The darkness on the edge of town has spread to the main roads &amp; highways &amp; neighborhoods...It must be acknowledged &amp; answered for.\"\n\nI’ve been &amp; continue to be concerned about this. @BWilliams hits the nail on the head. I’ll miss his commentary on @MSNBC.\nhttps://t.co/vaGDG0Wcee","date":"Tue Dec 14 00:30:19 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Certain Members of Congress are protecting oligarchs’ riches rather than democracy. Maybe it's Republicans who are very close to Trump who is very close to Putin and his oligarchs.","date":"Mon Dec 13 22:32:49 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"All but one of my counter-corruption provisions were booted from the final version of the NDAA after we passed them in the House.\n\nKleptocracy is a threat to democracy and good government all over the world. Defending democracy should be part of any defense bill.","date":"Mon Dec 13 22:32:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/itnxkGYSJz","date":"Sun Dec 12 23:04:51 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Oops. Zach","date":"Sun Dec 12 00:59:46 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Marc Gasol and me prevGrizzlies game before retirement of Zack Randolph(Z-Bo) #50 jersey. Marc is the tall one. LOL https://t.co/oHLvkAGjFu","date":"Sun Dec 12 00:50:55 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"With Jody Stephens(Big Star)and Ben Nichols of Lucero.These are great Memphis musicians recording at  fabled Ardent Studios Memphis https://t.co/P7eji70ZNF","date":"Sat Dec 11 22:59:28 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Wouldn’t it be nice to take a train from Memphis to Nashville? I encouraged @Amtrak’s president to open the route and leverage the new infrastructure law, which @POTUS signed with my bill to expand intercity passenger rail.\nhttps://t.co/RHrzO3Fhxk","date":"Fri Dec 10 22:33:49 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We give tons of tax breaks to billionaires without requiring them to work.","date":"Fri Dec 10 20:09:33 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"194 Republicans voted for a defense bill that would spend nearly $8 trillion on the military over the next 10 years.\n \nBut the $1.7 trillion Build Back Better Act is “too much” or even “socialism.”","date":"Fri Dec 10 18:44:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"SCOTUS is allowing abortion providers to proceed with a lawsuit against the Texas abortion ban, but left the law in place. Every day #SB8 is in effect, Texans are forced to escape to other states or give birth against their will. We must pass the Women’s Health Protection Act.","date":"Fri Dec 10 17:27:32 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump and his cronies working to disrupt the election, overthrow our government and hang Mike Pence MUST be investigated and is the most serious crime committed against the United States in our lifetimes, but Republicans are SILENT! https://t.co/wMiAxV8myj","date":"Fri Dec 10 16:45:23 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Senate passed my bill today to rename the Memphis Federal Building solely after Odell Horton, Tennessee's first Black federal judge since Reconstruction, and to remove the name of a Klansman and segregationist. Now it's on to President Biden's desk to be signed into law.","date":"Fri Dec 10 02:25:54 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump used pardons to take care of people he didn’t want to testify against him. The bill I worked on with @RepAdamSchiff will inhibit the next Trump and root out corruption. Proud the #ProtectingOurDemocracy Act passed the House with language I wrote to stop pardon power abuse. https://t.co/H12uW7GLqj","date":"Thu Dec 09 22:18:28 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":".@POTUS’s vaccination program is also an economic plan, but Republicans are fighting every commonsense effort to beat this pandemic, get people to work and boost our economy. https://t.co/YPmigaKiRt","date":"Thu Dec 09 19:07:59 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Reagan kicked off his 1980 campaign in Philadelphia, MS where 3 civil rights workers were murdered in 1964. He signaled with open arms to any racists who hadn't already joined the Republican Party. His campaign theme was “Make America Great Again,” one of many things Trump stole. https://t.co/YKL4YsI4iQ","date":"Thu Dec 09 17:09:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"LIVE: Ahead of sky-high holiday travel prices, we’re reintroducing the Fair Fees Act to stop airlines from charging exorbitant fees for bags, seating, changes and other services. \nhttps://t.co/giQz8PKAdb","date":"Thu Dec 09 15:40:37 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I am appalled by my Republican colleagues, who try to score cheap political points on violent crime. Real people in my community and across the country are suffering, and Democrats are advancing genuine solutions to invest in and improve public safety. https://t.co/ydgnH5VGFB","date":"Wed Dec 08 22:55:38 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"If you don’t know about Minnie Minoso, check out this story of how we met when I was a young boy with polio. \n \nHe's been my hero all my life. He would have been in the @BaseballHall long ago if not for segregation. Elated he'll finally be a Hall of Famer!!! #Chicago #WhiteSox https://t.co/jB1BdqoO9Y","date":"Wed Dec 08 16:38:39 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I’ll try to express my feelings and stories of the great Minoso on the House floor soon after 10 this morning in my allotted one minute. I am happy beyond expression. ⚾️😂 https://t.co/6ReKXpapNw","date":"Wed Dec 08 12:39:49 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":".@VP Harris hosted the first-ever Maternal Health Day of Action at the @WhiteHouse. I'm proud to be working with the @BMHCaucus to pass historic investments in saving mom's lives and advancing maternal health equity through the Build Back Better Act.","date":"Tue Dec 07 19:31:46 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@EHollyNorman Dumbest","date":"Mon Dec 06 22:27:11 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I’m watching news about Oxford, Michigan school murders and I AM TIRED OF REPUBLICANS’ “THOUGHTS AND PRAYERS” we need common sense gun reform.#GunControlNow #GOPDeathCult","date":"Mon Dec 06 21:47:14 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@baseballhall Yes it should have been earlier but today is a day ofcelebration  for Minnie, his widow, his son Charlie, other family and the fans!!  He is in the @baseballhall of fame FOREVER! The Cuban Comet is enshrined with the other stars.  \nMinnie has been part of my life since I was 5!!!","date":"Mon Dec 06 02:35:49 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Minnie was chosen today to be in the @baseballhall of fame!\nHip hip hooray! I’m happier than if Nancy appointed me to something nice!! Minnie!!!!","date":"Mon Dec 06 02:17:59 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Just because he quit before the Coup went into next gear NEVER FORGET THESE LIES AND  TRUMP PROPAGANDA re:mail voting.Barr was an insult to the “Justice” dept starting with interfering with Mueller (false report rollout)and refusal to allow public or  Congress to view unredacted.","date":"Sun Dec 05 21:08:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ Minnie Minoso has a last chance for the baseball hall of fame this week. Fingers crossed for my hero, the Cuban Comet, who is the Jackie Robinson of Black Latino ball players! https://t.co/wmuNjstHNC","date":"Sun Dec 05 19:56:59 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Fantastic musical documentary! A hidden jewel uncovered recently which is the urban Woodstock. Unfortunately only available now on Hulu but you can get a free 30 days Hulu trial. Watch this show love the music love the people love the spirit.From #Memphis :Mavis Staples &amp; BB King","date":"Sat Dec 04 20:31:04 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I mourn the loss of the Supreme Court.\n\nIn Bush v. Gore, 5 Justice chose the president of their party.\n\nIn Shelby County v. Holder, the Court gutted the Voting Rights Act.\n\nIn Citizens United, it sold elections to the rich.\n\nNow it will likely take away a women's right to choose. https://t.co/5YuCVsPVur","date":"Fri Dec 03 21:41:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The unemployment rate has fallen to 4.2%, which experts didn’t expect we’d reach until 2024!\n \nThanks, Joe! #BuildBackBetter https://t.co/IiS7SkBDRK","date":"Fri Dec 03 18:05:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The United States cannot leave women today with fewer rights than their mothers and grandmothers.","date":"Fri Dec 03 15:46:07 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Republicans are pushing for a simple majority vote to derail vaccination efforts but refuse to allow a simple majority to protect voting rights, raise the minimum wage, pass police reform, codify Roe or strengthen labor rights.","date":"Thu Dec 02 22:35:20 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Republican politicians are trying to ban abortions, control women’s decisions and criminalize doctors who care for patients. Everyone should have the freedom to make their own decisions with the people they love and respect.","date":"Thu Dec 02 15:09:11 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Supreme Court has diminished respect after todays pitiful show. Not since Bush v Gore 5-4 decision to give the presidency to the 5’s party standard bearer has the court been so political.And 6 judges were devoid of any understanding of life’s real challenges for women.Shame!!","date":"Thu Dec 02 04:19:51 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Two of the last times Mississippi asked for an issue to be left up to the states were slavery and segregation. Mississippi was wrong then and it’s wrong today. We must protect women’s right to choose. https://t.co/VktqI6CCZT","date":"Wed Dec 01 19:02:20 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Mississippi is asking the Supreme Court to take away your constitutional right to have an abortion, and the Court is considering the case to overturn Roe v. Wade today. If overturned, half the states are poised to ban abortion. #AbortionIsEssential","date":"Wed Dec 01 15:44:52 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Decades later, the filibuster is still being used to deny Black people the right to vote and perpetrate the new Jim Crow. https://t.co/sz78vJaQ3W","date":"Wed Dec 01 00:21:31 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"For middle class families, the Build Back Better Act will produce more jobs, reduce taxes and lower the costs of prescription drugs, home health care, and child care, allowing more workers an opportunity to participate in America’s economy. https://t.co/vNb7rfYx9X","date":"Tue Nov 30 23:05:39 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"There’s nothing partisan about getting goods to market and speeding up the supply chain. That’s what happens when you build good roads, faster trains, better ports and allow hardworking families to get to work. https://t.co/PKEolxE8yU","date":"Tue Nov 30 21:41:55 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"In Year 1 of Trump’s pandemic, even health workers were scrambling for masks. Stores were wiped clean of toilet paper and other household staples.","date":"Tue Nov 30 18:19:08 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Twitter trends: Corey Seager has Dodger fans wailing as he signs w Texas.Worse was Scherzer to Mets.Tiger Woods to selectively play.Sad but Payne Stewart was truly tragic. Lara Logan auditioning for Looney Toons but no one at Fox pulled the plug. Compared Fauci to Mengele.Ugh.","date":"Tue Nov 30 02:28:08 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@GarnerChandler Too much sun and fried food","date":"Tue Nov 30 02:12:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/H4btqj9X37","date":"Mon Nov 29 22:06:26 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"“Ain’t no one goin’ to turn me ‘round”","date":"Mon Nov 29 03:07:18 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Ballad Of El Goodo https://t.co/HCM2QfYZiI is the final song on @netflix 3rd season of Sex Education. Alex Chilton ⁦@BigStarBand⁩ ⁦@Jody_BigStar⁩ .\nPower pop legendary band, Big Star from Memphis.","date":"Mon Nov 29 02:58:13 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@LibmanDot @RepJoeWilson I was on fire with indignation, criticism, and condemnation every time Trump genuflected to Putin and showed who he was serving.","date":"Thu Nov 25 12:00:49 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Thankful I have the privilege to serve in Congress and represent Tn9 aka Memphis!\nHappy Thanksgiving to all!","date":"Thu Nov 25 11:57:56 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Memphis African-American neighborhoods featured in ⁦@nytimes⁩ 2nd time in 4 days. Ambitious plan to develop Orange- Mound tower into multi use center.Preservation and use of Clayborn Temple.Good things are happening here! https://t.co/VNqiaJNfGW","date":"Wed Nov 24 21:42:06 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Be thankful that sanity has returned to America — for now \nHAPPY THANKSGIVING AMERICA! Now the Turkey is on the table and not playing “president “ https://t.co/0MZuzHXyRk","date":"Wed Nov 24 18:30:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"A congressional proposal reveals the Kremlin’s Achilles’ heel// As Helsinki co- chair and civil rights and rule of law advocate it was a Must Do. Putin is a threat to Russia and the world! https://t.co/DaugQ78yrn","date":"Wed Nov 24 18:24:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"America embarrassed and disgraced. The only person to blame is Trump.\nhttps://t.co/Ga7mHlRjdf","date":"Wed Nov 24 17:04:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Here are just a few other names for the Build Back Better Act:\n \nPreschool for All Act\nInsulin Price Cap Act\nHearing for All Seniors Act\nDrug Price Reduction Act\nMedicaid Expansion Act\nChild Tax Credit Act\nLong Term Care Act\nClean Energy Act\nKeep American Jobs at Home Act","date":"Tue Nov 23 20:41:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Just a week before Thanksgiving, 148,000 children in my district received Child Tax Credit payments totaling more than $38 million. We're putting money back in hardworking families' pockets and helping to offset rising costs. The #BuildBackBetterAct will extend expanded CTC!","date":"Tue Nov 23 19:36:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to be joined by co-signers @RepAOC, @RepRashida, @NormaJTorres, @RepBonamici, @RepGraceMeng, @RepBarragan, @RepAndreCarson, @RepJudyChu, @RepBonnie, @RepDannyDavis, @RepRaulGrijalva, @RepHankJohnson, @Ilhan, @RepPressley, @RepSchakowsky, @RepMarkTakano and @NydiaVelazquez.","date":"Tue Nov 23 18:33:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We must remove profit-based incentives from our criminal justice system. I’m urging @POTUS to enforce his executive order to eliminate private prisons, joined by 17 others members. https://t.co/hz0wXwnPfM","date":"Tue Nov 23 18:33:47 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We must protect people from being re-incarcerated after they’ve moved to home confinement and successfully reintegrated into their communities. @POTUS has the authority and should start allowing all those released to home confinement under the CARES Act to apply for commutations. https://t.co/2h5p8o9qh2","date":"Tue Nov 23 00:48:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@GrittyCitySndr @RepAnnaEshoo @RepRaskin @RepMcGovern Whatever they’re keeping secret should not be kept from the American people. I never thought there was a second shooter  though the House committee on assassinations did.I don’t think Oswald was a Patsy but what occurred on his Mexico visits?Negligence by govt. agencies?","date":"Mon Nov 22 22:37:08 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The TVA should not haul tons of toxic coal ash through overburdened South Memphis neighborhoods to dump it at the Whitehaven landfill. We deserve some answers and accountability. https://t.co/xWK0T8kDbo","date":"Mon Nov 22 21:40:27 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"58 years after the assassination of JFK, we still don’t have all the facts about what happened. People have the right to know and it’s past time we have transparency. I’ve asked President Biden to expedite the release of all the records. https://t.co/UQ3xtwtaK8","date":"Mon Nov 22 20:41:49 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I took this photo of President John F. Kennedy in Memphis September,1960. Gov. Buford Ellington to his right.\nNovember 22,the day the music died.😢 https://t.co/vOucLf33wn","date":"Mon Nov 22 16:19:18 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I took the above picture in September,1960 Memphis(Cooper and Union Ave.A small,cheap Kodak camera.","date":"Mon Nov 22 15:32:49 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"November 22,1963 sorrow and mourning fell over America. A deed most foul happened in the open daylight in Dallas.\nWe still don’t have all of the facts as the administration (Pres.Biden)has not released records as required by law.I have urge full release.59years is too long! https://t.co/S6DGSCC0Zy","date":"Mon Nov 22 15:30:14 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@nytimes story points out tough economic times for Orange Mound.Been a part of my political district and I’ve helped with funding for Tylers( Glover) cafe and Orange Mound community center honoring James Bolton. Several approps in this years bill if Senate joins in passage.","date":"Sun Nov 21 20:49:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Orange Mound,Tennessee in ⁦@nytimes⁩ today. Home to Melrose high and sports stars:Larry Finch, Ronnie Robinson,William Bedford,Bingo Smith, Michael Wilson,Jerome Woods,Cedrick Wilson,Tony Pollard,Rochelle Stevens) journo Ralph Wiley,actor Larry Riley.Churches, food,pride! https://t.co/TMD4WnlFuS","date":"Sun Nov 21 20:05:11 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"From the beginning I knew Trump was a grifter and a con unworthy of Presidency and respect.","date":"Sun Nov 21 18:20:32 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Build Back Better means:\n✅Free universal pre-k\n✅Medicaid expansion\n✅Lower prescription costs\n✅Middle class tax cuts\n✅Family leave\n✅Child care\n✅Health care\n✅Climate action\n✅Housing\n✅Immigration\n✅Home-based care for seniors and disabled people\nAnd so much more.","date":"Sat Nov 20 17:44:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We passed #BuildBackBetter in the House! The greatest investment in everyday people since the New Deal and Great Society, fully paid for by making large corporations and the wealthiest individuals pay their fair share. Bright day in America!","date":"Fri Nov 19 16:55:27 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Being the Representative from Memphis, I proudly voted for the future, for fairness, for justice, for turning America around, for finally passing a bill for the regular people in America and putting America on a new track!!!! https://t.co/1dVFcfRo1b","date":"Fri Nov 19 15:13:06 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I’m up and at’em to vote for a bill that will put America in a better place. Finally one for justice,fairness, and the future!#BuildBackBetterAct","date":"Fri Nov 19 13:58:34 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Who brought Gig Young back to life and left him off in Congress?","date":"Fri Nov 19 05:53:42 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Where is the man with the butterfly net?","date":"Fri Nov 19 05:08:06 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Seeing the sausage made isn’t always pretty, but the House is on the verge of passing one of the most historic bills since FDR’s New Deal or LBJ’s Great Society, and it’s my understanding the Senate will bring #BuildBackBetter across the finish line. #DemocratsDeliver","date":"Fri Nov 19 00:58:37 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"If Putin remains in power beyond May 2024, the US should refuse to recognize him as president of Russia. We should not recognize an autocrat violating term limits, rigging elections and abusing human rights.\nhttps://t.co/DzwoC7lIII","date":"Thu Nov 18 22:15:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The #BuildBackBetter Act will lower the cost of prescription drugs and cap the price of insulin.","date":"Thu Nov 18 14:44:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Young Dolph leaves a big hole in many peoples hearts and in the Memphis music scene were he was”King of Memphis.” Condolences to the fans and family.\nGun violence/ deaths are an epidemic on a pandemic.  \nThis must stop. I’ll do all I can to help","date":"Thu Nov 18 01:26:39 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Contrary to Republican propaganda, leading economists say the Build Back Better Act will not add to inflationary pressure and will even lower it. We need to make it easier for people to get to work and get goods to market. https://t.co/kelBcsLmHO","date":"Thu Nov 18 00:11:47 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Constitution guarantees the right to be judged by a jury of peers, yet the US allows judges to sentence people based on conduct they were found not guilty of by a jury. I'm working to end this unfair practice and am proud my bipartisan bill passed @HouseJudiciary today. https://t.co/mPAYMGRX2w","date":"Wed Nov 17 23:19:19 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Every 3- and 4-year old will have free, universal Pre-K from the #BuildBackBetter Act.","date":"Wed Nov 17 17:15:41 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Forcing sexual harassment survivors into the arbitration process stacks the deck against them. The Harvey Weinsteins of the world depend on forced arbitration clauses buried in employment contracts to abuse people with impunity. https://t.co/kRrPApo6lB","date":"Wed Nov 17 16:21:32 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":".@POTUS signed several of my bills into law as part of the bipartisan infrastructure bill. Proud to have helped play a role in the largest infrastructure deal in a generation. History being made!\nhttps://t.co/RLwSwgrGxE","date":"Wed Nov 17 14:10:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump campaigned on using the art of the deal to fix our infrastructure, but he could never get it done. In less than a year, Biden signed the largest infrastructure deal in a generation into law with bipartisan support. That's not talk. It's results! #DemocratsDeliver","date":"Tue Nov 16 22:25:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ well done and full page story on Minnie Minoso and his meritorious candidacy for the ⁦@baseballhall⁩ by ⁦@TylerKepner⁩  https://t.co/wmuNjstHNC","date":"Tue Nov 16 21:46:15 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Giving President Joe Biden congratulations on a great victory for the country, the most important infrastructure bill since Eisenhower and the interstate highway system. https://t.co/g9ND742ttB","date":"Tue Nov 16 18:22:30 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@ScottCrammond1 @bengela_andrew He probably liked it because he’s my friend and I’m in the picture. Tim is a good guy And a good friend.","date":"Tue Nov 16 15:27:52 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@TylerKepner Great column. Captures Minnie and advance the cause. Thanks","date":"Tue Nov 16 04:46:55 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Memphis is ready to get America moving again!","date":"Mon Nov 15 23:47:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Great day at the White House. Proud to be there supporting America and TN-09. https://t.co/v3Gr6TLr9N","date":"Mon Nov 15 22:34:04 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Today is a day to celebrate. Americans were promised infrastructure investments for years. Thanks to the leadership of President Biden and my colleagues in Congress, America is on the move again with historic investments in roads, bridges, broadband, and more. https://t.co/sF0opPnXZe","date":"Mon Nov 15 21:58:33 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Signed, sealed,delivered!🇺🇸🇺🇸🇺🇸🇺🇸 https://t.co/YK5TBWklgB","date":"Mon Nov 15 21:22:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/eI4mNdZsIs","date":"Mon Nov 15 20:37:42 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"First time at White House since O. Looks great as all stains from the pretender-in-chief have been scrubbed clean! https://t.co/qEBXcSvhBT","date":"Mon Nov 15 20:22:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Today I’ll attend #PresidentBiden signing of infrastructure bill. Important for #Memphis,a transportation center w Fedex,5 railroads,5th largest inland port,2 interstate hiways,Amtrak, &amp; transit!\nFirst time I’ve gone to White House since Obama.","date":"Mon Nov 15 13:02:22 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The founding fathers, and anyone who believes in America and our Constitution,would be aghast at such a statement from anyone,let alone a person who served and took an oath to support the Constitution.😱😱","date":"Sun Nov 14 15:25:57 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"To all those who have served in uniform—thank you for your courage, service and sacrifice. This year, we pay special tribute to those who served in Afghanistan and welcome them home as we continue working to ensure #veterans receive the benefits they deserve.","date":"Thu Nov 11 13:57:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"In 9 months, Democrats have delivered a once-in-a-generation infrastructure deal, the American Rescue Plan and 5.6 million new jobs.\n \nRepublicans only managed to cut taxes for the rich while squabbling about a wall and trying to repeal people’s health care.","date":"Tue Nov 09 20:01:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We delivered a once-in-a-generation infrastructure bill and are taking crucial steps forwards to #BuildBackBetter for the people. #DemocratsDeliver https://t.co/Izoqg11NCY","date":"Tue Nov 09 18:05:19 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Joe Biden has done two things Donald Trump couldn’t. Get the most Votes in an election and pass an infrastructure bill! 🇺🇸🇺🇸👍","date":"Sat Nov 06 21:30:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@talltalestogo Voted aye and co sponsor along w entire Tn delegation","date":"Sat Nov 06 21:13:33 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"And my chair of transportation @RepPeterDeFazio saw our house bill ,which he fashioned, sublimated to the Senate bill,and yet he understands, as I, that you don’t make the perfect the enemy of the good!","date":"Sat Nov 06 16:48:08 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"#BuildBackBetter will lower the cost of health care, childcare, education and housing and cut middle class taxes—fully paid for by making corporations and the wealthiest individuals pay their fair share. The day we pass it will be a bright day in America","date":"Sat Nov 06 04:37:04 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We just passed a once-in-a-generation infrastructure bill to bring our country into the future and create 2 million jobs every year on average over the next decade. I’m proud to have authored several included bills that will make our roads safer and more accessible.","date":"Sat Nov 06 03:31:29 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Since President Biden took office, we’ve added 5.6 million jobs to the economy! This moment is an opportunity to invest in growth and make sure all of us – not just those at the top – are dealt in to share the benefits of a growing economy. #BuildBackBetter","date":"Fri Nov 05 19:44:37 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"A great American and man of the world. RIP https://t.co/pimKS4jtXa","date":"Fri Nov 05 17:41:30 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I’m in too. Pass both infrastructure bills and deliver the change that people need!","date":"Fri Nov 05 15:50:03 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to say the House passed my bill today to remove the name of a Klansman and segregationist, Cliff Davis, from the Memphis Federal Building and fully rename it after Odell Horton, a great jurist and the first Black federal judge in Tennessee since Reconstruction. https://t.co/7dzSQYepRa","date":"Thu Nov 04 21:16:28 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Build Back Better is not everything we asked for but it’s a great plan and fully paid for. It will lift millions of children out of poverty, expand home care, provide universal paid family leave, and make unbelievable investments in the future of our planet. Bring it home!! https://t.co/3aRJgRw4QM","date":"Thu Nov 04 19:59:02 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The fabulous Ja Morant doing a 360 so so clean!🏀🏀🏀 #MEMPHIS","date":"Thu Nov 04 17:14:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@Cspan live. 8-9 EST this morning. The call ins keep it real","date":"Thu Nov 04 11:52:50 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The House has been working to improve the Build Back Better framework and include negotiated prescription drug prices, paid family leave and immigration reform. I’ll vote for both infrastructure bills! https://t.co/HfjcfNFWTU","date":"Wed Nov 03 20:48:10 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I won’t let J&amp;J, a half trillion dollar company, get away with declaring bankruptcy to escape liability for knowingly selling asbestos-filled baby powder targeted at women of color. J&amp;J and other large corporations must be held accountable for the damages they inflict. https://t.co/VjhaKikn9z","date":"Wed Nov 03 17:38:46 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@GrittyCitySndr Combination of 2 senators per state giving small , more conservative states wildly disproportionate power and then the filibuster.","date":"Mon Nov 01 22:06:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"In case anyone forgot, the #BuildBackBetter Act will establish universal Pre-K, cut middle class taxes, lower healthcare costs, invest in green energy and pay for this and more by making the wealthiest pay more and corporations bring jobs back home. It's nearing the finish line!","date":"Mon Nov 01 21:52:41 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"America cannot miss this opportunity to deliver on our green energy ambitions and lead the world into the future. Save the planet for the next generation!\nhttps://t.co/B8sde7DxAg","date":"Mon Nov 01 20:37:18 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Senate was designed to slow down legislation. The 17th amendment( popular election)was suppose to make Senate more responsive to people. So what happened?","date":"Mon Nov 01 19:03:51 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Russel Honore!","date":"Sat Oct 30 21:01:32 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Otto von Bismarck called politics the “art of the possible.” That's what the Build Back Better Act will be. It'll be good for America, create jobs and help middle class Americans who haven’t been helped in the past and who were left out of Trump’s tax cuts for the wealthy. https://t.co/Dkrs6yc5SC","date":"Wed Oct 27 20:36:56 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We’ve had enough thoughts and prayers. We need to save lives and pass gun violence prevention laws. #ExtremeRiskLawsSaveLives https://t.co/9K65qpk5nc","date":"Wed Oct 27 18:22:01 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"May the memory of those taken from us be a blessing and may their families be comforted. #TreeOfLife","date":"Wed Oct 27 16:34:24 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Three years ago, a gunman carried out the deadliest antisemitic massacre in American history at the #TreeOfLife synagogue in Pittsburgh. Pundits and politicians continue to peddle the same conspiracies that incited that attack and others from El Paso to Charlottesville.","date":"Wed Oct 27 16:34:23 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@elliotboyette @atrupar I am a fervent defender of dogs and cats and horses and against animal abuse.Have long history of opposing research on our four leggeds \nThis issue has unfortunately been used to attack Dr. Fauci, for whom I have the greatest regard. \nI regret how the right has used the beagles.","date":"Wed Oct 27 15:36:33 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"My amendment to strengthen the Family Violence Prevention and Services Improvement Act passed the House today. I was proud to vote for a bill that modernizes and invests in programs to prevent domestic violence and #SupportSurvivors.\nhttps://t.co/fsWqTEx5Dq","date":"Tue Oct 26 22:31:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Lack of Medicaid expansion could DOOM THE BUILD BACK BETTER BILL. If you can’t get medical services people will get sick and DIE.What good are the other parts of the  bill if you’re unhealthy or DEAD?@JoeBiden","date":"Tue Oct 26 03:24:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Outrageous to abandon millions of people without coverage just because the federal gov’t is already paying nearly all of WV's costs and Manchin refuses to share that with states being held hostage by right-wing legislatures. Spoke up to leadership about need to expand Medicaid!!","date":"Tue Oct 26 00:45:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I came down with polio before the vaccine was available to all kids. I had to relearn to walk and spent a year on crutches and have, like some, continued to suffer from post-polio syndrome. But thanks to the @gatesfoundation and @Rotary, we've almost entirely eradicated polio. https://t.co/6PKC5ufn5r","date":"Mon Oct 25 23:02:22 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"CORRECTION: My bill to enforce the 14th amendment by removing and barring from office those who engage in insurrection is #HR1405.\nhttps://t.co/9qE9yoA8xv","date":"Mon Oct 25 21:26:32 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Supreme Court is reportedly considering hearing a case that could overturn protections for the US press from foreign defamation suits, which I worked to enshrine in the law. I am watching this Court closely.\nhttps://t.co/JoqQZfWcgE","date":"Mon Oct 25 21:16:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I saw in the @NYTimes that Barack Obama signed the SPEECH Act into law. The photographer who took this picture and I were the only witnesses because I was the guy who wrote it. https://t.co/64Pfre0my0","date":"Mon Oct 25 21:16:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Any Member of Congress who participated in planning the #January6th insurrection should be subject to removal pursuant to the 14th Amendment, which my bill (#HR1504) would help enforce.","date":"Mon Oct 25 20:47:42 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"My relationship with Minnie Minoso and why he belongs in the Baseball Hall of Fame. Published yesterday in the Chicago Tribune.\nhttps://t.co/VrklXoJWz3","date":"Sat Oct 23 17:57:49 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Jared Kushner in talks with Saudi Arabia to receive $2bn for investment firm: Report https://t.co/lCJxGwYJZu res ipsa loquitor","date":"Sat Oct 23 03:55:37 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Baseball is more than hits, runs and stolen bases. Minnie Minoso was an exceptional ball player who overcame tremendous barriers in segregated America and inspired my career as a civil rights advocate. His actions on &amp; off the field deserve to be memorialized in the Hall of Fame.","date":"Fri Oct 22 21:39:17 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"My Republican colleagues seem to think 2020 was a free and fair election when it came to electing themselves, but somehow for the President it was all fraud and insurrection. HORSE MANURE!! https://t.co/Cb3yU5SZCz","date":"Thu Oct 21 19:04:40 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Bannon plotted to overthrow the government and was pardoned by Trump for ripping off his supporters, but Trump didn’t care that he ripped off Trump people for a Trump wall. He pardoned him! The whole thing is a con game and we need to end it before democracy goes out the window!","date":"Thu Oct 21 19:04:40 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"'He's no longer a sitting president': Merrick Garland gets grilled about why he's not prosecuting Trump https://t.co/NXaipfXd4f","date":"Thu Oct 21 18:07:10 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@TimFarber1 What is your actual account?","date":"Thu Oct 21 18:05:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to also be joined in this effort to protect Tennessee's children by @RepCori, @RepTedLieu, @RepMondaire, @RepCicilline, @RepRaskin, @RepKarenBass, @RepHankJohnson and @RepLucyMcBath.","date":"Thu Oct 21 17:50:44 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Hundreds of children have been arbitrarily arrested and imprisoned in Rutherford County. @RepValDemings and I are calling on AG Garland to investigate.","date":"Thu Oct 21 17:50:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump is equally if not more guilty than Michael Cohen, but Cohen spent time in prison for paying hush money on Trump’s behalf while Trump was never even indicted. He is no longer a sitting president. If the rule of law applies equally to everyone, should Trump not be indicted? https://t.co/3OhY4cGQJw","date":"Thu Oct 21 16:58:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"By voting.16 times for Congress(!primaries and generals). And no one closer than losing 2-1. Thank you Tn 9!","date":"Thu Oct 21 15:33:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@LeighWest680 Have a blessed day","date":"Thu Oct 21 15:20:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"You never know who you’ll see on Capitol Hill. @ParisHilton here to lobby on behalf of teens in congregate care settings, a bill which I will look into. Thanks for the advocacy! https://t.co/Io4NzmMRAo","date":"Thu Oct 21 15:03:49 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Fifteenth Amendment granting freed slaves the right to vote was approved along party lines and blasted by the minority party as a partisan power grab. Today's Senate Republicans should get on the right side of history and stop blocking historic voting rights legislation.","date":"Thu Oct 21 14:02:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Just learned of the passing of Bishop W.A. Sesley, of Morning Star church in Memphis. A golden throated warrior of the gospel and pastor whose grace extended beyond his church family. A life well lived in service to others.","date":"Thu Oct 21 02:01:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"SEVENTEEN Senate Republicans voted for the bipartisan infrastructure bill, and I call on my Republican House colleagues to support it too. It creates jobs and is the right thing for America. It should be bipartisan! https://t.co/iJMgckZHrJ","date":"Wed Oct 20 23:07:46 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Hailed by many as the most significant civil rights law since the 1964 Civil Rights Act, the #ADA has improved millions of lives by explicitly prohibiting discrimination on the basis of disability. For barriers that remain, we must continue to work towards the law's full promise. https://t.co/cSINGZ0Ztz","date":"Wed Oct 20 22:14:42 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Government paying $300 per child every month to the vast majority of American families is smart policy and allows families to go to work by putting their children in child care and investing in their family’s needs. https://t.co/o0e8Chm6LB","date":"Wed Oct 20 20:06:53 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Senate will try to open debate tomorrow on the #FreedomToVoteAct to ensure ballot access, prohibit gerrymandering, protect election integrity and end big money in politics. Manchin supports it, so if the GOP filibusters, we must urge him to end the filibuster for democracy.","date":"Tue Oct 19 18:21:09 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump Sues to Block Release of White House Papers to Jan. 6 Inquiry https://t.co/KeW0X0KmSW. If Executive privilege not permitted prez would be fearful their actions would be known. Well if you’re trying to overthrow the government that fear might stop you from trying to.DUH!!","date":"Tue Oct 19 13:30:57 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@RepDavidEPrice @RepDavidEPrice Has been a valuable member of Congress and a good friend to me. He has knowledge and experience that has made him most effective. His service was important for the country and North Carolina. He will be greatly missed","date":"Mon Oct 18 18:49:20 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"It is","date":"Mon Oct 18 02:53:40 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The State of West Virginia should not be holding back the rest of the world. We need to pass the Earth onto the next generation in a better condition than we received it and we’re not doing a very good job at that. https://t.co/0W5tqKTkpB","date":"Sun Oct 17 20:39:17 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"⁩ feature story about insurrectionists (calm, everyday folks)being USED by the diabolical,power hungry DENIER/LIAR-CHIEF and his lackeys for their reinstatement at the expense of the country. Oratory intended to incite. ⁦@TheJusticeDept⁩ INDICT!! https://t.co/bmkrGoH2vI","date":"Sun Oct 17 20:17:07 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Bannon is not in jail where he should be. https://t.co/3hqvNoWMQc","date":"Sun Oct 17 19:05:30 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@ratemyskyperoom But I got the light switch out of the shot!","date":"Sun Oct 17 11:30:53 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"God left when the throwing trash from the stands started","date":"Sun Oct 17 04:09:28 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@TheRealTMOTS Firstly I’m for both bills. But I’m not for neither becoming law.\nTrump 2 Nd term is a not a threat to democracy but the end of democracy","date":"Sat Oct 16 23:39:30 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@TheRealTMOTS But if we lose the presidency to trump we lose democracy for a long time maybe forever. I don’t wanna see that happen and it very well could. It’ll be the vengeance tour. And he’ll have an attorney general who will do whatever the hell DT wants and to whom ever the hell he wants.","date":"Sat Oct 16 23:22:17 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"At judiciary hearing with Bill Barr I inquired about Epstein death.","date":"Sat Oct 16 22:48:34 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Why I voted NO","date":"Sat Oct 16 01:06:59 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I mourn the loss of freedom in Hong Kong and see the people who've stood up there as heroes. I admire them and we need to do all we can to help open up our country to those who want to find freedom here and to stand up to China for its repression of Hong Kongers and Uyghurs. https://t.co/TJtAfCiRwE","date":"Fri Oct 15 15:51:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Bannon and all  instigators of the Jan.6 attempted coup to overturn the election,the Constitution,and the US government need see the rule of law come down on their heads.And this includes instigator one ,aka Trump ,aka individual one.","date":"Thu Oct 14 19:57:04 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@JakeSherman @RepJohnYarmuth No","date":"Thu Oct 14 15:52:05 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@JakeSherman @RepJohnYarmuth To paraphrase Bernard Baruch \nThe reports of my retirement have been greatly over exaggerated.","date":"Thu Oct 14 15:51:17 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Working hard for my district and state. Thanks Bill Freeman for pointing out these facts about my  service. https://t.co/qYeDu1gvjZ","date":"Thu Oct 14 15:28:02 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I abhor this type of political invective and beseech reasonable minds here and in Israel to condemn this extreme and hateful language as harmful to peace in the Middle East.","date":"Wed Oct 13 21:08:51 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump proposed 57 Nationwide Permits to fast-track oil pipelines and allow developers to bypass meaningful review or public input. @RepPeterDeFazio and I are urging @POTUS to reconsider this process and all remaining permits to protect our water, climate and communities.","date":"Wed Oct 13 17:24:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Today’s shooting at the postal facility in Orange Mound is yet another example of why I’m concerned that too many guns are out there and in possession of people who aren’t able to control their anger. I express my profound condolences to all those affected by this terrible event.","date":"Tue Oct 12 23:45:20 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"It is disheartening that we will have to go through this dangerous exercise again in December, but it is behind us for the moment. Voting to raise the debt limit was the only responsible thing to do to protect our economy.","date":"Tue Oct 12 23:35:27 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Playing Russian roulette with the full faith and credit of the United States and potentially jeopardizing our senior citizens’ 401k's, Social Security and the economy, was once considered unheard of, but not in this hyper-partisan era.","date":"Tue Oct 12 23:35:27 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"While men gained jobs last month, women lost jobs and have made up 2/3 of all jobs lost during the pandemic. Women have dropped to the same rate of workforce participation as in 1988. We must establish universal childcare and permanently fund the CTC to Build Back Better for all.","date":"Tue Oct 12 21:52:41 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The House's second-ranking Republican repeated without evidence the GOP's false claim that states did not follow the U.S. Constitution when certifying their votes. https://t.co/9FHIef1W4q # via @HuffPostPol \nMAYBE ON COLUMBUS DAY REPUBLICANS WILL DISCOVER THE CONSTITUTION 🇺🇸🇺🇸🇺🇸","date":"Mon Oct 11 15:47:02 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Donald Trump Sends Video Message to Ashli Babbitt's Family// HE IS RESPONSIBLE FOR HER DEATH!!  https://t.co/ubYtF8O8Hf","date":"Mon Oct 11 14:22:44 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Raskin floats inherent contempt as former Trump aides defy Jan. 6 subpoenas// Trump and friends tried to overturn the Constitution and stay in power through a coup and they continue to put their middle finger to the law and the Congress.Sgt at arms time!! https://t.co/TYo6GJ2VtC","date":"Sat Oct 09 16:53:02 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"At the very beginning of the pandemic, I urged airlines to require facemasks on flights. We now have the vaccines to end this pandemic and I applaud President Biden for taking steps to require large employers, including airlines, to ensure their employees are vaccinated.","date":"Thu Oct 07 21:13:13 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Pandora Papers shine a bright light on how kleptocrats launder their money in the West and threaten democracy. In order to fight corruption, we must curb the enablers. I’m proud to join my colleagues in introducing the ENABLERS Act.\nhttps://t.co/8r8cbo37ON","date":"Thu Oct 07 20:06:52 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Proud to work with my colleagues to advance Cerebral Palsy research in Congress. #WorldCerebralPalsyDay https://t.co/Uel8rywnWS","date":"Wed Oct 06 20:43:17 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"What if we eliminate the filibuster for a day so we can prevent McConnell’s debt default and also pass:\n\n- Voting rights\n- $15 min wage\n- Police reform\n- Immigration reform\n\nCall it: Democracy for a Day\nhttps://t.co/kYZmRCHz0T","date":"Wed Oct 06 15:19:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Republicans: You have to raise the debt ceiling by yourselves.\n \nAlso Republicans: We won’t let you raise the debt ceiling by yourselves.","date":"Mon Oct 04 16:27:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"It’s not if but when oil pipelines burst and threaten our drinking water,the flora, and the fauna. https://t.co/R5UPBxy8Ng","date":"Mon Oct 04 03:15:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@StephenKing I completely agree and have urged that we pass both bills and build back better. It’s Joe’s job to bring Manchin/Sinema into fold and keep house moderates working with Pelosi and caucus. We need to succeed or else.","date":"Mon Oct 04 02:51:31 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"A murder in the neighborhood. A  Rhodes college student murdered and girlfriend shot by home invaders. My condolences to the victims family,friends, and classmates.Rhodes is a great school in a great historic neighborhood. We need all stay strong and hope police find the killer.","date":"Mon Oct 04 02:44:59 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"NEW: 200+ Representatives are cosponsoring the #PASTAct to eradicate the indefensible practice of horse soring—the intentional infliction of pain on show horses’ legs and hooves to force them into high-stepping gaits that win competition ribbons.\nhttps://t.co/eOsBHV2Z0H","date":"Fri Oct 01 21:15:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Biden made an important visit/speech to Democratic House Caucus.Extremely well received. Stressed need to pass the 2 bills before us &amp;accept accommodation that is necessary to get bilateral support.Emphasized the good contained therein for the https://t.co/KeNOCtjBpM back better","date":"Fri Oct 01 21:04:19 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The BIF isn’t what I hoped for, but we haven’t had an infrastructure bill for decades and it’ll help the country and my district. We need to pass the BIF and Build Back Better Act to deliver for the people and stop the monster of Donald Trump rearing its ugly head. https://t.co/BsCp4Q8hmk","date":"Fri Oct 01 20:56:13 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Build Back Better Act is not only a “social spending” bill. It’s the last best chance to prevent the climate crisis. It should be treated as such.","date":"Fri Oct 01 18:08:17 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I’ll be on MSNBC momentarily to discuss the latest news on Build Back Better.","date":"Fri Oct 01 17:12:27 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@JDE_____ Take two aspirin and call me in the morning","date":"Fri Oct 01 16:13:15 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Lot of talk in caucus of someone sending or facilitating info from meeting to Jake Sherman. \nI thought he signed with Tampa Bay Bucs. Go Bucs!","date":"Fri Oct 01 16:10:03 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Debating the 3.5 trillion dollar “cost” of the Build Back Better Act distracts from the fact that the actual net cost would be zero if we raise taxes on the ultra-rich like we’d like to. The very same people blocking those taxes are the ones balking at the “cost.”🧐","date":"Fri Oct 01 15:12:32 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We need to deliver the entirety of the President’s agenda by passing both the infrastructure bill and Build Back Better Act. If we don’t show results for the American people, we could see the return of Trumpism and a vengeance tour that tests the very foundation of our democracy. https://t.co/4gDvRS32Ma","date":"Fri Oct 01 01:14:02 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Too often hair style and other grooming standards are used as a proxy for racial discrimination. It’s just that simple. I was proud to vote today to advance the #CROWNAct and prohibit race-based hair discrimination. https://t.co/jvfIjrr4GX","date":"Thu Sep 30 21:57:42 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"McConnell’s political principles are simple. He will do anything to destroy a Democratic presidency and he is willing to tank the economy by forcing the first-ever default to do it.","date":"Thu Sep 30 21:00:26 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I am disheartened, saddened and shocked that a child has been shot by another student at an elementary school. One thing is clear: we have too many guns in the wrong hands. Gun violence begs for commonsense reform.\nhttps://t.co/7hEgPt14HQ","date":"Thu Sep 30 20:17:18 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"My Republican colleagues should come into 21st century on something and join us in passing the #MOREAct. It's an important step forward to deschedule marijuana, expunge offenses and reinvest the revenue in communities disproportionately harmed by the War on Drugs.","date":"Thu Sep 30 18:49:27 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Americans have the right to life, liberty &amp; the pursuit of happiness. For people smoking marijuana, it's part of their pursuit of happiness yet the War on Drugs has deprived millions of their rights and purposely targeted &amp; disenfranchised Hispanic, Black &amp; White hippy Americans. https://t.co/8wCcI3QRNW","date":"Thu Sep 30 18:49:26 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"After decades of working to end the sentencing disparity between crack and powder cocaine, we've finally passed the EQUAL Act. The War on Drugs has been a failure and this disparity is a glaring example of its inequity. We must undo the harm done to communities of color.","date":"Tue Sep 28 19:15:38 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"As we fight to protect the right to vote, we must also exercise it. The first step that we can all take is registering to vote or making sure your registration is up to date. #NationalVoterRegistrationDay\nhttps://t.co/8FBBnQtdoA","date":"Tue Sep 28 17:39:28 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"FYI @MarshaBlackburn, the NIH updated its guidance following my letter — unvaccinated people should not be prioritized for monoclonal antibody treatment over those who got the vaccine to protect themselves, their families and their communities.","date":"Tue Sep 28 14:45:29 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Ford Motor Co., along with the South Korean battery company SK Innovation, to locate facilities and invest $5.6 billion in the Memphis Regional Megasite in Haywood County, creating 5,800 new jobs. - BIG news for #Memphis and West https://t.co/JKsYGVOzGR! https://t.co/8d3I2Advkz","date":"Mon Sep 27 23:30:51 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I got my booster shot today and encourage you to get yours too if you’re an eligible person over 65, with a medical condition or in a frontline job. They're available at thousands of vaccination locations around the country. Let's end this pandemic once and for all! https://t.co/2jrE5zko0d","date":"Mon Sep 27 21:11:35 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Pathetic performance,by a loser who can’t admit he lost ,and pathetic response by a cult so enamored by their lying charlatan that they believe he won.They also think “rasslin”is real and the South won the war!","date":"Sun Sep 26 05:03:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Build Back Better agenda will create more jobs, cut taxes and lower costs. There is no reason not to pass both the Build Back Better Act and Bipartisan Infrastructure Framework.","date":"Fri Sep 24 19:30:29 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The party of “fiscal responsibility” racked up $8 trillion in national debt under Trump and now refuses to pay for it as they force us to careen towards the first-ever default.","date":"Fri Sep 24 18:21:14 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The House voted today to enact a federally protected right to abortion. We cannot depend on the Supreme Court, which just greenlit a historically restrictive ban on abortion before most even know they’re pregnant. The #WHPA will protect the right to decide in every zip code.","date":"Fri Sep 24 17:31:35 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"A bloated defense budget comes at the expense of our security. Housing, nutrition, health care, childcare and other domestic programs are vital to the security of American families and should be our priority.","date":"Fri Sep 24 03:12:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The shooting in Collierville today is another horrific incident caused by someone who is undoubtedly in another world and had a lethal weapon. That is a deadly combination. My thoughts are with the victims, their families and all in Collierville and the Greater Memphis community.","date":"Thu Sep 23 22:52:09 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"My amendments to the NDAA would bolster our foreign policy efforts against kleptocracy and require the Secretary of Defense to attempt to recover the aircraft the US provided to the Afghan government. These aircraft were purchased by American taxpayers &amp; should be returned to us. https://t.co/9HJcVMWMyS","date":"Wed Sep 22 21:53:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The #ProtectingOurDemocracy Act is the third pillar of our democracy agenda, along with #HR1 and the #JohnLewisVotingRightsAct. As Chair of the Constitution, Civil Rights &amp; Civil Liberties Subcommittee, I authored much of this bill and will fight to pass this democracy safeguard.","date":"Wed Sep 22 16:04:56 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Dr King said, “A threat to justice anywhere is a threat to justice everywhere.” I am committed to supporting freedom and human rights in Belarus, which is ruled by the iron hand of an autocrat, just as I am committed to fighting for freedom and justice here in the United States.","date":"Tue Sep 21 23:44:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/nmHKLeU3w5","date":"Tue Sep 21 23:44:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"No President—no matter their party or politics⁠—is above the law. Full stop.\n\nThe #ProtectingOurDemocracy Act will ensure that an unscrupulous executive can never take advantage of our democracy again. And I will fight to see this bill become law.","date":"Tue Sep 21 14:08:37 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"COVID-19 has killed more Americans than the Spanish flu did over a century ago when no effective vaccine existed. Today we have the tools to end this pandemic. We are fighting misinformation as much as a disease.\nhttps://t.co/72AUlhZvuY","date":"Tue Sep 21 12:35:06 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"It is broadly popular to cut taxes for the middle class, lower the cost of health care, and raise taxes on the superrich. That is what the #BuildBackBetter Act would do and every Republican opposes it.","date":"Mon Sep 20 21:52:11 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@Fahrenthold FDR had the New Deal\nTruman the Fair Deal\nTrump the Self Deal","date":"Fri Sep 17 22:36:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I keep hoping that Senator Manchin will have an epiphany if and when he can’t find 10 Republican votes for voting rights. Indeed, it is easier for a Senator to pass through the eye of a needle than for a Senator to find 10 Republicans to vote for voting rights. #EndTheFilibuster","date":"Fri Sep 17 20:40:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ Rep. Gonzalez was one of the best, if not the best in his conference’s ‘18 class. Smart, honest principled, collegial.Congress has lost one of its future stars. God speed! https://t.co/bGeseQ1lbP","date":"Fri Sep 17 02:26:47 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"#HispanicHeritageMonth is a time to recognize the rich influence and contributions of Hispanics on American culture, history and achievement. It's also a time to examine all the ways the American Dream falls short for too many Hispanics and to recommit ourselves to action.","date":"Wed Sep 15 21:43:14 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"At midnight I wrapped up my committee work on the #BuildBackBetter Act. As a member of @TransportDems,@NRDems &amp; @HouseJudiciary, I’m proud to help build our transportation future, combat the climate crisis, provide a path for Dreamers and make historic investments in the people.","date":"Wed Sep 15 19:45:13 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The middle class is sick of giving tax handouts to the rich.\n \nDemocrats are on the verge of passing one of the biggest middle class tax cuts in history, paid for by making those at the very top pay their fair share.","date":"Wed Sep 15 18:43:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Big Pharma has written its own rules and fought drug pricing regulations.\n \nWe need to rewrite the rules for the people and bring down drug costs and premiums. #WeNeedHR3","date":"Wed Sep 15 16:57:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The media needs to stop acting like the $3.5 trillion Build Back Better Act is some incomprehensible expenditure. It’s over TEN years. The defense budget over 10 years would be well over $7 trillion.","date":"Tue Sep 14 20:21:11 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Here’s what you need to know about the SpaceX mission taking a St. Jude employee to space https://t.co/SOqzWjgOH8 via @memphisnews//all civilian crew.God speed!","date":"Tue Sep 14 19:02:28 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Republicans’ new voting laws aren’t about reducing voter fraud. They’re about reducing voter turnout.","date":"Tue Sep 14 18:01:42 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Childhood obesity is dangerously high and research shows early childhood is an important time for developing positive eating and exercise behaviors. I am pleased to partner with @SenBooker to introduce the Reducing Obesity in Youth Act to encourage and support positive behaviors.","date":"Tue Sep 14 16:57:14 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@tmartinpizza @patchflower @JackDewald The presidents announcement said executive branch federal employees. No exemptions for Congress was including in his statement because of the separation of powers neither Legislative or judicial employees could be included","date":"Tue Sep 14 15:46:53 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Republicans have today in judiciary committee questioned the good of FDR’s New Deal,didn’t attack Truman’s Fair Deal but won’t acknowledge Trumps Self Deal ! The worst deal ever in America!","date":"Tue Sep 14 02:20:44 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"This is truly terrifying to watch. She is not smart but she’s smart  Enough to appeal to people that know less than she does. We should turn government over to religion? Government should be taking orders from the church?\nTalk about Elmer Gantry fascism.","date":"Tue Sep 14 01:17:23 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@JackDewald I suspect it’s the separation of powers. We do have a House rule concerning mask wearing on floor and in committees and a fine for violating. Republicans are challenging in court( though they’ve lost twice already)\nIt’s my understanding all Democrats are vaccinated. Repubs 70%","date":"Mon Sep 13 23:38:08 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Ben Franklin and my father had something in common unfortunately. Each chose not to vaccinate his child when he could have. Franklin's son died of smallpox and I've lived with polio's effects since age 5. Both men regretted their decisions the rest of their lives. #GetVaccinated https://t.co/LB348WV4yG","date":"Mon Sep 13 20:45:20 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@RepBoebert is a child and education deficient while Trump is a bloviating liar whose history tool box is near empty. No wonder they’ve bonded.","date":"Mon Sep 13 16:04:05 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@RepBoebert I didn’t suggest that anyone who had a conflict of interest on nat’l resources committee (such as massive income from fossil fuels)and didn’t declare such as law requires be subject to ethics https://t.co/IHzNQVgSZB outside the law is wrong.","date":"Mon Sep 13 15:49:59 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Pausing today to remember all those we lost 20 years ago and all the first responders who gave their lives on #September11. We will never forget and will forever be thankful to those heroic first responders and to the heroes who risk their lives every day to keep us safe.","date":"Sat Sep 11 13:37:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Treasonous and venomous and a ham sandwich short of a picnic","date":"Thu Sep 09 23:31:31 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"If anyone is worried about paying for the #BuildBackBetter bill, I’ll let them in on a little secret. We can pay for it in full by making sure the ultra-rich finally pay their fair share. #TaxTheRich","date":"Thu Sep 09 18:51:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@Minoso9HOF","date":"Wed Sep 08 02:37:38 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ Minnie Minoso should be in the ⁦@baseballhall⁩ of fame. Mr. Chicago White Sox. An all star many times but as great a ball player also a great human being representing baseball superbly. https://t.co/yvUNj2lSZp","date":"Mon Sep 06 23:24:45 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"When Madison Cawthorn suggested possible bloodshed or that he’d take up arms against his fellow Americans, I think he was being dramatic but he was also showing what some people think. There could be problems in the future and these people are a threat to the United States. https://t.co/PZdLtSzOX6","date":"Mon Sep 06 19:40:39 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"September 5, 2021 - by Heather Cox Richardson - Letters from an American// Labor Day! PLEASE STOP and READ the letter as you will learn history of a great woman and the labor movement which is as needed today as then!!! https://t.co/ZguDeFcowH","date":"Mon Sep 06 18:03:45 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The nine most terrifying words to a Trumpian Member of Congress are, “We want your phone records from January 6, 2021. https://t.co/YSLe9HdZNQ","date":"Mon Sep 06 15:06:51 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Working people are the backbone of this country and have faced challenges during the pandemic unlike anything before. All workers deserve our praise &amp; recognition on #LaborDay and every other day. I wish all in #Memphis a safe happy holiday &amp; hope we can pass a $15 minimum wage.","date":"Mon Sep 06 11:58:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@JamesDMayer2 She has a 6 year term and her vote will be a non consequential aye","date":"Thu Sep 02 22:32:37 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We *will* act to codify Roe v. Wade into law. If the Supreme Court will not protect basic rights, Congress must.","date":"Thu Sep 02 22:21:14 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Expand the Court.","date":"Thu Sep 02 21:24:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"This button was from 2000 Dem. convention. Can’t say we didn’t know. https://t.co/Xcp7wMsbdN","date":"Thu Sep 02 20:42:02 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Esteemed Justice Breyer needs to announce retirement so Biden can name his replacement while Dems still have majority in Senate.And Chief Justice Roberts doesn’t influence the Trump/far right faction\nThis is what we learned from Courts failure to protect Roe/women in Texas case.","date":"Thu Sep 02 20:10:17 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Senators who stole a seat and jammed the Supreme Court with three Trump appointees are responsible for the attack on reproductive freedom and should be ashamed. \n\nWith this Supreme Court, #Roe is on life support. Women must have a choice concerning their own bodies.","date":"Thu Sep 02 17:45:31 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"U.S. Rep. Mo Brooks calls January 6 Committee 'Gestapo, KGB-type entity' for seeking to obtain his private phone records - Yellowhammer News\nNO MO GESTAPO AND KGB DIDNT ISSUES SUBPOENAS. If KGB or Gestapo you would have been in Siberia or a camp or dead! https://t.co/LldOpdGLxH","date":"Thu Sep 02 00:45:31 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Apparently Kevin McCarthy, Jim Jordan, and Matt Gaetz agreed with my analysis from the gallery as they ALL called Trump and asked him to call his revolutionary guard off!","date":"Thu Sep 02 00:07:26 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump’s revolutionary guard stormed the Capitol on #January6th while we were trying to certify the election. I never thought I’d be under attack in the U.S. Capitol, fearing for my life and shouting to my Republican colleagues to call Trump and have him call off his troops. https://t.co/ODzn5pTryQ","date":"Thu Jul 29 15:04:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Kevin McCarthy Warns Phone, Tech Giants GOP Won’t ‘Forget’ If They Turn Over Jan. 6 Records | HuffPost\nWhat is McCarthy and Republicans AFRAID of? Proof of aiding and abetting sedition? https://t.co/lE28U31m1Y","date":"Wed Sep 01 14:05:12 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The United States government continues to subsidize polluters fueling the climate crisis.\n\nWe must put a stop to subsidies for fossil fuel companies and ensure polluters' enormous profits pay for the damage to mother earth. The Build Back Better Act is the chance to get it done.","date":"Tue Aug 31 17:41:35 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"COVID cases, hospitalizations and deaths are skyrocketing to new highs. Get vaccinated and wear your mask because Delta is not messing around. https://t.co/B6IYsUsnOa","date":"Tue Aug 31 15:56:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Reminder that every Republican voted against the John Lewis Voting Rights Act. Far cry from when majorities of both parties passed the VRA in 1965.\n\nAfter just trying to steal an election, they claim no need for voter protections. Their march towards extremism knows no bounds.","date":"Mon Aug 30 15:13:37 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Op-Ed: In assassinating my father, Sirhan committed a crime against America. He must not be released  https://t.co/ppbYovkvHt \nI thoroughly agree. Sirhans’ crime changed the course of history and he could adversely impact Events if released .I endorse Maxwell Kennedy statement.","date":"Mon Aug 30 03:35:47 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Apparently more good intel. Drone attack saves our troops and others at Kabul airport! Isis K must be eliminated.","date":"Sun Aug 29 15:57:55 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@TedLasso Charlie was their Roy Kent","date":"Sun Aug 29 02:58:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@brettgoldstein @AppleTVPlus Is Roy Kent to @TedLasso what Charlie Watts was to the Stones ? Stylish,staid,professional,distant.","date":"Sun Aug 29 02:23:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Voter suppression is a response to Trump having lost because of Democratic turnout and now they know they can’t win unless they suppress minority voters.","date":"Sat Aug 28 06:05:40 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Saddened to learn of loss of US service members. Condolences to family and friends.\nThanks for service of all US forces. More harrowing times ahead.","date":"Thu Aug 26 18:03:23 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Proud of my friend @RepJohnYarmuth leadership on this issue and his steadfast service since our class of ‘06 came to Congress.\nBuild Back Better! \nChild tax credit extended,Medicare expanded,climate change curbs,family leave,pre k, Jr. college,workforce training,senior/home care,","date":"Thu Aug 26 16:51:06 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Horrified but expected suicide bombing in Afghanistan. Officials informed Congress of likelihood of Isis K attack. Only so much you can do to stop suicide bomber.Sadly I expect more terrorist activity til last soldier leaves. As draw down ends less to little security for troops.","date":"Thu Aug 26 15:39:45 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Penny’s from heaven @Iam1Cent","date":"Thu Aug 26 02:41:09 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Proud of my committee’s doing the hearings behind John Lewis Voting Rights Bill and the shout out this morning by @SpeakerPelosi https://t.co/lwjb9Lz82U","date":"Wed Aug 25 17:12:56 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Today I voted for the John Lewis Voting Rights bill. Republicans don’t think it’s necessary despite state voter suppression laws &amp; the Jan. 6 insurrection to subvert a free election. 2/3 voted to overturn the Electoral College. Give me a break.\nhttps://t.co/Xk4Rc7Y2nF","date":"Wed Aug 25 00:26:56 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Our hearts go out to the victims of the tragic flooding in Middle Tennessee. Rather than blame Mother Nature, let’s look at the fossil fuel industry for decades of negligent carbon emissions &amp; resulting climate change. https://t.co/ARcaSxYDTN","date":"Tue Aug 24 21:53:04 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"This afternoon, I went to the House floor to urge passage of President Biden’s Build Back Better plan and praised the efforts of @SpeakerPelosi and @LeaderHoyer. It’s time to provide needed infrastructure for American businesses and families. \nhttps://t.co/Doz4BJLmNL","date":"Tue Aug 24 18:05:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Tonight I spoke on the House floor about final approval of the Pfizer vaccine and the deaths of two prominent Tennesseans who didn’t get vaccinated but urged all from their hospital beds to GET THE SHOT! Please, please heed their message! \n \nhttps://t.co/XFjO9sfQaf","date":"Tue Aug 24 01:09:18 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@SecOfChampagne Not sure if I’d told that! Welcome to the  Carly Simon “ you’re so vain you think this song is about-you.” Club.","date":"Tue Aug 24 00:14:09 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Pfizer vaccine received full-FDA approval. Conservative radio host Phil Valentine and Memphis football star Danton Barto have died from Covid. Neither were vaccinated but said they wished others would be. Please heed the call. \nhttps://t.co/LSwwNlp7dK\nhttps://t.co/9eptCospYP","date":"Mon Aug 23 20:37:09 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump and his evil spirited aid,Stephen Miller,put Afghani’s who aided us at mortal risk.Shame!@Be ware of karma!","date":"Sat Aug 21 12:01:41 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I’m going to buy a Patagonia jacket this Fall.I’ve had one for years and while still stylish it’s getting a little smaller.Hoo ray for Patagonia for taking a righteous stand!","date":"Sat Aug 21 11:11:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Bad news,nice memory.More songs with “Memphis” in the title than most any city and they are about GOING TO MEMPHIS . Tom T gave us many great stories/songs.Thank you for adding to the culture of America.","date":"Sat Aug 21 11:05:01 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/OPoXjZJRVD\nRetweet if you stand with Larry David.Don’t curb your enthusiasm!Retweet!","date":"Fri Aug 20 15:10:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump messed up the Afghanistan ending as he has messed up about everything else. Now the Republican Nat’l Cmte and many Trump acolytes are trying to change history.They crowed about Trump/taliban deal on their web site til last week when it https://t.co/5rfaIY7H1C Occupy ad!","date":"Fri Aug 20 02:49:52 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The “perfect” 36th state was #Tennessee.The Tn.legislatures most significant moment.Last uncommitted state and it passed by one https://t.co/cO5gu3k4wS vote made a major difference.Every vote is important &amp; can make a difference.\nThe Senate needs to put vote over the filibuster !","date":"Wed Aug 18 21:16:51 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Cancel culture, Texas style!","date":"Wed Aug 18 16:25:19 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"No Donald the GREATEST EMBARRASSMENT was YOU!!!","date":"Wed Aug 18 14:30:10 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Joined w former Pep.Ted Poe(R Tex) to present amendments (2012-2014)to cut Afghanistan infrastructure fund by half.we lost in ‘12 but successful in ‘13&amp; ‘14. Senate didn’t concur. But proud to have led in House to point out corruption and waste. Afghanistan notoriously corrupt!","date":"Wed Aug 18 00:59:55 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Next they should be able to opt out of math,English,and science!","date":"Tue Aug 17 03:02:33 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Thank you @staceyabrams for your leadership and for your testimony before the subcommittee.","date":"Mon Aug 16 22:43:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Requiescat in pace! https://t.co/xulpyw9Dhq","date":"Sun Aug 15 16:13:55 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"To reduce recidivism and allow formerly incarcerated people to fulfill their potential, we must remove barriers and expand opportunities. By expanding access to education at #HBCU's, the bill I intro'ed w/ @RepFrenchHill will provide opportunities to not only survive but thrive.","date":"Fri Aug 13 16:55:54 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Each month, the #ChildTaxCredit generates more than $18.6 billion in local spending nationwide. This historic tax credit is putting more hardworking families’ money back in their pockets and supporting jobs across the country by building out the middle class.","date":"Fri Aug 13 13:12:26 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Saw a large and seemingly low horizontal meteor last night(11:30ish #memphis) earthgrazer? Appeared like right over my house Android gone. Very large and fast. Any other sighting? #PerseidMeteorShower","date":"Thu Aug 12 18:13:35 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Pleased to say Democrats are moving forward with realizing the biggest middle class tax cuts and infrastructure investments in history paid for by rolling back tax cuts for corporations and the super-wealthy.","date":"Wed Aug 11 15:16:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The greener House transportation bill further prioritizes transit, rail, electric vehicles and 21st century infrastructure. Any final legislation should include these priorities and the Build Back Better agenda. I look forward to reviewing the bills when the House considers them. https://t.co/vkCREuzU6W","date":"Tue Aug 10 17:03:15 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I am pleased several bills I authored to make our roads safer for all users were included in the bipartisan infrastructure bill. I hope the Senate also passes the larger reconciliation bill to make a once-in-a-generation investment in a greener, fairer and more prosperous future.","date":"Tue Aug 10 16:20:28 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Al Gore told us climate change was coming and it’s here and been here. We need to wake up the luddites and put our policy in warp speed or we’ll all fry in hell (it’ll be hot as hell)!\nhttps://t.co/35qPYe6lI4","date":"Mon Aug 09 15:34:43 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Elvis would say,” Return to Sender , Address Unknown.” And Joe should too!","date":"Fri Aug 06 21:28:35 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"There’s nothing more important we can accomplish than protecting our democracy and passing the John R. Lewis Voting Rights Advancement Act. I’ll be chairing the @HouseJudiciary hearing so tune in on August 16.","date":"Fri Aug 06 20:38:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"“Your vote matters. If it didn’t, why would some people keep trying to take it away.” ― Rep. John Lewis\n \nThey are still trying and we will never stop fighting to protect the vote of EVERY SINGLE AMERICAN.","date":"Fri Aug 06 16:13:07 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"A gold medal should be a crowning achievement of athleticism, not a reward for doping and corruption. The GOLD Act I introduced today with @RepJoeWilson, @SenWhitehouse and @SenatorWicker would better enforce anti-doping rules to make sure the Olympics are fair and clean.","date":"Fri Aug 06 14:30:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"I am saddened to see #EbrahimRaisi sworn in as president of #Iran today. The Iranian people deserve free and fair elections and a ruler that respects human rights. Raisi is a danger to a secular and democratic Iran, and to world peace.","date":"Thu Aug 05 22:15:30 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Told you before, I’ll tell you again!Trump is a treasonous and pathetic loser who tried to overttake our Constitution and he will do it again! Indict! 14th amendment!","date":"Thu Aug 05 22:03:10 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"GDP growth under Trump was the worst for any president since the Great Depression. This from the man who promised we'd be sick of winning.\n\nDem presidents seem to have a habit of building back better from their GOP predecessors. Annualized GDP under Biden has already jumped 6.5%.","date":"Wed Aug 04 15:53:47 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"In the face of an historic eviction crisis, the CDC must extend the eviction moratorium at least until the billions in allocated rental assistance are finally distributed to tenants and landlords. With delta surging, the need to keep people in their homes is higher now than ever.","date":"Tue Aug 03 18:59:55 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The most damning evidence against Trump\nConstitutional limits,laws,contracts,agreements,vows are simply first offers to Trump.\nHis narcissistic psychopathic behavior pursues all for self without restraint.\nHe attempted to overthrow the Constitution.\nIndict https://t.co/9JqtgL8keB","date":"Mon Aug 02 18:53:28 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"In this dystopian time with Delta variant and deniers of January 6 brazenly denying reality we needed the #OlympicGames . Pride in our country and emotions of “thrill of victory and agony of defeat.”. Cheering for #SimonBiles to capture Gold and for USA to garner most medals.#USA","date":"Mon Aug 02 12:46:29 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Should be indicted","date":"Sun Aug 01 17:26:53 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Not getting vaccinated . That’s not rational!","date":"Sun Aug 01 17:11:27 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Get vaccinated for YOURSELF and your FAMILY and COMMUNITY!!","date":"Sun Aug 01 17:09:14 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Population plus bad government policy= first in deaths. Great work Gov. Abbott! But don’t change or Florida will pass you as dumbest, deadliest state.","date":"Sun Aug 01 16:48:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"No one wants to declare bankruptcy, but the system should be fairer and treat private student loan debt like any other debt. Our bill ensures people will be protected from the financial ruin of student loans should they face unexpected strains.\nhttps://t.co/ImI0lV3sib","date":"Fri Jul 30 23:17:38 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The DOJ decision to require the release of Trump’s tax returns to Congress is the right one. The law clearly says returns SHALL be released and the Trump AGs’ delay was inexcusable. I suspect the returns will be both revealing and damaging.","date":"Fri Jul 30 21:32:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump taxes unfounded refusal to release reversed and Trump to justice:Say election corrupt.\nFour years of deceptions,illegalities,grifting, and despicable behavior. Somehow we survived the most tawdry and corrupt administration ever.Trump was/is/ and always will be INDIVIDUAL 1","date":"Fri Jul 30 20:53:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Tennessee governor's religious views became 'barrier' in J&amp;J vaccine rollout, former insider claims https://t.co/zsbHySs3Pm","date":"Thu Jul 29 20:51:51 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Something smells foul","date":"Thu Jul 29 17:08:44 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Olympics show America united. Asian Americans,African-Americans,all Americans win medals which bring pride to Americans from sea to shining sea.#Olympics #USA","date":"Thu Jul 29 17:00:50 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The testimony we heard at the #January6thCommittee was sobering. I thank all the officers for their valor and the bipartisan membership of the @January6thCmte for getting to the truth of that day and working to prevent such an assault from ever happening again.","date":"Thu Jul 29 15:04:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Trump’s revolutionary guard stormed the Capitol on #January6th while we were trying to certify the election. I never thought I’d be under attack in the U.S. Capitol, fearing for my life and shouting to my Republican colleagues to call Trump and have him call off his troops. https://t.co/ODzn5pTryQ","date":"Thu Jul 29 15:04:58 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Inspired by these courageous Texas legislators who are standing up for democracy and voting rights. We have their backs and will pass HR 4, the John R Lewis Voting Rights bill.","date":"Wed Jul 28 20:45:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Iranian people are protesting on the streets and demanding change from #EbrahimRaisi. We stand in solidarity with the peaceful protests. The Iranian people deserve better!\nhttps://t.co/71k6Th8bo9","date":"Wed Jul 28 18:43:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"When minority groups grow large or influential enough to threaten the existing, white-dominated power structure, the white-dominated power structure often responds by trying to suppress the minority's ability to vote. That's exactly what we're seeing in GA, MI, TX, AZ and beyond. https://t.co/sFKXFydqTS","date":"Wed Jul 28 18:00:55 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Transit Access = Opportunity\n\nAmerica thrives when we have access to opportunities. The #INVESTAct boosts transit funding to electrify buses, increase routes, improve frequency and provide better options for all riders including seniors &amp; people with disabilities. #TransitTuesday","date":"Tue Jul 27 20:47:23 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"“I feel like I went to hell and back to protect them and the people in this room, but too many people are now telling me that hell doesn’t exist or hell wasn’t that bed.”\n \nOfficer Fanone, that hell did exist and I thank you for protecting us all from it. #January6thCommission","date":"Tue Jul 27 17:06:03 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"https://t.co/Bkzu0L0FNg","date":"Mon Jul 26 22:54:39 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"For millions of Americans, affordable healthy food is too hard to access. I introduced a bipartisan solution w/ @RepKenBuck to incentivize supermarkets to open in underserved areas, hire local residents &amp; workers with barriers to employment, and sell affordable fresh fruit &amp; veg.","date":"Mon Jul 26 22:54:39 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"As someone living with a disability since getting polio at age 5, it’s moving to see the FDR Hope Memorial dedicated on the 31st #ADAAnniversary. FDR led the world from his wheelchair and showed that a disability from polio or anything else did not limit a person's capabilities. https://t.co/LYtV3irCvH","date":"Mon Jul 26 21:55:34 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"For the 61 million of us Americans who live with a disability, the anniversary of the ADA is a day to celebrate its impact and the activists who got it signed into law. 31 years later, we live in a transformed world but with too many barriers remaining. We won't let up. #ADA31","date":"Mon Jul 26 21:55:33 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The veteran journalist accused the former president of \"fomenting a coup\" and called his mishandling of the pandemic \"homicidal negligence.\" https://t.co/V7PztWOcPX # via @HuffPostPol","date":"Mon Jul 26 17:14:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Rep. Taylor Greene calls exclusion of unvaccinated people 'segregation' - POLITICO/ First(and 2nd and 3rd)it was the Holocaust, now it’s the Civil Rights movement . If next she derides women’s movement she’ll have a hat trick. And on to a grand slam!  https://t.co/C60rA4ZOju","date":"Mon Jul 26 16:29:48 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Unvaxed Trump supporter who spread coronavirus conspiracy theories dies of COVID-19 https://t.co/47gNEECplR all the sudden Republican leaders are starting to encourage vaccinations.Maybe losing voters has caused the turn about ?","date":"Sun Jul 25 21:30:44 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Excellent choice by the Speaker! @RepKinzinger is more capable than Jordan,Banks,and 3 future draft choices.","date":"Sun Jul 25 18:57:15 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"How about talking to your doctor, a nurse,a physicians assistant,a med student or a rational human being not mentally and/or psychologically under the aura of certain politicians who will do anything to keep their base,even if it actually sickens and kills that base. Not Clergy.","date":"Fri Jul 23 22:15:26 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"After a sustained effort, the bust of KKK leader and Confederate Gen. Nathan Bedford Forrest was removed today from the TN State Capitol. I’ve repeatedly urged @GovBillLee &amp; prior governors to remove it. I’m glad to see a positive step forward. Next: renaming the NBF State Park.","date":"Fri Jul 23 18:41:44 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Me in 2009, the last time Congress increased the minimum wage to $7.25.\n \nMe in 2021, when the federal minimum wage is STILL $7.25.\n \n#RaiseTheWage #12YearChallenge https://t.co/RvZ3v8ERdV","date":"Fri Jul 23 17:39:16 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Olympics! USA! USA!go for the Gold! Bring it home! #Olympics #OlympicGames #TeamUSA","date":"Fri Jul 23 13:34:11 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Don’t say we can’t afford to fight climate change. We can’t afford not to.","date":"Fri Jul 23 12:57:26 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Congressman Speaks Out for Sha’Carri Richardson https://t.co/5VEShhjATG via @high_times_mag// As I watch opening ceremonies of 2021 Olympics I feel sad for Sha’Carri. But the games bring people of the world together not separated by race, religion,gender,identity. Only cannabis .","date":"Fri Jul 23 12:42:54 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Congress is slow as molasses in change. The citadel of cultural lag.\n\nFor so long, we've tried to end sentencing disparities for crack cocaine and it's just as insane that we haven’t yet descheduled marijuana. We must, at long last, end the War on Drugs. https://t.co/DqqotzrsG9","date":"Thu Jul 22 15:51:33 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"It feels like Groundhog Day that we’re still debating crack cocaine and the War on Drugs.\n \nIf we can get out of the forever war in Afghanistan, we can get out of the War on Drugs too. We need to see these issues as social and health problems, not throw millions into prison. https://t.co/z6oQi8Cqgt","date":"Thu Jul 22 13:52:01 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Mr. Foster it’s you who honored me. Your kids are cute as they can be and I joyed watching them dance and cheer for the Nats. Thank you for your support and your encouragement.@Donovan_foster","date":"Thu Jul 22 04:23:01 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Marijuana isn't a performance-enhancing drug unless you’re in a hot dog eating contest on Coney Island. To take away Sha’Carri Richardson’s dream to compete in the Olympics is absurd.\n \nLet’s get real! The War on Drugs is a total failure. Deschedule marijuana and end this war! https://t.co/VhkWRwZpxf","date":"Wed Jul 21 22:20:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"It was an honor to speak with the great two-time Olympic gold medalist, @EdwinMoses999, and I thank him for his important testimony on anti-doping in the 2021 #Olympics. https://t.co/Ivh9Kamunc","date":"Wed Jul 21 21:55:56 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"We cannot be silent in the face of corruption and tyranny. Kleptocrats and human rights abusers need to be named and shamed.","date":"Tue Jul 20 22:41:22 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Watching Dr. Fauci unequivocally shut down Rand Paul’s lies today is what I needed. https://t.co/RzfYM8199M","date":"Tue Jul 20 18:55:09 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Dr. Fauci to Senator Rand Paul: “You do not know what you are talking about, quite frankly, and I want to say that officially… If anybody is lying here, Senator, it is you.”\nhttps://t.co/ravbKMvFum","date":"Tue Jul 20 18:55:09 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Independent journalists and human rights defenders in Belarus have shown exceptional courage in the face of persecution and personal danger. Mr. Lukashenko must stop his aggressive intimidation tactics or risk further isolation and condemnation from the international community.","date":"Mon Jul 19 22:03:53 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"If we are going to address the climate crisis, we need to ensure that every new job created is contributing to climate health — not worsening the crisis.\n\nThe infrastructure package must include clean jobs in impacted communities.","date":"Mon Jul 19 18:01:36 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@petervemerson Indeed. In his 90’s and on all cylinders","date":"Mon Jul 19 16:02:18 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Here is a friendly reminder that the Biden #ChildTaxCredit, alongside help for restaurants, funding for state and local first responders, record job and wage growth and all other benefits of the American Rescue Plan were opposed by every single @HouseGOP: https://t.co/dpeXMySt18","date":"Mon Jul 19 16:00:12 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Putting Americans to work requires ensuring that people have everything they need to show up for a job.\n\nThat includes affordable child care and paid family leave. No infrastructure plan is complete without them.","date":"Mon Jul 19 15:15:50 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"More great music from #MEMPHIS","date":"Sun Jul 18 21:00:23 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Listen! Listen to Rev. James Lawson, a great spirit and soul of the civil rights movement, talk about and to Gov. Bill Lee of Tennessee, who fired our vaccine expert, who refuses to advocate for expanding Medicaid, but who has visited the border.","date":"Sun Jul 18 19:21:13 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"OP-ED: 10 priorities for Community Project Funding for FY 2022 https://t.co/euEiIEnhiu via @TSDMemphis #memphis #Tennessee","date":"Sat Jul 17 15:43:09 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@NB59705840 I have tried and will continue to advocate for vaccinations","date":"Sat Jul 17 15:19:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"My signature achievement as a state senator. 20 years from introduction to Law. Met much resistance but persevered. $6 billion for scholarships. Proud to say the least! #Memphis #Tennessee #Education","date":"Sat Jul 17 15:14:40 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"@TNLottery None would have happened without 20 years of pushing as state Senator with the razor thin 21 other senators votes in 2001 and the referendum in ‘02 and the legislation in ‘03. All hurdles you wouldn’t believe. And if it didn’t pass then it never would have!!\n$6 billion education","date":"Sat Jul 17 15:07:22 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"As someone who had #polio and has endured post-polio syndrome, it’s moving to see this statue of FDR unveiled on the 31st anniversary of the #ADA. ⬇️ Me at age 5 ⬇️ https://t.co/tUQrGyoG0F","date":"Sat Jul 17 13:47:57 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"FDR was the longest-serving president in history and he did it all in a wheelchair disabled by polio. Disabilities do not define people and Roosevelt is the perfect example of that. #ADA2021 https://t.co/BkgFKesOC4","date":"Sat Jul 17 13:18:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Complete Streets are crucial to improving the health, safety, and economy of our communities. Any bipartisan infrastructure bill should include funding to establish Complete Streets. Proud to lead this effort with @SenMarkey, @RepEspaillat, @RepRubenGallego, and @RepAuchincloss. https://t.co/wrr6fab1OM","date":"Sat Jul 17 00:39:21 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"The Child Tax Credit expansion could lift thousands of Memphians out of poverty. Unfortunately, the odds of Republicans voting to #BuildBackBetter are about the same as the University of Memphis tennis team playing football and beating Notre Dame. https://t.co/6EtpH7p3Ql","date":"Fri Jul 16 15:44:17 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Correction / errors ala @nytimes should have been : my pal Julian Bond not given presidential medal of freedom by O. Give him one @JoeBiden . #CivilRights hero ! No only in our civil rights movement of the 60’s +but protest of Vietnam draft and advocacy for #lbgt when rare.","date":"Fri Jul 16 13:24:35 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Btw:the other fellow in the photo is Jody Stephen’s, the last surviving member of Big Star.Another great band from #Memphis. Power Pop 🎸🎤.Ben Nichols has a little of Alex Chilton ( a song by the Replacements and a voice from God)and Zevon in him too. #rocknroll all night long!","date":"Fri Jul 16 13:14:17 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"My best pal, Zevon, snubbed by @rockhall of fame and @SongwritersHOF too. My @MLB hero and semi-pal Minnie Minoso snubbed by @baseballhall and by pal #CivilRights champion not given presidential medal of freedom. Like Rodney Dangerfield we get “no respect.”","date":"Fri Jul 16 13:03:30 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"No but Lucero’s John Stubblefield told the #Memphis crowd that vaccinations were a precursor to more concerts! Bands have been in hibernation as have fans.Get your shot to let your rah rahs and ya ya’s out!!🎼🎹🎤#rocknroll","date":"Fri Jul 16 12:50:25 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Just listened to John Bolton on @CNN. He is the new Rumsfeld.Never wrong but rarely right . War for others but cowardice for self. Money for book over duty to warn of a danger in the White House. Get lost!","date":"Fri Jul 16 12:42:06 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Introduced my friend,Ben Nichols and his country rock band,Lucero,tonight at the Levitt Shell in #Memphis.Nothing like a good rock show under the stars in Overton Park.They played their tribute song,”Went looking for Warren Zevon’s Los Angeles”and a bonus “lawyers,guns,and money” https://t.co/UUNnSOYlzT","date":"Fri Jul 16 03:42:00 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Today I had the pleasure of meeting with families in Memphis to discuss the #ChildTaxCredit. The CTC will give working class families the support they need to get back to work and build better lives for their families. #BuildBackBetter","date":"Thu Jul 15 22:00:05 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"Listening to the pundits on @cnn @msnbc about Trump being unfit person for #POTUS. I told them and all that he was a misfit,joining John Lewis in not attending inauguration or stofu addresses and warning of the coming post election chaos.Impeachment leader and harbinger of terror","date":"Thu Jul 15 12:24:42 +0000 2021","user_id":"162069635"},{"handle":"RepCohen","text":"via ⁦@nytimes⁩ .This should be a bi-partisan unanimous voice vote BUT there are enough “ just say no” deadheads among Republican base to make it unlikely to pass.Trump didn’t try to reform pot laws though he knew it’s not as dangerous as alcohol. https://t.co/7bBMAG2U8k","date":"Wed Jul 14 23:49:28 +0000 2021","user_id":"162069635"}]