[{"handle":"RepDeanPhillips","text":"As we work to tame inflation, promote growth, and inject fiscal responsibility into our governance, I’m pleased to have been named a 2022 Fiscal Hero by @BudgetHawks &amp; @FixtheDebt - one of 7 House Democrats to make the list.","date":"Fri Jun 17 13:04:52 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"With inflation hurting millions of American families and small businesses, today I joined @RepSpanberger and others to encourage our Republican colleagues to vote YES on the “Lower Food &amp; Fuel Costs Act” tomorrow and bring much needed relief to those struggling to make ends meet. https://t.co/2I1sXB5etG","date":"Wed Jun 15 21:52:15 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A beautiful tribute to a remarkable young woman. Please share your love and prayers with the Casten family, and live brightly.","date":"Wed Jun 15 21:24:02 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"No matter your politics, please send love and prayers to Rep. Sean and Kara Casten, who lost their precious daughter, Gwen this morning. May her memory be for a blessing.","date":"Tue Jun 14 01:39:42 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@emm_257 Yes.","date":"Sun Jun 12 20:14:56 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The facts won’t help American families suffering from obscenely high gas prices, but perhaps they’ll quiet the ignorant and misinformed. Domestic oil production is HIGHER under President Biden than during the former president’s term. #truth https://t.co/DJdysaL91B","date":"Sun Jun 12 20:12:54 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Cooperation is the foundation for progress. Is it comprehensive? No. Will it save and improve lives? Most likely.","date":"Sun Jun 12 16:27:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The House chamber wasn’t breached, and the House Sgt at Arms reported to @SpeakerPelosi on Jan 6. The Senate chamber was breached, and the Senate Sgt at Arms reported to GOP @LeaderMcConnell on Jan 6. And then there’s the heroism of the former president that day. #TwilightZone","date":"Sun Jun 12 15:47:48 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My bipartisan Porch Pirates Act would make theft of packages a federal crime…at least by humans. h/t @RepSchneider https://t.co/K2HDoKBmTI","date":"Sun Jun 12 14:56:47 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"You decide.","date":"Fri Jun 10 02:57:08 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Tonight has changed my perspective. I pity the insurrectionists - 892 of whom have been charged with crimes. My malice is directed towards the former president and his gang who inspired, enabled, and then whitewashed the attack - yet still walk the halls of Congress &amp; Mar-a-Lago. https://t.co/SjCcp1qbCw","date":"Fri Jun 10 01:42:45 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We sat together in the Capitol to bear witness to the certification of the 2020 election on Jan 6, 2021. Seventeen months later, the Gallery Group reconvenes to learn who was responsible for the attack, and work to ensure it never happens again - under any president or any party. https://t.co/uWhc3tkUag","date":"Fri Jun 10 00:07:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’ll vote to enhance protection for our justices in a heartbeat. You ready to act on gun massacres, insurrectionists, QAnon, and promoters of big lies? \n\nI didn’t think so.","date":"Thu Jun 09 17:28:00 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I agree we need to better protect justices, but we’d like to see gun massacres and insurrection generate equal outrage, @GOPLeader.","date":"Thu Jun 09 16:28:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I agree.","date":"Thu Jun 09 02:16:56 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"He’s right. We didn’t ban planes. We ensured that only pilots could operate them.","date":"Thu Jun 09 01:25:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This evening we passed and sent to the Senate a set of 7 measures that will save countless lives and reduce gun massacres in our streets, schools, theaters, and houses of worship. Despite inexplicable opposition, we will not stop trying to pass common sense solutions into law.","date":"Thu Jun 09 01:09:51 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@PaulsMovieTrip @LauraDern Laura is the best!","date":"Wed Jun 08 16:43:23 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Jim Ramstad was a principled and courageous Republican who voted for the 1994 Crime Bill because he knew gun safety is a common-sense approach to fighting crime. Today, his widow, Kathryn, and I ask Congress to once again take action, not sides, to save lives. #EndGunViolence https://t.co/3XrfA7DmHa","date":"Wed Jun 08 16:41:06 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s #NationalGunViolenceAwarenessDay - if you weren’t already aware. Thoughts,tweets, and prayers don’t save lives, ACTION saves lives. And next week, that’s exactly what we plan to do. https://t.co/DSH5aZFG93","date":"Fri Jun 03 14:48:19 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Are you one of the 23+M Americans who had a delivery stolen during the pandemic? #PorchPirates pillage 1.7M packages every day, and if delivered by private carriers, shoppers have little recourse. Thanks to 42 Rs and Ds who have joined my bill to make ALL package theft a crime. https://t.co/70xSuV3lOc","date":"Thu Jun 02 20:21:51 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The madness has reached a point where mass shooting victims have to be rushed OUT of the hospital.","date":"Thu Jun 02 03:00:43 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Behold the moms of @MomsDemand.","date":"Thu Jun 02 02:44:34 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"An inspiring piece by ⁦@DrTedJ⁩ as we reflect on what unites us as Americans on Memorial Day. https://t.co/b9fuyNaGoP","date":"Mon May 30 14:25:35 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Over 1.3 million Americans have died while serving in our armed forces, including my dad, Artie. They gave their lives so that we may be free. As we honor them on Memorial Day, let’s unite in a spirit worthy of their sacrifices. https://t.co/MFRXnH048j","date":"Mon May 30 12:53:06 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@IndpRestaurants We won’t give up.","date":"Sat May 28 17:23:26 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"There’s nothing more EVIL than propagating the depraved notion that proponents of gun violence prevention want or enable massacres. For goodness’ sake.\nh/t @politico https://t.co/eMq4bOHPI4","date":"Sat May 28 14:25:30 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A friendly reminder: The Senate is comprised of 48 Democrats, 50 Republicans, and 2 Independents, and it takes 60 votes to move a bill to the President. If anything's going to get done on gun violence, or anything for that matter, it's only going to get done with bipartisanship.","date":"Fri May 27 18:09:28 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We spend $800b on defense and just sent $40b to Ukraine. We have the resources to begin securing public schools over summer vacation AND agree to common sense policies to stop deranged people from acquiring weapons of mass human destruction by the time school resumes this fall.","date":"Fri May 27 16:28:03 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Never imagined I’d become a Yankees fan.","date":"Thu May 26 22:56:55 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"May we convert it to a solutions generator.","date":"Thu May 26 17:12:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We stare at photos of the smiling children hours before their horrifying murders.\nWe stare at photos of the depraved monsters who commit the massacres.\nMaybe it’s time we stare at images of the grisly aftermath - just as 1,000s of students have had to do.\nMaybe then we’ll act.","date":"Thu May 26 15:42:58 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We all know there are 1,000s of aggrieved young men in possession of legally obtained AR-style rifles, ammunition, and body armor - and ready to snap. We know the next massacre is probably just days or weeks away. So let’s put our heads together and at least try to save lives.","date":"Thu May 26 15:10:40 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"On the 2nd anniversary of George Floyd’s murder, the day after a slaughter of children and teachers in school, and a week after the massacre of shoppers in a grocery store, let’s call on our better angels and address America’s ills with empathy, decency, and justice for all.","date":"Wed May 25 21:25:45 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We dedicate over $800 billion annually, more than the next eight nations combined, on defense from foreign threats. I say it’s time to dedicate the same energy and intention necessary to protect our children and families from domestic threats.","date":"Wed May 25 13:21:01 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m a gun owner. Do not tell me our Founders conceived of this carnage when they wrote the Constitution. Do not tell me they would have tolerated this madness. Do not tell me that teachers must be armed. And do not tell me your AR15 is worth more than another 14 children’s lives.","date":"Tue May 24 21:05:19 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Parents kissed their kids this morning after breakfast, wished them a good day, and they’ll never see them again. Shot to death in school. IN SCHOOL! Only in America does this carnage happen. Every damn month. May their memories be for a blessing and may we stop this madness.","date":"Tue May 24 20:15:49 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If we wish to protect the truth, we must protect the journalists who risk their lives to uncover it for the world. Should this report be true, I condemn the killing and inexcusable lack of transparency, and expect those responsible to be held to account.","date":"Tue May 24 19:38:25 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Officers like Emily Jepson of the @EdinaPolice, with whom I recently rode along during one of her shifts. Her principled and compassionate service is exactly what America should be celebrating.  https://t.co/eZ6CzIDzah","date":"Tue May 24 17:38:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We must recruit a new generation of principled Americans from diverse backgrounds to protect and serve our communities. Gratitude to my 5 Republican and 4 Democratic colleagues who’ve signed on as original co-sponsors of my bill to do so. #bipartisan https://t.co/3c6FW4kQvq","date":"Tue May 24 16:37:45 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Americans of all ages and politics should watch this in its entirety before the consequences of ignorance, moral corruption, and false prophets make other issues of the day seem petty by comparison. https://t.co/3cGg3xXsZf","date":"Mon May 23 16:21:27 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Democracy will prevail in The United States of America.","date":"Sun May 22 15:38:01 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"From my father who served in the Army in Vietnam to these remarkable men and women serving on the Navy’s @USSHARRYSTRUMAN, I salute all who’ve made great sacrifices to defend the United States and freedom for over two centuries on #ArmedForcesDay. https://t.co/LLavLufLeb","date":"Sat May 21 13:15:27 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Truth: There are thousands of unused leases in the USA and little stopping oil companies from drilling more domestically - other than financial risk intolerance and a love of high market prices. That’s how they earned ~$300 in PROFIT off each of America’s 228mm drivers last year.","date":"Fri May 20 22:19:04 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"All true. Americans enjoy some of the lowest prices in the world. But most families can’t absorb the extra $1,000+ annual cost, let alone a $500 car repair. It’s time to seriously consider a middle income tax cut &amp; ensure America’s wealthiest people &amp; businesses pay a fair share.","date":"Fri May 20 22:08:59 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The best tools available to reduce inflation and ease the worker shortage is to reduce trade barriers (tariffs) and reform our immigration system. Congress and the Administration can achieve both, but we need our leaders to forgo politics in favor of problem solving.","date":"Fri May 20 21:46:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Last night, before traveling, I tested positive for COVID-19. I’m vaccinated, boosted, experiencing mild symptoms, and will isolate in Washington according to CDC and House Physician guidance. Stay safe, get vaccinated, and order your free test kits at: https://t.co/R0El3u5oN1","date":"Fri May 20 15:22:20 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What an ignorant and despicable message. Investigating an insurrection inspired and enabled by a defeated president and vice-chaired by one of the nation’s most prominent, conservative Republicans is principled - not partisan.","date":"Fri May 20 13:13:56 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Yesterday, Senate Republicans blocked our $48 billion small business relief measure for hard-hit American entrepreneurs just hours after approving $40 billion in aid for Ukrainians. Think about that for a minute. #RRF","date":"Fri May 20 10:54:21 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Certain votes separate the wheat from the chaff, and this crew is 100% gluten free.","date":"Thu May 19 11:16:02 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This morning, I joined a small, bipartisan group of colleagues to introduce a resolution urging the Biden Administration to immediately invoke the Defense Production Act to increase production of baby formula. This evening, the White House announced it will do just that. https://t.co/LP6TmKIoa0","date":"Wed May 18 23:31:51 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Days after a white nationalist massacred black Americans in Buffalo, I’m on the floor of the US House for debate of the Domestic Terrorism Prevention Act and am flabbergasted by the depths of ignorance and de-facto enabling of hate by certain members of our Congress.","date":"Wed May 18 23:11:47 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@HeyButtHead2 While I agree the wealthiest Americans and most successful enterprises must pay their fair share, only competition can ensure the lowest prices, highest quality, and ample supplies of the goods and services on which we rely.","date":"Wed May 18 16:17:44 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"America is great when America is good. So let’s turn-up the good.🇺🇸","date":"Wed May 18 16:00:39 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We just passed my amendment w/@RepSherrill and @RepDeborahRoss to the Workforce Innovation and Opportunity Act! It directs One-Stop Career Centers to include information on entrepreneurship in their career and training services. Find one near you: @Career1Stop","date":"Tue May 17 19:42:40 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Sofie and Henry remind all of us to keep the faith. https://t.co/2WNYtEkbSV","date":"Tue May 17 17:31:26 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The United States of America should implement a non-partisan redistricting process to generate more political competition, not less, and protect voters, not incumbents.","date":"Tue May 17 12:40:40 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Good news for parents and infants. Abbott will be resuming production within two weeks, and safe formula will soon be back on the shelves. Now we must ensure there’s enough competition and domestic manufacturing capacity to prevent such supply crunches from occurring again.","date":"Mon May 16 21:53:18 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Condemning white supremacy and nationalism isn’t leadership. Punishing and delegitimizing those who enable it and propagate it is leadership. Anything less is weak and morally repugnant.","date":"Mon May 16 17:19:27 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What good are caps on individual contributions when candidates increasingly outsource their campaigns to Super PACs and independent expenditure committees? What an abhorrent, corrupt, and anti-democratic system the political duopoly protects and enables. https://t.co/nerjOsdrzz","date":"Mon May 16 17:06:15 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Fairness matters. Yet today, certain members of Congress who eagerly took taxpayer $$ to save their own businesses during the pandemic had the audacity to vote against refilling #RRF and supporting America's smallest, struggling businesses. Despite such dishonor, we got it done. https://t.co/XLW5q18om5","date":"Fri Apr 08 00:18:35 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m as heartbroken by the tragedy in Buffalo as I am disgusted by its cause. No human being is born to hate. They’re taught to hate. And the groomers of hate will have blood and shame on their hands for eternity.","date":"Sat May 14 22:27:54 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"1. Your tweet is undignified, disgusting, and dangerous. “Pedo grifters”?\n\n2. Abbott VOLUNTARILY issued a recall for safety reasons.\n\n3. Of course it’s URGENT to replenish supplies.\n\n4. If the gov’t intervened in the production &amp; distribution of formula, that’s called SOCIALISM.","date":"Fri May 13 20:41:01 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Ultra sensible &gt; ultra woke &gt; \nultra maga","date":"Fri May 13 20:12:12 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s Go Brandon! https://t.co/11uDxopcaQ","date":"Thu May 12 12:16:00 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Hunker down, #MN03. Be smart and stay safe.","date":"Thu May 12 01:19:58 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As we assist so many around the world, we cannot break a promise to American small businesses who’ve been desperately awaiting relief for over two years. The House passed our bill last month and we need the Senate to join us in fulfilling a promise. 🇺🇸  https://t.co/qwbaGy6BK9","date":"Wed May 11 18:56:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"🤞🏼","date":"Wed May 11 16:14:44 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Investing in entrepreneurship is investing in America. Pleased to co-lead this bipartisan &amp; bicameral effort to promote and support entrepreneurship among underserved students whose dreams will fuel job creation through the 21st century.","date":"Wed May 11 14:44:34 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"No. This moment has to be a call to elect more people committed to protecting freedom of choice, privacy, and human rights.","date":"Tue May 10 12:33:34 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"While civility and cooperation aren’t in style at the moment, I’m proud to be the 13th most bipartisan of the 435 members of the United States House of Representatives. 🇺🇸","date":"Sun May 08 15:04:10 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Happy #MothersDay to all the moms out there, particularly this amazing one. ❤️ https://t.co/KSGFQLYyv2","date":"Sun May 08 14:53:47 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"No surprise. A Fox News poll confirms almost 2/3’s of Americans favor the preservation of a liberty affording women the right to make their own decisions about their health and futures rather than the government. #choice","date":"Wed May 04 15:47:47 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to see US Attorney Luger prioritize crime fighting and prosecuting violent criminals  - including carjackers - to the full extent of federal law.","date":"Wed May 04 13:38:56 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The impending destruction of women’s rights protected by Roe v. Wade is a direct result of recent changes to Senate rules. It’s time to modify those rules again, abolish the filibuster, and allow majorities to effect fundamental representation. Do you agree?","date":"Tue May 03 15:17:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m among the ~70% of Americans who support the protections of Roe v. Wade. Our nation has never experienced nor can ever accept such a dangerous erosion of freedom, liberty, and privacy. We must codify it into law using every tool our founders afforded the Congress. #prochoice","date":"Tue May 03 14:32:04 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Well-deserved relief for Minnesota’s frontline workers and small businesses. Thank you, @GovTimWalz, and all in our state legislature who voted in favor!","date":"Mon May 02 17:02:53 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We celebrated this remarkable man today. A Minnesota treasure. A national treasure. #WalterMondale https://t.co/86NZ3DOmP5","date":"Mon May 02 03:10:26 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Flew home today to celebrate the life of Minnesota treasure, Walter Mondale, with another Minnesota treasure, @NormOrnstein, and he pulls his treasured and tattered 1965 World Series ticket stub from his wallet - the first year Mondale served in the Senate. ⚾️ https://t.co/8UIIL39oCJ","date":"Mon May 02 02:03:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The accelerating erosion of respect and dignity isn’t just a stain on our Congress, it’s a danger to America and anti-patriotic. https://t.co/jOMiACdy2y","date":"Thu Apr 28 18:53:18 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Not sure about the midterms, but tonight Democrats took home the Congressional Soccer Trophy in a 5-3 thriller at @AudiField - thanks to Coach @TonySanneh!⚽️🏆 https://t.co/wMoZZ01MzS","date":"Thu Apr 28 01:20:33 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The secret is finally out. https://t.co/cFEBv5ulC5","date":"Wed Apr 27 00:24:30 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepMeijer I agree. Here are my dogs, Pete. https://t.co/eR9yIDEGzz","date":"Tue Apr 26 02:04:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":".@elonmusk is paying over $100 for each of our ~400,000,000 accounts. Freedom of speech has no cost, but freedom of reach is quite expensive.","date":"Mon Apr 25 19:05:33 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s distasteful when former Presidents, Prime Ministers, or Legislators, convert their public “service” into immense financial success. And yes, that goes for each former living American president, with the exception of Jimmy Carter.  https://t.co/wpD1PgCj8T","date":"Sat Apr 23 22:12:13 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If I told you there was a political party banning books, retaliating against companies, propagating dangerous lies, ensuring weapons of war are easily acquired by just about anyone, and inspired a violent assault on a national capitol, would you ever believe it was in America?","date":"Sat Apr 23 18:01:24 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Madison Cawthorn can wear womens’ lingerie every day if he chooses. It’s a free country. Just stop the sanctimony, hypocrisy, projection, and shaming of others who simply wish to be their authentic selves, too.","date":"Fri Apr 22 23:19:54 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We didn't leave the Stone Age because we ran out of rocks, we found a better way of doing things! I'm optimistic this #EarthDay because Americans of all political persuasions are waking up to the challenges - and opportunities - of climate change. Let's keep the momentum going:","date":"Fri Apr 22 21:42:14 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to join @RepTedLieu and colleagues on the @HouseForeign Affairs Committee imploring the @StateDept to consider all evidence as it determines Russia’s possible designation as a state sponsor of terrorism.","date":"Fri Apr 22 15:56:17 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Justin Amash is an honorable conservative/libertarian who had a front row seat to Kevin McCarthy’s leadership. Politics aside, it’s in America’s foundational interest for both major parties be led by people of principle.","date":"Fri Apr 22 15:50:50 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"That Kevin McCarthy lied isn’t news. He does that all the time. It’s projecting his own shame on the journalists who reported the truth that’s unforgivable.","date":"Fri Apr 22 03:08:19 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"#MN03, where people are respected no matter their race, religion, orientation, or identity, is already home to America’s largest tourist draw, the ⁦@MallofAmerica⁩. A ⁦@Disney⁩ park would look awfully nice right next door. Especially in summer. https://t.co/wSk5mb5vCG","date":"Thu Apr 21 21:47:31 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Salutations to the 9 members of the Minnesota Police Officers Standards Board for voting to approve an important rules change. The public deserves explanations from each of the 3 members who voted against it.","date":"Thu Apr 21 18:51:19 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Would be nice if this award drew as much interest as the Oscars, Emmys, Grammys, and Espys. #ProfileInCourage","date":"Thu Apr 21 13:07:40 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I applaud ⁦@GovTimWalz⁩ for his leadership on tackling the unemployment insurance issue. Minnesota’s small businesses are the economic and social backbones of our communities, and they need our support. https://t.co/r5LWn1e5FJ","date":"Thu Apr 21 12:52:32 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@andybrehm No, Andy. I don’t. But I’m afraid the pandemic isn’t over for everybody and we must find some path to repair and respect in the (likely) case a dangerous variant re-emerges.","date":"Thu Apr 21 02:09:22 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Kudos to Michigan state Senator @MalloryMcMorrow for such eloquent indignation. https://t.co/SawcPMJDmi","date":"Tue Apr 19 20:35:22 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I hate masks as much as I hate mandates, but I respect and appreciate public servants who’ve dedicated their lives to protecting ours. I’ll continue to wear mine on public transit through May 3rd - as the CDC recommends we do to protect those who are far more at risk than me.","date":"Tue Apr 19 20:20:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"That’s why I say real patriots look out for their fellow citizens’ health &amp; safety. I hate mandates. If you’re sick, stay home. If you’re sitting next to an immunocompromised person, wear a mask. If there’s someone with a peanut allergy on board, don’t eat peanuts. Basic respect.","date":"Tue Apr 19 12:50:38 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s get something straight. It is not a constitutional right to knowingly put other Americans’ lives at risk. In fact, in most cases that’s a crime. Law and order kind of stuff.","date":"Tue Apr 19 02:36:01 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The mask requirement wore on all of us, particularly those employed in transportation. Ending it is certain to increase spread, increase illness, and increase deaths. That’s a fact. Patriots look out for their fellow Americans’ well-being and don’t mask shame. That’s also a fact.","date":"Tue Apr 19 02:08:28 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"High functioning organizations become so by building strong benches and limiting the tenure of leaders, usually ~10 years. No matter which party controls Congress in ‘23, we should adopt term limits for committee chairs &amp; get serious about developing a new generation of leaders.","date":"Mon Apr 18 14:39:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Chag Sameach and Happy Easter to all who are celebrating this weekend. May the lessons of each holiday inspire gratitude for our blessings and decency and compassion towards one another.","date":"Sun Apr 17 14:35:32 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Steve_Shu I had a (partial) mullet before they were cool. Which made me particularly uncool.","date":"Sun Apr 17 13:32:20 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I see someone I know 👀","date":"Sun Apr 17 13:25:55 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Withdrawing from non-partisan Presidential debates seems to indicate that it may no longer be about the issues.","date":"Fri Apr 15 02:46:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"MN is the 3rd most expensive state for child care, a problem for our people and our economy. If you’re a parent, child care pro, employer, or curious neighbor, I invite you to join us in learning more about what’s driving costs – and what we can do abt it. https://t.co/qDfuSF3Qdz","date":"Wed Apr 13 23:23:00 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Correction: late 19th century.","date":"Wed Apr 13 20:33:28 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My family escaped the Russian pogroms of the late 18th century and were granted refuge in the United States of America. Today, 120 years later, I was sanctioned by Russia for opposing the very genocide, authoritarianism, and tyranny I promised my great-grandparents I would fight. https://t.co/fzFFP7CfjB","date":"Wed Apr 13 20:28:45 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@FerrariniKathy @IndpRestaurants If you were in the approved for #RRF queue but had to close, you can still obtain funding as long as you re-open your business within six months of receipt. But first, we need the Senate to pass it and send it to the WH for signature.","date":"Sat Apr 09 21:00:54 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Mike Gibbons, Ohio GOP candidate for US Senate, parrots @SenRickScott’s contention that middle income Americans aren’t paying their “fair share” of income taxes. Raise your hand if you believe it’s the wealthiest Americans who aren’t paying a fair share.🤚 https://t.co/RFZf5GtlJ6","date":"Sat Apr 09 19:45:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Fairness matters. Yet today, certain members of Congress who eagerly took taxpayer $$ to save their own businesses during the pandemic had the audacity to vote against refilling #RRF and supporting America's smallest, struggling businesses. Despite such dishonor, we got it done. https://t.co/XLW5q18om5","date":"Fri Apr 08 00:18:35 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What a beautiful and long overdue moment in American history. Congratulations, Judge Jackson!","date":"Thu Apr 07 23:14:02 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A bunch of @LifeatBlake Bears and @edinahornets Hornets swarmed the Capitol today and made me awfully proud to represent the most extraordinary students in the nation. America is in good hands with our next generation! https://t.co/IgpfkII64R","date":"Thu Apr 07 22:42:49 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We promised small businesses that we would distribute relief on a level playing field, that there would be no special treatment for the wealthy or well-connected, and that their government would not pick winners and losers. We just passed #HR3807 to claw-back fraud and #MakeGood. https://t.co/h7dsPX6od3","date":"Thu Apr 07 16:19:52 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Shortly we will debate and vote on the long-awaited measure to refill the #RRF and support small businesses most impacted by the pandemic. Tune in to @cspan at 9:15a EST and follow along as I make the argument for small businesses and the universal American principle of fairness.","date":"Thu Apr 07 12:12:07 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Can you imagine voting against reporting and preserving evidence of Putin’s war crimes? Can you imagine?","date":"Thu Apr 07 00:33:50 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Another domestic terrorist locked-up. A Texan who fired 13 rounds into the Minneapolis Police Third Precinct during the riots of May 2020, looted the building, and helped set it on fire.","date":"Wed Apr 06 11:57:11 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Hard to imagine being American and voting against democratic resilience or NATO’s foundation of democracy. Real patriots favor both.","date":"Wed Apr 06 02:31:27 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"On Thurs, we will vote to replenish the #RRF, support other small employers forced to take on massive debt to survive the pandemic, and pay for it with $$ clawed-back from fraudulently obtained PPP loans - $$ intended for these business in the first place. It's time to #MakeGood https://t.co/SXFYSCruZ6","date":"Wed Apr 06 00:22:18 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Camilla’s cookies always bring a dose of unity to @HouseForeign Affairs Committee hearings. #SlavaUkrayini https://t.co/oXgnzMRFsB","date":"Tue Apr 05 15:10:48 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Few members of Congress embody the civility, intelligence, and integrity of @RepFredUpton. Congress and our country are losing an important, principled voice, and I a wonderful friend.","date":"Tue Apr 05 14:37:23 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@MrAndersonGov @RepTomEmmer Me too!","date":"Mon Apr 04 18:05:39 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I will not post photos of the shocking depravity of Vladimir Putin and his pathetic Russian army killing civilians during their embarrassing retreat from Kyiv Oblast, but I will do everything I can to ensure these despicable war criminals feel the full force of Earthly justice.","date":"Sat Apr 02 22:14:38 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The United States is a representative democracy in which ~70% of citizens favor the decriminalization of cannabis. Hard to explain how 204 Members of Congress, mostly Rs and a couple Ds, can ignore the will of the people, defy common sense, and maintain such hypocrisy.","date":"Sat Apr 02 17:54:45 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What better way to celebrate the passing of the MORE Act to decriminalize marijuana than a “high”five?","date":"Fri Apr 01 20:09:33 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Diabetics can’t survive without insulin and some are dying because they can’t afford it. It’s our damn job to save Americans’ lives.","date":"Thu Mar 31 18:48:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Americans shouldn’t have to travel to Mexico or Canada to obtain insulin at an affordable price. I salute my friend @RepAngieCraig for her leadership in passing the Affordable Insulin Now Act to cap costs at $35/month and continue our mission to lower costs for American families.","date":"Thu Mar 31 18:19:04 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"And a booster shot of civility.","date":"Mon Mar 28 13:34:40 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The obnoxious episode on the Oscars stage last night encapsulates the very mean-spiritedness and erosion of self-control that are spreading in our streets, our schools, and our society. Both are diseases for which we need a moral vaccination.","date":"Mon Mar 28 13:31:55 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m just proud to represent a political party and work with colleagues on a mission to protect democracy, human beings, and the planet.","date":"Sun Mar 27 01:49:30 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"There’s just no ambiguity about how unethical this is.","date":"Fri Mar 25 03:27:19 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"How do sanctions on Putin’s inner-circle work? Here’s how:","date":"Thu Mar 24 19:29:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"📷: AP Photo/Andrew Harnik","date":"Thu Mar 24 12:18:33 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"No matter how disrespectful the treatment by some of the most powerful men in the world, all is good when your daughter is proud. https://t.co/Er9pF08zZs","date":"Thu Mar 24 12:17:33 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":".@SenSasse hits the nail on the head about how cameras inspire the “jackassery” that’s becoming a hallmark of Congressional hearings and a stain on our country. https://t.co/X9Nsm9QmM4","date":"Wed Mar 23 20:57:24 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"America has lost one of its great stateswomen. May Madeleine Albright’s memory be for a blessing, and may her dedication to diplomacy inspire future generations to pursue such a noble path.","date":"Wed Mar 23 18:47:26 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Mo Brooks, a general in the big lie army, loses his endorsement and finally says the quiet part out loud. https://t.co/HaWdukUNw0","date":"Wed Mar 23 17:36:04 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Senate Judiciary Committee has become an episode of Who Wants to Be a Mega Jerk.","date":"Wed Mar 23 13:02:44 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The faith that matters most isn’t that of Judge Jackson, rather that placed in Members of Congress to support and defend our Constitution and act like decent, principled human beings.\nhttps://t.co/OX174BUG2Y","date":"Tue Mar 22 16:18:34 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Faith is important to me and most Americans. But just as questions about one’s religion are off limits in job interviews, they should also be off limits in Supreme Court nomination hearings. After all, our founders intentionally separated church from state in America.","date":"Tue Mar 22 14:54:04 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Every public school in the nation should make passage of a civics test a requirement for graduation and publish its results.","date":"Tue Mar 22 12:57:39 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"🙋","date":"Mon Mar 21 22:07:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to join @SenAmyKlobuchar and city and state officials to celebrate our work together to bring $1 million in federal funds to the Brooklyn Park Small Business Development and Incubation Center which will help create and nurture new businesses, jobs, and self-sufficiency. https://t.co/NPZa571ZSn","date":"Sun Mar 20 19:52:57 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s all be kindergarteners.","date":"Sun Mar 20 17:00:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I joined @esmemurphy on WCCO this morning to discuss the depravity of Vladimir Putin, the absurdity of \"denazifying\" Ukraine, and why small businesses in Minnesota and around the country still need - and deserve - financial support to survive the pandemic. https://t.co/nLb6xCkyKU","date":"Sun Mar 20 16:01:32 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"First elected in 1973 during the Nixon Administration, Rep. Don Young was the dean of the Congress and the longest serving Republican in history. His fiercely independent voice for Alaska and one of a kind wit and character will be missed. Rest in peace, Don.","date":"Sat Mar 19 01:27:37 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@repmarkpocan Henry concurs with the gentleman from Wisconsin. https://t.co/GE8szSG7pD","date":"Fri Mar 18 20:38:00 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Arnold is one of 22 people that Vladimir Putin follows on Twitter.","date":"Thu Mar 17 23:11:24 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The truth in political advertising: 'You're allowed to lie'. Perhaps it’s time for America to protect voters the same way we protect consumers from false and misleading advertising. Who agrees? https://t.co/ixkW6FcIcA","date":"Thu Mar 17 22:04:55 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Spread this far and wide. Every view by a Russian soldier or citizen helps pave the path to truth. And peace.","date":"Thu Mar 17 17:58:31 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It's not enough to pay lip service to these small businesses. Read my letter w/@RepMikeQuigley and 42 colleagues here: \nhttps://t.co/4WWdvnje0U","date":"Thu Mar 17 17:36:03 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Restaurant owners and lovers, I hear you. We must fix the gaps in previous pandemic programs, with a focus on hard-hit industries. A good place to start? Making good on our promise to 175,000+ #SmallBusiness owners who applied for RRF but never received support. #SaveRestaurants","date":"Thu Mar 17 17:21:31 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@HouseSmallBiz PPP and RRF were bipartisan acknowledgements of Congress's duty to support small businesses during the pandemic's economic fallout. That work isn't finished. We must apply lessons learned to an urgent, targeted program for industries still reeling. #SaveSmallBiz #SaveRestaurants https://t.co/13uCKEnrOn","date":"Wed Mar 16 19:03:55 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"WATCH LIVE: I am chairing a @HouseSmallBiz hearing on the Paycheck Protection Program, lessons learned, and what's next for small business struggling from the pandemic https://t.co/FnfeSC0vXw","date":"Wed Mar 16 14:03:50 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"That video. What kind of man, what kind of depravity, what kind of soldiers, and what kind of country indiscriminately kills innocent civilians and children? America and the free world must meet this moment.","date":"Wed Mar 16 13:25:18 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I honor the world’s journalists who risk, and too often lose, their lives on the mission to promote truth over propaganda. The abominable and inexcusable cost of an unnecessary war. May your memory be for a blessing, Pierre Zakrzewski.","date":"Tue Mar 15 16:21:40 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":".SBloomRaskin has always received bipartisan support in her previous federal roles. It’s shameful to oppose her nomination to the Fed over her factual position that climate change poses economic risk to America. That’s not radical, it’s reasonable.https://t.co/MR6TRVnCjh","date":"Mon Mar 14 21:56:55 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"\"No war...Don't believe the propaganda. They're lying to you here.\" #courage #truth","date":"Mon Mar 14 20:36:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Congrats on a well deserved honor, Sheletta! #MNWomanOfTheYear","date":"Sun Mar 13 21:28:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"19,000 at The X tonight witnessed one of the all time great Minnesota high school hockey championship games. Congrats to Andover on a 6-5 2OT victory, and to a Maple Grove team that played their hearts out. #StateOfHockey https://t.co/H51xdsCEBJ","date":"Sun Mar 13 04:17:47 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Lawmaking and sausage-making aren't fast or pretty, but the process can yield extraordinary results. Restaurants are the social, cultural, and economic hearts of our communities, that’s why @andrewzimmern and I are on a mission to #SaveRestaurants - and make some great sausage. https://t.co/HrqkvQxR7l","date":"Wed Feb 23 21:29:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Last night, I voted to fund our police &amp; public safety, Head Start and Pell Grants, fight opioid addiction, reauthorize the Violence Against Women Act, ban Russian oil, send aid to Ukraine, and bring $17mm home for #MN03 community projects. It was a good evening for America.","date":"Thu Mar 10 12:14:12 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@mark_pottersr I agree. Not either/or, it’s AND.","date":"Wed Mar 09 20:09:09 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As a Gold Star son who lost his dad in Vietnam, I know there are tens of thousands of Russian sons, daughters, mothers, fathers, and wives wondering why their fathers, sons, and husbands are dying in a war with no clear purpose, principle, or possibility of success. https://t.co/Mg5LtXjQQR","date":"Wed Mar 09 19:34:05 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Putin’s War exposes the uncomfortable truth that most nations, including our own United States, are often forced to compromise their principles and values due to a reliance on oil. We must immediately unite behind renewable energy independence as an issue of national security.","date":"Wed Mar 09 19:11:57 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This thread about the “butterfly mines” Russia is dropping on Ukraine and their particular risk to children is horrifying. Putin’s depravity is diabolical and any person or nation enabling him is complicit.","date":"Wed Mar 09 12:41:20 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I celebrate the American enterprises placing purpose above profit by pausing their operations in Russia. Business is a means to an end, and that end should always be justice.","date":"Wed Mar 09 12:36:48 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@chefdianastaley @IndpRestaurants This isn’t over. And I’m not giving up.","date":"Wed Mar 09 00:58:25 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Super70sSports The Haunted House at Disneyworld.","date":"Tue Mar 08 21:57:44 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s #InternationalWomensDay, so come by our office and add an amazing woman to our wall of honor! https://t.co/5hYtNBWAL0","date":"Tue Mar 08 21:49:02 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Outstanding news that Poland will share its Russian fighter jets with Ukraine and is urging other NATO members to do the same. Every hour counts.","date":"Tue Mar 08 20:24:09 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Republicans appropriately argue that government should never pick winners &amp; losers. But the underfunded #RRF did just that. I’ve advised the White House and Speaker Pelosi this is my highest priority, and I will not rest until we pass a “make good” measure. @IndpRestaurants","date":"Tue Mar 08 20:20:48 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@parknrecdir @JuliKay206 Thanks, Jay. Good info for everyone in #MN03 passing through @CityofEP!","date":"Tue Mar 08 19:25:10 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Today we’ll ban the importation of Russian oil. Today we should also increase output in America. And today we must commit to an EV and renewable energy future. It’s not an either/or, it’s an AND.","date":"Tue Mar 08 14:19:14 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We must ban the importation of Russian oil and products and pass a federal tax cut for low and middle income Americans to help mitigate the increase in the price of fuel. Every hour counts in the war for freedom and against the madness of Vladimir Putin. https://t.co/wKxXehszyH","date":"Mon Mar 07 21:40:33 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“Citizens of Russia, for you this is a struggle not only for peace in Ukraine, but for your own country…If you keep silent now, then only your poverty will speak for you later, and only repression will answer. Do not be silent!” -President @ZelenskyyUa","date":"Mon Mar 07 21:00:05 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Putin claimed this was a war to liberate Ukrainians from “nazism” and persecution, but there sure doesn’t seem to be a flow of refugees clamoring to enter Russia - and for good reason. https://t.co/rsD2jGwKWQ","date":"Mon Mar 07 18:34:02 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Defense of Americans from physical and economic harm and defense of universal American values of freedom and liberty are not mutually exclusive. In the face of Russian aggression, we can and must do both. Nothing is more threatening to Vladimir Putin than American unity. https://t.co/pY5h4DRqpc","date":"Sun Mar 06 16:43:56 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Protestors in St. Petersburg risk 15 years in prison for peacefully objecting to Putin’s War. Freedom is a blessing for which America must always stand. https://t.co/V1IQBirrJy","date":"Sun Mar 06 14:25:27 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Visa and Mastercard can’t buy those planes. We have to get him the planes.","date":"Sun Mar 06 04:11:53 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I join Senator Romney and a growing, bipartisan chorus of lawmakers calling for the immediate delivery of Soviet fighter jets in Poland’s possession, materiel, and humanitarian aid to Ukraine. I’m on my way back to Washington now and ready to vote immediately. Every hour counts.","date":"Sun Mar 06 01:17:24 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Ukrainian Ambassador very intentionally asked each of us on the zoom to NOT share anything on social media during the meeting to protect the security of President Zelenskyy. Appalling and reckless ignorance by two US Senators.","date":"Sat Mar 05 15:28:34 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Attacking a peaceful neighbor, blocking Facebook, and threatening 15 years of prison for referring to a war as a war is a sign of extraordinary weakness - and madness. https://t.co/Gq3XumOdtU","date":"Fri Mar 04 19:38:07 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The coming weeks and months are sure to be heart wrenching. But Ukrainians will rebuild their country and be free once again. It’s Russia that will have been destroyed by Vladimir Putin.","date":"Fri Mar 04 01:50:54 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It may surprise you that close friendships still exist between Democrats and Republicans in Congress. My pal @RepBrianFitz (R-PA) and I joined @Sharon_Says_So for a great conversation about building bridges of civility in an era of discord. Have a listen! https://t.co/op01k4dycG","date":"Thu Mar 03 18:57:09 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m not wearing a mask (except where required or when asked) but would never scold or shame people who do. Freedom goes both ways, Mr. DeSantis.","date":"Wed Mar 02 19:27:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased that #MN03‘s Polaris is joining many of America’s most prominent brands and companies in suspending  exports to Russia and further isolating the Putin regime for their assault on Ukraine. https://t.co/6lQ56FVmtN","date":"Wed Mar 02 16:21:23 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A refreshing return to dignity, competency, and unity this evening.","date":"Wed Mar 02 04:01:49 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Vladimir Putin has accomplished one thing many imagined impossible: unified the Congress of The United States of America. 🇺🇸 🤝 🇺🇦 https://t.co/bDSEtTw9df","date":"Tue Mar 01 21:46:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m healthy, too. That’s why I took a COVID test to protect others who may not be.","date":"Tue Mar 01 20:04:58 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Watch 140 diplomats walk out of this morning’s UN Human Rights Council meeting when Russian Foreign Minister Sergei Lavrov attempted to justify Russia’s unforgivable assault on Ukraine. https://t.co/rYfG8o6YUc","date":"Tue Mar 01 12:33:43 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Remember, there’s not an army in the world better equipped to end Putin’s reign of terror than the 144 million Russian people themselves.","date":"Tue Mar 01 02:32:08 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The United States purchases over $1 billion worth of Russian oil per month, which supports Putin’s war machine. While banning Russian imports will surely increase the price of fuel, we should do so immediately and identify ways to mitigate the impact to American families.","date":"Tue Mar 01 01:43:45 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As we consider ways to invest the &gt;$9 billion surplus, I call on our state leaders to prioritize relief for Minnesota’s families and small businesses, particularly restaurants, gyms, live events, and hospitality enterprises, that were disproportionately affected by covid-19.","date":"Mon Feb 28 17:48:18 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“If people trust the currency, the country exists,” said Michael Bernstam, a fellow at the Hoover Institution,“If they don’t, then it goes up in smoke\". \nThis is how the free world forces a change in behavior while preventing even greater destruction and loss of life.","date":"Mon Feb 28 17:11:19 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"\"We were told they would welcome us\", said a Russian soldier to his mother moments before he was killed.\nPutin lies to the world, to his nation, and to his own soldiers.","date":"Mon Feb 28 16:02:40 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"For those seeking context, here is the heartbreaking story: https://t.co/I0AYjArYXP","date":"Mon Feb 28 15:53:21 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The unforgivable cost of an unnecessary war. May her memory be for a blessing and an inspiration to the better angels of the world to end such madness. https://t.co/FMolurreSE","date":"Mon Feb 28 14:07:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Israel does such mitzvahs all the time during wars and natural disasters, with little fanfare or recognition.","date":"Sun Feb 27 19:08:06 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As a country promoting itself as a defender of sovereign independence aspiring to a world of people “leading happy, peaceful lives”, this would be a fine time for President Xi and China to demonstrate it.","date":"Sun Feb 27 19:03:42 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Turkey, Japan, and the E.U. are unifying behind ever severe sanctions on Russia and Putin - who has seriously miscalculated the world’s resolve to defend freedom and sovereignty. This is becoming a watershed moment in world unity and order https://t.co/AlcQQvtAgE","date":"Sun Feb 27 18:15:39 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Americans across the political spectrum justifiably fear the erosion of freedom and liberty. The crisis in Ukraine should be a unifying moment for all of us to count our blessings and re-commit to preserve, protect, and defend our Constitution, our country, and one another. 🇺🇸","date":"Sun Feb 27 16:42:07 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"How Minnesotans can help the people of Ukraine 🇺🇦: https://t.co/np7jFyBaYE","date":"Sat Feb 26 22:45:09 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As Ukrainians heroically fight an invading authoritarian intent on taking their lives, a caravan of our citizens is protesting their democratically elected government intent on saving their lives. What a blessing to be an American. 🇺🇸 https://t.co/xw8JGjheDD","date":"Sat Feb 26 20:07:34 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Dictators who deny human freedom underestimate the resolve of those willing to die for it.","date":"Sat Feb 26 19:07:12 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Polish soccer team has refused to take the field against Russia. One small step after which the entire free world must now take a giant leap to sanction, suffocate, and strangle autocracy to death.","date":"Sat Feb 26 14:32:49 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Truth.","date":"Sat Feb 26 02:25:01 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"From Minneapolis to Munich, and Sarajevo to Tel Aviv, Putin (and other autocrats) are seeing the invincibility of freedom and unity on full display all around the globe. Autocracy may win a battle, but democracy will win the war.🇺🇦 https://t.co/rJkCBw9Uzj","date":"Sat Feb 26 00:43:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s be this America. 🇺🇸","date":"Fri Feb 25 22:34:59 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"(2/2) @RepTrentKelly @RepChrisPappas @RepJimCosta @RepSchneider @RepYoungKim @RepJohnLarson @RepRickLarsen @sethmoulton @RepMoolenaar @JimLangevin @RepTenney @RepAnnieKuster  🇺🇸 #Ukraine","date":"Fri Feb 25 21:05:23 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Grateful for these bipartisan original cosponsors: @RepJoeWilson  @CongBoyle @RepGaramendi @RepBuddyCarter @RepJohnCurtis @RepCohen @RepAngieCraig @RepTimRyan @RepStephMurphy @RepHartzler @RepSherrill @RepDonBacon @RepSwalwell @GerryConnolly @RepSpanberger @RepAlGreen (1/2) 🇺🇸","date":"Fri Feb 25 21:01:07 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"NEW: I just intro'd a travel ban on members of the Russian oligarchy &amp; government to isolate Putin and those connected to his unjust invasion w/o unduly punishing the Russian people. Few other tactics could have greater impact with no threat to human life. https://t.co/ND4X1G0lFM","date":"Fri Feb 25 20:51:07 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This is appalling. How could former European leaders find it appropriate to join Russian oligarchy corporate boards in the first place? https://t.co/njajAjGMxg","date":"Fri Feb 25 00:01:44 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Remarkable courage for so many to demonstrate against the very man who has made such peaceful protests illegal. That’s why we must always stand on the side of freedom and the will of people - not autocrats.","date":"Thu Feb 24 20:22:43 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"All of us blessed to live in the world’s liberal democracies are Ukrainian today.","date":"Thu Feb 24 18:25:15 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"You’re either for Democracy or for authoritarianism. Here and abroad.","date":"Thu Feb 24 04:48:43 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"America leads. We do not resign. We do not ignore. Democracies, no matter nascent nor mature, must protect one another as a matter of principle. Let’s get together on this.","date":"Thu Feb 24 04:40:53 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Shame on anyone who put politics above principle right now. Let’s be America.","date":"Thu Feb 24 03:54:57 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Lawmaking and sausage-making aren't fast or pretty, but the process can yield extraordinary results. Restaurants are the social, cultural, and economic hearts of our communities, that’s why @andrewzimmern and I are on a mission to #SaveRestaurants - and make some great sausage. https://t.co/HrqkvQxR7l","date":"Wed Feb 23 21:29:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to be a co-sponsor of @RepAlexMooney’s bipartisan Readable Legislation Act. Government should always be striving to serve the public more efficiently, effectively, and with more transparency.","date":"Wed Feb 23 20:50:25 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Forty two years ago my Edina Squirt A teammates and I sat glued to a console tv on the floor of a hotel room in Alexandria and experienced a miracle that would connect us for the rest of our lives. https://t.co/hElbJXrcdI","date":"Wed Feb 23 04:54:55 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Actually, it’s the opposite. He will lead the world through this crisis not by celebrating and encouraging an authoritarian warmonger (as a former POTUS did today), rather by the combination of American leadership, strength, and principles (in which we could use your investment).","date":"Wed Feb 23 03:50:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"That’s why I believe a ban on leisure and business travel by Russian nationals to allied nations has a better chance of turning domestic opinion against Putin than any other measure.","date":"Tue Feb 22 14:05:31 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Happy #Twosday two all who celebrate. https://t.co/1G3JB47iKa","date":"Tue Feb 22 13:32:28 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We successfully fought Russia’s march of communism in the 20th century. Now we must fight Russia’s march of authoritarianism in the 21st. There is no alternative.","date":"Mon Feb 21 22:43:50 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Should Putin invade Ukraine, a comprehensive travel ban (w/ humanitarian and cultural exceptions) should be among the sanctions implemented by the US, NATO nations, and our allies in the (still) free world. Few other tactics could have greater impact with no threat to human life.","date":"Mon Feb 21 21:46:38 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to see the @mnhouseDFL spearhead an expansion of the Pathways to Policing program to recruit, train, and retain principled law enforcement officers to protect and serve our communities.","date":"Mon Feb 21 17:24:04 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"China’s change in tone towards Putin, if authentic, is a meaningful - and positive - shift in the chess game. But it’s just as likely that Xi is playing both sides by publicly objecting while privately condoning Putin’s advance. Actions will speak louder than words.","date":"Mon Feb 21 16:07:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I love this team and their spirit. It doesn't always take a medal to make Minnesota and America proud. https://t.co/GOVwZYcY8t","date":"Fri Feb 18 20:41:43 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m saddened by the passing of my colleague, @JimHagedornMN. We had different political views but a respectful friendship and a shared love for Minnesota and our country. Condolences to @jkcarnah and family. May his memory for a blessing.","date":"Fri Feb 18 13:39:01 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Prediction: 200 protesting members won’t wear masks, 200 rule followers will wear masks, and Democrats will transform into conservatives and Republicans into progressives right in front of America’s eyes.","date":"Thu Feb 17 20:24:18 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m as eager to take off our masks and get our lives back to normal as I am disgusted by attacks on patriotic public servants who’ve done their best to keep us safe from a threat that’s already killed almost 1,000,000 Americans.","date":"Thu Feb 17 19:52:34 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We all want kids to learn, adults to work, and more Minnesotans to become self sufficient - none of which is possible w/o stable housing. The House DFL’s effort to reduce costs and create more homes is a great start, &amp; I’ll be helping at the federal level. https://t.co/FMUCy0vYmz","date":"Thu Feb 17 19:33:06 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s not just fraud, it’s theft from every single one of us. As Chair of the Small Business Subcommittee on Oversight &amp; Investigations, we will not rest until the money is recovered and the criminals are behind bars. https://t.co/YQUgjOdllj","date":"Thu Feb 17 14:46:45 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“America will defend every inch of NATO territory with the full force of American power. An attack on one of us is an attack on all of us.” https://t.co/D6DSWlrijJ","date":"Wed Feb 16 03:26:17 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to see Minnesota lawmakers prioritize the recruitment of principled law enforcement cadets. We need America’s best and most honorable to protect and serve our communities. https://t.co/2Hah5g7Epz","date":"Tue Feb 15 15:09:18 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A shooting at a Democratic campaign office in Louisville and the suspect is a liberal activist. Please, America. We cannot let our country devolve into this. The consequences are unimaginable.","date":"Tue Feb 15 03:37:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This is awesome. Have a watch and a listen. https://t.co/387EzrPSgb","date":"Sat Feb 12 17:36:17 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I spent time at Lucy Laney a few years ago when Deshaun was a student there. The love and hope in that school was memorable, and it breaks my heart that gun violence has claimed yet another young man of great potential. If you have an idea to help end this scourge, please share.","date":"Sat Feb 12 17:18:33 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"After passing laws that make voting more difficult for many, counties in Texas are rejecting ballots at rates up to 40%. Why do you think that is?","date":"Sat Feb 12 15:20:09 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Putin may not fear American firepower in this instance, but he better fear a never ending resistance by Ukraine freedom fighters, emboldened and likely expanded NATO membership, and a punishing sanctions regime that will make life miserable for his corrupt kleptocronies.","date":"Fri Feb 11 20:04:50 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Just takes a little trust and intention. There’s plenty of common ground to be discovered if we’re willing to seek it.","date":"Fri Feb 11 18:46:50 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"According to the ⁦@MinneapolisFed⁩, enhanced unemployment benefits didn’t cause the labor crisis, rather early retirements and a lack of child care are limiting labor force participation. That’s why we need  immigration reform and childcare support. https://t.co/rU9kJZudZ9","date":"Fri Feb 11 16:10:32 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Restoring trust in government is essential. That’s why I’m an original co-sponsor of @RepSpanberger and @RepChipRoy’s bipartisan bill to require Members of Congress to place tradable assets in blind trusts. I’ve done so, and we all should do so.","date":"Fri Feb 11 15:14:59 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’ve had people on the left and the right ask me if I object to protests that block highways because “it prevents people from getting to their lattes”. I object because it prevents people from getting to their jobs.","date":"Fri Feb 11 12:59:38 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"For the life of me, I just don’t understand what’s going on.","date":"Fri Feb 11 02:47:01 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Sure seems to be a correlation between those screaming about voting fraud and those committing it.","date":"Thu Feb 10 21:58:48 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The irony of “freedom convoys”impinging on others’ freedom isn’t lost on me.","date":"Thu Feb 10 13:48:54 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Going to be some Gophers and 7 Minnesotans on the ice tomorrow in Beijing as the greatest nation on earth takes on the People’s Republic of China in the greatest game on earth.🏒","date":"Thu Feb 10 02:33:49 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m a co-sponsor of the TRUST in Congress Act to ban stock trading and already have my tradable securities in a blind trust. Now let’s tackle another abuse of public trust: Members of Congress collectively wasting &gt;1,000 hours PER DAY raising campaign cash. Can you believe that?","date":"Thu Feb 10 02:12:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In 2021, 64 officers were killed by gunfire, and officers killed 1,055 people by gunfire, a record high. We must convene police chiefs, community leaders, and lawmakers and develop a strategy to increase public safety, officer safety, and suspect safety. https://t.co/FbaMynMLGl","date":"Wed Feb 09 22:45:07 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@kyledcheney https://t.co/0MBSYNiag5","date":"Wed Feb 09 22:12:44 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Elected officials should neither trade stock while in office nor be punished for being investors. That's why I'm an original co-sponsor of the TRUST in Congress Act, which requires members of Congress to do what I've already done: place their tradable assets in a blind trust. https://t.co/gg5rQXFbV3","date":"Wed Feb 09 21:33:47 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Minnesotans LOVE winter! That's why we sent more athletes to the Winter Games than 49 of 50 states, and 61 of 91 countries participating! Five of those athletes hail from Minnesota's Frozen 3rd District. Let's celebrate them and ensure the North stays cold for future generations. https://t.co/KxvXmQ7NMb","date":"Wed Feb 09 20:59:55 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I don’t believe health insurance causes death, but the inability to afford health insurance certainly does.","date":"Wed Feb 09 20:01:45 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Hallelujah! It took over a year, but Senate Minority Leader McConnell and House Minority Leader McCarthy finally agree what occurred at the Capitol last Jan 6 was a violent insurrection.","date":"Wed Feb 09 19:39:58 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@groover1975 Just like you did; the burning, looting, and destruction of a police building in Minneapolis. Jan 6 was an armed insurrection in the United States Capitol inspired by a defeated former President and in which 140 police officers were injured.","date":"Wed Feb 09 19:26:38 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It's a serious mistake (and lie) to call it anything but.","date":"Wed Feb 09 18:27:53 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Meanwhile: https://t.co/B66wUpNoo3","date":"Tue Feb 08 20:20:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"\"It was a violent insurrection with the purpose of trying to prevent a peaceful transfer of power after a legitimately certified election... That’s what it was,” Sen. Mitch McConnell","date":"Tue Feb 08 20:19:05 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Simple, strong, and clear message to Russia: If no respect for Ukraine’s sovereignty, then no Nord Stream 2.","date":"Mon Feb 07 21:31:06 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Please read this powerful piece and think of Amir Locke and millions of Americans who live in fear of a broken system that’s taking too many precious lives. https://t.co/fRUvklsp1a","date":"Sun Feb 06 15:45:59 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Allow me to clarify that by “the subject” I meant the actual subject, who was NOT Amir Locke. I’m sickened by his senseless death. “No knock” warrants are too dangerous for citizens and the officers executing them, and should be banned for all but the most unusual circumstances.","date":"Fri Feb 04 20:20:09 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"While there may be occasions for no-knock warrants, it seems that an arrest could have been made in this case w/o incident when the subject left the building. Instead, our community is suffering from another preventable tragedy, more trauma, and more questions about leadership.","date":"Fri Feb 04 16:56:12 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Everyone should be free to organize and collectively bargain. I support congressional staff who wish to do so. They’re grossly underpaid for the important work they do on behalf of Congress and our country, and deserve to be reasonably compensated.","date":"Fri Feb 04 04:14:10 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"LOL! https://t.co/AJZqiol4rm","date":"Fri Feb 04 01:18:55 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Dark money, non-stop fundraising, pay for access, leadership PAC slush funds, and now…pay for endorsement. Why do we tolerate legalized corruption?","date":"Thu Feb 03 14:26:03 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Gerrymandering, whether done by Republicans or Democrats, is a disservice to everyone but the politicians it benefits. Let’s end this nonsense before the next redistricting process in 2031/32 and create a country of competitive districts and more reasonable members of Congress.","date":"Wed Feb 02 23:07:00 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Here is our @ModernizeCmte suggestion box for ideas to improve the efficiency and effectiveness of Congress. Feel free to share an idea here in the comments section and I’ll happily put it in the box for you. Thanks for being part of the solution!","date":"Wed Feb 02 14:37:09 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My heart is broken.","date":"Tue Feb 01 21:08:14 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Praying for the victims and that no children were harmed.","date":"Tue Feb 01 19:59:17 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Be like @ShelettaIsFunny and thank a hospital worker today. 🙏","date":"Tue Feb 01 14:13:24 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"How sad that the @mngop has made #lying its core strategy. I support the police, have never voted to defund them, and am thrilled that just 60 days ago the DOJ distributed $139 million to 183 departments to hire an additional 1,066 officers. That’s the #truth.","date":"Sun Jan 30 23:17:07 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We shouldn’t allow such grotesque manipulation of voters. Dark money should be banned. But if it remains legal, we must at least ensure transparency. Americans deserve to know who’s trying to influence them and how much they’re spending to do so. https://t.co/NB77hmklbv","date":"Sun Jan 30 15:28:31 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"News flash: Minnesota legislative leaders seem to agree; people desire economic and physical security, and education and opportunity for their children. Now let’s show the country we can work together towards those ends.🤝 https://t.co/mWGtzd7lLv","date":"Sun Jan 30 14:54:01 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It is not radical to support families, children, and the natural environment. It is radical and dangerous to support extremist lawbreakers and global dictators and dangle pardons for political advantage.","date":"Sun Jan 30 14:30:44 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Perhaps starting your own podcast would be a better antidote than cancelling your Spotify account.","date":"Sat Jan 29 23:56:57 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Today I hosted one of my Common Ground sessions in which 6 Democrats (incl. me) and 6 Republicans from #MN03 sit for a convening facilitated by @braverangels. We enter as strangers and, after 2 hours of listening and learning from each other, leave as friends. It’s amazing. 🇺🇸","date":"Sat Jan 29 23:21:31 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I know @RepMalinowski. I serve with him on @HouseForeign and he’s a dear friend. He’s one of the most experienced and sharpest minds in Congress and admired by members on both sides of the aisle. At least the 95% of us who know Putin to be a threat to European and world security.","date":"Sat Jan 29 21:49:52 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Minnesota lost two great men this month, and I lost two great friends and mentors. Peter Heegaard and John Crosby embodied the very best of our community and country - and their tireless work to improve lives and livelihoods are legacies that will live on forever.","date":"Sat Jan 29 19:43:20 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"After 232 years and 115 justices, an American President plans to nominate a black woman for the first time ever. Raise your hand if you think that’s awesome! 🙋🏼‍♂️","date":"Sat Jan 29 14:14:32 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Spent this afternoon on patrol with Officer Emily Jepson of the @EdinaPolice Department. Her integrity, competency, and compassion makes me proud - and grateful - to represent the men and women who serve and protect all of us in #MN03. Thank an officer the next time you see one.","date":"Sat Jan 29 01:30:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Please take ten minutes of your day and watch this heart wrenching eulogy to Officer Jason Rivera by his wife, Dominique. And then, please thank a police officer. https://t.co/X0digmuQ3d","date":"Fri Jan 28 19:14:34 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@BeschlossDC In high school in Minneapolis, in the computer lab, gathered around a tv on a media cart, and the deafening silence.","date":"Fri Jan 28 14:47:35 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@StingsLikeSalt Probably less than any of my colleagues. And I don’t accept PAC money, federal lobbyist money, or contributions from fellow Members of Congress. And I’m one of the few without a leadership PAC. The money game in politics is disgusting.","date":"Fri Jan 28 14:31:12 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@dare_2_b_darren That’s why I was a lead sponsor of HR1 which would have done exactly that. Couldn’t get it through the Senate.","date":"Fri Jan 28 14:27:15 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@gettinclassy I don’t know. It’s in a blind trust. And every Member of Congress should do the same.","date":"Fri Jan 28 14:25:59 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The problem isn’t that George Soros, Charles Koch, and others shovel hundreds of millions of dollars into our elections, the problem is that WE allow it.","date":"Fri Jan 28 13:29:13 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@StribGuy Heartbreaking.","date":"Fri Jan 28 13:01:11 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"With fewer and fewer Holocaust survivors left to tell their stories, the responsibility falls to all of us - of all political perspectives - to remember them and the horrors to which they were subjected, and ensure it never, ever happens again. #HolocaustRemembranceDay","date":"Thu Jan 27 21:36:38 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Good luck to @CoachPhill and the USA Curling Team in Beijing. Here’s to bringing back another gold medal to Minnesota!🥇","date":"Thu Jan 27 19:40:15 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I am not opposed to mining, but will always oppose projects that present undue risk to future generations of Minnesotans. My gratitude to @BettyMcCollum04  for her years of leadership on protecting Minnesota’s – and America’s – most popular Wilderness Area. (2/2)","date":"Wed Jan 26 19:29:05 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Minerals, jobs, and Minnesota's clean water and environment are all critical to our future. I applaud @Interior’s thoughtful review and agree; The risk of irrevocable damage to the BWCA, and the recreation-based economy that depends on it, is simply too great. 1/2","date":"Wed Jan 26 19:29:04 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":".@SenAmyKlobuchar and I are live w/entrepreneurs from the restaurant, live event, and fitness industries. Small businesses that rely on gatherings have been disproportionately impacted by COVID surges, supply chain issues, and workforce shortages. Tune in: https://t.co/70k5LCTxHk","date":"Wed Jan 26 16:20:40 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A little intention goes a long way. https://t.co/B1n1yN8snD","date":"Wed Jan 26 13:14:32 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":".@RepDustyJohnson is right; America needs more spaces, places, and people promoting respectful debate. As he says, we often disagree on policy, but our friendship is founded on our mutual love for our country, and security, liberty, and opportunity for all.https://t.co/tkfomHpw9K","date":"Tue Jan 25 16:18:51 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Vintage sleds, 500 miles from Winnipeg to Elk River, and raising money for an Honor Guard. What’s not to love. https://t.co/IPgyimD0xi","date":"Tue Jan 25 14:26:37 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As any person of character would do.","date":"Tue Jan 25 04:56:30 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to join @RepGolden and twenty-six, bipartisan colleagues in calling on @SpeakerPelosi and @GOPLeader to ban Members of Congress from trading stock by placing such investments in blind trusts. I’ve done so, and believe it should be the rule for all. https://t.co/CZjhShRqKM","date":"Mon Jan 24 19:27:05 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The United States is home to 4% of the world’s population and 15% of covid deaths; a failure of government and we as individuals. American exceptionalism and liberty require unity and empathy. Let’s commit to respect and compassion for one another - no matter our politics.","date":"Mon Jan 24 14:09:47 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What a sickening and dangerous statement by a former Speaker of the House. Thankfully America is still a country in which people only go to jail if they break the law.","date":"Sun Jan 23 22:55:35 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Why is Ranked Choice Voting catching-on in red, blue, and purple parts of America? Because it incentivizes respectful campaigns, rewards candidates with the broadest appeal, expands choices for voters, and ensures winners have majority support. #RCVday https://t.co/KLcKEAzJQB","date":"Sun Jan 23 18:51:59 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I was pleased to welcome @jordanbpeterson to my office this week to discuss ways in which we can all take steps to open our hearts and minds and make RESPECT cool again.","date":"Fri Jan 21 15:35:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"After listening to #MN03 community members and police chiefs and officers, I’m pleased to announce original co-sponsorship of the Bipartisan Invest to Protect Act - an effort to enhance support for police departments w/&lt; 200 officers. Common ground and common sense action. ✅ https://t.co/ayTFBxVdOp","date":"Fri Jan 21 15:32:47 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We?","date":"Wed Jan 19 23:57:44 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What a joy today to vote to bestow the Congressional Gold Medal on Willie O’Ree, the NHL’s first black hockey player. 🏒🥇","date":"Wed Jan 19 18:36:20 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Two remarkable siblings seeking Wayzata’s most delicious cheeseburger. What’s not to love?🍔 https://t.co/zz61GcZL0y","date":"Wed Jan 19 15:58:52 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Our Founders didn’t favor the filibuster. It was introduced in 1806, the 2/3’s rule in 1917, the 60 vote rule in 1975, and now there are exemptions galore (e.g. 2017 Trump Tax bill). Returning to Mr. Smith’s “talking filibuster” would at least require that obstruction be EARNED. https://t.co/FSn9RVzRon","date":"Tue Jan 18 22:11:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Seems as if the people have spoken, Senator Johnson. https://t.co/4WfZHhwQwp","date":"Tue Jan 18 20:59:06 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Order your free, at-home COVID test kits to help keep you and your family healthy and protect others. It’s easy! https://t.co/R0El3u5oN1","date":"Tue Jan 18 20:40:27 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepRoKhanna Looking forward to it!","date":"Tue Jan 18 18:04:08 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s pretty rich to argue that partisan efforts to make voting harder for some shouldn’t be met by partisan efforts to make voting easier for all.","date":"Mon Jan 17 15:22:08 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"On #MLKDay I’m thinking of all the dads with the same dreams, and that one day we will reach that sacred place where all of God's children stand as equals on level, fertile ground. https://t.co/CTIqgZYbEK","date":"Mon Jan 17 13:11:56 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Extraordinary work by law enforcement agents to save four lives and prevent a tragedy tonight in Colleyville.","date":"Sun Jan 16 03:47:59 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This is horrifying. Please pray for the safety of those being held hostage in the synagogue and the police officers working to end the crisis without bloodshed.","date":"Sat Jan 15 21:26:17 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Enough with the Hitler and Nazi comparisons. They’re dangerous false equivalencies that dishonor the 6 million human beings who died at the hands of monsters in the Holocaust. THIS IS NOT THAT. https://t.co/ln6ZHwNbP4","date":"Sat Jan 15 18:00:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@markfrascone My investments are in a blind trust so I have no insight as to how the money is invested. One of only 10 members of Congress to take that step.","date":"Sat Jan 15 13:35:36 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The irony that certain Members of Congress used proxy voting to vote AGAINST making voting easier for Americans is not lost on me.","date":"Sat Jan 15 13:23:00 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Proud to be one of the 8% who don’t.🙋🏼‍♂️","date":"Sat Jan 15 12:29:54 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to see our suburban state legislators listening to community concerns, offering solutions, and supporting efforts of Mayors and Chiefs of Police to address the surge in crime. If you have ideas about how Congress can assist, please share them.","date":"Fri Jan 14 18:42:35 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I stand corrected. It appears there was organized fraud in the 2020 Presidential election. https://t.co/bulBcDU8VD","date":"Fri Jan 14 16:03:29 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As if we needed another reason to legalize it.","date":"Thu Jan 13 02:03:30 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Our first amendment protects a US Congressman’s right to use Nazi imagery to Tweet a dangerous false equivalency, but the nation that bred Nazism takes it down because it violates German law. Gratitude to @RepKinzinger for having the courage to publicly condemn such behavior.","date":"Thu Jan 13 01:23:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"With yet another covid blow to hospitality owners and employees, it’s IMPERATIVE that we replenish the Restaurant Revitalization Fund #RRF and support businesses like gyms, hotels, and the live events industry which reply on in-person gathering.","date":"Wed Jan 12 23:48:41 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Just stop with the repugnant false equivalencies. How insulting to those who lived AND DIED under Nazi tyranny.","date":"Wed Jan 12 19:37:27 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If suggesting “Second Amendment Rights Should Be Used Against Democrats” doesn’t immediately compel ⁦@GOPLeader⁩ to take disciplinary action, I suggest Congress take action against both of them. This madness must be addressed or violence will ensue. https://t.co/vZUcGtNXlZ","date":"Wed Jan 12 12:58:25 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The @GOPLeader is invited to join me and 15 other House members in supporting H.R.336, the bipartisan TRUST in Congress Act, which would require Members of Congress to place assets in blind trusts. I’ve done so, and believe it’s the best way to prevent conflicts of interest.","date":"Tue Jan 11 13:20:31 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I hope she crushes it.","date":"Tue Jan 11 04:03:21 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Solving problems requires working together. I’m pleased that Mayors, Police Chiefs, and county Prosecutors representing much of #MN03 sat down to discuss how to address the wave of crime that’s affecting every Twin Cities community.","date":"Tue Jan 11 03:44:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Truth. It’s catching on. https://t.co/Valx9hvsUk","date":"Tue Jan 11 03:32:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Imagine if all the Republicans in Congress and in legislatures around the country who know the truth, and recognize the consequences of the lie, would simply say it? Imagine.","date":"Mon Jan 10 19:50:27 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"On Law Enforcement Appreciation Day, I extend my gratitude to the men &amp; women in #MN03 and around the USA who put their own lives on the line to enforce our laws, keep us safe, and provide assistance to millions of Americans every single day. Thank you. 🙏https://t.co/LRdlQTqswQ","date":"Sun Jan 09 15:52:40 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We must invest in opportunity. We must prosecute violent criminals &amp; stop the revolving door. We must invest in education, rehabilitation, and opportunity for the incarcerated to reduce recidivism. In particular, we must redesign our ineffective juvenile justice system. We must.","date":"Sat Jan 08 19:28:42 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Great work by @EdinaPolice. The growing incidences of brazen, violent crime by juveniles is horrifying. It’s clear from my ride-alongs w/officers and meetings w/police chiefs that we must redesign our criminal justice system and invest in children to PREVENT such tragic outcomes.","date":"Sat Jan 08 19:13:30 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Members of the Democratic Caucus protected democracy on Jan 6, 2021, and we’re resolute and ready to keep doing so. At any cost.","date":"Sat Jan 08 03:19:09 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"How many of you have a favorite restaurant that has closed or cut hours recently? Jobs, livelihoods, and dreams are on the line, so I'm leading a bipartisan effort to support small businesses owners who have been left behind. https://t.co/AualEk3LEa","date":"Fri Jan 07 16:42:25 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"From look who’s coming to dinner to look who’s serving in the White House, Sidney Poitier helped lead remarkable change during his lifetime. The world mourns a giant of character, cinema, and humanity.","date":"Fri Jan 07 15:56:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Yesterday, my colleagues and I in the “Gallery Group” joined with @chefjoseandres, @natemook, and @cheftkilcoyne of @WCKitchen to share a hot lunch with 700 US Capitol police and staff who protected American democracy on Jan 6. Let’s make gratitude our new attitude. 🇺🇸 https://t.co/xBF3EQm0y0","date":"Fri Jan 07 13:39:57 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Facts are not divisive.\nLies are divisive.","date":"Thu Jan 06 20:48:15 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We need not fear those who stormed the Capitol last January 6th, rather those who incited it, enabled it, and continue to propagate the most despicable and dangerous lie in American history. I was pleased to join @JohnKingCNN and @DanaBashCNN today to discuss the implications. https://t.co/3X4x2ZdH7D","date":"Thu Jan 06 19:36:53 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Gratitude is the antidote. https://t.co/thxBvhgt5X","date":"Thu Jan 06 17:00:22 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We owe a debt of gratitude to those who serve and protect us; gratitude that we are citizens of a country that is free and prosperous and still enjoys liberties afforded to few around the world. Those things are worth fighting for.","date":"Thu Jan 06 16:16:43 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"While almost 800 people have been charged for their roles in the Jan 6th Insurrection, those who incited it, enabled it, and whitewash it continue to walk the halls of Congress and Mar-a-Lago.","date":"Thu Jan 06 13:25:45 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A message from Karl Rove about duty, responsibility, and Jan 6. https://t.co/WgEw0B7Rk8","date":"Thu Jan 06 12:59:38 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It should be marked by condemnation of those who inspired it, enabled it, and refused to rectify it when afforded the opportunity to do so. And it should be marked by a collective resolve to ensure it never happens again.","date":"Wed Jan 05 21:29:28 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Actually, @SenatorHawleyMO, the true legacy of Jan 6 is the shocking abdication of oath and corruption of principle that has infected you and too many others on whose shoulders our foundations of democracy hang in the balance.","date":"Wed Jan 05 21:05:04 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Apparently, some of the flock is losing faith in the former President. https://t.co/UOJEFSZZk3","date":"Wed Jan 05 19:32:58 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Outstanding meetings today w/#MN03 mayors and chiefs of police who shared their ideas about how to improve public safety, invest in children, expand mental health provision, and ensure everybody we represent feels secure. Gratitude to all who protect and serve our communities.🙏 https://t.co/l7yD8bjBMe","date":"Tue Jan 04 22:06:42 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Horrifying for those trapped on I-95 in Virginia for over 27 hours after a major snowfall. Minnesotans are fortunate to have one of the most innovative and proficient snow removal teams in the world in @MNDOT - who I visited just yesterday to learn how they get the job done. https://t.co/dT27jBMB9g","date":"Tue Jan 04 20:59:05 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Shout-out to Alma for brightening my day with this drawing of what's giving her hope. It's never too late to get your vaccine, and it's never too late to spread optimism. Download the coloring sheet at https://t.co/SlvJTjZTz9 to show me how you're keeping the faith in '22. 🇺🇸❤️ https://t.co/9g1TWUvunY","date":"Mon Jan 03 22:17:32 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Sharing success = compassionate capitalism.  https://t.co/szvIFfw6VQ","date":"Mon Jan 03 14:16:07 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Olivia_Beavers Happy to share some. https://t.co/cwPm1ep8IZ","date":"Sun Jan 02 16:45:14 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Public officials are fair game. Our children are not.","date":"Sun Jan 02 16:30:26 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I am wholeheartedly opposed to government censorship - which this is not.","date":"Sun Jan 02 15:32:46 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I suppose they wouldn’t recognize an America that emancipated enslaved people, granted women the right to vote, and developed into the most prosperous nation in human history.","date":"Sun Jan 02 14:40:08 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My dad took me to my first game in ‘74 to see Tony O at The Met. We saw Kent Hrbek win the Series in the Metrodome in ‘87 &amp; ‘91. And we sat together at the Target Field inaugural in ‘10 to see Morneau &amp; Mauer. Some of my greatest memories thanks to these guys.","date":"Sun Jan 02 05:19:20 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s. Play. HOCKEY! Phillips brothers going old (and cold) school. #WinterClassic #6below https://t.co/TfZhjYAEtz","date":"Sun Jan 02 00:20:56 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s a mighty fine day for an outdoor hockey game. #oldschool 🏒 https://t.co/lIyKtRUybk","date":"Sat Jan 01 13:55:57 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s all agree on one thing tonight; a year of health, healing, repair, and prosperity for all. Yes, even you who disparage every single tweet of mine 365 days a year. Even you. Happy New Year! 🎉","date":"Sat Jan 01 01:55:16 +0000 2022","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"From appearing in an experimental TV transmission in 1939, to Minneapolis’s fictional, WJM-TV on Mary Tyler Moore, to hosting SNL, Betty White lived a remarkable 99 year life.  https://t.co/fnzk0xlQiS","date":"Fri Dec 31 19:42:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to see our outstanding #MN03 state legislators taking steps to address the growing incidence of brazen crime when the Legislature reconvenes. Tackling the acute spike and investing upstream in kids and prevention aren’t mutually exclusive, they’re imperative.","date":"Fri Dec 31 19:29:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The #RRF must be replenished, and I’m spending every ounce of political capital available to me to ensure it gets done in early 2022. @IndpRestaurants","date":"Fri Dec 31 14:55:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Outstanding work by three #MN03 Police Departments to apprehend a pair who’ve committed a number of burglaries in our community. @EdinaPolice @mtkapd @BPD_MN","date":"Fri Dec 31 12:42:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"After a period of unimaginable trauma for our Twin Cities and country, isn’t it time to work TOGETHER to implement innovative solutions and become a more safe, hopeful, and prosperous community for everyone? I want to hear your ideas, so please share and let’s get to it. 5/5","date":"Thu Dec 30 17:44:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We also need to invest more in rehabilitation and education for the incarcerated &amp; fix numerous problems in our criminal justice system. We must hold law enforcement to high standards, invest in training and recruitment, and support those who risk their lives to protect ours. 4/5","date":"Thu Dec 30 17:44:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It starts with supporting our children and communities that have long been ignored, mistreated, and marginalized. Investment in education, healthcare, and opportunity, IS investment in public safety. The research is clear; doing so will save lives and money down the road. 3/5","date":"Thu Dec 30 17:44:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m hearing from many all around our community about safety concerns, and addressing it is among my highest priorities. I believe America has mistook quiet for peace for far too long, and change is long overdue. 1/5","date":"Thu Dec 30 17:44:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’ll be meeting w/Chiefs of Police next week to discuss short-term steps to address the wave of brazen crimes, but we will never imprison or police our way to public safety. Preventing crime requires a change in the culture of ignorance of its roots and long term investments. 2/5","date":"Thu Dec 30 17:44:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As of Saturday morning, no American will suffer the financial burden of a surprise medical bill from an out of network provider. Salutations to @SenBillCassidy and @SenatorHassan whose fortitude got it done. https://t.co/KoBQsU2kOJ","date":"Thu Dec 30 16:22:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"That’s nothing. Had to be 20 below for Edina to cancel my mites games in the ‘70s.","date":"Wed Dec 29 21:52:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RunForrestRun11 @ajbuckalew @deanbphillips https://t.co/qUF6jb8nED","date":"Wed Dec 29 13:05:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A culture that breeds such behavior and a revolving door system that allows criminals back on the street to cause mayhem has to change. No one should live in fear. https://t.co/JabtJCYabG","date":"Wed Dec 29 12:39:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Even though he beat the Vikes in the 1977 Super Bowl (which my dad took me to!) I join all football fans in mourning the loss of Minnesota native and coaching and broadcasting icon, John Madden. 🏈 https://t.co/ZYhLRAcu6x","date":"Wed Dec 29 01:12:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I agree with @mcc_dloon that Minnesota’s businesses should not and cannot bear responsibility for replenishing the UI trust fund. If anything, many need relief - and we have the surplus and federal dollars to do it. https://t.co/wEi1NuEkHM","date":"Tue Dec 28 21:24:52 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Term limits, elementary-level knowledge, and basic standards of decency would sure improve America’s Congress.","date":"Tue Dec 28 18:23:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As a difficult year draws to a close, this remembrance of one of Minnesota’s favorite sons is a lesson to those of us in public life who serve to achieve results by forgoing insults. https://t.co/jrykoCze6Q","date":"Mon Dec 27 15:39:09 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The world has lost a champion in the fight against injustice, a giant of decency, and a man of unequaled wit. A phone rang during a dinner speech we attended, and without missing a beat he exclaimed, “Excuse me, but God must be calling.” Now he has. Rest in peace Desmond Tutu. https://t.co/4DLUqfdpjX","date":"Sun Dec 26 15:42:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Merry Christmas! Whether you’re around a tree or table with family, or Netflix and Chinese fooding, it’s a good day to recognize we’re all in this together.","date":"Sat Dec 25 17:11:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@CrimeWatchMpls I proudly support police in the cities I serve. I’m disgusted by the insecurity facing so many and regularly solicit our chiefs of police for solutions. Ultimately, safety requires investing in kids, well resourced law enforcement, and an effective legal system. Your solution?","date":"Fri Dec 24 05:04:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We must get tough on carjackings immediately. The Federal Anti-Car Theft Act of 1992 (FACTA) made it a federal crime punishable by 15 years to life to use a firearm to steal a car. Yet, there are very few federal prosecutions for these crimes and I intend to ascertain why.","date":"Wed Dec 22 23:30:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Minnesota's healthcare workers are heroes, risking their own lives in the spirit of saving others. During one of the most challenging and disheartening times they've ever known, four members of our delegation joined me in sharing our heartfelt gratitude and some holiday cheer. https://t.co/CQVmQlcVyi","date":"Wed Dec 22 21:23:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"No one should live in fear of carjackings, assaults, shootings, and home invasions. The impunity with which criminal terrorists are stoking fear is unacceptable. We must adequately resource crime prevention and law enforcement, and support those who serve and protect us.","date":"Sun Dec 12 16:21:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@gnearhoff @SamAdam76478909 Very simple. I believe only American citizens should have the right to vote in any election, be it municipal, state, or federal.","date":"Wed Dec 22 17:34:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"About 3% of covid relief funds appears to have been fraudulently obtained. As Chair of the @HouseSmallBiz subcommittee on Oversight &amp; Investigation, my colleagues and I will not rest until criminals are caught and forced to pay restitution to taxpayers.  https://t.co/p1qO535Tg8","date":"Wed Dec 22 16:12:56 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@gnearhoff How about Article I, Section 4 of the United States Constitution?","date":"Wed Dec 22 15:41:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Like members of Congress, armed services members must maintain an oath to one thing; the United States Constitution - not a President, a former President, or any political party. https://t.co/D9wARPQ28E","date":"Wed Dec 22 15:13:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Why would Republicans be disadvantaged by standardizing mail and early balloting, reduced gerrymandering, automatic registration of legal voters, voter ID standards, mandatory paper ballots, and making Election Day a holiday? The idea is to make voting more accessible and secure.","date":"Wed Dec 22 15:08:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s all be Jennifer this holiday season.","date":"Wed Dec 22 14:02:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Covid and crime are both public safety issues taking significant tolls on our communities, our healthcare workers, and our first responders. I am grateful for my fellow Americans who’ve dedicated their lives - at great risk to their own - to keeping us healthy and safe. 🙏","date":"Wed Dec 22 14:00:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What an honor to represent a community filled with heroes like Sydney Raley. #MN03 #EdenPrairie","date":"Tue Dec 21 21:30:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In an era of dereliction of duty and dishonor among far too many elected officials, @RepRaskin is a bright light of principle and a giant of decency. It’s an honor to call him my friend, colleague, and person of the year. https://t.co/nG8eiIL80p","date":"Mon Dec 20 23:57:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"\"You’re playing right into their hands when you doubt the vaccine.\" - Donald Trump \n\n\"Please do not play into our hands.\" - Most people.","date":"Mon Dec 20 21:14:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Fair immigration laws make America stronger. I helped pass a pathway to citizenship for MN’s Liberian refugees, but time is running out. Our friends, neighbors, and coworkers who have lived in the U.S. legally for decades through DED must apply for LRIF today. Here's how &gt;&gt;","date":"Mon Dec 20 20:17:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Today’s news is disappointing, but resignation and condemnation of Sen. Manchin is not the answer. Let’s use the next 10 months to find common ground and pave a path to protecting voters, our elections, our most vulnerable, and our planet. It’s not just possible, it’s imperative.","date":"Sun Dec 19 16:43:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As America mourns Sen. Isakson and confronts the disappointment of the Senate itself, I remain committed to building bridges, finding common ground, and doing the best we can to protect our country, our planet, and its most vulnerable. Keep the faith.\n https://t.co/69I15D1nfZ","date":"Sun Dec 19 16:18:07 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As you finish your Christmas shopping, please consider giving your loved ones the gift of (your) life. Get a booster shot.","date":"Sat Dec 18 13:27:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The depths of the former President’s ignorance and offensiveness never seem to reach a bottom.","date":"Fri Dec 17 17:22:46 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Proud to join my colleague @RepYoungKim in calling for the establishment of a bipartisan House Select Committee on the Supply Chain Crisis.","date":"Fri Dec 17 16:27:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Michael72905725 @Sen_JoeManchin Have a look at Article I, Section 4 of the United States Constitution.","date":"Fri Dec 17 15:21:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Freedom to Vote act, co-led by @Sen_JoeManchin, is among the most important bills Congress has considered in my lifetime. It guarantees both ACCESS and SECURITY; respective demands of the left &amp; right. He and 50 other Senators must use the tools available to them and pass it. https://t.co/hOIxdITYQ0","date":"Fri Dec 17 15:12:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Smart! With so many private cameras in use at both homes and businesses, this should be a no brainer for every community working to reduce crime and catch criminals.","date":"Thu Dec 16 16:55:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s use a little foresight here. If seats were added to the @USSupremeCourt, what prevents it from becoming a never ending tactic of both parties when they’re in power and disappointed in the court?","date":"Thu Dec 16 15:27:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"*Jabs are free to Americans. They cost the federal government about $37.","date":"Thu Dec 16 14:59:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Getting vaccinated is personal responsibility. It is communal responsibility. And with jabs costing $37 and hospitalizations costing $20,000+, it is fiscal responsibility.","date":"Thu Dec 16 14:50:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I disagree with the Speaker, which is why I’m one of fifteen, bipartisan co-sponsors of @RepSpanberger’s TRUST in Congress Act, which would require all members of Congress to place tradable investments in a blind trust. I’ve done it, and believe we all should.","date":"Thu Dec 16 14:08:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Almost 24 hours after the release of texts from Fox News anchors to Mark Meadows, the news is finally shared with viewers. We should all be grateful for Brett Baier and Chad Pergram’s journalistic integrity. https://t.co/ezHo7mmyxT","date":"Wed Dec 15 00:03:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’ve seen more dishonor and moral corruption than I imagined possible during my brief time in Congress, which makes Liz Cheney’s principle and courage on the House floor right now all the more remarkable.","date":"Tue Dec 14 22:51:32 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Quite the irony that every example of voting fraud in the 2020 presidential election appears to be committed by…","date":"Tue Dec 14 22:40:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A “news” organization which fails to advise viewers that its anchors sent text messages to the WH Chief of Staff - and likely to the President himself - imploring him to take action during an insurrection is doing our nation an inexcusable and dangerous disservice.","date":"Tue Dec 14 17:48:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@markfrascone I’m the only member of the House and Senate who refuses contributions from PACs, federal lobbyists, and fellow members of Congress and their committees. So yes.","date":"Tue Dec 14 13:51:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A sad reflection of the state of corporate governance in America. https://t.co/SRuILnrHR6","date":"Tue Dec 14 13:37:01 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Fraudulent PPP loans are theft from fellow Americans. As Chairman of the Small Business Committee subcommittee on Oversight and Investigations, we will not rest until such criminals are caught and prosecuted.","date":"Tue Dec 14 13:25:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Can you imagine an American President watching our Capitol and Congress being attacked on live television, taking pleasure in the images, and refusing all pleas to respond?","date":"Tue Dec 14 04:14:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s good to honor those exploring the extraterrestrial. It’s even better to celebrate those preserving the terrestrial.🌎","date":"Mon Dec 13 20:59:19 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s time to reform our penal system to become a world-class rehabilitation system. Educate prisoners and prepare them for successful, law-abiding lives after they’re released. End the revolving door of misery. Incarceration is band-aid, and we must start treating the disease.","date":"Sun Dec 12 16:41:48 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"No one should live in fear of carjackings, assaults, shootings, and home invasions. The impunity with which criminal terrorists are stoking fear is unacceptable. We must adequately resource crime prevention and law enforcement, and support those who serve and protect us.","date":"Sun Dec 12 16:21:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"And if we hope to prevent yet another generation of crime and hopelessness, it is time to adequately invest in education, social services, and opportunity for ALL.","date":"Sun Dec 12 16:21:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Chris Wallace’s departure from Fox News is another blow to a country that can ill-afford to lose principled journalists to opinionists and angertainers. https://t.co/O7x4VMGlgF","date":"Sun Dec 12 15:37:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Have a look if you haven’t yet. Poignant and important words. Walter Cronkite wouldn’t recognize today’s America, but he surely would have issued similar sentiment about what’s at stake. And he would have surely celebrated Brian Williams. https://t.co/qhlQpXEig6","date":"Sat Dec 11 03:13:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"During another difficult period of American history, The Monkees’ music, tv show, and light-hearted antics provided much needed levity to a troubled nation. I loved them as a kid, admired their songs as an adult, and mourn Mike Nesmith’s passing today. 🎸 https://t.co/eZ3Amxnp2r","date":"Fri Dec 10 21:01:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We’ve achieved some great things for America during the 117th Congress, and there’s more to come before the curtain closes. https://t.co/Jv5B5KQGdF","date":"Thu Dec 09 22:33:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@fairvote @RepAdamSchiff You love to see it! Now off to pass the entire package. 🇺🇸","date":"Thu Dec 09 21:10:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I was 8 months old the last time American unemployment claims were this low.","date":"Thu Dec 09 19:04:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Proud to join my Democratic and Republican friends on the @ModernizeCmte in submitting 25 new recommendations today to promote civility and make Congress work better for America. 🇺🇸 https://t.co/AWjESq51D2","date":"Thu Dec 09 01:45:40 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let's use the historic Minnesota surplus to address common sense DFL &amp; GOP priorities, including child care, health care, education, paid leave, and crime reduction investments, and reduce taxes or return $$ to taxpayers to help mitigate higher prices resulting from the pandemic.","date":"Wed Dec 08 14:18:05 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Growth in income, consumer spending, and corporate profits, and the largest surplus in Minnesota history - all during a pandemic. Salutations to the @GovTimWalz administration and the Minnesota legislature for steering us through one of the most challenging years in our history.","date":"Wed Dec 08 02:15:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@atrupar Peter, Paul, &amp; Scary","date":"Tue Dec 07 19:06:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I believe provision of free rapid tests to every American can ensure safe and healthy holidays for all and significantly reduce spread during a critical period. I hope the ⁦@WhiteHouse⁩ reconsiders its strategy. https://t.co/p9HXRBDYXw","date":"Tue Dec 07 15:48:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Twins @baseballhall An outstanding player and even better man. Congratulations from all of your neighbors in #MN03!","date":"Mon Dec 06 22:59:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“Success in Congress, once measured by bills passed and constituents reached, is now gauged in many ways by the ability to attract attention.”","date":"Mon Dec 06 12:53:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"With the passing of Bob Dole, America has lost yet another lion of its greatest generation. May our rising generation recognize the fragility of democracy and employ the same respect for country and one another that he did.","date":"Sun Dec 05 21:42:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Infer a colleague is a suicide bomber. Offend an Abrahamic religion. Raise millions of dollars. Get a congratulatory call from Donald Trump. Rinse and repeat.","date":"Sat Dec 04 14:05:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Just imagine if the same energy dedicated to protecting unborn life was invested in protecting the lives of those already born.","date":"Wed Dec 01 19:35:56 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thank you, @UPS. You know best how desperately America needs these investments - from ports, to roads, to bridges, to airports, to keeping it all connected with broadband.🇺🇸","date":"Wed Dec 01 19:17:24 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The five members of the Minnesota delegation who voted to bring home &gt;$6 billion for roads, bridges, highways, water systems, broadband, ports, airports, and public transit. Now we’re headed back to Washington to help bring more investment back to the people and state we love. https://t.co/9PECqZZSRV","date":"Wed Dec 01 02:27:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The future is bright. 🇺🇸","date":"Tue Nov 30 20:20:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@gspphoto @MarkJWestpfahl Most important people in the room!","date":"Tue Nov 30 20:18:35 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thrilled to welcome @POTUS and $6B+ of our hard-earned tax dollars back to MN! The cost of replacing aging water infrastructure far exceeds many of our communities’ ability to pay. Let's unify around ensuring the water we drink in Mound and Minnetonka Beach is safe and clean 🇺🇸🥤 https://t.co/heXvkAqac0","date":"Tue Nov 30 17:42:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A Congress populated by anti-immigrant Islamophobes is a stain on America and compromises our national security. An authentic apology is due Rep. Omar and our nation.","date":"Mon Nov 29 20:53:35 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Always feels extra special to beat Wisconsin! 🏈 #Gophers https://t.co/Avg3p9LE08","date":"Sun Nov 28 00:43:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What a great #SmallBusinessSaturday! Visited some of my favorite independent shops in Excelsior and discovered (too much of) my new favorite Chocolate Chip Banana Bread at Zoe’s. https://t.co/acE3dUTBTC","date":"Sat Nov 27 23:54:06 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"There’s no better time to be alive and no better country to call home than The UNITED States of America. On this Thanksgiving, let’s resolve to work together to keep it that way. 🇺🇸 🦃","date":"Thu Nov 25 18:50:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Jobless claims at a 52-year low, personal consumption at an all time high, markets up ~20%, and an historic infrastructure bill signed into law - all since the Biden inauguration 10 months ago. As the pandemic and inflation recede, America’s future is once again bright.☀️ https://t.co/vqdN3hQZwg","date":"Wed Nov 24 14:33:09 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I witnessed Sergeant Duzan of @ChaskaPD’s remarkable leadership and humanity up close and personal today. Every American should be so fortunate to be protected and served by people like him. https://t.co/6wZTDCei2Y","date":"Wed Nov 24 04:04:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Air Force has 20 physicians in Minnesota to help our hospitals get through this crisis. It’s that bad. And totally preventable if people would just get vaccinated. Thinking about what to get your family this holiday season? Start with the gift of life. https://t.co/r2RFV9csJ3","date":"Wed Nov 24 03:46:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Representation begins with listening! I'm in Chaska hearing your ideas and feeling grateful to represent this extraordinary community. Tune in 👇 #MN03 https://t.co/FebMtruPgd","date":"Wed Nov 24 00:03:46 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This isn’t Minneapolis.\nIt’s not Seattle or San Fran.\nThis is the Capitol of The United States of America. This was an insurrection.","date":"Tue Nov 23 04:11:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Whether it’s the children of Democratic or Republican presidents, we should expect good ethics and principles over profit. This appears to be a failure of both. https://t.co/D3nT5ikMt5","date":"Sun Nov 21 16:13:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Massive failure of both the Obama and Trump administrations. We cannot be caught flat-footed when corporate interests are at odds with national interests. I intend to seek a bipartisan solution with colleagues on the ⁦@HouseForeign⁩ Committee. https://t.co/eGztfxKJ1l","date":"Sun Nov 21 14:58:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Darn right I am. Here's why ⬇️🇺🇸\nhttps://t.co/8ynpeww1DW https://t.co/2vmGbZhtzj","date":"Sat Nov 20 23:22:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Happy Birthday to a man of integrity, of decency, and of principled leadership during the most difficult of circumstances. Transformational leadership is a long game. Keep the faith and keep eating ice cream.🍦🎂🇺🇸 https://t.co/TmwrlxwUmn","date":"Sat Nov 20 18:20:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As small biz owners were showing remarkable resilience in surviving the pandemic, fraudsters were illegally obtaining relief loans. As Chair of the @HouseSmallBiz Subcommittee on Oversight &amp; Investigations, we won’t rest until every dollar possible is clawed-back and redeployed. https://t.co/WwFotJix3Z","date":"Sat Nov 20 17:08:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Remember, the Build Back Better Act is designed to invest in children, families, and the environment in the near-term so there’s LESS DEPENDENCE on government and more SELF-SUFFICIENCY in the long-term.","date":"Sat Nov 20 15:18:40 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If a vote to reduce costs for families, expand education to young children, reduce the price of medicines, and protect our environment costs some of us our jobs, so be it. Imagine if more members of Congress would place principle over self-preservation. Just imagine. 🇺🇸","date":"Sat Nov 20 14:13:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s #WomenEntrepreneurshipDay! \nA shout-out to America’s women entrepreneurs, including my mother DeeDee Phillips and Bernie Runyon, who co-owned March 4th, the hippest new wave shop in Minneapolis in the 70’s &amp; 80’s and where Prince used to hang-out. https://t.co/rYr1QdQUVv","date":"Fri Nov 19 19:02:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Just as Social Security improved the lives of retired Americans, Build Back Better will improve the lives and lower costs for American kids and families. And WE will become a better prepared, more self-sufficient, and more competitive nation for generations to come. Onwards!🇺🇸","date":"Fri Nov 19 17:21:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m very disturbed by what we’re witnessing tonight.","date":"Fri Nov 19 06:34:03 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"How does a 56 year old man speak non-stop for over three hours without using a restroom?\n\nIt Depends.","date":"Fri Nov 19 04:46:38 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"After an hour of objection to the Build Back Better Act by the Minority Leader, I’m yet to hear any acknowledgement of its purpose; to invest in children, lower the cost of living for American families and seniors, and mitigate climate change. But that’s what we shall do.","date":"Fri Nov 19 02:35:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@JohnCornyn Henry was there to support a biPAWtisan issue!","date":"Thu Nov 18 21:27:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to join Senators @JohnCornyn and @MarkWarner, my @ProbSolveCaucus colleagues, and my dog Henry to promote the CHIPS Act and return semiconductor development and manufacturing to the United States. 🇺🇸 https://t.co/lg82faV5nX","date":"Thu Nov 18 21:03:32 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Ladies and gentlemen: if you need evidence of the NRCC’s disease of disinformation, they’ll have you believe I’m a socialist. Condemning indecency certainly strikes a nerve in those who propagate it on the daily.","date":"Thu Nov 18 20:56:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What a repulsive and undignified way to treat a fellow American. The erosion of basic decency in Congress is a stain on our country and an insult to all who’ve given their lives in its service. https://t.co/1wOgsivt4b","date":"Thu Nov 18 20:06:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"America’s income &amp; GDP growth during the pandemic leads the developed world. Did we learn lessons? Yes. Is inflation a problem? Yes. But we are better positioned than any other country in the world, an advantage that will grow as we repatriate manufacturing. https://t.co/BcFs7Xhk5C","date":"Thu Nov 18 16:19:48 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We fund the IRS and POLICE to promote adherence to the law and catch lawbreakers. With a $30 trillion debt that grew by $7.8 trillion during the Trump Administration, we must to collect what’s due and prosecute those who cheat all of us. That used to be a conservative principle.","date":"Thu Nov 18 14:44:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Civility matters. Producing a video portraying the killing of a colleague is reprehensible and unbecoming of a Member of Congress. That’s why I voted to censure @RepGosar. https://t.co/50ZMol3vck","date":"Wed Nov 17 22:20:03 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Don’t be misled by political misinformation. Independent rating agencies say the infrastructure and BBB acts will not add to inflationary pressure, or to the deficit, and will likely increase labor supply. #Truth  https://t.co/qv1mcsYfFz","date":"Wed Nov 17 12:20:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A request to convene an emergency meeting of House Ethics was already made and the Ranking Member chose not to respond. The politicization of ethics is an insidious and dangerous cancer that must be exorcised from Congress.","date":"Wed Nov 17 00:02:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@EdinaMN May each of their memories be for a blessing.","date":"Tue Nov 16 15:12:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Many who voted against the bill would have you believe “only 11%” is for infrastructure. Truth is &gt; 80% is for roads, bridges, highways, broadband, ports, rail, public transit, airports, electric grid, and water. But they don’t want you to know the truth. https://t.co/zdl3IZg8fl","date":"Mon Nov 15 22:49:02 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Please be safe, Minnesotans. Consider getting vaccinated (it’s safe and effective!), get your booster when you qualify, and take precautions as we return indoors for the winter. Most of all, let’s be respectful and unite around keeping one another healthy.","date":"Mon Nov 15 22:37:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thank you to Republican Senator @senrobportman for his poignant remarks at the signing ceremony and his reminder that the bipartisan infrastructure bill being signed into law today will NOT RAISE TAXES and will help ALLEVIATE inflation. Truth.","date":"Mon Nov 15 20:47:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In 2020, then President Trump proposed a $2.0 trillion infrastructure package.\n\nToday, President Biden is about sign a $1.2 trillion bipartisan infrastructure package into law.\n\nHeartfelt gratitude to my 296 colleagues in Congress, both Ds &amp; Rs, who voted to invest in America. 🇺🇸","date":"Mon Nov 15 20:43:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"When Senator Leahy hired me as an intern in 1989, I never imagined that three decades later I’d become a colleague of his in Congress or he’d appear in five Batman movies. I’m grateful for his mentorship and remarkable service to our country. Thank you, Senator. Godspeed. 🇺🇸 https://t.co/rDoka2tbaV","date":"Mon Nov 15 17:22:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@pcket9zs @dehelgerson @KyloInMN I agree. That’s why I don’t trade stocks, haven’t communicated with my investment advisors since before the 2018 election, and have since set-up a blind trust - which all members of Congress should do.","date":"Sun Nov 14 21:02:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What filled your cup this week? https://t.co/67HPbuZsPC","date":"Sun Nov 14 18:12:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Enough of the lies from enablers of $7.8 trillion in debt and $1.9 trillion in handouts to the wealthy issued by the Trump administration. The  Infrastructure &amp; Build Back Better acts invest in America, REDUCE costs for families, and don't require massive new borrowing. Truth. https://t.co/MYtoFuhKO1","date":"Sun Nov 14 17:30:48 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Paging Mr. Flynn:\n\n“I beg you be persuaded that no one would be more zealous than myself to establish effectual barriers against the horrors of spiritual tyranny, and every species of religious persecution”.\n\n-George Washington","date":"Sun Nov 14 16:11:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Truth: Inflation will recede as supplies catch-up to booming global demand, the #BIF improves our ports, roads, rail, and bridges, and the #BBB reduces costs for American families through the child tax credit and lowering the price of child care and prescription drugs. 🇺🇸","date":"Sun Nov 14 15:08:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Today I hosted a Common Ground table of 5 Rs and 5 Ds facilitated by @braverangels. We listened to one another, found common ground with one another, and left inspired by one another. Then I delivered thank-you flags to VFWs &amp; Legions. I love this job and the people I represent.","date":"Sun Nov 14 04:29:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We owe our freedom to America's veterans and their families, including my dad Artie - who was killed in Vietnam in 1969. Hearing his voice fifty years later is a reminder of the fragility of life and democracy. Let's honor our veterans with more unity and less division. https://t.co/JusYADFYlX","date":"Fri Nov 12 14:22:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My dad, Artie, graduated law school on an ROTC scholarship just two years before being killed in Vietnam in 1969. I think of him - and all whose lives and dreams were cut short in service to our remarkable nation - on #VeteransDay and every day.🇺🇸 https://t.co/yTyLOkrH5Q","date":"Thu Nov 11 12:59:03 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@NRCC Thanks for the re-tweet! And for reminding America that Democrats invested $1.9 trillion in helping struggling people during a global pandemic while the GOP gave $1.9 trillion in handouts to the wealthiest people before a global pandemic.","date":"Wed Nov 10 14:40:50 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Many who will disingenuously blame @POTUS for today’s troubling inflation report voted against the bipartisan infrastructure bill - which allocates billions to relieving the bottlenecks, including port infrastructure and a program to hire 18-20 year old long haul truck drivers.","date":"Wed Nov 10 13:48:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"There’s no greater common cause than infrastructure - particularly for our country at this time in history. Salutations to my 296 colleagues in the House and Senate, both Democrats and Republicans, who voted in favor of strengthening America. You’re the real patriots. 🇺🇸","date":"Wed Nov 10 03:13:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The bipartisan infrastructure bill helps mitigate supply chain bottlenecks by providing billions for port improvements and a pilot program for 18-20 year olds to become long haul truckers. It’s good to vote for solutions.  https://t.co/MdzFzbIuHR","date":"Tue Nov 09 13:13:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Shameful and despicable. Because of people like him we all must walk through magnetometers to reach the House floor.","date":"Tue Nov 09 01:10:09 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@scttdvd @effis4fifi Facts matter. There are over 112,000 farmers in Minnesota. They feed you, me, and our country, and face great hardship - physical and economic - in doing so. Everyone matters. That’s my point. https://t.co/TkN0QxysDv","date":"Sun Nov 07 04:37:06 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Just sayin’. https://t.co/GCP2oXeGRm","date":"Sat Nov 06 13:06:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"While five from Minnesota voted against it for “political” reasons, I joined @RepAngieCraig and @BettyMcCollum04 in bringing home ~$7B of much needed infrastructure funding, including:\n\n$4.8B roads &amp; bridges\n$818m public transit\n$680m water systems\n$297m airports\n$100m broadband","date":"Sat Nov 06 12:31:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Hallelujah! One down. One to go.","date":"Sat Nov 06 03:21:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"To the overwhelming majority of Americans, both conservatives and progressives, who simply want competent, ethical, and respectful governance, I share your disgust with the juvenile theatrics and absence of pragmatism exhibited by members on both sides of the aisle today.","date":"Sat Nov 06 01:11:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m a pragmatic Humphrey Democrat. I’ve worked hard to ensure the #BIF + #BBB are impactful, transformational, and fiscally responsible. There’s much I’d change about the contents &amp; the process, but here we are. I ask my reluctant colleagues to join arms and make history today.🇺🇸","date":"Fri Nov 05 17:59:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The CBO warned of a $1.9 trillion INCREASE in the deficit over 10 years from the 2017 Trump tax plan. Every Republican voted for it.\n\nThe #BBB REDUCES the deficit, creates jobs, grows GDP, invests in children, families and the environment, and is paid for. I will vote for it.","date":"Fri Nov 05 14:39:50 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Every single one of these 531,000 jobs represents possibility, self-sufficiency, and a country persevering after one of the most difficult periods of our lifetimes. The American economy is LARGER now than before covid; now we must adapt to the new frontier and build back better.","date":"Fri Nov 05 13:30:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@MattWoestehoff @RepTomEmmer @SenAmyKlobuchar @SenTinaSmith Bantam King for the best ramen and fried chicken imaginable. Masseria for a remarkable food experience. The Izakaya for extraordinary Japanese. St Anselm for steak and classic American fare. Zaytinya for amazing mediterranean. Call Your Mother for a great bagel and schmear.","date":"Fri Nov 05 13:22:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s going to be a buildbackbetterbipartisaninfrastructure kind of day tomorrow.","date":"Fri Nov 05 01:32:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"How about one for all politicians?","date":"Fri Nov 05 00:16:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Looking for an unbiased, non-partisan assessment of the infrastructure bill and Build Back Better Act? Have a look at the Moody’s report: https://t.co/JhWhhW8gJr If nothing else, read its conclusion 👇🏼 https://t.co/IxocHnXq8P","date":"Thu Nov 04 23:10:09 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Inflation will continue to surge around the world until global supply chains catch-up and labor constraints ease. Higher prices are taking a big toll on American families. Ds must stop ignoring it, Rs must stop disingenuously blaming Biden, and we all must expedite solutions.","date":"Thu Nov 04 17:09:03 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thirteen years seems awfully long ago, but don’t lose faith in the belief that anything is possible in America. Our challenge is to ensure it’s possible for everyone. That’s why we must invest in children, families, education, health, environment, and a robust economy. #BBB+#BIF","date":"Thu Nov 04 14:50:02 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This would be a great day for Democrats to do less speaking and more listening.","date":"Wed Nov 03 12:32:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Minneapolitans have overwhelmingly and appropriately voted to maintain a police department. Now we ALL must work to recruit, train, and retain honorable officers and develop new strategies to ensure everyone feels safe and secure in their neighborhood - no matter their zip code.","date":"Wed Nov 03 02:28:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This is absurd. Give me one good reason why foreign donors should be allowed to finance referenda campaigns in the United States. @RepKatiePorter’s HR 1516 will address it, and we must pass it asap.","date":"Tue Nov 02 18:40:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@snuggerson @doyleberg @toreyvanoot @RepDustyJohnson Right! 🧀 🌋","date":"Tue Nov 02 18:13:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m eager to vote YES for child care, universal pre-k, the child tax credit, affordable higher ed, climate investments, improved health coverage, &amp; lower drug prices w/o more debt. But for goodness sakes, let’s give America a win and vote on the bipartisan infrastructure bill.🇺🇸","date":"Mon Nov 01 18:40:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Midshipdog Henry wishes everyone a safe, meaningful, and rewarding Halloween. 🎃 👻 🍬 https://t.co/yAiqCgg3Ch","date":"Sun Oct 31 15:23:32 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The coup in Sudan undermines important progress the Sudanese people have made towards installing a democratic and civilian-led government. I wholeheartedly condemn it, and urge the military junta to refrain from responding to protestors with violence. https://t.co/JssGKCn8uI","date":"Fri Oct 29 18:11:45 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@BradSchaeppi @RepAGonzalez @RepKinzinger It’s true. Both parties gerrymander. It’s unhealthy for democracy, reduces the number of competitive districts, and should be addressed by independent commissions.","date":"Fri Oct 29 17:10:38 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Losing honorable Republicans like @RepAGonzalez and @RepKinzinger to Trumpism diminishes Congress and imperils our mission to ensure truth, principle, and rule of law remain the bedrock of our democracy.","date":"Fri Oct 29 16:19:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I voted NO tonight on a short-term extension of transportation funding because:\n1. I don’t always vote with my party.\n2. We should stay in Washington, conclude the BBB negotiation, pass the bipartisan infrastructure measure, and restore a bit of faith in our system of government.","date":"Thu Oct 28 23:25:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Resist metacracy.","date":"Thu Oct 28 18:59:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Kudos to @GovTimWalz and @TimPawlenty, two trustworthy Tims showing Minnesota that sound public health guidance is worth heeding, no matter your politics.","date":"Tue Oct 26 21:48:24 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"He shopped at my mom’s Minneapolis store, March 4th, in the 70’s. My parents attended the recording of Purple Rain @FirstAvenue in ‘83. And this week, I’m helping lead the effort to award a Congressional Gold Medal to a N Mpls, Minnesota, American, and global legend.💜 #Prince https://t.co/eEa2ifcqTd","date":"Tue Oct 26 13:13:01 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@ChadPergram 💜","date":"Mon Oct 25 20:53:06 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Never imagined our United States of America would place in the bottom half of world nations on a ranking of political stability and absence of violence and terrorism. This must be our clarion call to action.","date":"Mon Oct 25 16:07:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@bryanhansel You make Twitter a better place, Bryan. Thank you!","date":"Mon Oct 25 13:15:07 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"That’s why I screamed,“THIS IS BECAUSE OF YOU!”, at Paul Gosar on the House floor on Jan 6 as he was undermining our democracy and his traitorous devotees were storming the Capitol.","date":"Mon Oct 25 13:13:48 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@MrAndersonGov What a great group and wonderful dose of optimism!","date":"Fri Oct 22 18:11:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thanks to Christine of @MaudBorup and Chris of @CHRobinson for lending your time and expertise - it's always good to have Minnesota voices at the table. Here's the full hearing, we have #lotstodo: https://t.co/mpO2PPUbLi","date":"Thu Oct 21 16:50:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Are you worried about supply chain disruptions? Me too.\n\nPolitical pundits are pointing fingers and casting blame, but I'm more interested in solutions. I called a @HouseSmallBiz Oversight hearing to learn from #smallbusiness owners on the ground and to ask how Congress can help. https://t.co/HcygvFw44E","date":"Thu Oct 21 16:48:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Their successes, failures, fortitude, and hypocrisies serve as reminders to our nation of the imperfection of humankind and the fragility of democracy; inspiration to keep progressing to the principles embedded not in the men themselves, rather in the country they created. 3/3","date":"Wed Oct 20 02:33:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m all for removing statues honoring those who fought FOR slavery and against America; they can be placed in museums where they belong. But I believe our Founders should be displayed in public places. 2/3","date":"Wed Oct 20 02:33:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thread: Jefferson’s ownership of slaves, and mistreatment of Native Americans and women is a deserved stain on his legacy. Yet he’s the man who wrote our document of democracy and self-determination, advocated for universal education, and ensured our religious freedoms. 1/3","date":"Wed Oct 20 02:33:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"America needs more leaders with the principles and statesmanship of Colin Powell. https://t.co/Hlx4xLirCR","date":"Tue Oct 19 01:45:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Does anyone else believe fundraising shouldn’t be allowed from 9am-5pm during workdays in the US and should never be conducted overseas?","date":"Thu Oct 14 23:54:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@MrAndersonGov @USNatArchives Looking forward to it!","date":"Thu Oct 14 16:39:24 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Typical COVID hospitalizations cost $51,000-$78,000. Two vaccine shots cost the government $37. #FiscalResponsibility","date":"Wed Oct 13 16:53:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Antagonistic representatives, perverse incentives, and a thriving \"angertainment\" industry are the roots of a dysfunctional Congress. Pleased to join my friend and Republican colleague @RepBrianFitz on @NEwsNationNow to talk about how we're trying to do things differently. https://t.co/sbyGGG6Rog","date":"Wed Oct 13 01:46:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@leedrutman Let’s say you had to make a concise case for fusion balloting over RCV during an elevator ride. How would you do so?","date":"Tue Oct 12 21:46:52 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A feel good story with which to start your day. Happy Tuesday, everybody!","date":"Tue Oct 12 15:21:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@andrewzimmern @CheapTrickRick @cheaptrick While My Guitar Gently Weeps","date":"Mon Oct 11 03:31:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s dishonorable. It’s dangerous. It’s irresponsible. It’s unforgivable. And it’s downright pathetic. He knows the truth.","date":"Mon Oct 11 03:22:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As you begin your weekend, remember that we will persevere and optimism is just as contagious as fear.","date":"Fri Oct 08 23:56:09 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"How do we incentivize collegiality and problem solving in government? Draw competitive districts and employ ranked choice voting. More choices + more competition = more effective government. Thrilled to introduce the #VoterChoiceAct with @SenatorBennet and @SenAngusKing. 🇺🇸 https://t.co/PMxVej5YW3","date":"Wed Oct 06 15:34:09 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In what world can @LeaderMcConnell freely use the nation’s credit card to rack up $7.8 trillion in federal debt and then refuse to pay the invoice? Hard to imagine anything less patriotic and more dishonorable.","date":"Wed Oct 06 13:38:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@mtrollingacres I hear you! That’s why I’m a co-sponsor of HR 4131, the Better Care, Better Jobs Act - a stand alone HCBS investment that I’m advocating for inclusion in the Build Back Better Act.","date":"Tue Oct 05 20:50:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Conservatism in its genuine form honors financial obligations. Mitch McConnell refusing to address the debt ceiling means he’s refusing to pay the $7.8 trillion in credit card charges that accrued under HIS watch. That’s not conservatism. That’s dishonor.","date":"Tue Oct 05 13:32:46 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Conservatism in its genuine form respects tradition, and tradition dictates that United States Senators exhibit decorum. Do better, Senator.","date":"Tue Oct 05 03:34:02 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I am thrilled to see my constituents at our in-person town hall tonight at the Rogers Highschool Performing Arts Center. Doors open at 6:00 PM and our conversation begins at 6:30 PM.  Save some time, and sign in below before you arrive. See you there! https://t.co/7X6XBZ7zum","date":"Mon Oct 04 21:47:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Facebook &amp; Instagram ⬇️\n\nHappiness ⬆️","date":"Mon Oct 04 21:27:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Medicare and Social Security consume ~$2 trillion annually to support retirees.\n\nThe Build Back Better Act would invest $350 billion annually in children, families, education, green energy, and climate resiliency. And it's paid for. \n\nIf that's \"radical\", I need a new dictionary.","date":"Mon Oct 04 20:10:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My optimism today, while authentic, was clearly misguided. Apologies to all who were inspired by my hopefulness. But we’ll dust ourselves off, pave a path forward, and pass the infrastructure bill and a meaningful and transformational Build Back Better Act. Keep the faith.","date":"Fri Oct 01 21:40:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@JustSchmeltzer @laurapdavison @billscher Yes I did.","date":"Fri Oct 01 21:34:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m more optimistic than at any point during this arduous process. We’ve walked through the rain, and the rainbow is arriving this afternoon in the form of @POTUS to close the deal. We’re going to get this done, because failure is not an option for this family or for America. 🇺🇸","date":"Fri Oct 01 17:35:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Since we’re now recessed but not adjourned, tomorrow will be recorded as today because in Washington that kind of stuff is allowed.","date":"Fri Oct 01 03:36:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Our Founders designed a system of governance intended to make legislating difficult. And it works better than they could have ever imagined.","date":"Fri Oct 01 03:08:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Manchin just defined what he’ll support in human, climate, and infrastructure investment and Sinema appears to have drawn a similar red line. So the question for Democrats is a remarkably simple one: Is $2.5T+ in transformational investments better than $0 and abject failure?","date":"Thu Sep 30 17:51:35 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We came up a run short last night on the diamond, but let’s win one for Uncle Joe and America today. #infrastructure ⚾️ 🇺🇸 https://t.co/WIKNO6Z3RX","date":"Thu Sep 30 13:16:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@scottwongDC @AndrewSolender Ope!👀","date":"Wed Sep 29 20:29:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The absence of pragmatism among Democrats is as troubling as the absence of principle among Republicans.","date":"Wed Sep 29 19:54:24 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As the literal foundation on which people congregate, communicate, and conduct commerce, infrastructure enables American freedom and liberty. That's why the former president proposed a $2 trillion plan, and why it's remarkable (and shocking) to watch @GOPLeader whip against it.","date":"Tue Sep 28 17:53:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepBethVanDuyne Me too!","date":"Thu Sep 23 18:51:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@WHCOS B4","date":"Wed Sep 22 19:37:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I agree, @RepTomEmmer, it's time for answers. Pleased that my amendment requiring @SecAFOfficial to tell us why the C-130 reduction is necessary - esp. since it's inconsistent with recent mobility capability requirement studies - was added to NDAA today with MN delegation support","date":"Tue Sep 21 21:50:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m incredulous that certain D colleagues would shut down our government rather than defend one of our most important allies and only Jewish nation in the world from indiscriminate rockets fired by terrorists who refuse to even recognize their right to exist. Read this 👇🏼","date":"Tue Sep 21 19:12:24 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m always troubled by use of force, whether by Israel or our own country. But Iron Dome protects Israel from indiscriminate rockets and missiles fired by sworn enemies who refuse to even recognize their right to exist.","date":"Tue Sep 21 16:43:52 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It's #ConstitutionDay! Here's what's on my mind 234 yrs after historians, intellectuals, &amp; revolutionaries agonized over the wording of our founding document- one they hoped would guarantee power centered in the hands of citizens for generations to come. 🇺🇸https://t.co/T987MwS2OF","date":"Fri Sep 17 15:28:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I can’t think of anything less American than rejecting immigrants - particularly ones who helped us during a war.","date":"Fri Sep 17 03:31:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Congress is losing a principled, honorable, conservative voice - and I a valued friend. We’re going to miss you, @RepAGonzalez.","date":"Fri Sep 17 01:41:52 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Drive-by kindness. Love that!","date":"Thu Sep 16 13:47:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In Congress and in cul-de-sacs, you reap what you sow. https://t.co/yYiUnYsoxK","date":"Wed Sep 15 22:44:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We’ve already lost 663,000 Americans to covid-19.\n\nThat’s more than died in WWI, WW2, Korea, Vietnam, the War on Terror, and the Revolution.\n\nCombined.\n\nLet’s protect our neighbors, not demean them or risk their lives. Get vaccinated or - at the very least - get tested regularly.","date":"Wed Sep 15 18:02:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My pal, @RepDustyJohnson is a principled conservative. I’m a pragmatic progressive. We’re connected by friendship, a mutual love of America, and using common sense to discover common ground. Please join us. 🇺🇸","date":"Tue Sep 14 21:11:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Kudos to @SenAmyKlobuchar for leading the effort to establish reasonable, national voting standards, restore faith in our elections, and preserve our democracy. We must have a respectful and spirited debate about its provisions and commit to action.","date":"Tue Sep 14 15:52:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Enough grandstanding. As one of 25,000 Gold Star children of the Vietnam, Iraq, &amp; Afghanistan wars, there's no more painful question to ponder than \"was it worth it\". Our failure isn't Democratic or Republican. It's multi-generational, bipartisan, administrative, &amp; Congressional.","date":"Tue Sep 14 01:35:50 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Condemning and distancing oneself from political violence isn’t enough. Everyone with a political platform in America must unify to tone down the rhetoric and recognize the consequences of dangerous, inciteful behavior.","date":"Mon Sep 13 21:47:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Former Presidents from opposing parties referring to one another as “friends” should be the American norm - not the exception.","date":"Sun Sep 12 03:43:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Missing my pal, Gordy Aamoth (third from left), and the 2,995 others we lost on that crisp Tuesday morning twenty years ago. Let’s honor their memories by reflecting on the unity we felt after 9/11 and committing to its pursuit once again. #NeverForget https://t.co/p6yQ6MPQpo","date":"Sat Sep 11 11:52:46 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"No faith community should be subject to threats of violence in the United States of America. We must recommit to protecting one another and joining together to extinguish hate in all its ugly forms.","date":"Fri Sep 10 15:34:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Remember the cries of unconstitutional government overreach when Pennsylvania required wagons and carriages to travel on the right side of the road in 1792?","date":"Fri Sep 10 13:21:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Put another way, the Delta &amp; Gamma variants (+ dangerous ones yet to come) emerge when the virus mutates as it snakes its way through people lacking antibodies. Absent prior disease or vaccine, you’re at risk, a link in the covid life chain, and a threat to public health/liberty.","date":"Fri Sep 10 02:53:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If you live in the woods and don’t want a vaccine, that’s your prerogative. But when you step foot into a store, a school, a factory, an airport, or an office, now you’re potentially compromising my freedom, my liberty, and my health. Real patriots protect their neighbors.🇺🇸","date":"Fri Sep 10 01:46:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“If only we had Robert E. Lee to command our troops in Afghanistan?”\n\nLee would have resigned his commission before commanding troops of color, which now comprise &gt;30% of US service members.","date":"Thu Sep 09 15:40:45 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Just this spring I paid a memorable visit to Michael London Bean’s classroom in N Mpls. A bright eyed, optimistic 12 year-old, he is now the 7th child to die by homicide in Minneapolis this year. I’m heartbroken, angry, and disgusted by America’s epidemic of gun violence.","date":"Thu Sep 09 15:10:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m relieved to learn of @SenAmyKlobuchar’s favorable prognosis and have the entire breast cancer survivor community - and their families - on my mind today. ❤️","date":"Thu Sep 09 14:19:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Friendly reminder to colleagues promoting misinformation and objecting to the investigation of an insurrection: Marisa Mayer left Yahoo! over four years ago.","date":"Sun Sep 05 17:57:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Chicken soup for your Friday night Twitter soul.","date":"Sat Sep 04 03:00:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This is how we enhance public safety, support police, and improve communities - all at the same time.","date":"Thu Sep 02 18:04:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Just as the Supreme Court has affirmed Americans’ right to bear arms, it has affirmed women’s rights to make decisions about their own bodies. I’m appalled by yesterday’s SCOTUS action, and am joining with like-minded colleagues to protect women from illegal government overreach.","date":"Thu Sep 02 17:54:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Law and order is the foundation of democracy. When elected officials ignore facts and advocate for committing crimes, that foundation cracks. Rep. Cawthorn’s rhetoric is a threat to all of us, and it’s time for real patriots to condemn it and marginalize those who propagate it.","date":"Tue Aug 31 15:04:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I wish to correct an earlier tweet that I have since deleted. According to the Minnesota Department of Health Commissioner, ~99.3% of Minnesotans who have been fully vaccinated have NOT been hospitalized. Vaccines work. That’s a fact. \nhttps://t.co/UuXaME4Ylw","date":"Mon Aug 30 21:05:46 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Source: Minnesota Department of Health https://t.co/oGjZMSVaJ1","date":"Mon Aug 30 18:51:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@BrianaRoseLee To answer your question, Briana, because I took a covid test that morning (negative), I’m double vaccinated, I keep my interactions distanced, brief, and entirely outdoors and everyone who comes to speak with me does so electively. I’m following the science.","date":"Mon Aug 30 18:08:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In late 2019, @RepColinAllred and I challenged then Sec. of State Pompeo about why Congress was being kept in the dark about the agreement he was negotiating w/the Taliban. I am committed to ensuring that Congress stops abdicating its responsibilities. https://t.co/uZWoOC4gJw","date":"Sun Aug 29 14:00:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":".@RepAndyKimNJ is a national treasure, and his description of a heart wrenching case in Afghanistan is one of thousands on which Congressional offices are working at this very moment. Fulfilling this mission is imperative for the maintenance of American honor around the globe.","date":"Sun Aug 29 03:26:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As irresponsible and misguided as his request might be, Mr. Cawthorn’s faith in Vice-President Harris is noted.","date":"Sat Aug 28 13:49:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Welcome to The United States of America 🇺🇸 \n\n📷: AP/Jose Luis Magana https://t.co/iKVqcVQ90V","date":"Sat Aug 28 02:07:54 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We will hunt you down and make you pay.","date":"Sat Aug 28 01:40:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Dear @Twitter: How can you verify me but not the far more notable @ACPage_77 - an NFL Hall of Famer, former Supreme Court Justice, founder of the Page Education Foundation, national treasure, and all around extraordinary human being? #ComeOn","date":"Fri Aug 27 21:27:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Praying for our wounded Marines and all who were injured or killed in the blast. Targeting people seeking safety and refuge is indescribably sickening and evil.","date":"Thu Aug 26 15:18:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Henry wishes to remind you today is #NationalDogDay. https://t.co/UshLLUzShz","date":"Thu Aug 26 12:41:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Stowydad @dhmontgomery The former.","date":"Wed Aug 25 20:52:37 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@dhmontgomery Totally.","date":"Wed Aug 25 20:51:03 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"And it must noted that our soldiers and diplomats on the ground in Kabul are doing extraordinary work. They’re the ones suffering the most from the failures in planning, preparation, and strategy. 4/3","date":"Wed Aug 25 20:39:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Almost 25-30 different task forces, each running in different directions. Little coordination or clear strategy. SIVs + parole applicants are stranded as extraction is focused only on US citizens and card holders. Everyone else? Head for Pakistan or find a charter flight. 2/3","date":"Wed Aug 25 20:33:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I have to call it like I see it. My staff along w/those in every Congressional office are working their tails off saving lives before it’s too late. Ask any of them, the ones doing the advocacy work, and they’ll tell you the situation in Kabul is worse than we’re being told. 1/3","date":"Wed Aug 25 20:33:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"There’s lots to litigate over the coming months. Dissent cables, planning, strategy, coordination, command and control, etc., but for now it must be an iron clad guarantee that America will not rest until everyone to whom we made a promise is provided refuge. #principle 3/3","date":"Wed Aug 25 20:33:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A very sober and objective assessment of our twenty-year Afghanistan policy. A good read no matter your opinion. https://t.co/7HU9u1d6lV","date":"Wed Aug 25 16:17:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Today we advanced the Bipartisan Infrastructure Framework and the Build Back Better Act, which will now be debated and assembled in committees. I’m intent on ensuring each are impactful, efficient, and responsible investments in American children, families, and businesses.🇺🇸","date":"Tue Aug 24 21:08:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Today I'll vote for #HR4 &amp; restoration of portions of the 1965 Voting Rights Act requiring localities w/histories of voter suppression to obtain federal clearance before changing election laws. I do so in memory of John Lewis &amp; w/this conversation w/@shelettaisfunny on my mind. https://t.co/d2iCLVmu3I","date":"Tue Aug 24 20:55:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"To my amazing staff, and those in every office, working to ensure safe passage for those trying to escape Afghanistan. To the airline employees sharing their time. To our soldiers and diplomats on the ground. To every American who can see him/herself in this photo. Thank you. 🇺🇸 https://t.co/Us2cg4l7aw","date":"Tue Aug 24 16:56:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"So much to love about this story 🇺🇸","date":"Tue Aug 24 15:21:05 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It has been named: \nThe Build Back Better Act #B3A","date":"Tue Aug 24 13:10:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Investing in America’s physical infrastructure, children, families, clean energy future, and small businesses should be unifying, and I look forward to ensuring we do so effectively, efficiently, and responsibly. 🇺🇸 5/5","date":"Mon Aug 23 20:24:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"While I am among many advocating for the bipartisan infrastructure bill to be brought to the floor independent of reconciliation, my support for small businesses takes precedence. Thus, having received the assurances I was seeking, I will be supporting the budget resolution. 4/5","date":"Mon Aug 23 20:24:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"With countless livelihoods and jobs on the line, I communicated to Democratic leadership  this weekend that there must be a targeted relief package for these industries either as part of the reconciliation process or concurrent with it. 3/5","date":"Mon Aug 23 20:24:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This is especially true for restaurant, live events, hospitality, and fitness industries, which rely on in-person gathering and have been disproportionately impacted by COVID. Too many of these businesses have also been shut out of recent federal and state relief programs. 2/5","date":"Mon Aug 23 20:24:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"THREAD re this week’s votes: \n\nAs a small business owner and Chairman of the House Small Business Subcommittee on Oversight and Investigations, I’ve spent the past weeks on the ground in Minnesota meeting with and listening to small business owners struggling to stay afloat. 1/5","date":"Mon Aug 23 20:24:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Beautiful words from @RepPaulMitchell in his last interview with @jaketapper; “Don’t just fill up space. Make a difference. There’s value in people you disagree with.” \n\nRest in peace, my friend.","date":"Sun Aug 22 17:35:03 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Go, ⁦@ShelettaIsFunny⁩! A wonderful mother fulfilling her son’s heartfelt wish for her to get vaccinated. https://t.co/U9sgd368MA","date":"Sat Aug 21 13:33:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Heartwarming and heartbreaking.","date":"Sat Aug 21 02:13:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@OsseoMGPress Welcome home, Grace!","date":"Fri Aug 20 20:01:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’ve been dreaming of exploring the west in one of these since I was a kid. Welcome to #MN03, Winnebago! We and @CityofEP are thrilled to be your new corporate home.🇺🇸 https://t.co/ZX1KZVhhFs","date":"Fri Aug 20 15:56:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"So proud to kick off #CongressionalStartupDay with these amazing entrepreneurs from #MN03, and to support the efforts of startups everywhere with the IGNITE American Innovation Act, the New Business Preservation Act, and beyond. [2/2] https://t.co/N9ghzs4k0z","date":"Thu Aug 19 21:21:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Startups account for a disproportionate amount of innovation, economic growth, and job creation in this country, so @RepYoungKim and I are leading members of Congress across America in honoring their grit and contributions. Welcome to #CongressionalStartupDay (week!) [1/2]","date":"Thu Aug 19 21:21:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Great Minnesota Get Together mustn’t become the great Minnesota covid spreader. Absent mandatory safeguards, we all must do our part to ensure the safety of our fair-going friends and neighbors. We’re in this together and can only get out of it together.","date":"Thu Aug 19 20:46:53 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"How refreshing and important to see multiple Democrats, I among them, publicly criticizing the Administration without fear of reprisal or retribution.🇺🇸","date":"Thu Aug 19 15:27:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thanks to all who have expressed concern for our Washington, DC staff in light of the bomb threat. Everyone is safe and, once again, America is forced to confront the growing risk posed by domestic terrorists.","date":"Thu Aug 19 15:15:54 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@chemserv @NACD_RD @Doug_NACD Thanks back to you for the hospitality and education.","date":"Thu Aug 19 14:31:06 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Every one of those 169 million dollars belongs to American taxpayers. If reports are true, Ashraf Ghani must be brought to justice and Congress must take steps to ensure our foreign aid doesn’t enrich corrupt leaders and end up supporting our adversaries.","date":"Thu Aug 19 14:31:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I agree, Caitlin. Government (or anything for that matter) only works if we work together. I think we learned that in Kindergarten 🤔","date":"Wed Aug 18 21:13:45 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My team and I are monitoring the situation in Kabul closely and doing everything possible to ensure the safety of your loved ones. It’s imperative we protect American citizens and honor our promise to our Afghan partners during this chaotic time.","date":"Tue Aug 17 16:17:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If you know someone in Afghanistan with an approved petition for a Special Immigrant Visa, email NVCSIV@state.gov or call 603-334-0828 for information. If you know someone without an approved petition, call my office at 952-656-5176 and we’ll try to arrange an urgent evacuation.","date":"Tue Aug 17 16:17:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Paul was a friend, a gentleman, and a man of remarkable principle in an era increasingly devoid of it. My heart breaks for his family and our country. Rest in peace, my friend, and may your memory inspire all of us to treat each other with the respect &amp; dignity our nation needs.","date":"Mon Aug 16 18:16:53 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Enough of the juvenile finger pointing. Afghanistan isn’t a Democratic failure or Republican failure. It represents a collective failure of American strategy. Our outstanding military can defend, protect, and keep the peace, but democracies can only be built from the inside.","date":"Mon Aug 16 13:28:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Democracy cannot be imposed. It must be earned.","date":"Sun Aug 15 21:14:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"With 265 employee-owned companies, Minnesota leads the nation per capita. THIS is the American capitalism which policy-makers should be encouraging and supporting, and I’m committed to inspiring more ESOPs and more sharing of success by our nation’s businesses. 🇺🇸","date":"Sun Aug 15 21:11:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My sentiment exactly. The decision to leave Afghanistan was made by the former President. The execution of that decision - and the attendant consequences - must be owned by the current administration.","date":"Sun Aug 15 17:28:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As a Gold Star son of the Vietnam War listening to the White House briefing on the Afghanistan War withdrawal, my heart particularly aches for the thousands of Gold Star families of an eerily similar and painful episode forty-six years later.","date":"Sun Aug 15 14:06:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My heart breaks for the Americans and Afghanis who gave their lives and livelihoods to securing a new future for Afghanistan, but history shows that securing brighter futures must come from within a nation. It’s almost never possible - or advisable - from the outside. 2/2","date":"Sat Aug 14 23:50:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"While our Afghanistan exit strategy has been a failure, the decision to do so remains the correct one. Over twenty years we’ve lost 2,300 Americans, suffered 20,000 injuries, spent $2.2 trillion, trained 300,000 Afghani troops, and most of the county fell in just days. 1/2","date":"Sat Aug 14 23:50:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@ShelettaIsFunny @Cleavon_MD @MaplewoodMN @HyVee @GovTimWalz @LtGovFlanagan You did a wonderful thing today, @ShelettaIsFunny. Proud of you! https://t.co/d7t5dKO9gU","date":"Sat Aug 14 00:07:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@EPChamber Looking forward to it!","date":"Fri Aug 13 19:16:48 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If you happen to be driving down 101 past Lotus Lake in ⁦Chanhassen⁩ today, stop by Mason’s Creative Lemonade stand. A great young entrepreneur making a delicious drink and raising awareness for a important cause; opioid addiction. Thanks for brightening my day, Mason.🍋🇺🇸 https://t.co/LxUU7HkbKA","date":"Fri Aug 13 19:06:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Honored to join @SecVilsack at @2harvest to listen and learn from those who dedicate themselves to feeding hungry children, individuals, and families in our community. I’m committed to supporting policy and programs to ensure no one goes to sleep hungry in America. No one.","date":"Fri Aug 13 16:51:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I choose the latter. 🇺🇸💙","date":"Thu Aug 12 15:36:40 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Minnesota's live event industry, made up of small businesses that rely on people gathering, has been left behind. Yesterday, @RepAngieCraig and I met with caterers, event planners, trade show pros, public speakers, and set designers to see how @HouseSmallBiz can offer support. https://t.co/9Sh6gMT7WE","date":"Thu Aug 12 15:09:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thinking I’ll wear a sailor suit for my mom’s birthday today. ❤️🎂 https://t.co/W0A8tfHipW","date":"Thu Aug 12 13:54:06 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Watch this 3 min message and consider showing the world, at least in this case, that Twitter can disseminate optimism just as effectively as fear. https://t.co/i8HnuwCoC9","date":"Thu Aug 12 03:09:53 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"An insightful afternoon on patrol with @BPPD Officer of the Year, Chad Miller. We discussed social policy, police &amp; criminal justice reform, and how to attract more compassionate and principled officers like himself. I’m grateful to Officer Miller and all who serve with dignity. https://t.co/PsnXczjPOM","date":"Wed Aug 11 18:02:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Lawmakers who spread lies about vaccines and inspire insurrection are rewarded while those breaking quorum to protect voting rights are punished with arrest. There’s nothing more dangerous and less patriotic.","date":"Wed Aug 11 03:26:24 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Earlier this year I joined @LeaderHoyer, @RepJasonCrow, and over 100 colleagues in asking the @USGAO to investigate the security failings of January 6th. Despite warnings and ample signals, @DHSgov did not designate that day a special security event. The question remains, “Why”?","date":"Tue Aug 10 21:52:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"After months of bicameral, bipartisan work, we showed that Congress can still function - despite the best efforts of many to undermine it. Now let’s do as @POTUS asks; bring it to the House floor for a fast vote and send it to his desk “as soon as possible”. His words, not mine.","date":"Tue Aug 10 17:05:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Praying for the pilot and his family and grateful a worse tragedy was avoided in Victoria this evening. https://t.co/UFGc0IURIf","date":"Sun Aug 08 01:46:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My dad, Capt. Artie Pfefer, was killed in Vietnam in 1969 when he was just 26 years-old. Please join me in honoring him and the ~1.8 million Americans since 1782 who’ve been awarded the Purple Heart for their remarkable sacrifices on behalf of our nation. 🇺🇸💜 #PurpleHeartDay https://t.co/2ogvvfBrl8","date":"Sat Aug 07 13:03:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We've lost a fierce advocate, but Richard Trumka's dedication to defending labor rights and equality for the working people of America will inspire generations to come. 🇺🇸","date":"Thu Aug 05 22:28:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Actually, @RepDeanPhillips supports law enforcement AND stands with those who don’t want people to lose roofs over their heads during a pandemic. #NRCCLiesAboutEverything!","date":"Thu Aug 05 18:13:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It's kindergarten stuff! Congress has forgotten how to get along. We need to create space for Americans to come together and pursue common ground, so @RepDustyJohnson and I are kicking off an experiment in civility right in the Midwest - and inviting you to join us. Stay tuned 🇺🇸","date":"Thu Aug 05 16:13:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We come from different places, perspectives, and politics, but my unlikely friendship with @RepDustyJohnson might just be a lesson for all of us. 🇺🇸","date":"Thu Aug 05 14:03:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Tonka, Trojan, or any kind of Minnesotan, we all have something to learn and love from Jim Ramstad's legacy of principled service. A life well lived.","date":"Wed Aug 04 15:28:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Agreed. Resign now and don’t force legislators to confront such staggering hypocrisy by impeaching you.","date":"Tue Aug 03 16:11:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@mngop @CoriBush Yes, @mngop, that’s at the US Capitol where we do our work. Thanks for highlighting my effort to help keep people in their homes and ensure landlords receive the rent on which their own families rely. And don’t worry, you’ll be seeing plenty of me in MN over the next 6 weeks. 😀","date":"Tue Aug 03 16:06:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My heart aches for the family of Officer Hashida. I never walked in his shoes, but those who minimize the events of Jan 6 and the trauma endured by everyone there that day are doing a disservice to our country and all who serve it. Rest in peace, officer. We will not forget.","date":"Tue Aug 03 01:09:02 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@AskAprilJ @PTAnderson_MN https://t.co/0P3yr5Tryy","date":"Mon Aug 02 22:37:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The best way to honor the life and legacy of Jim Ramstad is to treat one another with the respect, curiosity, and authenticity that he practiced during a life well lived and a career of consequence. Thanks to @PTAnderson_MN  and all who inspired an honor so well deserved.","date":"Mon Aug 02 17:39:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Today I joined @repcori and housing advocates to listen, learn, and share my commitment to finding a solution; one that ensures at risk families don’t get evicted from their homes and lessors receive the rent they’re due - and on which their own families depend. We can and must.","date":"Sun Aug 01 23:45:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Eighteen hours later. Same mood.","date":"Fri Jul 30 18:36:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I remember when the @MNGOP would be celebrating the fact the United States’ economy is now larger than it was before the pandemic and the DJIA is at an all-time high. Inflation was predicted and will moderate as supply chains catch-up and pent-up demand is met. Economics 101.","date":"Fri Jul 30 16:39:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Amazing we’ve devolved this far, but it’s surely worth wearing a disguise to safeguard your life and the lives of others. 🥸","date":"Fri Jul 30 16:32:09 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"America needs improved infrastructure and restoration of faith in our government. This package helps accomplish both and, as Henry says, “It’s bi-paw-tisan”. 🐶","date":"Fri Jul 30 15:36:05 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"World leaders must open their eyes to the tragedy occurring in Tigray and immediately demand that the Ethiopian government allow food convoys through to prevent horrifying starvation among children.","date":"Fri Jul 30 12:50:46 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepBarryMoore Remarkable and sad for a man whose profile reads, “Do justly. Love mercy.” to snap a covert photo of a colleague leaving the Senate side of the Rotunda (where masks aren’t required) and post it under false pretense. I believe in science and in following rules. #IWillComply","date":"Fri Jul 30 01:14:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What a beautiful moment.","date":"Thu Jul 29 13:19:32 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Minnesota and America ❤️@sunisalee_ !! 🥇","date":"Thu Jul 29 13:08:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Speaking for so many of us. Kudos, @RepTimRyan https://t.co/1ssyfMj1S5","date":"Thu Jul 29 02:48:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We should all be disgusted by the childish behavior being exhibited on the House floor today. Respect for rules and one another should be the most fundamental expectation of a Member of Congress.","date":"Wed Jul 28 18:37:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Not only is Camilla Hallman an extraordinary member of the @HouseForeign staff, she bakes AMAZING treats on markup days. (And makes sure my colleagues save one for me!) 🍪 https://t.co/iJ0OzwMIOT","date":"Wed Jul 28 14:24:35 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“Why is telling the truth hard?”, Officer Dunn asks. Because the truth can be inconvenient to the dishonorable among us who allow the pursuit of power to take precedence over principle. https://t.co/P6P8EdB7cu","date":"Tue Jul 27 20:32:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"May today’s remarkable and poignant testimony by Sgt. Gonell and Officers Fanone, Hodges and Dunn inspire a new generation of similarly honorable and principled young Americans to become police officers. Our nation needs you now more than ever. 🇺🇸","date":"Tue Jul 27 16:34:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"While the country is gripped by police officers’ emotional and powerful testimony at the Jan 6 Committee hearing, this is what’s tweeted by the Minority Leader of the United States Congress. https://t.co/EMjjp1gEyt","date":"Tue Jul 27 16:21:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":".@RepKinzinger’s remarks in the Jan 6 Committee hearing are among the most important, poignant, and courageous of this era. It should be played as far, wide, and regularly as possible.","date":"Tue Jul 27 15:42:50 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If you consider yourself a patriot and supporter of law enforcement, please watch this. Over, and over, and over. https://t.co/8eWthXoVtX","date":"Tue Jul 27 15:30:09 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“There are some who express outrage when someone kneels calling for social justice. Where are those same people when there’s a violent attack on law enforcement and the Capitol? I’m still waiting.” -USCP Sergeant Aquilino Gonell","date":"Tue Jul 27 15:21:35 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Either the @GOPLeader is ill-informed or intentionally lying. Neither @SpeakerPelosi (who he blames) nor @LeaderMcConnell (who he doesn’t blame) are responsible for Capitol security.","date":"Tue Jul 27 13:18:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Not only will President Biden not resign, he would surely beat this man in a cognitive competition - at which point said man would claim it was fixed and stolen. https://t.co/IMtu4XFIG7","date":"Mon Jul 26 13:24:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"To the Motzko family and all who lost loved ones and friends in this horrible accident, my heart is with you. May their memories be for blessings.","date":"Mon Jul 26 03:13:01 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased that @RepKinzinger will be joining fellow Republican @RepLizCheney on the Jan 6 Committee, and hoping @RepRiggleman also serves in some capacity. All three place duty to principle over duty to a person.","date":"Sun Jul 25 16:32:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepNikema @RepBuddyCarter @RepNancyMace @SanfordBishop @RepDrewFerguson @RepHankJohnson @RepLucyMcBath @RepBourdeaux @AustinScottGA08 @Rep_Clyde @CongressmanHice @RepLoudermilk @RepRickAllen @repdavidscott @justinbieber @RepTimmons @ModernizeCmte Sorry @ModernizeCmte friends, you’ve clearly never enjoyed a juicy, sweet, Minnesota Peach.\n\nCome to think of it, no one has. 🤦🏼‍♂️","date":"Sat Jul 24 12:57:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Imagine thinking so little of the people you represent that you believe they’ll vote you out of office if you simply encourage them to save their lives and the lives of others. #CovidVaccine","date":"Sat Jul 24 12:50:53 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"There is one person in America who holds the key to  saving thousands of lives with action or costing thousands more with his silence.","date":"Fri Jul 23 11:34:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I am. 🙋🏼‍♂️","date":"Fri Jul 23 02:15:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Protecting those who help protect us is a core American value. That’s why I was proud to cast my vote for the Allies Act today along with 406 colleagues.","date":"Fri Jul 23 01:27:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"With 200 open cases and many more prosecutions to come, we will not rest until those who defrauded American taxpayers by fraudulently obtaining PPP and/or EIDL loans is brought to justice - just like these thieves. https://t.co/lYSZ5B4oXP","date":"Fri Jul 23 00:11:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@mngop @RepHagedorn @HouseGOP As a small business owner and co-author of the PPP Flexibility Act w/Rep. Chip Roy that helped thousands of small businesses across the country, thank you for highlighting our hearing about supporting small bizs affected by the changing climate (low water, no snow, storms, etc).","date":"Thu Jul 22 15:46:19 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepTimmons I had one last night and it was DELICIOUS! 🍑","date":"Thu Jul 22 15:09:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Way to go, @EdenPrairiePD! ⚡️","date":"Wed Jul 21 20:42:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to join thirty Democratic and Republican colleagues at the Congressional Sportsmen’s Foundation annual clays competition in support of the great outdoors. @HunterandAngler https://t.co/LwF6r90wWY","date":"Wed Jul 21 20:38:37 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If you support our government when it sends young people to war in defense of American interests, you should support our government when it protects American lives at home against a threat that has already killed more Americans than all our overseas wars combined. #truth #COVID19","date":"Tue Jul 20 21:23:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Americans’ medical debts have reached $140 billion. Every citizen needs to be covered by insurance, be it private or public, and NO American should ever face bankruptcy due to illness. https://t.co/m2JWoJ7TEw","date":"Tue Jul 20 19:28:24 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Half a century ago, she was told, “Wally, you’re a girl. You can’t do that”. Today she did it. 🇺🇸","date":"Tue Jul 20 14:10:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Celebrating Hilal Ibrahim and all of America’s remarkable entrepreneurs whose risks and fortitude form the backbone of our economy. 🇺🇸","date":"Tue Jul 20 13:41:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s start sharing more of the heart warming stuff. Love this.","date":"Tue Jul 20 03:40:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Not only must we keep our MSP Joint Reserve Station active, but I ask our delegation to join me in strongly advocating for the newest generation C-130J aircraft. I’m tired of Minnesotans sending so much more to DC than we get in return - and subsidizing other states.","date":"Sun Jul 18 23:53:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"So much to love about this wonderfully American story.","date":"Sun Jul 18 23:47:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Good to be back with this engaged community of mine. If you missed our town hall in Bloomington tonight, stream it below. Getting back together is good for the soul (and our democracy). Keep the faith, #MN03! 🇺🇸\nhttps://t.co/xWeGqRGkbw","date":"Fri Jul 16 01:38:50 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As the only member of Congress who refuses all PAC money and contributions from fellow lawmakers, this is why the whole, sick, corrupt system must change. Money shouldn’t buy votes, influence, or protection.","date":"Wed Jul 14 20:58:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Tomorrow, the first #ChildTaxCredit payments will hit working families' bank accounts across #MN03. Thanks to the American Rescue Plan, 70% of kids in our community are eligible, easing the burden after a challenging year. Parents, check your status here: https://t.co/hFmKAbhW4B https://t.co/tETvRv0xdz","date":"Wed Jul 14 15:32:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@SteveYaeger Darn right!","date":"Tue Jul 13 02:10:52 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"America must lead the world in education, opportunity, and economic prosperity. The bipartisan infrastructure package endorsed the @ProbSolveCaucus is an important step to reclaim that position. Pleased to join my friend, @RepBrianFitz, to make the case for an expeditious vote. https://t.co/xQuRhQ4kYJ","date":"Fri Jul 09 17:27:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"~$14 billion spent in the 2020 federal elections, Members of Congress wasting a collective ~10,000 hours per week filling their campaign coffers, and the Gov of TX has $55,000,000 in his account. The political industrial complex is working against America, not for it.","date":"Thu Jul 08 14:27:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I cling to the concept of cooperation; something I invite the dividers to contemplate on this Independence Day.","date":"Sun Jul 04 18:12:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Freedom is fragile. Make this Independence Day a meaningful one. 🇺🇸","date":"Sun Jul 04 13:11:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“We have experienced a lot of tragedy in our history, but what is new is that it’s happening right here.” Please stand in solidarity w/the Jewish community as we confront the most dangerous environment in which those of us born after WWII have ever lived.\n https://t.co/59cLFXGTvH","date":"Fri Jul 02 18:08:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I cannot imagine the pain of such horrifying human loss. The victims, the families, and remarkable first responders are on my mind and in my heart and prayers. America loves you. ❤️🇺🇸 https://t.co/wvRYFCuMwN","date":"Fri Jul 02 17:46:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Who among us hasn't been stuck in traffic on 494? \n\nThrilled to have helped secure crucial investments for this #MN03 project, and to have advanced several more. Here's to traffic mitigation, safety improvements, environmental protection, and federal $$ flowing INTO Minnesota! https://t.co/sJ54V0phRB","date":"Fri Jul 02 16:45:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s time to legalize cannabis, regulate it, tax it, and stop treating people who use it as criminals. The current law is ruining lives not saving them.","date":"Fri Jul 02 13:09:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Good work, CKW! With 80% of venture capital flowing to just three regions, Silicon Valley, Boston, and NYC, it’s important to attract more investment to Minnesota start-ups and entrepreneurs.","date":"Wed Jun 30 22:24:53 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I just voted to establish a bipartisan, Jan 6 investigative committee. When I went to the gallery to greet Gladys Sicknick &amp; Sandra Garza, the mother and girlfriend of Officer Brian Sicknick, they were in the same seats in which I was sitting that fateful morning six months ago.","date":"Wed Jun 30 21:26:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@NRCC @IlhanMN Because she acknowledged the historical solidarity between the Jewish community and communities of color in working together to defeat discrimination and injustice in all its forms. Would be nice to see the @NRCC inspire cooperation in that effort rather than dividing us further.","date":"Wed Jun 30 16:07:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"On behalf of generations of Jewish community members in Minnesota and throughout the country who’ve stood hand-to-hand with our brothers and sisters of color in the fight against discrimination in all its forms, we thank you.","date":"Wed Jun 30 15:17:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I encourage as many of my US Capitol Police and DC Metro Police officer friends to join us tomorrow. You were heroic that day and the least we can do is investigate what happened and ensure it never does again.","date":"Tue Jun 29 22:43:37 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The best news for Minnesotans in a long, long time.🌽 🍟 🚜🍦","date":"Tue Jun 29 17:06:56 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My staff and I, likeminded colleagues, and the @HouseSmallBiz Committee are working hard to rectify the problems, get support to those who need it most, and replenish the #RRF as expeditiously as possible. 3/3","date":"Tue Jun 29 14:49:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Restaurant Revitalization Fund was designed to support entrepreneurs who were unable to secure PPP funds, particularly women, veteran, LGBTQ and minority-owned businesses which were afforded a 21-day early application window. 1/3","date":"Tue Jun 29 14:49:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"But the SBA lost three court cases challenging that process, and now everyone who applied is receiving NOTHING - even those who were advised they’d been funded. It’s the exact opposite of what Congress intended, hurting the very people and businesses we intended to help. 2/3","date":"Tue Jun 29 14:49:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Turning away from our flag is a protected freedom afforded to Americans. Using flag poles to attack US Capitol Police is a heinous crime committed against Americans. Let's understand and address the conditions that result in both displays so that neither happen again.🇺🇸","date":"Mon Jun 28 15:06:03 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The facts speak for themselves; Democrats aren’t voting to defund police. We’re voting for enhanced investment in crime prevention, in new policing strategies, and summer programs and jobs for at-risk youth. We’re voting to fund safety and security for ALL.","date":"Sun Jun 27 19:45:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Now we must turn our attention to developing a vaccine for this dangerous disease.","date":"Sun Jun 27 19:23:56 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"All Officer Fanone asked is for the @GOPLeader to publicly disavow and denounce lies about Jan 6. How in the world can that be so hard?","date":"Sat Jun 26 12:03:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Accountability for George Floyd's murder was served today, and I pray it inspires a collective reflection on where we've been and where we still must go as a nation to ensure justice, peace, and equality for all.","date":"Fri Jun 25 21:08:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Damn right that’s me.","date":"Fri Jun 25 20:12:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Henry was happier to be leaving the Capitol, @billclarkphotos, because it was a long week for pawliamentarians. 🐶","date":"Fri Jun 25 19:12:24 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Enough with members of Congress making repulsive and downright dangerous Nazi comparisons. The Nazis killed 6 million Jewish people and millions more. A retraction and apology is the least he can do. https://t.co/qg4KmePtBm","date":"Fri Jun 25 17:01:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Proud of @BestBuy, @target, @usbank, and other Minnesota businesses sharing success and creating opportunity for more entrepreneurs of color. https://t.co/1G7gxRsibB","date":"Thu Jun 24 23:52:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Foreign Affairs Committee was established in 1822 and today is the first time in history we’ve held a hearing focused on protecting LBGTQI+ communities around the world. This is my current view of a certain side of the aisle, and I’m as saddened as I am disappointed. https://t.co/fGFK5Rmt34","date":"Thu Jun 24 19:06:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We can’t have peace without justice, and we can’t have justice without law enforcement. Let’s inspire a new generation of empathetic, principled young people to become police officers as we work to ensure safety and security for ALL.","date":"Thu Jun 24 12:27:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s a scary world out there, especially for women and young families. But we are built to overcome. If we embrace hope over fear, we can pursue purpose, create change and make an impact. Back to you, @RepDeanPhillips! #ShareTheMicMN #teamwork","date":"Wed Jun 23 21:14:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Women in business sacrifice a lot. We work hard and are resilient as we introduce our product or service to the world. Driven by purpose and a commitment to make a difference, we fight our way past the naysayers to reach our intended audience. There’s meaning behind the work. https://t.co/wiSt3cQrmw","date":"Wed Jun 23 21:14:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I started my business, @junitasjar, as a way to bring people together to talk about intimate abuse. The simple act of coming together, embracing hope over fear, can change people for the better. https://t.co/ZXR5bBIOse","date":"Wed Jun 23 21:14:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Black entrepreneurs face real barriers in this economy. The lingering shock of COVID and a lack of access to capital and connections remain major obstacles. https://t.co/HIUcHVwtWB","date":"Wed Jun 23 21:14:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Domestic violence is an epidemic in America, and worldwide shutdown didn’t help things. But we’ve got to talk through these issues if we’re going to address them. https://t.co/K92dmMTQwN","date":"Wed Jun 23 21:14:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Before I’m an entrepreneur and a business owner, I am a mom. I’m a mom who cares about creating a home filled with memories of good food, the best treats, and belly laughs. https://t.co/hLa6xDfB1M","date":"Wed Jun 23 21:14:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My name is Junita Flowers. I am a Black entrepreneur from Minneapolis. This is my story: https://t.co/mPDJv9Opcx","date":"Wed Jun 23 21:14:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In coordination with @sharethemicmn, I’m passing the mic to Junita Flowers, a Black entrepreneur from Minneapolis, today. Now more than ever, we need an economy that works for everyone, so let’s keep the conversation going. Junita, take it from here! #ShareTheMicMN [thread] https://t.co/hAMCkkxVwy","date":"Wed Jun 23 21:06:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Gen. Milley was chosen by the former President to serve as Chair of the Joint Chiefs of Staff. Every American should watch this statement before half the country buys into another repulsive lie. https://t.co/XzF6r4QcWJ","date":"Wed Jun 23 19:49:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Olivia_Beavers @ktullymcmanus Will you still cover Dem canines? Asking for Henry. 🐶","date":"Wed Jun 23 14:36:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Our founders designed a system of governance to make change arduous. And it works WAY too well. While we mustn't tamper with the structure - we absolutely must revise the archaic, suffocating rules of Congress for the 21st century and resuscitate deliberation and lawmaking.🇺🇸","date":"Tue Jun 22 20:41:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If the Senate refuses to deliberate and ultimately pass a version of @Sen_JoeManchin’s compromise voting rights package, it’s time to modify the filibuster to ensure those who stand in the way of democracy cannot do so by simply raising a hand.","date":"Tue Jun 22 14:19:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“Not as bad as Trump” isn’t good enough. Nepotism and cronyism reduce faith in government - particularly at a time our nation can ill-afford it. The ethical bar must be raised higher. https://t.co/PVrtSMuvMS","date":"Sat Jun 19 21:32:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"May acknowledgement of the past illuminate the path to a more just and hopeful future. For all. #JuneTeenth2021","date":"Sat Jun 19 12:35:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The President doesn’t need a cognitive test. Those who voted against Juneteenth and the Congressional Medal for Capitol Police need a cognitive test.","date":"Fri Jun 18 12:23:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We did it, Maggie! #Juneteenth #FreedomDay https://t.co/Ir6k1gtCf5","date":"Thu Jun 17 20:40:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m on a mission to inspire a new era of collaboration in Congress. As other political leaders focus on division, my staff and I will always prioritize unifying over common ground for the common good. Thanks to @USChamber for once again recognizing this important work. https://t.co/JPICuLVWEh","date":"Thu Jun 17 19:59:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@jrkirchner @USChamber Thank you, John.","date":"Thu Jun 17 19:45:05 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@DanielleMisiak I’ve developed a high threshold for shock, and I’m shocked.","date":"Wed Jun 16 01:54:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Utter disbelief this vote wasn’t 427-0.","date":"Wed Jun 16 01:52:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Our $28T federal debt requires ~$400B in annual interest payments, reducing our ability to invest in health, housing, education, clean energy &amp; infrastructure. We should alleviate that burden, ensure tax loopholes are closed and America’s highest earners pay their fair share.","date":"Mon Jun 14 22:12:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If the @NRCC truly cared about anti-semitism and truth, they would support a bipartisan commission to investigate the Jan 6 insurrection and the men wearing 6MWE shirts and carrying Confederate flags as they stormed the Capitol. It’s not too late…","date":"Mon Jun 14 20:39:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If @GOPLeader Kevin McCarthy cared so deeply about anti-semitism, he’d support a bipartisan commission to investigate the Jan 6 insurrection and the men I saw with my own eyes storming the Capitol wearing 6MWE shirts (6 Million Wasn’t Enough).","date":"Mon Jun 14 20:32:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"#FlagDay is a great day to reflect on two of the most important liberties for which it stands; the freedom of speech and the freedom to criticize speech. 🇺🇸","date":"Mon Jun 14 13:54:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A Sunday morning day brightener. https://t.co/0xKP3AV5Q6","date":"Sun Jun 13 13:04:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I wholeheartedly and strongly condemn @RepMoBrooks for this dangerous and misinformed rhetoric. Any language that inspires hate towards Muslim people, Jewish people, Christian people, Black people, Brown people, LGBTQ people, or any people, demands comprehensive condemnation.","date":"Thu Jun 10 22:14:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As others obstruct, divide and disengage, the @ProbSolveCaucus worked together to develop a bipartisan, physical infrastructure solution with the support of 29 Democrats and 29 Republicans. We’re committed to bring people together and get things done, and we won’t give up.","date":"Wed Jun 09 12:32:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thank you for your honorable  reporting in a political environment in which principle is hard to find. We must build bridges between rural and urban/suburban Minnesotans and Americans and show a little more empathy for one another. Here’s to a fulfilling new chapter, Pat.","date":"Tue Jun 08 18:35:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Former @RepPaulMitchell is a friend; a principled conservative whose courage to speak truth and honorable voice and presence are missed in the Capitol. Join me in sending support and good vibes to a man and family who needs it today.","date":"Tue Jun 08 14:31:25 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@StudentCam @comcast @edinaschools @JulianaFWCohen @MNHouseInfo @MelisaFranzen @amyklobuchar @SenTinaSmith Congrats, Sonja!","date":"Mon Jun 07 20:08:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The biggest threat to our future is the erosion of respect. I’m proud to serve as a Vice-Chair of the @ProbSolveCaucus, a group of 29 Ds and 29 Rs demonstrating that the path to repair is through decency - not derision.","date":"Sat Jun 05 14:06:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Are we going to lead or are we going to cede? I favor the former, and it’s time we unite behind American innovation, entrepreneurship, and job creation. https://t.co/OEPX0FCZRV","date":"Wed Jun 02 13:58:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Vandalizing public officials’ homes is despicable and sickening behavior. Grievances should be addressed at the ballot box.","date":"Wed Jun 02 01:41:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The day Ham Lake changes its name to Yam Lake is the day St. Paul becomes São Paulo.","date":"Tue Jun 01 23:33:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@andybrehm While I agree in principle, the Founders didn’t codify that into the Constitution, rather they allowed each body to \"determine the Rules of its Proceedings\". Super majorities were prescribed only for impeachment, expulsion, overriding vetoes, and amending the Constitution.","date":"Tue Jun 01 23:17:37 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Want to see some bipartisanship? If the House proposed creating a filibuster like the Senate, 261 votes would be required to pass legislation. Would a single Democrat or Republican vote in favor? I suspect not.","date":"Tue Jun 01 22:50:37 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What the world needs now\nIs love, sweet love\n#Pride2021","date":"Tue Jun 01 12:57:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As the sun sets on another meaningful Memorial Day, please say a little prayer for the &gt;1 million Americans who’ve given their life in service to our country since 1775 - including my dad, Capt. Artie Pfefer. Let’s honor them by reuniting the United States of America. 🇺🇸 https://t.co/Iho4wwXmEv","date":"Tue Jun 01 00:09:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to join @PoppyHarlowCNN on this Memorial Day morning. Let's honor the memory of those who gave their lives for our freedom by recognizing our shared interests, protecting our democracy, and once again becoming the UNITED States of America. https://t.co/kHbryCbVGf","date":"Mon May 31 14:26:56 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"On Memorial Day, I honor my father, Artie, and all who made the ultimate sacrifice in service to our country. Let’s honor their memories by protecting our democracy, not destroying it. https://t.co/GCSvk1sd8j","date":"Mon May 31 11:32:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Johnb1111111111 I thought you’d never ask, John!","date":"Fri May 28 21:10:37 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepSusieLee I prefer a full case of local Nevada brew, Susie, but a 6-pack will suffice when the @mnwild come back from a 3-1 deficit and win game 7. 🍺 🏒","date":"Fri May 28 20:55:53 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepSusieLee @GoldenKnights @mnwild @RepAngieCraig And no apology to me, @RepSusieLee? 🏒","date":"Fri May 28 17:08:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Patriots 54 - Cowards 35 \n\nThe second most shameful day in recent American history after 1/6 itself.","date":"Fri May 28 16:52:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s time for political leaders to use their platforms to reduce antagonism and promote compassion. Discrimination and division are the only weapons that can defeat the UNITED States of America, so let’s join together and pave a path to justice, security, and prosperity for all. https://t.co/oV1mzo4pJs","date":"Fri May 28 15:15:40 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Darn right I’m going to speak up.","date":"Fri May 28 14:29:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"15% of Americans believe “patriots may have to resort to violence to depose the pedophiles and restore the country’s rightful order” and over 40 Senators are planning to vote against the bipartisan 1/6 commission. Not sure which is more shocking. https://t.co/WHBqaY1OVT","date":"Fri May 28 10:38:32 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"that they’re willing to speak on the floor for as many hours or days or even months as it takes to force the others to concede. I believe in tradition, and tradition dictates Senators should be debating and voting, or have to work a whole lot harder to do nothing at all. 4/4","date":"Fri May 28 01:46:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"emerging from a pandemic, witnessing graphic displays of corruption, and at risk of irretrievable erosion of faith in elections - the very foundation of our democratic republic. I believe a bipartisan 1/6 Commission and HR1, the For The People Act, are too important to forgo 2/4","date":"Fri May 28 01:46:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"without debate, deliberation and a floor vote in the Senate. So it’s time to call on tradition and return the filibuster to its roots; the talking filibuster. Senators who wish to prevent a bill from a facing a simple majority vote would have to be so committed to obstruction 3/4","date":"Fri May 28 01:46:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I value tradition. Like most Americans, I yearn for the days when Senators debated rather than divided and broke bread rather than our collective trust in government. But here we are, just months removed from an insurrection, 1/4","date":"Fri May 28 01:46:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Every member of Congress should support bipartisan investigations of both the origins of COVID-19 and the origins of JAN-6.","date":"Thu May 27 13:34:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Common cause. Solving problems. Serving the American public. #SenJohnWarner","date":"Wed May 26 13:45:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@podsekalnikov Wrong on all counts, Professor. I’m Jewish.","date":"Tue May 25 13:13:48 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As we stand at the cusp of a bipartisan agreement on policing reforms to ensure accountability and enhance safety for all Americans, I urge President Biden and Congressional leaders to choose what is just over what is easy. Inaction is unacceptable, and the time is now. 2/2","date":"Tue May 25 13:08:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It was one year ago, today. George Floyd’s murder finally forced our country to acknowledge and confront the systemic racism that has ended too many Black lives and dreams. And while progress is being made, justice and opportunity for all requires a collective commitment. 1/2","date":"Tue May 25 13:08:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’ll say the quiet part out loud; it’s time for “progressives” to start condemning anti-semitism and violent attacks on Jewish people with the same intention and vigor demonstrated in other areas of activism. The silence has been deafening.","date":"Mon May 24 15:17:07 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"After a few songs that “sounded worse than fingernails on a blackboard”, my grandpa paid him $20 and sent him on his way. A year later, the kid moved to NYC, honed his craft, and developed a little following. Today, Bob Dylan is celebrating his 80th birthday. 2/2 🎂 🎸 https://t.co/Pg8MRbbalO","date":"Mon May 24 14:16:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In 1960, my great-grandfather hired the son of a family friend, a 19 year-old, Univ of Minnesota student named Zimmerman, to play guitar at a party he was hosting in Minneapolis. There was no stage so he put him up on a ladder to be heard. 1/2","date":"Mon May 24 14:16:50 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If you believe that oppression is inhuman, nationless people deserve self-determination, the loss of children to reckless violence is abhorrent, and firing 4,000 missiles indiscriminately into population centers is a war crime, then we can have a conversation.","date":"Fri May 21 13:31:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Darn right it would.","date":"Thu May 20 21:23:35 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Jan 6 insurrection is a stain on America and a reminder of our fragility. A bipartisan commission should investigate how it happened so we can ensure it never does again. I celebrate all who voted to proceed, particularly the 35 Republicans who placed principle over party. https://t.co/xgcjHqpEUz","date":"Thu May 20 19:08:07 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"From Minneapolis to the Middle East, my heart breaks for the children being killed by bullets and bombs.","date":"Thu May 20 00:33:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I need not shame the 175 who voted in opposition today. Twitter and history will do that just fine. But here’s to the 35 Republicans and 217 Democrats who showed America what patriotism looks like - and votes like. 🇺🇸 2/2","date":"Wed May 19 23:21:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I was in the Capitol on Jan 6. I saw it with my own eyes. I walked where blood was spilled and life was lost, and I helped clean up the mess in the early hours of 1/7. I never imagined a single member of Congress would vote against a bipartisan commission to investigate it. 1/2","date":"Wed May 19 23:21:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Sometimes things aren't black and white. We have to create the space for people to share truth. \n📡 \nListen to my full conversation with @yahoonews’s @jonward11 about nuance, power, and inspiring institutional change in Congress at https://t.co/LST3jWKSYy https://t.co/yfJkPqmEJW","date":"Wed May 19 21:20:56 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If not for the nation, don't we owe it to those who lost or took their lives in service to and defense of our country and Capitol?","date":"Wed May 19 16:55:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@TheDianaWilde You can always count on me to pursue the truth - no matter how discomforting the path might be. Wish we could count on every member of Congress to do the same.","date":"Wed May 19 16:18:02 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Today’s vote on establishing a bipartisan commission to investigate the Jan 6th insurrection isn’t a vote for or against Trump. It’s a vote for or against TRUTH.","date":"Wed May 19 15:49:45 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"FWIW, I believe the mask requirement on the House floor is no longer necessary but I wear one because following laws and rules is the foundation of any successful society.","date":"Tue May 18 21:19:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"They weren’t tourists. They were insurrectionists.","date":"Tue May 18 15:00:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Child Tax Credit won’t reach many of the children and families who most need the support - those living in poverty who don’t file tax returns. We must find a path to reaching these families if we hope to significantly reduce childhood poverty. Ideas? https://t.co/c3zHXBeVC7","date":"Tue May 18 14:54:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In other words, a bipartisan commission negotiated in a bipartisan fashion to investigate Jan 6. is opposed by a man likely to be subpoenaed by said commission.","date":"Tue May 18 12:58:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The truth should change minds. Minds shouldn’t change the truth.","date":"Tue May 18 12:19:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"There seems to be a pattern emerging among the verified voter fraud cases from the 2020 election. The Hard Truth vs. The Big Lie.","date":"Fri May 14 16:18:07 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"One day we’ll look back and wonder why ranked choice voting took so long to adopt and why anyone stood in the way. #RCV  https://t.co/9S9w7WbTZm","date":"Fri May 14 00:06:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My home country is known as the United States of America.","date":"Thu May 13 17:57:52 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I had the privilege of speaking with Major Dawanna Witt about reimagining our public safety system AND supporting our public safety officers earlier this spring. She's an inspiration to me this #NationalPoliceWeek, and I invite you to read her story here: https://t.co/LEX4etEgwi","date":"Thu May 13 16:31:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"MN turned 163 this week! A birthday gift is on the way in the form of our fair share of federal investments in schools, health, workers, small businesses, &amp; families. Here's to getting the North🌟State to 164 as healthy, economically sound, &amp; prepared for the future as possible.","date":"Thu May 13 16:14:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@StarTribune Keep it up, Minnesota!","date":"Thu May 13 16:05:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It's time. #LegalizeMN. Expunge. Regulate. Tax.\nhttps://t.co/HVwjFhAUEK 💚\nhttps://t.co/vrK1x0mvmr https://t.co/fLZFXjI4iK","date":"Wed May 12 13:56:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Laws prohibiting adult cannabis use defy common sense and the will of the people. I respectfully urge #MNLeg to meet the moment and pass H.F. 600, joining states – Red and Blue – who have already recognized the sensibility of legalization. #freedom #liberty #LegalizeMN https://t.co/gNva227Vgj","date":"Wed May 12 13:53:54 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The prioritization of self-preservation above principle is a Congressional disease, which makes @RepLizCheney’s courage of conviction a historic moment in American political history.","date":"Wed May 12 13:30:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Thanks for the reminder.","date":"Tue May 11 14:41:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m heartbroken by the loss of life in Israel &amp; Gaza - particularly precious children. I fiercely support Israel’s right to exist and protect itself from sworn enemies AND Palestinians’ desire for self-determination and opportunity. Security and justice are the seeds of peace.","date":"Tue May 11 13:59:45 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Happy Mother’s Day, mom! At least you had one son grow-up to become a doctor. ❤️ https://t.co/l3A3lQ49Vn","date":"Sun May 09 19:55:06 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Celebrating all the moms today, especially this remarkable one. Happy Mother’s Day! 💐 https://t.co/hVNZtVUSiZ","date":"Sun May 09 13:46:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@dehelgerson We must ensure Social Security and Medicare remain solvent. That’s what I mean by investing MORE in people and spending LESS on the past. We’re revenue deficient and must acknowledge that borrowing in perpetuity is a dangerous path.","date":"Sat May 08 17:12:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As we emerge from the pandemic and set our sights on the future, it’s time we begin investing more in America’s people and possibility while reducing our payments for the past.  Please share your ideas about how we should consider doing so. 4/4","date":"Sat May 08 13:46:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"And just a 100 bps (1%) increase in interest rates will raise our debt service costs by over $200b annually. 3/4","date":"Sat May 08 13:46:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Our ~$30 trillion debt burdens us with &gt;$300b in annual interest payments, which consumes ~9% of revenue, and exceeds what we invest in science, space, transportation, technology, and education COMBINED. 2/4","date":"Sat May 08 13:46:54 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"John D. Rockefeller could have paid off the entire US federal debt in his era. Today, Jeff Bezos could only cover about 6 months of interest payments. 1/4","date":"Sat May 08 13:46:54 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Voting ends today in the #MN03 Congressional Art Competition and early exit polls indicate we're headed to a Ranked Choice runoff! Make sure your favorite student artists are in the mix by voting at https://t.co/7YGrR8fl74","date":"Fri May 07 15:59:07 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The @ModernizeCmte agrees that public service should attract America’s best and brightest. That’s why we must offer competitive compensation and professional development to Congressional staffers. Serving our nation shouldn’t make you rich, but nor should it make you poor. 🇺🇸","date":"Thu May 06 20:02:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Suppressing voting to make it “harder to cheat” is like raising the rim from 10 to 11 feet to make it harder for me to dunk.","date":"Thu May 06 13:09:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Throughout the most challenging year in generations, young people have shown remarkable resilience and spirit. It's no surprise that our #MN03 2021 Congressional Art Competition works are so moving and impressive! #RankChoiceVote for your favorites by 5/7: https://t.co/7YGrR8fl74 https://t.co/LFSwRswqCi","date":"Thu Apr 29 15:48:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What some call “socialism” I call Social Security and Medicare.","date":"Wed May 05 22:12:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Infrastructure: an opportunity to stop slinging mud and start shoveling dirt. \n🛣🤝\nGood to be out in @CarverCounty celebrating teamwork on Highway 212, a sorely needed project that’s (literally) bringing our communities together. https://t.co/1pZmts8qpM","date":"Wed May 05 16:31:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Says the man about to remove Liz Cheney from leadership because she based it upon the facts.","date":"Wed May 05 12:02:07 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I was taught in kindergarten that cooperation was a good thing. https://t.co/GmAiXs8GU8","date":"Tue May 04 12:43:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"FWIW, my office takes calls from any person or organization that wishes to correspond - no matter their politics - and I don’t take any PAC money. Never have and never will.","date":"Sun May 02 16:23:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Here's to more innovation, collaboration, and optimism, #MN03!","date":"Fri Apr 30 00:11:19 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pleased to join my friend and fellow Problem Solver, @RepVanTaylor, in introducing a bipartisan bill to prevent state &amp; local elected officials from lobbying Congress on behalf of private clients. We’re working to re-establish faith in government, and it starts with good ethics.","date":"Thu Apr 29 23:26:56 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"(Ranked Choice Voting is a system of voting that is proven to build consensus and discourage division. In addition to the Congressional Art Competition, I support the use of #RCV to decide comparatively lower-stakes elections, such as U.S. congressional races. 😉)","date":"Thu Apr 29 15:49:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Throughout the most challenging year in generations, young people have shown remarkable resilience and spirit. It's no surprise that our #MN03 2021 Congressional Art Competition works are so moving and impressive! #RankChoiceVote for your favorites by 5/7: https://t.co/7YGrR8fl74 https://t.co/LFSwRswqCi","date":"Thu Apr 29 15:48:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Shouldn’t a country in which the wealthiest 600 own &gt;$4 trillion in assets while 64,000,000 can’t afford a surprise car repair unite behind investments in infrastructure, education, child care, public health, housing, and workforce development?","date":"Thu Apr 29 14:58:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@lindsemcpherson @snuggerson @Fritschner ☺️","date":"Thu Apr 29 04:20:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A pretty remarkable speech if you’re pro-human.","date":"Thu Apr 29 02:20:38 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m so grateful America elected Joe Biden to be our President.","date":"Thu Apr 29 02:12:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Minnesota’s 3rd District leads the nation in voter turnout AND census self-response. I’m proud to represent the community that raised me; one of the most civically engaged and civil communities in our country. 🇺🇸","date":"Tue Apr 27 03:42:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Winning by 89 in the Census makes losing by about 89 over the past decade in Yankee Stadium just a little less painful.","date":"Mon Apr 26 21:58:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m thinking of all the families, students, faculty, and staff in Plymouth who endured moments of horror this morning. A miracle that no one was hurt, and a clarion call to gun owners to use locking devices and keep firearms in a safe or lock box.","date":"Mon Apr 26 21:10:06 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This issue affects all Minnesotans, and I invite people and representatives of all political perspectives to join me in redoubling our efforts to advocate for the federal investments we deserve - and need - in this Congress and beyond. More work to do! (2/2)","date":"Mon Apr 26 20:17:40 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"OUTSTANDING NEWS: MN's high #Census2021 participation and population growth means we’ll be keeping our representation, and clout, in Congress. We contribute more than our fair share to Washington, and I’m renewing my mission to bring more support back to our communities. (1/2) https://t.co/A4Wxt0T3k3","date":"Mon Apr 26 20:16:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"None of Newark’s 1,100 police officers fired a single shot in 2020 and crime was down 6%. Reform is as necessary as it is possible. https://t.co/7cbcFlmV96","date":"Sun Apr 25 17:17:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"For those arguing, “But most of that $211 million is restricted stock grants”. \nI say, even better! Share $45,000 in restricted stock grants with every employee, align everyone’s interests,  and generate ownership. Everyone wins. 🏆","date":"Sun Apr 25 15:26:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My grandfather used to tell me, “Money is like manure. When it piles up, it stinks. But when you spread it around, it fertilizes”.  What a great opportunity for the CEO of Paycom to decide $22 million is more than enough and give his 4,200 employees a $45,000 bonus. https://t.co/pjOpnXARWQ","date":"Sun Apr 25 14:09:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@zrodvold @CityofEP Kind of like the Tooth Fairy, Zach? 🤔","date":"Sun Apr 25 02:47:59 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Kudos to @MayorFrey for vetoing the Minneapolis Park Board's irresponsible and ill-conceived effort to prevent MN State Patrol officers from using their taxpayer funded facility for work and restroom breaks.","date":"Fri Apr 23 19:37:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"📷: Kenny Cousins (I believe) @flattopphotography on IG","date":"Wed Apr 21 12:54:49 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Onwards. https://t.co/1Af7nBvZYt","date":"Wed Apr 21 12:38:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Without Darnella Frazier, it’s unlikely the original MPD press release of May 25, 2020 would become the NYT headline of April 20, 2021. https://t.co/wzTnS95Vue","date":"Wed Apr 21 01:39:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Justice was served for George Floyd today, but America’s work, our work, to ensure justice, safety, and opportunity FOR ALL will continue with even more intention, more fortitude, and more purpose. Onwards in unity.","date":"Tue Apr 20 21:09:56 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Fritz’s service to our country spanned four generations of my family, from my great- grandfather to my daughters. Rest in peace, Mr. Vice-President, and may your memory be for a blessing. https://t.co/rXBNyx1BKC","date":"Tue Apr 20 01:27:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"America and Minnesota have lost one of our finest statesmen from the greatest generation, and I’ve lost an extraordinary mentor. A man of principle, empathy, decency, and strength whose legacy should be a beacon to all of us during these difficult days. ❤️ https://t.co/OnC1tB7QMC","date":"Tue Apr 20 01:09:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"To the community I love: If you’re feeling fearful and anxious this week, imagine feeling this way every day of your life and employ that empathy as inspiration to ensure that future American generations ALL know justice, peace, and opportunity.","date":"Mon Apr 19 22:17:50 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I believe I speak for most Americans when I say injustice must be protested, journalists must be protected, and encouraging confrontation must be rejected.","date":"Sun Apr 18 23:42:49 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Shooting at guardsmen and women is despicable and only slows the journey to justice. \"Non-violence is the greatest force at the disposal of mankind. It is mightier than the mightiest weapon of destruction devised by the ingenuity of man.\"-Gandhi  https://t.co/6hP7Ul2sZo","date":"Sun Apr 18 16:48:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Minnesota’s better angels have shared 100,000 lbs of food and 20,000 lbs of supplies with Brooklyn Center residents this week. Compassion and justice are the seeds of peace that America needs from each of us.  https://t.co/2jbOpvrJia","date":"Sun Apr 18 11:52:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@KFILE ❤️","date":"Sat Apr 17 23:00:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I didn’t have to be the father of a lymphoma survivor to join 414 of my colleagues in voting to reauthorize the National Marrow Donor Program. I just believe it’s patriotic to help save American lives. https://t.co/tQ3ajji49F","date":"Sat Apr 17 22:43:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A moment of prayer between a Brooklyn Center police officer and Michael Wilson “DJ Phoenix” - who “wants to help bridge the gap between law enforcement inside the fence and the community outside the fence”. h/t @MarkFreie","date":"Fri Apr 16 23:37:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@eric_vento He knows who they are.","date":"Fri Apr 16 20:51:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Vartan Gregorian made my grandma feel like the most important woman in the world at my college graduation. I’ll never forget that, and nor did she. The world did, indeed, lose a great man.","date":"Fri Apr 16 20:49:38 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Don’t say the names of the people joining the “America First Caucus”. Don’t amplify their hate and ignorance. Don’t share their propaganda and enhance their fundraising. They are as relevant or irrelevant as WE make them. Ignorance isn’t bliss, but it’s better than amplification.","date":"Fri Apr 16 19:37:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Injustice is real. We must reform policing and the systems that limit opportunity and produce despair. But blanket condemnation of the mothers and fathers and sons and daughters of all colors and religions that wear a badge or uniform is repulsive and counter-productive.","date":"Fri Apr 16 18:48:15 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@NoahMJones 👋","date":"Fri Apr 16 14:47:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"More heartbreak. More prayers. And more American carnage.","date":"Fri Apr 16 11:33:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Here's to you, Jackie Robinson. A day to celebrate what happens when opportunity is afforded rather than denied, and to recognize how far we have to go. https://t.co/31Q6mvWP2Z","date":"Thu Apr 15 13:43:52 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Reminder: Brooklyn Park has ordered a curfew from 10:00pm to 6:00am tomorrow morning, and Champlin from 9:00pm until 6:00am. Please be safe. #MN03","date":"Wed Apr 14 23:48:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A productive meeting today at the White House to discuss how the @ProbSolveCaucus can help restore bipartisan cooperation and faith in government. We discussed infrastructure, immigration, police reform, and crucial mental health investments. A promising beginning. 🤞🏼🇺🇸 https://t.co/HG6JMXr2Uv","date":"Wed Apr 14 20:25:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"87,000 of our neighbors died by overdose last year. Close to 50,000 died by suicide. Millions more are suffering the emotional toll of the pandemic, injustice, isolation, and economic stress. It's time for a bold, bipartisan, mental and emotional health investment in America.","date":"Wed Apr 14 16:17:38 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“...strategic freedom will come at the cost of strategic reputation. It’s not possible to simply walk away from a war one has been committed to and pay no penalty, even if the penalty is less than the cost of continuing to fight.”\n\nSome truth about Afghanistan.👇🏼","date":"Wed Apr 14 13:33:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Officer Evans’s son and I both lost our dads in service to our country - fifty years and thousands of miles apart. To all the children, partners, and parents of heroes: I salute you and I’m one of you.❤️🇺🇸","date":"Tue Apr 13 16:18:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Yes, America. It’s possible an inexcusable mistake was made, that racial injustice is real, that protesting such injustice is lawful and warranted, and that criminal looting and burning destroys the very communities and small businesses that need uplifting. All at the same time.","date":"Tue Apr 13 12:41:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Real peace requires real justice - in policing, in education, in housing, and in opportunity. Here's my full statement: https://t.co/6NP18Gt9Dt","date":"Mon Apr 12 23:37:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If you can barely recognize the Twin Cities you know and love, please listen to our neighbors who’ve been living in fear, inequity, and insecurity for their entire lives. We’ve mistook quiet for peace for far too long, and the absence of justice for some means insecurity for all.","date":"Mon Apr 12 18:58:19 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This isn't the first time it has happened. https://t.co/nbMwrCoN1f","date":"Mon Apr 12 17:48:01 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"https://t.co/ikUv7o28rv","date":"Mon Apr 12 17:31:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m horrified and incredulous that such a mistake is even possible. A life is lost, others are changed forever, and a suffering community’s pain exacerbated in a fleeting instant. We must all come together in the spirit of justice, safety, and security for ALL. We cannot wait.","date":"Mon Apr 12 17:29:02 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Another killing of a Black man by police officers in Brooklyn Center leaves me praying yet again for our traumatized community. I expect the @MnDPS_BCA to investigate  and release body cam footage and share facts surrounding Daunte Wright’s death as soon as possible.","date":"Mon Apr 12 04:59:02 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’ve watched countless times looking for something - anything - to warrant such aggressive, escalating behavior. But all I see is an apparent abuse of power and despicable treatment of a American soldier. Makes me sick. https://t.co/MEdaX8tvjY","date":"Sun Apr 11 23:20:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Henry sends his warm #NationalPetDay greetings to all who celebrate. 🐶 https://t.co/4fhzNupkFj","date":"Sun Apr 11 22:12:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I agree. The quantity of justices shouldn’t change, but their tenure should. And while we’re at it, let’s make it 18 years for members of Congress, too. https://t.co/3ie3g8jU1n","date":"Sun Apr 11 18:14:53 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@ChadHartmanShow 🎂","date":"Sun Apr 11 16:34:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s #NationalSiblingsDay and I was so good to my brother that I’d always let him use the helmet. https://t.co/gnL8wgrMnf","date":"Sun Apr 11 02:53:28 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Kudos to my friend @RepAngieCraig for penning a letter to @POTUS that a majority of Americans would likely sign. It’s high-time to remove cannabis from the Schedule I substance list, allow for research, legalization, federal excise taxation, and fact based decision making. https://t.co/NHtDVqjLua","date":"Fri Apr 09 18:05:17 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Since our nation was born in 1776, 1.2 million Americans have died by war. Since I was born in 1969, 1.6 million Americans have died by gun. Let’s agree that the preservation of life and Liberty is not mutually exclusive and get to work.🗽","date":"Fri Apr 09 13:19:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Bipartisan agreement on expanding access for voters is possible, as Kentucky just demonstrated. But even with the notable improvements, it's still \"comparatively easier to vote in Georgia\". EVERY state should be making voting more accessible, not less.\nhttps://t.co/zbsdlOeZC4","date":"Thu Apr 08 18:37:45 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Three million shots administered and millions more on the way. This is our ticket to getting back together, Minnesota. #MN03 #StaysafeMN #MNShots #VaccinesSaveLives #InThisTogether \n❤️💉\nFind your safe, effective, and FREE #COVID19 vaccine:\nhttps://t.co/f55ccpU4jW https://t.co/s0QYDZdmRD","date":"Thu Apr 08 17:10:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@JoyAnnReid 💜","date":"Thu Apr 08 14:34:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As if political-industrial campaign cash raising wasn’t gross enough, now we have campaign cash stealing. This practice should be banned immediately.","date":"Wed Apr 07 21:38:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My friend, @RepBrianFitz (R-PA), will make an outstanding Co-Chair of the @ProbSolveCaucus and I look forward to working with him and our fifty-six caucus colleagues in the pursuit of truth, common sense policy, and national repair.","date":"Wed Apr 07 19:17:54 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Dose of optimism: You wouldn’t believe it from watching cable news, but most Americans desire the same outcomes, like economic opportunity for ALL. At Community Commons, @mallofamerica and resilient entrepreneurs are rebuilding our community from within. #MN03 #SaveSmallBiz 💙 https://t.co/qTOCaUjzFT","date":"Wed Apr 07 17:32:07 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Competition in business inspires innovation and better outcomes for consumers.\n\nCompetition in politics inspires innovation and better outcomes for voters.\n\nEasier ballot access + ranked choice voting would significantly improve outcomes for Americans. https://t.co/RtZN2dcN6J","date":"Wed Apr 07 15:05:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Wonder if he’d expect those “uninformed” collegians to register for the draft if we were at war?","date":"Wed Apr 07 14:41:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The republic would be better served by fewer impediments to success and to voting,\nbetter education and opportunities for all, and MORE voters.","date":"Wed Apr 07 13:47:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Seriously?","date":"Wed Apr 07 13:43:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The Senate minority leader  seems to be confirming that a company isn’t a person. Time to overturn Citizens United and clean-up America’s corrupted campaign finance racket.","date":"Wed Apr 07 11:31:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"In the spirit of uncovering the truth about Georgia’s voting law, and generating debate based on facts, I share @Esosa_Osa’s important thread about how the measure is likely to make voting harder for many.","date":"Tue Apr 06 21:47:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If we really wanted to reduce gun violence, crime, hate, homelessness, fear, hopelessness and the attendant human and financial costs, we’d invest in 21st century mental health infrastructure - along with roads and bridges. Who agrees?  https://t.co/7NcFgjkS8Z","date":"Tue Apr 06 14:14:54 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Instead of a war on Coca-Cola, how about a war CO2?\n\n✅ Restorative agriculture to deposit CO2 into the ground, where it belongs.\n\n✅ Carbon fee &amp; dividend to encourage migration to green energy and return $ to taxpayers, where it belongs.\n https://t.co/ZIR8oSQrcn","date":"Tue Apr 06 13:21:55 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"FWIW, I’m the only member of Congress who refuses money from PACs, federal lobbyists, and fellow members of Congress, and am one of the few without a “Leadership PAC”. https://t.co/27JenL0ImE","date":"Mon Apr 05 23:23:06 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s just end the ridiculous practice of PACs shoveling piles of cash to governors and members of Congress. Regardless of the validity of this insinuation, the practice makes Americans disgusted. Both parties own it, and both can put an end to it.","date":"Mon Apr 05 22:50:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"MN ranks 1st in getting safe, effective COVID-19 vaccines into arms. From the federal government to the volunteers drawing up each shot, that process requires a lot of teamwork. #MN03's MOA community vaccination site has administered more than 50,000 doses (and counting)! https://t.co/JWWssMfvUI","date":"Mon Apr 05 19:35:19 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"My mother, DeeDee, is one of thousands of surviving wives and husbands of America’s fallen soldiers. Please join me today in honoring all who’ve lost a partner in service to our country. 🇺🇸 #GoldStarSpousesDay https://t.co/0bPrhjq7SU","date":"Mon Apr 05 15:44:30 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepRiggleman It's also a I Can See Clearly Now by Johnny Nash kind of day","date":"Sun Apr 04 20:23:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What troubles me most is the impetus for these measures stems from a big lie designed to undermine faith in our elections. Let's use facts and evidence to make voting EASIER for all Americans, not harder.","date":"Sun Apr 04 20:19:02 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"After studying the Georgia voting law, I believe it's not as good and necessary as Rs would like you to believe, nor as comprehensively horrible and unnecessary as Ds are arguing. In the spirit of objectivity, please read the law and have a look at @saletan's assessment, below:","date":"Sun Apr 04 20:14:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Big night for Third District hockey fans! Congrats to the Edina girls and Eden Prairie boys 2A state championship winners 🏆🏒 #MN03 https://t.co/pTqVWnOrTd","date":"Sun Apr 04 12:07:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"MISINFORMATION is when a President and Minority Leader conspire on a big lie to convince Americans an election was illegitimate. Conversely, private enterprise making decisions about where to locate their facilities, operations, and events is what we call FREEDOM and LIBERTY.","date":"Sat Apr 03 14:20:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"No amount of knife laws would’ve stopped the Boulder and Atlanta mass shootings, which involved guns.","date":"Sat Apr 03 12:53:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@BFD_MN @StarTribune @IAFFLocal1215 Thank you. Be safe.","date":"Sat Apr 03 03:17:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@PatKessler @jaketapper @GlennKesslerWP We're ready. \nhttps://t.co/LOeSJ1ktvS","date":"Sat Apr 03 03:07:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Every member of Congress tweets statements of dismay, heartbreak, and prayer after these increasingly common and senseless acts. Prayers and tweets don’t save lives; action saves lives. So let’s get to it.","date":"Fri Apr 02 21:00:37 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The United States of America must make a massive investment in mental health infrastructure and access to care. No more wasting of time and lives.","date":"Fri Apr 02 20:56:18 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Correction: We’ve been advised two officers were struck by a vehicle that rammed through the checkpoint on Constitution Avenue.","date":"Fri Apr 02 17:50:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"2. Mental health and addiction  issues were woven into almost every emergency to which we responded. We must prioritize and systematize mental healthcare provision and begin treating addiction as a health crisis. The cost of our inaction on patients and providers is unacceptable.","date":"Fri Apr 02 13:18:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"3. The economic, health, and housing conditions in which too many of our neighbors exist is shameful for a country of our capacity and compassion. Spend one evening riding along with first responders and I promise it will change you forever - and for the better.","date":"Fri Apr 02 13:18:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"THREAD: Spent last night riding with @hennepinems paramedics to a never ending series of tragedies and emergencies. The professionalism and compassion I observed from them, the @MinneapolisPD, and @MinneapolisFire would make every Minnesotan proud. Three thoughts: https://t.co/1YaU4GEjkN","date":"Fri Apr 02 13:18:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"1. Two truths: systemic injustice and bad apples are serious issues that must be confronted and rectified AND first responders are a remarkably diverse family of dedicated, selfless heroes risking their lives and well-being for us. They deserve our gratitude and respect.","date":"Fri Apr 02 13:18:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepRiggleman It’s also A Change Is Gonna Come by Sam Cooke kind of night","date":"Fri Apr 02 03:54:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Dear @delta: Minnesota has the highest voter turnout in the nation (80% in ‘20), offers early, absentee, and same-day voter registration, and allows hot cocoa and salted nut rolls to be shared with thirsty voters waiting in line. Just sayin’.","date":"Thu Apr 01 15:35:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"When you’ve lost @CocaCola, you’re probably on the wrong side of American history.","date":"Wed Mar 31 21:12:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“The entire rationale for this bill was based on a lie: that there was widespread voter fraud in Georgia in the 2020 elections. This is simply not true.\" - Ed Bastian, CEO of @delta, speaking the truth America needs to hear.","date":"Wed Mar 31 16:26:14 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If every American was subject to such nonsense, half the country would be jobless.","date":"Tue Mar 30 23:52:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Ice is out, vaccines are here, brighter days ahead. #MN03","date":"Tue Mar 30 21:19:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@toreyvanoot The Minnesota Tims are right! #StaySafeMN","date":"Tue Mar 30 19:43:50 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"When you find an appointment, book it. \nHere's how: https://t.co/f55ccpU4jW \n\n💉💙🇺🇸 #StaySafeMN #MNSHOTS #InThisTogether \nhttps://t.co/FMoUg89DGL","date":"Tue Mar 30 17:52:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Every shot is a step toward ending this pandemic, and today, every Minnesotan 16+ is eligible to receive one. Demand will exceed supply for now, but shipments from the federal government will continue to increase and vaccinations will be available to all at no cost. #MNSHOTS https://t.co/rgO0ZwW3rS","date":"Tue Mar 30 17:50:24 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Be like Mary! ❤️✍️  #MinnetonkaProud","date":"Sat Mar 27 18:27:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Breaking News: Former Presidents react to Georgia’s voter disenfranchisement law. https://t.co/CDuXEdLvGn","date":"Fri Mar 26 13:00:41 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Is there anything less patriotic and more anti-American than disenfranchising an 84 year-old, disabled grandma in Georgia from voting because she doesn’t have a driver’s license or state id? Yes. Not allowing her a bottle of water while she waits in line.","date":"Fri Mar 26 12:19:16 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m humbled to be named Minnesota’s most effective lawmaker in the 116th Congress by The Center for Effective Lawmaking. Cooperation and collegiality can still get things done in Washington. 🤝 https://t.co/yN38ccS0bc","date":"Thu Mar 25 17:55:23 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@atrupar Moving legislation through the United States Senate.","date":"Thu Mar 25 16:12:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A 22 year-old guy walks into a Publix grocery store in Atlanta carrying this arsenal, enters the restroom, and is soon arrested by law enforcement. In America, the only policy currently in place to prevent massacres is praying for luck. https://t.co/RcTcD53Rxd","date":"Thu Mar 25 16:03:57 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The kind of grace to which America and every human being should aspire.  https://t.co/vwOjLXJ7pG","date":"Thu Mar 25 02:05:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Shameful. https://t.co/FI6SyFKyHB","date":"Thu Mar 25 01:29:02 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"HAPPENING NOW: What questions do you have about getting vaccinated against COVID-19 in Minnesota? Join the conversation! https://t.co/GI8vTMGOYR","date":"Wed Mar 24 23:50:35 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"During the Gun Control Act of '68 hearings, NRA executive Franklin Orth supported a ban on mail-order gun sales, stating, \"We don't think any sane American, who calls himself an American, can object...\" Perhaps such sanity can prevail again in America, when we need it most.🇺🇸","date":"Tue Mar 23 21:35:40 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@MahoneyEb We have you in our hearts, Erika. May your father's memory   be for a blessing and may his life and his loss - along with nine other precious people - be an inspiration to all of us in Congress and our country to take action.","date":"Tue Mar 23 20:58:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I don't apologize for thoughts and prayers. In fact, I issue them every few weeks. But the evidence indicates prayers to a higher power must be complemented with action by human power if we hope to protect precious lives. And I pray we start to do so.","date":"Tue Mar 23 15:00:37 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Ten more precious lives including a police officer. It’s time we look to our Constitution through the lens of protecting human lives rather than protecting weapons of human destruction.","date":"Tue Mar 23 02:59:44 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"If we invested half as much effort protecting Americans from domestic terrorism as we do preventing foreign terrorism, thousands more Americans would be alive tonight - including six precious people in Boulder.","date":"Tue Mar 23 02:11:43 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"What questions do you have about getting vaccinated against #COVID19? @SenTinaSmith and I are getting the answers you need from @mnhealth and local experts. Join us!\n📆 6:45CT, Wednesday, 3/24\n📲 CALL IN 855-927-0897\n💻 STREAM at https://t.co/vLW97cvMZO or https://t.co/2huvbT5Wgx https://t.co/X8VJ6ZZm8F","date":"Mon Mar 22 20:27:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Losing a House election by six votes is painful for Democrats. But overturning it in the House would be even more painful for America. Just because a majority can, does not mean a majority should.","date":"Mon Mar 22 13:51:20 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Let’s stop the language gymnastics. There’s a crisis of policy, a crisis of staffing, and a crisis of facilities at our southern border that must be addressed immediately. Decades of poor leadership and management.","date":"Mon Mar 22 12:18:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’ve met the mothers walking across the river. I’ve sat with the children in the cages. I’ve walked through the reeking facilities. It has been a crisis for years, so let’s stop the nonsense and start investing in humane facilities, compassionate policies, and secure borders.","date":"Sat Mar 20 13:51:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Stop the steal. https://t.co/5W65gc8D5B","date":"Sat Mar 20 13:21:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Because the minority party uses motions to recommit not to legislate, rather to create content for obnoxious and misleading ads that create false narratives and undermine truth every election. But you already knew that.","date":"Sat Mar 20 12:41:48 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Hate is a virus for which the only vaccine exists within ourselves in the form of compassion, respect, and love for one another. It cannot be legislated and no amount of money can fix it. But we can. And we must.","date":"Sat Mar 20 12:38:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Fact check: #HR6, as written, bars eligibility relative to national security and criminal activity, AND the @DHSgov Secretary has authority to deny applicants who present a demonstrable threat to public safety or is a direct participant in a criminal street gang. #truth","date":"Fri Mar 19 17:17:58 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Your and my ancestors also lined-up to come to America, @GOPLeader. The crisis is a failure of both parties for decades to reform our broken immigration system. So let’s do it. https://t.co/H0kFjqaXrz","date":"Fri Mar 19 16:00:12 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Apparently an election was, indeed, stolen in 2020.  https://t.co/VGvHZjObgt","date":"Fri Mar 19 12:16:10 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We cannot conduct campaign activity for ourselves on our official Twitter, but we can for our dogs. So if you love Henry like I do, please consider voting for him in the next 90 minutes before the polls close. Henry for The House sends his gratitude. https://t.co/cwNXLEcgjJ https://t.co/2doengONqr","date":"Fri Mar 19 02:27:29 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The man who kissed the ring of Trump (after acknowledging his role in inciting the insurrection) is suddenly interested in national security.","date":"Fri Mar 19 01:28:46 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We just passed #HR6 to provide a path to citizenship for Dreamers, the undocumented immigrants brought to our country as minors. Heartfelt gratitude to the 9 Republicans who joined with all Democrats in choosing compassion over exclusion. 🇺🇸 https://t.co/FlUzLy4v4j","date":"Thu Mar 18 22:28:49 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The processing delays we're seeing are unacceptable, so I wrote to the Biden Administration to outline how we can make the Liberian Refugee Immigration Fairness program function as intended RIGHT NOW: https://t.co/ftk1eHVDgC [2/2] https://t.co/SxMsOLWF4V","date":"Thu Mar 18 21:36:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"With a Green Card in hand, my friend Louise is one of the fortunate 91, but the story of DED isn't over. As Congress considers #ImmigrationReform, we must come together to ensure every eligible LRIF applicant receives fair treatment and full transparency. [1/2, 📸 May, 2019] https://t.co/VU8s2Iedm1","date":"Thu Mar 18 21:36:38 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"To the states in which it's legal to purchase a gun the same day one wants to, but illegal to vote the same day one wants to: do you recognize the hypocrisy?","date":"Thu Mar 18 17:14:19 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It takes remarkable courage to vote AGAINST honoring the men and women in uniform who saved our Capitol and our lives on January 6th knowing you have to make eye contact with them tomorrow morning at the metal detectors.","date":"Thu Mar 18 01:12:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Bowl_of_Worcel Biggs (R-AZ)\nMassie (R-KY)\nHarris (R-MD)\nGooden (R-TX)\nGaetz (R-FL)\nCloud (R-TX)\nClyde (R-GA)\nGreene (R-GA)\nGohmert (R-TX)\nSteube (R-FL)\nGood (R-VA)\nRose (R-TN)","date":"Wed Mar 17 22:12:07 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"12 members of the United States Congress just voted AGAINST awarding the Congressional Gold Medal to the law enforcement agencies who defended the Capitol against insurrectionists on Jan 6. Why? Apparently because it refers to “a mob of insurrectionists”. https://t.co/bjj0BUemOi","date":"Wed Mar 17 22:07:47 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"First passed in 1994, #VAWA was reauthorized on a bipartisan basis in 2000, 2005, and 2013. It's time we do so again, with my amendment to ensure that no one is forced to stay in an abusive relationship because of their immigration status. https://t.co/HetDf9h1Yh","date":"Wed Mar 17 20:33:34 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"As a white male, I’ll say the quiet part out loud; it’s time we acknowledge and investigate why white males are killing so many people, so often, with guns. https://t.co/IirhIAZ2UW","date":"Wed Mar 17 18:57:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"An issue dear to #MN03 is on my mind as we consider immigration reform. Our Liberian community finally secured a pathway from DED to citizenship, but only 91 of 2,300 applications were approved in FY20. I'm demanding accountability before time runs out: https://t.co/ftk1eHVDgC https://t.co/N75YHqQeUE","date":"Wed Mar 17 17:38:51 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Can't wait to see what you create and look forward to seeing one winner in the US Capitol! @ISD281 @ParkCenterSrHS @PerpichArtsHigh @ISD112 @District271 @edinaschools @ChaskaHawks @LifeatBlake @HolyFamilyFire @HopkinsHigh270 @ISD883 @DelanoSchools @WMPublicSchools @HighArmstrong https://t.co/Ja4HMShsEC","date":"Tue Mar 16 23:50:40 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I invite all #MN03 student artists to participate in the Congressional Art Competition, open now: https://t.co/7YGrR8fl74\n@ChaskaHigh @MoundWestonkaHS @CoonRapidsHS @EHSinformed @EPS272 @ISD728 @TonkaSchools @ProvidenceLions @WayzataHS @AHSchools @OronoSchools @JFKEagles @ISD279 https://t.co/9bybTF4vVq","date":"Tue Mar 16 23:50:36 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@MNFarmersUnion @NDFarmersUnion @sdfarmersunion @wifarmersunion @MFUfarmers @FoundingFarmers Outstanding!","date":"Tue Mar 16 23:21:48 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RepAngieCraig @AllHealthPolicy Ope! 👋","date":"Tue Mar 16 23:14:53 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"It’s time for MN to lead on #ClimateAction and clean energy. The #CleanCarsMN rule would tackle the greatest source of greenhouse gas emissions in our state—preserving public health and saving MN taxpayers billions in the process. I urge speedy adoption: https://t.co/JWcVd42Cdl","date":"Tue Mar 16 22:54:01 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Worst Kept Secret Alert 🚨:\nThe Congressional committee structure is designed to maximize fundraising for both political parties, NOT to maximize effectiveness for American people. It’s nauseating.","date":"Thu Mar 11 16:08:45 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I’m a gun owner and among the 90% of Americans who support expanded background checks and closing the ‘Charleston Loophole’. I voted for safer communities today, and thank my Republican colleagues who joined us to help save lives.  #HR8 + #HR1446 = #ReduceGunViolence","date":"Thu Mar 11 15:54:46 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Pure class, @Edelman11. Let’s extend more invitations with our condemnations.","date":"Thu Mar 11 00:07:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"75% of registered American voters and 59% of Republicans support the package (Politico/Morning Consult poll). It’s one of the most bipartisan measures imaginable - according to the people that matter.","date":"Wed Mar 10 22:34:32 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@mngop Absolutely. Especially when 75% of registered American voters support it, including 59% of Republicans. (Politico/Morning Consult poll) It doesn’t get more bipartisan than that. Thanks for the re-tweet, and have a nice day!☀️","date":"Wed Mar 10 21:23:06 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Nellie_Frog We'll be ready to show you around, Nellie!","date":"Wed Mar 10 20:37:37 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"No. Universal background checks on guns are meant to ensure only law abiding citizens can own them.","date":"Wed Mar 10 19:28:54 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"We just passed a bill that funds vaccinations, the re-opening of schools, support for our cities and towns, stimulus for our economy, AND reduces child poverty by almost 50%. It has been a good day at work. 🇺🇸","date":"Wed Mar 10 19:17:21 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@Mleele We look forward to welcoming you, Michelle!","date":"Wed Mar 10 18:39:27 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@RoArquette Tru that!","date":"Wed Mar 10 17:55:04 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Running for Congress on a platform of “it’s broken and I’m gonna fix it” and then championing the Motion to Adjourn once elected to Congress is...","date":"Wed Mar 10 14:56:33 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@JTutino @HeardontheHill Come on by anytime, Joe, and we can talk about it as long as you’d like.","date":"Tue Mar 09 01:59:38 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"This is why we passed #HR1👇🏼","date":"Tue Mar 09 01:47:49 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Obstructing a slate of BIPARTISAN bills to make a 10 minute process take over 10 hours sets a low bar even lower.","date":"Tue Mar 09 00:10:08 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"UFFDAH: Emerging COVID variants spread quickly and we've seen a concerning spike in Carver County. @mnhealth has launched a new saliva testing site in Chanhassen to help us control the spread. Be vigilant and continue looking out for one another, #MN03. #MaskUpMN #InThisTogether https://t.co/F3kfShYNVe","date":"Mon Mar 08 19:16:13 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"A black American providing refuge and security to a white, British royal is as poetic as it is full of grace. @tylerperry","date":"Mon Mar 08 17:47:26 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“I pray, Mr. Adams, that the United States does not suffer unduly from its want of a Monarchy.”\n– King George III to John Adams, June 1, 1785.\n\nSuffice to say, we have not.","date":"Mon Mar 08 14:32:39 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The last time we took Russia to task was the Miracle on Ice in 1980. It’s time to end the era of impunity.","date":"Mon Mar 08 00:51:19 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Enforcement of user agreements is not ‘censorship’, it’s Constitutionally protected behavior by private enterprise.","date":"Sun Mar 07 23:56:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Looking forward to it!","date":"Sun Mar 07 15:00:09 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"I discussed the dire situation in Ethiopia during our @HouseForeign Africa hearing this week, an issue of great importance to my constituents with friends and family in the region. I've advocated for an urgent @StateDept briefing, now confirmed for 3/17. https://t.co/R4HLao8sz1","date":"Fri Mar 05 20:42:42 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The obnoxious stunt in the Senate last evening will help explain why I support allowing 16 year-old Americans to vote. 🇺🇸","date":"Fri Mar 05 15:47:38 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"@lindsemcpherson @CAMcGrady Joe is a House treasure.","date":"Thu Mar 04 22:58:11 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The bill didn’t change. Something else did.","date":"Thu Mar 04 03:52:46 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Tonight we'll pass #HR1 - along with 5 of my amendments - to secure our elections, tackle corruption, reduce the influence of dark money, eliminate partisan gerrymandering, amplify the impact of small dollar donors, and protect the rights of voters, NOT POLITICIANS. #ForThePeople https://t.co/NjaDWCyoyx","date":"Thu Mar 04 01:41:40 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"*wish","date":"Wed Mar 03 23:19:00 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"While grateful for the concern for our safety by leadership, I’m disappointed by this decision. We cannot allow threats by misinformed, cowardly seditionists to impact our work in Congress. Doing so only rewards such behavior and emboldens traitors who which to harm our country.","date":"Wed Mar 03 23:15:54 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"Inexcusable and unforgivable.","date":"Wed Mar 03 02:32:35 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"The body politic has been infected with disinformation (like me singing opera) and the antidote is truth. I wrote the Voter NOTICE Act, being added to #HR1 today, to combat bad actors who mislead American voters and subvert the will of the people: https://t.co/ELCTH7tEQk https://t.co/SfY33PDxrQ","date":"Tue Mar 02 20:20:22 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"“Fun rides”, unwelcomed touching and innuendo, and lying about one’s past and present are hallmarks of weak, corrupted men who shouldn’t be elected or appointed to public office.","date":"Tue Mar 02 13:44:31 +0000 2021","user_id":"1061310112013434882"},{"handle":"RepDeanPhillips","text":"$305,000 per hour is 42,069 times more than $7.25 per hour.","date":"Mon Mar 01 22:19:21 +0000 2021","user_id":"1061310112013434882"}]