[{"handle":"RepDonBacon","text":"I started out as an intelligence officer in 1985. [...] In 1992, I went to the 41st ECS as a captain, came back in 2000 as a lieutenant colonel, and became commander in 2002. Thank you to the @AirForceTimes for covering this story. https://t.co/BmBAmJ2OTV","date":"Fri Jun 17 13:01:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great meeting with AIPAC to discuss our continued partnership with our strongest Democratic ally in the region. The recently found Hezbollah tunnels crossing into Israel, funded by Iran and spanning miles, only underscores the need to combat these radical terrorist groups. https://t.co/kZfCJxXY4g","date":"Thu Jun 16 22:35:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My colleagues &amp; I are asking the President to address farm input costs, stop WOTUS, turn the EPA toward science, &amp; end onerous climate rules that do nothing to help the environment. From high fertilizer costs to disruptions in the global food supply chain, Americans are hurting. https://t.co/QfqYAh6eUy","date":"Thu Jun 16 20:25:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you the National Feed &amp; Grain Association for the invite. It's also great to see visitors from Nebraska. Vital agricultural chemicals come from China &amp; Russia. We need to restore domestic production in the U.S. and protect our supply lines and AG industry. @NGFA https://t.co/lgyG1HHCrV","date":"Thu Jun 16 17:01:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to the National Association of Home Builders for awarding me the Defender of Housing Award. We discussed the many issues facing our supply chain and the rising prices of lumber and fuel. https://t.co/a6AlyFpogu","date":"Thu Jun 16 14:25:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We cannot afford to fall behind in “artificial intelligence” technologies. We need a national strategy to ensure America and the free world prevails. \nhttps://t.co/WcGHrwsKCD","date":"Thu Jun 16 13:05:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HumphreyPT Neville Chamberlain couldn’t have said it better than you.","date":"Thu Jun 16 11:15:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Inflation is so bad that the Fed raised interest rates by 75 basis points —the largest increase in 28 years. https://t.co/aUuX9WgZxY","date":"Wed Jun 15 23:15:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Had a great meeting with the Romanian Parliamentary to discuss increasing cyber security between our two nations, promoting energy independence, and expanding transnational infrastructure projects under the Three Seas Initiative. https://t.co/MjggGIfeXH","date":"Wed Jun 15 21:20:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@politiwars @robbystarbuck @HumphreyPT The Pentagon does account for what we’ve given Ukraine. A red herring.","date":"Wed Jun 15 19:16:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HumphreyPT @robbystarbuck We’ve enabled Ukraine to negotiate from a stronger position. Russia wanted all of Ukraine and failed. If I was Ukrainian though, I wouldn’t negotiate away territory and reward the killing of thousands and thousands of innocent citizens. Appeasement never works in long run.","date":"Wed Jun 15 19:15:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@thoseboysmomma My votes would have lowered inflation. The majority took us down a bad path.","date":"Wed Jun 15 19:12:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@robbystarbuck @HumphreyPT I voted against the select committee. \n\nIf Russia wins in Ukraine, they’ll invade again and likely a bigger war will occur. If you don’t stand up to a bully, the bully comes back more aggressive.","date":"Wed Jun 15 19:05:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I thank @SenatorFischer for pushing this through the Senate, and the entire French family for bringing his story to our attention. I look forward to visiting the post office and having his name displayed for future generations to see. (2/2)\nhttps://t.co/YzEvDFjK5o https://t.co/q5b3BbRltp","date":"Wed Jun 15 18:14:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"BIG NEWS! My bill, HR 4168, was just signed into law! This legislation will rename an Omaha post office after Petty Officer French who swam in shark infested waters to save 15 of his shipmates during WW2 after their ship was attacked. (1/2)","date":"Wed Jun 15 18:14:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HumphreyPT @robbystarbuck Lots of questions, but conservatives don’t cower to Russian bullying. We stand up for freedom.","date":"Wed Jun 15 17:50:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our federal law officers answer the call any time of the day, or night, to protect Americans &amp; acquire justice. I’m pleased to join this bipartisan legislation to make sure our federal LEOs get these hours counted as part of their retirement calculations.\nhttps://t.co/NchkOIIDwF","date":"Wed Jun 15 16:30:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BusaPoy Mr Greenblatt’s leadership has made positive change and more unbiased.","date":"Wed Jun 15 16:07:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@matt_morton Thankfully the Senate, unlike the House, is working in a bipartisan way.","date":"Wed Jun 15 16:02:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HumphreyPT Good conservatives should stand up to Russia and it’s behavior. No to Neville Chamberlains in our midst.","date":"Wed Jun 15 16:01:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I appreciate the leadership of Jonathan Greenblatt and the ADL who condemn all forms of anti-semitism, violence, and hate regardless of which side of the political aisle it comes from. https://t.co/B0HRKTGaYJ","date":"Wed Jun 15 15:22:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha Enjoy this article. \n\nhttps://t.co/KHl1KPxzks","date":"Wed Jun 15 11:25:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We enjoyed seeing you and the AIPAC team yesterday. I will always support an iron-strong relationship with our ally Israel.","date":"Wed Jun 15 11:24:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha Colonel, here’s some good reading. \n\nhttps://t.co/KHl1KPxzks","date":"Wed Jun 15 11:21:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha Larry Summers, Treasury Secretary for Clinton and Economic Advisor to Obama disagrees with you. He warned in Feb 2021 that the $1.9T COVID Bill would trigger bad inflation. Other Dem economists warned too. #1 issue for voters now.","date":"Tue Jun 14 22:19:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In May, CPI increased 8.6%—the largest increase since December 1981! Inflation will also cost Americans OVER $5,000 this year. To combat these rising prices, we need to STOP excessive federal spending. Americans deserve better. #InflationIsTaxation https://t.co/cjcPiBGiDM https://t.co/wLvMIQj0O8","date":"Tue Jun 14 20:01:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On this #FlagDay, we as a country, will never forget all that our flag represents: liberty, freedom, and striving to form a more perfect union each and every day. 🇺🇸 https://t.co/aetQXftsML","date":"Tue Jun 14 17:25:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We are committed to improving our nation's technology market from adversarial competitors by establishing a national Technology Competitiveness Council. Defending the nation and our businesses is a top priority.\n\nRead our full statement⬇️\nhttps://t.co/OdwHaqLO5J","date":"Tue Jun 14 15:20:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We cannot afford to remain stagnant as foreign actors attempt to surpass our nation through intellectual theft, electronic supply chain monopolies, and advancements in AI capabilities. I thank @RepFranklin, @RepConorLamb, and @RepCarbajal for their partnership on HR 8027. (1/2)","date":"Tue Jun 14 15:20:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today we celebrate the 247th birthday of the @USArmy, the oldest branch of our armed services. Thank you to all current and veteran soldiers for their selfless service to our nation. We will never forget those who have fallen in the line of duty to protect our country. 🇺🇸 https://t.co/YxQS4mhrEp","date":"Tue Jun 14 14:03:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CMarieMartinez @TooDamnVerbose Tax revenues are up despite the tax reductions. Our economy grew because of it.","date":"Tue Jun 14 10:47:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ArmyGrunt05 @ProjectLincoln @MeidasTouch @votevets @FPWellman @SecDef @thejointstaff Shelves still empty. Inept.","date":"Tue Jun 14 10:45:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Russlt1965 @SPepper1964 @PammsyB @MeetThePress I won my primary dude.","date":"Tue Jun 14 04:04:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 We lead the world and impact it when we do dumb financial policies. Again, Dem Economists warned us and they were right.","date":"Mon Jun 13 23:35:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@TooDamnVerbose We didn’t need the highest inflation in 41 years… the average family is losing $500 a month due to inflation. A reverse stimulus check.","date":"Mon Jun 13 23:34:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 Larry Summers predicted it… he warned against the $1.9T COVID Bill. Summers was Secretary of Treasury for Clinton and Economic Advisor to Obama. He was right.","date":"Mon Jun 13 23:06:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@TooDamnVerbose For example, when Biden-Pelosi passed the $1.9T so-called COVID Bill (9% went to COVID healthcare) it had zero pay-fors… no cuts were taken anywhere else. This has effect of adding 10% additional liquidity into our money supply, which then devalues the dollar.","date":"Mon Jun 13 23:05:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 Inflation was low during previous Admin. I’ve voted against $9T in new spending in last 16 months.","date":"Mon Jun 13 22:15:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My colleagues and I signed a letter urging President Biden to reconsider his negotiations with OPEC. In Jan 2022, the average price of a gallon of gas was $3.41. In May 2022, the average cost was $4.54. We cannot be at the mercy of OPEC nations regarding the global energy supply. https://t.co/jmxJ4tt8m3","date":"Mon Jun 13 21:30:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I worked hard to include my bill, H.R. 4982, in the #CARESAct. This provision expedites mask production during a global pandemic, such as #COVID, and ensures essential personal protective gear is available for our medical professionals, first responders, and workforce. https://t.co/jMiRQsp9cv","date":"Mon Jun 13 18:20:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We welcome Gen. Cotton to NE! We were colonels and one stars together. I’m confident in his leadership &amp; commitment to improve our national security strategy. Admiral Richard has been an incredible leader at USSTRATCOM and for the US. We wish him the best.\nhttps://t.co/O23KIqkXcS","date":"Mon Jun 13 15:25:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I enjoyed speaking yesterday at the Filipino-American Friendship Day celebrating 124 years of Filipino independence and their wonderful heritage. Thank you to Santo Nino Omaha Committe for the invitation. https://t.co/WIwm0QULYe","date":"Mon Jun 13 13:50:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@kto622 @GenuineHajek #1 of 535 ranked by Common Ground Committee for  seeking consensus, and #12 of 435 by Georgetown for bipartisanship. \n\nIn 2020 I knew the alternative was high inflation, high gas prices and a border crisis… that is what we got now.","date":"Sun Jun 12 23:51:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@lewis_lewisms Other areas that was appropriated was cut and moved to infrastructure bill. Economists point out that the fifth COVID bill triggered inflation, but not the infrastructure bill. We spend 2% of our GDP on infrastructure, less than of Canada and Europe. We need good infrastructure.","date":"Sun Jun 12 23:42:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@babydoll747 @centerista Yes! #1 out of 535 ranked by @commongroundcom for seeking consensus. #12 out of 435 tanked by @TheLugarCenter for bipartisanship. Thanks for highlighting.","date":"Sun Jun 12 23:39:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@timgill924 14 bills signed into law!","date":"Sun Jun 12 23:16:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@lewis_lewisms Most of infrastructure money hasn’t been spent. That, and the fact most of the bill was paid for means it did not cause inflation. In contrast, the $1.9T so-called COVID bill was all new spending w/ no pay fors… it added 10% liquidity into our money system and very inflationary.","date":"Sun Jun 12 22:43:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"2021 went down as the WORST year for #inflation since 1981. Now, CBO expects both short and long-term interest rates over the next 10 years to be HIGHER, on average, than in its previous forecast. We need to LIMIT excessive federal spending. https://t.co/pyJeaTCttp","date":"Sun Jun 12 20:00:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@GenuineHajek Thank you very much. I knew Senator McCain and considered him a friend.","date":"Sun Jun 12 19:08:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@3rdstpprayer Thank you!","date":"Sun Jun 12 19:04:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@She_She_Sheesh @Albomagico @MeetThePress @RepElaineLuria A tv producer and everything on teleprompter…","date":"Sun Jun 12 17:12:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On June 12, 1948, President Harry Truman signed legislation allowing women to serve as regular and permanent members of the military. \n\nThis #WomensVeteransDay, we honor the more than 2 million women Veterans living in the US for their dedication and sacrifice. 🇺🇸 https://t.co/BMI6oUR30K","date":"Sun Jun 12 14:01:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We must end Straw purchases. My bill, H.R. 1604, updates the current punishments, making the fines and time more severe for anyone who wishes to purchase firearms through illegal means. Gun violence can be reduced by not allowing dangerous people to have guns. https://t.co/ASDT3thBGc","date":"Sat Jun 11 21:00:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@1nfoSecBen It’s common sense given the situation we have. To not improve security at our schools would be foolish.","date":"Sat Jun 11 19:42:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SweetJMichael Due process is needed in red flag legislation.","date":"Sat Jun 11 19:42:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Are you struggling to get your children the baby formula they need?\n\nHere is what you need to know about the incoming imported baby formula. ⬇️ \nhttps://t.co/gkKU4TuaCD","date":"Sat Jun 11 15:01:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@1nfoSecBen To not secure our schools is ignoring reality. It has to be done. Our country is not going to confiscate firearms and we have a small number of deranged individuals… if we don’t secure our schools more tragedies will occur.","date":"Sat Jun 11 13:28:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@DebraJGroesser Regarding raising the age, most enter the military at 18. The 99% are law abiding. Further, the 9th Circuit Court of Appeals ruled against it and has not been overturned by SCOTUS.","date":"Sat Jun 11 13:22:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@DebraJGroesser @JimHarroldOmaha Regarding waiting periods… what do you say to an abused spouse who doesn’t want to wait because she needs protection now? We’ve encountered those situations.","date":"Sat Jun 11 13:20:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@DebraJGroesser We can all support background checks with some common sense boundaries. The Pelosi bill says it’s a felony to loan your gun to a neighbor, you have to do background checks on your family if you sell one a gun, etc. She overreaches and takes zero input.","date":"Sat Jun 11 13:17:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha I suggest you re-read the Heller decision.","date":"Sat Jun 11 13:12:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Nero_jb @OWHnews Many disagree with you.","date":"Sat Jun 11 13:09:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha My wife teaches in OPS and I have six grandkids and a seventh on way. Your “common sense” is anti 2A… be honest with yourself that you oppose the Bill of Rights. Propose an amendment and be true to yourself.","date":"Sat Jun 11 04:57:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@DogVictorOscar @Voices4Service @CityYear It’s actually a wood plaque. 😎","date":"Fri Jun 10 21:38:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The baby formula crisis should NOT be happening in a developed nation. Every parent should have easy access to baby formula for their children. My colleagues &amp; I are working hard to make this a reality again with HR 7875, the Emergency Infant Formula Act. https://t.co/uxO30PBKTv","date":"Fri Jun 10 20:40:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Recent reports are surfacing that a suspected terrorist was released into the U.S after being apprehended while crossing the southern border. Border security IS national security. Under President Biden’s open-border agenda, we have NEITHER. https://t.co/RK68j4nxsk","date":"Fri Jun 10 17:01:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@tntradioempire My wife is a teacher too. You think you know the Second Amendment better than the Supreme Court. 😂 While you attack the rights of law abiding citizens, I’ll focus on protecting our schools, improved mental healthcare and keeping guns out of criminals’ hands.","date":"Fri Jun 10 14:17:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We need better security at our schools. @RepHartzler's bill, H.R. 1567, allows qualified and retired Law Enforcement Officers to carry firearms on school grounds if the school board allows it. I urge both the House and Senate to support this bill. https://t.co/o2dzc1H40U","date":"Fri Jun 10 14:03:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SisterAsphalt You’re oblivious. I support mental healthcare.","date":"Fri Jun 10 04:01:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@jessicafrathbun @tntradioempire You want to disregard security, I don’t. We should protect our schools.  It is reality.","date":"Fri Jun 10 03:58:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha The President is silent… and you’ve been silent too Colonel. Do better. I support better school security, and you along with the far left you affiliate with oppose.","date":"Fri Jun 10 03:52:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@tntradioempire I want to improve security at schools. You should too.","date":"Fri Jun 10 03:49:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@1nfoSecBen We need to protect our schools. I’ll do it. The other side refuses to.","date":"Fri Jun 10 03:46:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SweetJMichael Defend due process and bill of rights. There’s a hundred types of red flag laws… get it right.","date":"Fri Jun 10 03:43:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SisterAsphalt You’re wrong about mental health. I’m a leading proponent for mental health. We will focus on it too and win.","date":"Fri Jun 10 03:41:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@1nfoSecBen I believe in protecting our schools. It’s reality. You don’t.","date":"Fri Jun 10 03:20:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SisterAsphalt We should defend our schools. We agree.","date":"Fri Jun 10 03:18:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@mccoy_US @DonJBacon 20-20 vision.","date":"Fri Jun 10 03:13:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@thoseboysmomma @DonJBacon @CapedJA Four decades… terrible.","date":"Fri Jun 10 03:13:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@1nfoSecBen Then we should agree to support better school security.","date":"Fri Jun 10 03:08:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ShandaPanda333 I didn’t take it that way. I agree.","date":"Fri Jun 10 03:02:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The double standard towards the assassination attempt against Justice Kavanaugh is apparent. Silence from the President and major media is wrong. There is a legal obligation to defend SCOTUS &amp; families. The Senate passed bipartisan legislation, but Pelosi is missing in action.","date":"Fri Jun 10 03:00:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SisterAsphalt @dlk245 I supported the bipartisan commission, not the hyper partisan select committee.","date":"Fri Jun 10 02:49:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@thoseboysmomma @DonJBacon @CapedJA Busy days for next three… you’ll enjoy!","date":"Fri Jun 10 02:47:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"2022 1st Qtr. GDP growth rate:\n❌ China 4.8%\n❌ USA -1.5%\nThis is not just an economic issue, it's a national security issue. We need a growing economy to effectively counter the repressive regime of the Chinese Communist Party. https://t.co/xqAwZ22j7l https://t.co/M8T5LQbUWq","date":"Fri Jun 10 00:10:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Whether it was commanding in the Air Force or being a member of Congress, it has and always will be my mission to serve our country. I will continue to work with organizations like @Voices4Service and inspire more Americans to invest in the future of our country. https://t.co/DVBABTocbo","date":"Thu Jun 09 21:00:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Received a response to our 5/11 letter to AG Garland regarding the need to secure the safety of our SCOTUS. It says a lot of nothing. In light of the recent arrest of a man who wanted to kidnap and kill Justice Kavanaugh, the lack of urgency by the Biden Admin is very concerning. https://t.co/KZ8SXJRGzY","date":"Thu Jun 09 19:45:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"CBP says there were 234,088 migrant encounters at our southern border in April, the worst in two decades. These incredible numbers come as the Biden Admin is still wanting to end Title 42, a decision that will only worsen the historic border crisis. https://t.co/ll3ZZ5iHTh","date":"Thu Jun 09 18:01:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to @Voices4Service for awarding me the Congressional Service Award. Encouraging a strong culture of national and public service is one aspect of American patriotism that makes our country the greatest in the world. @CityYear #FriendsofService https://t.co/3NJNp3Z3gz","date":"Thu Jun 09 15:01:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@akgrl33 I’m all in… and so is our team.","date":"Thu Jun 09 03:08:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BStokesArch We need to better protect our schools.","date":"Thu Jun 09 01:44:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@frenchat Comms Director here. … please call the District office at 402-938-0300. Hours are 9-5 Monday through Friday. https://t.co/9TyvxZksmY thanks.","date":"Thu Jun 09 00:06:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Amazing turnout at the Nebraska Breakfast this morning! I talked about the need to strengthen security in the Baltics, increase transparency in the defense budget, pass a strong Farm Bill, and improve school safety. We also need to lower gas prices and be energy independent. https://t.co/sH6LhetWij","date":"Wed Jun 08 17:01:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Rebecca28049528 @RepTomEmmer It’s the top issue on voters’ minds.","date":"Wed Jun 08 13:33:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great to see the wonderful 4H crowd this morning! \n\n#4HCWF","date":"Wed Jun 08 13:19:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@frenchat @UAPipeTrades With 5 more seats or better we’ll be in majority and we can pass legislation you are asking for.","date":"Wed Jun 08 10:49:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@frenchat I’ve supported all legislation that supports energy independence. I’m #1 rated member of Congress by the @UAPipeTrades for fighting for “all of the above” energy infrastructure.","date":"Tue Jun 07 22:26:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to Mrs. Doris Lassiter from Nebraska Center for Health Families and Bread of the World for stopping by to discuss food insecurity and my support for HR 4693, the Global Malnutrition Prevention and Treatment Act of 2021, which will help 58 million children in need. https://t.co/iWHp75wk0H","date":"Tue Jun 07 20:50:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@holly_harris @Rebecca28049528 Air Power!","date":"Tue Jun 07 16:05:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@holly_harris @Rebecca28049528 Thank you.","date":"Tue Jun 07 16:04:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Lugar Center is the best-known index on rating bipartisanship in Congress and rates me #12 out of 435 members! Since elected, I have worked across the aisle without compromising my principles or breaking promises I have made to the citizens of #NE02. https://t.co/YjZHTpF1wd","date":"Tue Jun 07 13:15:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"June is #NationalDairyMonth. This is a good time to mention that all 195 dairy farms in Nebraska are family-owned and operated, and #NE02 is home to two dairy processing plants! Thanks to Nebraska's dairy farmers for your tireless work to feed our state, country, and world. https://t.co/pyN8hmHXQj","date":"Tue Jun 07 04:13:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Statistics don't lie! Nearly 17 months into the Biden Administration, the U.S. is still 1.19 MILLION jobs SHORT of where we were prior to COVID. Consumer confidence is getting worse by the month. https://t.co/mBmfCBYMUd","date":"Mon Jun 06 23:15:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The return of war to the European continent earlier this year reminds us of the long and brutal occupation of the Baltic states by the Soviet Union. @RepRubenGallego and I will always stand by our #NATO allies and defend our liberties.\nhttps://t.co/sPiMjEc6va","date":"Mon Jun 06 17:45:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On this day in 1944, parachuting out of aircraft and running across beaches, Americans from all walks of life began a decisive point in the Allies victory in WW2. They are the best of the Greatest Generation &amp; we are forever indebted to them for their service and sacrifice. #DDay https://t.co/NDKEz7joVU","date":"Mon Jun 06 14:02:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@MarkHenty @IamkathyVancura It’s not free. That’s why Joe Biden even disagrees with you.","date":"Mon Jun 06 02:09:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@MarkHenty @IamkathyVancura Just remember that Joe Biden said Medicare for All would bankrupt America.","date":"Sun Jun 05 23:18:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"To stay updated with my office, sign up for our e-newsletter! https://t.co/LZdI8Xkapq https://t.co/HkdiRbksIM","date":"Sun Jun 05 21:00:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Cancer has struck millions of American families, including mine. Having access to intensive early detection, individuals are able to address and treat cancer earlier on. I cosponsored H.R. 4110 as this bill provides those with inherited mutation access to early treatment. https://t.co/V6niBAP2Lv","date":"Sun Jun 05 18:00:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today is #NationalCancerSurvivorsDay and as a supporter of the #LymphedemaTreatmentAct (S.1315/H.R.3630) Act, I want to share with you that 40% of all breast cancer survivors and 15% of cancer survivors overall are affected by lymphedema. https://t.co/wQV7isKA1L","date":"Sun Jun 05 13:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Jdangelo4404 @dennis_fujan @POTUS This President cut permits for production and infrastructure.","date":"Sun Jun 05 04:02:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The COVID pandemic highlighted how vital supply chains are to our national security. As a member of the Defense Critical Supply Chain Task Force, my colleagues and I are committed to identifying risks and keeping a competitive edge over our adversaries. https://t.co/eir47iIEpm","date":"Sat Jun 04 20:40:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Beth867_539 Cut production permits and slow rolled infrastructure permits. He promised he’d do so during the campaign, and he did.","date":"Sat Jun 04 18:56:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@dennis_fujan @Jdangelo4404 @POTUS The left wages war against US energy companies, then asks OPEC to do more, and wants a deal with Iran and Venezuela. Terrible policy.","date":"Sat Jun 04 18:54:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"“He reflected the best of America with his courage, and doing the right thing, and his bravery,” he said. https://t.co/yGygSe49XQ","date":"Sat Jun 04 18:50:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"June is #NationalSafetyMonth! It's important to identify safety hazards and risks in your home, work, and community. Having first aid kits on hand, practicing fire drills, or providing water safety tips for the summer are just a few things we can do to make our lives safer. https://t.co/RjEIpoSHZ7","date":"Sat Jun 04 14:02:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I'm committed to fighting against the high inflation hurting the people of #NE02. The main cause is EXCESSIVE government spending, which is why I have voted against the House majority’s $7 trillion in new government spending during this year alone. https://t.co/JMrsd045je","date":"Sat Jun 04 01:00:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@RobAnderson2018 @JonesWest86 @gb4bedfordfalls @existentialhum Gas prices and inflation were climbing fast prior to Russia’s invasion, but yes Russian invasion made it worse. The President campaigned on going after America’s fossil fuel industry, but now wants OPEC to pump more.","date":"Fri Jun 03 21:54:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Getting baby formula shouldn’t be something parents have to worry about every day. I'm working hard with both sides of the aisle to ensure parents get their children the formula they need with H.R. 7875. https://t.co/YslvRtLTr9","date":"Fri Jun 03 20:01:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Joe Biden and Nancy Pelosi’s America. Energy independence is national security, lowering cost of living, and creating more American jobs. https://t.co/cryIyKcy8Y","date":"Fri Jun 03 18:45:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"It took almost 9 months to get a response from Biden’s State Department about honoring our commitments to our U.S. citizens in Afghanistan and Afghan allies, who supported our troops. We will not forget them. https://t.co/XeJ7ns2rIn","date":"Fri Jun 03 18:01:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@existentialhum Those are nice cars. Unfortunately, many cannot afford them. The average family has lost $500 in purchasing power a month due to inflation, so summer travels will be impacted. Safe travels.","date":"Fri Jun 03 15:58:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Gas prices keep rising! How is it affecting your summer vacation plans? https://t.co/Ixi320y3Or","date":"Fri Jun 03 15:16:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"2021 was the WORST year for inflation since 1981. https://t.co/v3dhbIXpoy https://t.co/OEQQPJJcfP","date":"Fri Jun 03 15:01:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bellsnwhistles @ad1220 No struggle. Read Larry Summers who worked for two Dem Presidents. He warned… Biden and Pelosi charged on anyway.","date":"Fri Jun 03 04:05:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bellsnwhistles @ad1220 The nation knows what the worst inflation in 40 years is though.","date":"Fri Jun 03 03:45:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"CBS: Yellen admits she was \"wrong\" about inflation in 2021\n\nThe Administration was warned in March, 2021 that its spending plans would trigger inflation. Biden pressed on anyway with partisan party-line votes &amp; now we have the worst inflation in 40 years. https://t.co/7wrVluvob6","date":"Fri Jun 03 01:41:20 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Rebecca28049528 I hear from local constituents that disagree with you too.","date":"Fri Jun 03 01:31:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"While I will continue to urge the Administration to address the infant formula shortage, I'm an original co-sponsor of H.R. 7875 and H.Con Res. 90 and sent a letter to the FDA. In the meantime, here is some information regarding access to imported supplies https://t.co/14EygqIxOz","date":"Thu Jun 02 22:01:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Local law enforcement tell me the #1 action to reduce gun violence is to hold people accountable for making illegal straw purchases. These violent crimes happen too often, which is why I introduced H.R. 1604. This will bring justice and safety to our affected communities. https://t.co/TLUTBMPVEe","date":"Thu Jun 02 20:01:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Gas prices keep soaring to record highs. Meanwhile, Biden recently cut production permits, &amp; is slow-rolling energy infrastructure permits.  While our energy production is being held down, Biden is asking OPEC to produce more. This is a failed policy. https://t.co/anSId9DAqT","date":"Thu Jun 02 16:50:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"H.R. 943, now law, creates a grant program to help teachers incorporate Holocaust education into students' lesson plans. As a lead cosponsor for the GOP side, I made it one of my legislative priorities to get this passed so that we never forget or let history repeat itself. https://t.co/67LC4HZW7b","date":"Thu Jun 02 14:00:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@sebomaha28 @PeakPathways @janekleeb @NebraskaYR @DonJBacon The point is I’ve advocated and supported community health centers contrary to what your partisan and snarky posts said. \n\nYou’ll enjoy our extensive labor support this year too.","date":"Thu Jun 02 11:54:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Mental healthcare IS healthcare. Decades ago we disinvested from in-patient care, but didn’t transfer that spending to out-patient care. 1/3 of America has no access to mental healthcare, and we must do better. Thanks to Nebraska Mental Health Conference for inviting me to speak. https://t.co/fdCiGaLtMn","date":"Thu Jun 02 11:32:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@sebomaha28 @PeakPathways @janekleeb @NebraskaYR @DonJBacon Actually, I requested full funding for community health centers every year… and they know it. We had a ribbon cutting for Charles Drew yesterday… you’d have loved it.","date":"Thu Jun 02 11:29:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@csg0123 @usairforce You have your facts wrong. Do better research.","date":"Thu Jun 02 11:27:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This weekend's chemical plant fire shows why I co-sponsored The Federal Firefighter Fairness Act of 2021. It will classify illnesses like lung diseases &amp; certain cancers as job-related. Firefighters put their lives on the line and regularly expose themselves to toxic substances. https://t.co/UbUFIVcT6s","date":"Thu Jun 02 00:01:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Military readiness depends on our ability to dominate the electromagnetic spectrum (EMS). I was a career electronic warfare officer in the @usairforce and now I serve as Co-Chair of the Congressional Electromagnetic Warfare Working Group for the fifth year in a row. #JEMSO https://t.co/Pb9aSPQm6P","date":"Wed Jun 01 21:00:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Charles Drew Health Center’s Teen &amp; Young Adult Center opened today. It provides primary medical and behavioral health care in a youth-friendly environment. Community Health Centers are vital to our community. https://t.co/GSm4PebBCC","date":"Wed Jun 01 20:01:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"June is PTSD Awareness Month. #PTSD is a treatable mental health condition that some people, especially #Veterans, develop after experiencing or witnessing a traumatic event.\n\nHelp raise awareness and visit the National Center for PTSD website: https://t.co/Bs9fvuD0ob. https://t.co/RqNhJHL0u1","date":"Wed Jun 01 15:40:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The return of war to the European continent earlier this year reminds us of the long and brutal occupation of the Baltic states by the Soviet Union. We must stand with our Allies to never again allow dictators to redraw borders and usurp freedom. (2/2)\nhttps://t.co/xeBebVyzxg","date":"Wed Jun 01 12:38:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As Co-Chairs of the House Baltic Caucus, @RepRubenGallego and I introduced H.Res. 1142 to commemorate the United States’ diplomatic recognition of the independence and sovereignty of the Baltic nations of Estonia, Latvia, and Lithuania. (1/2)","date":"Wed Jun 01 12:38:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I’m glad to see justice served. Our flight attendants, pilots, bus drivers and passenger-train workers are increasingly targets of assaults. Those guilty must be held accountable, and our transport workers deserve the protection.","date":"Tue May 31 15:28:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our Deputy Chief of Staff attended yesterday's Memorial Day ceremony at the Omaha VA National Cemetery to honor the fallen in our nation's wars. These heroes gave their lives to protect our nation and freedoms. We are forever grateful for our servicemen and women. https://t.co/GUJz05HAa6","date":"Tue May 31 14:45:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I had 16 assignments all over the world and U.S. during my 3 decades in AF. No one honors the fallen and thanks the veterans like Nebraskans. Citizen participation on Memorial and Veterans Days are the best. This grateful veteran thanks you. https://t.co/gzvtXUyn0N","date":"Tue May 31 14:25:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I will always remember serving as a flag bearer at Arlington Cemetery. I noticed every loved one would hug the flag over their heart after I handed it to them. Those who gave the last full measure of devotion are sorely missed by their families. https://t.co/xD6L4czrcZ","date":"Tue May 31 13:30:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Offutt AFB is flying the four oldest 747s in the world, and their age is showing with high maintenance costs. These aircraft provide survivable communications in time of war. @SenatorFischer and I are working hard to get these aircraft replaced. \nhttps://t.co/J6o8gS4ouQ","date":"Mon May 30 23:25:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"President Reagan said, “Freedom is never more than one generation from extinction.” Freedom must be fought for, protected, and passed on to the next generation for them to do the same.\n\nToday, and every day, we honor those who lost their lives for our nation and freedom. 🇺🇸 https://t.co/B3v1HRDz1z","date":"Mon May 30 21:45:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I honor the four airmen killed in an MC-12 crash in Afghanistan while supporting Special Forces in 2013. I met with the parents &amp; spouses, and my heart is with them today 9 years later. We salute Reid Nishizuka, Brandon Cyr, Richard Dickson &amp; Dan Fannin.  https://t.co/QoBl6Vpswy","date":"Mon May 30 21:23:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@AnnWilcoxen1 Not everyone agrees on an issue… I campaign on my views and the majority of voters make a decision. I’m grateful for their support over last 6 years.","date":"Mon May 30 21:10:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Lincoln said, let us be “highly resolved that the dead have not died in vain.” Let us work together to keep our nation strong &amp; be involved in all levels of government. Representative government works best when we invest our talents &amp; sweat into our communities and governments. https://t.co/u3gew7CSD5","date":"Mon May 30 19:40:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CRagole For starters, the $1.9T COVID bill caused much of this inflation. I was a no vote.","date":"Mon May 30 18:22:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today we honor the 1,208,000 Americans who were killed in action while defending our freedoms. We thank God that we live in this great nation and thank those who made it possible by paying the ultimate sacrifice. https://t.co/5FU43yaIIM","date":"Mon May 30 17:45:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today, we reflect upon those who have paid the ultimate sacrifice for our freedom, pay tribute to the fallen, and never forget the families they left behind. Our Gold Star families deserve a commitment for life, and hearts are with them on this sacred day.\nhttps://t.co/rb1LOuh6Ry","date":"Mon May 30 16:25:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On this #MemorialDay, we remember our nation’s heroes who gave their lives to uphold the values we hold dear. All gave some, some gave all. We will never forget their service and sacrifice. 🇺🇸 https://t.co/t8ROzaZspu","date":"Mon May 30 14:50:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"One of the sharpest people I ever served with was Mark Stratton. His call sign was “General,” which was a tribute to his natural leadership abilities. He was a Commander in Afghanistan and killed by a suicide bomber in 2009. We honor him today.   https://t.co/RFqJGy4Jno","date":"Mon May 30 12:45:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BalticFreedom I’ll post more tomorrow. All friends or those I served with.","date":"Mon May 30 04:04:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"For years I flew with Captain Tim Haun, who was later killed in the Khobar Tower bombings in Saudi Arabia by terrorists aligned with Iran. Tim was a wonderful patriot and is greatly missed by family and friends. We honor Captain Haun on Memorial Day.  https://t.co/z89wuGCsdf","date":"Mon May 30 03:31:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I’m on the barred list. I have zero plans nor desire to visit a pariah state that is conducting a barbaric unjust war against its smaller neighbor. Putin should have to go to the Hague for war crimes. He’s the one who will be barred from travel.  https://t.co/HHFIb8jeqe","date":"Sun May 29 22:29:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#NationalBeefMonth https://t.co/XH7QcHfdt0","date":"Sun May 29 20:00:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ThomSeaton @JenGriffinFNC @susquinn @thedailybeast I signed on last September!","date":"Sun May 29 14:35:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Many farmers and ranchers have been affected by the wildfires in Nebraska. Thankfully, the Nebraska Department of Agriculture has provided several fire response resources. \n\nFor more information, visit ⬇️ \nhttps://t.co/ytTNMaaCx3","date":"Sun May 29 14:01:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Following the ugly example of Stalin.","date":"Sun May 29 00:54:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Conceding territory to Russia will only whet Putin’s appetite for more barbaric aggression against  neighbors. Putin must be defeated in Ukraine and learn a lesson that indiscriminate bombings of cities and war crimes stiffens the spines of freedom living nations. @JBANCchatter","date":"Sun May 29 00:53:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@LMelendezNews One day of discomfort per eye.","date":"Sun May 29 00:41:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@LMelendezNews It is worth it!","date":"Sat May 28 23:31:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our Deputy Chief of Staff was on hand to see Lynn DeShon of Ceresco, Nebraska present her handcrafted quilts to 5 Vietnam Veterans at St. John’s AME Church in North Omaha today, to say thanks for their service and sacrifices in Vietnam. https://t.co/wWRlmzQuWM","date":"Sat May 28 22:45:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The DPAA lab has done tremendous work in identifying America's greatest heroes and bringing closure to their families. It is my mission to work with my HASC colleagues and ensure Congress appropriates funding for completion through this year's NDAA.\nhttps://t.co/chgW3VMdUC","date":"Sat May 28 21:00:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Yankee18Michael @cappybagels Thanks. 70% of district support it too.","date":"Sat May 28 20:15:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Met this morning with Young Leaders visiting Omaha from Southeast Asian nations. We discussed our nation, our form of Government, national security topics, and the freedoms that have enabled our nation and people to thrive and positively influence the world for centuries. https://t.co/ONLzWcXoz1","date":"Sat May 28 17:00:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"God Bless our troops! 🇺🇸 https://t.co/Hq0DNjLR0e","date":"Sat May 28 15:01:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Bacon Visits Baltic Nations: “They feel vulnerable to Russia.” https://t.co/sg3uc7vs2v","date":"Sat May 28 14:01:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@guinanjoe55 Don’t hold your breath. Breathing is wise.","date":"Sat May 28 04:29:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@guinanjoe55 I’ll jet you know day by day as I post!","date":"Sat May 28 01:09:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@guinanjoe55 @BipartisanVets We have 26 this far.","date":"Sat May 28 00:59:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The citizens of Hong Kong who have seen their freedoms stripped away disagree. The Uyghurs are victims of human rights abuses by China's government with over 1M in internment camps. The recent screams heard from residents in Shanghai tell the real story.\nhttps://t.co/5IFdTi4FR5","date":"Fri May 27 23:30:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This week, we held press conferences in Lithuania, Latvia, Estonia and Finland. Questions focused on American unity regarding Ukraine, commitment to Baltic and Nordic NATO partners, and Sweden’s and Finland’s request to join NATO. https://t.co/0suCAdX5Ay","date":"Fri May 27 21:15:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The For Country Caucus is a bipartisan group of veteran and active-duty Members who are committed to using our military expertise and love for our country to break through political dysfunction in Congress. \n\nTo stay updated with our efforts, follow us at @BipartisanVets! 🇺🇸 https://t.co/8N1q8lI3pm","date":"Fri May 27 19:01:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to @SenatorFischer for her leadership and support. We look forward to the President signing this bill into law!\n\nRead the full statement here⬇️ (2/2)\nhttps://t.co/haRVP8VKzm","date":"Fri May 27 17:46:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"ICYMI: The Senate passed my bill which finally gives Petty Officer French the recognition he rightfully deserves. He lived in Omaha and rose above the bigotry of the era. His willingness to sacrifice his life to save others represents the very best of America. (1/2)","date":"Fri May 27 17:46:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to Finnish Minister for European Affairs Tytti Tuppurainen for sharing her perspective on Finland joining NATO, Russian belligerence to its neighbors, and Finland’s purchase of the F-35. @TyttiTup https://t.co/BY1U9we0sT","date":"Fri May 27 17:05:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Nebraska Department of Agriculture has opened a \"Hay and Forage Hotline\" to connect buyers with sellers of hay, pasture and other types of forage. \n\nLearn more at ⬇️\nhttps://t.co/Mt94cM5WNV","date":"Fri May 27 14:03:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@theO_NE He’s the topic!","date":"Thu May 26 22:57:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Big news! The Senate passed my bill, H.R. 4168, which will rename an Omaha post office after Petty Officer French who swam in shark infested waters to save 15 of his shipmates during WW2 after their ship was attacked. I look forward to the President signing this bill into law. https://t.co/cqYNYF9D0p","date":"Thu May 26 22:30:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I appreciate Estonia’s Secretary General of the Ministry of Foreign Affairs and friend Ambassador Jonatan Vseviov for sharing his perspective on Ukraine, Finland’s and Sweden’s request to join NATO, and plans to strengthen deterrence in Northern Europe. @vseviov https://t.co/lpQ1AMXclJ","date":"Thu May 26 21:00:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to Estonia’s Prime Minister @kajakallas for the warm welcome we received from her and her team. Estonia is a great ally and member of NATO. https://t.co/1Wwkc5FcmH","date":"Thu May 26 18:01:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Met with Estonia’s Defense Minister Kalle Laanet and Permanent Secretary Kusti Salm to hear their wise proposals for the defense of Northern Europe. We’ve seen the Russian brutality and war crimes in Ukraine, and the Baltic nations have been victimized by Russia before. https://t.co/SGriqpT7Wv","date":"Thu May 26 15:01:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Visited NATO’s Center of Excellence for Strategic Communications in Riga. Russia’s propaganda has largely failed in Western and industrialized nations. However, Putin has been effective in spreading lies in the developing world, justifying their invasion of Ukraine. https://t.co/w9yoqQ6dOy","date":"Wed May 25 20:20:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I thank Rihards Kols, Latvia’s Saeima Parliament Foreign Affairs Committee Chair, for sharing his views on Ukraine, NATO, and deterrence in the Baltics. Free nations must stand up to the Russian bully or more attacks will occur like what we saw in Ukraine. https://t.co/OLpsyGYMx3","date":"Wed May 25 13:45:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As we wait for more details about today’s events in Texas, our hearts are breaking for the victims and their families. We thank the first responders for their work during this tragedy.","date":"Tue May 24 22:37:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"May is #MentalHealthAwarenessMonth! We need to work together to provide support, educate the public, and advocate for policies that support people with mental illness and their families.\n\nIf you or someone you know needs help, visit: https://t.co/lUJ0Dyt4Hi https://t.co/yHEOOnIqaR","date":"Tue May 24 21:00:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BalticFreedom @BenNelly9 @RepRubenGallego @RepSaraJacobs You’re in right spot. Putin’s propaganda has very little traction.","date":"Tue May 24 18:42:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BenNelly9 @BalticFreedom Rinos spew Putin’s propaganda, don’t defend the Constitution and don’t defend freedom.","date":"Tue May 24 18:40:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Obama's former Sec. of Treasury Larry Summers warned us that the $1.9T \"COVID\" bill would trigger #inflation. The average American family is spending $500 more a month for basic necessities. To combat the inflation crisis, we have to control excessive federal spending. https://t.co/Mq8XFhnzW2","date":"Tue May 24 16:17:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ShandaPanda333 @SeventhSon6 We can incentivize states to focus on keeping siblings together. It results in better outcomes and less PTS. Angie and I did foster to adopt for a brother and sister, and I’m proud of their successes today as young adults.","date":"Tue May 24 14:31:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We thank our great deployed servicemen and women in Latvia for their dedication and service. https://t.co/S0YGlYwsoG","date":"Mon May 23 23:00:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great to meet Sergeant Borer from Atkinson, Nebraska! He operates M109 A7 Paladin artillery! He’s providing deterrence in Latvia. Thank you to those deployed, defending our Allies and freedom. https://t.co/imdklywZyR","date":"Mon May 23 19:50:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I’ve been supporting this mission since I was Offutt’s Base Commander. We have a commitment to every serviceman that we will not leave anyone behind. Omaha area can be very proud of this mission and that it will have its new headquarters here at Offutt. https://t.co/daBdtgXYpS","date":"Mon May 23 17:10:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This weekend, our District Director James Wright was on hand to honor Petty Officer Charles Jackson French by renaming a San Diego training pool after the heroic sailor. French selflessly saved his shipmates in shark infested waters. This recognition is long overdue. https://t.co/Hm9Y79Bqew","date":"Mon May 23 13:59:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"One of the tallest buildings in Vilnius says: “Putin, the Hague is waiting for you.” \n\nFitting statement, for Putin is committing war crimes. https://t.co/fCXmEWraGb","date":"Sun May 22 19:05:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This was the KGB HQs (approx 5 decades) and the Nazi German HQs (approx 4 years) in Lithuania. The Lithuanians treasure their independence and freedom after 52 years of barbaric occupation, and they’re great Allie’s to us. https://t.co/IcnzseKmRN","date":"Sun May 22 18:00:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"ICYMI: House advances Bacon’s bill to protect private industry from cyberattacks \n\nhttps://t.co/2lzfSORm6F","date":"Sun May 22 17:08:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Lithuania also had own border crisis that was instigated by Belarus who attempted a “hybrid war” using mass waves of refugees. Lithuania is now putting up a border barrier and having refugees apply through its embassy in Belarus. The policy has been effective. https://t.co/n9TAsuqpAN","date":"Sun May 22 16:50:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Met with leaders of the Lithuanian Special Forces. These forces deploy frequently with the U.S. and have a stellar reputation. Lithuania is a great partner. https://t.co/O1vYu24ZPD","date":"Sun May 22 16:10:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a foster to adoptive parent of two siblings, keeping siblings together in the foster care system is a priority of mine. It significantly increases their chance of having positive life outcomes. We have a responsibility to fix this and stop separations. https://t.co/eO3VS6NzPT https://t.co/BFslXUPqaU","date":"Sun May 22 15:00:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Real wages have DECREASED since Biden took office. https://t.co/OecXKdwuxQ https://t.co/xtxKJG1xiq","date":"Sat May 21 23:30:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#NationalBeefMonth https://t.co/YlH6Rpj12l","date":"Sat May 21 20:15:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Met with Vice Minister of Foreign Affairs and then the National Security Advisor to the President. Lithuania led the way by providing air defense weapons to Ukraine and halting Russian natural gas exports. It also opened up a Taiwan office and stood up to China’s bullying. https://t.co/VxW2TeUr4H","date":"Sat May 21 17:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On this #ArmedForcesDay, we pay tribute to the millions of brave Americans who volunteer to serve in our nation’s Armed Forces.\n\nTo those service members at home and abroad, my #HASC colleagues and I thank you for your continued service to our nation. God Bless you all. 🇺🇸 https://t.co/XSMbgs9O0f","date":"Sat May 21 14:01:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"ICYMI: My cyber security bill, H.R. 5658, passed the House! A close partnership between the federal government and the private sector is vital to countering cyber-attacks from other countries that threaten our national security, economy, and way of life. https://t.co/ES49ktxiAC https://t.co/2t9ZhtEP5u","date":"Fri May 20 21:25:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As Baltic Caucus Co-chairs, @RepRubenGallego and I are leading a bipartisan delegation to Lithuania. We thank the US Ambassador for hosting with four Lithuanian Parliamentarians. Deterring Russian aggression is #1 priority. After 50 years of Soviet rule, Lithuania values freedom. https://t.co/coGGNn4BEb","date":"Fri May 20 19:45:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Glad to hear @USDAForeignAg and the @USMEF served high-quality Nebraska beef in London. As a state leader in all things beef, we expect to see more of these efforts in the future.\nhttps://t.co/3Zis3Obn4Y https://t.co/rHuTKxqLxV","date":"Fri May 20 16:45:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today marks the 7th anniversary of Officer Kerrie Orozco's tragic death. We honor her sacrifice and remember her selfless service to our city. We also send our love to her husband Hector and daughter Olivia. She will forever be missed, but never forgotten. #RememberTheFallen https://t.co/pDg4L120cy","date":"Fri May 20 14:30:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our thoughts and prayers go out to the victims, families, and community of the mass shooting that took place in Buffalo, NY.\n\nMy statement⬇️ https://t.co/3F1eABYo4G","date":"Fri May 20 13:26:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I’m working across the aisle to get families the formula they need! The Emergency Infant Formula Act will help expedite infant formula imports from the EU, Canada, Japan, and the UK. Glad to be an original cosponsor and bring more attention to this supply chain issue. https://t.co/mwyIIpZKiY","date":"Thu May 19 23:00:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Jdangelo4404 @DonJBacon I voted against the big $$ bills that caused inflation.","date":"Thu May 19 22:27:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@OmaJason We are not a socialist country that does price controls. The Admin can increase production, increase supplies, which lowers prices.","date":"Thu May 19 22:00:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Here is “A Day in the Life” of a Congressman! Some days may be less busy than others, but one thing is certain—Team Bacon enjoys representing the great people of #NE02. https://t.co/j3i6qWtiyj","date":"Thu May 19 20:20:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Instead of loosening US drilling restrictions, Biden is joining Putin and Xi in propping up Venezuelan dictator Maduro. These oil profits will fuel kleptocracy and hurt Venezuelans, who Maduro jails, executes and tortures. He is an enemy of democracy.  https://t.co/4vwTgidhAy","date":"Thu May 19 19:15:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ArmyGrunt05 We have a President who waged war against US fossil fuel. He campaigned on it, did it, now we have high prices.","date":"Thu May 19 18:54:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@MCC_History_ Our intelligence community also had concerns about using intelligence dollars to track Americans. Further, Biden admin undermined trust with considering targeting parents as terrorists.","date":"Thu May 19 18:53:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Since COVID, many Americans with Medicare were unable to receive dental rehabilitation services due to the lack of billing options. I joined my colleagues in writing a letter to CMS asking them to create a billing code and alleviate this financial issue immediately. https://t.co/iSyHeUfIFQ","date":"Thu May 19 16:03:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Biden Admin is not working too hard to make fuel affordable for average Americans, but I am! I'm happy to accept this award from @GrowthEnergy and advocate for farmers and stimulate the economy. https://t.co/hRioZcSCAF","date":"Thu May 19 14:03:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"ICYMI: NE02's Congressional Art Competition Winners were announced. Thank you to all the students who participated this year. Your artwork inspires us all and makes Nebraska proud!\nhttps://t.co/eoYGni8wQ1","date":"Thu May 19 13:05:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Yankee18Michael We will discuss and help push along.","date":"Thu May 19 01:47:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Russian cyber experts are frequently attacking U.S. businesses with ransom-ware. Our cyber professionals in the Federal Govt must do more to protect against these attacks and stop these foreign hackers from preying on Americans and hurting our economy. \nhttps://t.co/RcWO7g1Shf","date":"Thu May 19 00:01:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to the Prime Minister of the Hellenic Republic, Kyriakos Mitsotakis, for addressing Congress yesterday. Maintaining and strengthening our relationship with Greece is vital to our national security and economy. @PrimeministerGR https://t.co/p1UmRw91fQ","date":"Wed May 18 21:00:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Happy 57th Birthday @NatlHeadStart! Thank you for making a positive impact on countless children in Nebraska and throughout the country. https://t.co/sCQXrTSQA0","date":"Wed May 18 19:55:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@dontell51 We are, and we also defend people’s right to worship freely and to express their faith openly.","date":"Wed May 18 19:19:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CBakerShow @BenSasse Been there twice. We have a President who is not enforcing the law.","date":"Wed May 18 19:17:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My bill, HR 5658 - the DHS Roles and Responsibilities in Cyber Space Act, passed the House with a vote of 313 to 105! This is common-sense legislation, and with this strong showing of bipartisan support from the House, I look forward to this bill quickly becoming law. https://t.co/NsiUKkmCxY","date":"Wed May 18 18:00:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Glad to be a cosponsor of the Protect and Serve Act. Our law enforcement put their lives on the line to protect our communities. This bill establishes a new criminal offense for knowingly assaulting or attempting to cause serious bodily injury to a police officer. #BacktheBlue https://t.co/ROvnkXutb9","date":"Wed May 18 15:01:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"ICYMI: @RepCarbajal and my firefighters bill passed last week. Firefighters suffer higher risk of cancer because of the smoke and toxic fumes they encounter while on duty. We need to support our firefighters who protect us. \nhttps://t.co/3X0mBHj80A","date":"Tue May 17 23:00:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to my constituent Nick Triantafillou for attending today's Joint Session with me. He and his wife Huong Truong are very kind and humble people. We enjoyed having them here in DC. https://t.co/kb8NkDyMRZ","date":"Tue May 17 20:30:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to the @alzassociation for stopping by our DC office today! The Comprehensive Care for Alzheimer’s Act is just one of the many Alzheimer's bills I support. We need to keep raising awareness &amp; increasing funding for research at the NIH if we want to combat this disease. https://t.co/V1OMZMZeNQ","date":"Tue May 17 17:01:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I re-introduced the Kerrie Orozco First Responders Support Act to allow the immediate relatives of first responders who die in the line of duty to continue processing their immigration application in a timely manner despite the death of their loved one. https://t.co/M2BtUx4Y6q https://t.co/CKzGwqIpjO","date":"Tue May 17 14:02:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My cyber security bill, H.R. 5658, just passed the House! A close partnership between the federal government and the private sector is vital to countering cyber-attacks from other countries that threaten our national security, economy, and way of life. https://t.co/ES49ktxiAC https://t.co/YA13DenLJC","date":"Tue May 17 00:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Last week, @RepCarbajal and I passed H.R. 2499, the Federal Firefighters Fairness Act. Creating the presumption that federal firefighters who become disabled by serious diseases while on duty, ensures they receive treatment and benefits that would normally not be covered. https://t.co/Jv47r1Mpd7","date":"Mon May 16 21:00:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Why is there a baby formula shortage??\n❌ supply chain challenges\n❌ product recalls\n❌ historic inflation\nAnd it started in July 2021!\nhttps://t.co/5KD4k57Hng   https://t.co/0akBhvVbHY","date":"Mon May 16 19:50:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@clnovoa You must be pretty partisan. I condemned the violence that day… and voted to certify.","date":"Mon May 16 16:22:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We love and respect our local law enforcement, and thank the many families who make it possible for their loved ones to serve. Today and every day, we honor those who have lost a loved one in the line of duty. We stand by you on good days and bad days.\nhttps://t.co/V4d6bYB1l5","date":"Mon May 16 15:45:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My colleagues &amp; I urge  @SpeakerPelosi to bring HR 72-Thin Blue Line Act to a vote. This legislation would make the murder or attempted murder of a first responder a factor to be considered in death penalty decisions. Let's protect our frontline heroes. #NationalPoliceWeek https://t.co/mFBzYdb28r","date":"Mon May 16 13:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We love our cops and and their families. I’m thankful to local law enforcement who asked me to speak at the Police Memorial Service as we honored those families who lost loved ones. We stand by our police and protect them from damaging legislation that undermines public safety. https://t.co/5M9uA8esPQ","date":"Mon May 16 00:59:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In honor of #EMSWeek, we humbly thank our EMTs and paramedics for protecting the health and well-being of all Nebraskans. We appreciate your dedication and selfless service to our communities. https://t.co/twkQvKIk6E","date":"Sun May 15 20:30:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In 1962, President Kennedy proclaimed May 15 as National Peace Officers Memorial Day. On this day, we remember those law enforcement officers who made the ultimate sacrifice, as well as the family, friends, and fellow officers they left behind. https://t.co/tI3GjlgECZ","date":"Sun May 15 17:05:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Stay updated with our office by following us on social media! You can also visit my Congressional website at https://t.co/jn1BCHiklP. https://t.co/yUjIa7ZREG","date":"Sun May 15 14:01:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janeoftheplains Glad to humor you!","date":"Sun May 15 12:33:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My House colleagues and I introduced the #BacktheBlue Act which seeks to ensure our law enforcement officers, federal judges, and public safety officers, including firefighters, chaplains and rescue crews, are afforded greater protections. https://t.co/8s8s3X5ClR https://t.co/dijQqDNcOT","date":"Sat May 14 21:30:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SecularDemsOfNE You go ahead and eat them.","date":"Sat May 14 19:33:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today we announced the winners of the Congressional Art Competition at KANEKO art gallery! Congrats to Chloe Rankin (1st place), B. Driscoll (2nd place), and Dulce Elizabeth Bonilla-Gaytan (3rd place). All 24 submissions will be displayed at the gallery until June 4th. https://t.co/4OKb65OOk0","date":"Sat May 14 18:30:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#NationalBeefMonth https://t.co/M7MQue5iAR","date":"Sat May 14 15:01:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CBakerShow May take an election victory.","date":"Sat May 14 02:10:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@gkize This Admin = 1984.","date":"Sat May 14 02:10:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Lots of questions about the President’s Ministry of Truth (Disinformation Governance Board) and my colleagues and I demand answers! This is something you see in the People’s Republic of China or North Korea. https://t.co/zfvH9piHNH","date":"Fri May 13 22:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Russia continues to follow in the footsteps of its Soviet predecessors, terrorizing the citizens of Ukraine. We condemn all genocides, past, present, and future. I thank @RepSpartz, @RepSchneider &amp; @RepSpanberger for their partnership on this legislation. https://t.co/4quoRE2SKR","date":"Fri May 13 20:05:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As co-chairs of the For Country Caucus, @RepGolden and I are committed to using our military expertise and love for our country to break through political dysfunction in Congress. https://t.co/GFeB9Aes7H","date":"Fri May 13 17:01:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HuskerPolitics It was caused by the bill… that was passed by party line vote.","date":"Fri May 13 16:08:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Even left-leaning VOX admits Biden &amp; Pelosi's $1.9T COVID bill triggered the worst inflation in 40 YEARS, saying US has higher inflation vs most countries because this hyper-partisan bill passed by a party-line vote. American families are paying the cost. \nhttps://t.co/ASZWozjV3E","date":"Fri May 13 15:01:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to our DC intern and Nebraska native, Elise Roselius. She is currently studying political science &amp; religion and philosophy with a minor in business administration at Nebraska Wesleyan University. I admire her strong work ethic, cooperation, and determination to learn. https://t.co/iSY7eSPa4z","date":"Fri May 13 14:03:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a foster to adopt parent, and as co-chair of the Foster Youth Caucus, I thank @GovRicketts for bringing attention to the need for foster parents in Nebraska and declaring May as “Foster Care Month” in the state.\nhttps://t.co/0xYfuzvajP","date":"Thu May 12 23:16:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"May is Mental Health Awareness Month. We need to raise awareness of those living with mental and behavioral health issues, and continue the fight in ending the stigma associated with both.\n\nIf you or someone you know needs help, visit: https://t.co/MkR4YkIDk0 https://t.co/yZB86UU3xx","date":"Thu May 12 21:15:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to DHHS and the HRSA for their diligent work to educate the American people about the importance of organ, eye, and tissue donation. Currently 100,000+ people are on the national transplant waiting list. To learn more about organ donation, visit https://t.co/7tlnFVglcu. https://t.co/T0gQ4QaNOz","date":"Thu May 12 18:00:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to our Omaha intern, Hunter Haese! He is a junior double majoring in Economics &amp; Political Science at UNO. During his internship, he enjoyed helping our team provide resources to constituents and reuniting them with family overseas, including those left in Afghanistan. https://t.co/aSrjaMjJyR","date":"Thu May 12 15:01:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@kcleighroy I support the Senate bill that passed unanimously. If House had passed it, it would be law today and in action. Instead, nothing has passed and veterans are waiting. Pelosi hurt veterans by not passing the Senate bill.","date":"Thu May 12 11:18:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In honor of #NationalPoliceWeek, I would like to recognize and thank all of our #NE02 law enforcement officers and the Nebraska State Patrol who protect and serve our communities. Thank you for being on the frontlines every day. You are our heroes. https://t.co/zQdFWlIlQh","date":"Wed May 11 23:00:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Cardinal Joseph Zen is arrested by Hong Kong Police. This is a reminder that China’s government does not respect human rights and freedom of speech. Hong Kong’s freedom have been taken. This is why we must stand close with Taiwan. ⁦@MOFA_Taiwan⁩  https://t.co/FngmAsTLDw","date":"Wed May 11 22:02:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today I joined my good friend and colleague @RepCarbajal in passing HR 2499, a bipartisan bill that guarantees eligibility for federal firefighters who have been exposed to toxic fumes and substances while on duty. This ensures they get the treatment they need. https://t.co/BEz0WgHyxS","date":"Wed May 11 21:56:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BalticFreedom @IowaHawkeye68 We stand by our friends. Isolationism fails in long run.","date":"Wed May 11 21:43:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@__kadan__ @owlpresidentoma @Union_Omaha Don’t get ‘‘em confused.","date":"Wed May 11 20:52:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@owlpresidentoma @Union_Omaha I made it a thing.","date":"Wed May 11 20:51:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb @Union_Omaha Actually, stopping the inflationary spending is the solution. I voted against $9T in inflationary spending. Also, your energy policies that Biden embraced exacerbated inflation. I’ll win on this!","date":"Wed May 11 20:50:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HumphreyPT I encourage you to get involved in school board, city council and state elections where these decisions were made. I did request Supreme Court to overturn mandates and they ruled in our favor.","date":"Wed May 11 20:43:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@apenner @Union_Omaha You’ve been megged before evidently.","date":"Wed May 11 17:58:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@NateDawson1 @IowaHawkeye68 Europe will be paying 70% of economic aid. It’s in the bill.","date":"Wed May 11 17:57:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This Soccer Caucus co-chair is rooting for @Union_Omaha to beat Northern Colorado Hailstorm tonight. Viva Buhos! https://t.co/rEnN4ev9X6","date":"Wed May 11 16:45:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Started my day at the Nebraska Breakfast. This tradition started 79 years ago when Howard Buffett, father of Warren Buffett, represented #NE02. Thanks to all who attended! https://t.co/EWjBUzawhU","date":"Wed May 11 15:01:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HumphreyPT I’ve voted against $9T in new spending in last 15 months. But I do say we help stand up to a bully committing war crimes. We know that appeasement does not work… it emboldens the bully and makes it worse.","date":"Wed May 11 14:31:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a co-chair of the Foster Youth Caucus, I believe our nation needs a strong foster care system. I will continue to work across the aisle to ensure that no child in foster care is forgotten and to help those aging out of the system get the assistance they need to succeed. https://t.co/qbveNhMXWU","date":"Wed May 11 14:03:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@NateDawson1 @IowaHawkeye68 When you don’t stand up to a bully, the bully come back for you later &amp; stronger. There is 0 moral ambiguity what Putin is doing in Ukraine. Much of the $$ went to our military in this bill.\n\nInflation was triggered by $1.9T COVID Bill &amp; the Administration’s failed energy policy.","date":"Wed May 11 13:48:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ThomSeaton Taller than me!","date":"Wed May 11 10:49:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@IowaHawkeye68 Real conservatives stand up to bullies and defend freedom.","date":"Wed May 11 10:48:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ChapmanCNSNews @HumphreyPT @chiproytx I agree the genocide against the Uyghurs should earn world’s condemnation.","date":"Tue May 10 23:46:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HumphreyPT @ChapmanCNSNews @chiproytx I oppose rolling over and surrendering to the bully Russia. Appeasement does not work.","date":"Tue May 10 23:45:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@MelissaPanko @HumphreyPT We provided much of the weapons out of our inventory… we need to replenish our inventory. Further, NATO has to cover 70% of costs in aid in order to our aid kicking in. It is 30 page read… not that long.","date":"Tue May 10 23:44:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ChapmanCNSNews @HumphreyPT @chiproytx Russia is waging an unprovoked war and over a hundred thousand innocent civilians killed. War crimes. If you don’t stand up to a bully, the bully will keep coming back at you.","date":"Tue May 10 22:10:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HumphreyPT @MelissaPanko It’s 30 pages… not that long.","date":"Tue May 10 22:08:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@MelissaPanko @HumphreyPT We just spent hour with armed forces committee leadership going through this… it’s 30 pages, so not long… will be debate on it later. We’ll weigh it. But majority of $$ goes to US military to replenish weapons sent to Ukraine, and NATO picks up 70% of costs.","date":"Tue May 10 22:07:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I introduced legislation to improve transparency in the DoD’s budget. 17% of the Air Force budget, or $40B, never goes to the Air Force but rather to other agencies in OSD. The public should know what each device gets and what they’re buying. https://t.co/fA7us0Na3a","date":"Tue May 10 16:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to our DC intern and New Jersey native, Keval! He is currently studying political science and will graduate in December. This summer, he will intern for a House Committee. I appreciate his work ethic and dedication to our team. https://t.co/H2hOXEOC1C","date":"Tue May 10 15:01:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JJones6512 Some schools reopened earlier than others… those kids are doing better.","date":"Tue May 10 01:00:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"When COVID hit, schools closed their doors &amp; virtual learning became the new normal. This became a big debate &amp; many disagreed on when to open. A new Harvard study shows that in-classroom learning proved to be much better than remote learning for students. https://t.co/RD0yibR7dU","date":"Mon May 09 22:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I was just rated #12 out of 435 members for bipartisanship in the House. My @ProbSolveCaucus colleagues and I (28 Republicans &amp; 28 Democrats) are committed to breaking through political dysfunction and reaching across the aisle to get things done. That's how Congress should be. https://t.co/K5r7BfYSIy","date":"Mon May 09 20:01:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@IowaHawkeye68 A mean one at that!","date":"Mon May 09 19:52:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@IsaacBrittonSr @LausKati Jam on!","date":"Mon May 09 16:26:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to our Omaha intern, Meagan Compton! She is studying political science and minoring in Spanish &amp; journalism. After graduation, she plans to go to law school and eventually end up in DC.\n\nHer favorite memory: touring the SAC museum and going inside one of the aircrafts. https://t.co/NunWxttZaD","date":"Mon May 09 14:03:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb @kristajenn21 @IanAeillo I stand with great pro-life women leaders.","date":"Mon May 09 01:31:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@kristajenn21 @IanAeillo I’ll share your views too with my wife, sister, daughter-in-laws, and two aunts who are also pro-life.","date":"Mon May 09 00:17:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@attyjpiv @AIPAC Israel and its citizens are a number one target of terrorists. I’ll stand with Israel and it’s defense needs.","date":"Mon May 09 00:15:20 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@kristajenn21 I’m pro-life, and gladly stand with our great pro-life woman leaders like Senator Fischer and Mayor Stothert.","date":"Sun May 08 22:39:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@jimkourlas Enjoy! We look forward to sharing this many many times!","date":"Sun May 08 21:55:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@jimkourlas Currently rated #12 of 435 for bipartisanship by Georgetown University and Lugar, and #1 of 535 by Common Ground Committee. \n\nBeing bipartisan though doesn’t mean we avoid the truth nor does it mean we compromise our values or the promises we made to our constituents.","date":"Sun May 08 21:30:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I co-founded and currently serve as co-chair of the For Country Caucus, a bipartisan group of veteran and active-duty Members who pledged to serve with the core values of our respective services – integrity, civility, and the courage to break through political dysfunction. 🇺🇸 https://t.co/aTUkzp6v98","date":"Sun May 08 21:00:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@otisxii No… I stand by it. I sat in the HASC hearings and heard the evidence firsthand.","date":"Sun May 08 15:51:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha In 2016, military readiness was the worst since 1977. This was following years of budget cuts during Obama Admin and while fighting wars in two locations. It is one of the main reasons I won election in 2016.","date":"Sun May 08 15:36:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Happy #MothersDay to all the amazing and hardworking mothers out there! https://t.co/IHIWYQdyTS","date":"Sun May 08 15:01:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@attyjpiv I like @AIPAC… Israel is our friend.","date":"Sun May 08 05:20:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@da_gardner We don’t want to go backwards.","date":"Sun May 08 00:38:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great night at UNMC recognizing Dr. Robert Kadlec, assistant secretary for preparedness and response (ASPR) at the U.S. Department of Health and Human Services (HHS) https://t.co/I1s5xVmf0u","date":"Sat May 07 23:55:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"District Director James Wright joined the Combat Antisemitism  Movement in Lincoln as the State and Nation recognize Jewish Heritage Month. https://t.co/pRIoCoKHPe","date":"Sat May 07 23:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Obama Admin devastated our military readiness. By 2017 more troops were dying in accidents than combat: training hours down, aircraft unflyable, warships colliding, munitions critically low. As a #HASC leader I worked to pass 5 years of defense legislation to fix this crisis. https://t.co/BEn9ewax3x","date":"Sat May 07 20:00:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#NationalBeefMonth https://t.co/C0OYjqyy2J","date":"Sat May 07 14:01:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to the South Omaha Community Care Council for having me on to share my life story and how it made it to Congress. We also talked about my work on HASC, the Ag Committee, Foster Care Caucus, and the House Baltic Caucus.\n\nListen to the interview ⬇️\nhttps://t.co/RI2iZi513M","date":"Fri May 06 23:00:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@senatorgilbert @janekleeb @GLOEstick @MikeFloodNE @votelindstrom @jim_pillen @CWHerbster Especially my wife, my daughter, my two aunts, and six sister-in-laws who are all prolife!","date":"Fri May 06 22:46:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to our DC intern and Indiana native, Rachel Hause! She is currently studying international relations: politics and policy at Liberty and will graduate in December. I appreciate her passion for government and wish her the best as she interns at UNO NCITE this summer. https://t.co/qHvlWetpKj","date":"Fri May 06 21:00:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"After moving 16 times, 4 deployments to the Middle East, and having 5 different assignments as a commander, I know firsthand the toll it takes on military spouses. Let's honor them today, and everyday, for the sacrifices they make so their loved ones can serve and protect. 🇺🇸 https://t.co/2a1cRA9gDJ","date":"Fri May 06 18:15:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to all our nurses in #NE02 and across the US who are on the frontlines every day keeping us safe and healthy. You are America's heroes. #NationalNursesWeek https://t.co/eaIIMfLWWE","date":"Fri May 06 15:02:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@KatieGompert @Tomaandp @janekleeb @janetherevelatr I’m the junior member of the entire delegation.","date":"Fri May 06 04:22:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@frenchat We got a lot of wins in hard infrastructure bill… and defense bill.","date":"Thu May 05 22:48:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Ag teachers are working hard to educate the next generation of America’s agricultural workforce. As a member of the FFA Caucus, I encourage those who believe in the future of #Ag to keep this industry alive. Nebraska needs to remain a leading Ag state. https://t.co/4jr1cnCkhl","date":"Thu May 05 21:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Chalice_Alpha No thanks.","date":"Thu May 05 21:12:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Lugar Center is the best-known index on rating bipartisanship in Congress and rates me #12 out of 435 members! Since elected, I have worked across the aisle without compromising my principles or breaking promises I have made to the citizens of #NE02. https://t.co/T9l6VLi49N","date":"Thu May 05 19:05:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@KatieGompert I trust the voters who selected me in blue wave years.","date":"Thu May 05 18:46:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@KatieGompert @janekleeb @janetherevelatr You obviously did not read my statement… if you did, you wouldn’t have asked this question.","date":"Thu May 05 18:43:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Rebecca28049528 Multiple businesses are opening there.","date":"Thu May 05 17:46:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@RNCaptain Omaha and NE are ranked one of the best places to live and do business.","date":"Thu May 05 17:45:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@marthaevapearl Most taxpayers don’t want to pay for abortions.","date":"Thu May 05 16:13:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Mad_Petty_Vet @GinBurger @carphalen5150 @kohenari I agree with Biden on this one… heard Medicare for All would bankrupt America… he’s right.","date":"Thu May 05 16:12:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"These opportunity zones that I advocated and fought for are stimulating investment in new and local businesses within our #NE02 community. \nhttps://t.co/XDsUZdcT7r","date":"Thu May 05 16:02:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As the sponsor of the Casualty Assistance Reform Act, I felt it was important for our Armed Forces casualty assistance officers to have standards and training to help them when notifying next of kin of a casualty. It was included in the FY22 #NDAA and is now law. #GoldStarFamily https://t.co/ImQyMzFjbw","date":"Thu May 05 14:00:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BobSmit12043512 @Rebecca28049528 @DonJBacon @GOPLeader The majority disagree. Respect elections!","date":"Thu May 05 12:47:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@caldarell1 @GinBurger There’s two beating hearts in this discussion… and two separate DNAs. Study the science.","date":"Thu May 05 03:34:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Rebecca28049528 @BobSmit12043512 @DonJBacon @GOPLeader Hyperventilating isn’t good either. Breathe deep…","date":"Thu May 05 03:33:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Mad_Petty_Vet @GinBurger @carphalen5150 @kohenari Get some first aid.","date":"Thu May 05 03:32:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@fridder1 You’re in a little bubble.","date":"Thu May 05 03:30:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Attended the ribbon cutting ceremony for Ralston's $30 million Granary District Project. Thanks to the City of Ralston and I See It Venture’s public/private partnership &amp; the economic opportunity zones put in place by the Tax Cuts &amp; Jobs Act of 2017, this project is possible. https://t.co/cdadPvURx9","date":"Wed May 04 21:20:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb @janetherevelatr See a doctor.","date":"Wed May 04 21:06:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"It was great to meet with members of the US Chamber of Commerce, as well as the various municipal chambers in #NE02. We discussed bipartisan infrastructure funding, immigration, workforce shortages, inflation, and workforce development. https://t.co/1Wqt4Pd6Gu","date":"Wed May 04 19:01:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This May, we come together to raise awareness about the 400,000+ foster youth living in the U.S and thank the many foster parents, kinship caregivers, and childcare professionals who help children and youth find permanent homes and connections. #NationalFosterCareMonth https://t.co/2vl0tJnk6R","date":"Wed May 04 18:02:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We have to standup to Putin now or we’ll have to later in the Baltics or Poland. Bullies only respect strength and those with backbones. Giving Ukraine the weapons it needs to repulse Russia’s unjust aggressions and war crimes is in our national interest. https://t.co/hjVz1u5NaK","date":"Wed May 04 15:01:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@kohenari I hope you’re not teaching political science… polls overwhelmingly show inflation is #1 issue.","date":"Wed May 04 14:44:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@kohenari I talk to real people everyday Ari who cannot afford the extra $400 a month due to inflation.","date":"Wed May 04 12:01:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I’ve voted against $9T in new spending bills the last 15 months. This Administration and Speaker Pelosi have proposed huge tax and spend policies with indefinite trillion dollar plus deficits on the horizon, and inflation now at a 41-year high.","date":"Wed May 04 11:54:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@owlpresidentoma Or, enjoy the many that have passed.","date":"Wed May 04 02:00:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@oliveannbrown I ran on it all three elections and I’m grateful for the voters’ choice. My last opponent supported abortion through full term and taxpayer funded. Most faith based and science oriented constituents know the unborn have their own heartbeat and unique DNA.","date":"Wed May 04 01:59:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@owlpresidentoma I moved up in the Georgetown-Lugar rankings today.","date":"Wed May 04 01:50:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@curlsNE It’s now the worst in 20 years.","date":"Wed May 04 01:36:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@oliveannbrown All state-wide leaders in Ne, the entire Federal delegation and roughly two-thirds in unicameral are prolife.","date":"Wed May 04 01:35:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@curlsNE It’s a sign of much more making it through.","date":"Wed May 04 01:31:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"ICYMI: I participated in @USGLC’s virtual town hall to discuss the on-going situation in Ukraine, strengthening diplomacy, addressing food insecurity, and advancing Nebraska’s economy. \n\nWatch it here ⬇️\nhttps://t.co/61aRA5U8xH","date":"Wed May 04 00:01:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In FY21, 11,201 POUNDS of illicit fentanyl were seized by CBP. This is enough to kill every American nearly SEVEN times over. Fentanyl border seizures also INCREASED 134% in FY21. This is a humanitarian crisis &amp; POTUS is not taking this threat seriously. https://t.co/r0IgXkuY2d","date":"Tue May 03 22:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HRMissT Most everyone believes in protecting the life of mother.","date":"Tue May 03 19:19:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In honor of #SmallBusinessWeek, we stopped by Appsky in Omaha to congratulate Taylor, Jade, and Spencer on being named the Small Business Persons of the Year in the state of Nebraska! It was great to hear more about their company and the need for more STEM education. https://t.co/9vtsD0zDXD","date":"Tue May 03 19:15:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Second Chance Month is a representation to all of us about the power of forgiveness, and the Second Chance programs are key in that. They have helped reintegrate people back into society, heal families, and give much-needed mental health services.\nhttps://t.co/ILnrgaLzRK","date":"Tue May 03 17:01:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@senatorgilbert @janekleeb @GLOEstick @MikeFloodNE @votelindstrom @jim_pillen @CWHerbster I’m proud of our state’s pro-life women leaders. I stand with them.","date":"Tue May 03 16:20:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HuskerPolitics No thanks, I do like beef, bacon and curry!","date":"Tue May 03 15:33:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Whoever leaked this draft must be held accountable. However, if Roe V. Wade is overturned these decisions will be left with the people at the state level, where it belongs. (1/2)","date":"Tue May 03 14:05:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I am proud to be in a state that has strong pro-life support. We defend innocent human life that has its own beating heart and unique DNA. The right to life is our most precious liberty. (2/2)","date":"Tue May 03 14:05:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"May is #MilitaryAppreciationMonth. Let us take time to remember, honor, and thank our service members and their families for the many sacrifices they have made for our nation. God bless our military! 🇺🇸 https://t.co/sVWmGs6Q6s","date":"Tue May 03 14:03:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@a2e_project Because we are the leading beef producing state. Loud and proud… about NE beef.","date":"Tue May 03 13:36:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Enjoyed meeting with Canadian Consul General Delouya to talk about USMCA's benefits and improvements, the Russia-Ukraine conflict, and agriculture interests. It's important that we have a strong partnership with Canada and work together to address global challenges we may face. https://t.co/8Am5fdeFuN","date":"Tue May 03 12:55:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Met with Lauren Cencic, CEO of Omaha METRO to congratulate her on receiving a federal grant to conduct planning for modernization of public transportation in our north and south Omaha corridors. Thanks to the infrastructure bill they will also receive a 30% increase in funding. https://t.co/Fc4oKe4F0v","date":"Mon May 02 23:00:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Had a great meeting today with Conagra’s Veterans Employee Resource Group. We discussed my aspirations to serve my country through the Air Force and how life after service lead me to Congress. I commend Conagra for supporting our nation’s veterans. Keep up the good work! https://t.co/SAAo7tLgGG","date":"Mon May 02 21:35:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Omaha's very own Noble Rasmussen was accepted to all five military academies! We wish him the best as he sets out for the @AF_Academy. He makes us Nebraska proud!\nhttps://t.co/TUmzI4y2CX","date":"Mon May 02 20:01:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Had an amazing evening last night with the Omaha Sister Cities Association to support Ukraine and the partnerships we have with so many amazing cities and people in Omaha and around the world. https://t.co/vI6SgudUux","date":"Mon May 02 18:01:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This week is #TeacherAppreciationWeek! Thank you to all of our hardworking and amazing teachers in #NE02 and throughout #Nebraska! Your dedication to your students does not go unnoticed. https://t.co/P8h4XxMhBk","date":"Mon May 02 15:30:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"It's officially #NationalBeefMonth! Nebraska is the #1 leader in all aspects of the beef industry including production, exports, and cattle on feed.\n\nA big thank you to all the cattle producers helping to put a healthy, wholesome protein on our dinner plates! https://t.co/l4rizlg4z9","date":"Mon May 02 13:30:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@UnsavoryTees It is right out of 1984 book.","date":"Mon May 02 12:51:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I’ll be joining @MorningsMaria today 730am ET to talk Ukraine/Russia and other topics. Grab your coffee (and bacon) and join me!","date":"Mon May 02 11:10:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@meaganthatsall I’m not… his failed policies created the worst border crisis in 20 years.","date":"Mon May 02 01:22:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@lamemusic Commanded five great units!","date":"Mon May 02 01:16:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"May is #MentalHealthAwarenessMonth! We need to work together to provide support, educate the public, and advocate for policies that support people with mental illness and their families.\n\nIf you or someone you know needs help, visit: https://t.co/lUJ0Dyt4Hi https://t.co/thMqpp9YYq","date":"Sun May 01 20:30:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Congratulations to the Benson VFW Post 2503 on their 90th birthday celebration. You keep our flame of patriotism burning bright. Thanks to you, we will never forget those who were willing to sacrifice everything for our nation and freedom. https://t.co/EbofiTw69u","date":"Sun May 01 15:30:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"REMINDER: Last day to apply for the Congressional Youth Advisory Academy is TOMORROW!\n\nThis gives high school students in #NE02 the opportunity to learn about Congress and how it operates through a series of educational activities and guest speakers. https://t.co/cODh7gp9sU","date":"Sun May 01 13:10:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@da_gardner @JimHarroldOmaha I agree. The situation at the border is terrible.","date":"Sun May 01 11:42:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our staff was able to attend and speak at the Airborne Memorial dedication this past week, which added 51 more names of fallen heroes from the wars in Iraq, Afghanistan, and Syria. We will never forget their service and sacrifice. https://t.co/WEeAfsp5kR","date":"Sat Apr 30 21:30:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great turn out today for our Military Academy event—one of the largest turnouts we have had! Our nation’s future is bright. Thank you to all who attended. 🇺🇸 https://t.co/thtLHBtuxN","date":"Sat Apr 30 19:30:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great to have our staff attend the alumni reunion of the 1st Air Cav/16th Med Battalion in Omaha this past week. These heroes flew U-H1 helicopters in Vietnam evacuating those injured in battle. https://t.co/9eRH1popkb","date":"Sat Apr 30 16:15:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"ICYMI: Millard North High School senior Noble Rasmussen was accepted to all five military academies, but chose to attend the @AF_Academy. We congratulate him and wish him the best!\nhttps://t.co/5PQX7Ink6X","date":"Sat Apr 30 15:01:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha You seem to knowingly want to ignore the obvious… there are many who are not apprehended and getting through.","date":"Sat Apr 30 14:30:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@logical_one57 This is the worst at the border in 20 years.","date":"Sat Apr 30 13:16:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Since Biden took office, 42 people on the terrorist watchlist have been apprehended trying to enter the US illegally. We don’t know how many actually made it through. I commend CBP's efforts to protect our borders, but we need to keep enhancing security. https://t.co/sQmI3go91K","date":"Sat Apr 30 00:05:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Federal Employee Paid Leave Act was included as Section 7602 of the FY20 #NDAA and is now law. It provides 12 weeks of paid parental leave to all federal employees, a major win for working families &amp; one of my top priorities on #HASC &amp; as a co-lead of the #ForCountryCaucus. https://t.co/ypG1pfXNYm","date":"Fri Apr 29 22:05:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@husk3rnat10n @UrBroYo @ChrisDunkerLJS Does that explain why so few people show for the “blue” candidates?","date":"Fri Apr 29 21:30:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This is 100% why I cosponsored the CROWN Act. It prohibits discrimination based on a person's hair texture or style if it is commonly associated with a particular race or national origin. Nebr. passed similar legislation &amp; @GovRicketts signed it into law. https://t.co/yx9xsxkPiQ","date":"Fri Apr 29 19:15:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@techiela_shots @HouseGOP Moral equivalence… no thanks.","date":"Fri Apr 29 17:06:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We should NOT empower terrorists for the sake of a weak Iran nuclear deal. Removing IRGC from the FTO list does just that AND dishonors the 600+ US troops killed by IRGC in Iraq, Gold Star families, &amp; Americans being targeted today by IRGC-trained proxies. https://t.co/oy42nVvv6k","date":"Fri Apr 29 17:01:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"“Other holidays repose upon the past; Arbor Day proposes for the future.” -J. Sterling Morton.\n\nHappy Arbor Day, Nebraska! https://t.co/6GIRVFVx5u","date":"Fri Apr 29 14:03:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Congressional Youth Advisory Academy gives high school students in #NE02 the opportunity to learn about Congress and how it operates through a series of educational activities and guest speakers.\n\nTo apply or learn more, call our office at (402) 938-0300. https://t.co/qu2TgHFLcY","date":"Fri Apr 29 12:02:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"DEA's #TakeBackDay is this Saturday, April 30th. This gives Americans the opportunity to dispose any unwanted, unused prescription drugs.\n\nTo locate a drop off site near you, use the website's location search feature: https://t.co/ein2W3LW1A","date":"Fri Apr 29 01:00:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Glad to hear the work @usairforce is doing to ensure our nation is prepared to win in the #electromagnetic spectrum. This domain effects all others, and is critical to the success of our service members in future conflicts. We cannot afford to neglect this mission. #JEMSO https://t.co/EWlPbBWOJI","date":"Thu Apr 28 23:25:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In the POTUS Budget, @USSOCOM has the same funding as last year despite 8.5% inflation. This is a massive cut despite higher operations tempo and growing threats. We must fund the modernization training our troops need to be #Agile, #Lethal, &amp; #CombatReady on the front lines. https://t.co/w08fj0on5f","date":"Thu Apr 28 22:45:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#GoldStarFamilies deserve our honor and commitment. These families of the fallen are calling on POTUS to not remove the IRGC's FTO designation as a bargaining chip for an Iran nuclear deal. This dishonors the 603 Americans murdered by the IRGC in Iraq and their families. https://t.co/InRnwctmyZ","date":"Thu Apr 28 21:00:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The President’s budget deals a 4.5% cut to the military when accounting for inflation. With rising threats posed by Beijing and Moscow, our defense spending should match if not exceed inflation. #PeaceThroughStrength https://t.co/MKUVk289N2","date":"Thu Apr 28 19:20:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Unchecked weapons in the hands of the Iranian Government can only lead to one thing—aggression. Yesterday we passed H.R. 6089 which adds drones to existing provisions that place sanctions on those who provide weapons to Iran.","date":"Thu Apr 28 19:01:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today we honor the 6 million innocent lives taken during the Holocaust, along with everyone affected by the evil &amp; hatred of anti-Semitism.\n\nWe must #NeverForget the tragic events of the Holocaust &amp; strive toward greater protection of human rights &amp; religious freedom. #YomHashoah https://t.co/ssnvNO2Tfr","date":"Thu Apr 28 18:30:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The People’s Republic of China opposes Taiwan’s participation in the World Health Assembly. Yesterday we passed S.812. It directs the State Dept. to provide a report describing changes &amp; improvements to the Dept’s plan supporting #Taiwan’s observer status at the WHA. @MOFA_Taiwan","date":"Thu Apr 28 18:01:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@FCSRETIRED @SenatorFischer @SenSasse @jim_pillen @CWHerbster @RepAdrianSmith @POTUS The economy shrunk last month. Negative growth.","date":"Thu Apr 28 15:20:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Providing preventative services to families in need and children in crises is a priority of mine. I appreciate these amazing reps from Heartland Family Service, Boys Town, KVC and Child Savings Institute for their diligent work to help children and families in Nebraska. https://t.co/UnuEFtgu33","date":"Thu Apr 28 15:01:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"A total of 86% of small businesses increased prices to survive inflation, and 68% intend to raise prices even higher. Expenses are rising faster than wages. https://t.co/PDMTF0tlwA","date":"Thu Apr 28 13:05:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@btcoyle3 Yes. This was our annual Congressional Soccer Game.","date":"Thu Apr 28 02:33:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Bend it like Bacon! https://t.co/PjjAlgIfKQ","date":"Thu Apr 28 00:22:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"ICYMI: @RepSherrill and I wrote an op-ed on the need to modernize our GPS. GPS has become critical force in our economy and military. China now has capabilities that exceed that of GPS. We are falling behind here, and we need to accelerate modernization. https://t.co/RUPh6BEOXb","date":"Thu Apr 28 00:05:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Enjoyed talking with @InaStrazdina to discuss the ongoing situation in Ukraine and my continued support to the Baltic states. As co-chair of the Baltic Caucus, we need to increase security and economic relations between our countries and preserve freedom in the face of tyranny. https://t.co/oM4NwvGEB1","date":"Wed Apr 27 20:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Russia’s “escalate to deescalate” doctrine uses low yield nuclear weapons to compel the US to backdown. And the STRATCOM Commander says we need some low yield nuclear weapons to deter Russia from using theirs. https://t.co/XSa0VE0VGG","date":"Wed Apr 27 18:37:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"A true collaborator, Sen. Rich Pahls will be remembered for his dedication to the City of Omaha and especially the area of Millard. He had a passion for education &amp; fighting for survivors of child abuse. He was a good friend and will be missed. Prayers to his family &amp; friends.","date":"Wed Apr 27 18:09:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Once again, the Pentagon’s official budget request fails to reflect the true @usairforce budget. I’ve introduced the Defense Budget Transparency Act with @RepKahele to create more transparency and inform wise investment of American taxpayer dollars. https://t.co/GJueg9O643 https://t.co/Y2GhE25TSC","date":"Wed Apr 27 16:02:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Nebraska Breakfast is back! Always great to see Nebraskans here in DC. I gave a legislative update on the situation in Ukraine, enhancing cyber security, the Foster Care Caucus, and much more. https://t.co/aNjpJJkmmS","date":"Wed Apr 27 14:02:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Recognized Lou and Jaydn for their incredible work that contributed to our office being named the best Republican office in the House for constituent services. https://t.co/yrUk7VcyMd","date":"Tue Apr 26 23:00:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Congressional Youth Advisory Academy gives high school students in #NE02 the opportunity to learn about Congress and how it operates through a series of educational activities and guest speakers.\n\nTo apply or learn more, call our office at (402) 938-0300. https://t.co/tiCAnXJDll","date":"Tue Apr 26 21:01:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Enjoyed my tour and visit! I appreciate the work you all are doing.","date":"Tue Apr 26 20:36:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I am thrilled for Noble Rasmussen who was offered an appointment to EVERY Academy…something very rare! I’m even more thrilled he picked the Air force Academy. #AimHigh! https://t.co/uRbUxmZDM9","date":"Tue Apr 26 18:01:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to the @USGLC for a productive discussion on the ongoing crisis in Ukraine, increasing security in the Baltics, and advancing the security, economic interests, and values of Nebraskans and all Americans. https://t.co/JYvHaBMNBY","date":"Tue Apr 26 15:01:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The best way to deescalate is for the Russians to stop their unprovoked and unjust aggression and their war crimes, and withdraw from Ukraine’s sovereign territory.","date":"Tue Apr 26 04:31:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@FMarymee I can’t answer for others… but I believe in the Almighty and choose to worship. I’m told eternity is a long time.","date":"Tue Apr 26 04:23:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@cjmilstead I agree… that’s why today was a good thing. Less bias.","date":"Tue Apr 26 00:05:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Attended a Human Trafficking Awareness webinar with DHS Investigations to teach counselors, family advocates, and resource officers around #NE02 how to watch for and be aware of human trafficking signs in their students, and how to report it and provide resources to victims. https://t.co/SaNZ0K35Mx","date":"Mon Apr 25 22:05:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"It's a great Twitter day!","date":"Mon Apr 25 22:02:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@LeavenworthSt @UNOmaha @unocist It is getting scary…","date":"Mon Apr 25 21:20:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"At my recent visit to @UNOmaha, I was greeted by a robot that escorted us to the right office. The robot also studied facial reactions while listening. I’m proud that UNO is one of the best educational leaders for artificial intelligence and cyber security. \n\n📸: @unocist https://t.co/1anqlZJeZR","date":"Mon Apr 25 19:45:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As co-chairs of the GPS Caucus, @RepSherrill &amp; I urge the US to reinvest in GPS modernization as these satellites have become integrated into virtually every facet of our economy, including our agriculture, transportation &amp; national security.\n\nOur Op-Ed ⬇️\nhttps://t.co/nOwoUCt0FT","date":"Mon Apr 25 16:02:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@NebraskaNice83 @damnlib @ShaferSkoog I won’t hide my light and hope under a basket.","date":"Mon Apr 25 14:41:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":".@RepSpeier &amp; I worked hard to include our bipartisan bill H.R. 5738 in the FY21 #NDAA and it is now law. This provision empowers survivors of sexual assault to report these incidents and ensures they will not face punishment for minor included offenses. https://t.co/F3Oq57K0LF","date":"Mon Apr 25 14:00:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Life in a dictatorship, life without rule of law. Putin is guilty of war crimes. We won’t forget.","date":"Mon Apr 25 05:06:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@niceguym @rosen_alexandra @DonJBacon Z","date":"Mon Apr 25 02:16:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"DEA's #TakeBackDay is Saturday, April 30th. This gives Americans the opportunity to dispose any unwanted, unused prescription drugs.\n\nTo locate a drop off site near you, use the website's location search feature: https://t.co/ein2W3LW1A","date":"Mon Apr 25 00:00:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My office is hosting a \"Service Academy Day\" for students and parents interested in learning more about the five Military Service Academies and how to apply to them. Representatives from each academy will also be attending.\n\nRegister here: https://t.co/wHAnDI30lP https://t.co/QXs03sXxKI","date":"Sun Apr 24 21:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Visited UNO’s Information Science &amp; Technology college to learn more about their cutting edge programming for artificial intelligence &amp; cybersecurity initiatives—one of the best in the country. We also discussed how we can protect our power grid &amp; “big data” at a federal level. https://t.co/0M4cDc0RFD","date":"Sun Apr 24 18:20:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb @woodrgrant @CRagole @Google I guess that explains the generic polling that shows GOP up 5.","date":"Sun Apr 24 18:06:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@VPofObscureInfo @ad1220 It’s my hometown too. The real issue is we need more trades education in our schools.","date":"Sun Apr 24 18:05:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@yodaears2000 More to life than campaigning… your spiritual life is more important.","date":"Sun Apr 24 18:04:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On that note, I’m headed to church.","date":"Sun Apr 24 16:07:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Got to tour the new STEM wing at Papillion La Vista High School which teaches students about the trades and gives them an opportunity for a career path right outside of high school. This is one of the best STEM programs in #NE02 that benefit today's youth. https://t.co/pRwhgG6Hjp","date":"Sun Apr 24 15:00:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In August 2020, the new Ambulatory Care Center at Omaha’s VA Hospital was opened to the public and started serving area veterans. I worked with my friends and former Reps. Brad Ashford and Lee Terry on this project to invest more in our veterans. https://t.co/czgwKVkiNp","date":"Sat Apr 23 23:25:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Jerry Kalina, Papio Monarchs' head principal for the last 10 years, will be retiring in June. He has also been an assistant principal and a special needs teacher. I salute and thank Jerry for investing in our youth for the last two decades. I wish him the best in his retirement. https://t.co/RDjwpYEz6e","date":"Sat Apr 23 17:00:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Congressional Youth Advisory Academy gives high school students in #NE02 the opportunity to learn about Congress and how it operates through a series of educational activities and guest speakers.\n\nTo apply or learn more, call our office at (402) 938-0300. https://t.co/TgiMvjKY4T","date":"Sat Apr 23 14:01:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@redconmike @dramyhimes @janekleeb @Google Study Luddite philosophy and it will become clear.","date":"Sat Apr 23 05:00:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today I surprised Papio South's Madison Eisert to congratulate her for winning the #CongressionalAward silver medal. She worked incredibly hard for this award, and I know she will continue to make a difference in her community through public service and leadership. https://t.co/TN7WTCfFQ0","date":"Sat Apr 23 00:20:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"For #EarthDay, I met with reps from Ducks Unlimited, Pheasants Forever, Whitetails Unlimited, Nebraska Game &amp; Parks Commission &amp; the Papio-Missouri Natural Resources District to discuss protecting wildlife &amp; provisions in the next Farm Bill that strengthen conservation efforts. https://t.co/0guSrTXnBZ","date":"Fri Apr 22 23:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Nero_jb @janekleeb @woodrgrant @CRagole @Google And no other state-wide Dems are even a choice anyways…","date":"Fri Apr 22 22:56:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb @woodrgrant @CRagole @Google I guess that’s why several thousand Dems changed party registrations this month. They want their vote to count.","date":"Fri Apr 22 22:44:20 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Volunteered at the Nebraska Diaper Bank today! As co-chair of the Foster Youth Caucus, I supported FY22 appropriations that increased funding for social service agencies and non-profits to provide diapers to families most in need. Improving infant health should be a top priority. https://t.co/Xx6h7D6v2Q","date":"Fri Apr 22 22:05:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The @Google expansion in Sarpy County and the greater Omaha Metro area has brought in over 400 new jobs and is growing. In total, Google has invested $1.2B in #NE02 and we are glad that Google finds our economic and labor environment a great place for it to grow. https://t.co/dzVTC2NEkA","date":"Fri Apr 22 21:00:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@GiganticGrant Don’t be so tough on Jane.","date":"Fri Apr 22 19:46:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@curlsNE @Google The GOP states are leading the way.","date":"Fri Apr 22 19:45:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb @Google Maybe they know the NE Dem Chair couldn’t field candidates for almost all of the statewide offices.","date":"Fri Apr 22 17:45:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Jdangelo4404 @Google The escape from California!","date":"Fri Apr 22 17:40:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Nommedeplume1 @Google I’ll gladly quote some Onaha Dems if you’d like?","date":"Fri Apr 22 17:38:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Happy #EarthDay! As a member of the Climate Solutions Caucus, I believe Congress needs to work together to find bipartisan solutions that protect our environment such as carbon capture technologies, battery storage, and preserving natural resources. https://t.co/EryoX8UMAi","date":"Fri Apr 22 17:01:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Nommedeplume1 @Google They’re celebrating a big win for the community.","date":"Fri Apr 22 15:42:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ferenstein @googlepubpolicy @Google I like both.","date":"Fri Apr 22 15:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":".@Google announced they’re investing another $750M into the Omaha area, which helps us grow as the Silicon Prairie. Their leadership said our economic policies, environment, and workforce makes #NE02 an attractive place to invest in. https://t.co/RNpkctmvkN","date":"Fri Apr 22 15:02:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@KeithRoragen Who are they supporting? Our police know truth.","date":"Fri Apr 22 11:00:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This new wastewater sewer system in Sarpy County will greatly benefit our #NE02 community for the next several decades. We needed to rebuild and advance our infrastructure, which is why I fought hard to secure $3.5 million for the project. https://t.co/reN3ZlaNFb","date":"Thu Apr 21 22:25:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@garyalanhenson @TheDemocrats We have a state Senator right here in Omaha who said she wants police defunded. The Squad said it multiple times. Major city police departments’ had their funds cut, but are now realizing their mistakes.","date":"Thu Apr 21 22:05:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"After many Dems called to defund the police in 2021:\n❌ More than 12 US cities set homicide records\n❌ 346+ officers shot; 63 of them killed\n❌ 103 ambush style attacks on police\n\nYet some of the same members have their own private security! \nProtection for me &amp; not for thee.","date":"Thu Apr 21 20:15:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I helped secure $3.5 million for this much needed community project. This infrastructure takes us down a path where Sarpy County can continue to grow and really reach its potential. https://t.co/bk3XU2Emsu","date":"Thu Apr 21 17:01:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Increasingly more Democrats are awakening to the crisis at the border and speaking up. Removing Title 42 will likely double illegal border crossings. The border states and towns are begging for leadership from White House.  \nhttps://t.co/DjxbkpJEmB","date":"Thu Apr 21 14:15:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My office is hosting a \"Service Academy Day\" for students and parents interested in learning more about the five Military Service Academies and how to apply to them. Representatives from each academy will also be attending.\n\nRegister here: https://t.co/wHAnDI30lP https://t.co/TU9DTammfI","date":"Wed Apr 20 21:30:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Congressional Youth Advisory Academy gives high school students in #NE02 the opportunity to learn about Congress and how it operates through a series of educational activities and guest speakers.\n\nTo apply or learn more, call our office at (402) 938-0300. https://t.co/Z47MOfbVpI","date":"Wed Apr 20 18:01:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My first bill to pass the House, H.R. 3897, now law, was amended as Section 626 of the #FY19NDAA. It ensures families of service members killed on active duty can access military installations to use the services to which they are entitled. #GoldStarFamilies https://t.co/cuXDgxvUzz","date":"Wed Apr 20 15:00:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Spent the afternoon at NMC CAT touring their #NE02 facility and discussing legislation regarding infrastructure, supply chain issues, trades, agriculture, and taxes. https://t.co/YODOteGyuM","date":"Tue Apr 19 20:30:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@UnrigOurEconomy Goofy. We have best economy and employment of all 50 states.","date":"Tue Apr 19 20:29:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@TomBecka @KamalaHarris I’m not sure what Congressional GOP tax plan he’s referring to… sounds like it’s one individual’s proposal from FL. A red herring.","date":"Tue Apr 19 17:22:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@yologiantsfan We became close friends. I’ll miss him. He did a lot for the community over the decades.","date":"Tue Apr 19 17:19:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Started the morning off at the Golden K Kiwanis Club meeting in Omaha. Enjoyed giving a policy update and taking questions. I discussed the war in Ukraine, military modernization, agriculture, immigration, and much more. https://t.co/97mYluUgad","date":"Tue Apr 19 16:30:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Rebecca28049528 @CO_jan40 This is worst border crisis in 20 years. Thankfully, some moderate Dems are speaking up… you should too.","date":"Tue Apr 19 13:40:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I admired his decades of service and the wisdom that came with it. I am a better person and representative because of the influence of Brad. I’ll miss him tremendously, and I thank the Lord for giving me the opportunity for his friendship. (3/3) https://t.co/PAHiLmle1g","date":"Tue Apr 19 13:37:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I send my deepest condolences to Ann and the entire Ashford family. Omaha lost a giant, strong pillar today; a family man who had deep roots here and dearly loved this community. (1/3)","date":"Tue Apr 19 13:37:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Brad and I started out as political adversaries but became great friends. Even when we were rivals, I respected his decency and good heart. He was an idea man and a visionary who saw great potential everywhere he looked. (2/3)","date":"Tue Apr 19 13:37:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CO_jan40 I take it you assume a 100% of the terrorists were caught?","date":"Tue Apr 19 12:39:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Border Patrol stopped 23 people on terrorist database at southern border in 2021: CBP data | Fox News https://t.co/JSRPXWXTUB","date":"Tue Apr 19 03:29:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Jdangelo4404 @LenWitte @damnlib Dem economists warned us the $1.9T COVID bill would trigger inflation. It did.","date":"Tue Apr 19 02:18:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Admiral Richard spoke at the annual USSTRATCOM Update to stress that nuclear deterrence is the military's #1 job. We have postponed modernizing our nuclear force and we cannot delay any longer. This is a mission area we cannot afford risk. @US_Stratcom https://t.co/MfWHhJju9I","date":"Mon Apr 18 18:50:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@LenWitte @damnlib He is responsible for much of our inflation.","date":"Mon Apr 18 18:44:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"It is vital the AF Academy uphold the Honor Code, and it does. It was one of the many topics we discussed at last week’s Board meetings. We have the world’s best Air and Space Forces, but they need the strong character of our airmen and space guardians. https://t.co/e54ucOdvvI","date":"Mon Apr 18 18:01:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The 2018 Farm Bill provides NE's Ag community with the resources they need to succeed. As a member of the House Ag Committee, I pushed for establishment of a FMD Vaccine Bank, affordable crop insurance, and enhancements to trade initiatives designed to promote U.S. #Ag exports. https://t.co/k1iY3W4OUw","date":"Mon Apr 18 15:01:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Eight events over 13 hours on the schedule tomorrow in the local area. Bring it on!","date":"Mon Apr 18 02:55:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My office is hosting a “Service Academy Day” for students and parents interested in learning more about the five Military Service Academies and how to apply to them. Representatives from each academy will also be attending.\n\nRegister here: https://t.co/wHAnDI30lP https://t.co/FrxJKwBjDi","date":"Sun Apr 17 20:00:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Happy Easter to you and your family as we celebrate the Almighty’s greatest sacrifice through His son, Jesus Christ. https://t.co/7PtqdemS1h","date":"Sun Apr 17 14:02:20 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CarlSBaum @NebraskaYR Thank you.","date":"Sun Apr 17 13:29:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The President needs to nominate Agricultural trade representatives so we can start expanding our exports. Nebraska is an export state and the lack of emphasis from the White House sets us back. https://t.co/EXWru3kM05","date":"Sat Apr 16 23:15:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On this day in 1862, my favorite President abolished slavery in the District of Columbia. https://t.co/VObFLW3VT3","date":"Sat Apr 16 21:05:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I’ve been sanctioned by Putin, saying I’m no longer welcomed in Russia. There was no chance I was going to visit anyway since Russia is a pariah state run by a thug who does not believe in the rule of law and invaded its neighbors unjustly. https://t.co/JaXdJUAvJM https://t.co/3T2JBGj1yO","date":"Sat Apr 16 18:30:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Stay updated with our office by following us on social media! You can also visit my Congressional website at https://t.co/jn1BCHiklP. https://t.co/WsYplFS2Gh","date":"Sat Apr 16 15:01:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@RepRiggleman Looking for Bigfoot?","date":"Sat Apr 16 12:54:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@vince_powers Where is your statement on Tara Reade? You are the hypocrite.","date":"Sat Apr 16 03:54:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I worked hard to include my bill, H.R. 4982, in the #CARESAct. This provision expedites mask production during a global pandemic, such as #COVID, and ensures essential personal protective gear is available for our medical professionals, first responders, and workforce. https://t.co/yq4fTNQ4Yc","date":"Fri Apr 15 20:00:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to the Agribusiness community! AG is the dominant industry in NE, and Agribusiness is huge factor in Omaha’s economy. https://t.co/Nu5c7OSSsD","date":"Fri Apr 15 19:28:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"No better way to celebrate Good Friday than to join with hundreds of constituents in prayer this morning at the CBMC Prayer Breakfast and hear the wisdom of Frank Harrison, Owner/CEO of the largest CocaCola bottler in America, who makes Christ the priority in all he does. https://t.co/tcxAmJd6BO","date":"Fri Apr 15 15:21:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Wishing everyone a blessed #GoodFriday. https://t.co/5zBzhrebQP","date":"Fri Apr 15 14:03:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today, we extend warm #Vaisakhi greetings to all our Sikh friends and neighbors in #NE02 &amp; across the US who are celebrating. We also pause to remember the eight individuals--four of whom were Sikh--killed one year ago in the mass shooting at an Indianapolis FedEx facility.","date":"Thu Apr 14 21:00:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@MNelson17943935 @vince_powers I voted against nearly $9T in new spending in the last 14 months alone.","date":"Thu Apr 14 18:59:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"There is a serious humanitarian crisis occurring at our border. Thousands of unaccompanied minors are being abused by dangerous human traffickers, and fentanyl is flowing into our communities. We need to enforce the rule of law and strengthen security at the border. #BorderCrisis https://t.co/Q9vQMBzB1n","date":"Thu Apr 14 18:01:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Energy independence strengthens our national security and increases prosperity. This is a good step in the right direction, but it needs to be permanent. https://t.co/awS3vUYzyp","date":"Thu Apr 14 15:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Putin’s unjust invasion and war crimes have unified NATO. The EU is now inclined to invite Ukraine, and now Finland and Sweden are considering joining NATO. https://t.co/nW3wndXg68","date":"Thu Apr 14 13:45:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My office is hosting a “Service Academy Day” for students and parents interested in learning more about the five Military Service Academies and how to apply to them. Representatives from each academy will also be attending.\n\nRegister here: https://t.co/wHAnDI30lP https://t.co/W7RgWmrHFw","date":"Wed Apr 13 23:00:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@NE_Farmgirl It is a terrible problem… most fentanyl originated from China is right.","date":"Wed Apr 13 20:41:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a member of the Air Force Academy Board, I spent the last two days meeting with the leadership and cadets to ensure the Academy is meeting its responsibilities of preparing future leaders and warriors for the Air Force and Space Force. https://t.co/3V0Ejro7qM","date":"Wed Apr 13 20:01:20 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"After the 2019 spring foods, I was able to work with my colleagues to secure $19.1 billion of flood and disaster relief from the FY19 supplemental, including $3B for crop and livestock losses &amp; $150M for health care, education, and essential services in #NE02’s rural areas. https://t.co/py7JF4FxPM","date":"Wed Apr 13 17:45:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"President Biden’s announcement on the sale of E15 this summer is a step in the right direction for energy independence. Now he must go one step further and make this permanent. Americans want energy independence.\nhttps://t.co/DlM7fB1oMd","date":"Wed Apr 13 16:20:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Got to meet with Jacob from Kansas, a Second Class Cadet at the @AF_Academy. He’s a member of the USAFA Flying Team and already has more than 250 flight hours! https://t.co/rVipMruzOz","date":"Wed Apr 13 14:02:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"With Cadet Burba from Michigan. She will graduate in six weeks and is ranked #1 in the 2022 class! Second Lieutenant Burba will make an outstanding addition to the @usairforce. #AimHigh https://t.co/UKBmcl3BuZ","date":"Tue Apr 12 23:00:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Maj Gen (Ret) and I met with four outstanding cadets from #NE02. All four were poised, optimistic, and extraordinarily sharp, and represent Nebraska superbly well. #AimHigh https://t.co/6RPa7gjq7K","date":"Tue Apr 12 21:00:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I’m at the US @AF_Academy today! Meet Hannah from Chicago, IL. She is a Second Class Cadet (junior) and a parachute training instructor with over 350 free-fall jumps! https://t.co/N11EVMQofX","date":"Tue Apr 12 19:35:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"With 4,300 @AF_Academy cadets for lunch! The future of our AF is bright with these exceptional cadets. https://t.co/UbewlaeZSl","date":"Tue Apr 12 19:06:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Drug overdose deaths in the U.S. surpassed 100,000 in 2021, more than any previous year. Fentanyl overdoses has now been attributed to being the leading cause of death for Americans ages 18-45. To combat this we need to go after drug cartels and secure our borders. https://t.co/IShmTT9qaW","date":"Tue Apr 12 18:01:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ArmyGrunt05 Inflation was around 2% during previous Admin. Economists warned the $1.9T COVID bill passed in March 2021 would trigger inflation and the Admin, Pelosi and Schumer ignored. The citizens know who is responsible.","date":"Tue Apr 12 16:56:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"With the highest inflation in over 40 years, the average family has lost about $400 in monthly purchasing power. According to a CBS poll, this is having a real impact on quality of life. Americans want better. We can’t afford the Biden-Pelosi policies. https://t.co/N6VAyTTPRG","date":"Tue Apr 12 15:02:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I called for this last Dec from our own Admin and they refused. I applaud the UK and @BorisJohnson for stepping up and sending anti-shipping weapons to Ukraine to repulse Russian Navy and amphibious attacks from the Black Sea. Overdue but still needed. \nhttps://t.co/d0etutKhxj","date":"Mon Apr 11 22:15:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The 55th Wing's Hall of Fame has inducted 76 heroic leaders and aviators for their significant contributions to our nation in defense of its security &amp; freedom. It is an honor to be recognized. I thank those who have and currently serve our nation from the \"Fightin' Fifty-Fifth!\" https://t.co/vLDg1LMPbO","date":"Mon Apr 11 20:15:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@RandyResist @VABVOX We want the truth… and most media failed us in 2020 in trying to minimize, but now know the gravity of it.","date":"Mon Apr 11 18:53:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Liz_Abel I support term limits, but should apply to all. If not, NE will only have folks who lack seniority. If anyone runs opposing the hard infrastructure bill in #NE02 they will lose the general, and you can enjoy a far left dem as your rep.","date":"Mon Apr 11 17:54:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Liz_Abel Oh, and the stuff you mentioned was not in the hard infrastructure bill.","date":"Mon Apr 11 17:46:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Liz_Abel It was $1.2T hard infrastructure bill that will repair bridges, roads and make our airport best in the Midwest.  Over 70% of our district supports.","date":"Mon Apr 11 17:45:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 @Reuters Thus, we should produce more and not wage war against American fossil fuels industry. Americans are overwhelmingly fed up with putting America last when it comes to energy.","date":"Mon Apr 11 17:43:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Fellow vet @RepAnthonyBrown and I led the way to rename bases named after Confederate leaders. Our bill was included in the Fiscal Year 21 Nat'l Defense Authorization Act and is now law. Our bases should bear the names of heroes who represent the best of America. https://t.co/tIZpJ0IqUs","date":"Mon Apr 11 17:00:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Attended the grand opening of the Carver Legacy Center this weekend. I learned how they've been providing mentoring services for our youth and adults in #NE02, to help them increase wealth, home ownership, business startups, and personal financial freedom. https://t.co/1MmEBrh9u9","date":"Mon Apr 11 14:02:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 @Reuters And Putin likes the way you think.","date":"Mon Apr 11 13:25:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 @Reuters No… thousands of jobs.","date":"Mon Apr 11 13:23:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 @Reuters We need to help Europe gain independence from Russia… and I’m for American jobs not Russian jobs.","date":"Mon Apr 11 13:11:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Liz_Abel I voted against the last Approps bill.","date":"Mon Apr 11 13:09:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"To stay updated with my office, sign up for our e-newsletter! https://t.co/LZdI8Xkapq https://t.co/0GaV40NJQ2","date":"Sun Apr 10 21:00:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"According to U.S. Customs and Border Patrol data, there were 164,973 migrant encounters at our southern border in February—a 63% increase from the previous year. This was the worst February on record in over TWO DECADES.\nhttps://t.co/fCo76ciaPQ","date":"Sun Apr 10 15:01:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to 55th Wing and 55th Wing Association for inducting me into the Wing’s 2021 Hall of Fame. I loved commanding four different times in the 55th Wing. Now, in Congress, we fixed the runway, restored the base after the floods, and drove Electronic Warfare forward. https://t.co/lGMI0pTtf4","date":"Sun Apr 10 14:58:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Romey_Mainzgirl @DonJBacon Most in NE are pro 2A.","date":"Sun Apr 10 03:47:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@OAMHRM Rationalizing murder of innocents is what you’re doing. There’s no excuse.","date":"Sat Apr 09 22:35:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My office is hosting a \"Service Academy Day\" for students and parents interested in learning more about the five Military Service Academies and how to apply to them. Representatives from each academy will also be attending.\n\nRegister here: https://t.co/wHAnDI30lP https://t.co/6OEtgi3OqQ","date":"Sat Apr 09 20:30:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ShandaPanda333 When we get majority we can use the power of the purse… in meantime the courts, the microphone 🎤, and public opinion. The majority of voters are incensed and it will show in Nov.","date":"Sat Apr 09 20:17:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Congratulations to the 2022-23 Nebraska State FFA Officer Team! I have no doubt that you will gain great leadership and life skills, and will lead the organization into the future of agriculture. Well deserved! https://t.co/cDe9wLNZWC","date":"Sat Apr 09 18:00:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Local law enforcement tell me the #1 action to reduce gun violence is to hold people accountable for making illegal straw purchases. These violent crimes happen too often, which is why I introduced H.R. 1604. This will bring justice and safety to our affected communities. https://t.co/XrsaTfGMyc","date":"Sat Apr 09 14:01:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@theO_NE Inflation is now worst in 40 years, the border crisis worst in 20 years, the world is much more dangerous, and we lost our energy independence, and we’ve had to resist Dem Socialism. This is what we foresaw, and it has happened.","date":"Sat Apr 09 11:52:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This is a reminder that Russia is a pariah state, led by a war criminal. \nhttps://t.co/Nw56wx67qn","date":"Sat Apr 09 00:00:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@sweettart204 You betcha!","date":"Fri Apr 08 21:23:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I am beyond humbled to be inducted into the 55th Wing's Hall of Fame. I will continue to fight for our service members and ensure the United States remains a global leader in defense and in peace.\n\nRead my full statement here ⬇️\nhttps://t.co/IH4d1ys046 https://t.co/cpcJruIPdE","date":"Fri Apr 08 21:05:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@eljpgplus I was in a room with hundreds last night who are angered at the Admin’s lack of leadership at the border. Folks are angry at all the fentanyl that is crossing border and a leading cause of death in the US. If your side wants to ignore, you’ll pay for it in Nov.","date":"Fri Apr 08 20:30:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@eljpgplus It’s one the top 3 issues that citizens in district want fixed.","date":"Fri Apr 08 20:26:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The U.S. will soon hit 1 MILLION illegal crossings on our border in just the first half of this fiscal year, which began 6 months ago in October.\n\nCBP warned that this number includes “known gotaways,” and that the true number is most likely much higher. https://t.co/ZxYfjVFkWU https://t.co/freTHghLwb","date":"Fri Apr 08 18:01:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Back home and working the district! Seven events today!","date":"Fri Apr 08 16:57:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@MarrWilliams @753112jma Evidently, the human trafficking that was evidenced in the laptop doesn’t bother you.","date":"Fri Apr 08 16:49:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":".@Offutt_AFB is a major #NE02 employer = $2.7 billion/year for our local economy. Since the 2019 flood, I’ve been able to secure $744 million to repair &amp; rebuild the base + another $166 million for a new runway. Bipartisan leadership got this done for NE! https://t.co/qzBL3fghI1 https://t.co/p9y6koyjZX","date":"Fri Apr 08 15:12:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We condemn the terrorists and the murder they committed in Israel. This is one big reason why we stand by our ally. #StandWithIsrael","date":"Fri Apr 08 13:15:50 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SergeantPup That guy must be reading Hunter’s laptop","date":"Fri Apr 08 12:55:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@RichMcWilliams1 We’ll put a spotlight on this next year. You and I want the truth.","date":"Fri Apr 08 03:49:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha Fox anyway… glad you watch!","date":"Fri Apr 08 03:42:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@realotoski May be his relative?","date":"Fri Apr 08 03:24:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@realotoski I think we are going to do some oversight on this… Americans deserve to know what happened in China and Russia… we’ll see what the emails say.","date":"Fri Apr 08 03:23:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@DistrictHusker @HouseGOP NYTs now says it is real… 18 months late, but whatever.","date":"Fri Apr 08 03:19:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SoooKaren The emails were real all the same, and that is what counts.","date":"Fri Apr 08 03:18:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"One thing is clear when it comes to the Hunter Biden computer story: most national media tried to bury this story prior to the 2020 election. Most Americans see the bias and don’t like it. \nhttps://t.co/0suLTRvLpB","date":"Thu Apr 07 23:05:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ChefOle We were energy independent in 2019 and 2020.","date":"Thu Apr 07 20:35:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Bacon loves pork! The @NEporkproducers stopped by our DC office to discuss trade and the animal vaccine bank to combat African swine fever virus. https://t.co/yOuYOdV67Y","date":"Thu Apr 07 20:20:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@MNelson17943935 We can… but you’ll need more natural gas in meantime.","date":"Thu Apr 07 19:42:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@realotoski @ShaferSkoog You didn’t read my comments… evidently.","date":"Thu Apr 07 19:41:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@realotoski @ShaferSkoog You obviously did not keep up with news, my votes, and #44s reaction.","date":"Thu Apr 07 19:05:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@realotoski @ShaferSkoog It’s second highest issue in NE02… energy independence and roughly two-thirds know the current policies contributed to high prices.","date":"Thu Apr 07 19:04:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@realotoski @ShaferSkoog It’s why I’m 3-0.","date":"Thu Apr 07 18:52:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@see_tina_go I’ve been in a military with bad readiness… I’ll have to respectfully disagree with you while we face Russia and China.","date":"Thu Apr 07 18:52:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Americans want energy independence &amp; innovation leveraging an all of the above approach. We can be the #1 energy leader. Instead, POTUS is hostile to the US fossil fuel industry &amp; relies on countries to bail us out. NO to Russian, Iranian &amp; Venezuelan oil.\nhttps://t.co/KiQx7T1BK1","date":"Thu Apr 07 18:01:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@see_tina_go Thankfully most of Dems in Congress disagree.","date":"Thu Apr 07 16:44:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"DoD based their budget on a 2.2% inflation assumption, but in reality it is almost 8%. This will result in less aircraft and ships fielded in a time of Russia’s invasion of Ukraine and a surging China. \nhttps://t.co/WgJy6gMajL","date":"Thu Apr 07 16:02:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great to be with our local United Association of Journeymen and Apprentices of the Plumbing and Pipefitting Industry in DC! Thank you for inviting me to your national convention. We hope you had great trip. @UAPipeTrades https://t.co/3WiYcdQBIq","date":"Thu Apr 07 14:02:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Biofuels play a major role in the Midwest’s economy, particularly in NE. Our farmers have waited patiently for years to get EPA’s fuel standard regulations. The biofuels feel left behind by this Admin. We want energy independence and a cleaner environment.\nhttps://t.co/IrG7OxPTaq","date":"Wed Apr 06 22:45:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@dontell51 I met the airport authority on Monday. They appreciate Deb Fischer’s vote too.","date":"Wed Apr 06 21:18:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Nebraska State FFA Convention is happening now! Good luck to everyone who is competing. #FFA members are the future of agriculture, and they have my full support. https://t.co/QU5XrhTgPq","date":"Wed Apr 06 21:15:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"H.R. 943, now law, creates a grant program to help teachers incorporate Holocaust education into students' lesson plans. As a lead cosponsor for the GOP side, I made it one of my legislative priorities to get this passed so that we never forget or let history repeat itself. https://t.co/rXNT64cjOb","date":"Wed Apr 06 19:45:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My office is hosting a virtual \"Service Academy Day\" for students and parents interested in learning more about the five Military Service Academies and how to apply to them. Representatives from each academy will also be attending.\n\nRegister here: https://t.co/wHAnDI30lP https://t.co/c7Otlo4KtJ","date":"Wed Apr 06 17:02:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@dontell51 They thanked me for my vote… you’re welcome!","date":"Wed Apr 06 16:50:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@logical_one57 @JimHarroldOmaha @HASCRepublicans They’ll appreciate your feedback!","date":"Wed Apr 06 16:22:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"$600 MILLION in upgrades to make Eppley Airport the best in region is in the works. We want the best airport in the Midwest, and I’m glad to support the effort. \nhttps://t.co/lLcwbpM2WQ","date":"Wed Apr 06 15:02:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Excellent meeting this week with Turkey’s Ambassador to the US Murat Mercan.  As a steadfast #NATO ally we are grateful for Turkey’s leadership in opposing Russia’s aggression in #Ukraine. https://t.co/1XhrGFh6Rx","date":"Wed Apr 06 13:55:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Lincoln_Patriot @Ukraine I agree there’s more that we can do.","date":"Wed Apr 06 04:03:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today our staff met with the Nebraska Association of Nurse Anesthetists. They suffered many workforce shortages while being on the frontlines of COVID. I thank them for sharing their insights on ways we can recruit and retain CRNAs as we continue to recover from the pandemic. https://t.co/GcW8QCyXav","date":"Tue Apr 05 23:15:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Admin has been silent on trade. Export growth increases jobs by generating new business for manufacturers, service providers, and farmers in NE. We need to ensure our state remains competitive by creating more jobs &amp; keeping costs low for NE families. https://t.co/F6mZBTPf7l https://t.co/G6yYQth5Tf","date":"Tue Apr 05 20:01:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our #GoldStarSpouses deserve a commitment for life. I’ve worked hard to fix gaps in current law that make it difficult for military spouses to have access to installations, attend memorial services, or receive counseling. I will always fight for Gold Star spouses and families. 🇺🇸 https://t.co/LEUteuat4Q","date":"Tue Apr 05 16:02:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The COVID pandemic highlighted how vital supply chains are to our national security. As a member of the Defense Critical Supply Chain Task Force, my colleagues and I are committed to identifying risks and keeping a competitive edge over our adversaries. https://t.co/7nAv75Vahm","date":"Tue Apr 05 14:02:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@logical_one57 @JimHarroldOmaha @HASCRepublicans Doesn’t live in district for one, and I find snarky people are very sensitive when I push back.","date":"Tue Apr 05 13:47:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha @HASCRepublicans But, most will oppose a 12% increase in non-defense spending and a cut once inflation is factored in for defense spending.","date":"Tue Apr 05 10:37:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@McSushiSosumi @realotoski @damnlib @JimHarroldOmaha @HASCRepublicans You said that previously… the majority disagrees.","date":"Tue Apr 05 03:43:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@McSushiSosumi @damnlib @JimHarroldOmaha @HASCRepublicans 12% in non-defense vs 4% for defense… while we have 8% inflation. I look forward to the debate..","date":"Tue Apr 05 03:31:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@geekate I agree. The Admin has been slow. But I agree with your statement.","date":"Tue Apr 05 03:26:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@McSushiSosumi For NE, it’s a top 4 priority… thank you for raising attention to it.","date":"Tue Apr 05 01:49:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha @HASCRepublicans Colonel, because it calls for 12% increase in non-domestic spending and 4% in defense spending, which is below 8% inflation. Simple math. You didn’t work in Finance I hope!","date":"Tue Apr 05 01:46:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@geekate I’ve called them war crimes.","date":"Tue Apr 05 01:43:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Nearly 1 in 5 jobs in Nebraska are tied to international trade, including imports and exports, and trade-related jobs grew 4 times FASTER than total employment from 1992 to 2019. I urge the Administration to make trade a higher priority. https://t.co/F6mZBTPf7l https://t.co/Qbw2kS3Qnq","date":"Mon Apr 04 18:45:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@MisesNe They’re thriving economically because they’ve embraced free markets. I can’t agree with you on this. But make no mistake, Russia is a legit threat to them.","date":"Mon Apr 04 15:54:08 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Now more than ever, the Baltic states are vulnerable to Putin's aggression. @RepRubenGallego &amp; I introduced the Baltic Defense &amp; Deterrence Act to increase security and economic relations between our countries and preserve freedom in the face of tyranny.\nhttps://t.co/VH5Cqga1mt","date":"Mon Apr 04 15:30:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you Mount Moriah Baptist Church for inviting me to the Installation of Pastor Williams. I congratulate the Pastor &amp; Mrs. Williams, and wish Pastor &amp; Mrs. Lassiter the very best on their retirement. I thank all four of them for serving God, their church, and our community. https://t.co/bYAQixFjtR","date":"Mon Apr 04 13:30:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a member of the Bipartisan Task Force for Combating Antisemitism, I will always support legislation that protects our jewish communities and promotes #Holocaust education. Fighting antisemitism is not a Republican or Democrat issue, but an American one. https://t.co/T2Vrd1KSFI https://t.co/RSw5Um33zw","date":"Sun Apr 03 14:01:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SharonConlon12 @SenSasse @DebFischerNE Denuclearizing in a world of Russia’s Putin, China’s Xi, and DPRK’s Kim… I think it sounds dangerous.","date":"Sun Apr 03 13:58:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@TomBecka @wehavethepeople Tom, don’t worry about Dan. He’s blinded by partisanship and anger. He doesn’t get the irony of dark money PACs complaining about other PACs.","date":"Sun Apr 03 13:56:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Sheeps62 @ad1220 You may want to put out a correction: I voted yes. Thank you.","date":"Sun Apr 03 13:54:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Taiwan is a beacon of democracy, human rights, and free enterprise in Asia—ideals rejected by China’s Communist Party.\n\nAs a member of the Taiwan Caucus, I'm committed to protecting these freedoms and preserving our self-defense capabilities and alliance with #Taiwan. https://t.co/CpnfnKHUGV","date":"Sat Apr 02 21:00:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I co-founded and currently serve as co-lead of the For Country Caucus, a bipartisan group of veteran and active-duty Members who pledged to serve with the core values of our respective services – integrity, civility, and the courage to break through political dysfunction. https://t.co/ziSfmKwBx8","date":"Sat Apr 02 15:01:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@unlikelyortiz Honesty is easy.","date":"Sat Apr 02 00:04:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Met with the Kurdistan Ambassador to the US, Bayan Sami Abdul Rahman, to discuss Iran’s recent launching of ballistic missiles into their capital, Irbil. This is an egregious act of unprovoked aggression. We need improved air defense capabilities in the area. https://t.co/TPM7eJi7w5","date":"Fri Apr 01 21:40:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great to welcome back two former members of our team, Julia and Claire. We recognized their work that contributed to our office being named the best Republican office in the House for constituent services. https://t.co/44egx6vh09","date":"Fri Apr 01 20:45:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I joined my House colleagues in a bipartisan effort to make the air supply on commercial aircraft more safe. Investigation shows an alarming number of incidents of toxic fumes incapacitating crew members and passengers, including an Omaha flight attendant.\nhttps://t.co/90NBZdjox7","date":"Fri Apr 01 19:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"While I am serving Nebraskans in Washington, my staff was able to attend this week's groundbreaking ceremony for the Nebraska Vietnam Veterans Memorial in Papillion. We salute and thank America’s heroes for their selfless service and valor throughout history. https://t.co/yoA99Ju2rv","date":"Fri Apr 01 17:15:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"China is modernizing and expanding their nuclear arsenal at an unprecedented rate. We must now deter two near peer nuclear powers at once. At a minimum, this requires a fully-funded, capable, and resilient triad. #PeaceThroughStrength #StrategicDeterrence #GBSD #RiseOfTheRaider https://t.co/7dqCDe0GFQ","date":"Fri Apr 01 16:19:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"April is the Month of the Military Child. I have personally seen the sacrifice these kids make so their parents can serve our country. Over 1.6M children separate from parents who must train &amp; deploy. Some will miss mom or dad forever. We salute these brave children #KidsServeToo https://t.co/ET2S4OglNn","date":"Fri Apr 01 14:02:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I was awarded the Guardian of Seniors' Rights Award by 60 Plus for my work to protect Social Security &amp; Medicare. I am committed to reforming and strengthening oversight and beneficiary protections for senior citizens. I have and always will keep that promise to my constituents. https://t.co/s13dix1UCF","date":"Thu Mar 31 21:01:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The President’s budget busting proposal hurts defense and increases the national debt by:\n❌Spending $73 TRILLION over the next 10 years\n❌Cutting the number of ships and aircraft in our arsenal\n❌Inhibiting us to modernize and expand our deterrent and combat capabilities https://t.co/74jolKkGtE","date":"Thu Mar 31 18:48:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to @cspanwj for having me on this morning to discuss the ongoing Ukraine and Russia conflict. The U.S. needs to remain committed to Ukraine and give them the weapons they need to preserve their country. Putin is losing this fight, and we need to keep it that way. https://t.co/07PkGC4Xnm","date":"Thu Mar 31 16:55:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"KETV: “Bill to honor World War II hero passes, moves to Senate floor”\n\nWe are one step closer to renaming the Benson Post office after WW2 hero, Petty Officer French. I thank ⁦@SenatorFischer⁩ for leading this on Senate. \n https://t.co/tmF4VzgkaU","date":"Thu Mar 31 15:44:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"So grateful to meet with Guatemala’s Ambassador to the US Alfonso Quinonez. Guatemala is a steadfast and trusted partner of the US and a courageous supporter of #Taiwan and #Ukraine. I look forward to advancing relations between our nations. @EmbaGuateUSA https://t.co/9p0hgQzdiw","date":"Thu Mar 31 15:10:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#WomensHistoryMonth https://t.co/m6TXJsgX69","date":"Wed Mar 30 23:50:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The tragic events of the last month have taught us once again that freedom must be defended from tyranny. We're now watching in real-time the incalculable human cost when deterrence fails. I'm grateful to partner with @RepRubenGallego on this initiative.\nhttps://t.co/zHqbYEZjXN","date":"Wed Mar 30 21:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@4leafcloverBigO @BadMedicalTakes The southern border is conduit for much of the fentanyl… I agree our border security is inadequate and this Admin is culpable for failing here.","date":"Wed Mar 30 15:30:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@1nfoSecBen I disagree across the board… further, the Keystone Pipeline would have lowered our property taxes and income tax burden.","date":"Wed Mar 30 15:04:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Lymphedema is a chronic condition that causes swelling, pain, and decreased mobility in legs and arms—common side effects of cancer treatment.\n\nI cosponsored H.R. 3630 to reduce the financial burden of treatment, so that lymphedema patients have access to the care they need. https://t.co/UPx4NJTqsg","date":"Wed Mar 30 14:00:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@elmax21 This is #2 issue for swing voters, behind inflation. Voters are telling this Admin to stuff it.","date":"Wed Mar 30 11:02:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CauseLessPain Energy independence would decrease “oil wars.”","date":"Wed Mar 30 11:00:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 @dcfmkc While President waged war on our fossil fuel industry, he was fine with importing from Russia and wanted OPEC to increase production. America last.","date":"Wed Mar 30 02:37:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 Energy independence for America will impact supply and demand, and lower prices. The President’s policies caused a rise in price before the Ukraine invasion.","date":"Wed Mar 30 02:35:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 We need to do all the above for now.","date":"Wed Mar 30 02:33:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I and four “For Country Caucus” colleagues welcomed Ukrainian &amp; Polish Parliamentarians to Capitol. They provided an update on Russia’s unjust invasion &amp; indiscriminate bombing, and highlighted what weapons they’re in most need of. Ukrainian bravery &amp; toughness are beyond belief. https://t.co/X87opj68Oa","date":"Wed Mar 30 02:21:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#WomensHistoryMonth https://t.co/ptBR4aZeBj","date":"Wed Mar 30 00:01:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@dcfmkc It is an element of his war on American fossil fuels industry.","date":"Tue Mar 29 22:42:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@dcfmkc Pipelines are safest method of transport and have lowest carbon footprint. Keystone represents the overall policy where multiple natural gas terminals have not received permits… yet, the Admin asks OPEC to pomp more.","date":"Tue Mar 29 22:04:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Candidate Joe Biden vowed to “end fossil fuels.\" Now as POTUS he:\n❌Rejected energy independence\n❌Canceled the Keystone XL Pipeline\n❌Delayed permits for new natural gas terminals\n❌Supported extreme Green New Deal policies\n❌Disincentivized natural gas &amp; other carbon sources https://t.co/EwSx7qHwgu","date":"Tue Mar 29 21:22:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Enjoyed seeing Daniel and Melissa from the National Air Traffic Controllers Association. We discussed keeping highly skilled air traffic controllers and engineers safe and my support for the bipartisan infrastructure bill and the Aviation Funding Stability Act. https://t.co/fsPjP8tIM0","date":"Tue Mar 29 21:10:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The President denies his key role in higher gas prices, but said he was going to wage war against America’s fossil fuel industry. He did this on day ONE. When you pay more at the pump &amp; heat your home, remember his words. Americans want energy independence &amp; AMERICAN innovation. https://t.co/8LDMLPKcge","date":"Tue Mar 29 16:45:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As parents and educators, it is our responsibility to protect our children and student-athletes from harmful substances and prescriptions. That is why I joined my colleagues to introduce H.R. 7246 to establish grants that prevent the misuse of opioids. https://t.co/5XhwKOF4J6 https://t.co/6Q2Jomk3Nl","date":"Tue Mar 29 15:02:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On my way back to DC, I met with the Omaha Airport Authority to discuss the terminal modernization work going on at Eppley, and to see how the funds from the bipartisan infrastructure bill are supporting this project. https://t.co/EHR0FOu2pm","date":"Mon Mar 28 21:05:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The GPS Caucus educates Congressional staff and Members on the importance of fueling innovation and job creation while also modernizing national security and infrastructure.\n\nAs a Co-Chair, I'm committed to expanding, protecting, and promoting our #GPS technologies. https://t.co/eZNi7T3HLg","date":"Mon Mar 28 20:01:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"For decades, Israel has been our best ally and the only legitimate democracy in the Middle East. We should always support Israel's right to protect itself and counter those conducting terrorism against them. #IStandWithIsrael https://t.co/Fz6eBq5P2V","date":"Mon Mar 28 14:02:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Israel is targeted once again by terrorists, the second time in a week. This is why we stand shoulder to shoulder with our ally and why we make these terrorists our common enemy. Our condolences to the two murdered Israelis.  https://t.co/RInIiKGtEC","date":"Mon Mar 28 03:03:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@rmeyer146 You should read the paper more.","date":"Mon Mar 28 02:57:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a member of the Climate Solutions Caucus, I believe Congress needs to work together to find bipartisan solutions that protect our environment such as carbon capture technologies, battery storage, and preserving natural resources. @ACC_National https://t.co/PIKB2O3ZP3","date":"Sun Mar 27 21:00:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a member of the Bipartisan Task Force on Alzheimer's Disease, I'm committed to raising awareness, increasing NIH funding for research, and supporting proactive legislation that benefits the nearly 5.8 million Americans living with Alzheimer's. #ENDALZ https://t.co/4c2VqShez4 https://t.co/lya32VZNKs","date":"Sun Mar 27 15:01:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 You’ve obviously have not been tracking the news well.","date":"Sun Mar 27 14:28:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha Embarrassing then that his staff had to correct him immediately afterwards.","date":"Sun Mar 27 12:16:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The President made three gaffes this past week alone that the WH staff has had to “clean up.” Putin and his team are exploiting the comments. Self control and communications discipline are needed at the highest elected office of the land.","date":"Sun Mar 27 11:47:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@realotoski @JimHarroldOmaha I’m grateful for the support of many Dems, so not the case.","date":"Sun Mar 27 04:00:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha Colonel, you obviously didn’t learn how to give some grace and kindness when a person faces a personal defeat, even if you think justified.","date":"Sun Mar 27 03:49:50 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I respect Rep. Fortenberry's tough, but right decision to resign from his position and wish him and his family the best.","date":"Sat Mar 26 22:08:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#WomensHistoryMonth https://t.co/izHWqENB7N","date":"Sat Mar 26 20:05:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The @USChamber awarded me the Abraham Lincoln Leadership for America Award! We must come together to pursue bold solutions to the historic challenges facing our communities and our country. #LeadTogether https://t.co/tp1plwjKDt https://t.co/J2dasioA3a","date":"Sat Mar 26 14:01:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CuzISaidSoBrat @POTUS The Iran deal is terrible. No way.","date":"Sat Mar 26 05:32:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CuzISaidSoBrat @POTUS I’m in top 2% of Congress who shows up and votes! Thanks!","date":"Sat Mar 26 05:26:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Why would @POTUS ask Russia to serve as intermediary with the Iran terrorist govt on a nuclear weapons agreement? Did he actually think we could trust Russia… or Iran? Naivety at best, or utter foolishness more likely. While we ask Russia to help us w/ Iran, they bomb Ukraine.","date":"Sat Mar 26 04:55:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"War crimes.","date":"Sat Mar 26 04:44:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#WomensHistoryMonth https://t.co/9PwlbRAZ89","date":"Sat Mar 26 00:00:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Medal of Honor is the highest military honor given in the United States. Thank you to all the brave service members who have gone above and beyond the call of duty. We salute you. 🇺🇸 #MedalofHonorDay https://t.co/g4QOp0T8iJ","date":"Fri Mar 25 15:02:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Some qualified retired law enforcement officers have struggled to meet the qualification standards in firearms training due to #COVID.\n\nI introduced H.R. 2960 to extend these requirements for one year to safeguard the #LEOSA benefits retired and qualified officers have earned. https://t.co/0FyeCcl7ol","date":"Thu Mar 24 23:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In December, my office sent a letter to DoD about their civilian law enforcement not receiving proper law enforcement credentials. While I am glad they have responded and addressed that there is a problem, I look forward to working with them to fix it. https://t.co/eHIYm1JLb0","date":"Thu Mar 24 20:15:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#ThrowbackThursday: Congratulating Rep. Don Young when he officially became the Dean of the House. His passing this week was a heartbreak for all who knew him. His name will be a part of the House legacy forever. https://t.co/iXZOQB5h2I","date":"Thu Mar 24 17:10:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Iran’s IRGC killed 609 Americans in Iraq alone. I call on @POTUS to NOT take this organization off the terrorist list. The IRGC hates America, our Allies, and it terrorizes it’s own people. #IRGCisTerrorist","date":"Thu Mar 24 15:24:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I believe in the future of agriculture. That is why I joined the Congressional FFA Caucus. I'm committed to promoting #Ag education in our schools and supporting the next generation of leaders in our agriculture industry. https://t.co/xVFeELKa7V","date":"Thu Mar 24 14:02:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#WomensHistoryMonth https://t.co/tZsKR0aRRy","date":"Thu Mar 24 00:01:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@KeithRoragen We still have troops in Germany, Japan and South Korea… weakness from America is bad for whole world.","date":"Wed Mar 23 23:25:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@AnnWilcoxen1 They’re part of a coalition.","date":"Wed Mar 23 23:23:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@KeithRoragen Peace through strength… appeasement results on defeat.","date":"Wed Mar 23 23:22:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I introduced H.R. 6203, the Emergency Snap Staffing Flexibility Act of 2021 to ease the backlog in the SNAP program by allowing contractors to determine the eligibility of SNAP recipients in a quicker and more efficient manner.\nhttps://t.co/UYaPwoXPsw https://t.co/qP162InMoH","date":"Wed Mar 23 21:01:20 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My condolences to the family and friends of Secretary Albright. Not only did she escape from the Nazi regime &amp; communism, she broke barriers and was an exceptional leader in international affairs and diplomacy. We will forever remember the legacy she left for future generations.","date":"Wed Mar 23 19:55:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"2/2 “Taliban were not on the verge of victory; they won because the U.S. withdrew, crippled the Afghan Air Force on its way out &amp; left Afghan troops w/out air support or resupply lines…the decision to withdraw was driven not by military necessity…but by U.S. domestic politics.”","date":"Wed Mar 23 18:42:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"1/2 Great article in Foreign Affairs: “The U.S. could have supported 2,500 soldiers in Afghan almost indefinitely…so long as US AirPower &amp; support for the Afghan Air Force remained in place, the Taliban would have posed a minimal threat to U.S. troops.” https://t.co/GrJUKj5G1s","date":"Wed Mar 23 18:37:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"There is no diplomacy without credible military power. Investing in our military is critical to deterrence and our national security. Underinvesting now will be paid for with freedom later.","date":"Wed Mar 23 16:32:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As Ranking Member of the House Agriculture Committee’s Subcommittee on Nutrition, Oversight, &amp; Department Operations, I'm committed to making nutrition and domestic food assistance programs more efficient and effective for families most in need. https://t.co/YSXRhdJ6vK","date":"Wed Mar 23 15:02:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"After the 2019 flood, there are plans for 24 new facilities at Offutt AFB, and all on higher foundations to survive future floods. The levees have also been made higher. Offutt AFB is home of US Strategic Command and one of the largest flying wings in AF. https://t.co/CIwjTt5rSi","date":"Wed Mar 23 10:17:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Former NATO 4-Star commander urges transfer of MIG-29s to Ukraine. Poland has offered these fighter aircraft that Ukrainians knows how to fly, but the Biden Admin has stood in the way.  https://t.co/cCbOiAiuG0","date":"Wed Mar 23 10:00:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@RanaF56659281 Perhaps there’s a reason our President is rated 40% in polling.","date":"Wed Mar 23 01:54:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@RanaF56659281 I’m rated #15 out of 435 by Georgetown University for bipartisanship. And, rated #1 elected official in America by Common Ground Committee for seeking consensus.","date":"Wed Mar 23 01:53:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@RanaF56659281 @SeventhSon6 Just the truth!","date":"Wed Mar 23 01:42:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Current &amp; retired LEOs have put their lives on the line for our communities &amp; are many times called upon to do so even when they are not wearing their uniform. My bill, H.R. 1210, ensures eligible LEOs remain ready to protect &amp; serve through expanded concealed carry benefits. https://t.co/bMotE3Dw7O","date":"Tue Mar 22 23:00:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"POTUS must not de-list the IRGC as FTO for the sake of a weak nuclear deal. This will fuel the world's #1 sponsor of terrorism, further alienate allies in the region, and disgrace over 600 American soldiers who died at the hands of IRGC in Iraq. #MaxPressure #PeaceThroughStrength https://t.co/FUbhrHA7Cf","date":"Tue Mar 22 20:01:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a veteran of the Intelligence Community, I saw first hand the catastrophic impact cyber attacks can have on public &amp; private businesses. My bill, HR 5658, assesses our cyber incident response and proposes improvements to protect us from future attacks. https://t.co/h3pEOyvTPR","date":"Tue Mar 22 17:01:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Nebraska's farmers, ranchers, and producers play a vital role in our nation's economy and supply chain. Today and every day, we thank them for working day and night to provide for our country. #NationalAgDay https://t.co/02ngOOyJpQ","date":"Tue Mar 22 14:50:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I appreciate @SenSasse's support and @SenatorFischer's leadership in making this happen. Petty Officer French's heroism in saving the lives of 15 fellow sailors will be an important legacy for Omaha. https://t.co/hS7xdzwJl9","date":"Tue Mar 22 13:42:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@marthaevapearl @eaarent @janekleeb Our baby daughters disagree.","date":"Tue Mar 22 02:25:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@dontell51 I did… the bipartisan one. I opposed the partisan one.","date":"Tue Mar 22 02:06:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@eaarent @janekleeb Killing a a beating and living human heart is not love.","date":"Tue Mar 22 02:05:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@johnvkelley @ShandaPanda333 @ProbSolveCaucus They last the longest!","date":"Tue Mar 22 00:07:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Rebecca28049528 @ShandaPanda333 @ProbSolveCaucus Three terms.","date":"Tue Mar 22 00:06:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My House colleagues and I introduced the #BacktheBlue Act which seeks to ensure our law enforcement officers, federal judges, and public safety officers, including firefighters, chaplains and rescue crews, are afforded greater protections. https://t.co/B9ZkP7xIdc https://t.co/LN9OpO8CSN","date":"Mon Mar 21 21:20:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@briansantamaria I don’t agree with the phone call, but the weapons did arrive by the time required by law. The first anti-tank weapons arrived during #45, while #44 refused to do so.","date":"Mon Mar 21 19:28:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@briansantamaria @JimHarroldOmaha I’ve always supported helping Ukraine defend itself. Don’t forget #44 refused to send lethal weapons.","date":"Mon Mar 21 19:27:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb Have you ever considered why so many people of faith have left you and your party? And, why all the state wide officeholders, all federal delegation, the far majority of unicameral, and mayor of the largest city in NE are pro-life? The majority of citizens disagree with you.","date":"Mon Mar 21 19:25:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@briansantamaria @JimHarroldOmaha Weird the Russians invaded Crimea in #44 and then the rest of Ukraine in #46. You may need some more self-reflection.","date":"Mon Mar 21 19:20:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This morning, I talked with @SIRIUSXM's @juliemason on the latest with Ukraine and Russia. \n\nListen to it here ⬇️\nhttps://t.co/s0tqhhNFFp","date":"Mon Mar 21 18:30:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I DO NOT recommend dividing CYBERCOM &amp; NSA by adding another 4-star. It would be like a football team and having one head coach for your offensive line but a different head coach for your QB. Unified direction will be lost by splitting these two commands.\nhttps://t.co/goPeTK6CsZ","date":"Mon Mar 21 16:20:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ShandaPanda333 @ProbSolveCaucus I’m a saguaro cactus type person!","date":"Mon Mar 21 15:54:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a member of the House Agriculture Committee, I have always supported policies that preserve family farms, maximize livestock production, and expand trade opportunities. I also helped establish the FMD Vaccine Bank. I will always advocate for Nebraska's #Ag community. https://t.co/O3SPNhPSbR","date":"Mon Mar 21 15:02:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha Weakness and ineptness from this Administration in Afghanistan and then the actions leading up to the invasion of Ukraine will be focus areas this year.","date":"Mon Mar 21 12:46:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I recommended to the Biden Administration last Dec through Feb that it provide Ukraine with anti-shipping capabilities, but it declined saying it “may provoke the Russians.” Since then, Russia has conducted amphibious and continuous missile attacks with their navy.","date":"Mon Mar 21 11:15:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@aharkness76 @gagetaylor @janekleeb NE is ranked as one of best places to live.","date":"Sun Mar 20 20:27:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"It is inconceivable the Biden Admin asked Russia to negotiate w/ and be the intermediary in the nuclear talks w/ Iran. The Russian negotiator says Iran got everything it wanted. Taking the IRGC off the terrorist list is a huge failing…it killed 609 Americans in Iraq alone.","date":"Sun Mar 20 20:26:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a foster to adoptive parent of two siblings, keeping siblings together in the foster care system is a priority of mine. It significantly increases their chance of having positive life outcomes. We have a responsibility to fix this and stop separations. https://t.co/eO3VS6NzPT https://t.co/eKgMZWCpY7","date":"Sun Mar 20 20:00:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Russia’s unjust invasion has largely stalled on the ground &amp; now Putin is resorting to more indiscriminate bombing of cities. Putin grossly underestimated the fighting spirit of Ukraine. The free world must keep supplying Ukraine what it needs and isolating the war criminal.","date":"Sun Mar 20 15:40:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb You want CA voting rules on NE… you are way out of touch.","date":"Sun Mar 20 15:34:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"She suffered grave wounds, yet she is still paying medical expenses from the 1963 bombing that destroyed her right eye. My bill, named after her, seeks to help compensate victims who are still suffering medical expenses from the 1954-1965 Civil Rights era. (2/2)","date":"Sun Mar 20 13:25:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We welcomed Sarah Collins Rudolph to Omaha. She shared her story of surviving the bombing of a church in Birmingham that killed four girls, including her sister. Her story centered on faith and forgiveness. (1/2) https://t.co/2WTBVeFEDy","date":"Sun Mar 20 13:25:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"For Women’s History Month, I recognized Carol McBride Pirsch. For decades she has been a great public servant by advocating for victims rights and creating lien laws to protect homeowners. We salute and thank her for her contributions to the people of #NE02. https://t.co/zmbluGqwc0","date":"Sat Mar 19 23:04:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#WomensHistoryMonth https://t.co/csxYQvPdUv","date":"Sat Mar 19 18:00:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Since Roe v. Wade, over 60 MILLION innocent American lives have been lost. I will always defend the unborn and their right to life. #IStandWithLife https://t.co/pZ2IFn2jXv","date":"Sat Mar 19 15:01:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We will miss the Dean of the House and our friend, Representative Don Young, who passed away today. Our condolences to Anne and to all of Don’s family and friends. He had a huge heart for Alaska and will be a legend in U.S. House history. https://t.co/Za2DmsWPd1","date":"Sat Mar 19 02:33:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great to see Mayor Joey Spellerberg and his wife Ashley here in DC. Happy Anniversary to the both of them! I appreciate all the hard work of our Nebraska mayors and local officials. https://t.co/un5mVmP8cc","date":"Fri Mar 18 23:00:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I was happy to support this project and push for the reauthorization of the CHIP-IN Act for an additional five years, so that my colleagues and I can support projects like this one in the future.\nhttps://t.co/nrWUhT29NR","date":"Fri Mar 18 20:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Constituent services are one of the most important things our offices does. Our team is humbled to be selected for this award, but we don’t do it for that. We do it because it is the right thing to do, and we care about the people of #NE02. https://t.co/0UFl0tyNrs","date":"Fri Mar 18 16:30:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I was rated #15 out of 435 members for bipartisanship in the House. My @ProbSolveCaucus colleagues and I (28 Republicans &amp; 28 Democrats) are committed to breaking through political dysfunction and reaching across the aisle to get things done. That's how Congress should be. https://t.co/t1qSfOBK9d","date":"Fri Mar 18 14:02:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JordanHarrold 😂","date":"Fri Mar 18 10:34:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb You’ll enjoy them all year!","date":"Fri Mar 18 10:32:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JordanHarrold 🎁","date":"Fri Mar 18 10:21:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our office received the Democracy Award for their outstanding practices and achievements acting as ombudsmen with the federal government or responding to constituent requests and inquiries. \n\nC-SPAN will cover the awards LIVE TOMORROW at 8:25 a.m. ET at https://t.co/rhyEZs7RN6!","date":"Thu Mar 17 23:15:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Nearly 384 international employers have operations in Nebraska. I joined the Global Investment in America Caucus to help the US remain a global leader, and to ensure job growth and economic expansion for everyday Americans and Nebraskans. https://t.co/T89WcbEkUR","date":"Thu Mar 17 21:01:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ChefOle You do realize they never met at Camp David don’t you?","date":"Thu Mar 17 20:43:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@DeeGree68794157 @usairforce @AOCrows I’m a fan of both you and Moose too!","date":"Thu Mar 17 20:42:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I was a career electronic warfare officer in the @usairforce and now I serve as Co-Chair of the Congressional Electromagnetic Warfare Working Group for the fifth year in a row. Military readiness depends on our ability to dominate the electromagnetic spectrum. #JEMSO @AOCrows https://t.co/8pdknFqqxa","date":"Thu Mar 17 18:01:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The USCENTCOM Commander, Gen McKenzie, just reiterated that he recommended the US keep 2,500 troops in Afghanistan but was overruled by POTUS. We will not forget that POTUS told us that no one dissented with his withdrawal plan. But, that was not true.","date":"Thu Mar 17 15:15:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"In Nebraska, more than 10,000 people of all ages are diagnosed with TBI every year, and since 2000, more than 439,000 service members have been diagnosed with TBI. As co-chair of the TBI Task Force, I will continue to push for more funding and innovation in TBI care and research. https://t.co/ecDda9j2E2","date":"Thu Mar 17 14:40:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Putin is a war criminal.","date":"Thu Mar 17 11:07:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@rmeyer146 The weapons got to Ukraine by the time the law required. Did it bother you when #44 refused to send lethal weapons?","date":"Thu Mar 17 10:00:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@rmeyer146 Did lethal aid arrive before the law required?","date":"Thu Mar 17 01:00:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Congressional Art Competition is open to all high school students in #NE02. This is an opportunity to recognize and encourage artistic talent in our nation’s youth.\n\nThe deadline to apply is April 1st!\n \nLearn more: https://t.co/i7DnChMNVE https://t.co/h8ERM9HFof","date":"Wed Mar 16 20:01:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a Co-Chair of the TBI Task Force, I'm committed to raising awareness, advancing research and funding, and helping to develop treatments like the world’s first portable blood analyzer for #TBI. We've made many strides in the last few years, but there is still more work to do. https://t.co/20fkx1J7mi","date":"Wed Mar 16 16:02:20 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Pres. Zelensky is fighting for his life &amp; Ukraine's sovereignty by requesting aircraft &amp; better air defense systems so he can defend the cities that are being bombed every day, but POTUS opposed the transfer of these weapons. I call on the Pres to send the weapons to Ukraine NOW. https://t.co/dlq5w3vVwM","date":"Wed Mar 16 14:46:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@1nfoSecBen We want a better decision.","date":"Wed Mar 16 11:22:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#WomensHistoryMonth https://t.co/ti6wuVduC9","date":"Tue Mar 15 21:50:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our team was pleased to welcome 26 Air War College grad students visiting NE as part of their curriculum for cultural immersion. Our district director gave insight to how Congress works, and our national security advisor spoke to them about the NDAA and my work on HASC. https://t.co/IkmZPFLdoG","date":"Tue Mar 15 19:30:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This is great for Omaha and Eastern Nebraska. Our VA is continually rated one of best in the country, and there is great synergy with our VA and the other medical institutions such as UNMC. We can build on this great success and make it even better.\nhttps://t.co/sQbDsGTpTt","date":"Tue Mar 15 17:02:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I joined 14 of my bipartisan House colleagues to urge President Biden to provide additional defense material to Ukraine and strengthen economic sanctions directed at Russia. https://t.co/BA2KQwHSQ4","date":"Tue Mar 15 15:02:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@kto622 @SkipDeBusk @marcorubio @RepAdrianSmith @JeffFortenberry @BenSasse @DebFischerNE A bill is not a petition.","date":"Tue Mar 15 02:20:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SkipDeBusk @marcorubio @RepAdrianSmith @JeffFortenberry @BenSasse @DebFischerNE I’m a cosponsor to do this at federal level. I agree.","date":"Tue Mar 15 01:57:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@innerpeece They’re flying missions now… they need more.","date":"Tue Mar 15 01:56:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As member of Problem Solvers, I 100% agree.","date":"Mon Mar 14 23:03:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On with @IanMSwanson and @kfabnews in 5 minutes!","date":"Mon Mar 14 22:01:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I re-introduced the Kerrie Orozco First Responders Support Act to allow the immediate relatives of first responders who die in the line of duty to continue processing their immigration application in a timely manner despite the death of their loved one. https://t.co/M2BtUx4Y6q https://t.co/XVmRUcsLfP","date":"Mon Mar 14 20:01:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Members of our staff attended last week's ribbon cutting ceremony for the COX Innovation Lab at the Boys and Girls Club of the Midlands. We need to promote equity and inclusion and help students of all backgrounds have the same access to internet, computers, and STEM training. https://t.co/9HYdELAo1H","date":"Mon Mar 14 17:10:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Someday Putin will receive justice. \n\nIn meantime, the free world must continue to provide the weapons needed for Ukraine to defend itself against this unprovoked, unjust attack. And, we must remain committed to 100% economic and diplomatic isolation against this pariah state.","date":"Mon Mar 14 14:15:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Some foster care children, unfortunately go to homes that are not able to provide them with daily necessities. I introduced H.R. 4299 to ensure foster youth have everything they need and help reduce trauma if they enter these circumstances.\nhttps://t.co/eGh51syUOa https://t.co/Yhm5SMawhn","date":"Mon Mar 14 14:02:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As a co-chair of the Foster Youth Caucus, I believe our nation needs a strong foster care system. I have worked across the aisle to ensure that no child in foster care is forgotten and to help those aging out of the system get the assistance they need to succeed. https://t.co/q6n346C5LK","date":"Sun Mar 13 21:00:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The @SBAList gave me an A+ rating for supporting pro-life legislation in the 117th Congress. I will always defend and protect the voiceless and most vulnerable. https://t.co/crYJprGCIj https://t.co/akk9xKkI5d","date":"Sun Mar 13 15:01:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Jdangelo4404 @CDMan5000 @ad1220 And for those who served a career defending our country.","date":"Sun Mar 13 03:26:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@lnovotny Which vote? There’s been several.","date":"Sun Mar 13 03:25:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@rogo000 I opposed the nearly $50B in new spending and the fact the 2700  page bill came to us at 1:50 AM for us to vote on the same day.","date":"Sun Mar 13 03:24:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Every year, there are an estimated 476,000 new cases of Lyme disease, with cases reported in all 50 states and around the world. Glad to cosponsor H.Res. 425 to educate and encourage the public to take preventive measures to screen for these conditions. https://t.co/TmytODisec","date":"Sat Mar 12 21:00:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you @USChamber for supporting HR 5315. As a cosponsor of this legislation, I believe we need to regain the initiative to inspect, strengthen, and maintain our drone capabilities.\nhttps://t.co/tpF1NEb05w","date":"Sat Mar 12 18:01:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our #GoldStarFamilies spouses deserve a commitment for life. I’ve worked hard to fix gaps in current law that make it difficult for military families to have access to installations, attend memorial services, or receive counseling. I will always fight for them. https://t.co/Pf0EZxcaCg","date":"Sat Mar 12 15:01:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The House passed my bill, H.R. 4168, which would rename an Omaha post office after Petty Officer French who swam in shark infested waters to save 15 of his shipmates during WW2 after their ship was attacked. I look forward to seeing it pass in the Senate.  https://t.co/Ci7xnXzQ2V https://t.co/wkpy9bm7Cn","date":"Fri Mar 11 22:00:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"When Biden came into office inflation was 1.4%. Now it's at 7.9%—HIGHEST in 40 years. Americans are taking a big pay cut due to Biden &amp; Pelosi's extravagant spending.\nGasoline ⬆️ 38%\nEnergy ⬆️ 25.6%  \nUsed cars ⬆️ 41.2%\nBacon ⬆️ 18.8%\nFurniture ⬆️ 17.1%\nAirfares ⬆️ 12.7%","date":"Fri Mar 11 19:01:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I share grave concerns w/ both R &amp; D colleagues on where the Admin is going w/ Iran. We can NEVER legitimize an Iranian nuclear weapon, nor can we ignore Iran is the #1 exporter of terror, or the 1000s of ballistic missiles pointed at Israel &amp; our Allies. https://t.co/U8LgWnbRKW","date":"Fri Mar 11 17:35:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Removing sanctions for a loose nuclear deal that allows Iran to hide its undeclared nuclear activities is a display of weakness and naivete that we have seen repeatedly from this Administration. https://t.co/OKfUTOOUtl","date":"Fri Mar 11 16:30:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The average U.S. household spent $3,500 MORE in 2021 due to inflation, according to a Penn Wharton University of Pennsylvania Budget Model analysis.\n\nInflation is now at 7.9% —the HIGHEST in 40 years. Americans are suffering under Biden's policies. https://t.co/0NIIBJzMVm","date":"Fri Mar 11 13:32:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@RichSpence10 @All435Reps Yup… they’re putting up roadblocks.","date":"Fri Mar 11 12:54:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Indiscriminate bombing of cities is a war crime. Bombing hospitals is a war crime. The Biden Admin should be facilitating, vice preventing, transfer of MIG-29s and SU-25s to Ukraine as well as the S-300 air defense systems. Ukrainians know how to operate this equipment.","date":"Fri Mar 11 12:51:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Biden Admin hopes you forget this. \n\nWashington Post in Jan 2021: “Biden administration puts freeze on federal fossil fuel leases and permits.” https://t.co/F5oD6uZoUc","date":"Thu Mar 10 22:53:20 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"NO country should be selling weapons to Iran, who is STILL the #1 exporter of terrorism. I introduced H.R. 857 to restore these sanctions and limit Iran’s malign influence in the Middle East. https://t.co/bztfcWy5yk https://t.co/lgPD8WgPDD","date":"Thu Mar 10 21:10:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"\"Our main goal should be to keep forces our forces out of Ukraine and let the Ukrainians fight this, but we should, by all means, give them the weapons they need to defend themselves.\"\n\nWatch my @newsmax interview here ⬇️\nhttps://t.co/CH0cdWvGNM","date":"Thu Mar 10 19:01:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Buying Russian gas props up the thug Putin and his barbaric, unprovoked war on Ukraine. It is time we increase our energy production here at home, which is why I voted in favor of H.R. 6968 to prohibit the importation of energy products from Russia.\nhttps://t.co/14n3f0goX9","date":"Thu Mar 10 17:05:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I’ve been ranked 15th (top 3.4%) by the Lugar Center, the best-known index on rating bipartisanship in Congress! For years I’ve worked across the aisle and introduced bipartisan bills without compromising my beliefs or promises made to #NE02. I will continue these efforts. https://t.co/IJcIimQjGj","date":"Thu Mar 10 15:02:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This article was written 2 days after the inauguration, but now the Biden Admin is trying to pretend it did not happen. \n\nEnergy independence improves our national security &amp; it creates jobs. US energy production is also cleaner  for the environment.  https://t.co/l4SbZ9nA0P","date":"Thu Mar 10 13:31:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The US became energy independent in 2019..1st time since 1952, but Biden’s policies made us dependent once again. It was right to stop buying gas from Russia but wrong for him to look to Venezuela &amp; Iran. Let’s boost US energy production. Energy independence is national security. https://t.co/Ey9Herz0nP","date":"Thu Mar 10 03:19:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We stand with Ukraine 🇺🇦🇺🇸 https://t.co/AcNTm9hLAI","date":"Wed Mar 09 22:15:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@elmax21 Who was invading Ukraine when #44 was President?","date":"Wed Mar 09 21:19:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@deborah_shaul @newsmax Thanks.","date":"Wed Mar 09 21:18:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"\"The CBO says corporate tax receipts leapt 75%. At $370 billion, they easily top where they were immediately before Republicans slashed the corporate rate as part of the Tax Cuts and Jobs Act.\"\n\nInflation is a tax on ALL Americans.\nhttps://t.co/YIq7MqVvRx https://t.co/3WYvXzj9EG","date":"Wed Mar 09 19:15:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@elmax21 The weapons made it to Ukraine by the time the law required. We debated this last election and I won.","date":"Wed Mar 09 16:18:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@elmax21 Actually, it did send weapons. It was #44 who refused to send weapons.","date":"Wed Mar 09 16:04:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Hyde Amendment that protects taxpayers from being forced to fund abortions has been restored.","date":"Wed Mar 09 15:52:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I'm hesitant to back a no-fly zone as it could lead to WW3. Back in December I called on the Admin to send #Ukraine long-range air defense and harpoon missiles. The Admin said they were scared of provoking Russia, even though they knew Russia was planning on invading Ukraine. https://t.co/wAaQiwrp5N","date":"Wed Mar 09 15:05:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Missed last week's tele-town hall? Listen to it here! ⬇️\nhttps://t.co/zcUyr3myJ7","date":"Wed Mar 09 00:40:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Americans are alarmed at the dramatic increase in cyber-attacks on private companies, including the recent ransomware attacks on Colonial Pipeline &amp; the JBS meatpacking facility in NE. Our cyber incident response framework must evolve to match the threat. \nhttps://t.co/smdQ8qRD7L","date":"Tue Mar 08 21:50:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I co-lead the Homeland Security Capabilities Preservation Act, which passed the House yesterday. If another terrorist attack, natural disaster or pandemic occurs, our first responders, non-profits, and public safety personnel must be ready to protect and preserve our communities.","date":"Tue Mar 08 21:21:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I thank #IAFF for meeting with me to discuss my support for the Fire Fighters and EMS Employer-Employee Cooperation Act. Our firefighters in #NE02 work long strenuous hours and protect us by putting themselves in harm’s way every day. I will always support their rights. https://t.co/nweQKsbxoF","date":"Tue Mar 08 20:30:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Biden Administration failed when they refused to give Ukraine higher technology air defense weapons. They didn't want to provoke Russia, but Russia was already planning to invade.\nhttps://t.co/oV60m1PDIK","date":"Tue Mar 08 18:02:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#InternationalWomensDay is a time to reflect on progress made, to call for change, and to celebrate acts of courage and determination by women who have played an extraordinary role in our nation's history and around the world. I salute you. https://t.co/kZkuchnnpf","date":"Tue Mar 08 15:20:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Meanwhile, the Administration months ago asked OPEC to pump more oil, and now hoping Iran and Venezuela can fill gaps if we boycott Russia’s energy exports. Energy independence is a national security priority.","date":"Tue Mar 08 03:36:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BobCall78212885 If the programs remain funded as we all know the Dems really want the deficit is then $3T larger.","date":"Tue Mar 08 03:27:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I have serious concerns about the VA’s ability to implement the PACT Act without negatively impacting veterans already receiving care or waiting for adjudication of pending claims. I support the Senate version, not what was offered in the House.\nhttps://t.co/jlMi3jlxCq","date":"Mon Mar 07 22:10:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@PealTom It isn’t true… the weapons were delivered by the time the law required. #44 refused to send any weapons. Maybe your confused?","date":"Mon Mar 07 21:52:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@marthaevapearl I protect prolife healthcare workers from being forced to do something they know is morally wrong.","date":"Mon Mar 07 21:51:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Acts of violence, harassment, or assault against health care personnel should never be tolerated. I cosponsored H.Res. 909 which requires DOJ to investigate assaults claims on health care personnel and provide adequate resources and support to those impacted. https://t.co/UyeRUBYiDe","date":"Mon Mar 07 20:01:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@gc250 Came from CBO.","date":"Mon Mar 07 18:51:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The same Putin regime conducting an unprovoked invasion in Ukraine is negotiating an Iran nuclear deal on our behalf. It's no surprise this deal erodes US leverage against Tehran, leaves it in reach of a bomb &amp; strengthens Russia-China-Iran trade relations\nhttps://t.co/hviJ9T1QsK","date":"Mon Mar 07 18:02:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Lower Insulin prices would be a great thing! Too bad Biden got rid of a rule enacted by Trump that effectively lowered insulin and epi-pen prices. https://t.co/qpo2wSw6I2","date":"Mon Mar 07 16:02:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Rothoula The Senate passed a bipartisan bill on this unanimously. That’s what Pelosi should have put forward, instead of a bill that won’t get to first base in the Senate.","date":"Mon Mar 07 13:52:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BobCall78212885 Just CBO truth.","date":"Mon Mar 07 13:51:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@see_tina_go I oppose that Biden cut oil production permits and hurt growth of our natural gas infrastructure, so I will point that out… but I’ll fully support an embargo on Russian energy.","date":"Mon Mar 07 04:32:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@debsicurn89 Inflation increased significantly in 2021… not after tax reform.","date":"Sun Mar 06 22:50:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ZombieNinjaSP The Secretary of Treasury under Clinton and the Chief Econ Advisor for Obama says the highly partisan COVID bill did trigger inflation.","date":"Sun Mar 06 22:49:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"A keystone in our local economy. Glad to visit with the CWS team that helps pave “The Road To Omaha.” https://t.co/xxERWXQNog","date":"Sun Mar 06 21:00:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The CBO says Build Back Broke will ADD $367 BILLION to the deficit. If the programs stay funded, it will add $3 TRILLION to the deficit. How will the President not raise taxes on middle class Americans? Experts say it is just not realistic. https://t.co/hqvbhICEbP","date":"Sun Mar 06 18:01:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"March is #NationalNutritionMonth, and as Ranking Member of the House Ag Committee’s Subcommittee on Nutrition, Oversight, &amp; Department Operations, I plan to make nutrition and domestic food assistance programs more efficient and effective for families most in need. https://t.co/GznduBdQe2","date":"Sun Mar 06 15:00:50 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"An estimated 5.3 million Americans are living with a TBI-related disability. As Co-Chair of the TBI Task Force, I support #BrainInjuryAwarenessMonth, and I'm committed to raising awareness, increasing funding, and finding ways to treat TBI. https://t.co/bFTsktgkju https://t.co/wQNaO9JKny","date":"Sat Mar 05 22:00:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Biden wants businesses to “lower your costs, not your wages.” Higher costs = higher prices for consumers. The average family has $300 less buying power every month due to inflation. That’s a pay cut.","date":"Sat Mar 05 19:00:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Farmers and ranchers in Nebraska and across the country are #StillFarming in order to meet the demands of all Americans.\n\nThank you to the #EverydayHeroes serving on the frontlines of our food supply chain. #ThankAFarmer https://t.co/gG3KDG01BE","date":"Sat Mar 05 16:01:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@niceguym @debsicurn89 Throwing $1.9T into the economy was bound to be inflationary. We didn’t need Larry Summers to tell us, but he did and Biden and Pelosi ignored.","date":"Sat Mar 05 12:55:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@debsicurn89 @PealTom The average family has lost $300 in buying power a MONTH. That is a pay cut.","date":"Sat Mar 05 05:01:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@debsicurn89 Inflation was low during last Admin… it went up after the ARP just as Larry Summers said it would.","date":"Sat Mar 05 04:41:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@debsicurn89 Not according to Larry Summers, Sec of Treasury for Clinton and Economic Advisor to Obama. He said the last so-called COVID bill would trigger inflation and he was right.","date":"Sat Mar 05 04:25:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@sun_dawg1 You can’t hear the truth enough!","date":"Sat Mar 05 04:05:50 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Biden said the American Rescue Plan was a significant boost to the economy that “helped working people and left no one behind,” but this sudden geyser of federal cash contributed to the worst inflation seen in over 40 years.","date":"Sat Mar 05 00:01:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Guess where I was today? 👮🏼‍♂️ https://t.co/RmZHwt83JG","date":"Fri Mar 04 23:47:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Guess where I was today? ⚾️ https://t.co/zoYJt9ULj9","date":"Fri Mar 04 23:03:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Enjoyed meeting with @NebPublicMedia today. I received an update on what they're doing to promote education, public safety, and civic leadership through their services. I appreciate and thank them for keeping Nebraskans informed and connected. https://t.co/OYlRHF32i0","date":"Fri Mar 04 21:15:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"CLAIM: Biden said he created 6.5 million new jobs.\n\nTRUTH: 6.5 million people returning to work following pandemic lockdowns is not the same as creating 6.5 million new jobs.","date":"Fri Mar 04 19:01:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Want to buy American, Mr. President? Stop buying Covid-19 rapid tests from China.\n\nCan you get a refund on the $1.3 BILLION you already spent?","date":"Fri Mar 04 17:20:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Looks like POTUS’s solution for gas prices is to turn from the world’s biggest war criminal to the #1 sponsor of terrorism. #BuyAmerican, except energy??\n\nAmericans are better than this, Mr President. #KeystonePipeline \nhttps://t.co/viU6AId9CJ","date":"Fri Mar 04 15:01:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JazariKual Sounds like you’re a bad choice. https://t.co/iTFu2hpgl6","date":"Fri Mar 04 03:31:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CRagole This House burn-pit bill is DOA in Senate. Speaker Pelosi took a bill that passed unanimously in Senate and shoved it full of her agenda. Now… it is questionable if any bill passes. Terrible governance.","date":"Fri Mar 04 03:30:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BBBMblog It was an IRS interpretation, and no one intended to raise taxes on gold stars. And… we fixed it.","date":"Fri Mar 04 03:24:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BBBMblog We got that removed.","date":"Fri Mar 04 03:19:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I support the bipartisan Senate burn-put bill. The Senate passed this Veterans’ bill UNANIMOUSLY. Did Pelosi put this bill up for a vote? No. She loaded the House bill with her agenda &amp; it will not see light of day in Senate. Pelosi’s partisanship hurts, not helps our veterans.","date":"Fri Mar 04 02:50:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb Pelosi failed our veterans by not putting the bipartisan Senate bill that passed unanimously. Playing games with our veterans are wrong.","date":"Fri Mar 04 02:44:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JudysGarden @JeffFortenberry @RepAdrianSmith The bipartisan Senate bill is better and it passed Senate unanimously. The House won’t see light of day in Senate. Pelosi had opportunity to pass a great burn-pit bill but decided to play games instead.","date":"Fri Mar 04 02:26:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CRagole Senate bill was unanimous… the House bill will never see light of day.","date":"Fri Mar 04 02:24:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@audiomagnate @McBennett319 I’ll vote for the better Senate version. The bipartisan Senate bill passed unanimously. Pelosi should have put this up for a vote, instead she packed the House bill with her agenda items, and it won’t see light of day in Senate.","date":"Fri Mar 04 02:23:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Biden claimed that former President Donald Trump’s tax cuts only benefited the rich, but they actually increased worker earnings and opened up job opportunities across the board. We had the strongest economy in 40 years until COVID hit. https://t.co/caO2Pp2Vzl","date":"Fri Mar 04 00:05:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Missed last night's tele-town hall? Listen to it here! ⬇️\nhttps://t.co/zcUyr3myJ7","date":"Thu Mar 03 22:01:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@FuryofKahless @Amy0227 @CraigCaplan The House should have passed the Senate bill that was unanimous. But, Pelosi loaded her bill up with her agenda. The real issue is that Pelosi sacrificed a burn-pit bill that passed unanimously in the Senate… blame her.","date":"Thu Mar 03 21:41:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@lonedaisymedia @JeffFortenberry @RepAdrianSmith The House leadership could have put the Senate version up and it would have passed. The burn pit portion is great. But House leadership decided to load the bill up with its agenda, and its DOA in the Senate. We will push for Senate version.","date":"Thu Mar 03 21:39:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@PeggyYoungMcco1 @sgleeper I’ll vote for Senate version. Their bill was bipartisan and more responsible legislation. The House bill won’t get to first base in Senate.","date":"Thu Mar 03 21:32:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@lonedaisymedia @JeffFortenberry @RepAdrianSmith I’ll vote for the Senate bill. The Senate bill is bipartisan and more responsible. The House bill will never pass the Senate. If we want to make an impact on burn pits, then House better put the Senate version up for a vote.","date":"Thu Mar 03 21:31:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@thekevincharles Sounds like you approve of financing Putin’s actions in Ukraine. Most Americans are not.","date":"Thu Mar 03 21:24:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Senate version is better and I’ll vote for that. The Senate bill was put together in bipartisan way and more responsible bill.","date":"Thu Mar 03 21:22:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Baltic states want American military presence to strengthen deterrence. The best way to keep the peace for our NATO friends that border Russia is to show strength and resolve against bully Putin.\nhttps://t.co/q7fZdTeswT","date":"Thu Mar 03 20:01:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"For #WomensHistoryMonth, I honored Carol McBride Pirsch, who served 18 years in the Nebraska State Legislature and 8 years on the Douglas County Board of Commissioners. She has worked across the aisle to reduce violence, advocate for crime victims, and support women in #NE02. https://t.co/bOTGgu3pG5","date":"Thu Mar 03 18:00:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Want to buy American Mr. President? STOP BUYING RUSSIAN ENERGY!! https://t.co/fD5MeTmDtx","date":"Thu Mar 03 17:10:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you @NeCGA for meeting with our DC staff to talk about issues farmers are facing this year—like fertilizer companies charging farmers 3X the cost it should be. It's time we lift these tariffs and get back to putting fresh, nutritious, and affordable food on the table. https://t.co/69GKcYB8hd","date":"Thu Mar 03 16:03:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Happy Birthday @navy_reserve! Formed in 1915 in response to the outbreak of WWI, the Navy Reserve made up nearly 84% of the Navy's fighting force during the war.\n\nWe salute these sailors for their ops in deterrence, sea control, humanitarian assistance &amp; disaster response. 🇺🇸 https://t.co/auD53UrmQW","date":"Thu Mar 03 14:02:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@ChicagoCarol @All435Reps I pray for Ukraine’s victory.","date":"Thu Mar 03 05:03:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@DIPetersen I read your comment… not sure your intent or meaning. But, I’ll stick with my message that Putin is waging a evil war and America must stand on right side.","date":"Thu Mar 03 05:02:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@HiVanillaSky They’re watching closely.","date":"Thu Mar 03 04:40:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@craydaysinusa You are discombobulated. Out intel has been good on Ukraine… but the CR is hurting our military and undermining us with China. We will make the majority answer for this.","date":"Thu Mar 03 04:39:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Earthmudder Perhaps your folks should stop calling themselves Dem Socialists. I believe them when they say it.","date":"Thu Mar 03 04:38:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@4leafcloverBigO Don’t hyperventilate… it’s dangerous for you.","date":"Thu Mar 03 04:23:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Glburke3 I try to, but grateful the majority voted for me x3.","date":"Thu Mar 03 04:22:55 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Earthmudder We aren’t going to support Dem Socialist policies.","date":"Thu Mar 03 04:21:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@CRagole BS… I was big supporter of USMCA.","date":"Thu Mar 03 04:19:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Watching the news tonight and we see Russian crimes against humanity, a pariah state. Thug Putin is a war criminal. He’s waging an unprovoked &amp; unjust war, and conducting indiscriminate bombing of citizens. We should have zero tolerance for Putin &amp; Russia’s oligarchy leadership.","date":"Thu Mar 03 04:17:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to everyone who joined our tele-town hall tonight! We had nearly 6,000 people tune in. I appreciate all of those who asked questions and listened online. As always, I enjoy representing the great people of #NE02.","date":"Thu Mar 03 01:33:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: GI Benefits Bill\nA: There is a disparity between how the Guard and Reserves are treated. There has been pushback, but I sided with our guards and reserves on this issue. I value their service &amp; what they do for the US. There needs to be parity when it comes to these benefits.","date":"Thu Mar 03 01:26:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: What will get our country back on track? (pt2)\nA: The Biden Admin talks very little about trade. We need to fight to open trade doors back up and fight for our farmers and ag producers. We also need to maintain the tax code that helps us compete with other countries.","date":"Thu Mar 03 01:22:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: What will get our country back on track?\nA: Inflation is the #1 issue. We have to get spending under control. Before COVID, our pay was increasing faster than inflation. We also need to look at increasing jobs in the trades. These are outstanding jobs.","date":"Thu Mar 03 01:22:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Securing Elections\nA: The Constitution protects state’s election laws. I voted against H.R. 1 which would federally fund congressional campaigns and cost the taxpayer billions of dollars. I believe Nebraska’s elections were accurate, but we can always push for more security.","date":"Thu Mar 03 01:17:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Climate Solutions\nA: No matter your views, we want to leave a better world for the next generation. I supported the wind/solar tax credits. Carbon capture technologies and battery storage are vital to improving our environment. Energy independence is top priority.","date":"Thu Mar 03 01:06:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Medicare\nA: I agree that we should be able to negotiate these prices. It takes too long to get generic drugs on the market. We have the best research for pharmaceutical research…however Americans pay for this. We need to do better with this and help more people.","date":"Thu Mar 03 01:03:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Inflation\nA: Last March, we passed the $1.9T COVID bill. We were warned that it would trigger inflation. We added about 10% to the money supply with no way to pay it. Larry Summers also warned us about BBB. Congress has to REIGN IN spending &amp; stop the massive deficit spending.","date":"Thu Mar 03 00:56:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Ukraine\nA: Bullies don’t stop unless they get scared. We need to continue helping Ukraine and giving them the tools they need to fight, but I've been impressed with their pride and bravery. For decades they’ve been fighting and preserving their freedom and independence.","date":"Thu Mar 03 00:52:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Afghanistan (pt3)\nA: The President also failed to address this last night. This was NOT a success. This was a strategic failure.","date":"Thu Mar 03 00:49:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Afghanistan (pt2)\nA: The President called this a “success” and he had no regrets. We lost 13 servicemen. Thousands of lives lost and interpreters are still being hunted down. They were owed better by this. Our adversaries are emboldened. Putin&amp; Xi are watching.","date":"Thu Mar 03 00:48:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Afghanistan\nA: I deployed four times to the Middle East. This is personal to me. […] We’ve been providing a ton of air power to Afghanistan. We trained Afghan pilots and they were doing a good job. But the withdraw moved our pilots/mechanics.","date":"Thu Mar 03 00:47:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Energy Independence\nA: Many bases in Europe use Russian gas. If you remove their energy, these bases will struggle. We should not be dependent on them. […] POTUS’ EO cancelling the Keystone XL Pipeline cost thousands of US jobs &amp; increased the safety risk of transporting fuel","date":"Thu Mar 03 00:40:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Renaming Bases\nA: We have 10 bases named after confederate generals..some affiliated w/ the KKK. I don’t think it’s appropriate. I suggested renaming a base after Fort Benavidez, a soldier who was wounded 31 times while rescuing 8 fellow soldiers. He is a TRUE American hero.","date":"Thu Mar 03 00:32:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Infrastructure\nA: Nebraska will receive about $2.5B to maintain and repair roads and highways...including $216M for two programs that provide low-interest loans for building or improving water &amp; wastewater systems. It was also based on per-capita.","date":"Thu Mar 03 00:24:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Q: Russian Oil\nA: We’ve gone backwards in energy production his past year—we’ve become a net importer, and gas prices have gone up […] We will have to increase our production again and cut Russian exports, and the rest of the world can accommodate.","date":"Thu Mar 03 00:20:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Last night, the President spoke on how to address the environment &amp; energy. However, he completely failed to address that increasing America’s energy production &amp; natural gas infrastructure would help regain America’s energy independence and counter Russia’s energy exports.","date":"Thu Mar 03 00:14:56 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The US will give Russia $70M today to purchase their oil… we will be doing this everyday until we decide to stop buying their energy exports. We must sanction Russian energy and cut off their main source of income.","date":"Thu Mar 03 00:13:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Putin is saying \"might makes right.\" He is a bully and a thug. We need to work with our NATO allies and work together to deter Russian aggression and stand against Putin.","date":"Thu Mar 03 00:10:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"We are LIVE! I look forward to hearing from the people of #NE02. \n\nCall (855) 920-0558 to ask a question or listen LIVE at https://t.co/ZXqnmyeAdv. https://t.co/XDmKlXLz2b","date":"Thu Mar 03 00:08:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our tele-town hall starts in about 15 minutes! To ask questions, call (855) 920-0558 or listen LIVE at https://t.co/ZXqnmywbC5. https://t.co/dSSDplsJNV","date":"Wed Mar 02 23:46:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Ukrainian Ambassador Oksana Markarova’s leadership and advocacy for the Ukrainian people is admirable. The US will continue to do everything in its power to isolate Russia, economically and diplomatically. #StandWithUkraine https://t.co/LYt3Yd07dV","date":"Wed Mar 02 21:08:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Just listened to a closed briefing on new Chinese military weapons that are being fielded. We are in a 6 month Continuing Resolution that is undermining our research, development &amp; fielding of new technologies. Democrat controlled DC is hurting our national security.","date":"Wed Mar 02 19:17:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Benzoni4NE Further, the authorization bill cannot be spent without the appropriation bill passed… and that has not happened.","date":"Wed Mar 02 18:21:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Benzoni4NE You’re not accurate. We are five months, going on six, late on passing a budget, necessitating a continuing resolution. It’s terrible governance.","date":"Wed Mar 02 18:20:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The United States Congress stands with the brave people of Ukraine! 🇺🇸🇺🇦 https://t.co/tno94sv39l","date":"Wed Mar 02 18:02:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"5 months into the fiscal year, the Democrat controlled Congress still hasn't passed an appropriations bill. This is INDEFENSIBLE. The Pentagon is pleading for help...how do we standup to Putin, Xi, Khamenei &amp; Kim without a defense budget? Enough is enough! #NoMoreCRs","date":"Wed Mar 02 15:10:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@aksarben399 Yet, he supports removing qualified immunity.","date":"Wed Mar 02 11:49:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The events of the past year have provided a stark reminder that the policies of the party in power affect the peace and prosperity of all Americans. I applaud the recent sanctions taken against Russia by the Administration, but they're not enough.\nhttps://t.co/BbtxkWmwFp","date":"Wed Mar 02 04:34:22 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Putin is desperate, but we've got to stay resolute. We should be doing everything we can to cut Russia off at the knees economically and domestically.\n\nWatch my full @newsmax interview here. ⬇️\nhttps://t.co/IxpOnWeGXo","date":"Wed Mar 02 00:01:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Russian Oil is stained with Ukrainian blood. We are buying $70M (article says $15M) from Russia propping up Putin and his barbaric war. Further, Putin is acting like a cornered rat, and we must remain resolute.  https://t.co/IxpOnWeGXo","date":"Tue Mar 01 23:17:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Putin is tyrannical and bull-headed and the only way to show him that the rest of the world means business is to kick them out of SWIFT completely. While the measures taken so far by the president are good, they are not near enough. https://t.co/3BCKLrAhJl","date":"Tue Mar 01 22:01:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Enjoyed talking with @FoxNews, @JustTheNews, @WashTimes, and the @FreeBeacon today at the House GOP media row! We covered everything from Ukraine, Afghanistan, inflation, to the SOTU, and much more. https://t.co/34VLMIzSF9","date":"Tue Mar 01 20:30:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"REMINDER: I will be hosting a tele-town hall TOMORROW, March 2nd, at 6:05 p.m. CST! To ask questions, call (855) 920-0558 or listen LIVE at https://t.co/ZXqnmywbC5. https://t.co/P1i8AwxIUh","date":"Tue Mar 01 19:40:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The US will give Russia $70M today to purchase their oil… we will be doing this everyday until we decide to stop buying their energy exports. We must sanction Russian energy and cut off their main source of income. Every barrel of oil is stained with Ukrainian blood.","date":"Tue Mar 01 15:34:50 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"On March 1, 1867, Nebraska was admitted to the Union as the 37th state. Today, we celebrate 155 years of statehood. There really is no place like #Nebraska! https://t.co/T9GM08uXTE","date":"Tue Mar 01 14:02:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JenniferSall Evidently you didn’t read my comments.","date":"Tue Mar 01 14:00:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@IanMSwanson1110 @KeithRoragen Weapons still got to Ukraine by the time required by the law.","date":"Tue Mar 01 14:00:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@KeithRoragen @IanMSwanson1110 Poor Keith, you have your facts wrong. But I forgive you.","date":"Tue Mar 01 12:21:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@jevelwedding Especially those “yes men” ones who don’t think for themselves.","date":"Tue Mar 01 12:20:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Commentary We cannot let a bully intimidate… Thug Putin will keep demanding more unless we stand up to him.","date":"Mon Feb 28 17:33:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#BlackHistoryMonth https://t.co/qvUOE0H5rQ","date":"Mon Feb 28 15:01:51 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@yologiantsfan I put fear in the opposition!","date":"Mon Feb 28 13:50:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Putin’s army is indiscriminately shelling cities and murdering civilians. Putin is a thug and leading a pariah state, and we must treat him as such.","date":"Mon Feb 28 13:27:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"It is an embarrassment for United Nations to have Russia on UN Security Council and to have Russia now chairing it. The UN mission is to foster peace, meanwhile Russia has invaded its neighbor, indiscriminately shelling cities and murdering civilians. https://t.co/bkvKPP7vNT","date":"Mon Feb 28 13:24:25 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@DIPetersen @USMC The Baltics provided some this past month, and Ukraine has shot down approx a dozen aircraft. I’m sure they could use some Devil Dog instructors though!!!!","date":"Mon Feb 28 12:33:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Jstnorv10 @All435Reps At least the Baltic countries has some spine and sent some Stingers last month.","date":"Mon Feb 28 04:59:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Jstnorv10 @All435Reps I’m showing that Americans are disgusted.","date":"Mon Feb 28 04:58:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Jstnorv10 @All435Reps Oh, by the way, 37% of Americans approve of job Biden has done regarding Ukraine. A stronger response months ago may have deterred this mess.","date":"Mon Feb 28 04:46:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Jstnorv10 @All435Reps He invaded despite the Stingers not being sent. Now, The decision weakened Ukraine, and undermined deterrence. The Admin response was WEAK.","date":"Mon Feb 28 04:43:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This is good move, but should have been done months ago. Ukraine needs the Stingers.","date":"Mon Feb 28 04:31:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Drug overdose deaths in the U.S. surpassed 100,000 in 2021, more than any previous year. Fentanyl overdoses has now been attributed to being the leading cause of death for Americans aged 18-45. We need to pass the HALT Fentanyl Act now. https://t.co/L0s8rwwysX","date":"Sun Feb 27 22:00:43 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@theO_NE @sharp_tail @vince_powers I repeat what others have said: Georgetown rates me in top 3.5% in Congress for bipartisanship and Common Ground rates me #1. They may have better insight than hyper partisan Dems such as you and Vince.","date":"Sun Feb 27 14:19:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I will be hosting a tele-town hall on March 2nd, at 6:05 p.m. CST! I look forward to talking with the great people of #NE02.\n\nTo ask questions, call (855) 920-0558 or listen LIVE at https://t.co/ZXqnmywbC5. https://t.co/1vmykLwcXM","date":"Sun Feb 27 14:01:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@pseudobbs I don’t like socialism.","date":"Sun Feb 27 07:32:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@AJCarey29 @All435Reps Multiple airlines fly out of Russia.","date":"Sun Feb 27 06:49:45 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@sharp_tail @vince_powers The alternative was worse.","date":"Sun Feb 27 06:42:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@AJCarey29 @All435Reps They can fly on a different airline.","date":"Sun Feb 27 06:42:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@AJCarey29 @All435Reps No, we want to sink their economy. Americans can fly other nation’s airlines. Don’t be weak.","date":"Sun Feb 27 06:38:35 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@debsicurn89 We can do two priorities at once. There is a border crisis and the President owns it.","date":"Sun Feb 27 06:36:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@pseudobbs I don’t like Dem Socialism.","date":"Sun Feb 27 06:35:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The free world should say no to all Russian airlines. We don’t want them. Keep them grounded.","date":"Sun Feb 27 06:33:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@anthonyzarzycki Oh… and yesterday the President SWIFT actions weren’t necessary… I’m guessing he learned he was in error today. I’m glad to find his backbone for him.","date":"Sat Feb 26 22:44:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The right decision… this is no time for halfway measures. The Russian economy must have its legs knocked out from underneath it, and the nation needs to be isolated diplomatically. That’s how pariah states are treated.","date":"Sat Feb 26 22:43:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@anthonyzarzycki I asked for air defense and anti shipping weapons to be sent to Ukraine last Dec and Jan… and the Admin failed to send what was needed for deterrence. I’m glad it is catching up on appropriate sanctions, and I’m glad to keep pushing them to do right.","date":"Sat Feb 26 22:36:15 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The President’s open border policies have allowed fentanyl to flow across our southern border and into our communities.\n\nIn 2021, enough fentanyl was confiscated by CBP to kill EVERY American nearly SEVEN TIMES over.\n\nWe must strengthen border security…not dismantle it. https://t.co/9QKh2DVqs7","date":"Sat Feb 26 21:20:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Mr President: it's not too late to do the right thing and lead from the front #KickRussiaOutofSWIFT\n@POTUS #LeadFromTheFront https://t.co/PVKTnz9lbj","date":"Sat Feb 26 19:47:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Cancer has struck millions of American families, including mine. Having access to intensive early detection, individuals are able to address and treat cancer earlier on. I have signed on to H.R. 4110 as this bill provides those with inherited mutation access to early treatment. https://t.co/oBJRMUp1aW","date":"Sat Feb 26 18:01:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"“The Russians won’t like it, and that’s just too bad.” #Velshi","date":"Sat Feb 26 17:51:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JimHarroldOmaha Colonel, you may want to keep up on the news… the Europeans have largely agreed to the SWIFT actions overnight. You’re the one with partisan knee-jerk reactions.","date":"Sat Feb 26 16:37:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Many Russians know the actions of Putin are crimes, immoral and that he deserves to be kicked out of power and held accountable. May more Russians stand up to this thug and bully. We need more Dietrich Bonhoeffers who stood up to evil.","date":"Sat Feb 26 16:32:34 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@sgleeper @BrennanKC I was on MSNBC this morning. https://t.co/D6FYE6h66T","date":"Sat Feb 26 16:10:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb @JeffFortenberry @RepAdrianSmith I’m grateful for the pro-life women leaders like Senator Fischer, Mayor Stothert and so many in the Unicameral. I proudly stand with them.","date":"Sat Feb 26 16:10:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@himm7 They do need to step up.","date":"Sat Feb 26 16:08:18 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JonBlumenthal @Cernovich Thank you.","date":"Sat Feb 26 16:07:38 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@AdamTheRed Obviously you don’t read much news. You’re misinformed.","date":"Sat Feb 26 16:07:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@randyessex Europe has largely embraced taking this measure too overnight.","date":"Sat Feb 26 16:05:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@sgleeper Yet, #45 did send lethal aid to Ukraine after #44 refused to. Facts are hard for the Far Left.","date":"Sat Feb 26 15:44:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@elmax21 @BigHeartedGuy @AliVelshi @AliVelshiOT @MSNBC @RJonesNews @SpeakerPelosi You must not be reading the news… you’re misinformed.","date":"Sat Feb 26 15:33:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BHVos Overnight, the European countries favor booting Russia off of SWIFT. It’s time for 100% sanctions and isolation. No more one foot in and one foot out.","date":"Sat Feb 26 15:32:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@BHVos I appreciate the support of the clear majority of our constituents! Thank you.","date":"Sat Feb 26 15:26:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thug Putin and the invading Russians don’t get it. During the Soviet era, millions of Ukrainians were murdered. Millions. Ukrainians treasure their independence and self-governance, and dread the thought of living under heel of the Russians again.","date":"Sat Feb 26 15:24:46 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Riskworks Javelins arrived within the time the law required.","date":"Sat Feb 26 15:07:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@redconmike I do agree we need to increase our production and become a net exporter of energy again… like we achieved 2 years ago, but unfortunately lost last year.","date":"Sat Feb 26 15:07:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#BlackHistoryMonth https://t.co/tmxa9c6pL9","date":"Sat Feb 26 15:01:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Biden on SWIFT: wait a month, see if sanctions are working.\n \nUkraine doesn't have a month, Mr President.\n \nSanction Russia Central Bank &amp; full financial sector, crack down on Russian energy and deSWIFT NOW. Putin needs to feel the pain NOW https://t.co/XFBYO9X7Kf","date":"Sat Feb 26 14:51:57 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Rebecca28049528 That’s why he invaded during Obama’s and Biden’s Administrations. Got it.","date":"Sat Feb 26 13:16:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you Prime Minister Kallas. The Free World should seek to isolate Russia in every way. That’s how a pariah state is treated. #balticsecurity @JBANCchatter","date":"Sat Feb 26 13:09:27 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@VinceKuppig Bad ones.","date":"Sat Feb 26 04:54:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@sgleeper No, Biden did too little the last 3 months. I look forward to debating and making this case","date":"Sat Feb 26 04:50:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@VinceKuppig I have… work harder.","date":"Sat Feb 26 04:45:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Ukrainian patriots fight for their nation and freedom. They don’t forget that Stalin murdered 3.9M Ukrainians alone. America stands with freedom. #freedom","date":"Sat Feb 26 04:41:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Kay_wise I served with him. I don’t always agree with him, but I respect him.","date":"Sat Feb 26 04:24:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Someday Putin will meet Justice… and he won’t like it.","date":"Sat Feb 26 04:15:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@VinceKuppig And, you tell the socialists. Most in our party agree with me.","date":"Sat Feb 26 04:13:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@tdub909 Thank you!","date":"Sat Feb 26 04:12:09 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Russians are killing innocent Ukrainians by order of the Thug Putin. We want justice. Some day Putin will meet justice.","date":"Sat Feb 26 03:52:39 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Russians should feel ashamed of the unprovoked military attack on their neighbor by their thug leader Putin… and let him know it. Kick him to the curb and out of power.","date":"Sat Feb 26 00:57:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Boy’s Town Vocational School helps students learn a trade as they prepare to enter the workforce.After graduation, Boys Town Students can apply to participate in the  Hilltop After Care Program, which provides housing, while they finish post-high school education. https://t.co/qo9l2zSRHE","date":"Sat Feb 26 00:01:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you to Madonna Rehabilitation Hospital for inviting me to tour their Omaha facility today. We discussed the many services they provide for children and adults across our nation. I also learned about the research they're leading to address the long-term effects of COVID. https://t.co/Ar7gC3colZ","date":"Fri Feb 25 21:05:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@justinkemerling @janekleeb @KeithRoragen @mazour1975 I’m glad I voted against $7T in crazy liberal spending.","date":"Fri Feb 25 20:40:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thank you @MariaBartiromo for having me on this morning to discuss the latest on Ukraine and Russia. Not only do we need to isolate the Russian pariah state, we need to keep sending weapons and intelligence support to our Ukrainian brothers and sisters.\nhttps://t.co/8AVgbL6t2T","date":"Fri Feb 25 16:35:04 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"As co-chair of the TBI Taskforce, I  value the expertise &amp; insight from local organizations that specialize in #TBI. I enjoyed talking with the Brain Injury Alliance of Nebraska, Integrated Rehab, QLI-Omaha, &amp; our Omaha VA on ways we can mitigate &amp; treat those suffering from TBI. https://t.co/IS3j8uicMJ","date":"Fri Feb 25 16:03:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This week is #NationalFFAWeek! Nebraska's FFA students and members play a major role in shaping the next generation of farmers and agriculture leaders in our state. They are the future of agriculture. Thank you for all that you do! https://t.co/JgJkMMCirU","date":"Fri Feb 25 14:03:26 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The world admires the bravery of Ukrainians. They are fighting for freedom from the Russian Bully. The Free World must keep sending weapons &amp; intelligence support to our Ukrainian brothers &amp; sisters. Ramp up economic sanctions to 100%. Isolate the Russian pariah state.","date":"Fri Feb 25 04:52:19 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@janekleeb @KeithRoragen @mazour1975 We’ll oppose the $5T bill you want and $3T in new deficits. You own the inflation rate.","date":"Fri Feb 25 03:07:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@KeithRoragen @mazour1975 @janekleeb Inflation left people worse off though.","date":"Fri Feb 25 00:12:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Belorussia should also feel the same weight of economic sanctions and diplomatic isolation for enabling the Russian invasion through its territory. It deserves to be treated as a pariah like Russia.","date":"Thu Feb 24 21:45:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great meeting with Wayne Brown, interim President of the Urban League of Nebraska. We had a great discussion on expanding educational and job training opportunities in Nebraska. I appreciate his military service and ongoing work in our #NE02 community. https://t.co/uvopCgiuka","date":"Thu Feb 24 21:30:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Met with Darling Ingredients leadership at their plant in Bellevue. I enjoyed hearing how they collect and repurpose animal-based co-products that would normally be thrown away. We also discussed the Renewable Fuel Standard Program, trade policy, and infrastructure. https://t.co/qN2v37NrxQ","date":"Thu Feb 24 19:15:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I will be hosting a tele-town hall on March 2nd, at 6:05 p.m. CST! I look forward to talking with the great people of #NE02.\n\nTo ask questions, call (855) 920-0558 or listen LIVE at https://t.co/ZXqnmywbC5. https://t.co/hxPCQzdoH9","date":"Thu Feb 24 17:01:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The space domain supports critical navigation, missile warning and communications for all military services. Under a continuing resolution @SpaceForceDoD loses 2 of 5 space launches &amp; further transfer of personnel and missions come to a halt #NoMoreCRs https://t.co/lrQyPS0pte","date":"Thu Feb 24 15:01:41 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@tdub909 @SaraLSirota That’s why we need to oppose the far left agenda!","date":"Thu Feb 24 14:00:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@KeithRoragen That’s what the Far Left says anyway.","date":"Thu Feb 24 13:16:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I stand with the Ukrainians who want their independence and freedom. Shame on Putin and Russia","date":"Thu Feb 24 06:00:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SaraLSirota We should have provided air defense and anti-ship weapons capabilities to Ukraine. We failed deterrence by not doing so.","date":"Thu Feb 24 05:14:47 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@redconmike Saddening.","date":"Thu Feb 24 04:49:49 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"It is obscene reality that Russia now Chairs the UN Security Council. We should kick the Russians out of as many international organizations and forums as possible. Russia is a pariah state and should be treated as such.","date":"Thu Feb 24 04:39:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@phatgalactus Russia didn’t attack Crimea, Donbas or the rest of Ukraine during #45’s tenure.","date":"Thu Feb 24 04:03:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@bgdadx4 You’re silly.","date":"Thu Feb 24 04:01:58 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SweetJMichael People deserve to hear the truth.","date":"Thu Feb 24 04:00:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Further, while Ukraine has means and will to resist, we should continue to give them the weapons they need to fight back. Putin should be made to pay dearly for this reprehensible war of choice.","date":"Thu Feb 24 03:59:13 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Thug Putin initiated unprovoked war of aggression to force Ukrainians, who want independence, to live under Russian domination. Russia is a pariah state &amp; must be cut off economically &amp; diplomatically. Bullies only respect strength so we must build up our defenses w/our Allies.","date":"Thu Feb 24 03:52:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Putin continues to set tempo while we react. Deterrence requires credible imposition of cost; vague red lines aren’t enough. After Biden blocked pipeline sanctions in Senate, House GOP intro’d HR 6742 to impose cost on Putin &amp; boost assistance to #Ukraine. https://t.co/3W6BDJX2V5","date":"Thu Feb 24 00:10:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I asked senior members of the  Administration why they didn’t provide air defense capabilities to Ukraine. I was told they “feared it would provoke the Russians.” This was a sign of weakness and this failure undermined deterrence.","date":"Thu Feb 24 00:06:06 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I agree. Let’s send the Oligarchs’ kids packing and back to Russia. Russia is a pariah state and the thugs ruling it should be treated that way. \nhttps://t.co/QnA3LUNwoV","date":"Wed Feb 23 22:35:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"New constituent Tyler Mosher is the daughter of Overland Park Police Officer Mike Mosher who was killed in the line of duty in May of 2020.  We discussed how to better support law enforcement and the families our fallen heroes leave behind. https://t.co/5Q6Je71Pdk","date":"Wed Feb 23 20:02:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"For African American History Month, I recognized Willie Barney for his work in the community and his heart for service. Willie was nominated by my selection board, which includes Thomas Warren, Terri Sanders, Marcus Bell and Eric Ewing.  Watch the speech https://t.co/Rl1aHI6ird https://t.co/EzyNkAwtr2","date":"Wed Feb 23 16:03:23 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#BlackHistoryMonth https://t.co/LcLvmXlQhw","date":"Wed Feb 23 14:03:10 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Congratulations to Dennis Pate, President and CEO of the Henry Doorly Zoo on his retirement. For 13 years, he has made the zoo a staple in #NE02 and throughout Nebraska. We thank him for his service and wish him the best on his next endeavor. https://t.co/8pjn7KOtfX","date":"Tue Feb 22 21:00:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#BlackHistoryMonth https://t.co/zmOumJK9wW","date":"Tue Feb 22 15:01:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Looking forward to a great day in district! We have seven different events, covering North, South, East and West of #NE02.","date":"Tue Feb 22 14:37:48 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Congress has led the way pressing the Pentagon to make electronic warfare a priority. DoD continues to admire the problem but America’s adversaries are not waiting for us. It is time for action. #ElectronicWarfare #JEMSO @AOCrows\nhttps://t.co/dQRZlNcCMC","date":"Tue Feb 22 13:01:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@DentonDanO @JJones6512 I look forward to debating it.","date":"Tue Feb 22 11:01:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@JJones6512 He’s been weak.","date":"Tue Feb 22 00:14:17 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This Russian naked aggression against Ukraine is despicable &amp; the free world condemns Russia and its dictator Putin. The attack is unprovoked &amp; a war of choice, not necessity. The US and Biden must take the bully Russia seriously &amp; issue harsh sanctions. https://t.co/Ky4GyngFHo","date":"Mon Feb 21 23:43:32 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"A new Congressional report on the opioid crisis details that illegal fentanyl and similar synthetic opioids were the cause of the majority of drug overdose deaths in America from June 2020 to June 2021.\nhttps://t.co/h4FB7ZCp16","date":"Mon Feb 21 22:01:12 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our nation’s firefighters, paramedics, and other rescue crews put their lives on the line and constantly expose themselves to toxic substances and deadly fumes. I stand with my @ProbSolveCaucus colleagues and will help get this bill over the finish line.\nhttps://t.co/XyZJedzhoR","date":"Mon Feb 21 19:15:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Today we celebrate our great American presidents for their leadership, strength, and service to our nation.\n\nHappy #PresidentsDay! 🇺🇸 https://t.co/6rcbpbl81d","date":"Mon Feb 21 16:03:28 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#BlackHistoryMonth https://t.co/IyO0iRx3la","date":"Mon Feb 21 14:03:52 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"“Bacon, Bost, Newhouse cosponsor School Resource Officer Act.” \n\nWe want our schools to be safe. \n\n https://t.co/3YhG8Hii9P","date":"Mon Feb 21 13:41:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@TomDorwart1 You seem to be ignoring the record number of overdose deaths.","date":"Mon Feb 21 12:50:11 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Chiefs15Patriot None of three became law because all different factions demanded 100%. I know we can do better here.","date":"Mon Feb 21 12:48:31 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"To stay updated with my office, sign up for our e-newsletter! https://t.co/LZdI8Xkapq https://t.co/rURyQOsSJm","date":"Mon Feb 21 00:15:02 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Chiefs15Patriot I voted in support of three different border security bills… too many demanded 100% and they got 0%.","date":"Sun Feb 20 23:57:07 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The President’s open border policies have allowed fentanyl to flow across our southern border and into our communities.\n\nIn 2021, enough fentanyl was confiscated by CBP to kill EVERY American nearly SEVEN TIMES over.\n\nWe must strengthen border security…not dismantle it. https://t.co/Ip3x3k3eYA","date":"Sun Feb 20 21:00:30 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#BlackHistoryMonth https://t.co/eiJNahvP24","date":"Sun Feb 20 15:01:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"A new poll shows 69% of Americans think MORE police funding would decrease crime. We need stronger relationships between our communities &amp; LEOs. The denigrating of our police &amp; the rule of law over last 2 yrs has led to an unacceptable increase in violence https://t.co/0mE6a5bFJq","date":"Sat Feb 19 22:20:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The Holocaust was one of the worst crimes ever committed against mankind in the history of humanity. I was one of the leading members for the Never Again Education Act (now law) which incorporates Holocaust education into students' lesson plans. https://t.co/R4FuYxm4ve","date":"Sat Feb 19 19:00:42 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Happy #FFAWeek! The future of our agriculture is critical to our food supply chain, our economy, and the need to protect and support farmers in Nebraska and across the country. @NationalFFA https://t.co/6T5yGIQHUp","date":"Sat Feb 19 16:01:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Great meeting with the Rwandan Ambassador. Strong and courageous leadership has led this country and its citizens from the brink of destruction in the 1990s to the precipice of greatness today. Thank you to the Nebraska National Guard for hosting us. https://t.co/KzPHKGuF47","date":"Sat Feb 19 14:01:33 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I, along with the whole community, stand with Brad and Ann, and pray for healing and a quick recovery. Brad is a great leader in the Omaha community and has made a huge impact for so many. I am grateful for our friendship.","date":"Sat Feb 19 02:36:59 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Visited with the Sarpy County Treasurer, retired Air Force Chief Master Sgt. Trace Jones, who served with me in Germany in 2008. Glad to see him using those leadership skills to run a tight ship for the people of Sarpy County. https://t.co/iXJDNSnChP","date":"Fri Feb 18 21:15:03 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Any agreement with Iran on its illicit nuclear program must be reviewed by Congress per the law. If this were a good deal, POTUS wouldn't be afraid to submit it for public debate. I signed a letter with my colleagues warning the Admin to reverse course. https://t.co/6heNmFn4lZ https://t.co/pyhmJBlycd","date":"Fri Feb 18 20:15:05 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@danheitz War has unanticipated consequences and Putin is acting very dangerously.","date":"Fri Feb 18 18:47:29 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"I do not believe we should send troops to fight for Ukraine, and they have not asked us to do so. However, it is in our interest to support #Ukraine with the anti-aircraft &amp; anti-ship weapons it needs to deter a bully like Putin and minimize the loss of precious Ukrainian lives. https://t.co/673EviiIFh","date":"Fri Feb 18 18:25:00 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"My heart hurts with the loss of a great friend, colleague, and American. Our condolences to Jim’s family and friends.\n\nProverbs says a good name is better than riches. Jim leaves behind a golden reputation and legacy.","date":"Fri Feb 18 16:23:50 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#BlackHistoryMonth https://t.co/fAjbFfYVJc","date":"Fri Feb 18 15:01:54 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The @GLFOP says at least 30 police officers were shot in January— a 67% increase from last year!\n\nI introduced the #BacktheBlue Act to ensure our LEOs, federal judges, public safety officers, and other rescue crews are afforded greater protections.\nhttps://t.co/seMyGuGcKZ https://t.co/UmvT006bNd","date":"Thu Feb 17 19:30:14 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"March 16 is #BrainInjuryAwarenessDay on Capitol Hill. I am grateful to be co-chair the TBI Taskforce and advocate for the millions of Americans misdiagnosed or impacted by #TBI. I look forward to this virtual event!\n\nRegister below⬇️","date":"Thu Feb 17 16:20:21 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"China has violated the Phase One trade agreement. President Biden needs to hold China accountable for the $16 BILLION owed to American farmers, ranchers, and agricultural producers. The US relies heavily on agriculture exports, but sadly we were short changed. https://t.co/pMdbbAe6iS","date":"Thu Feb 17 16:03:37 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"#BlackHistoryMonth https://t.co/VsZHwAW9wF","date":"Thu Feb 17 14:03:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@1nfoSecBen He thinks he can outlast our sanctions. After all, he already invaded Crimea and Donbas, and this  President green lit the GS II Russian pipeline.","date":"Thu Feb 17 11:19:36 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@SophyJean @usairforce We don’t want CA voting laws in NE.","date":"Thu Feb 17 11:17:16 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@Romey_Mainzgirl @usairforce The Dem leadership should put the defense appropriations bill for a vote. I’d vote yes. Reality, we need new House leadership.","date":"Thu Feb 17 01:50:24 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"@1nfoSecBen It appears he wants to rebuild Russia to look more like the Russia of old boundaries and in sphere of influence.","date":"Thu Feb 17 01:49:01 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"The @usairforce fleet is the oldest and smallest it's been since 1947. Urgently needed modernization has been on hold for 5 months due to the budget impasse while China and Russia race ahead with advanced hypersonics. #Airmen deserve better! #NoMoreCRs https://t.co/Ri2P35VVrR","date":"Wed Feb 16 23:00:40 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"School Resource Officers not only play a critical role in keeping schools and students safe, they serve as educators and informal counselors, and are important members of the school family. Glad to partner with @RepJacobs on this much needed legislation.\nhttps://t.co/YwGQTofD8p","date":"Wed Feb 16 21:00:53 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"This Administration needs to make opening trade doors and eliminating barriers to AG exports a higher priority. The Midwest economy is AG export fueled and we need the Administration to quit treating us like flyover states. \nhttps://t.co/eLsPPISyp1","date":"Wed Feb 16 18:02:44 +0000 2022","user_id":"818975124460335106"},{"handle":"RepDonBacon","text":"Our goal is to deter war in #Ukraine. To do so, we must convince Putin that attacking Ukraine will be too costly in blood &amp; treasure. POTUS has sent anti-tank weapons to Ukraine, but not the anti-air and ship weapons they need to better repel an invasion. https://t.co/bHtTxbLbZd","date":"Wed Feb 16 17:10:03 +0000 2022","user_id":"818975124460335106"}]