[{"handle":"RepEllzey","text":"I started my day by calling some of the folks whose questions I could not get to during Monday’s Telephone Town Hall. Thank you for the thoughtful and respectful discussions. https://t.co/V8ryQ14Ut8","date":"Thu Jun 16 17:45:45 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"The American Flag is the fabric of our nation, and today, we celebrate the adoption of that Flag. Since the Second Continental Congress passed a resolution in 1777, our Flag has become the symbol of freedom and democracy worldwide. https://t.co/N9wSxp7GiA","date":"Tue Jun 14 17:27:01 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you, @DavidCookTexas, and the 4,000 people back home, for joining me in the telephone town hall last night. If you were unable to call in, or if you did and we could not get to your question, please reach out to my office. I am more than happy to answer! https://t.co/jmZ26xaEJb","date":"Tue Jun 14 13:44:32 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Let’s take a walk and talk about what’s going on in our nation.\n\nhttps://t.co/uXbX4kHrFG","date":"Sun Jun 12 02:22:04 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"On Tuesday, I had the opportunity to speak at the American Foundry Society breakfast in Washington. Thank you, Eric Meyers, for introducing me! https://t.co/EtT8MtVyvJ","date":"Thu Jun 09 19:20:38 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"It was a great day to be in Ennis, Texas, yesterday. I spent the morning visiting with Mayor Angeline Juenemann, City Manager Marty Nelson, and Commissioner Lane Grayson, then finished the day touring the new Freshpet facility. https://t.co/ATK2IMNdJ4","date":"Thu Jun 02 16:36:19 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Clark, you are, and always will be, remembered. https://t.co/OyJ5IT9u8u","date":"Mon May 30 15:53:55 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you, @OldcastleInfra, for hosting me at your plant this morning! https://t.co/smgAcFZ065","date":"Mon May 23 21:13:07 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I am proud to join @RepKevinBrady in defending the private property rights of Texans.","date":"Tue May 17 16:45:45 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Let’s take a walk and talk about what happened this week in Washington. \n\nhttps://t.co/VoedXV7PBx","date":"Sat May 14 17:33:16 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"This morning I joined @GOPLeader and many of my Republican colleagues in the 2nd annual Back The Blue Bike Tour with the police. \n\nOur law enforcement plays a pivotal role in our society, and I am proud to honor them during #PoliceWeek. https://t.co/joNgjRa5g5","date":"Thu May 12 20:09:59 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you for hosting me @LyondellBasell. Keep up the good work!","date":"Wed May 11 16:06:08 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you, @CodyforTexas, and the 4,000 people of Texas' 6th Congressional District, for joining me in the telephone town hall last night. If you were unable to call in, or if you did and we could not get to your question, please reach out to my office. https://t.co/Ql2SypaHI5","date":"Thu May 05 21:03:30 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I am continuously impressed with the level of professionalism, respect, and genuine love of their jobs and community that I see from the law enforcement officers in our district. Thank you, Chief Aaron and the @MansfieldCops, for hosting me. https://t.co/fpUZBui1c2","date":"Thu May 05 20:18:00 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you to everyone who came by the Waxahachie office today! https://t.co/cznKG5inxT","date":"Tue May 03 22:21:29 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Let’s take a walk. https://t.co/1dL9arwfpi","date":"Sat Apr 30 20:43:27 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"The last thing our farmers need is a burdensome tax plan that hinders their ability to make a profit. That's why I joined 28 of my colleagues in sending a letter to President Biden opposing his Farm Killer Tax. https://t.co/uDZIvRUOXY","date":"Thu Apr 28 19:16:27 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you,@VistraCorp, for hosting me and my Texas colleagues,@michaelcburgess, @RepBethVanDuyne, @TXRandy14, and @RepRWilliams, at your offices today. https://t.co/GD6HwrCmco","date":"Fri Apr 22 23:54:11 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you to everyone who came by the Corsicana office today! Getting to speak directly with you is a crucial part of me doing my job in Washington. I look forward to more Coffee with your Congressman events in the coming months! https://t.co/nj3dJpw9IR","date":"Wed Apr 20 23:23:12 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Yesterday I had the opportunity to meet with @methodistmidlo, The Salvation Army of Ellis County, and @hopeclinicec. I want to thank them for all of their work in our community. They each play a pivotal role in making our district what it is. https://t.co/iMsNu3LC5z","date":"Wed Apr 20 14:57:59 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Last week I was proud to join @RepColinAllred in introducing a bill to create and expand veteran health care facilities in DFW and across the nation. https://t.co/HDSgwbQGlz","date":"Mon Apr 18 19:38:39 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I had a great time in Navarro County today. Thank you, @NavarroCollege and Kohl’s for inviting me to visit. The downtown Easter Hop was an outstanding success. Thanks to all of the families that stopped by my office to get some Easter eggs! https://t.co/yCN9EMBgjz","date":"Thu Apr 14 22:45:19 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you, @sagu, for inviting me to your campus to speak with the next generation of leaders. Thanks, Professor Gates, for sharing your classroom with me. https://t.co/uYDca3ypl8","date":"Wed Apr 13 21:39:48 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"https://t.co/G0ylq5ka0p","date":"Wed Apr 13 15:08:17 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"https://t.co/Vv8KnmKc8Q","date":"Wed Apr 13 15:07:56 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"As a member of Congress, is it my responsibility to protect the lives of the unborn and those who cannot defend themselves. Monday, I joined 125 of my colleagues in sending a letter to President Biden opposing the President's Budget Proposal on the basis of anti-life provisions. https://t.co/4QZxJC8Hes","date":"Wed Apr 13 15:07:26 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Join me on Wednesday the 20th for a cup of coffee! https://t.co/T3R5wO0gcY","date":"Tue Apr 12 16:13:14 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Let’s take a walk and talk about what happened this week in Washington.\n\nhttps://t.co/MkDD0UpVVk","date":"Fri Apr 08 20:59:48 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Stay updated with what is going on in D.C. and in our district with my monthly newsletter.\nhttps://t.co/kC5tnKqdND","date":"Wed Apr 06 21:13:52 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Join @RepBost and me tomorrow at 6:00 pm (cst) for a Veterans Telephone Town Hall. https://t.co/Rqgs0jAUNy","date":"Mon Apr 04 18:39:53 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"If you fed your family today, thank a farmer. Thank a rancher. And in Texas, thank a neighbor. https://t.co/VDcr3DuF3B","date":"Fri Apr 01 15:36:34 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I encourage anyone interested in serving our country to come to the North Texas U.S. Service Academies Forum and gather important and interesting information. Attending the Naval Academy was an honor and remains one of the greatest highlights of my life. https://t.co/glWAyv1mMH","date":"Thu Mar 31 15:31:18 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Let’s take a walk and talk about what happened this week in Washington.\n\nhttps://t.co/i60WKGOs64","date":"Thu Mar 10 17:09:02 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Yesterday, I joined 44 of my Republican colleagues in introducing the No Retaining Every Gun In a System That Restricts Your (REGISTRY) Rights Act to ensure the federal government doesn't build a federal firearms registry. \n\nhttps://t.co/HuLwxTB1WO https://t.co/cmnCsaAdzn","date":"Wed Mar 09 16:15:13 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today, I have the opportunity to join @POTUS and @SecVetAffairs on Air Force One with my colleagues @RepVeasey and @RepColinAllred to travel back to the district to visit VA facilities in Fort Worth. During times like these, it is imperative that we support our veterans. https://t.co/59cXgjGrRS","date":"Tue Mar 08 17:32:49 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today, I joined 37 of my colleagues in signing on a the letter calling for an end to proxy voting.\n\nhttps://t.co/csGHoTZqzx","date":"Mon Mar 07 23:57:49 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you @MariaBartiromo for having me and @RepPfluger on this morning to discuss Russia’s war in Ukraine, what American can do to help, and the leadership of President Zelensky. \n\nhttps://t.co/6r2rEl7lTr","date":"Sun Mar 06 19:38:09 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Good morning America! Let’s take a walk. https://t.co/z49fkFvZZW","date":"Wed Mar 02 15:48:13 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"As I walk up the steps of our nations Capitol to hear the State of the Union I had to stop and thank the officers on duty. It is a privilege to walk up these steps and I am grateful to these men and women. https://t.co/tH7BxdCG0J","date":"Wed Mar 02 01:44:13 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"A big thanks to @huntsman_build for giving me a tour! Keep up the good work! https://t.co/8BMNOVd1Bg","date":"Wed Feb 23 17:09:33 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Thank you, team Buckley for hosting me at your facility in Midlothian. You have a great operation! https://t.co/GM8k15Alo0","date":"Thu Feb 17 20:50:51 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"On Saturday, I was invited to judge Navarro College's Dancing For Our Stars. The performances were outstanding, and they raised money for a great cause. Navarro, you put on one great show! https://t.co/QdXJg1iFEx","date":"Thu Feb 17 03:12:30 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I’ll be joining @seanspicer &amp; @LyndsayMKeith at 5pm on #spicerandco to discuss…\nTune in to @Newsmax! https://t.co/h5MtQE9rs7","date":"Wed Feb 16 22:14:36 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today, Sergeant Brian Christoper Martin reenlisted into the army after serving our country for 26 year. It was a privilege to administer the oaths of reenlistment. https://t.co/ucKPNc0h71","date":"Sat Feb 12 23:03:45 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Let’s take a walk and talk about what happened this week in Washington. https://t.co/35mjmwo2e0","date":"Wed Feb 09 17:05:23 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"One of my favorite duties as a Member of Congress is nominating outstanding young men and women to our nation's service academies from the 6th Congressional District. This was a highly competitive process, and I could not be prouder of what they have already accomplished. https://t.co/rA7iD4hGgY","date":"Tue Feb 08 20:29:19 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Over the last couple of weeks, I have had the opportunity to tour and visit with many of our local law enforcement personnel. I can say, without a doubt, our district has the best law enforcement in the State of Texas. And they are all better shots than your Congressman! https://t.co/iH02ByoyWD","date":"Sat Feb 05 18:25:38 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Battalion Chief David Maeker thank you for your incredible service and leadership in our community and to those that need it most. https://t.co/36S8OqIkmk","date":"Thu Jan 13 22:06:41 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I had a great time touring @Airbus  in Fort Worth last week. I got to spend some time in their helicopter simulator. It turns out I can still fly! We're doing amazing things here in House District 6th. Thanks for having me! https://t.co/VN9VX1ZGII","date":"Wed Jan 12 22:06:09 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I will never give in when it comes to opposing private interests using eminent domain to take someone’s property. Land cannot be taken, homes destroyed, and lives disrupted for a private company’s boondoggle. https://t.co/reXP8bLHil","date":"Tue Jan 11 02:40:17 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today was a very special day. I met 22 outstanding young men and women who want to dedicate their lives to defending our nation. In so doing, they took the last step to gain entrance to our nation's military academies. https://t.co/v1bEOg9D2D","date":"Wed Jan 05 23:04:27 +0000 2022","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"The level of innovation I saw from the applicants from House District six was nothing short of remarkable. Congratulations to Eshan on all of his hard work and this tremendous accomplishment. https://t.co/hiikbao5aT","date":"Tue Dec 21 19:43:50 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"It was an honor to be apart of Wreaths Across America in Waxahachie yesterday. Thank you to everyone who participated across our country. This event means so much to so many people. https://t.co/7ORddx8WUT","date":"Sun Dec 19 20:32:20 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Let’s talk a walk and talk about what happened this week in Washington. https://t.co/NDO3Ya13Ad","date":"Sat Dec 18 02:09:25 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"During nights when we have late votes at the Capitol, it’s always great to have a local leader stop by the office. Thanks, Mayor, for making the trip up to DC. You’re always welcome in my office. https://t.co/bHiphPfPcd","date":"Thu Dec 16 00:13:13 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today, I had the honor to be an original co-sponsor of the Microelectronics Research for Energy Innovation Act. This bill will leverage the Department of Energy’s world-leading research and development capabilities to accelerate U.S. leadership in the microelectronics industry. https://t.co/o59gdyKSFN","date":"Wed Dec 15 15:49:25 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"This week, I had the honor of meeting with State Representative Jacey Jetton, Dr. Xiqiu “Bob” Fu, Mrs. Deborah Fikes, Ran Peng, and Ruiting Renon about how to preserve and advance human rights and discussed the deadly actions of some countries destroying human rights. https://t.co/LvhwP0HjQ3","date":"Fri Dec 10 22:59:23 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"It is appropriate that on the 80th anniversary of Pearl Harbor that Congress unite and pass the NDAA. As members elected to this body, it is our duty to protect our country. With the passing of the NDAA, today we did that. https://t.co/BEhWstc1zK","date":"Wed Dec 08 04:14:40 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today, on the 80th anniversary of the devastating attack on Pearl Harbor, we remember the 2,403 Americans who were taken from their friends and families too soon. Today, we put aside our differences and unite to remember what makes us all Americans.","date":"Tue Dec 07 21:05:30 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Would you take a walk with me? Let’s talk about what happened this week in Washington. https://t.co/3r5Vdw71nH","date":"Sat Dec 04 01:18:54 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today, House Democrats obtained quorum through the use of proxy, which I believe is unconstitutional. After staying up all night working with Leader McCarthy, I chose not to vote in protest of this destructive bill and the unconstitutional process used to pass it. https://t.co/NLMdNpkWbO","date":"Fri Nov 19 16:10:21 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Let’s talk about what’s going on in Washington this week. https://t.co/HLhFYHGpNd","date":"Fri Nov 19 04:04:10 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"It was truly an honor to bring H.R. 5516, the VITAL Assessment Act, to the House Floor. Our veterans need our help, and we're here to answer that call. \n@CSPAN https://t.co/uWeSi4WkDN","date":"Tue Nov 16 19:56:44 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Veteran's day is a day of celebration and remembrance of all of the things this nation stands for. \n\nOur veterans have sacrificed so much for our country, and I know they would do it again in a heartbeat. \n\nThank you to my brothers and sisters in arms, and Happy Veteran's Day.","date":"Thu Nov 11 22:55:01 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"246 years of defending our country. 246 years of sacrificing. 246 years of holding the line. Happy Birthday, Marines. We would not be here without you. Semper Fi. I salute you. \n\nHere is to 246 more! https://t.co/DszqwuWcnI","date":"Wed Nov 10 17:05:15 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Last Friday, after the longest vote in our history, Nancy Pelosi rammed through the Democrat's disastrous socialist tax and spending spree through the House. I voted NO.","date":"Mon Nov 08 17:25:17 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Small businesses are the backbone of our country. They are the key to the American Dream. Many veterans, after their time in the service, choose to open their own business. And this week we celebrate them.\n \nLet's support our veterans. Happy Veterans Small Business week!","date":"Fri Nov 05 15:34:51 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"If there is one thing Congress can agree on, it is that we need to help our veterans. I'm grateful to Chairman Takano, Ranking Member @RepBost, and my fellow committee members for unanimously voting the VITAL Assessment act for further consideration on the House Floor.","date":"Fri Nov 05 01:10:59 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"We must protect our individual freedoms. Today, I am signing on to H.R. 5360 to nullify President Biden's executive orders regarding COVID-19 mandates and to prohibit the Secretary of Labor from issuing a rule mandating vaccination against COVID-19.","date":"Fri Oct 29 18:09:46 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today, newly elected Ellis County Representative Brian Harrison came to visit me in Washington. I look forward to working with him on issues that impact the residents of Ellis County and the great State of Texas. https://t.co/Yu3j3nBtxy","date":"Thu Oct 28 00:37:48 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Watching the Blue Angels with my son. Always makes me proud of our country and miss flying these exquisite aircraft. https://t.co/fkgpcPYRF7","date":"Sun Oct 24 21:48:27 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Would you take a walk with me? Let’s talk about what happened this week in Washington. https://t.co/ZTQUmPrqnF","date":"Sun Oct 24 01:00:55 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I want to thank everyone who came out yesterday for our new district offices' ribbon cutting and grand opening. I am blessed to have the support of all of you. Now, it's time to get to work. If you need anything, please stop by one of the offices. https://t.co/bcQ8Qh2LTb","date":"Tue Oct 19 18:17:52 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Wearing two hats tonight. One for my Papa who passed away a year ago. One for Mark Sanders, my EOD, and USNA brother. https://t.co/fw4cnPgPzH","date":"Wed Sep 29 22:57:32 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"This year marks the 20th anniversary of the September 11th attacks on our nation. Let today be a day for those who would protest what this country is, what they think it is, be a day of remembrance and understanding of who we are. Not what they have been told we are.","date":"Sat Sep 11 20:36:10 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today, the Department of Defense announced that Marine Corps Lance Cpl. David L. Espinoza, 20, of Rio Bravo, Texas, was among the 13 brave men and women who gave their lives in defense of the Kabul Airport. My heart goes out to the families of these American Heroes.","date":"Sun Aug 29 00:49:26 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Today 12 American heroes died in a suicide bombing at Kabul Airport. Biden recently said that we could trust the Taliban; the events of this morning reaffirm why we cannot. Please join me in sending prayers to the families of these warriors who made the ultimate sacrifice.","date":"Thu Aug 26 23:43:06 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Governor Abbott just signed HB 885 which I am proud to have co-authored. Navarro College is allowed to add a baccalaureate degree in nursing to their degree offerings. This will have an incredible positive impact on Ellis County, Navarro County, DFW and surrounding areas. https://t.co/Hz9croOQnv","date":"Mon Jul 19 20:18:43 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"https://t.co/XVwtOW44yp","date":"Thu Jul 15 18:16:28 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I attended Texas House session today, with my Republican colleagues. Doing the work on behalf of HD10. Also attended press conference calling out the Democrats dereliction of duty abandoning job and flying to DC #txlege https://t.co/1OTj6kx7EG","date":"Tue Jul 13 22:53:58 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Tomorrow, as House District 10 State Representative, I look forward to being present for the Texas House roll call and ready to advance important conservative policies for the betterment of the people of HD 10 and all of Texas. #txlege https://t.co/RGnzHYekBD","date":"Mon Jul 12 21:00:28 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Governor Abbott has called a special session starting July 8. Even with tremendous conservative successes as a result of regular session, looking forward to completing unfinished business for HD10 and all of Texas!  #txlege","date":"Tue Jun 22 22:17:19 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Both laser pointers and fireworks can have grave consequences when used as a weapon. People using them as a weapon must pay a heavier penalty for their actions.\" #txlege","date":"Wed Jun 02 17:02:53 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"While we passed positive law enforcement reforms, I support and will continue to support enforcement. In regard to HB 2366, it hits close to home. I have mentioned before that as a pilot I have been lased and it damages eye sight and obstructs vision. #txlege","date":"Wed Jun 02 17:02:52 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I am proud to have co-authored and passed HB 2622 to make Texas a 2nd Amendment Sanctuary State. Texas will NOT enforce any federal order or law that infringes on the right to keep and bear arms. #txlege https://t.co/QbrklhW4G8","date":"Wed May 26 21:51:17 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Faith is essential in many Texans lives. That's why I Co-Authored for #HB525 to designate houses of worship as \"essential\" in state law. No government official can ever use the law to close the doors to people of faith. #txlege","date":"Thu May 13 17:17:55 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"HB 3, the Texas Pandemic Disaster Act, passed out of the Texas House. The bill clarifies government emergency powers and limitations during a pandemic disaster. HB 3 protects Texans' constitutional rights &amp; ensures a streamlined &amp; effective response to a future pandemic. #txlege https://t.co/HRABBVQzYr","date":"Wed May 12 19:58:04 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Proud Co-Author of HB 1195. Protecting Texas small businesses and other businesses for unnecessary taxes #txlege","date":"Wed May 12 18:48:34 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I am proud to Co-Sponsor SB 1776 which provides for inclusion of an elective course on the founding principles of the United States in the curriculum for public high school students and the posting of the founding documents of the United States in public school buildings #txlege https://t.co/3Ldn3eTxnV","date":"Tue May 11 23:00:31 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"https://t.co/hHItoql7qA","date":"Mon May 10 01:14:02 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Sexual Assault Awareness Month, April 2021. Proud to have voted YES on every bill fulfilling EVERY recommendation made by the Sexual Assault Survivors’ Task Force. #txlege https://t.co/NGX6oJkQI6","date":"Fri Apr 30 21:40:53 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I am proud to have Co-Authored HB 1900 creating financial consequences for cities defunding the police. Defunding the police will put citizens and other officers in danger. I believe in working together for positive reform but defunding is not the correct approach. \n\n#txlege","date":"Thu Apr 29 16:57:07 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I am continuing to fight for TEXAN'S 2nd Amendment rights by co-authoring HB 2622. This helps make Texas a 2nd-Amendment Sanctuary State. No state resources can be used to enforce federal firearms laws that are not also state laws. \n\n#txlege","date":"Thu Apr 29 16:28:21 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"@MidloMirror @WaxahachieNews @startelegram","date":"Sat Apr 24 19:52:28 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"I’m committed to helping secure the border. Biden-Harris failing. Texas stepping up. I voted to fund $797 million for border security purposes at DPS &amp; 8 other state agencies. Border security funding supports DPS personnel at full deployment levels. #txlege #securetheborder","date":"Sat Apr 24 19:51:02 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Pleased to support #TexasHouse budget. Passed unanimously. It is a  conservative budget. There is no Medicaid expansion. Supports school choice, charter schools. Keeps promises to students and teachers. Continues property tax relief #txlege","date":"Fri Apr 23 19:38:59 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"Happy Resurrection Sunday! Here's to a blessed time with your friends, family, and loved ones.","date":"Sun Apr 04 13:18:20 +0000 2021","user_id":"1366523868253458437"},{"handle":"RepEllzey","text":"A Texas DPS Trooper, Chad Walker, is in critical condition after being shot outside of Mexia. Please keep Trooper Walker and his family in your prayers.","date":"Sat Mar 27 19:53:31 +0000 2021","user_id":"1366523868253458437"}]