[{"handle":"RepFitzgerald","text":"President Biden campaigned on waging war on American oil and gas companies. \n\n$5+ a gallon is not a coincidence.","date":"Fri Jun 17 14:31:55 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats' hold up of Schedule I designation of fentanyl, in order to promote so-called criminal justice reform, is failing our communities.\nhttps://t.co/sgGhXhIeM8","date":"Thu Jun 16 15:37:25 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats have no intention of holding Big Tech accountable. They only want Big Tech to censor more conservative speech.","date":"Wed Jun 15 18:43:56 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Why does President Biden want Saudi energy and not American energy?","date":"Wed Jun 15 16:00:41 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Every major financial news outlet is reporting on recession fears and the White House is still pretending everything is fine.","date":"Tue Jun 14 15:43:10 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Protecting our Supreme Court justices should not be political.","date":"Mon Jun 13 14:26:01 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Rising inflation is a gut punch to not only every hard-working American but also every individual who fell for the snake oil economics this administration sold them.","date":"Fri Jun 10 14:06:45 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Recession fears should be met with action by the Administration to protect Americans. \n\nInstead, we get finger-pointing on late-night comedy.","date":"Thu Jun 09 14:32:29 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The White House's hesitation to condemn protests at the homes of Supreme Court justices enabled today's deranged lunatic to threaten Justice Kavanaugh.","date":"Wed Jun 08 16:06:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"As predicted, gas will soon hit $5/gallon across the country. Worse yet, Democrats ignored warning signs months ago much like they did inflation.","date":"Wed Jun 08 12:59:36 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, @HouseJudiciary Democrats objected to my amendment to provide funding for school safety.\n\nWe need action, not politics.","date":"Thu Jun 02 22:51:08 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Schools need funding for commonsense safety measures to protect against gun violence.","date":"Thu Jun 02 13:40:12 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Sec. Yellen saying, \"Oops I was wrong\" about inflation doesn't cut it. This administration's policies have obliterated the wallets of Americans.","date":"Wed Jun 01 20:08:05 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today we honor those who paid the ultimate price for this country. Freedom comes at a cost and we must never forget that.\n\n#MemorialDay","date":"Mon May 30 13:03:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Soaring gas prices are not part of an \"incredible transition\" as President Biden wants you to think, it's a flat-out failure.","date":"Tue May 24 13:29:44 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Huge win for communities and law enforcement!\nhttps://t.co/amCVCrWSIA","date":"Fri May 20 21:17:33 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to join the effort to scrap Biden's \"Ministry of Truth.\" Thank you @Jim_Jordan &amp; @RepFranklin for leading the charge. \n\nThis is why we fight. https://t.co/6rzw0ab7ln","date":"Fri May 20 16:20:26 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Babies in the womb deserve legal protection and possess the basic human right to life.","date":"Thu May 19 14:09:08 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Gas is up over $4.50/gallon across the entire country. It does not have to be this way.","date":"Wed May 18 14:16:25 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Inflation was caused by shutting down our economy and reckless spending. Democrats now want socialist price controls 👇 https://t.co/zOPSPzW9L1","date":"Tue May 17 20:17:55 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden administration is directly to blame for the continual rise in gas prices. There's no question about it.\nhttps://t.co/7Ic8X8V0vr","date":"Tue May 17 14:34:06 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The arson of the WI Family Action office in Madison must be investigated by the US DOJ immediately. My WI colleagues and I wrote to AG Merrick Garland to demand an investigation and see what DOJ is doing to stop further violence against pro-life groups. https://t.co/zznrIS7d33","date":"Thu May 12 17:01:24 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It was great to hold office hours in Elm Grove yesterday! Thanks to those of you who came out. https://t.co/YshJwWJKpi","date":"Fri May 06 13:53:54 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Honored to celebrate the retirement of Watertown Fire Chief Kraig Biefeld who retried on Monday after 29 years of service. Thanks for your service, Chief and here’s to the next chapter! https://t.co/UNrwXzkD2g","date":"Thu May 05 20:38:59 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to the good people at Sentry Equipment in Oconomowoc for inviting me to tour their business. I learned a lot about the water sampling and analysis systems that they manufacture and engineer. Thanks again! https://t.co/R5sKcagKGr","date":"Wed May 04 21:00:15 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It was good to see so many community leaders at the Mayor’s Celebrate Waukesha Breakfast this morning. Great to meet on and discuss many pressing matters within the community. https://t.co/Z52TnwfcDD","date":"Tue May 03 22:31:02 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It was great to hold office hours in Greenfield yesterday! Thanks to those of you who came out and if you weren’t able to make it but still need assistance in dealing with a federal agency, make sure you give my office a call. https://t.co/iPujeEtgc1","date":"Tue May 03 19:07:56 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday I was happy to host @protectmyMA seniors in Brookfield to discuss why Wisconsin seniors value their Medicare Advantage plans. MA needs to be protected and I will continue my work to ensure that. https://t.co/kL8D89PzPt","date":"Tue May 03 18:30:52 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Border is getting worse. Migrant crossings are at 20-year highs and DHS is preparing for that to more than DOUBLE should Title 42 be lifted. I went to the Border again to see firsthand how CBP is preparing. Biden should keep Title 42, not scrap it to appease the radical left. https://t.co/Fn1xGaPI71","date":"Fri Apr 22 17:32:16 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you @RepStefanik, @RepWaltzPress, @repdarrellissa, and @RepFranklin for joining me in this effort.","date":"Thu Mar 31 20:53:52 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"China’s IP theft costs the US up to $600B annually &amp; the Biden Admin is doing nothing to stop it. I'm proud to introduce the China Initiative Accountability Report Act to address these threats &amp; protect national security interests. More from @FreeBeacon ⬇️\nhttps://t.co/PoB9RyP905","date":"Thu Mar 31 20:53:51 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Our justice system is in desperate need of bail reform that prioritizes community safety above all else. Weak low- and no-bail policies pushed by the radical left put public safety at risk. I joined @Newsmax this morning to discuss my work on this issue ⬇️\nhttps://t.co/aju5wMl1tU","date":"Thu Mar 31 15:22:10 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Big Tech and the mainstream media deceived the American people and outright censored the truth regarding reports on Hunter Biden’s laptop. I’m proud to join my @JudciciaryGOP colleagues in this investigation.","date":"Thu Mar 31 14:53:10 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @FinnertyUSA on @newsmax at 7 AM CT to discuss a new bill I introduced this week to address weak bail policies. Be sure to tune in.","date":"Thu Mar 31 11:49:46 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Again, the Biden Administration is failing to meaningfully secure the border. Giving free vaccines to illegal immigrants while begging Congress for more COVID $$ will only make the problems at the border worse.\nhttps://t.co/WvHJngjLbZ","date":"Tue Mar 29 17:22:44 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Weak bail policies rocked Waukesha to its core when Darrell Brooks violently killed 6 community members. In order to prevent future tragedies @SenRonJohnson &amp; I intro'd a bill to require DOJ to critically study how weak bail policies hurt our communities.\nhttps://t.co/pZLvSeAtM4","date":"Mon Mar 28 21:23:02 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Parents are concerned about the impacts mandatory masking has had on their children, and for good reason. Democrats and teachers unions have grasped for power at every turn during the pandemic at the expense of students’ needs. It's time to #UnmaskOurKids.\nhttps://t.co/fmJwb8FHce","date":"Mon Mar 28 16:34:22 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you @RepRickAllen &amp; @SenatorTimScott for leading the effort to modernize the Employee Rights Act. I am a proud cosponsor of this legislation which protects the rights of workers to participate in the gig economy and the franchising model.","date":"Thu Mar 24 00:10:07 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you @RepFranklin for leading this important letter. The IRGC continues to threaten the regional stability of our ally Israel. Under no circumstances should the U.S. remove their terrorist designation to bring Iran back to the negotiating table.","date":"Tue Mar 22 19:10:16 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy #NationalAgricultureDay to all of the hardworking men and women who make agriculture a defining feature of Wisconsin! Your tireless work day-in and day-out is appreciated by us all. https://t.co/MV2qAhFGFa","date":"Tue Mar 22 16:58:32 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Milwaukee county had 643 fatal overdose deaths in 2021, a 53.8% increase from 2019. As I work to permanently designate fentanyl related substances as Schedule I, this tool from MKE County will provide critical data to aid prevention efforts.\nhttps://t.co/3Ip2j5R3vR","date":"Tue Mar 22 14:56:04 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"While President Biden deflects blame for high gas prices, small businesses in Wisconsin are stuck with the consequences of our diminishing energy independence. Biden must boost domestic energy production…let’s start with finishing the Keystone Pipeline!\nhttps://t.co/Ts1m5LobvE","date":"Mon Mar 21 15:52:17 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy St. Patrick’s Day! 🍀 https://t.co/1ulu6ult61","date":"Thu Mar 17 21:37:57 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, Democrats introduced a bill allowing regulators to put a blanket ban on mergers without court oversight. This is a terrible idea that will reduce supply and add to inflation.\nhttps://t.co/65h3nSuQna","date":"Thu Mar 17 14:50:04 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m listening to President Zelensky’s address to Congress this morning. https://t.co/91yAjYvyrp","date":"Wed Mar 16 13:17:50 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was happy to join @MoraineParkTech yesterday at a roundtable discussion. I had the opportunity to hear first-hand from students, and we had a productive conversation about the important role technical education plays in Wisconsin. https://t.co/CeqF3fpf0I","date":"Tue Mar 15 18:26:23 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The reason gas prices are soaring isn't because we sanctioned Russian oil imports. It's because the Biden Admin has made us too reliant on energy imports from countries that seek to do us harm. President Biden must reverse course and restore American energy independence.","date":"Mon Mar 14 18:00:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It was great to meet with Ambassador @SandhuTaranjitS this week to discuss ways to strengthen ties between the U.S. and India. https://t.co/29uxB1rx1g","date":"Fri Mar 11 21:13:08 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you @RepStefanik for leading this letter. I’m proud to join in this important call to end forced masking of children in Head Start programs.","date":"Fri Mar 11 17:03:40 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Inflation catapulted to 7.9% in February—a new 40-year high. \n\nPredictably, President Biden is pointing fingers at everything and everyone but himself. This is what failed leadership looks like.\nhttps://t.co/NDE9jeCkzF","date":"Thu Mar 10 14:49:55 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I am mourning the insurmountable loss of Margaret Farrow, a true leader who led the state of Wisconsin with integrity. I'm grateful for the time we served together &amp; for her friendship. She will be dearly missed and Wisconsin will forever be changed for the better by her service.","date":"Wed Mar 09 14:54:55 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Everyone agrees fentanyl is a dangerous drug. The problem is, Democrats refuse to permanently designate fentanyl as Schedule I unless it's paired with soft on crime policies. In the meanwhile, their politics are causing serious harm to families and communities across the U.S. https://t.co/cvbxFsWIfZ","date":"Wed Mar 09 14:25:07 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, US Attny Brown joined the @JudiciaryGOP hearing.\n\nWhen I asked him about reckless bail policies—the same policies that led to the tragedy in Waukesha—he dodged accountability &amp; refused to say if he would support tougher bail policies to keep our communities safe. WATCH ⬇️ https://t.co/WQa3agHKDE","date":"Tue Mar 08 19:14:25 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, Democrats are holding a hearing on “reimagining public safety.” \n\nDon’t let them fool you: reimagining = defunding.\n\nDon’t take my word for it, Democrats will tell you themselves. ⬇️","date":"Tue Mar 08 16:12:23 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Biden has gone from threatening oil sanctions on one authoritarian regime to lifting sanctions on another. When will the President understand that the best way to relieve pressure at the pumps is to produce more American oil? Finish Keystone XL and increase drilling permits!","date":"Mon Mar 07 17:58:21 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm glad to see the Senate overturn this overreaching mandate. Speaker Pelosi should immediately bring this bill to the House floor so we can overturn this burdensome rule that keeps healthcare workers on the sidelines.\nhttps://t.co/JGPuNDCH02","date":"Thu Mar 03 14:41:18 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I am wishing all those who observe a blessed #AshWednesday and Lenten season this year.","date":"Wed Mar 02 17:54:14 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @FinnertyUSA on @newsmax this morning to discuss President Biden's #SOTU address. Be sure to tune in.","date":"Wed Mar 02 13:08:32 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If Biden truly wants to end the opioid epidemic, he must start with serious action to secure our southern border. #SOTUinCrisis #SOTU","date":"Wed Mar 02 03:02:59 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In the House chamber listening to the President deliver his SOTU address. Members were informed just yesterday that we didn’t need to wear a mask.\n\nIt’s a miracle how the science suddenly changed overnight ahead of a nationally televised address. #PandemicPolitics #SOTUinCrisis","date":"Wed Mar 02 02:12:35 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If President Biden delivers an honest address this evening, he’ll take responsibility for:\n\n❗️ Skyrocketing inflation\n❗️ High energy prices\n❗️ Botched foreign policy in Iran, Afghanistan, and Ukraine\n❗️ Record level fentanyl seizures at the southern border\n \n#SOTUinCrisis","date":"Tue Mar 01 19:33:32 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"No answers, no accountability. The DOJ and the Biden Administration must do better. I’m proud to join my @JudiciaryGOP colleagues on this letter.","date":"Mon Feb 28 22:22:01 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The current level of inflation is nothing like we’ve seen in the last four decades. President Biden has enabled this highly inflationary environment and I look forward to answers and accountable at his SOTU tomorrow. Americans will be watching.","date":"Mon Feb 28 16:16:41 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@HouseGOP warned Pres. Biden about the importance of energy independence. Now, as Putin launches a war on Ukraine, this Administration is left unable to support the energy needs of our country and European allies. We must increase U.S. energy production to cripple Putin’s power.","date":"Fri Feb 25 20:36:56 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"These unprovoked attacks by President Putin must be met with severe consequences. The U.S. must move swiftly to pass a comprehensive sanctions package that cripples Putin and his oligarchs. I stand with the Ukrainian people in their fight against tyranny.","date":"Thu Feb 24 18:26:19 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It was great to be in Hartland, #WI today for office hours. I know the weather has been stubborn in Wisconsin this week, so if you were unable to attend I encourage you to call my office with any questions or comments you may have.","date":"Thu Feb 24 00:07:04 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is one of the top concerns I hear about when I travel across Wisconsin. People are rightfully incredulous the Biden Administration has done virtually nothing to alleviate the crisis at our southern border.","date":"Tue Feb 22 18:38:35 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Presidents’ Day! https://t.co/HZ2dpAJyRa","date":"Mon Feb 21 21:58:45 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I am saddened to hear of the passing of my colleague, @HSBCgop seat mate, and friend Jim Hagedorn. Jim was a true fighter in his personal &amp; professional life and his contributions in Congress will be sorely missed. My condolences go out to his entire family. May he rest in peace.","date":"Fri Feb 18 15:27:58 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My full statement on the breakdown in election procedures in Green Bay. ⬇️ https://t.co/xiqqtmpRmj","date":"Thu Feb 17 22:00:43 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congratulations to @USAHockey’s women’s team for their strong performance and winning the silver medal! Especially proud of Delafield native Alex Cavallini for representing our community at the Olympic games. #TeamUSA","date":"Thu Feb 17 20:53:57 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you @RepGallagher &amp; @michaelgwaltz for leading this effort. The Biden Admin. has sorely missed the mark on negotiations with Iran thus far. Any new nuclear agreement must receive approval from Congress or will face a similar fate as the JCPOA.\nhttps://t.co/V56YWxNkv0","date":"Thu Feb 17 16:58:55 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The evidence is overwhelming that the Biden Admin. directly worked w/ NSBA to target parents voicing their frustrations to local school boards. I’ve joined my @JudiciaryGOP colleagues in letters demanding answers from AG Garland and it is clear he owes us many answers.","date":"Wed Feb 16 19:55:05 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy National Wisconsin Day! I’m proud to represent this great state and I invite everyone to join me in celebrating our rich history and culture.","date":"Tue Feb 15 22:42:56 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Clinton Campaign’s complicity in the Russia hoax can no longer be ignored. These new findings are serious and deserve exacting consequences for all those involved.\nhttps://t.co/1TJ7A3H6A4","date":"Tue Feb 15 01:09:53 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#ICYMI I joined @HudsonInstitute and @RepGregStanton to discuss why U.S. antitrust regulators must scrutinize foreign subsidies in M&amp;A to protect fair competition. Watch the event at the link below ⬇️","date":"Fri Feb 11 18:33:44 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Inflation surged to a 40-year high in January. This is certainly not what I imagined when the President said he wanted to build back better. This Administration's agenda does not work for the American people.\nhttps://t.co/0PM9ZdmwEn","date":"Thu Feb 10 17:30:21 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you RM @RepBost, @RodneyDavis, @RepMMM, @RepJackBergman, @RepLaMalfa, @congbillposey, @RepHuizenga, and @RepDanCrenshaw for joining me in this effort.","date":"Wed Feb 09 17:15:47 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m joining @taureansmall to discuss my new bill, the Vaccine Discharge Parity Act. This bill will ensure that servicemembers are not denied their G.I. bill education benefits solely for refusing the COVID-19 vaccine. We should reward our veterans, not punish them. https://t.co/EFzTaLHu3d","date":"Wed Feb 09 17:06:14 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"On Friday, tune into @HudsonInstitute where @RepGregStanton &amp; I will discuss our bipartisan bill to counter #CCP efforts to distort U.S. markets by giving antitrust regulators the information they need to identify foreign gov't subsidies. Register here ⬇️\nhttps://t.co/mpnXjAk4xm","date":"Wed Feb 09 14:09:17 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I agree that #NordStream2 must be halted, but once again, President Biden is promising action that is too little too late. Democrats have chosen politics over sanctioning Russia’s pipeline at every opportunity.\nhttps://t.co/mtXIFvMzJh","date":"Tue Feb 08 19:00:01 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If the FTC and the Biden Administration stray from the rule of law, unelected bureaucrats will be empowered to micromanage the American economy and inflation will continue to rise. I spoke about this issue today on the House floor ⬇️\nhttps://t.co/1HBvmayZRB","date":"Tue Feb 08 17:15:26 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Our country is experiencing historically high levels of fentanyl seizures, yet Democrats blocked GOP backed legislation last week that would ban the sale of fentanyl. The lack of leadership on this issue is unbelievable.","date":"Mon Feb 07 21:56:59 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, I voted against the Democrats' COMPETES bill. The CCP has proven to be a threat to American security and this bill falls considerably short of a meaningful response. My full statement ⬇️\nhttps://t.co/lxQUHej8Kn","date":"Fri Feb 04 20:26:12 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Americans know the border is a disaster. I joined my colleagues in demanding detailed data so Congress can take action. Thank you, @RepBenCline for leading this effort.","date":"Fri Feb 04 02:10:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It was great discussing how we can ensure music artists get paid for their work, especially when it is played overseas, with @GloriaEstefan and others today at a @JudiciaryGOP hearing. Congress must bring these stakeholders together to find consensus on music IP rights.","date":"Thu Feb 03 02:45:11 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats' \"tough on China\" bill includes ⬇️\n\n❗️No sanctions on China\n❗️No investigation into the origins of COVID-19\n❗️Mentions “Coral Reef” more times (383) than “China” (373)\n\nThis reads more like a rehash of the Green New Deal – not a measure to help us compete against China.","date":"Wed Feb 02 20:23:33 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I am relieved to hear the news today that Sue Borries and Deb Velleman have been recovered and will soon be brought home to their families. I pray that the families find closure and healing during this immensely difficult time. My full statement. ⬇️ https://t.co/XjnJ5oeV5Q","date":"Wed Feb 02 01:41:49 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, we celebrate #NationalFreedomDay.\n \nI invite everyone to join me in celebrating this important day in American history, a nod to our nation’s commitment to liberty for all.","date":"Tue Feb 01 17:16:38 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was pleased to formally congratulate Akshat, Akash, and Thevindu from Brookfield East High School for their ingenious app creation and for winning the 2021 Congressional App Challenge. The trio created an app to solve the traveling salesman problem for bus drivers. Well done! https://t.co/DME3LkBC1y","date":"Thu Jan 27 19:08:41 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This #HolocaustRemembranceDay marks the 77th anniversary of the liberation of Auschwitz-Birkenau. Today, we honor the millions of lives lost to this evil. We also honor the survivors who live to tell the story that we must never forget. https://t.co/E4Cvnol76a","date":"Thu Jan 27 17:34:17 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a great time meeting with folks from Dodge and Jefferson Counties today at my Mobile Office Hours. Thank you to everyone who showed up and asked thoughtful questions about the work I’m doing in Washington, DC on behalf of Southeast Wisconsin. https://t.co/7EI6PTcR7q","date":"Wed Jan 26 02:28:41 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Latest @CBP report: 178,840 enforcement encounters at the southern border in Dec., a 142% increase from last Dec., and it’s the worst Dec. on record.\n\nAmericans should be outraged that an entire year has passed with no action from President Biden to alleviate the border crisis.","date":"Tue Jan 25 19:31:48 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This #NationalSchoolChoiceWeek I want to celebrate the more than 575,000 students who are served by educational choice programs. The first school choice program was born in Southeast Wisconsin, and it is my priority in Congress to ensure families continue to enjoy this freedom. https://t.co/iVtfQ22yTN","date":"Tue Jan 25 16:44:39 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today marks the 49th anniversary of Roe v. Wade. \n\nI spoke on the House floor this week to mourn the estimated 62 million innocent lives that have been lost since this decision and to take a stand for #ProLife values. https://t.co/uBDqdV1PqV","date":"Sat Jan 22 14:00:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Economists from @geoffmanne to Larry Summers agree that the Biden Administration’s actions under the guise of competition would only increase the inflation we’ve seen from Democrats’ reckless spending. WATCH ⬇️\nhttps://t.co/ZhwIwJyJNJ","date":"Fri Jan 21 21:58:24 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined my House and Senate colleagues in requesting the DHS IG provide a full report on the Biden Administration’s disastrous handling of the border crisis. Full story and letter below ⬇️","date":"Fri Jan 21 16:54:32 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m proud to be a part of this bipartisan resolution. These heroes deserve our honor and as members of Congress we must condemn this heinous terrorist attack and stop antisemitism in its tracks.","date":"Fri Jan 21 14:23:18 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This has been a year of crisis under the leadership of President Joe Biden. At the southern border, where ⬆️ 1.7M immigrants have been encountered, our country was noticeably lacking leadership and solutions from the White House.\n\nWATCH 📺\nhttps://t.co/BtomTsz6TD","date":"Fri Jan 21 00:00:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined @FinnertyUSA this morning on @newsmax to discuss President Biden's mounting policy failures during his first year in office. Watch ⬇️\nhttps://t.co/s6UZJb1qHg","date":"Thu Jan 20 21:02:34 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @FinnertyUSA on @newsmax this morning at 6:30 AM CT. Be sure to tune in.","date":"Thu Jan 20 12:06:15 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"With Democrats unable to pass legislation to federalize elections, the Biden Administration is trying to do so by executive order. I joined my colleagues from the Election Integrity Caucus in demanding answers regarding federal plans to take over elections.","date":"Wed Jan 19 22:13:44 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"(1/2) President Biden can no longer ignore the Iran-China partnership &amp; the threat it poses to U.S. interests. The President should reinstate Iran sanctions imposed by the Trump Admin. and take a proportionate response to China’s aggressive behaviors.\nhttps://t.co/BV7cND9RCJ","date":"Wed Jan 19 19:29:43 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"(2/2) I wrote about the the Comprehensive Strategic Partnership last year and its imminent threat. President Biden must take off the kid gloves and start treating China and Iran like the adversaries they are. ⬇️\nhttps://t.co/jV0vreXdZZ","date":"Wed Jan 19 19:29:43 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to have earned an A+ on @SBAList’s pro-life Scorecard. In Congress, I've made it a priority to support bills that protect unborn lives and prohibit taxpayer funding for abortions. Thank you @SBAList for this recognition. I'll always stand for #ProLife values.","date":"Wed Jan 19 15:45:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"NIH must provide data on the impact pandemic-related policies had on the American people. Understanding the ramifications is the only way we can prepare our country for future challenges. Thank you @RepGregMurphy for leading this important letter.\nhttps://t.co/Tf22iP2YfA","date":"Tue Jan 18 20:40:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Not to mention, inflation is tracking at the fastest pace in 4 decades, ⬆️ 1.7M illegal immigrants have been encountered at the border, &amp; the President's approval rating is at an all-time-low of 33%. This has been a year of crisis, no doubt.","date":"Tue Jan 18 19:16:39 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today we celebrate the life and legacy of Dr. Martin Luther King Jr. His courage and tireless work to make our nation a more perfect union has defined the values we hold as Americans to this day. \n\nI invite everyone to join me in celebrating #MLKDay.","date":"Mon Jan 17 22:57:39 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Contrary to Democrats’ fear mongering campaign, there is no voting rights crisis and H.R. 5746 is not about ensuring access to the polls. This bill takes power from states and concentrates our election systems in the hands of federal bureaucrats. WATCH ⬇️\nhttps://t.co/oRzO41lUSx","date":"Thu Jan 13 21:49:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I am pleased to see #SCOTUS confirm what we’ve known all along—President Biden’s vaccine mandate on employers is an overburdensome and unconstitutional directive. Read my full statement ⬇️\nhttps://t.co/s0ZHq9RAJi","date":"Thu Jan 13 20:06:27 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is the fastest pace on record and just the latest proof of the Administration's disastrous economic policies. Pres. Biden is making life more expensive for Americans and has made no indication of trying to improve this highly inflationary environment.\nhttps://t.co/vAbDZF2YYi","date":"Thu Jan 13 15:42:40 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday, I intro’d a motion to HR 1836 to ensure Pres. Biden’s vaccine mandate doesn't rob veterans who have served our country from their hard-earned G.I. benefits. Predictably, Democrats voted it down. This is a slap in the face to our nation's heroes.\nhttps://t.co/C1HghgC6kc","date":"Thu Jan 13 14:01:10 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @VickiMcKenna this afternoon at 2:15 PM CT on @newstalk1130 ⁠— tune in here 📻 ⬇️\nhttps://t.co/Ie936hLVKO","date":"Wed Jan 12 19:40:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@WSJ: U.S. Inflation Reaches Fastest Pace in Four Decades\n\nIs the Biden Administration still labeling this as transitory?\nhttps://t.co/LgvN0TLAJ6","date":"Wed Jan 12 15:08:08 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This raises serious concerns about the Education Dept.'s involvement in the NSBA's rescinded letter labeling parents as domestic terrorists. Sec. Cardona owes Congress and the American people answers regarding his role in this egregious anti-parent letter.\nhttps://t.co/ViB9t9DOMT","date":"Tue Jan 11 21:51:33 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"ICYMI 📺\n \nLast night I joined @LizMacDonaldFOX on @FoxBusiness to discuss Democrats' unprecedented partisan theatre over the past year.\n \nWatch here ⬇️\nhttps://t.co/cXehizEFUm","date":"Tue Jan 11 16:41:34 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'll be joining @LizMacDonaldFOX on @FoxBusiness tonight at 5:15 PM CT to discuss teachers unions latest efforts to burden in-person learning. Be sure to tune in.","date":"Mon Jan 10 21:45:00 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today I want to thank our men and women in blue. They are on the frontlines working to support and safeguard our communities 24/7 and deserve recognition for their service. #LawEnforcementAppreciationDay","date":"Mon Jan 10 00:32:46 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Bad policies breed bad jobs reports, but I don’t expect the President to begin taking accountability after missing expectations all year.","date":"Fri Jan 07 18:43:41 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The President created more division, not unity, in his speech today. The VP shamelessly likened Jan. 6th to Sept. 11th and Pearl Harbor—both attacks that left thousands of Americans murdered.\n\nThis isn't leadership; this is theatre to distract from this Administration's failures.","date":"Thu Jan 06 16:46:40 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congress should pass my bill, the CRT Transparency Act.\n \nThis legislation would ensure local school districts post the curriculum for each grade of their elementary and secondary schools on a public website as a condition of Title I funding to states &amp; local school districts.","date":"Wed Jan 05 19:35:19 +0000 2022","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m wishing everyone a safe and Merry Christmas today! 🎄","date":"Sat Dec 25 17:34:08 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congratulations to Akshat, Akash, &amp; Thevindu for winning the Congressional App Challenge in SE #WI 5th District this year! These 3 Brookfield East High students created an app that will help school bus drivers determine the fastest bus route to maximize time and fuel efficiency. https://t.co/1pvMr94rS8","date":"Wed Dec 22 16:00:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Mask mandates on children lead to learning loss that harms early childhood development. That is why I joined my colleagues in demanding answers from Head Start on what factors they considered when imposing a mask mandate on children as young as 2 years old.","date":"Tue Dec 21 19:54:37 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Best of luck to the @UWBadgers Women’s Volleyball team as they head to the @NCAAVolleyball National Championship! #OnWisconsin","date":"Fri Dec 17 19:57:45 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Fentanyl is coming over our southern border in vast quantities. The consequences are deadly &amp; rob families of loved ones. Pres. Biden must fix the border crisis &amp; Congress should pass the SOFA Act to close loopholes cartels use to evade prosecution for trafficking this poison.","date":"Thu Dec 16 16:58:41 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I encourage everyone to join in on “Operation Cheesehead.” The mission is simple, write a letter thanking our sailors aboard the #WI built USS Milwaukee LCS-5 ship that is deployed this Christmas! This is a terrific way to thank our service members. Details on the address ⬇️ 📬 https://t.co/WSJrpkqwFh","date":"Wed Dec 15 21:43:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wholesale prices are ⬆️ 9.6% from a year ago—the fastest pace on record—&amp; Democrats are trying to rush trillions in spending that would add more fuel to the fire before Christmas. The President needs to end these reckless policies and focus on growing our economy, not inflation.","date":"Tue Dec 14 14:49:36 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#GoArmyBeatNavy","date":"Sat Dec 11 14:45:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The President’s mandates are bad for Americans and bad for businesses. \n \nI oppose these overreaching actions and I am proud to join @EdLaborGOP in this effort.","date":"Fri Dec 10 21:36:53 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"How it started vs. How it's going...\n \n@HouseGOP stands for the middle class. https://t.co/a29IvSuBFm","date":"Thu Dec 09 20:39:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"While the President lets deadly fentanyl pour across the border, my @HouseGOP colleagues and I have introduced actual solutions in Congress to address this crisis.\n \nThe border crisis is a drug crisis and it's far past due for President Biden to do something about it. https://t.co/MmdeHxL4E3","date":"Thu Dec 09 14:13:25 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The President’s vaccine mandates wrongly put hardworking Americans at risk of losing their job. I welcome the news of today’s ruling that halts this executive overreach.","date":"Tue Dec 07 20:52:47 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"80 years ago today, we lost 2,403 brave Americans in the fateful morning attack on #PearlHarbor. Today, we pay our respects to those who made the ultimate sacrifice and the heroes who fought on to protect our country in WWII. #PearlHarborRemembranceDay https://t.co/6El7HveXCi","date":"Tue Dec 07 15:32:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I am saddened to hear the news of the passing of former Senator Bob Dole. He is a true statesman and I will remember him not only for his service to our country, but also his infectious humor and tenacity. My thoughts are with his family during this difficult time.","date":"Sun Dec 05 20:15:40 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"How many bad jobs reports will it take for the Biden Administration to understand their Big Government &amp; Big Spending agenda isn’t working for the American people? Missing expectations is the new norm for this Administration.\nhttps://t.co/cLqd5C0mFt\nhttps://t.co/cLqd5C0mFt","date":"Fri Dec 03 19:40:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden Administration’s energy agenda puts the U.S. in a weak position. The President’s policies have cost jobs, diminished our energy independence, and made gas prices soar across the nation. I spoke about this issue on the House floor this week ⬇️ 📺 https://t.co/cUELQuOnXH","date":"Fri Dec 03 18:04:41 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The entire Russia-gate scandal is a vicious circle that begins and ends with the Clinton campaign. @JudiciaryGOP should investigate those behind the Steele Dossier and its fabrications. https://t.co/c3oyZQtk8B","date":"Fri Dec 03 03:11:10 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, SCOTUS heard oral arguments for Dobbs v. Jackson Women’s Health Organization. This is the most vitally important #ProLife case in a very long time. I took a moment to speak on this case tonight on the House floor. 📺 ⬇ https://t.co/NMllxpay3N","date":"Wed Dec 01 22:55:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy to join the team at Compeer Financial in Johnson Creek to talk about the key issues affecting the Farm Credit System—an important benefit to Wisconsin agriculture. https://t.co/3s1OI3IPDr","date":"Wed Dec 01 20:14:48 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"From mandated shutdowns and supply chain disruptions to worker shortages, keeping doors open for business has been tough, &amp; Pres. Biden's policies have only exacerbated these issues. As a former #SmallBiz owner, I will always work to eliminate red tape &amp; pass pro-growth policies.","date":"Wed Dec 01 15:01:24 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Tonight I was joined by my Wisconsin colleagues to request a moment of silence on the House floor in honor of the Waukesha Christmas Parade victims. I am praying for peace and strength for the entire community.\nhttps://t.co/SyXcmW54k3","date":"Wed Dec 01 01:49:53 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Pres. Biden wants to distract Americans from his disastrous energy policies by having the FTC investigate gas companies. I co-led a letter with 19 of my colleagues to tell the President to stop pointing fingers &amp; hurting Americans’ pocketbooks at the pump.\nhttps://t.co/WAgojmWGEs","date":"Mon Nov 29 20:33:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Terrorist groups, like FARC, are still heavily involved in illicit gold mining and trafficking. Rather than lifting them from the FTO list, Biden should work with @SenTedCruz, @repdarrellissa &amp; I to combat the flow of illegal gold used to fund terrorism.\nhttps://t.co/7iMrj3X5AW","date":"Mon Nov 29 19:53:39 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This Thanksgiving I am praying for healing for Waukesha &amp; all those impacted by the tragic attack at the Christmas parade. This week is somber, but I know our community is resilient. I’m thankful for the fine people of this community &amp; know that we will get through this together.","date":"Thu Nov 25 19:31:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I continue to monitor the situation as full details come to light and I’m thankful for all of the first responders who are answering the call for help.","date":"Mon Nov 22 02:00:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m praying for the safety of all those impacted by the senseless tragedy in Waukesha this evening. If you are searching for family, please go to the Waukesha Metro Center, 212 E Saint Paul Ave.","date":"Mon Nov 22 01:47:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wishing all the hunters a safe and successful hunt this deer season! #openingday https://t.co/Oykz4dde3Y","date":"Sat Nov 20 14:32:49 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m a proud cosponsor of @RepAndyHarrisMD’s important legislation to protect the conscience rights of healthcare providers. No healthcare worker should be forced by their employer to take an unborn life. This protection is needed now more than ever.","date":"Fri Nov 19 21:14:53 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I voted against H.R. 5376 today — the Democrats' 'Build Back Bankrupt' bill. My full statement ⬇️ https://t.co/NDFEGOg2pb","date":"Fri Nov 19 15:00:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @FinnertyUSA on @newsmax this morning at 7:30 AM CT. Tune in!","date":"Fri Nov 19 13:17:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I support the ‘Parents Bill of Rights’ because I believe parents should play a central role in their children’s education. The rights outlined are basic and fundamental, take a look. ⬇️ 🔎","date":"Thu Nov 18 20:14:21 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was glad to join my colleagues on this legislation to honor the heroic efforts of these 13 brave service members who paid the ultimate sacrifice while evacuating U.S. citizens and our Afghan allies this summer. Thank you, @RepLisaMcClain for leading this effort.","date":"Thu Nov 18 19:36:16 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In a @HSBCgop hearing, I asked SBA Administrator Guzman about the science behind Pres. Biden’s 100 employee threshold for the workplace vaccine mandate…based on the Administrator’s answer it seems this burdensome decision wasn’t based on health or science at all. WATCH 📺 ⬇ https://t.co/R7JV85SGKw","date":"Wed Nov 17 22:19:57 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @VickiMcKenna soon at 3:35 PM CT to discuss the DOJ’s coordinated effort to investigate parents and AG Garland’s seemingly false testimony he gave to Congress last month. Be sure to tune in.","date":"Wed Nov 17 21:19:43 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A COVID-19 vaccine mandate should never be pushed on the American people. Proud to join @RepFredKeller  my GOP colleagues in introducing a resolution to invalidate Pres. Biden’s workplace vaccine mandate.","date":"Wed Nov 17 18:31:53 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A DOJ whistleblower has come forward with evidence directly contradicting AG Garland’s testimony before Congress last month. Why did the AG provide inaccurate information? Parents should not be targeted for getting involved in their child’s education.","date":"Tue Nov 16 22:17:47 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"@RepGrothman Thank you, @RepGrothman!","date":"Tue Nov 16 21:14:21 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday, a federal court granted a permanent injunction in a lawsuit I supported to overturn the Biden Admin’s unconstitutional plan to ban states from cutting taxes. This decision sends a strong message that the federal government has no business in dictating state tax policy.","date":"Tue Nov 16 19:45:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Inflation is a tax on low- &amp; middle-income Americans. The White House can shift blame as much as they want, but it won’t change the reality that their policies are directly responsible for making life more expensive for everyday Americans.\nhttps://t.co/mEOMun4vnT","date":"Tue Nov 16 16:45:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Excited to kick off the 7th Annual National Apprenticeship Week. Apprenticeships play a critical role connecting workers with opportunities to learn-and-earn while on the job. As a @EdLaborGOP Member, I look forward to expanding access to these career-building programs. #NAW2021","date":"Tue Nov 16 15:42:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a great time joining Trinity St. Luke’s students yesterday at their Program of Thanks to honor our nation’s veterans. I was given the opportunity to speak to the students about the importance of the American flag and what it means to veterans. https://t.co/f2lfeko0Gy","date":"Sat Nov 13 18:51:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you Allenton Elementary for allowing me to join you yesterday to celebrate #VeteransDay and celebrate our guests of honor! https://t.co/OKzBzEh5dW","date":"Fri Nov 12 19:15:37 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden Administration has downplayed the full scope of military equipment left behind for the Taliban. This “parade” is alarming, and Pres. Biden should immediately answer @GOPLeader's call for a detailed accounting of supplies left during our botched withdrawal.","date":"Fri Nov 12 17:47:12 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"God bless our veterans, today we honor you and all that you do for our country. Freedom isn't free. 🇺🇸 https://t.co/COA1VI0JR9","date":"Thu Nov 11 17:17:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Good on WASB for this decision and for keeping parent &amp; student interests at the forefront of their mission. The @NSBAPublicEd's letter to the DOJ wrongly targeted parents and I’m glad to see Wisconsin join the growing number states to oppose this unacceptable behavior.","date":"Wed Nov 10 16:04:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Each day it becomes clearer that #Russiagate was just another Clinton hit job on the Trump campaign.\nhttps://t.co/Y0N9Mojnv9","date":"Wed Nov 10 14:27:34 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsinites have President Biden and Democrats’ anti-growth agenda to thank for this year's highly-priced and low-stocked Thanksgiving dinner. #ThanksgivingTax\nhttps://t.co/SutqscntnD","date":"Tue Nov 09 21:36:18 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a great time meeting service academy applicants today back in SE #WI. These young men and women are taking an enormous step in their journey to serve our country and I was glad to learn more about them. It's clear to me each applicant has a lot to be proud of! https://t.co/HpKceqmpkt","date":"Sat Nov 06 20:21:49 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Americans depend on the trucking industry to get things where they need to be, but we desperately need more drivers. I joined my colleagues to call on the Biden Admin. to tear down the red tape and expand the age eligibility to become a truck driver.\nhttps://t.co/6zTR91LNri","date":"Sat Nov 06 14:30:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My statement on tonight's votes. ⬇️ https://t.co/s67HBzMuwT","date":"Sat Nov 06 05:08:33 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"On par with their border security strategy thus far, the Biden Administration is doing zip about the mass caravan headed to the southern border right now.\n\nThank you @RepStefanik &amp; @SenTedCruz for leading this effort to demand DHS take immediate action.","date":"Fri Nov 05 17:30:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Pelosi moving full force ahead on a 2K+ pg bill JUST released yesterday. Estimates clock the bill in at trillions of dollars, but there's no CBO score making it impossible to get an exact figure. I guess she wants her members to pass it before they can learn what's in it…again.","date":"Fri Nov 05 15:22:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Students need education that is sensitive to the thoughts and concerns of students, parents, &amp; teachers.\n\nUnfortunately, President Biden and Democrats want to nationalize education and put bureaucracy before students. WATCH 📺 ⬇️\nhttps://t.co/OHXmcE74pV","date":"Thu Nov 04 15:36:20 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A $1B payout to illegal immigrants will only further incentivize more migrant surges at the border. In what world does Pres. Biden think this is a good idea? This plan must be stopped.","date":"Thu Nov 04 13:39:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"President Biden couldn't have picked a worse time to slap his mandate on job creators as we head into the holiday season - which depends on a robust workforce.\n\nMy full statement on the Biden Administration's misguided vaccine mandate. ⬇️ https://t.co/7GfMvFrkQ9","date":"Thu Nov 04 13:21:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Gov't spies take on a whole new meaning in Pres. Biden’s multi-trillion-dollar spending bill. Democrats intend to pay for their plan by allowing the IRS to spy on your bank account under the guise of closing the tax gap. My latest on this invasive plan. ⬇️\nhttps://t.co/f4lAQiGYn3","date":"Wed Nov 03 21:21:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"NYSRPA v. Bruen was heard before SCOTUS today. The importance of this case cannot be understated as it could have ramifications for law-abiding gun owners who rightfully wish to conceal and carry. That's why I joined @RepTenney on an amicus brief to support the #2A.","date":"Wed Nov 03 18:37:33 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Pres. Biden &amp; Democrats are proposing the biggest tax increase for Main Street in 50+ years. Small business owners deserve an opportunity to chase the American dream, but as it stands, the multi-trillion-dollar reconciliation would rob this opportunity.\nhttps://t.co/84F0sRFwQs","date":"Wed Nov 03 16:47:15 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you @RepDonaldsPress for holding a press conference today to expose the extreme proposals in the Democrats’ multi-trillion-dollar spending plan. This reconciliation package doubles down on Pres. Biden’s policy failures and does little to improve America's infrastructure. https://t.co/vuAQhBI8Tk","date":"Tue Nov 02 22:01:40 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In many states, citizens must prove a special need to access their 2nd Amendment right to self-protection. This is wrong and unconstitutional. I joined @RepTenney &amp; @HouseGOP colleagues in an amicus brief for NYSRPA v. Corlett to ensure this right is available to all Americans. https://t.co/y9tU1AWGsW","date":"Tue Jul 20 21:56:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This confirms what we already knew. President Biden and Democrats have failed to secure our border, grow the economy, or stem the rise in crime across America. @HouseGOP has solutions but Democrats continue to stonewall any open dialogue on important issues facing the country.","date":"Tue Nov 02 18:28:25 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"November is Military Family Month. As a member of the Military Family Caucus &amp; formerly with the Army Reserve, I know how important it is to support the families of those who serve. They sacrifice much so I invite everyone to join me in recognizing their strength &amp; resilience. https://t.co/5AjGVJFuTH","date":"Mon Nov 01 20:32:45 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a great time joining the Wisconsin Bankers Association yesterday at their 2nd Annual Leaders in Banking Excellence program. Wisconsin banks played a pivotal role in supporting our communities during the pandemic and I’m happy to recognize their hard work! https://t.co/jBK7jpT2pt","date":"Sat Oct 30 16:16:17 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I saw illegal immigrants being put on flights across the U.S. firsthand when I toured the southern border w/ @CBP. President Biden owes the American people answers and transparency. I joined my colleagues in asking the President to do exactly that.","date":"Fri Oct 29 19:31:55 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It pays to be an illegal immigrant. Now Pres. Biden wants to pay $1B + to illegals. This is insanity. For context, this payout is more than what some families of 9/11 victims received. What a slap in the face to hardworking families in Wisconsin.\nhttps://t.co/3fnNHmFnHK","date":"Thu Oct 28 21:00:31 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"“Parents have an undisputed right to direct the upbringing and education of their children, including expressing concerns about the inclusion of controversial curricula in their child’s education.”\n\nProud to join @JudiciaryGOP on this important investigation.","date":"Thu Oct 28 16:59:15 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The U.S. shouldn't return to the negotiating table with Iran. Appeasement failed for Obama &amp; it'll fail again. Pres. Biden’s approach to Iran is too soft and lacks direction beyond reviving a failed agreement. We must return to a maximum pressure strategy.\nhttps://t.co/TDlrgvkg3w","date":"Thu Oct 28 14:43:58 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"H.R. 2377 is a Red Flag law written by the Biden Administration &amp; the Attorney General to take property &amp; gun rights away from law abiding gun owners. Red Flag laws violate 2nd Amendment rights without due process which is why I strongly opposed this bill in @JudiciaryGOP today. https://t.co/DTDLkQ1IRz","date":"Wed Oct 27 19:33:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It’s unfortunate that this legislation was prompted by a sexual assault that should have been prevented. I’m proud to join @RepStefanik on this important bill to ensure these crimes are taken more seriously by the courts.\nhttps://t.co/b16U3XCKQA","date":"Wed Oct 27 15:25:16 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today we honor the veterans who have and who continue to serve our country. I am eternally grateful for their immeasurable sacrifices to keep our nation safe and free. Thank you to all who have served. 🇺🇸","date":"Tue Oct 26 15:35:48 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In light of the National School Board Association’s apology for targeting parents in their letter to the White House, AG Garland must also revoke his school board memo issued at the behest of the NSBA. Parents should not ever be threatened when advocating for their student.","date":"Mon Oct 25 19:28:38 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"During my line of questioning at @JudiciaryGOP, AG Garland confirmed that the Durham investigation is ongoing and reports indicate more grand jury subpoenas are coming. This investigation must continue without interference from the Biden Administration.\nhttps://t.co/JMN2DbdHjR","date":"Fri Oct 22 21:44:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @LizMacDonaldFOX on @FoxBusiness tonight at 5:15 PM CT to discuss Attorney General Garland's disappointing appearance at a @JudiciaryGOP Hearing. Be sure to tune in.","date":"Fri Oct 22 21:15:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"AG Garland is using the DOJ to pursue President Biden's liberal agenda.\n \nThe latest target? Parents.\n \nI joined @FinnertyUSA on @Newsmax to talk about AG Garland’s memo that threatens parents who speak up for their children’s education. Watch 📺 ⬇️ https://t.co/qGEBYBPFDf","date":"Fri Oct 22 18:11:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Infrastructure is NOT amnesty. I spoke on the House floor yesterday about the Democrats’ $5.5T spending package that grants amnesty to millions of illegal immigrants which some studies predict would cost taxpayers another $1T. https://t.co/vm9bxLqJMC","date":"Fri Oct 22 14:18:39 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @FinnertyUSA this morning to talk about Attorney General Garland's appearance at @JudiciaryGOP. AG Garland had a lot to answer for but little to say yesterday. Tune into @newsmax at 7:30 AM CT.","date":"Fri Oct 22 12:11:14 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m joining @VickiMcKenna soon on @newstalk1130 to talk about AG Garland’s testimony at @JudiciaryGOP today. Tune in!","date":"Thu Oct 21 19:07:29 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"These parents should be applauded for speaking out. Instead, they’ve been attacked by the media, labeled as criminals by Biden’s Justice Department and now silenced by House Democrats. We will not let their pleas go unanswered.","date":"Thu Oct 21 15:11:37 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Is blanket amnesty for 8M+ illegal immigrants infrastructure? If you ask Joe Biden &amp; Democrats, the answer is yes.\n\nTucked away in the Biden-Sanders $5.5T spending package is a proposal that does exactly that. My latest column on this dangerous proposal ⬇️\nhttps://t.co/FAWEArDEw2","date":"Thu Oct 21 14:49:31 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Highly concerning that former union lawyers are deciding the fate of the franchise business model. I agree w/ @VirginiaFoxx &amp; @EdLaborGOP. Biden’s NLRB appointees should be held to the same standard as Trump’s appointees were. These conflicts of interest are too strong to ignore.","date":"Wed Oct 20 21:50:21 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m leading a bipartisan bill to help antitrust regulators follow the money &amp; ensure countries like China aren’t distorting markets through foreign subsidies.\n \nTY @RepGregStanton @RepLoudermilk @RepSpeier for joining me on this important issue. ⬇️\nhttps://t.co/opKsne74CE","date":"Wed Oct 20 15:49:03 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Quick look at the alarming provisions in Joe Biden's $5.5T tax and spend plan ⬇️ 🔎\n \n🚨 Taxpayer-funded abortions\n🚨 Amnesty for 8M+ illegal immigrants\n🚨 TRILLIONS of $$ in new taxes\n🚨 IRS surveillance program to monitor your spending\n🚨 Green New Deal policies","date":"Tue Oct 19 21:08:19 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Disturbing if true. People have little confidence in Washington and this is just more evidence of why Americans have lost faith in our public health ‘leaders.’\nhttps://t.co/QQTRfH7t8f","date":"Mon Oct 18 20:15:36 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"President Biden cost Wisconsinites jobs and higher gas prices just hours after he was sworn into office by halting the #Keystone Pipeline. Now he’s promoting foreign oil to make up for his mistakes. I joined my colleagues in calling out the President’s anti-American agenda.","date":"Thu Oct 14 18:44:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Recent reports indicate that AG Garland’s son-in-law may have financial stake in silencing parents who speak up for their students. I joined my @JudiciaryGOP colleagues to demand an ethics inquiry.","date":"Wed Oct 13 20:41:14 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"First they said flatten the curve. Then they said stop the spread. Then they said to get vaccinated and you can take your mask off. Then it was you must wear a mask regardless of vaccination. Now it’s vaccine mandates at work or get fired. What’s next?\nhttps://t.co/2A8DdFdUOE","date":"Wed Oct 13 16:21:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats have embarked on a massive and unprecedented deficit spending spree since taking control of Congress and the White House. My statement on their vote tonight to increase the debt ceiling. ⬇️ https://t.co/yctTtR7B99","date":"Tue Oct 12 23:33:42 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I could go on about the awful proposals included in the Dems’ $5.5T tax &amp; spend package, but one line item rarely talked about is their plan to provide amnesty to over 8M illegal immigrants.\n\nTruth is, Pelosi doesn't want Americans to know what's in this \"comprehensive\" package.","date":"Tue Oct 12 20:00:43 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsin is home to nearly 65,000 farms spanning 14.3 million acres. This #NationalFarmersDay I want to thank every single farmer for their tireless work around the clock to keep the nation well-fed! https://t.co/zqig41gXfv","date":"Tue Oct 12 19:14:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Interested in West Point? Come meet current cadets and talk with admissions staff about the application process and life at West Point before the @ArmyWP_Football vs. @BadgerFootball game this Saturday.\n \nMore info here ⬇️\nhttps://t.co/vQBm6xOA2H","date":"Mon Oct 11 13:00:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Another dismal jobs report and the worst of the year so far. Pres. Biden needs to focus on pro-growth policies, not policies that raise taxes, fan the flames of inflation and incentivize workers to stay home. These policies devastate Main Street &amp; Wisconsin cannot afford them.","date":"Fri Oct 08 20:04:55 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Biden continues to neglect the very crisis he enabled at the border. We’re past 1.2M apprehensions this year &amp; the trend shows no signs of slowing. I joined my colleagues in demanding answers from the President himself. It’s past due the Admin. take the border crisis seriously.","date":"Fri Oct 08 19:17:21 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"(2/2) This is precisely why I introduced the CRT Transparency Act, a bill that would ensure schools make their curriculum publicly available online to increase transparency in schools. My @EdLaborGOP colleagues and I want to encourage parent engagement, unlike the Biden Admin. https://t.co/rsoUAa8hKZ","date":"Thu Oct 07 20:16:04 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"(1/2) Parents who advocate for their children’s education should be applauded not labeled as a threat and intimidated to stay silent as @DOJ &amp; @usedgov have recently done. Proud to join my colleagues in demanding accountability from the Biden Admin for these recent scare tactics.","date":"Thu Oct 07 20:16:03 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@WSJ: The IRS Wants to Look at Your Bank Account\n\nYes, you read that right. The Democrats' $3.5T spending bill would allow the IRS to examine every account ⬆️ $600 balance or w/ more than $600 of transactions in a year. This should concern every American.\nhttps://t.co/pIp6yN3VvE","date":"Tue Oct 05 15:01:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@FTCPhillips &amp; I wrote for @newsweek about the need for antitrust regulators to receive disclosure of foreign financial support when evaluating mergers and acquisitions. We must follow the money in order to counter China's economic aggression.\nhttps://t.co/zotn38lpeq","date":"Mon Oct 04 16:21:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy #ManufacturingDay! Manufacturers play a big role in #WI connecting nearly 500,000 workers with high-skilled and good paying jobs. Wisconsin’s excellence in manufacturing will secure our state’s prosperity for generations to come. Manufacturers – thanks for doing all you do! https://t.co/4INvoG5JEl","date":"Fri Oct 01 14:09:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a great time meeting with Milwaukee Executive Commissioner David Crowley yesterday! We had a productive meeting where we discussed opportunities to benefit Milwaukee County in SE #WI. https://t.co/3auYxbDEmS","date":"Fri Oct 01 13:05:51 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My statement on the continuing resolution. ⬇️ https://t.co/IPbWhDBDrD","date":"Fri Oct 01 00:53:54 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This week Democrats are pushing a $1.2T infrastructure bill of which only $625 billion in new spending is used on actual hard infrastructure—like bridges and roads.\n\nThis isn’t about generational change, this is about generational debt. https://t.co/1OVQVEzs4e","date":"Thu Sep 30 15:04:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Another attack on our border patrol agents who have essentially been abandoned by this Administration. With border apprehensions at a 21-year high we should be giving more resources to our border patrol, not threatening them with termination notices.\nhttps://t.co/4QihL1SpBM","date":"Thu Sep 30 13:32:31 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"FTC's abuse of power must be reigned in. Antitrust regulators already have the authority to ensure competition in the labor market. I agree with @CSWilsonFTC that the hammer of antitrust enforcement should not be used to turn every social goal into a nail.\nhttps://t.co/nutXM1R47R","date":"Wed Sep 29 15:23:07 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining the @DanODonnellShow this morning at 9:35 AM CT to talk about the Democrats' partisan $5.5 trillion dollar infrastructure and budget reconciliation package. Tune in 📻⬇️ \nhttps://t.co/U6m2VMe9bQ","date":"Wed Sep 29 14:00:32 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden Admin’s China policy is to put politics ahead of national security. I stand behind my colleagues @Jim_Jordan &amp; @RepAndyBiggsAZ in their pursuit for answers on the DOJ’s dismissal of charges against 6 #CCP spies.","date":"Tue Sep 28 20:45:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great talking with @taureansmall today about the combined $5.5 trillion infrastructure &amp; budget reconciliation package. This package will raise taxes, worsen inflation, and hurt hardworking Wisconsinites. I will oppose these reckless proposals. https://t.co/Yp9qpl5nRl","date":"Tue Sep 28 19:53:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This crisis begins in China where the precursor chemicals are manufactured and then used in Mexico to produce large amounts of fentanyl. The Biden Administration can combat fentanyl trafficking by securing the southern border, but current policies have hurt not helped.","date":"Tue Sep 28 14:30:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m pleased to announce my office will be participating in the Congressional App Challenge this year. I encourage interested students from the Fifth District to develop a software application for a chance to win! Learn more here ⬇️\nhttps://t.co/FhjGzoJBJM","date":"Mon Sep 27 22:41:08 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Drug traffickers are using fake pills sold outside the licensed pharmacy system but marketed as legitimate, wreaking tragedy &amp; violence on our communities. Pres. Biden must secure the border &amp; Congress must permanently designate fentanyl as a schedule I drug. Lives depend on it.","date":"Mon Sep 27 14:42:02 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A great showing by Team USA this weekend in Wisconsin! Way to bring the hardware home 🇺🇸","date":"Sun Sep 26 21:04:27 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Ryder Cup kicked off in Wisconsin yesterday and it’s shaping up to be a great weekend for golf. Good luck to Team USA!","date":"Sat Sep 25 13:43:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined @RepJimBanks in demanding answers from @Google for their indefensible decision to bow to pressure from the left and ban @LiveAction ads promoting an FDA-approved, #ProLife life-saving treatment for pregnant mothers.","date":"Fri Sep 24 13:01:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The situation at our southern border is at an all time low. The Biden Administration is under resourcing our border patrol and @CBP reported 200,000+ apprehensions at the border in August alone, a 317% increase from last year. Still no action from Democrats. https://t.co/mKVLxagRpW","date":"Thu Sep 23 19:33:03 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Two Afghan refugees at Fort McCoy charged with child sex &amp; spousal abuse crimes.\n\nGov. Evers thinks concerns about the refugees are “dog whistle crap.” These are precisely the concerns many have about the vetting process. Evers should get his head out of the sand &amp; pay attention.","date":"Thu Sep 23 14:10:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @FinnertyUSA on @newsmax at 7 AM CT to discuss the crisis and chaos at our southern border. It’s unconscionable that the White House has allowed this crisis to rage on for this long and to this severity.","date":"Thu Sep 23 11:00:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining the @VickiMcKenna Show this afternoon at 2:30 PM CT. Tune in 📻 ⬇️\nhttps://t.co/i2LHvLvokq","date":"Wed Sep 22 18:45:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This week Democrats are pushing abortion on demand legislation that ignores scientific advancements, undermines religious liberty, and injects the federal government into an area of state jurisdiction. I believe that unborn lives should be protected, and I will oppose this bill. https://t.co/ffDwFgZhQV","date":"Wed Sep 22 12:30:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today I paid tribute to Steve Hepp on the House floor. Steve was a beloved member of the Watertown community and he will be remembered for his resolute patriotism, his unparalleled contributions to those around him, and his undying love for his family. Rest In Peace, Steve. https://t.co/l0Jl9CQ0Uh","date":"Tue Sep 21 22:00:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The latest from Biden's woke bureaucrats include putting “trigger warnings” on America’s founding documents like the Declaration of Independence &amp; Constitution at the National Archives. Our founding documents will not be the next victims of #CancelCulture.\nhttps://t.co/pbXcaxO92s","date":"Tue Sep 21 20:06:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"While VP Harris continues to \"address the root causes\" of this crisis, national security and humanitarian concerns have worsened to new lows we didn't even imagine possible. When will the President take this issue seriously?","date":"Tue Sep 21 18:39:56 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I stand behind @RepBlaine. It’s unacceptable that Sec. Yellen has dodged her legally mandated duty to testify before @HSBCgop for 147 days now. We are owed answers for how the Biden Administration is spending billions of taxpayer dollars on COVID-19 relief programs.","date":"Mon Sep 20 21:34:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Here’s the catch—those who travel by land will be exempt from this requirement. Once again the Biden Administration is giving a preferential process to illegal immigrants over those coming here legally.","date":"Mon Sep 20 20:32:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Instead of convening to address the crisis at our southern border, Democrats wasted our time last week at a @JudiciaryGOP markup on immigration proposals that have been ruled out by the Senate parliamentarian.\n\nAnother missed opportunity to find solutions.\nhttps://t.co/v4IugJ6HsL","date":"Mon Sep 20 16:11:15 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today we celebrate #ConstitutionDay to honor the legacy of our nation’s founding. It is my privilege to defend and uphold this document everyday as an elected official. God Bless America! 🇺🇸 https://t.co/qVNqtu6O7G","date":"Fri Sep 17 15:01:49 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I am saddened by the news of my dear friend Steve Hepp who passed away after a hard fought battle with cancer. Steve wore many hats as a father, grandfather, business owner, and Marine Veteran. He is a true patriot and he will be dearly missed by many in the Watertown community.","date":"Thu Sep 16 17:30:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a productive meeting recently at Waukesha Roofing and Sheet Metal, a small business here in SE #WI that has been in operation since 1913! Thank you Jeff &amp; Brian for hosting me and giving me an inside look at all your business has to offer. #SmallBusinessWeek https://t.co/jaKTFe3YRK","date":"Thu Sep 16 16:03:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Google has now censored @LiveAction from promoting their #ProLife saving treatments and messages, another bend to the wishes of the left. The bias against #ProLife views is absolutely abhorrent. It’s time to remove their protections under Sec. 230.","date":"Thu Sep 16 14:27:47 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was proud to welcome Ms. Gena Felder, CFO of TJ Hale Company in Menomonee Falls, to testify at the @HSBCgop hearing about her struggles working with the SBA to secure PPP funding. Watch below to hear Gena's powerful story ⬇️📺 #SmallBusinessWeek\nhttps://t.co/otBSrcYPVw","date":"Wed Sep 15 15:07:56 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#DYK that in Wisconsin, small businesses employ 1.3 million workers and make up over 99% of Wisconsin Businesses? I invite everyone to join me in thanking our local business owners in SE #WI for their contributions to our great state this #SmallBusinessWeek.","date":"Tue Sep 14 22:30:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My statement following the Judiciary Committee's consideration of the Democrats' reckless $3.5 trillion spending bill, which passed yesterday evening in the dead of the night. https://t.co/1dAq458lTc","date":"Tue Sep 14 20:46:08 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"What a great way to kick off #SmallBusinessWeek!\n\nThank you @JobCreatorsUSA for bringing your Small Business Bus Tour here to SE #WI and for honoring me with the Defender of Small Business Award. I'm doing my best to protect #SmallBiz from absurd mandates coming out of D.C. https://t.co/vQMCbMWXkb","date":"Tue Sep 14 19:42:46 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining Matt Kittle on 1130 WISN soon to talk about President Biden's vaccine mandates, tune in!","date":"Tue Sep 14 19:05:27 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"As if their tax hikes weren't enough, Dems want to invade personal privacy through mandated reporting on what goes in &amp; out of bank and credit union accounts over $600 to the IRS. I joined @RepTomEmmer in calling out the obvious privacy &amp; data security concerns this plan raises. https://t.co/VovXRlH5sp","date":"Mon Sep 13 21:00:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If Democrats are unwilling to draw a line at sexual predators, there is no line they won’t cross to grant amnesty to illegal immigrants.","date":"Mon Sep 13 19:58:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"When I visited the border, I witnessed illegal aliens receiving 100% taxpayer funded flights in the US. Meanwhile, our own citizens get mixed messages whether they'll have to pay up more than $2k for flights to flee from Afghanistan.\n \nUnder President Biden, Americans come last.","date":"Mon Sep 13 19:36:37 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Meet Dr. David Toy, a veteran World War II Army technician. I recently had the opportunity to present Dr. Toy with a certificate of recognition for being honored with the Chinese American Congressional Gold Medal and to thank him for his remarkable service to this country. https://t.co/DzWcmNfGuX","date":"Sun Sep 12 15:00:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This morning I was joined by Waukesha County Exec Paul Farrow and Town of Libson Chairman Joseph Osterman in paying tribute alongside community members of Libson, #WI to the 20th Anniversary of September 11th. #NeverForget https://t.co/qIzdrls7nK","date":"Sat Sep 11 21:46:02 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Twenty years ago, September 11th united our country to confront an attack against our democracy. Today, we honor and remember the victims of this fateful day, their families, the first responders, and our service members who responded. https://t.co/JO6qY0cndJ","date":"Sat Sep 11 15:44:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"More Big Government control over Americans’ lives, led by a President who is desperate to talk about anything but his decision to leave hundreds of Americans stranded in Afghanistan.","date":"Fri Sep 10 21:00:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#2 My second amendment would require school districts that have unused buildings to allow charter schools or other public schools to lease or purchase the buildings.\n\nDemocrats voted down this proposal.","date":"Fri Sep 10 20:17:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#3 My third amendment would prohibit institutions with ties to adversarial nations from receiving the increased federal education funds in this bill.\n \nAgain, Democrats voted down this proposal.\n\n🚨 All commonsense proposals. All voted down by the Democrats. 🚨","date":"Fri Sep 10 20:17:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#1 My first amendment would prevent individuals convicted of sexual assault, human trafficking, or related crimes from receiving free community college tuition.\n \nDemocrats voted down this proposal.","date":"Fri Sep 10 20:17:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"🧵This week, @EdLaborGOP marked up our portion of the Democrats’ $3.5 trillion budget reconciliation.\n \nI introduced three amendments to try and improve this irresponsible budget scheme. ⬇️⬇️⬇️","date":"Fri Sep 10 20:17:27 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My amendment would have blocked convicted violent felons, drug traffickers, and individuals charged in association to terrorism or the Taliban from receiving @SBAgov funds. \n\nDemocrats blocked the measure. \n\nThis is unreal. How can this type of amendment even be up for debate? https://t.co/9nwKs34K4e","date":"Thu Sep 09 23:58:02 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Committee Democrats seem to be more concerned about political point scoring than passing my amendment to study the impact of tax increases on small businesses. If they are so confident that their agenda doesn’t burden businesses, why vote the measure down?","date":"Thu Sep 09 23:47:09 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congrats to SE #WI native Jake Williams for an outstanding final game played and bringing home the gold at the #TokyoParalympics! Jake played collegiate basketball for @UWWhitewater and has impressively gone on to represent Wisconsin on the world stage. \nhttps://t.co/nWMIUTG128","date":"Thu Sep 09 13:58:40 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you to everyone who showed up to Office Hours in Waukesha and Washington Counties today. My staff and I were happy to be of help to those experiencing issues with federal agencies. https://t.co/G54OLsPnzl","date":"Thu Sep 09 02:24:20 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last night I had the opportunity to join the staff of Horicon Bank at a picnic to present them with a certificate celebrating their 125th anniversary! I am grateful for the contributions Horicon Bank has made to our community for the last 125 years and for the many years to come. https://t.co/jijAg0Yh7G","date":"Wed Sep 08 22:03:46 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Given China’s practice of acquiring critical US assets, antitrust regulators must be able to follow the money on mergers when SOEs are involved. Read @CNBC’s latest about my efforts in Congress to tackle this issue, &amp; thank you @FTCPhillips for joining me.\nhttps://t.co/3AD9YHKHrG","date":"Tue Sep 07 20:15:08 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Exactly as predicted, the Taliban now has leverage because Pres. Biden left Americans behind. Now would be a great time to hear the President’s plan to evacuate these Americans being held at the airport by the Taliban.\nhttps://t.co/2o1ojk7auV","date":"Tue Sep 07 18:17:20 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My office will be hosting Mobile Office Hours in Washington and Waukesha Counties this Wednesday, September 8th, to help constituents experiencing problems with a federal agency. Read more here ⬇️\nhttps://t.co/BNUg7FZqSG","date":"Tue Sep 07 14:34:47 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m glad to see the Biden Admin. agrees Fentanyl should be permanently designated a Schedule I drug. In light of this decision, there should be no reason Speaker Pelosi doesn't call up my bill &amp; swiftly pass the SOFA Act, which would do exactly this. \nhttps://t.co/0kTyuXbUvB","date":"Fri Sep 03 17:56:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"School curriculum shouldn’t be hidden from parents, especially when the curriculum pushes divisive theories. @virginiafoxx and I dropped the CRT Transparency Act today to make sure parents have full information on what their kids are learning in school.\nhttps://t.co/1F00xdbEcU","date":"Fri Sep 03 14:56:08 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This decision is a win for the pro-life movement and is a great sign that the Court will uphold the lower court decision in Dobbs v. Jackson Women’s Health.\nhttps://t.co/waWN4xGBYE","date":"Thu Sep 02 19:30:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is exactly why parents are so exasperated with Teachers’ Unions. Union leaders continue to move the goalposts, now demanding that all students be vaccinated AND masked for an appropriate in-person return. When will this end? Students must come first.\nhttps://t.co/Ei4JEWw2vh","date":"Thu Sep 02 18:06:17 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined @FinnertyUSA on @newsmax yesterday to discuss Pres. Biden's disturbing speech in which he called his Afghanistan withdrawal an \"incredible success.\" 13 fallen troops and hundreds of Americans stranded is far from what I'd call a success. Watch ⬇️\nhttps://t.co/oWtQkUgpkJ","date":"Thu Sep 02 14:24:46 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden Administration hasn't ruled out giving direct aid to the Taliban as a ransom for U.S. citizens left behind. This is beyond unacceptable. I joined @LizMacDonaldFOX on @FoxBusiness to discuss. https://t.co/f2Y2ExG7Qv","date":"Wed Sep 01 19:38:45 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Pres. Biden wanted the public to think that everything was A-OK in Afghanistan, even though he knew otherwise. He's now turned his back on 100s of Americans trapped behind Taliban lines but blames them for being stranded. Why didn't he tell the truth sooner so they could get out?","date":"Wed Sep 01 16:53:29 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @LizMacDonaldFOX tonight at 5:35 PM CT to talk about @HouseGOP efforts to find out the true number of Americans still trapped in Afghanistan.","date":"Tue Aug 31 21:50:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @VickiMcKenna today at 2:35 PM CT to discuss the latest on Afghanistan. Tune in here ⬇️\nhttps://t.co/H5IzUgQBWb","date":"Tue Aug 31 18:50:17 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"What many of the headlines are omitting tonight is that hundreds of Americans are left stranded behind enemy lines. Shameful.\nhttps://t.co/l5uvNBev0I","date":"Tue Aug 31 00:46:41 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congratulations, Hailey! Way to make SE #Wisconsin proud.","date":"Mon Aug 30 16:08:07 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"@RepStefanik Congratulations!","date":"Mon Aug 30 15:35:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My statement on the attacks against U.S. service members in Kabul, Afghanistan. https://t.co/orsAGXx2yS","date":"Thu Aug 26 22:13:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Our worst fears are unfolding right now at the Kabul airport. Reports indicate that at least 3 U.S. troops have been wounded. I am praying for the safety of all our service members who are responding to this danger.","date":"Thu Aug 26 14:50:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined my colleagues in a bicameral letter to Pres. Biden to demand he outline a plan following the Taliban takeover of Afghanistan. The W.H. response to this catastrophe has been a failure and they must immediately account for the repercussions of this self-inflicted crisis. https://t.co/HeUGBek3Re","date":"Wed Aug 25 20:38:57 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"H.R. 4 takes election power away from the people and places it right here in Washington, D.C. As elected officials we have a duty to maintain the faith of our voters in the integrity of our elections. Yesterday, Democrats voted to undermine this integrity. https://t.co/A87fLduXzg","date":"Wed Aug 25 19:02:32 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m joining my @RepublicanStudy colleagues at a press conference now to talk about the Democrats’ $3.5 trillion budget reconciliation. Tune in ⬇️","date":"Tue Aug 24 18:04:57 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats are hoping their $3.5 trillion boondoggle budget reconciliation will distract from the White House’s disaster response to the catastrophe in Afghanistan and Speaker Pelosi’s attempt to pass #HR4, another federal takeover of elections. Total chaos from the left.","date":"Tue Aug 24 17:28:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Biden Administration claims Americans are not \"stranded\" in Afghanistan but they issued a security warning on Saturday telling Americans not to travel w/o instruction from the Admin.\n\nInstead of deflecting blame for his mess the President should focus on bringing Americans home.","date":"Tue Aug 24 14:24:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined @HouseGOP &amp; @mikepompeo on a call last week to discuss Pres. Biden’s monumental miscalculation in Afghanistan. America is sorely missing leadership during this historic catastrophe and we can only hope this situation does not deteriorate further. https://t.co/16ox5g4PMp","date":"Tue Aug 24 13:00:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Helping small businesses should be a no brainer, but unfortunately Democrats want to slap tax hikes on Main Street leaving many business owners in a precarious situation. I joined @HSBCgop in urging Speaker Pelosi and Pres. Biden to reconsider their unwise proposals.","date":"Mon Aug 23 21:11:02 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I encourage high school students interested in a Service Academy Nomination to join staff from my office and the #WI Congressional delegation for Academy Day on Sept. 18! Come meet with representatives from the academies and speak with staff members about the nomination process. https://t.co/9HvotgEvLQ","date":"Mon Aug 23 18:11:18 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The chaos unfolding in Afghanistan could have been avoided had we followed the Trump Administration’s plan to remove advanced weaponry and evacuate civilian contractors before drawing down our forces. I joined @robfinnertyUSA on @newsmax last week to discuss. https://t.co/7g2qgDGYd1","date":"Mon Aug 23 16:41:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @FinnertyUSA on @newsmax this morning at 8:30 AM ET to talk about the chaos unfolding in Afghanistan. Be sure to tune in.","date":"Fri Aug 20 10:30:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Just one month ago President Biden said it was unlikely the Taliban would overrun Afghanistan. The mixed messaging coming out of the Administration only compounds the confusion and chaos. We need solutions, not excuses.\nhttps://t.co/Rv8BcqAJTf","date":"Thu Aug 19 17:49:10 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"ATTN SE #WI 👉🏻 staff members from my office will be near the Grandstand at the Dodge County Fair this Friday from 1:30 - 3:30 PM CT. They’ll be available to meet w/ constituents who are experiencing problems &amp; bring documentation related to their issues with a federal agency.","date":"Wed Aug 18 19:07:57 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Taliban has seized billions of dollars in advanced weaponry. The Biden Administration is unsure who exactly is in possession of them, or where they are, and again, seems to have no plan to address this.","date":"Tue Aug 17 19:57:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"President Biden flew to the White House to check a box today, and is already headed back to his vacation. Read my full statement on his address. ⬇️\nhttps://t.co/57IWyYafb7","date":"Mon Aug 16 21:07:56 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm left speechless watching the footage coming out of Kabul. Where is President Biden?","date":"Mon Aug 16 14:58:14 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Where will President Biden draw the line? Month after month border crossings continue to hit new highs but we’ve hardly heard as much as a peep from the President. \nhttps://t.co/MVMHZBvcHx","date":"Fri Aug 13 21:50:18 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My statement on the failed withdrawal of U.S. forces from Afghanistan this week:\nhttps://t.co/4CL1mjZDH2","date":"Fri Aug 13 16:15:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#PSA SE Wisconsin 👉🏻 beware of tax scams about the Child Tax Credit. The IRS will not contact you by email, text, social media, or threatening voicemails to verify your information. Read more here to learn how you can protect yourself against scams ⬇️ https://t.co/WdOXHI1RBi","date":"Fri Aug 13 13:55:14 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a productive meeting with special agents at the FBI Field Office located here in Wisconsin this afternoon. We discussed issues relating to fentanyl, human trafficking, the border crisis, and violent crime upticks in Wisconsin. https://t.co/MkjWGTR5VW","date":"Thu Aug 12 19:30:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Under Pres. Biden, foreign oil development is prioritized over U.S. energy independence and American jobs have been cut or sidelined as a result. The many Wisconsinites who lost jobs because of the President’s day one decision to end Keystone deserve better leadership in the WH.","date":"Thu Aug 12 17:29:18 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The emergency scheduling order for fentanyl-related substances expires this fall, leaving Speaker Pelosi little time to take action. My bill, the SOFA Act, permanently designates fentanyl a schedule I drug to ensure law enforcement always have the tools they need to do their job.","date":"Wed Aug 11 18:11:48 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"President Biden has made life more expensive for Americans every single month since he took office. Whether it be the grocery store or the gas station, necessities are costing Americans at a tough time as we recover from the pandemic. https://t.co/2XBiMbcADJ","date":"Tue Aug 10 14:44:32 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The lefts’ Defund the Police movement is the cause, not the cure, to our nation’s crime crisis. Republicans will always #BackTheBlue","date":"Mon Aug 09 19:40:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congratulations to SE Wisconsin native Molly Seidel for bringing home the bronze in the Women’s Marathon! You make Wisconsin proud. #TokyoOlympics","date":"Sat Aug 07 14:30:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The CDC's whiplash guidance on #COVID19 protocols doesn't create clarity, it creates confusion. I joined more than 40 of my colleagues in calling on the CDC to release information to explain their latest reversal recommending vaccinated individuals wear masks. Full letter ⬇️ https://t.co/GWjLPPGdOJ","date":"Tue Aug 03 14:09:46 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I stood under this bridge just a couple of weeks ago and met with border agents who spoke to the number of crossings rising to unmanageable levels. The situation at our border is clearly out of control and Biden policies are hurting, not helping.","date":"Mon Aug 02 18:06:39 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It's unconscionable that the President won’t take stronger action to put our country's public health first. My full statement on Title 42 and President Biden's reversal ⬇️\nhttps://t.co/fZHbaIofBE","date":"Fri Jul 30 17:49:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined @MacIverWisc this week to talk about election integrity. We must restore faith in our system by ensuring election officials operate free from outside influence. Listen to our convo below to hear more about my work in Congress on this issue ⬇️\nhttps://t.co/qEFMRs2YzH","date":"Fri Jul 30 16:56:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Countering Chinese aggression should be a top priority for Congress. It’s time we take off the kids gloves and start backing up our words with real action. Proud to be a cosponsor of this @RepublicanStudy bill, led by @RepJimBanks. https://t.co/nhpYkRCFm8","date":"Thu Jul 29 22:56:04 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I addressed the House about the exploding levels of fentanyl coming across our southern border today. Democrats oppose commonsense measures to penalize possession of the drug. I suspect because it would force them to confront the #BidenBorderCrisis, which they've largely ignored. https://t.co/nLFVQlxa2o","date":"Thu Jul 29 20:55:36 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"As a check on the Biden Administration’s regulatory overreach, I joined 27 of my colleagues in calling on the @CFPB to ensure that small businesses are not harmed by one-size-fits-all regulations. https://t.co/tT0J58omXT","date":"Thu Jul 29 18:53:25 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday, I signed onto an amicus brief to the Supreme Court of the United States in support of Mississippi in Dobbs v. Jackson Women’s Health Organization. Standing up for unborn lives is critical and I’m proud to join this effort to protect the most vulnerable among us.","date":"Thu Jul 29 16:43:33 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsinites are rightfully concerned about a taxpayer funded unemployment program marked by fraud. A report from the @USDOL Acting IG will provide us answers about waste &amp; abuse that Governor Evers has failed to provide. Full letter ⬇️","date":"Thu Jul 29 15:40:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @VickiMcKenna around 4:35 PM ET this afternoon. Tune in!\nhttps://t.co/bAwiTCt4Jm","date":"Wed Jul 28 20:08:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats blocked my effort to ensure criminals convicted of fentanyl-related crimes do not receive lesser sentences. Fentanyl is extremely lethal and can uproot the lives of families who lose loved ones. Why don't Democrats care?","date":"Tue Jul 27 22:28:27 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"UPDATE: @USDA has designated Washington County as a contiguous disaster area due to drought conditions. I urge the Secretary to examine how drought conditions have impacted all of SE #WI and add Dodge County to this disaster designation.\nhttps://t.co/FlCczFnZ2d","date":"Tue Jul 27 21:02:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I have further urged @USDA Sec. Vilsack to include Washington and Dodge counties in this disaster designation, as local drought conditions also impacted farm operators in these areas severely. I am monitoring this issue closely to connect #WI05 with the assistance they need.","date":"Tue Jun 29 22:07:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"@RepGwenMoore \n@RepBryanSteil \n@RepTiffany \n@repmarkpocan \n@RepRonKind \n@RepGallagher","date":"Tue Jul 27 18:20:02 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Milwaukee Bucks team and fans waited 50 yrs for another championship win, &amp; to clinch the title on our home turf last week was the cherry on top. I joined my #WI delegation colleagues in a resolution to congratulate the Bucks on their championship win.\nhttps://t.co/FFPLkCo0Xa","date":"Tue Jul 27 18:20:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday the Jobs &amp; Economy Taskforce, led by @PatrickMcHenry, kicked off our first meeting. I look forward to joining my colleagues to identify solutions that will get Americans back to work and promote economic freedom. Full statement ⬇️\nhttps://t.co/2T9Onfhvry","date":"Tue Jul 27 13:51:51 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We should have returned to in-person committee business months ago, as other committees have done. The Democrats’ failure to permit collaborative in-person work comes at the expense of the American people and should be fixed quickly.","date":"Mon Jul 26 21:39:08 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Best of luck to SE Wisconsin’s very own Khris Middleton, Molly Seidel, and Alie Rusher as they compete in the 2021 #TokyoOlympics! I’ll be rooting for them &amp; #TeamUSA back here in Wisconsin.","date":"Fri Jul 23 22:37:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"📻 #ICYMI I joined @VickiMcKenna earlier this week to talk about my trip to the southern border. Pres. Biden has enabled levels of border crossings not seen in decades &amp; is putting our national security at risk. You can listen to our conversation here. ⬇️ \nhttps://t.co/56ELGsaObg","date":"Fri Jul 23 16:06:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to sign onto this letter with my #WI colleagues. The #COVID19 pandemic put small businesses in a precarious situation and these business owners have been left stranded by the @SBAgov’s failed communication on timely issues.","date":"Thu Jul 22 19:20:42 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined @GOPLeader and my Republican colleagues in standing for the freedom fighters in Cuba who yearn for democracy. The oppressive Cuban regime must come to an end, and free nations around the world can help us make democratic Cuba a reality.","date":"Wed Jul 21 21:12:39 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’ve heard from scores of constituents who've dealt with significant challenges getting their passport application approved. This is completely unacceptable. I led 43 colleagues in a bipartisan letter to Sec. Blinken demanding answers and solutions to this significant problem. https://t.co/lDPqqGnsGG","date":"Wed Jul 21 20:45:18 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last election, Mark Zuckerberg spent hundreds of millions of dollars to essentially take over elections in Democrat-leaning precincts. This cannot be allowed to happen again. I’m proud to cosponsor legislation that keeps #Zuckerbucks out of our elections.\nhttps://t.co/VlyfZ2SwCh","date":"Wed Jul 21 19:02:12 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today at a @JudiciaryGOP Markup I intro’d an amendment that would maintain penalties for any form of cocaine containing fentanyl/fentanyl analogues. Democrats wanted to kick the can down the road. Why are they doing nothing to stop the flow of this deadly drug into the U.S.? https://t.co/oSbz38BVfg","date":"Wed Jul 21 17:13:56 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"@RepTenney @HouseGOP Read my full statement on the amicus brief here ⬇️\nhttps://t.co/lCkLNv60YL","date":"Wed Jul 21 16:49:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In many states, citizens must prove a special need to access their 2nd Amendment right to self-protection. This is wrong and unconstitutional. I joined @RepTenney &amp; @HouseGOP colleagues in an amicus brief for NYSRPA v. Corlett to ensure this right is available to all Americans. https://t.co/y9tU1AWGsW","date":"Tue Jul 20 21:56:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If President Biden repeals Title 42 it will serve as a bullhorn to the rest of South America to come to the U.S., and to come here now. Our border patrol agents are not equipped to handle the Biden Administration’s open-door policies. @newsmax 📺⬇️ https://t.co/UP1dOwfYBu","date":"Tue Jul 20 20:42:54 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"PSA for Wisconsinites traveling near the Deer District in Milwaukee today ⬇️ https://t.co/tBpcbGKP4B","date":"Tue Jul 20 15:37:58 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @VickiMcKenna around 4:10 PM ET this afternoon to discuss my recent trip to the southern border. Tune in! \nhttps://t.co/bAwiTCt4Jm","date":"Tue Jul 20 14:36:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Biden Admin's double standard for Cubans fleeing communism stands in contrast to the open-door policy at our southern border. Not to mention, Democrats force masks on kids at school while letting untested migrants freely enter &amp; jet off across the U.S. The hypocrisy is unreal. https://t.co/BGdg9IObbg","date":"Tue Jul 20 02:05:29 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to send a bipartisan letter w/ @RepGwenMoore requesting the Treasury to clarify that state/local gov'ts can use COVID relief to buy specialty vehicles, like ambulances. This will help #WI companies supply first responders w/ vehicles they need to safeguard our communities. https://t.co/PAKKBaPOXE","date":"Mon Jul 19 21:31:38 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@PatrickMcHenry is right. We need commonsense legislating in Congress to get Americans back to work. The Dems' spending spree is a roadblock to recovery, but @HouseGOP's Jobs &amp; Economy Taskforce will create solutions to get our workforce back on track.\nhttps://t.co/depeNHFyDb","date":"Mon Jul 19 17:31:24 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'll be on @newsmax this morning at 7:30 AM ET to talk about my recent trip to the southern border. Tune in!","date":"Mon Jul 19 11:06:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Title 42 allows for the quick processing and expulsion of migrants illegally crossing the border. I saw first hand while at our southern border that removing this authority would exasperate the current crisis. I urge Pres. Biden to keep this protection in place.","date":"Fri Jul 16 23:49:45 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Attention SE Wisconsin: The State Department is experiencing significant delays in processing passports &amp; advises when requesting/renewing a passport to apply at least 6 months in advance of your departure to ensure your passport is completed on time.\nhttps://t.co/RtW1QMDDaT","date":"Fri Jul 16 20:30:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I just returned from McAllen, TX where I had a chance to see the southern border &amp; speak with border agents. The message I heard repeatedly from law enforcement with boots on the ground was clear: the flow of migrants is drastically increasing, and they need more help now.","date":"Fri Jul 16 19:37:17 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Facebook shut down accounts that said #COVID19 came from the Wuhan lab. Now they are working hand in glove with the White House to remove “problematic” content... \n\nRepublicans want to rein in Big Tech. Democrats want to unite them with Big Government.\nhttps://t.co/XiSUxM995i","date":"Fri Jul 16 15:03:36 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Visiting a @CBP processing facility in TX, which is used to process individuals in U.S. Border Patrol custody &amp; provide processing capacity along the Rio Grande Valley. I’m thankful for the border agents who are working tirelessly to safeguard Americans &amp; keep our border secure. https://t.co/xGMoD1JPrg","date":"Thu Jul 15 19:38:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great win last night—let's keep the momentum going! #GoBucksGo","date":"Thu Jul 15 16:02:40 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Hyde Amendment stops American taxpayer dollars from being used to fund abortions, and the majority of Americans agree that tax dollars should not be used to fund abortions. I strongly oppose the Democrats’ effort to repeal this amendment from the FY22 budget. #HydeSavesLives https://t.co/AW5TTebbMf","date":"Thu Jul 15 15:13:51 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"By failing to address the surge of drug trafficking at the southern border, President Biden is turning a blind eye to the biggest supply of fentanyl into communities across the U.S. The cost of lives lost to the opioid epidemic is beyond measure.\nhttps://t.co/BihuOu4llb","date":"Wed Jul 14 19:33:09 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m headed to our southern border today to examine the #BidenBorderCrisis firsthand. Sign up for my eNewsletter to get an exclusive account following my trip about what I saw, what I heard, and what solutions we need to fix this crisis. Subscribe here ⬇️\nhttps://t.co/GnbbuEbaYX https://t.co/08JcccN1Ji","date":"Wed Jul 14 17:30:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a productive conversation at @JudiciaryGOP today about the safeguards we can implement to address concerns surrounding facial recognition technology and how we can harness it for good. Take a look 📺⬇️\nhttps://t.co/cQpsDUPrFo","date":"Tue Jul 13 20:32:41 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"President Biden and Speaker Pelosi have taken the ‘spend now, ask taxpayers to pay later’ approach to legislating. Working class families are the collateral.","date":"Tue Jul 13 19:17:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Reminds me of #Act10 when every Dem State Senator fled #WI to dodge taxpayer funded duties. My colleagues &amp; I held them accountable for their absences, &amp; #TX Republicans should do so too. My advice to these supposed public servants fleeing #TX, put down the beer and do your job.","date":"Tue Jul 13 14:54:52 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Pres. Biden's solution to our nation's skyrocketing crime? Tell states to use their #COVID19 “relief” aid to fund police departments after Democrats spent the entire summer last year demanding we defund the police. Welcome to the Democrats' crime crisis.\nhttps://t.co/lpwVhfEb7e","date":"Tue Jul 13 13:34:02 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I stand with the people of #Cuba in their fight for freedom, democracy, and the rule of law, and I condemn the violent crackdowns by the Communist regime. Cuba should be free from oppression, and these brave dissidents should have their voices heard, and their rights protected.","date":"Tue Jul 13 00:51:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to @USCCA for hosting @Jim_Jordan &amp; I at the Delta Defense headquarters in West Bend today. We had a great discussion on the importance of self-defense education &amp; training for gun owners &amp; what we can do in Congress to protect Americans’ 2nd Amdt right to self-defense. https://t.co/NAGhsznVIe","date":"Fri Jul 09 19:13:56 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Gov. Evers still hasn’t responded to TX Gov. Abbott’s request for more National Guard troops at the southern border, but even Pres. Biden’s DoD can see their border agents need help…Gov. Evers is turning his back on this crisis.\nhttps://t.co/uhRdL48kUY","date":"Fri Jul 09 01:40:42 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined @RepGallagher’s resolution to condemn the Chinese Communist Party for 100 years of gross violations of human rights. The res. lists these abuses &amp; calls for self-determination for the Chinese people. The CCP’s list of atrocities is long and no wrong should be forgotten.","date":"Thu Jul 08 17:54:12 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last week I requested HR 18 be brought to the House floor for a vote. HR 18 would codify the Hyde Amendment into law &amp; ensure tax $$ are never used to fund abortions. Democrats denied this request. No American should be forced to fund abortion services against their conscience. https://t.co/g1ukIJUWqs","date":"Tue Jul 06 20:36:39 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Sec. Yellen's refusal to appear before @HSBCgop defies fed. law which requires her to testify on small business relief programs included in #COVID19 stimulus. I joined @HSBCgop in calling on Sec. Yellen to do her job &amp; testify how this Admin. is spending billions of taxpayer $$. https://t.co/z9xJaJcTC0","date":"Tue Jul 06 19:24:07 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Independence Day! We are a nation free, because of the brave. I hope everyone enjoys celebrating our great country today! https://t.co/JoOzogpSVc","date":"Sun Jul 04 13:54:32 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"At yesterday's @JudiciaryGOP hearing, I asked Professor Turley how we can prevent leaks of classified information—like those that undermined the Trump Administration—while ensuring 1st Amendment protections are upheld. Watch our full exchange 📺⬇️ https://t.co/R0dBvRIcL9","date":"Thu Jul 01 16:20:49 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to cosponsor @CongressmanGT’s bill to expand the variety of milk permitted in school cafeterias. Children should be allowed to enjoy all types of nutritious milk and this bill allows students to do exactly that. Ready more here ⬇️\nhttps://t.co/t2w0YdffSV","date":"Thu Jul 01 12:58:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The drug crisis in #WI starts at our southern border where cartels are smuggling in vast quantities of fentanyl, a devastating and life-destroying drug. Gov. Evers must answer the urgent request from TX and AZ for assistance to fix this crisis at the border.","date":"Wed Jun 30 15:30:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m happy to announce that Wisconsin’s Fifth District will participate in the Congressional App Challenge this year! I encourage interested #WI05 students to sign up and click the link below to learn more⬇️💻\nhttps://t.co/ggBL6WHHVI","date":"Wed Jun 30 14:52:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Farm operators in Washington, Dodge, Waukesha, Milwaukee, and Jefferson counties have grappled with difficult crop conditions due to droughts that have plagued SE #WI over the past month.","date":"Tue Jun 29 22:07:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I have further urged @USDA Sec. Vilsack to include Washington and Dodge counties in this disaster designation, as local drought conditions also impacted farm operators in these areas severely. I am monitoring this issue closely to connect #WI05 with the assistance they need.","date":"Tue Jun 29 22:07:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@USDA designated Waukesha, Milwaukee &amp; Jefferson counties as a contiguous disaster area due to drought declarations nearby. Farm operators in the affected counties may be eligible for assistance. To learn more, read below or contact your local FSA office.\nhttps://t.co/mjZDGFpUSr","date":"Tue Jun 29 22:07:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Let’s be clear—Democrats have tried to defund the police many times. The left rallied behind calls to defund the police last summer and their decision to deflect blame is leaving yet another crisis unaddressed.","date":"Tue Jun 29 20:53:53 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday, Sec. Cardona said the fed. gov't wouldn't get involved in school curriculums...but his proposed changes to Ed programs provides grant $$ to schools to teach initiatives like critical race theory. @EdLaborGOP and I sent a letter urging these proposals be stopped. https://t.co/m1zraDp7yG","date":"Fri Jun 25 16:47:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks @SteveScalise for dropping off this treat to celebrate the passage of my first bill! https://t.co/Q66P70DdIV","date":"Fri Jun 25 14:10:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @VickiMcKenna today at 4:15 ET to talk about Biden's economic &amp; crime crises. Listen here ⬇️\nhttps://t.co/bAwiTCt4Jm","date":"Thu Jun 24 17:28:32 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@JudiciaryGOP antitrust markup update: Democrats blocked my amendments that would allow tech platforms to remove apps that could transfer your data to China and facilitate sex trafficking. How could they be against something so commonsense?","date":"Thu Jun 24 16:22:46 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Amid demands from Republicans to take action and fully utilize Congress’ resources to hold China accountable for their role in COVID-19, the left is completely silent. Americans deserve answers about what caused this pandemic for closure &amp; to prevent this from happening again.","date":"Thu Jun 24 14:56:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@JudiciaryGOP is marking up a slew of antitrust proposals today. What these bills do ➡️ marry Big Tech w/ Big Gov. What these bills don’t do ➡️ hold Big Tech accountable for anti-conservative bias. I spoke with @RobFinnertyUSA this morning about this.\nhttps://t.co/CLE57sb5eR","date":"Thu Jun 24 00:16:45 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to have my first stand-alone bill pass in the House of Representatives today! H.R. 3239 will clean up certain portions of the United States Code &amp; save taxpayer dollars by preventing frivolous lawsuits over confusingly worded portions of U.S. Code.\nhttps://t.co/3YveLAnvRE","date":"Wed Jun 23 21:58:21 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Supporting the use of taxpayer $$ to pay for abortions is unconscionable. Sadly, this is exactly what Pres. Biden supports. Today I voted to bring H.R. 18 up for a vote—a bill to codify the Hyde Admt &amp; prohibit taxpayer funded abortions. Democrats blocked this effort.","date":"Wed Jun 23 18:06:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m joining Rob Finnerty on @newsmax now to talk about Big Tech. Tune in!","date":"Wed Jun 23 11:48:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Conservatives have had their 1st Amdt trampled by Big Tech, &amp; it’s now been uncovered that of the $350M Facebook CEO Mark Zuckerberg distributed to “safely serve every voter,” 92% went to Democrat precincts. Joining @RepTenney in demanding transparency &amp; answers.","date":"Tue Jun 22 15:12:25 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"S. 1/H.R. 1 will completely undermine public faith in our elections. Pelosi &amp; Schumer want to weaken voter ID laws, steamroll states authority over election procedures, &amp; force Americans to fund politicians’ campaigns—whether they support them or not. This bill is a disaster.","date":"Tue Jun 22 13:39:15 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The @HouseGOP is taking action to hold the #CCP accountable for their role in the #COVID19 pandemic, while President Biden and Democrats are focused on policies to increase gas prices, defund the police, and open our borders.\nhttps://t.co/pHHJYJldhd","date":"Mon Jun 21 19:18:57 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Sec. Becerra dodged Qs left &amp; right from @EdLaborGOP Members today. I asked the Secretary several questions about his stance on future #COVID19-related mandates &amp; shutdowns to which he refused to commit a position on. Watch our full exchange here 📺⬇️\nhttps://t.co/lWtJVtvKnO","date":"Wed Jun 16 19:28:55 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to sign onto this letter with my @HouseGOP colleagues amid the relentless pro-abortion push from the left &amp; President Biden. The @DeptVetAffairs is obligated by law to protect the unborn and refrain from using taxpayer dollars to fund abortion services. #ProLife","date":"Wed Jun 16 17:55:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Had the privilege of meeting with LTG Dan Karbler, Commanding General of Army Space and Missile Defense Command and native of Hartland. We discussed several important topics, including the Brewers! #GoArmy https://t.co/ZurHM2Ke3N","date":"Wed Jun 16 01:35:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Over the weekend I attended the unveiling of the new 9/11 Memorial in Kewaskum. This project has come a long way and I’m grateful that our community can now visit this memorial and pay their respects to those who perished and responded on September 11, 2001. https://t.co/SYRO4E1QJc","date":"Tue Jun 15 20:54:37 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@GOPLeader is right. The border crisis is exacerbating another crisis that has plagued the U.S. for years: the opioid epidemic. I introduced the SOFA Act to permanently designate fentanyl a schedule I drug and stop the cartels who supply fentanyl to the U.S. market.","date":"Tue Jun 15 17:59:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m joining @Jim_Jordan &amp; @JudiciaryGOP by putting a stop to Big Tech’s anti-conservative agenda. Our bill removes Big Tech’s broad immunity under Sec. 230 and holds them accountable for blocking conservative speech. \nhttps://t.co/CS0eMqtAet","date":"Mon Jun 14 18:56:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy 246th birthday, @USArmy! My continued gratitude goes out to the men and women who tirelessly defend our liberties. Now more than ever, @USArmy is at the forefront, fighting for American values and security. https://t.co/ULQXZWWhwq","date":"Mon Jun 14 18:46:20 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Had a great time at the Washington County Dairy Destination drive-thru breakfast this morning! June is #NationalDairyMonth, be sure to thank our #WI05 dairy farmers who keep us well fed. https://t.co/zrzYEapEjq","date":"Sat Jun 12 21:38:40 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It took four years for the FBI to correctly classify the shooting of Rep. Scalise &amp; my colleagues as domestic terrorism. The FBI initially labeled this heinous act, in which 4 people were shot, as “suicide by cop.” I'm glad Director Wray re-examined &amp; finally made it right.","date":"Fri Jun 11 14:19:52 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Watch my full exchange with FBI Director Wray at the @JudiciaryGOP hearing yesterday here ⬇️📺\nhttps://t.co/s00FPtr2jX","date":"Fri Jun 11 14:19:52 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today I led Republicans in a hearing to examine the reauthorization of child nutrition laws. Instead of creating new expensive programs, we must focus on improving existing programs to better serve families &amp; students in need, especially in rural communities. Full statement ⬇️","date":"Thu Jun 10 17:49:03 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The situation at our southern border is getting worse - not better. Despite VP Harris’ dismissive behavior, the evidence is clear. @CBP just announced 180,034 border crossings in May—a new 21-year high and the 3rd straight month of 170K+ apprehensions.","date":"Thu Jun 10 16:42:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"President Biden is proving that if you pay workers a $300 bonus to stay home, they’ll do exactly that. This week his Labor Department reported 9.3 million job postings left unfilled in April, the most shown since the department began keeping track in 2000.\nhttps://t.co/7xHBMd9hbQ","date":"Wed Jun 09 21:34:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, @SecMartyWalsh will appear before @EdLaborGOP. I hope his testimony sheds light on how @USDOL plans to help business owners who are struggling to find workers due to the $300 stay at home #BidenBonus and workers who face increasing threats to their gig worker status.","date":"Wed Jun 09 15:13:56 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is embarrassing to watch. The border crisis is on the southern border, not in Europe. How long will the White House continue to turn a blind eye before they act with accountability?","date":"Tue Jun 08 16:44:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Pres. Biden’s energy security playbook. ⬇️\n\n1 👉 Cancel #KeystoneXL Pipeline &amp; thousands of American jobs at the expense of U.S. energy independence.\n\n2 👉 Turn your back on a regional partner to gain favor with an adversary and create a Russian pipeline.\nhttps://t.co/JkbMT2tZuB","date":"Mon Jun 07 18:01:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Nursing home residents have been among the most vulnerable during the #COVID19 pandemic. I’m calling on Sec. Becerra to ensure funds from the Provider Relief Fund and American Rescue Plan are provided to long-term care facilities to ensure they stay financially equipped to serve. https://t.co/9SgBcS0Ei8","date":"Fri Jun 04 20:45:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The U.S. should not sit idly by as China continues their aggressive campaign against vulnerable populations and countries. I introduced the BRIDGE Act to develop a comprehensive, government-wide strategy on countering the #CCP’s influence globally. (2/2)","date":"Fri Jun 04 19:51:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"32 years ago the #CCP attacked peaceful civilians advocating for democracy in the #TiananmenSquareMassacre. Unfortunately, not much has changed today as the #CCP continues to suppress their citizens – like those in Hong Kong – of basic freedoms. (1/2)","date":"Fri Jun 04 19:51:27 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Underwhelming jobs numbers are to be expected when people are being paid to stay home and won’t return to work. How much more evidence does Gov. Evers need?","date":"Fri Jun 04 16:44:02 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Unemployed workers in Wisconsin can make double what the state’s minimum wage is by staying at home. Gov. Evers &amp; President Biden are paying workers more to stay at home than small businesses in our state can afford. Welcome to the left's way of leading.\nhttps://t.co/GRvAOUcHoi","date":"Thu Jun 03 16:02:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"That's why I was proud to cosponsor the bipartisan Hospitality &amp; Commerce Job Recovery Act to create a 3 year convention and trade show tax credit for industries that support 67k jobs in Wisconsin. (2/2)","date":"Wed Jun 02 21:00:54 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Exhibitions and conferences support local restaurants and hotels, while giving businesses, like small manufacturers, the opportunity to expand their market share. (1/2)","date":"Wed Jun 02 21:00:54 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Unelected bureaucrats in Washington, D.C. often do not receive the scrutiny that they deserve. My bill, the Separation of Powers Restoration Act, would mitigate the power given to bureaucrats in our Federal agencies. My full Op-Ed in the @wdtimes1 here ⬇️\nhttps://t.co/cczvoTumVE","date":"Wed Jun 02 17:25:53 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Gov. Evers wants proof that the $300 federal unemployment bonus is contributing to WI’s workforce shortage...Is he not listening? This is a slap in the face to the businesses statewide who've already pinpointed this bonus as the primary obstacle to hiring.\nhttps://t.co/wstVnlIYZ1","date":"Wed Jun 02 15:45:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"President Biden has spent the inaugural months of his presidency doing all he can to force abortion funding on all Americans. I will do all I can to push back against attempts to force American taxpayers to fund this life-destroying practice. \nhttps://t.co/qs6CNxOSra","date":"Tue Jun 01 17:42:18 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Gig workers are overwhelmingly in favor of their independent &amp; flexible work lifestyles. Sec. Walsh’s recent comments proscribing these entrepreneurs as employees is irresponsible and goes against these workers’ own wishes. https://t.co/2zt53PE7s7","date":"Tue Jun 01 15:30:56 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m wishing everyone a blessed Memorial Day today. May we remember and honor the brave soldiers who served our country and made the ultimate sacrifice for our freedom. https://t.co/oKiOEM0MTy","date":"Mon May 31 16:24:48 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I agree with @GregAbbott_TX that Biden’s border crisis has made it easier for cartels to traffic fentanyl into the US. I introduced the SOFA Act to make sure fentanyl stays a schedule I drug to mitigate these deadly overdoses.\nhttps://t.co/hel8ZXhNuZ","date":"Fri May 28 20:50:43 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"For over 40 years, the Hyde Amendment has ensured Americans aren't forced to pay for abortions w/ their tax dollars. I proudly support the Hyde Amendment and will fight for #ProLife protections in the face of attacks from President Biden &amp; Speaker Pelosi.\nhttps://t.co/eMkqQqG8gA","date":"Thu May 27 18:27:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Meanwhile, President Biden’s press secretary is fielding questions about his peloton bike at White House briefings. Might I suggest the media ask some serious questions, like why VP Kamala Harris hasn’t scheduled a single visit to, or briefing on, our southern border crisis?","date":"Wed May 26 16:08:37 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The consequences of teachers unions' and Democrats’ push to keep schools closed are costly. Still, as businesses reopen and vaccinations rise, more than 30% of America’s K-12 students are missing out on in-person school every day. Completely unacceptable.\nhttps://t.co/3dtAwZM9l2","date":"Tue May 25 18:55:53 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"For too long, unelected bureaucrats have been ceded power in the judicial process. Our Constitution clearly gives legislative power to Congress &amp; judicial power to our courts. My bill restores this balance &amp; mitigates Biden’s executive overreach.\nhttps://t.co/dteqfp8gWq","date":"Tue May 25 16:20:46 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In the absence of leadership at the executive level, businesses will struggle to find workers. Governor Evers must do what President Biden did not and end the $300 stay at home bonus.\n\nRead my latest op-ed in the Watertown Daily Times. ⬇️\nhttps://t.co/nshe4ol55K","date":"Mon May 24 18:36:34 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Apple is complicit in the very human rights abuses the company claims to detest. I joined @RepKenBuck, @RepBurgessOwens, &amp; @RepDanBishop in a letter to CEO Tim Cook urging him to reassess Apple’s role in reinforcing Communist China. Full story ⬇️\nhttps://t.co/byrHr0JbE8","date":"Fri May 21 15:51:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"WSJ said it best, Biden’s treating a Russian gas pipeline better than the Keystone XL in America where he laid off thousands of workers.\nhttps://t.co/PwsJAUCYeH","date":"Thu May 20 19:34:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to sign onto this letter. The Biden Administration must address this issue immediately. Read the full letter below ⬇️","date":"Thu May 20 19:06:21 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"WSJ’s headlining story today: Why Can’t Companies Find Workers?\n\nA million dollar question with a $300 dollar answer. https://t.co/cXLBGGe4kz","date":"Thu May 20 16:16:36 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This morning I co-hosted a breakfast for WI National Guard troops who have been serving our U.S. Capitol honorably this year. While I am grateful for their service, I‘m happy to hear these soldiers are headed home to their families in the coming days. https://t.co/ipUOeG44DX","date":"Thu May 20 15:06:09 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A point of order on the headline: the “growing calls” to pack the court are coming from leftist politicians. Just because they yell louder, does not mean they represent the view of the majority of Americans on this “bonehead” idea.","date":"Wed May 19 18:50:48 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The $300-per-week stay at home bonus is not working for small businesses. These business owners cannot compete with federal payouts and remain open. My message to Gov. Evers: it’s time to end the federal unemployment bonus and get Wisconsinites back to work. https://t.co/HPR8MFkE0O","date":"Wed May 19 16:50:07 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"When will Democrats allow a discussion about policies that caused high #’s of COVID-19 deaths in nursing homes? I intro’d an amendment at a @JudiciaryGOP markup today to examine the circumstances surrounding these deadly policies—Democrats voted it down. We owe families answers. https://t.co/glzGEH7BxH","date":"Tue May 18 20:56:15 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"By definition, UI is an insurance program, not a benefit program. It should not be depended on long-term, and it’s far past due for the government to stop paying Americans a $300 federal unemployment bonus to stay home. I joined @FinnertyUSA on @newsmax to unpack this issue. https://t.co/F0vf8daFmR","date":"Tue May 18 16:57:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden Admin. is talking out of both sides of their mouth. Biden canceled the #Keystone Pipeline on day 1 in office—destroying 1000s of good jobs. Now following the Colonial Pipeline cyberattack, the Admin. cedes that pipelines are “the best way to go.”\nhttps://t.co/WATJ1uRCD3","date":"Tue May 18 15:56:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Tune into @newsmax this morning at 7:50 AM ET—I’ll be speaking with @FinnertyUSA about President Biden's $300-a-week stay at home bonus.","date":"Tue May 18 11:27:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m encouraged to see the Biden Admin. respond to the bipartisan letter my colleagues &amp; I sent last week on the EU’s retaliatory tariffs. The announcement from the EU to hold off on these tariffs is a win for Wisconsin workers.\nhttps://t.co/tdH1aEMjdW","date":"Mon May 17 21:39:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Better late than never? @virginiafoxx is right, the latest 180° from Weingarten is the teachers union’s last ditch attempt to get on board with what we’ve already known for months: schools can, and schools should safely reopen. \nhttps://t.co/KpK5AIvYV5","date":"Mon May 17 17:23:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Paying workers a $300 bonus to stay home is crushing small businesses in #WI05. 16 states have already elected to opt out of the federal unemployment bonus and Wisconsin should too. @GovEvers must stand up for small businesses and get Wisconsinites back to work. https://t.co/mearG3PxqE","date":"Mon May 17 16:53:57 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Sending all my thanks and gratitude to the heroes who serve in our armed forces today! #ArmedForcesDay https://t.co/xWCOP5gcPr","date":"Sun May 16 00:45:21 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Law enforcement members who serve as school safety officers play an important role in shaping the perspective of and building relationships with youth groups. I brought attention to the positive role officers play in our schools at @JudiciaryGOP yesterday. #NationalPoliceWeek https://t.co/DxbxKj1pDn","date":"Fri May 14 15:51:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden Admin’s lax immigration policies incentivize cartels to continue human smuggling and trafficking. I agree with @JessicaV_CIS; securing our borders will help reduce juvenile crime and increase youth access to employment. https://t.co/gg5tQZSffC","date":"Thu May 13 21:41:46 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My colleagues &amp; I sent a letter to Sec. Raimondo &amp; Ambassador Tai urging them to stand with Harley-Davidson workers across the U.S. and #WI in the face of retaliatory tariff measures imposed by the EU. https://t.co/vdieyw4J36","date":"Thu May 13 15:19:25 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The first hurdle in the lawsuit I supported to repeal the Biden Admin’s unconstitutional state tax cut ban has been won. The Court ruled there's a “substantial likelihood” Biden’s partisan spending bill violates the Spending Clause of the Constitution.\nhttps://t.co/NHGMXJCvjv","date":"Wed May 12 21:27:17 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This week is #CharterSchoolsWeek! I’m proud to celebrate the charter schools community for offering high-quality public education that fit students’ individual needs for the last 30 years. https://t.co/GX638YXIfc","date":"Wed May 12 19:40:16 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We must stand with our friends in Israel. Now more than ever, we need the Abraham Accords signed by Trump to promote peace and cooperation in the Middle East. I urge President Biden to work with our allies in the region, so these conflicts come to an end.","date":"Wed May 12 14:47:59 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This #NationalPoliceWeek I want to thank all officers, but especially my father, Stephen Fitzgerald. My father retired in 2016 with a long, distinguished career serving as a sheriff, a U.S. Marshal, &amp; superintendent of the #WI State Patrol. Thank you to those who keep us safe! https://t.co/PDibO3NxAF","date":"Tue May 11 21:29:09 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday, I offered my congratulations to Rylie Rude from Menomonee Falls High School for winning the #WI05 Artistic Discovery Contest! Rylie’s artwork is called “The City,” and will be displayed in the U.S. Capitol. Thank you to all the students who entered. https://t.co/4FrrwEwemK","date":"Tue May 11 16:18:17 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsin Residents: 📢 Tax Day is quickly approaching! Both the federal and Wisconsin return are due May 17th. Learn more about how to file your taxes at https://t.co/qHnbLl5bhw.","date":"Tue May 11 14:26:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#WI05 Artists 🎨⬇️ https://t.co/62UWdQfI00","date":"Mon May 10 13:19:19 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Mother’s Day to my wife Lisa and my mother Bonnie! https://t.co/3SZ5Dc7Dji","date":"Sun May 09 18:26:21 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Spot on. We’re in the midst of recovering from a pandemic—emphasis on \"recovery\" in large part due to the ingenuity of private enterprise. Waiving patent protections only signals IP rights will not be respected &amp; jeopardizes responses to future pandemics.\nhttps://t.co/WhwOPwPWmX","date":"Thu May 06 18:49:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"As promised, round two! All pieces pictured are created by #WI05 artists. https://t.co/y0zh1C15QS","date":"Thu May 06 16:57:49 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"How it started:                 How it's going: https://t.co/eWS3XpAzIE","date":"Wed May 05 18:35:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Let’s break this down. The so called “infrastructure” plan spends just 6 percent on roads, bridges, and highways and about 25 percent on traditional infrastructure. Instead, Democrats are pouring billions of dollars into Green New Deal policies. \nhttps://t.co/8VGrBVYfrS","date":"Wed May 05 17:08:31 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden Administration plans to pay for this radical agenda by levying the largest tax hike since 1968 on the American people. These tax hikes will destroy 1 million jobs, contrary to the Admin’s promises to create opportunity, &amp; will send American jobs and businesses overseas.","date":"Wed May 05 17:08:31 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"VP Kamala Harris went on a road trip – not to the southern border where she is presiding over a crisis – but to Wisconsin to tout the Administration’s latest infrastructure plan. Their plan to pay for this proposal? Cut jobs and raise taxes.\nhttps://t.co/YNwPqVO2rp","date":"Wed May 05 17:08:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'll be joining @FoxBusiness soon to talk about the Biden Administration's infrastructure and spending plan. Tune in!","date":"Tue May 04 21:08:38 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"(2/3) Already, the BRI covers countries representing more than half of the world’s population and more than one-third of global economic output, packaging cheap and corrupt infrastructure deals to developing countries vulnerable to instability.","date":"Tue May 04 17:58:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"(3/3) Today, I introduced the BRIDGE Act as part of a rollout by the @RepublicanStudy Committee to counter Communist China. This legislation will hold the Biden Administration accountable to combat China’s Belt &amp; Road Initiative. More here ⬇️\nhttps://t.co/Mb95Cb6g5H","date":"Tue May 04 17:58:30 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"(1/3) In less than 10 years of its existence, China’s Belt &amp; Road Initiative has shown us that it can have serious consequences for our foreign policy and economic security by giving Beijing the power to dictate unfair bilateral arrangements for its own strategic benefit.","date":"Tue May 04 17:58:29 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Biden said President Trump’s travel restrictions on China were xenophobic and the media amplified that message. Now Biden wants to restrict travel from India and there’s hardly a peep out of the media. Liberal hypocrisy knows no bounds!\nhttps://t.co/EI6ng6pyEL","date":"Mon May 03 19:22:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you to all the artists in #WI05 who submitted artwork to the Annual Congressional Arts Competition. Over the next week I am going to showcase the submissions so everyone can have a chance to appreciate these works of art. 🎨 https://t.co/e77jwoCuxF","date":"Fri Apr 30 16:19:16 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If you haven’t already, sign up for my eNewsletter to keep up with #WI05 news ⬇️ https://t.co/GnbbuEbaYX https://t.co/c3aMZwQkUT","date":"Fri Apr 30 14:29:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Spoke w/ @DanODonnellShow about POTUS’ #JointAddress. One thing was made clear in the President’s speech, Democrats have no interest in unity. Biden has enabled Democrats to blow taxpayer dollars, pass #CongressPacking legislation &amp; step on rights guaranteed by our Constitution. https://t.co/fRaaPeADwB","date":"Thu Apr 29 21:53:08 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @DanODonnellShow soon to discuss President Biden's #JointAddress. Tune in 📻\nhttps://t.co/jGGxgDi88D","date":"Thu Apr 29 15:19:33 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My full response to President Biden's #JointAddress to Congress last night. ⬇️\nhttps://t.co/PrZ3e0CTlK","date":"Thu Apr 29 14:02:16 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Actions speak louder than words.","date":"Thu Apr 29 01:48:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In POTUS’ 1st 100 days he managed to kill #Keystone, crushing countless good paying jobs in #WI05. He doubled down by burdening taxpayers with trillions of dollars of deficit spending. This is bad leadership, \"cut jobs, raise taxes,\" shouldn’t serve as the guiding principle.","date":"Wed Apr 28 21:39:43 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We’re four months into the 117th Congress and Democrats have held 0 hearings on the border crisis. As the party responsible for setting Committee agendas, this is irresponsible and completely unacceptable. https://t.co/BUjncOSWhw","date":"Tue Apr 27 18:56:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The People’s House is quickly turning into Pelosi’s House. It’s no coincidence that the most consequential policies Democrats have passed this Congress are centered around consolidating their power. ⬇️⬇️⬇️ https://t.co/t06OFJU4OB","date":"Mon Apr 26 17:29:41 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Even Iran's senior leadership begrudgingly admits the effectiveness of U.S. sanctions. It's imperative that Congress keep the pressure on the Iranian regime by passing the #MaxPressure Act.\nhttps://t.co/e8jllGSbdb","date":"Mon Apr 26 16:20:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The #MaxPressure Act codifies the Trump Administration sanctions strategy into law &amp; ensures Congress is involved in future negotiations with Iran. Allowing President Biden to return to the same failed approach of the Obama Admin. is leading the U.S. down a dangerous path. https://t.co/QbMVOJt0xz","date":"Fri Apr 23 19:44:46 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Birthday, @USArmyReserve!\n\nI'm grateful for my 27 years in the reserve and I'm thankful to all those who continue to serve. #Hooah https://t.co/nYVv39navx","date":"Fri Apr 23 15:43:57 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Tune into @newsmax this morning at 8:00 ET—I’ll be speaking with @FinnertyUSA about @RepublicanStudy's #MaxPressure rollout and the Democrats' unconstitutional #CongressPacking proposal.","date":"Fri Apr 23 11:00:02 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined my Republican colleagues in a letter sent to POTUS asking him to halt his coercive and unconstitutional ban on state tax cuts. Read more about our letter via @FoxBusiness ⬇️\nhttps://t.co/xT2rhVvYUX","date":"Thu Apr 22 22:24:12 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"First 👉 #CourtPacking \n\nNow 👉 #CongressPacking\n\nThese two policies are all about Democrat power. \nhttps://t.co/1K3MbPytvW","date":"Thu Apr 22 21:27:32 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Biden is taking a softball approach to negotiations w/ Iran. A reminder 👉 the regime that sponsors terrorism should make concessions, not the other way around. The #MaxPressure Act allows the U.S. to hold Iran accountable &amp; protect our country &amp; allies. \nhttps://t.co/VW89xiczss","date":"Thu Apr 22 14:00:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined @VickiMcKenna to discuss Andrea Palm’s disastrous record in WI as head of Health Services—so disastrous, even the WI Supreme Court ruled twice that her orders were unlawful. If you look at Palm’s record, I don’t know how you can vote for her nomination to HHS Deputy Sec. https://t.co/ZhdCMad7eU","date":"Thu Apr 22 13:11:12 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"While HR 2630 is a small step in the right direction, 5 months doesn’t go nearly far enough. My bill, the SOFA Act, would permanently designate fentanyl a schedule I drug so law enforcement can consistently crack down on bad actors. We must do more to combat the opioid epidemic. https://t.co/qoxM6Z7qEh","date":"Thu Apr 22 01:30:14 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It was great to join my @RepublicanStudy colleagues and @mikepompeo today to unveil the Maximum Pressure Act. The Biden Administration is making needless concessions to bring Iran back to the negotiating table, the U.S. must take a firm approach toward negotiations. #MaxPressure","date":"Wed Apr 21 18:53:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’ll be joining my @RepublicanStudy colleagues and former Sec. of State @mikepompeo this afternoon. \n\n⬇️ Tune in at NOON ET. ⬇️ #MaxPressure","date":"Wed Apr 21 14:35:48 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last week Democrats’ agenda was #CourtPacking, now it’s #CongressPacking.\n\nH.R. 51 packs the Senate w/ 2 more seats—even though DC statehood requires a constitutional amendment &amp; despite framers’ intent to make DC a neutral federal district. Democrats’ agenda is only about power. https://t.co/jH4zBs4Tjy","date":"Tue Apr 20 16:42:14 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I signed onto @RepDustyJohnson’s legislation to cap the Supreme Court at nine justices. Attempts by Democrats to pack the Supreme Court now are purely partisan in nature and will only further sow distrust and division among the American people.","date":"Mon Apr 19 19:15:39 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Microloan Transparency &amp; Accountability Act is a bipartisan victory for small business owners. Thank you @RepTimBurchett, @RepAndyKimNJ, &amp; @RepMarieNewman for helping to get this bill across the finish line. \nhttps://t.co/JrhS1VY47k","date":"Fri Apr 16 13:39:56 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Democrats’ latest attack on the Supreme Court marks a new low. I oppose this effort in the strongest terms and I will work closely with my colleagues on H.J. Res 11—a constitutional amendment to cap the court at 9 justices.\nhttps://t.co/txiSrTS8s0","date":"Thu Apr 15 22:23:12 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This speaks volumes about the “build back better” priorities of the Biden Administration. \nhttps://t.co/rAv0J3XJwi","date":"Thu Apr 15 21:26:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Biden killed #KeystoneXL &amp; hundreds of WI jobs along w/ it, but is refusing to impose sanctions on a Russian pipeline that threatens the energy security of our allies, despite previously receiving legal sign-off from DOJ to do so.","date":"Thu Apr 15 21:26:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"To be clear, we all support fairness in the workplace but HR 7 is far from that.\n\nThe bill eliminates discretionary bonuses–including the Christmas bonus–in the name of “fairness.” HR 7 falls woefully short of its aim.\n\nWorkers are not the winners in this bill, trial lawyers are. https://t.co/vdZEWnHGQq","date":"Thu Apr 15 18:58:51 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"China remains a key source of supply for precursor chemicals Mexican cartels use to produce large amounts of fentanyl they are smuggling into the U.S. I joined @Newsmax to talk about how the influx at our southern border is exasperating both the border &amp; drug crisis in the U.S. https://t.co/PVjfdRuYM7","date":"Thu Apr 15 17:19:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"@SBAList @SteveScalise @Kat_Cammack @RepAnnWagner Proud to have added my name to the petition yesterday.","date":"Thu Apr 15 14:57:39 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was in the @JudiciaryGOP committee room last night when news of the Democrats' court packing legislation leaked. This is a threat to one of our most revered federal institutions and it shows just how desperate Democrats are to grab onto power for as long as they can.","date":"Thu Apr 15 13:48:19 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Tune into @newsmax this morning at 7:50 ET—I’ll be speaking with @FinnertyUSA about recent legislation I introduced, the SOFA Act, and the ongoing crisis at the southern border.","date":"Thu Apr 15 11:28:49 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"🧵 I signed onto a discharge petition filed by my colleague @RepKatCammack to support @RepAnnWagner's H.R. 619, the Born Alive Abortion Survivors Protection Act. (1/3)","date":"Wed Apr 14 22:59:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"H.R. 619 states that if a child is born alive after surviving an abortion, any health care practitioner present must exercise the same degree of care to preserve the life and health of the child as any other child of the same gestational age would receive. (2/3)","date":"Wed Apr 14 22:59:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The lives of infants who have been born alive is not a matter of debate. I urge all of my colleagues to sign this petition and support innocent lives. This is just commonsense. #ProLife (3/3)","date":"Wed Apr 14 22:59:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I offered an amendment to H.R. 1333 at a @JudiciaryGOP markup today. My amendment would've preserved a safeguard allowing the US to review foreign nationals from countries like China on a reciprocal basis. Watch my full remarks on the amendment ⬇️📺 https://t.co/XMhblql4lk","date":"Wed Apr 14 18:05:40 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, USCP Officer Billy Evans lies in honor in the U.S. Capitol Rotunda. I ask everyone to join me in praying for Officer Evans’ family as we pay tribute to a hero who made the ultimate sacrifice protecting our Capitol. https://t.co/Ms3XLmlyqQ","date":"Tue Apr 13 21:24:08 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"As our country recovers from the crushing impacts of the #COVID19 pandemic, tax hikes couldn’t be further from the solution to get Americans and our economy back on track. https://t.co/fWC1gxrfRD","date":"Tue Apr 13 14:47:51 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I introduced the SOFA Act alongside @SenRonJohnson to make this class-wide scheduling permanent. Read the full report here ⬇️\nhttps://t.co/pANfJPbmJX","date":"Tue Apr 13 13:41:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@USGAO dropped a report yesterday on the implications of class-wide scheduling of fentanyl-related substances. Law enforcement officials cited in the report found class-wide scheduling reduced incentives for cartels to circumvent law through new &amp; existing fentanyl substances.","date":"Tue Apr 13 13:41:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last week, I signed onto an amicus brief filed by @ACLJ to defend states’ rights against President Biden’s ban on states lowering taxes. The Biden Administration’s conditioning of federal relief in their #COVID19 legislation is coercive &amp; unconstitutional.\nhttps://t.co/dLGCY4IE22","date":"Mon Apr 12 18:59:34 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I stopped by the food drive Troop 742 is hosting in Hartford today to donate supplies. Rain or shine, these boys are keeping up the good work! #WI05 https://t.co/4iTCb5rqPi","date":"Sat Apr 10 19:19:29 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Meet Bentley Schacht. An 8-year-old #WI05 native who has been creating &amp; selling spin art to raise money for the Jefferson fire department. Yesterday, I was able to thank him &amp; honor him with a certificate for his contributions to the community. Keep up the awesome work, Bentley! https://t.co/O72ATC08CZ","date":"Fri Apr 09 16:36:39 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Ernie Yanke is a WWII veteran, father, husband, &amp; beloved friend to many. It was my honor to present him with an official copy of the Congressional Record to celebrate his 100 years of life. Ernie’s life work deserves recognition &amp; reflection as we mark this important milestone. https://t.co/mPJq0J3vFc","date":"Thu Apr 08 19:23:32 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"President Biden’s actions, or lack thereof, have created real consequences. This administration is responsible for the crisis at our southern border. We need solutions now.","date":"Thu Apr 08 00:27:12 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It’s time to step up and deliver for our nation’s veterans.","date":"Wed Apr 07 16:46:54 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My colleagues &amp; I sent a bipartisan letter to POTUS &amp; Sec. Ferriero urging the administration to take action to eliminate the growing backlog at NPRC.\n\n“We cannot allow our nation’s veterans to die while waiting for a piece of paper to prove they are entitled to medical services” https://t.co/8rXK2PSQJW","date":"Tue Apr 06 19:34:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, on #GoldStarSpousesDay I want to recognize and thank the families of servicemembers who made the ultimate sacrifice to protect our country. We will forever be indebted to your bravery and sacrifice. https://t.co/qkZdXDoOJA","date":"Mon Apr 05 18:46:29 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My family is wishing everyone a blessed #EasterSunday. He is risen! https://t.co/O5KtrVa8eE","date":"Sun Apr 04 13:11:33 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"As we continue to learn more about what unfolded today, I ask everyone to please join me in praying for our United States Capitol Police family. I am deeply grateful for the officers who courageously serve and protect us every day.","date":"Fri Apr 02 20:05:33 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined my colleagues in a bipartisan letter calling on the IRS to extend the fed. tax filing deadline for 1st quarter est. tax payments to May 17. Small businesses have struggled to make ends meet during the pandemic; we should do all we can to alleviate gov’t-imposed burdens. https://t.co/Y3KxoUEL0u","date":"Thu Apr 01 15:58:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In the first 5 months of FY21 alone, @CBP agents seized more than 4,900 lb. of fentanyl, surpassing the total for all of FY20. Now more than ever we need the SOFA Act. Amid the growing border crisis, we must give law enforcement the tools they need to crack down on bad actors.","date":"Wed Mar 31 19:02:54 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Too many Wisconsin families have lost loved ones to fentanyl overdoses. I joined @SenRonJohnson to introduce the SOFA Act to help end the abuse of this often life-destroying substance. ⬇️\nhttps://t.co/UeJ7mLvzBr","date":"Wed Mar 31 17:19:36 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"PSA for #WI05 farmers &amp; ag workers. If your operation has been directly impacted by #COVID19, @USDA will begin accepting new &amp; modified CFAP 2 applications on April 5. More information can be found at the link below. ⬇️\nhttps://t.co/9imDJ42S0y","date":"Wed Mar 31 14:38:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined 9 @JudiciaryGOP Members in a letter weeks ago demanding a hearing on the border crisis so we could begin to identify solutions. \n\n...no response. \n\nRepublicans want to address the unfolding crisis at our front door, Democrats want to sweep it under the rug.","date":"Tue Mar 30 18:42:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"🚨 This is a humanitarian crisis. \n\n🚨 This is a national security crisis. \n\n🚨 This is the #BidenBorderCrisis. https://t.co/sre44uuqAb","date":"Tue Mar 30 18:41:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Maintaining trust with the public is the most fundamental responsibility of government during times of crisis. Unfortunately, we’re learning now the Evers admin. underreported 1,000 long-term care COVID deaths when the pandemic swept the nation. #WI needs transparency &amp; answers. https://t.co/Zg0L11XbLF","date":"Fri Mar 26 19:34:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Tune into @newsmax this morning at 7:50 ET—I’ll be speaking with @FinnertyUSA about the Evers Administration’s data shortfalls in reporting long-term care COVID-19 deaths in Wisconsin.","date":"Fri Mar 26 11:10:39 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Reminder to #WI05 artists 👉 the deadline for the 40th Annual Congressional Arts Competition is quickly approaching! All art must be submitted to my office April 15th to be considered by our panel of judges. Learn more here ⬇️\nhttps://t.co/DOnsCCp6Tg","date":"Thu Mar 25 13:38:07 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"🧵Great thread from my colleague @WarrenDavidson  detailing the importance of the National Personnel Records Center (NPRC), which veterans depend on for multiple health &amp; benefit services, and the growing emergency of their 480,000 case backlog. This issue must be addressed now.","date":"Wed Mar 24 20:28:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"While we all agree on the principle of fairness, in practice, this bill is far from it.\n\nH.R. 7 crushes the Christmas bonus &amp; it’s really a giveaway for trial lawyers. @RepStefanik’s amendment would have made needed improvements to the bill, but Dems voted it down on party lines.","date":"Wed Mar 24 19:28:15 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is unacceptable. This teachers union continues to politicize the pandemic, most ironically, at the expense of student health &amp; education. I’m proud of the school districts in #WI that have begun to safely reopen, it’s time for the rest of our nation’s schools to follow suit.","date":"Wed Mar 24 18:22:09 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I want to thank all farmers and ag workers in #WI05 on this #NationalAgDay. Thank you for your tireless work to supply quality food to Wisconsinites! https://t.co/GfkWnZ3Bv0","date":"Tue Mar 23 17:04:22 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @DanODonnellShow now to talk about the Evers Administration's reclassification and data shortfall in reporting long-term care COVID-19 deaths. Listen here ⬇️\nhttps://t.co/jGGxgD0wK3","date":"Tue Mar 23 15:31:08 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you @RepGrothman, @RepGallagher, @RepBryanSteil, &amp; @RepTiffany for joining me in sending this letter. Gov. Evers must offer answers for these troubling reports &amp; provide more transparency. https://t.co/nNy6E3L086","date":"Mon Mar 22 21:03:50 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, I sent a letter to Gov. Evers on the reclassifying of 1,000 COVID-19 deaths as reported by the Journal Sentinel last week. Our senior population has been among the most vulnerable during the pandemic &amp; this data shortfall may have cost lives.\nhttps://t.co/cPRqnUwaQA","date":"Mon Mar 22 21:02:33 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The top Democrat on the Budget Committee is arguing that debt has no meaning. This message is patently false and dangerous indeed. What ever happened to responsibility?","date":"Fri Mar 19 20:17:16 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I spoke w/ @MacIverWisc this week about the $1.9 budget reconciliation. Bottom line, this was a bill full of liberal wish list items under the guise of “relief” rammed through Congress w/o giving the minority an opportunity to hear from witnesses about our country’s actual needs. https://t.co/qLl4EdsFi3","date":"Fri Mar 19 17:51:32 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden administration’s failure to secure our southern border is inexcusable. In Feb. alone, over 100,000 immigrants were apprehended at the border, more than 3x the monthly total in Feb. 2020. Let’s call this what it is, a crisis.","date":"Fri Mar 19 12:52:16 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"📺WATCH: Democrats are now trying to eliminate the Christmas bonus under the guise of “fairness.” I spoke with a witness today at a @EdLaborGOP hearing about how the Democrats paycheck proposal would destroy this common practice. ⬇️ https://t.co/4jtfyHsYXo","date":"Thu Mar 18 21:40:42 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"ATTN #WI05 artists: each spring, the US House of Representatives sponsors a nation-wide art competition open to all high school students for a chance to have their artwork displayed in the US Capitol. I encourage all interested #WI05 students to apply ⬇️\nhttps://t.co/DOnsCCp6Tg","date":"Fri Mar 05 21:14:19 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined Bill Osmulski yesterday on the @MacIverWisc Newsmakers podcast to talk about the Democrats $1.9 trillion budget reconciliation, how they plan to pay for it, and the current state of the U.S. Capitol. You can listen to the full conversation here ⬇️\nhttps://t.co/9aO26CuYvo","date":"Thu Mar 18 15:14:49 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@RepMMM has been serving the people of Iowa’s Second District for almost 3 months now and I can speak personally to her effective work as a lawmaker. I look forward to continuing this work together in Congress.","date":"Thu Mar 18 00:11:14 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy St. Patrick’s Day to all those celebrating today! 🍀 https://t.co/q1t5Phk1iu","date":"Wed Mar 17 16:21:48 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This story underscores just how challenging pandemic-imposed school shutdowns have been for Wisconsin students. Failure rates have skyrocketed and morale is low. Schools must reopen so kids can return to effective in-person instruction.\nhttps://t.co/eJma9TbY65","date":"Tue Mar 16 18:26:38 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy 102nd anniversary to our friends over at @AmericanLegion! Thank you for your dedicated service to the veterans of #WI and for continuing to raise awareness across communities about the military experience.","date":"Mon Mar 15 18:49:52 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Bottom line, this bill funds mostly Democrat wish list items – not COVID-related health measures. I strongly support targeted relief to help the American people in this time of difficulty. This partisan bill will only burden American taxpayers in the long run.","date":"Mon Mar 15 16:55:29 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Act 10 was significant in many ways and set Wisconsin up for years of prosperity. As I continue to serve #WI05 in my new role here in Congress, I will continue to advocate for policies that give power back to workers.","date":"Thu Mar 11 21:43:06 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@WaltonFamilyFdn/@AEI released a report today analyzing over 130 studies on reopening schools &amp; found any benefits to closing schools are outweighed by the grave risks to children from remote-only schooling. We must put students first; this bill is a step in the right direction.","date":"Thu Mar 11 17:49:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm proud to cosponsor @RepAshleyHinson's legislation, the Reopen Schools Act. Countless reports &amp; first-hand accounts from parents have detailed the disadvantages for students that miss out on in-person learning. The evidence is clear: it's time to #SafelyReopen schools.","date":"Thu Mar 11 16:59:52 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today I co-introduced a bill to study the impacts of a $15 minimum wage alongside my @HSBCgop colleagues. It is my hope that this report will help deliver solutions for small businesses. My full statement ⬇️\nhttps://t.co/wWj4F59LAf","date":"Wed Mar 10 23:10:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats want to erode our most basic liberties guaranteed by the Constitution. Last week it was the 1st Amendment with #HR1. This week it’s the 2nd Amendment with #HR8, a bill that infringes on the rights of law-abiding gun owners. https://t.co/Mcgl9Q0Opu","date":"Wed Mar 10 22:55:14 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Biden admin. said they wanted to pass a bill that meets the moment of the pandemic, but this $1.9 trillion “relief” package only allocates 9% of funds toward health measures…Americans need targeted relief, not a multi trillion-dollar grab bag of liberal pet projects. https://t.co/vaGe001RLL","date":"Wed Mar 10 16:18:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats just passed the most drastic change to labor law this county has seen in more than 80 years. Democrats are putting the needs of union bosses ahead of workers. Read my full statement ⬇️\nhttps://t.co/hgskmsMyri","date":"Wed Mar 10 02:07:16 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I introduced an amendment to the #ProUnionBosses Act that would empower workers by requiring labor unions to receive written consent from an employee before using union dues or fees collected for non-collective bargaining activities. Watch my remarks here.\nhttps://t.co/7It0GWlJPW","date":"Tue Mar 09 20:34:36 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My Democrat colleagues claim the PRO Act is a bill all about democracy in the workplace...This bill robs workers of their liberty &amp; forces them to pay to join a union without a say on how that money is spent. How is that democracy? https://t.co/rlNNbNC2qw","date":"Tue Mar 09 18:53:44 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined 139 Members in a bipartisan letter sent to Sec. Blinken calling on the State Dept. to hold Iran accountable for their cont’d pursuit of a nuclear weapons program, ballistic missile program, &amp; funding of terrorism. These steps are necessary to achieve peace in the region. https://t.co/TFqiZYAjIx","date":"Tue Mar 09 17:09:52 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This week the House is voting on the #ProUnionBosses Act. This bill is bad for workers. As a state senator, I fought for #RightToWork laws so Wisconsinites could enjoy freedom in the workplace. The PRO Act destroys this protection &amp; forces workers to pay up to Big Labor.","date":"Mon Mar 08 18:35:04 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Had a great time meeting with @WICULeague this week. Meeting with stakeholders from #WI05 looks a little different right now. I look forward to inviting groups to my office sometime soon! https://t.co/tPIb21gHj4","date":"Sat Mar 06 22:12:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"ATTN #WI05 artists: each spring, the US House of Representatives sponsors a nation-wide art competition open to all high school students for a chance to have their artwork displayed in the US Capitol. I encourage all interested #WI05 students to apply ⬇️\nhttps://t.co/DOnsCCp6Tg","date":"Fri Mar 05 21:14:19 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Earlier this week I co-introduced bipartisan legislation to help increase transparency within @SBAgov’s Microloan Program. This oversight will ensure taxpayer dollars are being well-spent and accounted for. Read my full statement ⬇️\nhttps://t.co/idNbX5WRSU","date":"Fri Mar 05 15:10:38 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats just passed legislation that would unleash a partisan takeover of our elections. H.R. 1 serves the politicians, not the American people. My full statement ⬇️\nhttps://t.co/klGInTZjdh","date":"Thu Mar 04 04:19:40 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"WATCH: Instead of focusing on how we can help the police, Democrats want to focus on what we can take from the police. H.R. 1280 reduces due process, restricts access to needed equipment, and makes it harder to access critical funding. https://t.co/2DAAcusTRg","date":"Thu Mar 04 00:41:43 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Now the majority of Democrat members voted to change the legal voting age to 16. Apparently they don’t think #HR1—which would fund political campaigns with taxpayer dollars, legalize ballot harvesting, and nationalize our elections—is radical enough already.","date":"Wed Mar 03 21:21:38 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Nearly a hundred Democrats voted today to allow currently incarcerated felons to vote in Federal elections, likely a violation of the 14th Amendment. #HR1 is bad enough as it is but apparently some Democrats want to make the bill even worse.","date":"Tue Mar 02 21:15:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"H.R. 1 puts politicians ahead of the American people and codifies nationwide election changes made at the state level last year that shook the faith of Americans in the integrity of our election system. #ForThePoliticians https://t.co/RfyQHR0fdC","date":"Tue Mar 02 17:28:48 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The House will vote on H.R. 1, #ForThePoliticians Act this week. Here are a few regressive ideas Democrats are advocating...\n\n👉fund political campaigns with taxpayer dollars\n👉nationalize our elections &amp; seize control granted to state legislatures\n👉legalize ballot harvesting","date":"Tue Mar 02 13:52:25 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Gov. Evers is already sitting on hundreds of millions of dollars in federal funds provided to #WI from past relief packages. Now he wants more money? This is ridiculous, Wisconsinites need leadership, not crushing debt from a $1.9 trillion Democrat wish list. https://t.co/0LtjSIJ8tV","date":"Tue Mar 02 00:57:56 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was proud to sign onto this resolution last week led by my fellow #WI colleague @RepBryanSteil. Pres. Biden preached “Listen to the experts. Do what they tell you.” It’s time we hold POTUS to his word &amp; listen to the experts who say we can &amp; should safely reopen schools.","date":"Mon Mar 01 16:58:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m joining @JayWeber3 this morning at 8:10 AM CT. Be sure to tune in ⬇️\nhttps://t.co/jGGxgDi88D","date":"Mon Mar 01 13:02:03 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It was great meeting with the @JapanEmbDC yesterday to discuss the importance of the US-Japan relationship to trade and security. #DYK Japan is one of the top markets for US cheese? They are certain to fit right in with the cheeseheads of #WI05! https://t.co/OR9cWY3YVU","date":"Sat Feb 27 15:49:58 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Dems just passed a $1.9 trillion boondoggle masquerading as pandemic relief. This bill only directs 9% of funding toward #COVID19 measures. The other 91% is spent elsewhere, including for projects like Pelosi’s tunnel &amp; Schumer’s bridge.\n\nMy statement ⬇️\nhttps://t.co/0RGs1cV2Mp","date":"Sat Feb 27 07:19:45 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m joining @VickiMcKenna today at 2:15 CT to talk about the Democrats’ $1.9 trillion #COVID19 “relief” proposal, which reads more like a wish list Pelosi and Schumer put together. Be sure to tune in ⬇️\nhttps://t.co/jGGxgDi88D","date":"Fri Feb 26 19:13:46 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The $15 fed min wage will be DOA with the Senate Parliamentarian’s ruling last night to exclude the provision. Pelosi is putting politics ahead of policy. The Senate Parliamentarian made the right call. Small Businesses can’t afford a $15 min wage.","date":"Fri Feb 26 17:25:27 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@USCBO just reported the Democrats’ $1.9 trillion bill will trigger a $36 billion mandatory cut to Medicare. Bottom line: Democrats want to fund Schumer’s bridge and Pelosi’s tunnel at the expense of healthcare for Wisconsin’s seniors. \n\nThis is wrong.","date":"Fri Feb 26 14:56:04 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"From record players to iPhones, tech always moves faster than gov't. At @JudiciaryGOP I spoke about the need for a tailored approach to keep Big Tech from de-platforming those w/ beliefs &amp; values different from Silicon Valley.\n\nReforming #Section230 is the necessary remedy. https://t.co/0WTlJKhfhQ","date":"Fri Feb 26 13:34:36 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Everyone should watch this. @SenatorRisch presses Interior Sec. nominee 6x on Biden’s EO to halt #KeystoneXL. She can’t seem to explain why she supports stopping the pipeline. Reminder👉#KeystoneXL provided good-paying WI jobs, energy independence, &amp; a safe way to transport oil.","date":"Thu Feb 25 16:42:42 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Lt. Col. James “Maggie” Megellas is, in every sense of the word, an American hero. I am proud to join @RepGrothman on this bill to authorize the President to award Megellas, a #WI native, with the Medal of Honor.","date":"Wed Feb 24 20:15:29 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@HSBCgop is discussing the impact a $15 fed min wage will have on businesses &amp; workers today. As a reminder, Democrats' voted down my amendment a couple weeks ago to direct the @SBAgov to study this exact issue...\n\n📺 You can tune into the hearing here ⬇️\nhttps://t.co/URAPSAJonz","date":"Wed Feb 24 15:51:05 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"@Jim_Jordan is right. The Trump admin. blocked Russian pipeline &amp; put American jobs first. Now Pres. Biden is allowing Russian pipeline to go forward, but cancelling #KeystoneXL, costing US workers thousands of good-paying jobs. Democrats are not putting American workers first.","date":"Tue Feb 23 19:08:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Schools are reopened when students are back 5 days a week, not 1 day a week. The #SafelyReopen debate should not be a debate at all.\n\nFacts are clear &amp; Pres. Biden's top #COVID19 advisors, including Dr. Fauci, have been direct: schools can &amp; should reopen.\nhttps://t.co/5TSJ3qe0AU","date":"Mon Feb 22 20:25:53 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last week, Texans lost power due to state-wide power outages.\n\nICYMI: Here in #WI, @BriggsStratton, @Generac, &amp; @Kohler Power stepped up to the plate to ensure generators were delivered to impacted areas. @MKEBizJournal covered this important story ⬇️\nhttps://t.co/f4hTb7Edlk","date":"Mon Feb 22 18:38:37 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Pres. Biden says $130 bil. in #COVID19 aid is required to #SafelyReopen K-12 schools, but tens of billions of allocated funds remain unspent...\n\nWhat does this mean? Pres. Biden is bowing to teachers' unions instead of standing for our nation's students.⁣\nhttps://t.co/jBZJXlkGLA","date":"Fri Feb 19 22:29:03 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Let's make no mistake, Democrats' #HR1 is #ForThePoliticians, not the American people.\n \nThis bill would assert more federal control over elections, crippling state legislatures’ Constitutionally-granted authority in the process. \nhttps://t.co/hLXsMOs2aP","date":"Thu Feb 18 17:32:29 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today is #AshWednesday, the beginning of the Lenten season. May we all grow closer to God during this holy season. https://t.co/dirS2xZVBv","date":"Wed Feb 17 18:08:58 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Democrats’ minimum wage proposal puts an alarming number of jobs at risk. I offered a simple amendment at the @HSBCGop markup of the budget reconciliation to study the impacts a $15 min wage would have on small businesses. \n⁣\nDemocrats voted my amendment down on party-lines. https://t.co/oxKs6zEs5B","date":"Tue Feb 16 22:48:07 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My congratulations go out to Detective Chmielewski! You make #WI05 proud, thank you for your service.","date":"Tue Feb 16 15:41:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Students deserve better than this. Experts agree that virtual learning limits students ability to learn.\n\nPresident Biden should follow the advice of his own @CDCgov: it's safe to reopen.","date":"Thu Feb 11 22:37:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My Republican colleagues and I offered a number of amendments last night to significantly improve the rushed budget reconciliation scheme. \n\nEvery single amendment was rejected. Democrats continue to put politics ahead of policy at the expense of small businesses.","date":"Thu Feb 11 16:15:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We need to learn more about the impact of this proposal which more than doubles the federal minimum wage, particularly following @USCBO's report indicating that 1.4 million jobs are at risk. 2/2\nhttps://t.co/GZicLNQ266","date":"Thu Feb 11 03:37:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@HSBCgop marked up the Democrats' budget reconciliation scheme tonight. I offered a common-sense amendment directing @SBAgov to submit a report to Congress detailing the impact a fed min wage hike would have on small businesses. Dems blocked this proposal by a voice vote. 1/2","date":"Thu Feb 11 03:37:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday @EdLaborGOP marked up the Democrats' budget reconciliation &amp; passed a provision to raise federal minimum wage to $15.\n\nThis flies in the face of a recent @NFIB survey which found 74% of #WI small businesses would be hurt by such a provision.\n\nThis is not a solution.","date":"Wed Feb 10 18:56:55 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"So far, President Biden has been killing jobs, not creating them. He took unilateral action on #Keystone with only a vague promise of more jobs to come. \n \nWorkers can't wait for a plan to be put forward in the \"coming weeks.\" Workers need jobs now. \nhttps://t.co/eFx93Z2EFB","date":"Tue Feb 09 17:11:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"President Biden's call for unity has been drowned out less than 3 weeks into office by circumventing Congress &amp; signing a record-breaking number of executive orders.\n \nIn #WI, jobs have already been lost by Biden’s decision to cancel the #KeystonePipeline.\n \nThis is not unity. https://t.co/K4ODLXullT","date":"Mon Feb 08 23:00:15 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m saddened by the passing of my colleague Ron Wright. Ron was known as a true statesman and will be remembered for his dedicated service in Congress. I am keeping his family in my thoughts and prayers during this difficult time.","date":"Mon Feb 08 17:51:17 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Had the pleasure of meeting Colonel Rick Zampelli yesterday who presented me with my official Army Seal. #Hooah https://t.co/6iQC5JUHhf","date":"Sat Feb 06 13:17:55 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Over $1 trillion of allocated #COVID19 relief remains unspent.\n \nToday, House Dems passed a $1.9 trillion budget framework to spend more taxpayer dollars. Let’s spend the money we’ve allocated for critical needs before adding to the tab. This is irresponsible.","date":"Sat Feb 06 02:02:49 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is the right move by @SenTedCruz. Gov. Raimondo must commit to keeping #Huawei on the #EntityList before continuing the nomination process. This isn’t a big ask. Huawei is nothing more than an extension of the #CCP &amp; a grave risk to national security.\nhttps://t.co/geslAaeJqX","date":"Fri Feb 05 21:35:35 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, the @HSBCgop is gaveling in for our first hearing. As we look towards recovery, we must focus on Republican-led pro-growth policies that will elevate #WI05 small businesses.\n\nTune into the hearing ⬇️\nhttps://t.co/rcWN0ds1WZ","date":"Thu Feb 04 15:33:04 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to be an original cosponsor of @RepArmstrongND’s bill to authorize the #KeystonePipeline. This bill will restore #Wisconsin jobs jeopardized by the administration and help keep energy prices low. \n \nLet's get back to work.","date":"Wed Feb 03 19:00:07 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Tonight, Officer Brian Sicknick will lie in honor in the U.S. Capitol Rotunda. Officer Sicknick made the ultimate sacrifice protecting our Capitol &amp; his legacy will never be forgotten. May he rest in peace. https://t.co/srLLWK8Hvf","date":"Wed Feb 03 00:30:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It is beyond unacceptable the Biden administration is standing with teachers unions over students. Keeping schools closed is harming the development of the next generation of leaders. \n\nSchools must #ReopenSafely now.","date":"Tue Feb 02 22:55:51 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined my colleagues today urging Gov. Raimondo's confirmation to be put on hold. Gov. Raimondo must commit to keeping #Huawei on the Entity List to ensure critical national security interests at not put at risk.","date":"Tue Feb 02 21:36:45 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Calling all #WI05 constituents 📢\n\nI just sent out my first eNewsletter! Check out the link below to read about my first month in Congress and be sure to subscribe to the newsletter on my website.\nhttps://t.co/hZZTPRzzXd","date":"Fri Jan 29 22:29:36 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It is our moral obligation to fight for the voiceless. I am proud to join @SteveScalise &amp; @RepAnnWagner as an original cosponsor on the Born Alive Act, and I will always be proud to fight to protect the sanctity of life for the unborn. #ProLife","date":"Fri Jan 29 20:22:13 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I know firsthand the determination, spirit, &amp; time that goes into running a business. I'm excited to join @HSBCgop &amp; I'm hopeful my colleagues &amp; I will pass meaningful legislation to restore life to our economy &amp; small biz owners. Read my full stmt ⬇️\nhttps://t.co/AabRC4C9yq","date":"Fri Jan 29 19:35:11 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The first school choice program was born in the Badger State &amp; to this day families enjoy #EducationalFreedom in #WI so students can learn in an environment that fits their needs.\n\n#SchoolChoiceWeek is a reminder that all educational options should be available to all students.","date":"Wed Jan 27 22:08:47 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm excited to announce I'll be joining Ranking Member @Jim_Jordan on @JudiciaryGOP. \n\nThis committee plays an expansive role in upholding the Constitution—a duty I prioritize above all else here in Congress. I’m honored to represent #WI05 in my new role.\nhttps://t.co/bym4gi5OVz","date":"Wed Jan 27 19:55:07 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, we pause to honor all the victims and survivors of the Holocaust.\n\nWe honor the lives lost during this dark moment in history by vowing to #NeverForget &amp; fighting anti-Semitism in all forms. #HolocaustRemembranceDay https://t.co/4Bqjkwhq1D","date":"Wed Jan 27 19:08:28 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m proud to join the @RepublicanStudy in this letter, reaffirming my commitment to the Hyde Amendment &amp; protecting unborn lives. The Hyde Amendment alone has saved the lives of over 2 million innocent babies, &amp; I will continue to unite with my colleagues to #SaveHyde. https://t.co/t6UM0ZuPZN","date":"Tue Jan 26 20:26:45 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Looking forward to championing #WI05 workers and students on @edlaborgop. \n\nReady to get to work! \nhttps://t.co/IE8KpS6FDf","date":"Tue Jan 26 04:08:23 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#GoPackGo","date":"Sun Jan 24 18:34:26 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Read more about the visit &amp; the unilateral Biden administration decision to cancel the #KeystoneXL pipeline. ⬇️\nhttps://t.co/lOPsC3EmhK","date":"Fri Jan 22 20:59:01 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I joined @RepGrothman &amp; @RepBryanSteil at @michelscorp to speak &amp; hear from workers about the impact President Biden's decision to eliminate the #KeystoneXL project will have on #WI workers.\n\nThe message is clear: Biden is bad for #WI jobs &amp; gas prices are already going up. https://t.co/V6q2JpUNw0","date":"Fri Jan 22 20:59:00 +0000 2021","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Saddened to hear of the passing of Captain Durwood Jones. My thoughts and prayers go out to his loved ones and those that had the honor of serving alongside him in the @115thfw","date":"Sun Dec 13 16:35:02 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is fantastic news - an iconic company generating economic expansion and job creation in Milwaukee &amp; SE Wisconsin","date":"Wed Dec 09 23:20:28 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Just to reassure everyone, I have never displayed symptoms of COVID-19, have never tested positive, and was not in quarantine in recent weeks. I feel great and continue to work hard for my constituents every day!","date":"Tue Oct 27 13:19:06 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"@GovEvers continues to politicize the public health crisis to the detriment of our state. Read my statement here: https://t.co/IZqIVvat4v","date":"Fri Oct 16 20:29:55 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Let me get this straight - @MayorOfMKE and @GovEvers are at odds over the latest order? Clearly compliance and enforcement are going to be inconsistent across parts of the state. I look forward to JCRAR convening on Monday to sort this out.","date":"Fri Oct 09 16:55:22 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Earlier this spring, the governor flip-flopped on whether to issue a stay-at-home order. He flip-flopped on whether to move the April 7th Election. I’m fearful that he will cave to pressures from liberal groups and backtrack once again.","date":"Wed Aug 05 15:26:17 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I don’t think we should move election dates – but I get the President’s larger point on election security issues. The liberal media is full of hypocrites.","date":"Thu Jul 30 16:57:38 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m assuming that liberals and @GovEvers would have no problems moving an election after they tried (and failed) to move one in April.","date":"Thu Jul 30 16:57:38 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Watch the media’s reaction to @realDonaldTrump's tweet this morning vs. their reaction to @GovEvers' attempts to UNILATERALLY move an election in April. If you don’t think media bias is real…","date":"Thu Jul 30 16:57:37 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We know violent crimes in many major cities are becoming a problem. Earlier this month, it was reported that Milwaukee’s homicide rate was the highest it’s been since the early 90s. This is a good move by the Feds to help crack down on the lawlessness. \nhttps://t.co/mQxbRe7Fqo","date":"Wed Jul 29 17:13:02 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A rogue attorney general can no longer unilaterally settle away laws already on the books and unelected bureaucrats can’t expand their powers beyond what the people have given them through their representatives.","date":"Thu Jul 09 14:38:27 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The fact that no evidence of authorization to record the call exists raises more questions. Is the governor’s office harboring someone who committed a felony? It’s clear that the governor thinks he can hide from this and that it will just go away – that’s totally unacceptable.","date":"Tue Jun 30 17:26:26 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Why didn’t Dems in MKE and Green Bay take more help from the Guard? The Dem MKE Clerk telling a national audience that he could only open five polling places was a joke. Rest of state (including City of Madison) pulled it off.","date":"Mon Jun 29 12:49:43 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"60 Minutes segment last night was revisionist history re: April 7th election in WI. The idea that Gov Evers’ offer for an all mail election was possible is ridiculous. It was a disingenuous c.y.a. put forward at the last minute.","date":"Mon Jun 29 12:49:43 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great to have @realDonaldTrump in WI today! Big new contract from his administration gives our state a key role in rebuilding the nation’s Navy.","date":"Thu Jun 25 14:52:14 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Mayor of Madison and the Dane County Sheriff need to stop hiding and use local police forces to better protect the seat of government. Liberal leaders in Madison have the ability to put a stop to this. They must end this senseless destruction","date":"Wed Jun 24 15:10:45 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This governor has all of those tools available to him as well, and he hasn’t figured out how to stop these violent riots.","date":"Wed Jun 24 15:10:45 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Enough is enough. Gov. Evers has all of the tools at his disposal to stop this. He commands the State Patrol. He commands the Capitol Police. He commands the National Guard. The governor must step up and immediately put an end to this violence. He cannot allow this to continue.","date":"Wed Jun 24 15:10:44 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"When I presided over the Senate during Act 10, we saw crowds of tens-of-thousands of protestors. @ScottWalker  utilized State Patrol, game wardens, and other local law enforcement officers to maintain peace. He never even had to mobilize the Wisconsin National Guard.","date":"Wed Jun 24 15:10:44 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Father’s Day! https://t.co/1S2MQaNNFH","date":"Sun Jun 21 18:33:28 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If the governor didn’t know that his staff was recording him, this is a bigger problem than he thinks. The governor should be in control of his office – the buck stops with him.\nhttps://t.co/Jm167PP6UH","date":"Mon Jun 15 20:14:10 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is simply unacceptable. See the link below for a letter @SpeakerVos and I sent to the governor.","date":"Thu May 28 16:52:29 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m continuing to seek input from groups like Wisconsin’s professional sports teams on how the state can be helpful in their return to play.\nhttps://t.co/mLByGxktFm","date":"Thu May 28 00:15:54 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@SpeakerVos and I had a good call with the governor this AM. Glad that we can finally engage in a back-and-forth discussion regarding the rules process, and look forward to continuing the dialogue.","date":"Thu May 14 17:37:16 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"DWD’s delays are simply unacceptable. The Legislature gave them flexibility to address this issue. The federal government gave WI over a billion dollars in COVID aid. It’s time they got their act together or made changes.\nhttps://t.co/xi0EGvorQa","date":"Tue May 12 16:14:09 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Hopefully this is just the beginning. More small businesses are still struggling. Over half a million Wisconsinites are out of a job. We can balance public health with economic health. Let’s get Wisconsin open for business again.","date":"Mon May 11 19:35:26 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a good call today with the @WIHospitalAssn and hospital leadership from throughout the 13th Senate District. I appreciate their update on COVID-19. https://t.co/Owrpqu2fhn","date":"Wed May 06 23:03:17 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great to see @SenatorTestin on Fox and Friends First this morning defending Wisconsin small businesses!","date":"Tue May 05 16:32:30 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"\"I think there should be a back-and-forth with the administration to make sure we can come up with a plan that makes sense, instead of just continually extending the shutdown.\"\nhttps://t.co/RqphaJknEh","date":"Mon Apr 27 15:45:53 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"See my statement with @SpeakerVos on today's legal action here ⬇️⬇️⬇️","date":"Tue Apr 21 19:28:29 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The economic impact of this announcement is a huge win for our state. The next generation of fighter jets that will project America’s military strength will be based here in Wisconsin.\nhttps://t.co/ZLYml25gke","date":"Thu Apr 16 16:36:39 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This bill puts working men, women, and families of our state first, by extending a lifeline to the recently unemployed. It also provides the Joint Finance Committee flexibility to timely respond to this pandemic and the problems it has created.","date":"Wed Apr 15 17:26:37 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It combined aspects from the governor’s proposal with input from both parties of the Legislature. This legislation is important to the history of our state as we came together to respond to the crisis created by COVID-19.","date":"Wed Apr 15 17:26:37 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Wisconsin State Senate passed COVID-19 legislation today that allows Wisconsin to benefit from new federal funds. We put this bill together as a reaction to the legislation recently passed by Congress. https://t.co/KQy6P2dxsX","date":"Wed Apr 15 17:26:37 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We have to get businesses and the economy moving again, and I’m hopeful that this bill marks the first step in that direction. Those revenue streams support our schools, our social safety net, and our infrastructure.","date":"Wed Apr 15 17:26:37 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wishing you and your family a happy #EasterSunday https://t.co/SoxI076QXM","date":"Sun Apr 12 17:03:33 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, a unanimous Wisconsin Supreme Court decision soundly rejected the far-left politics of clerks in our state who were trying to undermine an election. I am glad to see the Court upholding the rule of law","date":"Tue Mar 31 21:35:00 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Read my full statement with @SpeakerVos on Dane and Milwaukee County Clerks' clear violation of the law here: https://t.co/DMdj9O8n7i","date":"Fri Mar 27 15:55:48 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"What businesses are “essential?” Gas stations? Garbage pick up? Drug stores? Construction? Giving this order without guidance has created chaos – business owners are already facing tremendous amounts of uncertainty. This doesn’t help.","date":"Mon Mar 23 19:57:36 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Here’s my statement with @SpeakerVos on today’s announcement from the governor: https://t.co/vcllleqkp7","date":"Mon Mar 23 19:57:35 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is great news for Wisconsin’s small businesses that need some help dealing with the fallout from the COVID-19 health emergency. If you’re a small business owner looking for some assistance, visit the link below for more info:","date":"Wed Mar 18 16:14:36 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It’s important to stay up to date with news from local and state health officials. Visit this website from the State of Wisconsin for the most up-to-date info from all our state agencies: \nhttps://t.co/xpVMW6ueUk","date":"Tue Mar 17 18:06:41 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"After 9 years, the results show Act 10 is working – according to @MacIverWisc we’ve saved taxpayers over $12 billion. \n\nMore here: https://t.co/kJCMeATfcj","date":"Wed Mar 11 17:34:10 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m proud of Right to Work and my conservative colleagues in the Senate who helped get this to @ScottWalker's desk","date":"Tue Mar 10 14:31:48 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"\"What did it mean for you? The bill would have reduced income taxes for about 64% of filers, or 2 million people, by increasing the standard deduction.” https://t.co/Hw8BADWhqi","date":"Wed Mar 04 16:47:16 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last week, I joined @WILawLiberty to talk about the harmful Green New Deal. Socialists in Washington are pushing an out-of-touch plan that is dangerous for Wisconsin farmers and manufacturers. Read more here: https://t.co/vEJJRxHKNL","date":"Tue Mar 03 16:22:58 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Honored to kick off @WisconsinMC’s Business Day breakfast in Madison this morning! I’m proud of the work the Legislature has done to keep Wisconsin open for business. https://t.co/MM8dp0V1ST","date":"Wed Feb 26 15:12:05 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today the Senate passed a tax cut package that:\n\n✅ Cuts income taxes by $250 million\n✅ Pays down state debt \n✅ Reduces the personal property tax\n\nWe’re giving money back to hard-working Wisconsin taxpayers \nhttps://t.co/lLTAR1MB9o","date":"Thu Feb 20 15:05:36 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was honored to meet with @AvivEzra, the Israeli Consul General to the Midwest today. Wisconsin supports our friends in Israel! https://t.co/Paq8JfSnTr","date":"Tue Feb 18 18:38:29 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The size of our budget surplus was much higher than I ever anticipated. I fully support the direction we’re headed with this plan. Wisconsin Republicans are once again putting taxpayers first. https://t.co/EaKaV9Mpkb","date":"Fri Feb 14 20:41:45 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In 2018, Milwaukee County reported over 5,000 instances of motor vehicle theft.\n\nIt’s time to stand with Police and give law enforcement the tools they need to crack down on this serious problem.","date":"Tue Feb 11 16:35:33 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last week, I was able to visit Quad Graphics for a tour of their plant in Sussex. It was great to hear about their company and how state policies impact the decisions they make as a business. Thanks for having me! https://t.co/xEE8QV1QKS","date":"Mon Feb 10 18:44:34 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It’s clear that the governor is just trying to come up with an excuse to veto any tax cut the Republican Legislature sends him.","date":"Thu Feb 06 19:57:44 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The governor signed our last budget that spent more money on schools than ever before, increased funding for special education, doubled funding for two school-based mental health programs, and boosted funding for rural schools.","date":"Thu Feb 06 17:10:47 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Every time the state has surplus revenue, Republicans look for ways to return that money to taxpayers. Democrats keep looking for ways to spend your money.","date":"Thu Feb 06 17:10:47 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Senate Republicans have been focused since late last year on using our surplus for a tax cut for hard-working families, and the governor knows that. I don’t see us budging off that position. It appears that the teachers' unions are the ones calling all the shots in the East Wing.","date":"Thu Feb 06 17:10:47 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Trade agreements like #USMCA and the China Phase One deal will have a lasting impact on Wisconsin. Farmers and manufacturers in the Badger State will win big, thanks to @realDonaldTrump!\n\nhttps://t.co/bvtKk9xZQA","date":"Wed Jan 29 21:23:02 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Incredibly proud to stand with @VP today in support of school choice at the Wisconsin State Capitol! https://t.co/3zfBzlwaBF","date":"Tue Jan 28 19:35:56 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"During the last decade, Republicans turned budget deficits into a budget surplus. Our rainy day fund will sit at over $1 billion. With another surplus this year, we should return some of that money to the working people in our state.","date":"Thu Jan 23 20:31:54 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Honored to host two Olympic gold medalists from Wisconsin in my office today – Bonnie Blair and Casey FitzRandolph. https://t.co/W6atCkAkPg","date":"Wed Jan 22 22:30:42 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m proud to stand with my colleagues from the Assembly and the Senate today as we introduced Tougher on Crime legislation. Let’s give law enforcement the tools they need to keep our communities safe. https://t.co/v8009dhFDu","date":"Mon Jan 13 22:44:25 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I thought I had a good meeting with the governor last week where we discussed priorities. But giving a coequal branch of government “homework” in a condescending letter won’t help him grow support for an agenda with Senate Republicans. The tone of this letter is ridiculous.","date":"Thu Jan 09 17:59:44 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"American military power in action. It’s exciting that Wisconsin has the opportunity to have F-35s based in our state in the future. \nhttps://t.co/BIv18KxHPo","date":"Wed Jan 08 21:25:17 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"More good jobs for Wisconsin. I’m proud of the work we’ve done to promote pro-business reforms in our state. \nhttps://t.co/e3ZKogetjd","date":"Tue Jan 07 19:08:00 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We’ve cut taxes by billions of dollars in Wisconsin during the last decade. With some Wisconsinites seeing hikes on their property tax bill this year, the state should use surplus revenue to help lower the property tax burden. \nhttps://t.co/eYiXVrZv14","date":"Mon Jan 06 22:02:56 +0000 2020","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In the State Senate, I’ve worked to pass a money laundering statute that would give the police more tools to crack down on this pressing issue. We’ll continue to work with law enforcement on ways the Legislature can help keep our community safe.","date":"Thu Dec 12 19:58:05 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Law enforcement should be applauded for their efforts to keep our community free of human trafficking. https://t.co/aqI8dA93eq","date":"Thu Dec 12 19:57:37 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is good news for Wisconsin. Thanks, @realDonaldTrump!\nhttps://t.co/5juao35LXu","date":"Wed Dec 11 21:13:04 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Merry CHRISTMAS🎄 https://t.co/5Nle2rAOQb","date":"Fri Dec 06 17:49:04 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, @SenatorRoth, @RepTonyKurtz, @RepPlumer, and I met with the Assistant Secretary of the Air Force, John Henderson. We’re proud to support the F-35 mission and are hopeful that USAF decides to base the new jets here in Wisconsin! https://t.co/TviOrfcDdO","date":"Fri Nov 22 20:19:52 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m looking forward to spending time in the woods with my family again this weekend – good luck to all other Wisconsin hunters. https://t.co/t6GBC2UUCh","date":"Thu Nov 21 21:40:05 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I had a great time speaking with veterans at the Watertown Elks Lodge yesterday. Thank you for your service! https://t.co/Wa2LBaY2ON","date":"Wed Nov 13 14:44:02 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great to see @ScottWalker on @foxandfriends this morning supporting Wisconsin’s Capitol Christmas Tree \nhttps://t.co/68TPEtQHPX","date":"Tue Nov 12 20:45:51 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"As a veteran, I was honored to work with some of the finest men and women serving the nation. Thank you to all who have served and sacrificed for our country. #VeteransDay https://t.co/xBRre1CVtC","date":"Mon Nov 11 19:59:20 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is “PC” garbage. It’s a Christmas Tree 🎄\nhttps://t.co/UnqMlW3Mcb","date":"Fri Nov 08 19:40:02 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was glad to attend Lakeside Lutheran’s program recognizing veterans today. Serving my country for 27 years in the US Army Reserve was the greatest honor of my life. Thank you for having me! https://t.co/TdQtzhctbn","date":"Wed Nov 06 17:54:54 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy to report that my bill to create a penalty for money laundering in Wisconsin passed the Senate unanimously!","date":"Wed Nov 06 00:20:34 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, @SpeakerVos and I sent a letter to U.S. Air Force Secretary Barrett expressing the Legislature’s support for basing F-35s in Wisconsin. These fighter jets are crucial to Wisconsin’s economy and our nation’s security. \n\nRead the full letter here: https://t.co/WQmjXTYK5o https://t.co/acsnlF7Ori","date":"Tue Oct 29 16:21:06 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"On Saturday, the Department of Justice and local law enforcement will be holding a drug take-back day throughout Wisconsin. Find a location in your community here: https://t.co/uobOiuBSK7 https://t.co/kugJn4HSD8","date":"Wed Oct 23 22:06:14 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsin doesn’t have a statute to deal with money laundering. Federal guidelines make it nearly impossible to prosecute anyone laundering less than $200,000. A new state statute could help law enforcement fight human trafficking and fraud schemes that target the elderly.","date":"Wed Oct 23 14:38:47 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday, I had the opportunity to testify in front of the Senate Committee on Judiciary and Public Safety in support of my bill to create a new money laundering statute in Wisconsin. Watch here: https://t.co/jrgHloAEE9 https://t.co/jMLtMgVSqO","date":"Wed Oct 23 14:38:46 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is a good start -- thanks, @realDonaldTrump. Gov. Evers shouldn't drag his feet and should implement the plan as soon as possible. https://t.co/DYuW11d5oo","date":"Mon Oct 21 21:45:00 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"After the governor opened the door to a long-term plan of gun confiscation at his press conference last month, it’s easy to see how today’s action could just be the first attack on the Second Amendment. \n\nhttps://t.co/p7umkH7ytF","date":"Mon Oct 21 16:22:46 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I enjoyed speaking with all the students from Lake Mills Elementary who stopped by the Capitol today. Thanks for visiting! https://t.co/Evzw4b3VYK","date":"Fri Oct 18 20:29:11 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Truax Field is important to WI’s economy – the F-35 mission would ensure the long-term viability of the base. I’m proud to have authored this resolution. \nhttps://t.co/ezqVXPPH48","date":"Mon Oct 14 19:21:27 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today, the Assembly passed a resolution I co-authored with @RepTonyKurtz in support of bringing the F-35 mission to Wisconsin. The mission is good for WI’s economy and gives our state an important role in defending the nation! https://t.co/gq1ElE8Nlk","date":"Thu Oct 10 21:20:14 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Sat down with Archbishop Listecki and Bishop Hying today at the Capitol. Great discussion – welcome back to WI Bishop Hying! https://t.co/XHWnvsYBzJ","date":"Wed Oct 09 19:13:22 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m proud to author a resolution in support of bringing the F-35 Fighter Jet to WI. Basing the F-35 in WI gives us a role in housing the next generation of fighter jets that put the American military at an advantage over our adversaries around the world. https://t.co/BDvNl2qi4G https://t.co/XddmJgsY4T","date":"Tue Oct 08 16:25:45 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"See the memo here: \n\nhttps://t.co/a7UdWFYKzR","date":"Thu Sep 26 16:45:04 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"New analysis shows that Republican reforms have led to over $13 billion in tax cuts since 2011. At the same time, we’ve balanced our budgets, put over $600 million in the rainy day fund, and invested more money in roads and schools. We’re standing up for taxpayers! https://t.co/YfR3sKqSlj","date":"Thu Sep 26 16:44:42 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Honored to welcome @BetsyDeVosED to Wisconsin as she kicks off her #EducationFreedom tour. Our reforms in Wisconsin have made the state a national leader in the school choice movement – I’m proud of our work! https://t.co/7LsrqN27SV","date":"Mon Sep 16 15:48:22 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"https://t.co/i2ar5HSMl8","date":"Wed Sep 11 16:36:05 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The USMCA is huge for our state. @realDonaldTrump is standing up for Wisconsin workers! Congress needs to do its part. #USMCANow https://t.co/XDvRERiYcN","date":"Tue Sep 10 21:38:02 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great news for WI and the 13th Senate District — more good-paying, family supporting jobs! \nhttps://t.co/EXhMh7WVTq","date":"Wed Aug 21 18:00:00 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It was another great year at the Dodge County Fair. Brought home the 1st Place Trophy in the cream puff eating contest! https://t.co/3UIoteml0T","date":"Tue Aug 20 13:58:17 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great to meet Chairman Young Liu today. I appreciate the update on the project and look forward to working with #Foxconn well into the future.","date":"Wed Aug 14 21:00:34 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"How the Governor equates a procedural decision by a legislative committee with 'settling political scores' is perplexing (3/4)","date":"Wed Jul 24 19:15:56 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Once again, I would like to know if Gov. Evers supports the statements coming from his office, or if he would like to strike a different tone on an issue that has historically united members of both parties (4/4)","date":"Wed Jul 24 19:15:56 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Members of both parties have - and continue to - support legislation that funds treatment programs and expands access to care. Next week a bipartisan task force on suicide prevention will be meeting to discuss these very topics (2/4)","date":"Wed Jul 24 19:15:56 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The inflammatory rhetoric coming from the Governor's office regarding funding of mental health services for farmers is overly-political and frankly unproductive (1/4)","date":"Wed Jul 24 19:15:55 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The governor is taking money from local road construction to fund Milwaukee’s trolley to nowhere. Rural Dems should push back – veto override!","date":"Thu Jul 18 16:25:35 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I've never seen so many \"No\" votes lined up at a podium for a bill signing before.","date":"Wed Jul 03 16:21:32 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Here’s a letter that leaders in Madison received from one school board happy with the education investments passed last week: https://t.co/B50Pe5gCDx","date":"Tue Jul 02 14:45:44 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is a good plan for K-12. The governor should sign the Wisconsin budget right away so that schools around Wisconsin can start planning for the upcoming school year.","date":"Tue Jul 02 14:45:44 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I would hope that their lobbyist Mr. Rossmiller is acting on his own and is not representing the school boards of our state.","date":"Tue Jul 02 14:45:44 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It’s amazing to me that a coalition group like the Wisconsin Association of School Boards – that wants to be perceived as non-partisan in the Capitol – is encouraging the governor to skirt legislative intent with a veto.","date":"Tue Jul 02 14:45:43 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to LeadingAge and Wisconsin nursing homes who are calling on the governor to sign the budget passed by the Legislature. I echo their sense of urgency – our budget supports seniors. https://t.co/lkE2de9apB","date":"Mon Jul 01 20:55:57 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We’re cutting taxes, spending billions of dollars less than Evers, and still making crucial investments in our state’s priorities. This is a good budget for Wisconsin. https://t.co/Zo1OdA0Z7m","date":"Wed Jun 26 15:22:04 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Our Republican budget for Wisconsin cuts $2 billion in spending from Evers’ plan, provides over $500 million in tax relief, and STILL invests in our state’s priorities like education, health care, and roads. https://t.co/BuxNczCQ5B","date":"Fri Jun 21 20:15:00 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to support these common sense pro-life reforms that are heading to the governor’s desk! Thanks @repvos and @SenatorRoth  for your work. https://t.co/9UPETF3KQc","date":"Thu Jun 20 17:39:09 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Our Republican budget serves as a conservative check on the budget Governor Evers introduced earlier this year. We're borrowing less, taxing less, and nearly doubling the size of our rainy day fund. This budget is a strong counterpunch to the governor's liberal wish list. https://t.co/DlsIKoLCvh","date":"Thu Jun 20 14:57:17 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In the coming days, we’ll introduce reforms to make sure that hard-working Wisconsin taxpayers are protected from wasteful spending in the future. We need to control costs and hold the Department of Transportation accountable.","date":"Thu Jun 06 23:10:48 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"With our state continuing to make significant investments in infrastructure, it’s the duty of the Legislature to make sure that taxpayer dollars are being spent responsibly.","date":"Thu Jun 06 23:10:48 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Remembering those who fought for freedom and sacrificed all 75 years ago today. #DDay75 https://t.co/hl2iE6FTHe","date":"Thu Jun 06 19:29:49 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy to report that the Senate has passed four new common-sense, pro-life measures – including a bill that bans discriminatory abortions and the Born Alive Protections bill. https://t.co/7B30c4pfkr","date":"Wed Jun 05 20:46:29 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"https://t.co/SuI502YSFF","date":"Mon May 27 18:48:00 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m looking forward to standing up for life once again by sending the pro-life bills recently passed by the Assembly to the governor’s desk after the Senate passes them in June.","date":"Fri May 24 01:50:54 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Roe v. Wade is a Supreme Court decision, not something that the Legislature has a say in. Overturning Roe would be a monumental moment for the pro-life movement that I’m proud to be a part of — I want to see that happen.","date":"Fri May 24 01:50:53 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"During my time in the Legislature I’ve been a defender of the unborn, authoring bills like the partial-birth abortion ban and supporting countless other pro-life measures currently on the books.","date":"Fri May 24 01:50:53 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This week we remember those who paid the ultimate sacrifice to keep our communities safe. #BackTheBadge #NationalPoliceWeek2019 https://t.co/cOGgzJkprq","date":"Tue May 14 18:36:45 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I’m glad to see that the Supreme Court has ended this unnecessary constitutional crisis and enforced the return of these individuals to their rightful positions. \nhttps://t.co/bpHORyoWoT https://t.co/wpe1d1ProK","date":"Wed May 01 17:29:44 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Crowded listening session in Lowell today with @JohnJagler and @repborn. Thanks to all who stopped by. https://t.co/RXFdBqkTWP","date":"Fri Apr 26 18:40:34 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This morning, @JohnJagler and I awarded a citation to Tom Schultz at the Watertown Daily Times – he’s retiring as editor after over 40 years at the paper. Thanks for your service to our community, Tom! https://t.co/mh6YgVHR1D","date":"Wed Apr 17 16:23:27 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Senate Republicans will caucus in the coming weeks to discuss these reforms.","date":"Tue Apr 16 19:53:55 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It’s important that we build on Attorney General Schimel’s efforts to end the decades-old sexual assault kit backlog in Wisconsin and make sure that doesn’t happen again. The legislation proposed today by Attorney General Kaul and Senator Cowles is a good start.","date":"Tue Apr 16 19:53:55 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Students from Oconomowoc are in the Capitol today as part of Project Lead the Way. It was great to see the work they’ve done on their project to make football helmets safer. https://t.co/dnZTnIAe9v","date":"Tue Apr 16 17:37:36 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#TaxDay reminder – Governor Evers’ budget includes over $1 billion in tax hikes. After cutting taxes by over $8 billion the last eight years, Republicans in the Senate will fight to keep your taxes LOW. https://t.co/ncuboBOM2i","date":"Mon Apr 15 15:34:58 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Although we believe this move was unnecessary, we appreciate the gesture by the Board of Regents to clearly demonstrate that these two individuals are properly seated and will continue to serve.","date":"Mon Apr 01 21:23:21 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The governor’s refusal to allow these appointees to return to their work violates the court’s order. His actions are totally unacceptable. These public servants don’t deserve this. \nhttps://t.co/ZeHk8knNTq","date":"Mon Apr 01 18:29:24 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"These appointees were nominated and confirmed legally and will continue to serve in those positions once the constitutionality of the extraordinary session is upheld.","date":"Mon Mar 25 19:04:01 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If the governor plans to re-appoint these positions, then why the rush to vacate all of the appointments late on a Friday night? His actions created instability and chaos across committees handling all sorts of issues important to Wisconsin.","date":"Mon Mar 25 19:04:00 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We all know that the decisions on these capital budget projects will be made in the Joint Committee on Finance and by the Legislature. We aren’t sure why the governor isn’t accepting our compromise to move his proposal forward to the committee.","date":"Wed Mar 20 23:06:33 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The governor is needlessly complicating a simple process and it didn’t have to be this way. I’ve said before that there are concerns in our caucus about the level of spending and bonding in his plan.","date":"Wed Mar 20 23:06:33 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great to see more progress from #Foxconn. This is good news for hard-working families across Wisconsin.","date":"Mon Mar 18 17:31:13 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Is this a joke? The governor’s budget contains over $1 billion in tax hikes after he told Wisconsin voters he planned to not raise taxes at all. \nhttps://t.co/b8dmajtsKj","date":"Thu Mar 14 15:40:09 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Democrats across the country are rolling back pro-life laws and pushing the legalization of late-term abortions. Wisconsin Republicans will fight against any efforts to try that here. \nhttps://t.co/tyYFXdEtJn","date":"Wed Mar 13 21:19:29 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Taxpayers are the big losers with this plan. It’s time for the governor to come to the table to negotiate a budget that Republicans in the Senate might actually support.","date":"Fri Mar 01 20:48:22 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is easily the most liberal budget the state has ever seen – it gets rid of Right to Work, rolls back the clock on our prevailing wage reforms, and funnels government money to abortion clinics like Planned Parenthood. Those are all non-starters for Republicans.","date":"Fri Mar 01 20:48:22 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last night the governor rolled out his #LiberalWishList that would raise taxes by more than $1 billion over the course of two years. This plan grows government and hurts taxpayers. WI can’t afford this budget https://t.co/1sboGHW5XR","date":"Fri Mar 01 20:48:22 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Human traffickers and drug smugglers shouldn’t be allowed to move freely across our border. We need security. We need a wall. This is a national emergency. \nhttps://t.co/JSZNBxgLx2","date":"Wed Feb 27 18:20:38 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Drug smugglers and human traffickers cross our southern border every day -- Wisconsin should be doing our part to keep our country secure. @GovEvers is playing politics instead of working to keep Wisconsin safe. \nhttps://t.co/dQ0DcQjX8J","date":"Mon Feb 25 23:06:34 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Republicans in the Legislature have spent years helping build the voucher program. We will not support a budget that includes this proposal.","date":"Mon Feb 25 20:11:25 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsinites should have more choices when it comes to the education of their children, not fewer. Budget leaks of far-left proposals like these only make bipartisan compromise more difficult.\nhttps://t.co/3phh6Z4LSO","date":"Mon Feb 25 20:11:24 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Middle-class families shouldn’t have to wait until the end of the budget process to pick up whatever scraps are left. We have a surplus, let’s give them a tax cut today – sign this bill @GovEvers.","date":"Thu Feb 14 22:52:11 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Sadly, Democrats in the Legislature have decided that the only plan they can support is one that would increase the tax burden on Wisconsin businesses – hurting our state’s manufacturers and agricultural producers in the process.","date":"Thu Feb 14 01:26:43 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Middle-class Wisconsinites deserve a tax break, and today the Legislature voted to give them one. With our state budget running a surplus we can afford to return money to hard-working Wisconsin families.","date":"Thu Feb 14 01:26:43 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Let’s put people over politics and give families a tax break they deserve. I urge @GovEvers to sign this bill.","date":"Thu Feb 14 01:26:43 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Our reforms have left our state with a budget surplus – let’s give that money back to hard-working families. https://t.co/n0Y7LkZSuy","date":"Wed Feb 13 17:38:35 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"\"@ScottWalker's 'Open for Business' welcome signs will soon be detour markers\" https://t.co/oePyiLGYw8","date":"Tue Feb 12 21:19:47 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@GovEvers’ plan doesn’t cut taxes — it just shifts them. We can afford to cut taxes on families while keeping taxes low on our state’s job creators. With the Republican plan, everyone wins. #ItsYourMoney","date":"Thu Feb 07 20:23:20 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@GovEvers wants to hike taxes on WI businesses to pay for his plan. That’s not a tax cut, that’s a tax shift to create winners and losers.\n\nOur plan cuts taxes for families without raising them on anyone else — only creating winners.","date":"Tue Feb 05 22:17:18 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday, @SenatorRoth!","date":"Tue Feb 05 21:45:00 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great to meet students from Dodgeland School District at the Capitol today! https://t.co/DPTkvWBLV0","date":"Tue Feb 05 20:32:10 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":".@GovEvers is wrong to suggest that we can’t afford a middle-class tax cut. Revenue projections show that we can afford to cut taxes on an ongoing basis — we don’t need to raise taxes on farmers and manufacturers.","date":"Tue Feb 05 18:19:04 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We can give Wisconsin families real tax relief and keep our state open for business at the same time.","date":"Tue Feb 05 18:19:04 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"81,000 Wisconsin students benefit from #SchoolChoice! I support #SchoolChoice because families deserve to pick the best school for their child, regardless of income or zip code.","date":"Fri Jan 25 21:24:16 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I've asked @SenMarklein , @SenKooyenga, and @SenStroebel to work with the @WIAssemblyGOP on a plan to deliver tax relief for hard-working families. 2/4","date":"Thu Jan 17 18:31:57 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"During the last eight years of Republican leadership in Wisconsin, taxes have been cut by over $8 billion dollars. With another budget surplus this year, we can once again prioritize lowering taxes on families without raising taxes on small businesses and farmers. 3/4","date":"Thu Jan 17 18:31:57 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"@GovEvers past statements in support of tax relief give me hope that we can work together to continue to lower the tax burden. Together, we can keep making Wisconsin the best place in the country to work, live, and raise a family. 4/4","date":"Thu Jan 17 18:31:57 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Middle-class families in Wisconsin should keep more of what they earn. I’m glad to see that our colleagues in the Assembly are prioritizing plans to lower taxes. 1/4","date":"Thu Jan 17 18:31:57 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Listened to @GovEvers address our Republican joint caucus this AM. Glad to hear that he is committed to leaving @WEDCNews intact. I look forward to partnering with him on other areas of agreement that keep WI open for business.","date":"Tue Jan 15 18:40:04 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Instead of working with Republican lawmakers to find areas of agreement, Governor Evers has decided to spend his first week in office issuing edicts and looking for ways to skirt state law so that he can advance his partisan agenda.","date":"Wed Jan 09 20:31:26 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congratulations to all the senators sworn in today – especially new members @SenKooyenga, @kmbernier1, and Senator Jacque. 19 Republicans in the Senate! https://t.co/wfxBcaDqgF","date":"Mon Jan 07 22:22:09 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"With Republican leadership in the Legislature, our state’s tax burden is at a 50-year low – we will continue in our commitment to keeping taxes low for hard-working families and making sure that Wisconsin stays open for business.\nhttps://t.co/uA3nN8IzO5","date":"Wed Jan 02 22:52:08 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"While it’s encouraging that Governor-elect Evers has decided not to do away with the Wisconsin Economic Development Corporation, I’m deeply concerned over his plans to hike taxes on Wisconsin’s small business owners and farmers before he’s even sworn into office.","date":"Wed Jan 02 22:52:08 +0000 2019","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"About to join Matt Kittle on @newstalk1130. Listen here: https://t.co/jGGxgDi88D","date":"Fri Dec 21 20:01:05 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Hosted @Tony4WI this morning in my office to talk about legislative priorities for next session. Lots to do to keep our state moving forward.","date":"Thu Dec 20 14:33:32 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Our reforms are putting taxpayers in charge of government and moving our state forward – Wisconsin’s tax burden drops to nearly 50-year low: https://t.co/q2j4RVBoDm","date":"Wed Dec 19 20:07:52 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Caught this in the @BDCitizen this morning. @GovWalker and Republicans saved taxpayers from this mess!  https://t.co/N0h9kVNf4z","date":"Tue Dec 11 19:46:44 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Ran into that guy who's in all those TV ads while waiting for @POTUS https://t.co/E5qO3gFv7i","date":"Wed Oct 24 22:41:38 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to the senator that I share a district border with, Steve Nass! https://t.co/PqyQ8UZCb0","date":"Sun Oct 07 20:00:00 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks for having me on, Susan!","date":"Sun Oct 07 16:14:36 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Mr. Walker was a good man, I am sad to hear of his passing. Our thoughts are with the Walker family during this difficult time. May Llew rest in peace.","date":"Sun Oct 07 15:59:25 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Encouraging data from @WisconsinDPI showing that students enrolled in choice programs are outperforming their peers on ACT scores. The investment into our children's (and our state's) future is paying off https://t.co/8KHJH0R5EQ","date":"Tue Oct 02 20:37:00 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you Senator Nass for convening the Admin Rules Committee to tackle this issue. This burdensome regulation on hunters needed to be halted and reworked https://t.co/UBUw7Ae24v","date":"Tue Oct 02 16:59:14 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wishing @SenStroebel a happy birthday weekend! https://t.co/iAebkBz2hU","date":"Sat Sep 01 12:00:00 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Birthday to the senator from Oostburg @SenatorDevin! https://t.co/Blad37C517","date":"Wed Aug 08 11:00:00 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Back-to-school shoppers - the sales tax holiday starts tomorrow! For info on what items are exempt from sales tax, check out this helpful guide from @wi_revenue \nhttps://t.co/37bx6jaJA2","date":"Tue Jul 31 16:18:37 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to my friend and colleague @SenRobCowles https://t.co/sIyDJSZgEt","date":"Tue Jul 31 11:00:02 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It's county fair &amp; festival season in Wisconsin!!! Check out this helpful guide at @TravelWI to find events in your area https://t.co/6n6ESFekAO https://t.co/hCa2RLnxzz","date":"Tue Jul 24 20:50:25 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Senator Ellis was a mentor and a friend, and my thoughts are with the Ellis family today. https://t.co/sXluCzQQuV","date":"Fri Jul 20 18:30:18 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to the senator from Chippewa Falls @terrymoulton !!! https://t.co/IqJZcdPdGz","date":"Thu Jul 19 16:03:39 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I will continue to shine a light on this issue and work with law enforcement and local and state officials so that we may eliminate human trafficking in our rural areas and throughout the state.","date":"Thu Jul 12 16:07:35 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"State statutes may also have to be updated to ensure that there are no blind spots that allow this criminal behavior to continue unimpeded.","date":"Thu Jul 12 16:07:35 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thank you @tmj4 and @caseygeraldo for your coverage of this important topic. Human trafficking has been uncovered in every county in the state, and the news out of Dodge County recently is very upsetting. https://t.co/fQQUyLCIwg","date":"Thu Jul 12 16:07:34 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Local governments must be able to strike a balance between respecting the rights of businesses while reserving the right to revoke licenses of establishments that are complicit in criminal behavior.","date":"Thu Jul 12 16:07:34 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Make sure to wish @SenDanFeyen a Happy Birthday today! https://t.co/SAePxWlEZk","date":"Thu Jul 12 15:14:35 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"@wibpdd @repborn Great news, thanks for info!","date":"Wed Jun 27 16:54:56 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Birthday and Happy Father's Day to Senator Jerry Petrowski! \n\n(he's the one on the right) https://t.co/Dk9PY1k878","date":"Sat Jun 16 15:46:46 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"\"10 miles from anywhere\" - great write-up on the hidden gem that is @Horicon_Marsh \n\nhttps://t.co/6oOXCqvOQM","date":"Mon Jun 04 21:39:08 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Received a \"Friend of Housing\" award from @WiscBuilders. Thank you! https://t.co/HSG4gjM2Uw","date":"Thu May 31 18:21:51 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Exciting news for Beaver Dam and another local @WEDCNews success story https://t.co/Z4IR4jXghN","date":"Thu May 24 20:37:37 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congratulations to Juliet Nowak from @angelslci who won the Governor's Trailblazer Award for Woman in Business! Hope you enjoyed your time at the Capitol today, Juliet! https://t.co/XhsD2W7xr7","date":"Wed May 23 21:40:09 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"While @SenShilling &amp; WI Dems misguidedly root for failure, @WIGOPSenate will continue to fight for increased opportunity across all sectors of our economy.","date":"Wed May 23 18:31:56 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We are already seeing the initial benefits of the Foxconn deal. WI-based contractors from every region are being hired to build the state-of-the-art campus and facilities.","date":"Wed May 23 18:31:56 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It is also important to note that significant protections were built into the Foxconn bill. If the company does adjust its production plans in the future, taxpayers will not be on the hook.","date":"Wed May 23 18:31:56 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Before they even had their facts straight @SenShilling and WI Dems cheered at the prospect of fewer jobs in Wisconsin. What an unfortunate message to send to companies outside of the state looking to do business here.\n\nhttps://t.co/xWL0iSTXfM","date":"Wed May 23 18:31:55 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Huge crowd in Clyman last night to discuss this important issue. The legislature will continue to be vigilant in fighting the scourge of human trafficking https://t.co/yuslfdmuTF","date":"Fri May 18 16:11:06 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Ran into some students from Johnson Creek Elementary School today. Hope you had fun during your day at the Capitol! https://t.co/H95rHrnkOW","date":"Wed May 16 21:24:05 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"You can now apply for the $100-per-child tax rebate! To learn more go to https://t.co/lGbAezDMpS https://t.co/ECco9rAkRP","date":"Tue May 15 14:46:42 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Honored to speak to the Wisconsin Lao Veterans Association today. Thank you for your sacrifice and service to our country 🇺🇸 https://t.co/sEqGxnjZbu","date":"Mon May 14 16:49:45 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Stopped by Beaver Dam HS this week to talk Fab Labs with students and faculty @WEDCNews @repborn https://t.co/zQMcajb9Nm","date":"Fri May 04 16:44:40 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Some good news out of Superior as there were no fatalities in the refinery explosion. For those living in the area, follow @NWSduluth for evacuation updates https://t.co/LBtp6kixep","date":"Thu Apr 26 21:14:55 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Met with some folks from @childhealthwi to talk child abuse prevention. Thanks for stopping by! #pinwheelsforpreventionwi https://t.co/SPwpcFpC5r","date":"Thu Apr 26 17:30:16 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to the senator from the 5th, Leah Vukmir! https://t.co/iPUmiuTsuF","date":"Thu Apr 26 14:50:04 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsin is #1 in manufacturing job growth https://t.co/bZnC5xwhXD","date":"Wed Apr 25 18:54:12 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Make sure to wish Senator @VanWanggaard a happy birthday today! https://t.co/bZoAFNJRmE","date":"Wed Apr 25 18:37:01 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday @SenDaveCraig! https://t.co/SSN3q4e7fT","date":"Fri Mar 16 18:09:32 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday Senator Luther Olsen - have a great week! https://t.co/ssagTkF1b1","date":"Mon Feb 26 13:47:14 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Looking forward to joining @Emilee_WKOW on Capitol City Sunday to discuss legislative topics and what to expect in the senate in the weeks to come! Tune in 9am Sunday @WKOW","date":"Fri Feb 23 14:42:14 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The bill passes 23-9! Now it heads to the Assembly for concurrence #WIWorking","date":"Tue Feb 20 23:35:33 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The senate is now debating the @GovWalker Wisconsin Healthcare Stability Plan, which will stabilize markets and lower premiums for consumers #WIWorking","date":"Tue Feb 20 23:34:21 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to the senator from the 33rd @SenatorKapenga! https://t.co/qRWsx9zlzr","date":"Mon Feb 19 22:42:23 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Spoke to students at Waterloo Middle School this morning before heading to the Capitol. Thanks for having me. Go Pirates! @WaterlooWI_K12 https://t.co/JWuITwSXTv","date":"Thu Feb 15 23:06:05 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday, Roger! Hope its a good one @SenatorRoth https://t.co/NPxvVka4VE","date":"Mon Feb 05 16:23:30 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to Lillie Elling from Columbus High School for taking part in the Senate Scholar program last week. It was great to meet you, Lillie, best of luck with the rest of the semester! https://t.co/SPVhqnmyAv","date":"Fri Feb 02 20:48:22 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Just spoke to a few hundred med students in the Assembly chamber. The future of medicine and health care in Wisconsin is bright! https://t.co/8BQp0T5XXj","date":"Tue Jan 30 21:23:01 +0000 2018","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"FYI @GovWalker State of the State speech will be on January 24 2018 in the Assembly chamber #WIWorking","date":"Thu Dec 28 18:19:31 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Year-end interviews are #fakenews https://t.co/EKGlDTr9p2","date":"Wed Dec 20 19:23:58 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It has been years and we still have more questions than answers about what key staffers at the GAB were doing  on the taxpayers' dime. It's time we once and for all get to the bottom of this. https://t.co/ZsQQEHBz7m","date":"Tue Dec 19 22:39:49 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Last week I had the chance to meet with members from Wisconsin Lao Veterans of America and thank them for their service. To learn more about their organization, visit https://t.co/NVKulaUYCQ https://t.co/diHQcqIM6z","date":"Mon Dec 18 16:06:25 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to my colleague from the 1st Senate District, Frank Lasee!!!","date":"Mon Dec 11 15:42:27 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I look forward to hearing ideas and expertise from a diverse group of individuals from all areas of the state. This issue has come to a head due to declining enrollments and its time to consider reform. https://t.co/23EUK2QGEw","date":"Wed Dec 06 19:42:57 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Earlier today I appointed @SenStroebel to the Joint Committee on Finance. See the release here: https://t.co/zjn5KCiYGV","date":"Wed Dec 06 18:36:34 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Game time https://t.co/dFjYrYklQK","date":"Sun Dec 03 00:51:30 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The jobs and economic activity Foxconn creates will benefit the entire state. The Racine campus is just the beginning #WIWorking   https://t.co/TatpB6Dm9T","date":"Sat Dec 02 22:50:49 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I couldn't agree more @GovWalker! Great news heading into the long holiday weekend #WIWorking https://t.co/US3VTN4ph2","date":"Wed Nov 22 19:39:48 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"At the Wisconsin Center District board meeting in Milwaukee - a lot of exciting events on tap @MkeTheatre in 2018! #visitMKE https://t.co/DgU1GBkwRi","date":"Fri Nov 17 16:09:51 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"More great news - our economy continues to grow stronger under @WIGOPSenate reforms #WIWorking https://t.co/prLCdOyfsK","date":"Fri Nov 17 15:34:36 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Had to chance to chat with Perttu Honkanen, a Beaver Dam HS student who took part in the senate's Page for a Day program. Great to meet you, Perttu!!! https://t.co/mSFtzXbgqL","date":"Wed Nov 08 15:04:19 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Senate chamber is quiet now but will be full of activity in a few hours.  Follow the floor action live at https://t.co/b5TZ4xwFHp https://t.co/zBsaXhPPDd","date":"Tue Nov 07 15:31:47 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great news coming out of @WIAssemblyGOP!  @WIGOPSenate will take the mining bill up on Tues Nov 7th #WIWorking \n\nhttps://t.co/38Vw6DVBGb","date":"Fri Nov 03 03:11:06 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Heading to Ashippun Fire Department to celebrate 100 years of excellent public service - thank you to the men and women who have served! https://t.co/ix7gcugVF5","date":"Wed Nov 01 21:36:06 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Wisconsin State Senate is in session!  Watch the action live at https://t.co/7v2NpBqUBF","date":"Tue Oct 31 17:24:55 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Meeting w/ @repborn this AM at Horicon Marsh Education Center - great fall hiking spot if you're in the area https://t.co/jopAUFhnqh","date":"Mon Oct 30 14:40:10 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is great news - our reforms have kept WI on sound financial footing while putting $$$ back in taxpayers pockets https://t.co/C7f5DpvEIA","date":"Tue Oct 17 14:44:07 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This is sure to generate a lot of debate.  What do you think?\n\nhttps://t.co/qpizEKFjcH","date":"Mon Oct 16 20:21:43 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Keep it up @uwbadgers !!!!!! https://t.co/lrQG2dksfl","date":"Mon Oct 16 20:11:44 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Stay informed! Sign up (for free) to receive email updates on bills you are interested in at https://t.co/EMcA0MytyJ","date":"Fri Oct 13 14:39:21 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wishing Senator Nass a very happy birthday! https://t.co/daGTsIpPJ8","date":"Sun Oct 08 00:19:44 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm proud to have worked on this bipartisan bill with @SenShilling \nhttps://t.co/9MVWnkWOko","date":"Thu Oct 05 19:23:06 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Birthday @SenMarklein !!! https://t.co/LnGgj5bm9F","date":"Tue Oct 03 15:40:19 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to our reforms, Wisconsin has achieved our best tax ranking in over 50 years. #WIWorking https://t.co/TahNCvBIpf","date":"Thu Sep 28 16:01:20 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Impressive ACT scores at WI Choice Schools this year. Thrilled to see results of our investments in #StudentSuccess. https://t.co/Oazp7NNUep","date":"Wed Sep 27 15:08:56 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Governor's Small Business Summit is underway! Follow along with the events of the day by following #WIBizSummit17. #WIWorking https://t.co/hzxc6x9Yx2","date":"Tue Sep 26 14:40:29 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"ICYMI: 200+ companies have already signed up as potential Foxconn suppliers, contractors #WIWorking https://t.co/TpcclRXyhl","date":"Mon Sep 25 18:20:10 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to @Insight_FS for the invitation to tour your impressive facility in Oconomowoc! Always great to see the work of local businesses. https://t.co/kSwCcHejQw","date":"Mon Sep 25 15:46:10 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great win @Packers! #GoPackGo https://t.co/lxiILY4RL9","date":"Sun Sep 24 23:45:06 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The 2017 State Capitol ornament is now on sale, honoring the 100th anniversary of the Capitol building. https://t.co/z8XKGHrDkv","date":"Fri Sep 22 15:12:56 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy to join @GovWalker as he signs a #wibudget that funds our priorities &amp; saves money for taxpayers. Watch live: https://t.co/Q5ytXjHFg2","date":"Thu Sep 21 17:18:57 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A new promotional video from @WIDeptTourism showcases Wisconsin's fall scenery. Fall is a great time to #TravelWI! https://t.co/Z16fYXFQH8","date":"Wed Sep 20 20:23:16 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsin #RighttoWork law upheld once again! Another win for Wisconsin. https://t.co/SsicRnWyfT","date":"Tue Sep 19 16:34:50 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Pleased to be in attendance today for the signing of the #Foxconn legislation. View the event live from @GovWalker: https://t.co/gtRUOQWmCb","date":"Mon Sep 18 19:33:53 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This budget is one more win for Wisconsin under GOP leadership that has ensured our state is moving forward. We won't stop here. #WIWorking","date":"Sat Sep 16 02:17:13 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We set aside $200 million in reserve funding to ensure that our state has the resources to respond to any future challenges we may face.","date":"Sat Sep 16 02:14:10 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We took steps towards a long term transportation funding solution and held transportation bonding to the lowest level in over a decade.","date":"Sat Sep 16 02:10:58 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We worked to hold down the cost of higher education with an extension of the UW tuition freeze.","date":"Sat Sep 16 02:10:09 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We put even more back into the pockets of taxpayers with a phase out of the personal property tax and a repeal of prevailing wage.","date":"Sat Sep 16 02:08:41 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We refused to raise income or property taxes and completely eliminated two taxes from state statute for good.","date":"Sat Sep 16 02:07:42 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We made historic investments in K12 education, with increases of over $200 per pupil each year totaling over $630 million.","date":"Sat Sep 16 02:07:05 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Senate has approved a #wibudget that our members and our state can be proud of.","date":"Sat Sep 16 02:05:23 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Senate will be back on the floor at 12:30 to debate the #wibudget. Follow along at https://t.co/ix5xvZ9Izu. Watch live at @WisconsinEye.","date":"Fri Sep 15 17:07:20 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The calendar has been set for tomorrow's Senate session. We plan to convene at 9:30 a.m. to take up the #wibudget. https://t.co/ix5xvZ9Izu","date":"Thu Sep 14 17:08:15 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We have notified members that the Senate plans to be in session at 9:30 a.m. Friday to take up the #wibudget.","date":"Wed Sep 13 00:11:01 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I will be taking questions from the media in the Senate Parlor shortly on today's #Foxconn passage and upcoming #wibudget votes.","date":"Tue Sep 12 23:25:15 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Senate has approved the #Foxconn bill! Thrilled that with due diligence, lawmakers were able to make this an even better deal for Wisconsin.","date":"Tue Sep 12 23:13:26 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Senate is back in session today to debate #Foxconn incentives. Follow along at https://t.co/ix5xvZ9Izu  and watch live on @WisconsinEye.","date":"Tue Sep 12 15:40:00 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#NeverForget. https://t.co/mf553PGLqN","date":"Mon Sep 11 13:51:07 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Recent updated revenue estimates from the non-partisan Legislative Fiscal Bureau show that WI is on the right track thanks to our budgeting. https://t.co/BepdW1GrXX","date":"Fri Sep 08 19:36:19 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Yesterday Joint Finance finished their work on the #wibudget. Review all the @WIGOPSenate budget updates so far at: https://t.co/RlQRcsdkhV https://t.co/FkBhqiwWoi","date":"Thu Sep 07 18:40:51 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Joint Finance will be back today finalizing several remaining #wibudget items. You can watch live on @WisconsinEye: https://t.co/7v2NpBqUBF","date":"Wed Sep 06 17:10:23 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Pleased the Senate was able to make the #Foxconn bill before finance today an even better deal for WI. Looking forward to floor debate 9/12.","date":"Tue Sep 05 22:32:08 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Blessed are the cheesemakers: Wisconsin Donating 17,000 Pounds of dairy to Houston https://t.co/MP1TEPpsuF via @nbcnews","date":"Tue Sep 05 13:46:33 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to @SenStroebel! https://t.co/Zjsh6bT42M","date":"Fri Sep 01 14:07:13 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"1,000 new jobs throughout Wisconsin this month! #WIWorking https://t.co/1bEi65aQ3E","date":"Thu Aug 31 17:47:00 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great piece on the importance of skilled trades. WI GOP leaders are working to boost technical education &amp; #workforcedevelopment. #WIWorking https://t.co/zrl6VF2xfq","date":"Wed Aug 30 16:44:50 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"New website from @WisconsinDOA, https://t.co/EQXqYicMCb, increases government access as a centralized source for agency meeting information. https://t.co/y5ccGvlQ1n","date":"Tue Aug 29 17:22:54 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Joint Finance is back today to approve our historic investments in K-12 ed among other items. Live on @WisconsinEye: https://t.co/7v2NpBqUBF","date":"Mon Aug 28 18:31:54 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Don't forget to submit your nominations by 9/1 for the coolest thing made in Wisconsin contest from @WisconsinMC! https://t.co/mfDLtMjCcc https://t.co/yehwwfRlZC","date":"Fri Aug 25 16:18:00 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Exciting news on Milwaukee's newest sports and entertainment destination! #OwnTheFuture https://t.co/O5AGZl0jG1","date":"Thu Aug 24 19:42:11 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Federal Report Ranks Wisconsin No. 1 In Health Care Quality https://t.co/bsEb5mfo2Z","date":"Wed Aug 23 18:54:44 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Looking forward to all of the expert testimony and public input at #Foxconn hearing today! Still working to secure great deal for taxpayers. https://t.co/8GsLqyxBAK","date":"Tue Aug 22 16:48:09 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great time this weekend at Dodge Co fair holding office hours &amp; participating in the cream puff contest. Thanks to everyone who stopped by! https://t.co/tFWET5P8Nx","date":"Mon Aug 21 15:23:38 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"And excited to be moving forward again with the #wibudget which makes historic investments in schools, lowers tax burden on WI residents. https://t.co/7Sg7WMW2Y7","date":"Fri Aug 18 17:01:03 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Looking forward to public input at local hearing next week on #Foxconn. https://t.co/pE2drx7tdg","date":"Fri Aug 18 16:54:23 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Looking forward to office hours this afternoon at the Dodge Co Fair! Hope you can join me at this great local event. https://t.co/vvnPMkZR3e","date":"Fri Aug 18 15:09:56 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Excited to once again be holding district office hours at the Dodge County Fair! Join me this Friday to discuss the issues facing Wisconsin. https://t.co/S88sdZoaLm","date":"Wed Aug 16 19:20:09 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Looking forward to attending the Dodge County Fair this week! https://t.co/MY7hM2iVbr","date":"Tue Aug 15 18:21:46 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Sat down with @CBSEveningNews today at the Capitol to discuss Wisconsin's ongoing #Foxconn negotiations. https://t.co/9Qbw94jj6s","date":"Mon Aug 14 20:36:15 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'm joining @MariaBartiromo on @MorningsMaria this a.m. on @FoxBusiness. Watch for an update on Wisconsin's ongoing #Foxconn negotiations.","date":"Fri Aug 11 10:41:18 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Productive @WIGOPSenate caucus today working through #Foxconn bill w/ @WisconsinDOA/@InWisconsin to ensure we're getting a good deal for WI. https://t.co/gVC3ojimC2","date":"Thu Aug 10 19:42:16 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'll be talking #wibudget &amp; #Foxconn with the @Jerrybadershow just after 10:30. Listen on @NewsTalkWTAQ or online at https://t.co/LhNUukKyN7","date":"Thu Aug 10 14:52:47 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'll be live w/ M.D. Kittle on the Jay Weber show just after the top of the hour. Tune into @newstalk1130 or online: https://t.co/fWReWoMY6k","date":"Thu Aug 10 11:54:01 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Going on the air now with @MarkBellingShow to discuss the #wibudget and #foxconn. Tune in online at: https://t.co/ivcXunMRDm","date":"Wed Aug 09 20:12:54 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Productive meeting with @GovWalker this morning. @WIGOPSenate remains committed to completing the #wibudget, due diligence on #Foxconn bill.","date":"Wed Aug 09 17:19:14 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to @SenatorDevin! https://t.co/RpnUBwo9P5","date":"Tue Aug 08 16:41:48 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Once again @WisconsinMC is looking for the coolest thing #MadeinWis! Submit your nomination for a great locally made product/service by 9/1. https://t.co/LKZJk24MUB","date":"Tue Aug 08 14:24:15 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The first day of @wistatefair is here! Check out this year's attractions, promotions, lineup, new foods and more at: https://t.co/FrfGe6qLLp","date":"Thu Aug 03 14:31:28 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The @WIGOPSenate is focused on completing the #wibudget. If you haven't already reviewed our proposal, find it at: https://t.co/OoKKTM9DEW https://t.co/qGDeTTn5Cm","date":"Wed Aug 02 16:58:20 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks @GovWalker for addressing today's @WIGOPSenate caucus to discuss #Foxconn and #wibudget. https://t.co/1Bwi4ZrMyM","date":"Tue Aug 01 19:17:40 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"No best of show but Wisconsin cheesemakers again dominate American Cheese Society competition https://t.co/tGusqwkzS7 via @WiStateJournal","date":"Mon Jul 31 17:47:36 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A very happy birthday to @SenRobCowles! https://t.co/2ZCRj6phnA","date":"Mon Jul 31 14:10:23 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Get the most recent update on flooding throughout the state from @ReadyWisconsin: https://t.co/SMjTqMOrPc","date":"Fri Jul 28 16:15:54 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"ICYMI: Watch my interview with @gneumann_wkow this weekend on #CapCitySunday. https://t.co/CzneZ3mHGf","date":"Thu Jul 27 16:32:42 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Just over a week until the @wistatefair! Plan your trip at https://t.co/FrfGe6qLLp","date":"Tue Jul 25 23:26:14 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Don't forget to catch #CapCitySunday &amp; #HereandNow this weekend for more on the @WIGOPSenate budget, online in full: https://t.co/OoKKTM9DEW https://t.co/dG5juRlfTk","date":"Fri Jul 21 18:28:56 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Tune into the @Jerrybadershow just after 10:00 for an update on the Senate's work on the #wibudget. https://t.co/AAzyx1c9s3","date":"Fri Jul 21 13:32:43 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My sincere thanks to @widatcp Secretary Ben Brancel for his years of service to Wisconsin. Best wishes for your retirement! https://t.co/4ty24gOxDK","date":"Thu Jul 20 19:13:02 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The @WIGOPSenate budget funds our priorities while still reducing the tax burden on WI residents. Learn more this weekend on #CapCitySunday. https://t.co/gNwveRqgVf","date":"Thu Jul 20 16:03:31 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"In the studio today promoting a Senate budget that invests in WI schools, keeps road projects on track and totally eliminates 3 state taxes. https://t.co/JMrVV3KIQ0","date":"Thu Jul 20 15:05:34 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Hearing a lot of feedback from Wisconsinites on new @wiaawi basketball rule. Do you think shot clocks should be used in high school games?","date":"Wed Jul 19 18:11:25 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to Senator @TerryMoulton! https://t.co/b3x5UrxbRa","date":"Wed Jul 19 15:22:02 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"1,000 new jobs is fantastic news for Wisconsin. Proud to be a friend of @KwikTrip, a great family-owned WI business. https://t.co/FZJswRnh6q","date":"Wed Jul 19 13:50:33 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'll be joining @620wtmj live at 1:15 to discuss the Senate Republican budget proposal. Listen online at: https://t.co/4FruLP9xWq","date":"Tue Jul 18 17:48:28 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The full @WIGOPSenate budget proposal is now available in full at: https://t.co/OoKKTM9DEW #wibudget https://t.co/FmdiX7WqTA","date":"Tue Jul 18 17:28:27 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Watch live as @WIGOPSenate leaders announce our proposal for the #wibudget: https://t.co/OoKKTM9DEW","date":"Tue Jul 18 16:30:19 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Proud to have been one of the authors of legislation to expand Wisconsin's treatment alternatives and diversion programs! https://t.co/VsOkompvT9","date":"Mon Jul 17 19:59:46 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Tomorrow at 11 AM, @SenDarling, @SenatorRoth and I will announce the @WIGOPSenate budget proposal. Watch live on FB: https://t.co/wDnYCW3oiB https://t.co/6qu2HdIDCV","date":"Mon Jul 17 19:00:30 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Many parts of Wisconsin are currently under a state of emergency due to recent flooding. Make sure you and your family are safe: https://t.co/AnSXBWapLR","date":"Fri Jul 14 16:21:34 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If you missed my interview yesterday with @VickiMcKenna on @1310WIBA, you can listen online at: https://t.co/rRIpdVnZCF","date":"Thu Jul 13 21:03:25 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"More productive meetings with Senators this morning, making progress on the #wibudget!","date":"Thu Jul 13 16:28:39 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great news for Wisconsin! #RighttoWork upheld by the Seventh Circuit. https://t.co/6bmSCuWaOP","date":"Wed Jul 12 21:02:19 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'll be joining @VickiMcKenna at 3:15 to talk #wibudget. Tune in to @1310WIBA or listen live at https://t.co/UqNbgQ8ZkT","date":"Wed Jul 12 19:34:46 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Birthday to @SenDanFeyen! https://t.co/78b7Behwfg","date":"Wed Jul 12 14:08:18 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"New legislative website just launched by @LTSB_WI makes it even easier to keep up with legislative business! Visit: https://t.co/mQ2t3sdT2i","date":"Tue Jul 11 22:22:41 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Another productive meeting of the @WIGOPSenate caucus this morning, and meeting with members this afternoon. #wibudget","date":"Tue Jul 11 18:05:05 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"If your area was affected by recent storms, get flood hazards &amp; recovery tips from @DHSWI: https://t.co/ftIF0emciv https://t.co/2wldPX2mVp","date":"Mon Jul 10 18:13:45 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congrats to Easton Meier from Dodge County on receiving the prestigious Billy Yout Excellence in Leadership Award! https://t.co/NEhN90EDF5","date":"Fri Jul 07 17:25:13 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The @WIGOPSenate caucus is back today for budget talks with the Legislative Fiscal Bureau. Get #WIBudget updates at https://t.co/QRSvyu72Nb","date":"Thu Jul 06 15:47:42 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Nice @journalsentinel update on some cool features of the new Milwaukee @Bucks arena! #OwnTheFuture #BuildTheFuture https://t.co/WEXeJTwZUW","date":"Wed Jul 05 21:12:45 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Independence Day festivities continue this evening w/ a special Capitol Centennial celebration at @wcoconcerts #COTS https://t.co/wxawF06ZdW","date":"Wed Jul 05 15:40:54 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy Fourth of July! https://t.co/x7uGkVzqPA","date":"Tue Jul 04 14:30:24 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A fireworks injury can end your 4th of July festivities with a bang. Thanks @ReadyWisconsin for this reminder to #CelebrateSafely this 4th! https://t.co/EQeFFwtAcA","date":"Thu Jun 29 15:13:24 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Another productive @WIGOPSenate caucus on #WIBudget! We'll be back next Thursday after the holiday weekend for more talks and LFB briefing.","date":"Wed Jun 28 21:18:14 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Productive #WIBudget talks in @GovWalker's office this morning. Looking forward to a fruitful meeting w/ @WIGOPSenate caucus this afternoon!","date":"Wed Jun 28 18:12:31 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today is Wisconsin Veteran-Owned Businesses Day! Register your vet-owned business &amp; join the directory at: https://t.co/Nca0IV6g6M #WIVetBiz https://t.co/6Zcj8bqBk7","date":"Tue Jun 27 15:27:59 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It's nearly the end of #DairyMonth and @GovWalker, @widatcp are celebrating with a “Wisconsin Cheese Day” tour! https://t.co/2SDqHvqoB2 https://t.co/9TM5uTX3Th","date":"Mon Jun 26 19:50:03 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great morning in Lake Mills for the annual Fourth of July parade. Thanks everyone who came out! https://t.co/RBjtDW9h8z","date":"Sat Jun 24 17:08:45 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"4th of July events start in many Wisconsin cities this weekend, including the #ShaketheLake fireworks near the Capitol in Madison! #TravelWI https://t.co/8eYp8jfbW5","date":"Fri Jun 23 15:15:20 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We were thrilled to host a visit from Lillie Elling from Columbus Senior High School who participated in the Senate Page for a Day program. https://t.co/Sm4dV0TVwO","date":"Thu Jun 22 15:34:19 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"As Obamacare continues to collapse, my thoughts are with all who have lost coverage. WI lawmakers will keep working to improve health care. https://t.co/FHQ9GGDCT2","date":"Wed Jun 21 18:55:12 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Columnist @John_Kass has some ideas for fixing a \"broken Illinois.\" You guys can keep the Bears though. #GoPackGo https://t.co/HgB9MfrfX6","date":"Wed Jun 21 14:23:59 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great coverage of another outstanding major in Wisconsin. Thanks @ErinHillsGolf &amp; all who helped make it a success! https://t.co/mOXE5SHssS","date":"Tue Jun 20 16:40:01 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"It's National #RideToWorkDay! Thanks to the @WisconsinDOT for this reminder to look twice for motorcyclists today and every day. https://t.co/xvKrrJJdhA","date":"Mon Jun 19 20:34:48 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"We're encouraged by #SCOTUS decision to hear WI's appeal of Whitford and grant a stay of the lower court’s order. https://t.co/kkKPTrsqPQ https://t.co/A6BMVGL6wD","date":"Mon Jun 19 16:17:43 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Happy birthday to my @WIGOPSenate colleague, Senator Jerry Petrowski! https://t.co/Rks8Y6qSnJ","date":"Fri Jun 16 17:15:08 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"DHS reports that 12 Wisconsin birds have tested positive for West Nile virus. Get tips to protect you &amp; your family: https://t.co/cWOivBP0uX https://t.co/oLz0klqefd","date":"Fri Jun 16 16:21:21 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Joint Finance Committee is back today discussing the #wibudget. Get all your @WIGOPSenate budget updates at https://t.co/QRSvyu72Nb.","date":"Thu Jun 15 18:16:37 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsin's unemployment rate has dropped to 3.1%! This is our lowest rate since October 1999 and our 2nd-lowest rate on record! #wiworking https://t.co/eHO4d1Rcab","date":"Thu Jun 15 15:07:27 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Wisconsin Senate has adjourned. Get updates on the @WIGOPSenate bills approved today at https://t.co/QRSvyu72Nb.","date":"Wed Jun 14 22:50:35 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Senate is back in session today. Follow along at https://t.co/ix5xvZ9Izu  and watch live on @WisconsinEye.","date":"Wed Jun 14 16:08:02 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Did you know that #FlagDay was started in Wisconsin over 100 years ago? Learn more from @WisHistory: https://t.co/2hfSouavQV https://t.co/Vq4YKb2OED","date":"Wed Jun 14 15:39:04 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My thoughts and prayers are with all those injured or still in harm's way this morning in Virginia. https://t.co/4HyUhS8jmP","date":"Wed Jun 14 12:12:49 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"ICYMI this weekend, I joined UpFront with @MikeGousha to discuss the state budget. Watch the interview: https://t.co/8xuKmGvJHg","date":"Mon Jun 12 19:19:32 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great morning on set at @WISN12News for UpFront with @MikeGousha. Catch the show this weekend for an update on the #wibudget. https://t.co/62tkQrDe27","date":"Fri Jun 09 16:31:56 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A very happy birthday to @WIGOPSenate member @SenatorTestin! https://t.co/ILjdmSEmlh","date":"Fri Jun 09 14:45:18 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Another great opportunity for Wisconsin residents as @ErinHillsGolf\nhosts @usopengolf! Get more info on the event: https://t.co/AdaYBmxvdV","date":"Thu Jun 08 20:40:42 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The @WIGOPSenate caucus is back this morning working on #wibudget and upcoming legislative session. Get updates at: https://t.co/QRSvyu72Nb","date":"Thu Jun 08 15:17:27 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsin becoming national leader in hiring disabled workers https://t.co/oUydxM1SJi via @journalsentinel","date":"Wed Jun 07 15:39:48 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The @WIGOPSenate caucus is meeting to continue our work on the #wibudget this afternoon. https://t.co/lb8dd3AdSE","date":"Tue Jun 06 18:21:04 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My response to today's Assembly press conference on the education budget: https://t.co/uC7CsCEXfe","date":"Tue Jun 06 17:26:59 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Cool feature in @CNNTravel highlights Taliesin and Wisconsin's official Frank Lloyd Wright trail. Just 1 of many great reasons to #TravelWI! https://t.co/iSUn0cDjt4","date":"Mon Jun 05 20:46:43 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My goal is to keep #WIbudget debate on track &amp; have a budget complete by July 1. @WIGOPSenate will be continuing work with JFC &amp; our caucus.","date":"Mon Jun 05 19:30:34 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Don't forget that Free Fun Weekend from @WDNR starts tomorrow! Read more about all the activities you can try: https://t.co/gO1q4AeDBi https://t.co/6zYu9nauyz","date":"Fri Jun 02 14:39:50 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Very pleased to see the agriculture friendly bill that I authored signed into law today. https://t.co/EJpTeKfQN9","date":"Thu Jun 01 20:31:06 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"June is #DairyMonth in Wisconsin! Did you know that Wisconsin leads the nation with over 9,000 dairy farms and 1.28 million cows? https://t.co/G9L7MHSzM9","date":"Thu Jun 01 14:46:20 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Congrats to the \"cookie ladies\" on a sweet ruling today. I hope that @WisDOJ will choose not to appeal this decision. https://t.co/kCdMmAC5pu","date":"Thu Jun 01 02:21:55 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Sad to see a candidate who neglected to visit the state a single time during the general blame WI laws for loss. Proud to stand by #VoterID. https://t.co/L3FGtohpXS","date":"Wed May 31 18:27:53 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"A huge thanks to @uwoshkosh for this framed photo from this year's #UWOGrad ceremony. What a great day! https://t.co/WtYtSh7NQ3","date":"Wed May 31 15:43:17 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Bummed to be back from a long weekend? Start planning your activities for @WDNR Free Fun Weekend, coming up June 3! https://t.co/PzueQN6LUo https://t.co/lANwAMpWNP","date":"Tue May 30 14:41:13 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today we remember all of those who made the ultimate sacrifice in defense of this great nation. #MemorialDay https://t.co/EpSNEnJqJD","date":"Mon May 29 14:45:17 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"No Matter What Washington Does, North Carolina &amp; Wisconsin Taxpayers Set To See Tax Relief In 2017 via @forbes https://t.co/D9cBpsjmGL","date":"Fri May 26 17:07:33 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This Memorial Day weekend, take time to honor those who have served our country at these local veterans' memorials:  https://t.co/s3L1iCH4nP https://t.co/qKqSySFZxR","date":"Thu May 25 20:44:04 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The deadline for the Wisconsin Innovation Awards is coming up on June 1. Submit your #LaunchinWI entry at https://t.co/etZqFcuQli https://t.co/MvrO79kCEF","date":"Thu May 25 15:55:30 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Great to speak to @wuiinc this afternoon about legislative issues and ongoing state budget deliberations. https://t.co/QHTKcZH5jg","date":"Wed May 24 19:38:48 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"ICYMI: Wisconsin's April Unemployment Rate dropped to 3.2%,\nthe lowest level since February, 2000 and well below the national rate of 4.4%. https://t.co/k9kfQbvgnG","date":"Wed May 24 16:44:51 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was pleased to take part in the announcement of the Tommy G. Thompson Center on Public Leadership. Watch live: https://t.co/UUJI2qnqSP https://t.co/wP8GLtKNMB","date":"Tue May 23 18:09:05 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I'll be joining @repvos at 12:30 today to announce the creation of a new leadership center at @UWMadison in the biennial budget.","date":"Tue May 23 14:52:19 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to everyone that joined us for office hours in Johnson Creek and Oconomowoc today! https://t.co/kyjbR8eM6o","date":"Mon May 22 21:50:46 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Looking forward to another day of local office hours! See you today in Johnson Creek and Oconomowoc: https://t.co/Bg4J7cC2k6","date":"Mon May 22 13:32:29 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"BLS Data: Wisconsin Ranks 5th in Nation in Rate of Manufacturing &amp; Total Nonfarm Job Growth from March to April 2017 https://t.co/v6an7X7Kph","date":"Fri May 19 20:57:09 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Another great town hall yesterday in Horicon! Thanks to everyone who came out to discuss your concerns about issues affecting Wisconsin. https://t.co/b2255vvk9v","date":"Fri May 19 16:12:23 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Wisconsin unemployment rate down again to 3.2%, a 17 year low. #WIWorking https://t.co/dcPe5kilph","date":"Thu May 18 17:40:15 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Looking forward to another local listening session today at the Horicon Marsh Education and Visitor Center. See you all at 11:30!","date":"Thu May 18 12:57:00 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to the @sunprairiestar for covering my local listening session! We had great turnout in Bristol. https://t.co/PgK2uwHcrk","date":"Wed May 17 18:24:27 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My next local listening session is tomorrow at 11:30 a.m. at the Horicon Marsh Visitor Center. Get directions: https://t.co/YleSwryROo","date":"Wed May 17 15:23:36 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"This #ArmedForcesWeek, thanks to all those serving in our military from Wisconsin and throughout the nation. https://t.co/Wn9se5kuTf","date":"Tue May 16 20:07:49 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"JFC is back in session today. Watch live on @WisconsinEye and get all your @WIGOPSenate budget updates from https://t.co/QRSvyu72Nb.","date":"Tue May 16 16:15:47 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I was honored to be part of the @uwoshkosh commencement ceremony this weekend. Congrats to my son Connor and all of the 2017 grads! #UWOGRAD https://t.co/J0eLq3BBMF","date":"Mon May 15 19:15:54 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Today is #PeaceOfficersMemorialDay and the start of #NationalPoliceWeek. Thank you to all of those who keep our communities safe. #NPW2017 https://t.co/AgpVkQ3uFJ","date":"Mon May 15 16:08:06 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The @widatcp is warning consumers about fake @we_energies calls targeting small businesses. Get more information: https://t.co/dZlYOFbsfi","date":"Fri May 12 15:11:41 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to Beaver Dam Mayor @bglewen for visiting my office during Municipal Government &amp; Utility Day in Madison! https://t.co/4sn28JnTQR","date":"Thu May 11 15:45:21 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to the @wdtimes1 for covering my town hall with Rep. @JohnJagler. It was great to have so many constituents weigh in on state issues! https://t.co/W73jV15xe2","date":"Wed May 10 19:35:14 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The Senate is back in session today. Follow along at https://t.co/ix5xvZ9Izu and watch live on @WisconsinEye.","date":"Wed May 10 14:38:23 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"ICYMI: I weighed in on fed. healthcare changes in @washingtonpost. Grateful WI is in a better spot than many states. https://t.co/RuNl8XahrU","date":"Tue May 09 16:03:37 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to everyone who attended office hours today to speak with me and Representative @JohnJagler! Great turnouts in Bristol and Watertown. https://t.co/NXdjBMHSaG","date":"Mon May 08 19:33:14 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"WI is up to #10 in @ChiefExecGrp's Best States for Business! An improvement of over 30 spots under GOP leadership. https://t.co/LCedYJOuv7 https://t.co/NrLLarm0yo","date":"Mon May 08 16:30:35 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"My first listening session starts at 10 a.m. at Bristol Town Hall. See you there! Get directions: https://t.co/GELE0CeaeK","date":"Mon May 08 13:55:07 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Don't forget to join me for my Spring Office Hours! The first day of listening sessions is this coming Monday. https://t.co/P63EQh39L7","date":"Fri May 05 19:36:58 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"#FridayFacts from @WIDeptTourism! It pays to @TravelWI! https://t.co/nO16F4X6DG","date":"Fri May 05 15:48:39 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Thanks to members of @ACSCANWisconsin for stopping by my office this afternoon to discuss #JustADisguise during your advocacy day! https://t.co/Va6FpuFODz","date":"Thu May 04 21:41:04 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"I plan to review the proposal in its entirety to determine how closely it reflects Senate transportation priorities as talks continue. (2/2)","date":"Thu May 04 20:35:18 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"The transportation &amp; tax plan that Assembly leadership rolled out today contains a number of good ideas that are worth a closer look. (1/2)","date":"Thu May 04 20:34:43 +0000 2017","user_id":"1004891731"},{"handle":"RepFitzgerald","text":"Only a few more days until the first of my local listening sessions! Mark your calendars. https://t.co/q1VhSPkLxB","date":"Thu May 04 15:58:23 +0000 2017","user_id":"1004891731"}]