[{"handle":"RepFischbach","text":"Americans are paying more for just about everything thanks to Biden and the Left’s failed economic policies. Inflation is a tax on ALL Americans. https://t.co/5SxPDrcWa6","date":"Fri Jun 17 15:37:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My office is accepting applications for a Wounded Warrior fellow in my district offices! Click to see the requirements and how to apply. https://t.co/SRB2b0auNC","date":"Fri Jun 17 00:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you @CPofMN for coming to my office to discuss your legislative priorities. Care Providers of MN is a nonprofit membership association that started in 1947 and now has over 900 members ranging from traditional facilities to highly specialized ones. https://t.co/qJgtPJxZ4S","date":"Thu Jun 16 22:57:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Left’s soft-on-crime policies are putting our police force and our communities in danger. https://t.co/nA4O1ovMSQ","date":"Thu Jun 16 14:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My office is now accepting applications for a paid internship in my D.C. and district offices! This is a great way to get hands-on experience learning how Congress works. Visit my website for more information and to apply. https://t.co/Zt5otxRxI2","date":"Thu Jun 16 00:27:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My office recently met with bikers in town for #BikersintheBeltway to talk about issues important to them &amp; bikers across the state like motorcycle profiling. I cosponsored H.Res 366, which expresses the sense of the House that law enforcement shouldn’t profile motorcyclists. https://t.co/b4Rb8QUSdH","date":"Wed Jun 15 23:16:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"ICYMI I spoke during the Rules debate to call out the Left on the duplicative, partisan, &amp; politically motivated game they are putting the American people through. They have no interest in using bipartisanship to solve the serious issues facing our country https://t.co/06POqgRuR3","date":"Wed Jun 15 13:37:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy 247th birthday to the @USArmy! The nation is grateful for your service. https://t.co/O1T0BKasSu","date":"Tue Jun 14 23:37:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy Flag Day! On this day in 1777, the Continental Congress adopted the “Stars &amp; Stripes”. Long may she wave https://t.co/OGl7d5BsQq","date":"Tue Jun 14 20:54:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Great talking with you - thanks for coming by!","date":"Tue Jun 14 18:50:49 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you President &amp; CEO Denise Johnson and all the employees I got to meet during my tour of RiteWay Conveyors with @GlennGruenhagen. Like so many small businesses, RiteWay is struggling to find employees. We need to get this country back to work. https://t.co/1MRb1u8oSr","date":"Mon Jun 13 14:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I applaud #RenvilleCounty for doing everything they can to prepare for the worst. Thank you to law enforcement officers for all they do to keep our communities safe. #MN07 https://t.co/qMl2Rvpyad","date":"Sun Jun 12 23:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As we celebrate #DairyMonth I want to thank @HutchChamberMN for inviting me to Dairy Day. It was lots of fun to celebrate Minnesota dairy producers with Princess Kay of the Milky Way, the McLeod County Dairy Princesses, and @DUrdahl https://t.co/zCzGyQvCGs","date":"Sun Jun 12 16:57:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Daktronics is a manufacturer of large-format LED displays. Next year, you’ll be able to see a @Daktronics product at #TargetField when they install their new scoreboard! Thanks so much for the tour of your #RedwoodFalls facility #MN07 https://t.co/zGFIfF2LA9","date":"Sat Jun 11 13:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My office is now accepting applications for paid internships in my office this Fall! Visit my website for more information. https://t.co/Zt5otxRxI2","date":"Sat Jun 11 01:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Inflation has hit 8.6%. Prices on everything continue to rise with no end in sight. Americans cannot afford this Administration’s failed policies. Why is this not THE priority for the Left? https://t.co/e7KOpljMIz","date":"Fri Jun 10 16:37:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great catching up with the @nmpf. We discussed many of their priority issues like trade and the supply chain, standards of identity, and the Farm Bill. https://t.co/w7MBTkfrqh","date":"Fri Jun 10 14:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you Larry from @MilitaryOfficer for coming by my office in Willmar to talk about the federal priorities for your organization. MOAA represents more than 350,000 members and families from every service branch. https://t.co/DbUGPh0TFb","date":"Fri Jun 10 01:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Gas is averaging $5/gal for the first time EVER. Americans are paying the price for Biden's far Left anti-American energy policies. It's time for Democrats to wake up and realize we can't afford these policies https://t.co/tT66iFNdub","date":"Thu Jun 09 16:16:43 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden has been begging dictators and foreign adversaries for help easing gas prices. Why? We have the ability to increase our own gas production and lower prices right here in the USA! https://t.co/sobzAg1DHq","date":"Thu Jun 09 15:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was honored to join Mayor Quackenbush and State Sen Gary Dahms in Redwood Falls for the housing and commercial development ribbon cutting. These projects are so important as we address the housing shortage throughout the region. #MN07 https://t.co/06ZlgVj8RC","date":"Wed Jun 08 16:00:06 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Americans are on track to spend 78% more on gas under this administration. It is time to unleash American energy dominance and get these prices under control. https://t.co/zYrEFmLCN4","date":"Wed Jun 08 14:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks for coming by - it was great talking with all of you!","date":"Tue Jun 07 19:51:22 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This administration declared their anti-American #energy war on day one and they continue to double down as Americans spend DOUBLE on gas. @POTUS has chosen the far-Left Green New Deal over the American people. https://t.co/804VLl8WaU","date":"Tue Jun 07 17:50:47 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, we honor the service members who courageously fought in the Battle of Normandy. The world is a safer, freer place today because of the sacrifices they made 78 years ago. https://t.co/DQqm0a1t57","date":"Mon Jun 06 20:50:06 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We have every level of government working to rebuild #Forada. Please reach out to my office if we can be helpful. Thank you to Cindy Frederick &amp; Mayor Reller for guiding us &amp; thanks to Commissioners Tim Kalina &amp; Jerry Rapp, Sen Westrom &amp; Reps Anderson &amp; Franson for joining me. https://t.co/TnR2COCkTd","date":"Sat Jun 04 21:29:40 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My Moorhead office is now accepting applications for a Wounded Warrior Fellow! Click here for more information. https://t.co/cb6QalXPjn","date":"Fri Jun 03 20:12:47 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy World Dairy Day! Fun fact: MN produces over 9 BILLION pounds of milk every year – most of which is made in #MN07! Thank you to all the dairy farmers across the district making Minnesota’s state drink. https://t.co/0YttnBqdjI","date":"Wed Jun 01 15:43:50 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Brody Bakken and Dennis Bosek on inventing the “Otter Claw”! This machine is going to save highway crew so much time by helping clear out debris from culverts. #MN07 https://t.co/Zz8LqsTmaO","date":"Tue May 31 20:34:08 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"On  #MemorialDay, we remember those who gave the ultimate sacrifice for our country and the loved ones they left behind. It is because of them this country is the greatest in the world. https://t.co/a3vRuMZYTL","date":"Mon May 30 12:00:02 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Americans deserve efficient, affordable, and American-made energy. This administration has chosen its Far-Left Green New Deal agenda instead. It’s time to unleash American energy dominance.","date":"Fri May 27 14:06:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had @therealnmma in my office recently to talk about supply chain constraints, tariffs, recreational access and infrastructure, and the workforce. https://t.co/vsA6YoYb79","date":"Fri May 27 01:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"If you’ve been affected by the floods, you might qualify for USDA benefits. You can find out on their website, and please contact my office if we can help you. https://t.co/4wB0bdVoQn","date":"Thu May 26 16:50:47 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"80% of Americans think abortion should be illegal in the 3rd trimester. The pro-life community is not extreme. The pro-abortion community is. https://t.co/aeLwKFXWaX","date":"Thu May 26 14:08:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to @2harvest who came by and met with my staff to discuss a number of initiatives important to them. Last year, their organization distributed more than 113 lbs of food – 107 million meals! https://t.co/1k0RbCW5aS","date":"Thu May 26 00:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"According to CBP, there were 234,088 migrant encounters at the southern border in April – the highest in US history for one month. This will only get worse if Biden follows through on lifting Title 42. Border security IS national security and this Admin seems to want neither.","date":"Wed May 25 14:03:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I met with the MN Society of Anesthesiologists during their annual fly-in. Thanks for coming by! https://t.co/3XM6piB9hP","date":"Wed May 25 00:47:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden declared war on American #energy from day one. Now experts are projecting gas prices will surpass $6/gal by August. We need to end the freeze on oil and gas leases, fast-track pending LNG export permits, and expedite all pipeline &amp; energy development approval NOW.","date":"Tue May 24 14:54:49 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was glad to have the @NPPC come to my office to discuss a number of issues, including foreign animal disease preparedness and response. https://t.co/IpPQ4a5Jxc","date":"Tue May 24 01:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Families need answers and action now.","date":"Mon May 23 20:56:27 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I also voted for the Access to Baby Formula Act, which would give the U.S. the ability to temporarily waive administrative requirements under WIC.","date":"Mon May 23 20:56:26 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last week, the Dems put out a bill that just threw money at the FDA and would do nothing to get formula back on shelves.","date":"Mon May 23 20:56:26 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Instead, I co-sponsored the Babies Need Formula Now Act to use every avenue possible to import safe formula from abroad and lift barriers that restrict new types and brands from entering the market.","date":"Mon May 23 20:56:26 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This Admin owns America’s baby formula crisis. They knew we risked a shortage when they had to shut down a critical facility but did nothing to prevent it. Now, stores are rationing formula and families are getting desperate. We need a solution to the baby formula shortage NOW.","date":"Mon May 23 20:56:25 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had the rare opportunity to meet with Romanian Senator Laura Iuliana Scantei. Of course, we talked about Russia's invasion of Ukraine &amp; concerns Romanians have should Russia succeed. It's always alarming to hear from people watching this happen in their own backyard. https://t.co/B1aQcvKuYM","date":"Sun May 22 17:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy Armed Forces Day! America is grateful to all those courageously serving this country. https://t.co/3gR8OQXfKd","date":"Sat May 21 17:00:02 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a great conversation with @BigIofMN – a group of over 725 MN insurance agencies – about so many important issues like the National Flood Insurance Program, terrorism insurance, crop insurance, healthcare, cyber security, and insurance regulatory reform https://t.co/sx6T35BGCH","date":"Sat May 21 14:03:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to the Dee Foundry team for the tour! DEE Inc. is a metal fabricator in Crookston that specializes in making aluminum alloys, custom aluminum castings, and subassembly #MN07 https://t.co/0y8YF7BWjr","date":"Fri May 20 14:29:03 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"FDA has grossly mismanaged this #formula crisis. While parents are scouring stores for their baby’s formula, the Democrats’ solution is to write that same @US_FDA a $28 million check with no strings attached. https://t.co/JqbSvmsQ6Z","date":"Thu May 19 16:48:33 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to @MNhospitals for coming by to discuss the healthcare workforce, investing in rural broadband, expanding access to telehealth services, and your Hospital Financial Wellbeing Report https://t.co/gux0NnWMvP","date":"Thu May 19 14:05:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Democrats on the Judiciary Committee held a hearing in an attempt to pressure SCOTUS and influence their decision on Dobbs. Watch my comments here. https://t.co/PONoo6lth1","date":"Wed May 18 23:54:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"If you are one of the many people struggling to find formula, HHS has compiled resources on their website. This crisis is unacceptable, and the Administration must act quickly and decisively to help America's families  https://t.co/MQhX7P3tJm","date":"Wed May 18 19:43:13 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I recently went to @ArvigHQ for a tour and to talk about workforce issues, inflation, the business climate, and broadband. Arvig is a MN-owned telecom company that’s been providing high-speed products and services since 1950. Thanks for having me! https://t.co/U3QlI45bJV","date":"Wed May 18 14:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I recently visited the Avian Flu Command Center in Willmar and the MN Poultry Testing Lab to tour the facilities and discuss the state’s management of HPAI. This is critical work as Minnesota’s poultry farmers continue to fight HPAI. Keep up the great work! https://t.co/MoktSkbRf1","date":"Wed May 18 01:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last July, Moorhead Police Department Officer Brett Kvan received a Lifesaving Award for his quick response in reviving a woman who was unresponsive. #MN07 is grateful for officers like you! #NationalPoliceWeek","date":"Mon May 16 20:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Another great @CloseUp_DC group – it was wonderful to see #Waubun students on a windy day! https://t.co/1czmvUu0x3","date":"Mon May 16 16:00:02 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Rural broadband is a top priority of mine. I was glad to have @MNTAnews out to talk to me about challenges their members, including many in #MN07, are having with https://t.co/7XkRGPLHGT","date":"Mon May 16 01:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, we honor the peace officers who have died or become disabled in the line of duty. The sacrifices made for their communities will never be forgotten. https://t.co/Sa9RVc0hSI","date":"Sun May 15 14:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Polk County, Crookston, Fisher, and East Grand Forks for meeting with me to discuss flood response in your areas. https://t.co/9b5xuq4osj","date":"Sun May 15 02:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to @kcsosheriff Deputy Nick Moberg, who saved a man’s life last September after he had stopped breathing. Because of Deputy Moberg, that man survived. #NationalPoliceWeek #MN07","date":"Sat May 14 01:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The baby formula shortage was triggered by Biden’s supply chain issues but there's still no sense of urgency from this administration. Families need action NOW. https://t.co/WzxK85wZdm","date":"Fri May 13 16:10:38 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to @HutchTigers William on first place! His work “Faces” will be hung in a special exhibit at the U.S. Capitol for one year. Thank you to all the #MN07 students for their submission to the 2022 Congressional Art Competition! https://t.co/Laojxme4Tt","date":"Fri May 13 16:00:02 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We are monitoring the developments and damages resulting from last night's storms. For those affected, please do not hesitate to reach out to my office if we can help you.","date":"Fri May 13 14:59:36 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I’m thankful to the Oslo City Council for showing me how they have been managing flooding and talking to me about the impact it’s having on upcoming city projects. https://t.co/6YTCJ178y6","date":"Fri May 13 02:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The @MoorheadHigh Career Academy is reimagining high school. They have courses to engage students in many fields like automotive, welding, construction, culinary arts, and medical! Options like this are so important for building a strong, engaged workforce. Thanks for the tour! https://t.co/m7hFRR9UNQ","date":"Thu May 12 18:02:16 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Blocking this bill is yet another extreme reaction from Democrats who just want to silence those that don't agree with them. I'll say it again: the best weapon against speech we don't like is not censure, it's more speech. https://t.co/7FB58y1U1o","date":"Thu May 12 17:05:28 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This week, be sure to thank your local police officers and remember how much they risk keeping our communities safe #NationalPoliceWeek https://t.co/2nLn7Sf4WD","date":"Thu May 12 01:03:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Baby formula is a necessity - not a luxury - @RepPeteStauber @RepTomEmmer and I demand answers from this Administration about how they are going to fix this life-threatening shortage https://t.co/cZjYGzcMaJ","date":"Wed May 11 21:21:31 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"On this day in 1858, Minnesota became the 32nd (and greatest) state to be admitted to the Union. Happy Statehood Day! https://t.co/0ah5E7R86Z","date":"Wed May 11 18:19:50 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As northern MN continues to fight snowmelt flooding, I toured @crystalsugarco board member Scott Knutson’s farm where he and members of the #RedRiverValleySugarbeetGrowersAssociation shows me firsthand some of the impacts. https://t.co/JMuebptHJS","date":"Mon May 09 17:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy Mother’s Day!! https://t.co/YfC3j6MrF7","date":"Sun May 08 16:02:58 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I got to tour the @AURIcomm location in Marshall to see some of the projects they’re working on. AURI’s projects bolster ag communities all across #MN07 Thank you AURI, SMSU President @KumaraJayasuri2, Mayor Bob Byrnes,  Sharon Hanson, and @Westacre2CJ  for taking the time https://t.co/oQrt3zUKb7","date":"Sat May 07 16:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This week and every week we thank our teachers across #MN07, the state, and the country for all you do for America’s children. This #TeachersAppreciationWeek I’d love to hear who your favorite teacher was and why!","date":"Sat May 07 01:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today is Military Spouse Appreciation Day! Our armed forces wouldn't be what they are today without the support, commitment, and sacrifice of their military spouses. Thank you for all you do!","date":"Fri May 06 21:30:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"What a great way for the veteran community to get together. Don’t forget to stop by the Alexandria VFW next week! #MN07 #MilitaryAppreciationMonth https://t.co/lEaMYtVVZw","date":"Fri May 06 16:50:22 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Join me on this #NationalDayofPrayer, and may God continue to bless this great nation. https://t.co/BO7zUmRJ1h","date":"Thu May 05 19:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Here's to all the great #MN07 small businesses! Here are just a few of the businesses I've been able to visit since taking office. I'd love to hear your ideas for others! #NationalSmallBusinessWeek https://t.co/YseeJHQzFm","date":"Thu May 05 01:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"ICYMI @SecMayorkas doesn't know how many illegal immigrants have been relocated to MN, can't give examples of what he's done to secure the border, and, unsurprisingly, doesn't know about conversations his department is having at the northern border https://t.co/AyUl3hsEfa","date":"Wed May 04 15:24:20 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Tomorrow is DEA's National Prescription Drug Take Back Day. Safely dispose of your unneeded prescription drugs to prevent medication misuse and addiction. To read more about the event and find a drop-off site near you, visit their website. https://t.co/Mk4tfSQH3L","date":"Sat Apr 30 01:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to R.D. Offutt Farms on your 50th growing season! With 1,000 combined years of experience, the team is eager to see what this season is going to bring. https://t.co/IIzPvqLbN1","date":"Fri Apr 29 15:37:15 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Border security is national security, and right now, we have neither. Today, I questioned @SecMayorkas on the security of the southern border. Thank you to the hundreds who wrote in with questions! I'm sending his office the ones he didn't answer today https://t.co/AyUl3hsEfa","date":"Thu Apr 28 19:24:33 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I recently met with my Law Enforcement Advisory Committee Board to hear what I should be taking back to D.C. to support our #lawenforcement https://t.co/65mpbxi3gX","date":"Thu Apr 28 14:00:03 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I got to take a tour of #Foltz Trucking and hear from the @mntruck about their concerns like supply chain and workforce issues - thanks for having me! https://t.co/XMppJE7GpP","date":"Thu Apr 28 01:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Just a few days left in the Congressional Art Competition! Submit your work by MONDAY, MAY 2 for your chance to have your work hung on Capitol grounds for a year! https://t.co/woMlvsrFy1","date":"Wed Apr 27 16:48:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last week I got to tour West Texas with the @westerncaucus @RepNewhouse - these trips are always a great time and I learn so much from them. Thanks @RepPfluger and @RepArrington for showing me around your corner of this great country! https://t.co/oloxqPWOcf","date":"Tue Apr 26 19:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was good having @workcompxperts – Minnesota’s leading workers’ comp coverage provider – come by my office to hear more about their role in providing stability to MN businesses an support for workers injured on the job https://t.co/V3LKR2zGbF","date":"Tue Apr 26 01:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My office has been connecting with local community leaders and federal agencies and we are working to find ways to support the efforts on the ground throughout the Red River Valley. Please don't hesitate to reach out to my offices for assistance. https://t.co/NfpPCpn0YV","date":"Mon Apr 25 18:16:03 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to the MN State Fire Department Association for talking with me about FEMA grant funding and the Volunteer Firefighter Assistance program – and for everything you do to represent all the fire departments in Minnesota! https://t.co/lexd85P95r","date":"Sun Apr 24 18:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a great conversation with @CIRBdc to discuss the upcoming #FarmBill as it relates to crop insurance https://t.co/6fCR6oYcqW","date":"Sun Apr 24 01:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a discussion with @CompeerFinancial to discuss how they support farmers at the beginning of their careers. Thanks for coming by! https://t.co/yPKy8kVyQq","date":"Sat Apr 23 00:56:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great getting a visit from @AdaSchool and @mcc441 ! Big thanks to @CloseUp_DC for putting together such great D.C. trips for students https://t.co/GrH7IcgpGR","date":"Fri Apr 22 00:45:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It’s always great catching up with @NBWA and hearing about ways Congress can be supportive, particularly when it comes to workforce recruitment and retention. https://t.co/nt2lMW83DG","date":"Thu Apr 21 00:40:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to @MinnesotaPork for coming to discuss issues like African Swine Fever and workforce and labor issues that are important to your producers. https://t.co/IOLZr1UtxJ","date":"Tue Apr 19 23:23:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to Judge Kathryn Kimball Mizelle for overturning the mask mandate on travel! I cosponsored H.J.Res. 72, which would nullify this egregious overreach. If you want to wear a mask, no one is stopping you. The time for mandates is over. https://t.co/Xagrzq6XJn","date":"Tue Apr 19 18:06:24 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I got to talk to the @aanacrna about their 2022 priorities. Their association represents almost 60,000 Certified Registered Nurse Anesthetists and student registered nurse anesthetists across the country! https://t.co/hLVaEgBgs2","date":"Mon Apr 18 20:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks so much for having me on the show!","date":"Mon Apr 18 18:15:30 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congress should seize any opportunity to ease supply-chain tensions. I'm proud to introduce the SHIP IT Act with @RepDonaldsPress which do this by targeting specific needs in ports, shipping, and trucking. https://t.co/JLg1PoYz9q","date":"Mon Apr 18 13:30:38 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/Hkv6HnGe59","date":"Sun Apr 17 16:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/CGDzjm4Lfp","date":"Sat Apr 16 01:26:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/lwIQEcf0Me","date":"Fri Apr 15 13:44:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you @MinnesotaMilk for coming out and for talking with me about trade priorities, labor, and other issues your producers are facing https://t.co/ODIPRhXBCa","date":"Thu Apr 14 18:50:19 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There's less than one month for students to submit their work for the Congressional Art Challenge! Submit by May 2 for the chance to have your work hung for one year, where it will be seen by thousands of Members of Congress and visitors! https://t.co/woMlvsrFy1","date":"Tue Apr 12 19:46:21 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is overdue but welcome. Increased biofuels consumption is a no-brainer for bringing relief at the pump, reducing emissions, and increasing domestic production of fuel. I appreciate my colleagues partnership in advocating for this action. https://t.co/UbhNghddQS https://t.co/PDFjoihihC","date":"Tue Apr 12 16:41:55 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was honored to talk with a group of Minnesotans serving in Poland. Thank you all for your service! https://t.co/pqHPiUVit3","date":"Tue Apr 12 01:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"So honored to be a part of this delegation!","date":"Mon Apr 11 19:51:40 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The @mncorn Growers Association represents Minnesota's 24,000 corn farmers. I was glad to see them in my office to discuss rising prices for ag input costs, biofuels and the Farm Bill. https://t.co/nBdii61XOw","date":"Mon Apr 11 01:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last week, I cosigned a letter to @TheJusticeDepartment Sec. Merrick Garland insisting a full investigation into the deaths of unborn babies at a clinic in Washington, D.C. If this clinic is performing partial birth abortions, they must be stopped before one more life is taken.","date":"Sun Apr 10 14:00:02 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Southern Minnesota Beet Sugar Cooperative to discuss issues in the sugar beet industry. Annually, members of this cooperative grow approximately three million tons of sugarbeets, producing up to 1 billion pounds of pure white sugar. https://t.co/UUclMGsZdf","date":"Sun Apr 10 01:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This week, for the 5th time, Democrats blocked a motion to promote American energy independence. Why are they so opposed to legislation that could reduce these high energy prices?? https://t.co/n1gOSKYHFO","date":"Sat Apr 09 19:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Taiwanese Chamber of Commerce of North America  came to discuss strengthening U.S.-Taiwan relations to deter China's expansion and threats to regional peace #TCCNA https://t.co/UkGaUPZSYR","date":"Sat Apr 09 17:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This week, I introduced the Law Enforcement Education Grant Program Act, which would encourage young men and women to consider a career in law enforcement. Thank you @RepStauber and @RepHiggins for co-authoring and @GLFOP for your support https://t.co/sFEFTDHLJU","date":"Sat Apr 09 01:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The @SocialSecurity Administration is resuming in-person services at local social security offices! Visit their website for more information. https://t.co/tFGMXyXkVm","date":"Fri Apr 08 17:40:29 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I recently met with the @StPaulUSACE to discuss their current programs, projects we can work together on, and drought policy. https://t.co/mRLSr0HFtt","date":"Fri Apr 08 01:00:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I urge @USTradeRep to reject Canada's proposed TRQ allocations &amp; hold Canada accountable to their promises for fair market access under #USMCA. Thank you @RepPeteStauber @RepTomEmmer @RepAngieCraig @SenTinaSmith @SenAmyKlobuchar  for joining this letter https://t.co/vxoeLszc3I","date":"Thu Apr 07 17:32:36 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The @MnRuralWater Association came to the Hill to review their 2021 accomplishments and discuss their programming that helps provide clean drinking water and safe wastewater removal for millions of Minnesotans. https://t.co/lVyszxgFRi","date":"Wed Apr 06 23:20:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, we honor #GoldStar spouses across the country - the surviving loved ones of those who have died in service to our nation. The U.S. is forever grateful for your sacrifice. God bless our military families. https://t.co/C6DYFgNpav","date":"Tue Apr 05 20:05:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Our #farmers need @POTUS to review all available options to lower the cost of #fertilizer, and I am proud to be a co-author of this letter urging exactly that","date":"Tue Apr 05 15:53:13 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Calling #MN07 students, teachers, &amp; parents! \nMy office is accepting submissions to the Congressional Art Challenge through May 2. The winner will have their work hung for one year, where it will be seen by thousands of Members of Congress and visitors! https://t.co/woMlvsrFy1","date":"Mon Apr 04 21:25:48 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am proud to introduce the Gas Prices Relief Act, which would stop this administration from implementing their disastrous anti-American energy agenda until we start seeing gas prices from a year and a half ago. https://t.co/KTv1sJwjmk","date":"Fri Apr 01 13:53:54 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"In normal economic conditions, year-round E15 is a no-brainer. With current prices, it is a necessity. Proud to join my colleagues in pressing @POTUS to use homegrown biofuels to bring consumers relief at the pump.","date":"Thu Mar 31 19:20:49 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, we honor all the courageous veterans of the Vietnam War, some giving the ultimate sacrifice. This country thanks you and your families for your service #VietnamVeteransDay https://t.co/mW7ELlrpHW","date":"Wed Mar 30 02:00:29 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden has been waging his war on #energy since the day he took office. The prices you see at the pump today are a direct result of this administration's agenda. https://t.co/rRA237jFVh","date":"Tue Mar 29 14:43:06 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden declared war on American #energy during his campaign and has been delivering on that threat since the day he took office. How can @POTUS blame Putin for pain at the pump when it's campaign promise he made??","date":"Mon Mar 28 17:35:22 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Lynnae and Ken Hess, who were named the 2021 Outstanding Conservationists for Kandiyohi County! Crop rotation and Ag Water Certification are just two of the practices that led to receiving this honor #MN07 #NationalAgWeek https://t.co/buj0FYResY","date":"Fri Mar 25 14:03:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Bob Worth on receiving the @ASA_Soybeans Outstanding State Volunteer Award! Bob has been a member and volunteer with @MNSoyGrowers for over 25 years! Thank you for your life-long dedication to our rural communities #MN07 #NationalAgWeek https://t.co/OYutxh30kP","date":"Fri Mar 25 01:01:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Shoutout to #MN07 ag-workers this #NationalAgWeek ! Thank you for all you do!","date":"Thu Mar 24 18:59:32 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Earlier this month, I met with @ThisSpudsForYou to discuss trade policy and workforce issues facing the industry. Thanks for the conversation! #NationalAgWeek https://t.co/wRJi9SukIE","date":"Thu Mar 24 14:22:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Malecha Enterprises in Villard for being named Top Producer of the Year! What a well-deserved honor for this amazing, family-run operation. #NationalAgWeek #MN07 https://t.co/DeqZ3JXDho","date":"Thu Mar 24 01:00:01 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Students from #Glencoe and #RedLake came out to my office as part of a trip with @CloseUp_DC - an organization that engages students nationwide in the democratic process #MN07 https://t.co/L4qAKr2wbr","date":"Wed Mar 23 15:59:55 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The @SheepUSA came to my office to discuss mandatory price reporting, the importation of lamb, and the upcoming Farm Bill. I appreciated their input as we begin improving upon the 2018 #FarmBill for 2023. #NationalAgWeek https://t.co/C1HNVdxN6U","date":"Tue Mar 22 19:26:25 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This #NationalAgDay I want to thank #MN07 and farmers across the country for supplying Americans and the rest of the world with the goods we need every day. We are all so grateful for the work you do #ThankAFarmer https://t.co/Nfh0BZvXgq","date":"Tue Mar 22 14:59:54 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"On #WorldDownSyndromeDay we must remember to protect the unborn, which is why I cosponsored the Protecting Individuals with Down Syndrome Act, which would prohibit doctors from performing an abortion because a child may have Down Syndrome","date":"Tue Mar 22 10:02:38 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a good conversation with @AllinaHealth President and CEO, Lisa Shannon, to discuss their updates, COVID response, and their efforts to better serve the people in their system. https://t.co/Oz5XChgfng","date":"Mon Mar 21 23:35:39 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The #HealthWORKS Coalition, a group that millions of workers and their families depend on for the plans and benefits they provide, came to my office to discuss over-the-counter COVID-19 testing and pension issues. https://t.co/80aVjIh9N8","date":"Mon Mar 21 02:01:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My staff met with @Students7United to discuss their ideas for how Congress can help improve the education system. Thanks for coming by! https://t.co/NmertfgkKO","date":"Sat Mar 19 19:19:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The U.S. needs to become energy independent. Paying almost $4 a gallon should not become the new normal in #MN07 https://t.co/uPhpNoN3z3","date":"Sat Mar 19 17:03:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"During the Rule debate this week, I urged my colleagues to take up the American Energy Independence from Russia Act. Since @POTUS took office, energy prices have been skyrocketing. Why won't leadership have a vote on a bill that could start to reverse that? https://t.co/rppeIzzJUa","date":"Fri Mar 18 18:49:49 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/QMeTA21vo4","date":"Thu Mar 17 13:29:33 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"@SpeakerPelosi BRING THIS TO A VOTE https://t.co/I8JS4HcjfQ","date":"Wed Mar 16 14:32:46 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a nice time catching up with @SanfordHealth and meeting their new CEO, Bill Gassen. Congratulations to Mr. Gassen on his new position! https://t.co/RNCSoiwra1","date":"Tue Mar 15 14:17:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I met with @NASSP to discuss their legislative priorities for the year, including educator shortages, school infrastructure, and improving school mental health resources. https://t.co/HW9SYSFQ1s","date":"Mon Mar 14 14:00:02 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a great conversations with the @MNSoyGrowers  recently. Minnesota plants roughly 7.5 million acres million acres of soybean every year and #MN07 ranks third in the nation for soybeans harvested by acre. https://t.co/nYfxjKG2wp","date":"Sun Mar 13 14:13:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Don't forget to set your clocks as we #SpringForward tomorrow! It's the first hint of longer days and warmer weather, something I'm sure #MN07 is looking forward to!","date":"Sat Mar 12 18:49:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The @mncreditunions met with me to discuss the Credit Union Employee and Safety Act. Credit unions help more Minnesotans own homes, build assets, and pay for their children's education. https://t.co/TE0euHviVh","date":"Sat Mar 12 15:00:03 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last week, I met virtually with @bcga_clubs - The Boys &amp; Girls Club for the Bemidji Area was founded in 2003 to create a safe and engaging environment for youth around #Bemidji https://t.co/CtrGxOKuby","date":"Fri Mar 11 16:03:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was so great meeting with #Willmar Municipal Utilities while they were in D.C. last week! https://t.co/fNZM7ug4dt","date":"Thu Mar 10 15:03:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The deadline to apply for a paid internship in my D.C. or District offices is THIS FRIDAY! Get your applications in ASAP to get first-hand experience learning how Congress works https://t.co/Zt5oty996C","date":"Wed Mar 09 21:59:31 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"@nabtweets came by my office to discuss a number of pieces of legislation. It was great hearing from them! https://t.co/yuRCksWfu2","date":"Wed Mar 09 15:00:03 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a great meeting with the Minnesota Association of Health Underwriters to discuss important issues like #telehealth. I appreciated their insightful perspective on the #healthcare sector. https://t.co/17KD3r9sAc","date":"Tue Mar 08 16:56:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Biden Administration wants to find oil ANYWHERE besides right here in the U.S. - bonus points if the country is run by a dictator  https://t.co/ZNw07WSUYe","date":"Tue Mar 08 15:32:29 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the @DAVHQ for coming to my office last week to discuss your legislative priorities. They do great work for America's #veterans across the country. https://t.co/diMSM7FoSM","date":"Mon Mar 07 18:54:46 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you the #Pipestone County Commissioners for the recent meeting! I appreciated the local updates and perspectives they provided. Thank you also to all the county department heads and other community leaders who attended and shared info! #MN07 https://t.co/sWEUtgW6vD","date":"Fri Mar 04 20:04:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"ICYMI I talked with @wccoradio @bloisolson about President Biden's first State of the Union and ways Congress can be more effective\nhttps://t.co/whx8eFfeU5","date":"Fri Mar 04 16:18:28 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to @thechambergfegf for hosting a roundtable meeting with business owners and community leaders last week at @TheSpudJr! It was great to hear their perspectives on economic and workforce issues. I also appreciated that my friends Sen Mark Johnson and Rep Deb Kiel joined us https://t.co/smoXqikZCY","date":"Thu Mar 03 20:03:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There's just ONE WEEK LEFT to apply for a paid internship in my D.C. or District offices. This is a great opportunity for someone who wants first-hand experience learning how Congress operates. The deadline to apply is MARCH 11 https://t.co/Zt5oty996C","date":"Thu Mar 03 16:01:58 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Tiffany Kobberman on receiving the @MNagriculture \"MN Ag In The Classroom Teacher of the Year\" award! Thank you for encouraging your students and community to continue learning about ag – a strong community is so important for #MN07 https://t.co/7Zgy3xmnm5","date":"Wed Mar 02 20:02:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy birthday Marcy Korda, a WWII veteran living in Pelican Rapids who turned 101 on 2/22/22! At just 17, Marcy served as a nurse in North Africa and Italy - and survived 2 bombings. #MN07 and the USA thank you for your service, Marcy. https://t.co/bFbePaCeJP","date":"Tue Mar 01 19:31:27 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It is time for the U.S. to stand up and show leadership so our friends in #Ukraine and #Taiwan and those around the world know America is still committed to supporting their freedom.","date":"Fri Feb 25 20:54:32 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There's still time to apply for a paid #internship in my DC or District offices! If you've ever been interested in learning about how Congress works, this is a great opportunity for first-hand experience. Visit my website for more information. https://t.co/Zt5oty996C","date":"Fri Feb 25 18:02:12 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I pray for and stand in solidarity with our friends and democratic allies, the people of Ukraine. Click here to view my full statement. \nhttps://t.co/m0AkfsziUu","date":"Thu Feb 24 17:08:32 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to be a part of this with @RepDonaldsPress ! This Administration’s decision to mandate all non-U.S. Citizen travelers be fully vaccinated is unnecessary and is further burdening an already depleted workforce https://t.co/P3TJzaeN5j","date":"Wed Feb 23 22:01:34 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to the Thief River Falls Regional Airport for receiving a grant from @USDOT! The grant will support the use of Denver Air Connection for flights to and from @mspairport through May 2027 #MN07","date":"Tue Feb 22 17:33:34 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, @RepTomEmmer @RepPeteStauber and I honor the life of our friend and colleague Congressman Jim Hagedorn https://t.co/dqc1W4fFx2","date":"Fri Feb 18 15:24:33 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last week, I participated in a Forestry roundtable with the @westerncaucus . The trucking and workforce shortage has hit this community as hard as anyone, which is why I'm a cosponsor of the #DriveSafeAct which will help put more truckdrivers on the road https://t.co/bKtSIJZZ8i","date":"Wed Feb 16 16:52:06 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There are just over 3 weeks left to apply for an internship in my DC or District offices! Internships are a great way to learn how Congress works, first-hand. Visit my website for more information. https://t.co/Zt5oty996C","date":"Wed Feb 16 15:57:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Welcome home! #MN07 is so grateful for your service https://t.co/Bb3dUzblH9","date":"Tue Feb 15 16:24:08 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Erdmann family has sent over 10,000 #valentines to soldiers over the years! What an amazing way to spread love and show appreciation for those who serve on Valentine's Day #MN07 https://t.co/7RsLazL3oI","date":"Mon Feb 14 22:06:17 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My office is accepting Summer intern applications until March 11! If you're interested in knowing about how Congress works, this will give you great first hand experience. Find out more on my website https://t.co/C2ZpVvdIvd","date":"Fri Feb 11 19:38:33 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Yesterday on the @westerncaucus tour, we visited the U.S. Hockey Hall of Fame to check out their exhibits and see the world's largest hockey stick! https://t.co/akNSyZIa0h","date":"Fri Feb 11 19:08:05 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks for the drill core library tour @mndnr - always great to be reminded to the mineral wealth we have right here in Minnesota https://t.co/ddoRyLp3nR","date":"Thu Feb 10 21:45:32 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/gWWFd8l28w   Biden claimed inflation peaked months ago, but it's continuing to break records and earnings for workers can't keep up. It's time for Democrats to face the facts: the last thing we need is more reckless government spending.","date":"Thu Feb 10 20:59:21 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Kelsey Johnson, President of the @IMA_MN for joining us this morning and sharing the important history, community contributions, and economic impacts of the #mining in Minnesota. https://t.co/gFjpkeXFAz","date":"Thu Feb 10 20:26:54 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Excited to join - see you all up there!","date":"Wed Feb 09 20:15:05 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you for the visit, President Craft @Concordia_MN  and for the conversation about your successful use of COVID relief funds, the Pell Grant, and other important issues impacting higher education https://t.co/2iw5Agn80D","date":"Wed Feb 09 17:07:38 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you for having me - it was great talking with all of you!","date":"Thu Feb 03 15:47:28 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My office his now accepting applications for Summer interns! This is a great opportunity for anyone interested in learning about how Congress works by getting first hand experience! Find more information on my website https://t.co/wQb28mRLNy","date":"Thu Feb 03 15:06:49 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Republicans saw right through the Democrats' spending bills because we knew it would be misused for wasteful programs JUST like these in Minneapolis &amp; St. Paul","date":"Wed Feb 02 19:40:32 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My heart goes out to the families of the victims of the horrific tragedy that occurred today in Richfield. If you have any information that might be helpful in finding the suspects, please call 1-800-CALL-FBI (1-800-225-3524) https://t.co/hG3B9QCFYz","date":"Wed Feb 02 00:42:12 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Herb Nelson on your well-deserved retirement! Thank you for your nearly 50 years of service with the @ClayCountyMN Sheriff's Office. #MN07  https://t.co/khOGe6R7RV","date":"Tue Feb 01 20:18:10 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"#MN07 and rural communities across the country are getting hit harder by inflation. I'll keep working to cut bureaucratic red tape and push against unnecessary government spending, both of which are driving inflation up https://t.co/LqORijKXZz","date":"Tue Feb 01 14:01:54 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to my Southern Ag Advisory Committee for the helpful conversation yesterday. We were lucky to have @HouseAgGOP Republican Leader @CongressmanGT join us and share some of his expertise. These meetings are so important as we gear up to work on the #FarmBill https://t.co/H4QiDmLYSw","date":"Fri Jan 28 22:01:48 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to the Willmar Lakes Area Chamber of Commerce for the visit! It was nice to touch base with you on issues that are important to your members. I appreciate your leadership and partnership. https://t.co/usCmKCOZ0V","date":"Fri Jan 28 19:39:09 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to @ArcticCatORV @Textron for the great discussion. I appreciate Arctic Cat’s commitment to Thief River Falls, its employees, and its products and I look forward to working with you on solutions for the workforce shortage and other issues your community is facing. https://t.co/ziTqbnXCK5","date":"Fri Jan 28 17:02:38 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"ICYMI Wednesday I joined \"The Need To Know Morning Show\" where we discussed March for Life and the Dobbs Supreme Court case, election integrity, and the upcoming MN caucus. You can listen to the full interview here! https://t.co/WEoxABYX1S","date":"Fri Jan 28 14:27:15 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today we remember the lives of the 6 million victims of the Holocaust. May we honor them by standing against anti-Semitism in our world today #HolocaustRemembranceDay #NeverAgain https://t.co/vVwJ54zJ5k","date":"Thu Jan 27 21:17:34 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Had a great meeting this morning with the Northern Ag Advisory Committee. Big thanks to the Republican Leader @HouseAgGOP @CongressmanGT for joining us! https://t.co/4OCEkxbtAg","date":"Wed Jan 26 22:01:49 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This morning I joined the RRVSGA and ACSC Board’s Joint Breakfast to talk about the sugar market, COVID challenges, the Farm Bill, and more. Thanks for having me! https://t.co/YRhwYmEadz","date":"Tue Jan 25 19:26:44 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden's supply chain crisis continues to hurt the Minnesotan way of life https://t.co/HEF2y74lIX","date":"Sat Jan 22 15:23:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today we #MarchForLife https://t.co/fQrcDZBPen","date":"Fri Jan 21 19:59:08 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was an honor to work with @stevescalise on this op-ed and we pray this will be the last #MarchForLife with Roe v Wade as the law of the land https://t.co/cVaeVUGbmi","date":"Fri Jan 21 14:55:57 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I urge the FDA to respond quickly. It's irresponsible for these tests to be issued with such a high rate of inaccuracy and I'm worried parents are being pressured to take these tests as a financial windfall for manufacturers that results in the termination of innocent life","date":"Fri Jan 21 14:19:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"@KofC released a poll with @martispoll that found 71% of Americans support legal limits on abortion over 60% want to return the decision to the states or make abortion illegal. America wants Congress to stop abortion on demand! https://t.co/0GVmUqnYlJ","date":"Thu Jan 20 21:41:50 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The amount of voters who say they’re “very confident” in our election security dropped from 37% to 20%. Dems have responded to this crisis by pushing a radical election takeover bill that helps make permanent the decreased election safeguards that caused so many problems in 2020","date":"Thu Jan 20 21:10:07 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden chose to withdraw from Afghanistan in the worst way possible, evacuating our troops before evacuating all our citizens. Many Americans are still trapped in the Taliban-controlled country. The @StateDept estimated late last year that ~300 U.S. citizens remain. https://t.co/USl32VTWjQ","date":"Thu Jan 20 19:46:27 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden’s policies have led to a labor shortage, disrupting our supply chains. Last year, I introduced the #STOPtheGRINCH Act to alleviate the problem. Of course, leadership won’t put it to the Floor.","date":"Thu Jan 20 19:22:57 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The 1st major piece of legislation Dems passed was a $1.9T spending package Democrat economist Larry Summers warned would cause higher inflation. It did. Prices are spiking for just about everything as real wages decrease, costing the average worker nearly 2 paychecks last year https://t.co/hiDxXjUTP8","date":"Thu Jan 20 19:14:10 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden’s anti-energy policies are costing Americans jobs and increasing energy prices. He prefers to cancel pipelines in the U.S. that would increase energy independence and encourage Russia to build pipelines, forcing us to depend on adversaries for fuel and paying more for it https://t.co/Mz1bwoBBAi","date":"Thu Jan 20 19:04:09 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Following a year of defunding the police rhetoric from Biden and Congressional Democrats, over a dozen major US cities has record high homicide rates in 2021, including MN’s state capitol, St. Paul https://t.co/SAJBTgl209","date":"Thu Jan 20 18:56:57 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden has stopped border wall construction, resumed catch-and-release, and wants to provide mass amnesty for millions of illegal immigrants. This has resulted in an increase in human trafficking, drug smuggling, crime, and a lack of respect for our existing immigration system https://t.co/DTuOZvceGK","date":"Thu Jan 20 18:53:17 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"2021 saw record inflation, a border crisis, a supply chain crisis, an energy crisis, a failure in Afghanistan, and so much more. Biden's first year in office with Dems controlling Congress has seriously hurt the American people, and must be stopped before more damage is done.","date":"Thu Jan 20 18:49:46 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"@POTUS wants to know what #Republicans are for. We are FOR increased domestic energy production. We are FOR secure borders. We are FOR safe cities. We are FOR clearing up the supply chain crisis. We are FOR election integrity.","date":"Wed Jan 19 21:27:25 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It's been months since @POTUS held a press conference. I hope he can provide some much-needed answers on what he is going to do to reverse record-breaking inflation rates, bring energy prices down, and hold international bad actors accountable","date":"Wed Jan 19 16:49:24 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am proud to receive an A+ from the @SBAList on their pro-life scorecard! \n\nAs co-chair of the Congressional Pro-Life Caucus, protecting innocent life from conception until natural death is one of my top priorities  https://t.co/YtJn4EOXWP","date":"Wed Jan 19 16:31:07 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We are lucky to get great views of the night sky in so much of #MN07 like this week’s full moon. The Wolf Moon - the full moon that happens in January - gets its name because it’s believed wolves howl at the moon more this time of year 🐺🌕 https://t.co/KrktokDixz","date":"Tue Jan 18 20:36:30 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This Administration's proposed mandate was clearly an overreach of authority and a blatant attempt to work around Congress. I'm encouraged #SCOTUS was able to recognize that. https://t.co/iOpRErrKW8","date":"Fri Jan 14 16:18:37 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"ICYMI: See my reaction to the #SCOTUS decision on the #Biden Administration vaccine mandates https://t.co/BTIaegvsnn","date":"Fri Jan 14 14:45:26 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The ice road is coming back! Thank you to those plowing across Lake of the Woods so Minnesotans can get to and from the Northwest Angle without having to cross through Canada - it's so, so helpful for citizens and businesses in the area https://t.co/sIYHu5TSij","date":"Wed Jan 12 20:07:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"December's CPI report is the latest sign that out of control spending by Biden and the Democrats is only worsening the economic crisis facing this country as Americans are now making less while paying more for just about everything https://t.co/kwiePSPKlE","date":"Wed Jan 12 18:23:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to your team for coming out to #MN07 and doing demos with our #Paynesville CTE students!","date":"Wed Jan 12 16:09:47 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is a great victory for #MN07 dairy farmers and #USMCA. This ruling will increase dairy exports by providing fair market access to our northern neighbor’s market. USMCA is working. #NationalMilkDay https://t.co/0PhvFxWnMx","date":"Tue Jan 11 20:36:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I celebrated #NationalMilkDay early this year! Over the weekend, I joined @HouseAgGOP Leader @CongressmanGT @RepFredKeller and @RepMeuser at the #PennsylvaniaFarmShow where I met PA dairy producers, spoke with #FFA reps, and drank a truly delicious milkshake https://t.co/dHp8F7XZNn","date":"Tue Jan 11 18:43:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I wrote a piece for In Forum highlighting the successes of @HouseAgGOP last year and my hopes for this year. We have a lot to do for our ag communities and I hope the Majority will prioritize #farmbill and listen to ideas from both sides of the aisle https://t.co/5daBx9K2B5","date":"Tue Jan 11 15:42:30 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Three cheers for our dairy farmers on #NationalMilkDay! This summer I got to meet our very own #PrincessKayoftheMilkyWay. Did you know that #MN07 produces more milk than any other district in MN and is one of the top milk-producing districts in the country? https://t.co/IA76ygCi4B","date":"Tue Jan 11 14:54:57 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Yesterday was National Law Enforcement Appreciation Day. I want to thank #lawenforcement and their families for their service and their sacrifice protecting this nation https://t.co/8jMAbvNAxB","date":"Mon Jan 10 16:47:45 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"ICYMI Listen to my conversation with @bloisolson on #TheSundayTake here starting at minute 27. We talk partisanship and election integrity, agriculture, and issues that matter to #MN07 https://t.co/cLEWk9yjJ8","date":"Mon Jan 10 14:37:37 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Tomorrow, you can tune in at the 9AM hour on WCCO's News Talk 830AM radio show The Sunday Take and listen in on my conversation with @bloisolson, where we talk about accomplishments in the Ag space, partisanship on the Hill, and issues that matter to #MN07.","date":"Sat Jan 08 21:53:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Inflation is a tax on all Americans, forcing us to pay more for just about everything, and it's gone up every month of Biden's presidency. This NYT survey shows that 88% of Americans are concerned about it too. https://t.co/eXCz0DXmQP","date":"Fri Jan 07 19:27:37 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Good news for MN dairy producers. The USMCA provides dairy producers parity in market access and holds our northern neighbor to its promises to American producers. Glad to see results @RepTomEmmer, @RepPeteStauber, @RepHagedorn, myself, and others have long advocated for. https://t.co/Q09Ul1bLBS","date":"Tue Jan 04 20:19:50 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"One year ago today, I was sworn in to serve this great country and represent Minnesota's 7th District in the U.S. House of Representatives. It has been an honor working for Western Minnesota in D.C. this past year, and I look forward to accomplishing even more this year! https://t.co/2TJ8qKwGGt","date":"Mon Jan 03 17:35:51 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy New Year! I look forward to continuing to work my hardest for the District to make 2022 a successful year for every corner of #MN07 https://t.co/1CDXY405te","date":"Sat Jan 01 15:02:00 +0000 2022","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Merry Christmas! I hope you're able to spend this blessed day with loved ones https://t.co/lubhs59HSt","date":"Sat Dec 25 16:03:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Big congratulations to #MN07's own Lindsay Whalen for being nominated to @Hoophall! You have made MN proud for so many years and this is a well-deserved honor  https://t.co/gvaT69LvUG","date":"Thu Dec 23 18:32:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I hope #SCOTUS will agree the Executive Branch does NOT have the authority to bypass Congress to mandate COVID-19 vaccines for private businesses across the country https://t.co/eKGTjOSoNv","date":"Thu Dec 23 15:05:14 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a great time at the Agricultural Export Summit last month with Reps. Johnson and Feenstra. Ken Barbic from Farmer's Business Network asked really important questions about challenges facing the Ag industry from the supply chain crisis to the U.S.-China relationship. https://t.co/NGUG2GasLG","date":"Wed Dec 22 20:27:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks so much to the @AgCountry team for coming by during the @farmcredit fly-in! It's always great catching up with you all. https://t.co/wQNRY2OMoK","date":"Mon Dec 20 21:50:04 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Spread a little Christmas cheer with the office and #ChristmasElvis while waiting for votes yesterday https://t.co/YYvj7bfgJS","date":"Wed Dec 15 14:38:05 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"When the majority of people think you're not handling inflation, maybe it's time to consider a new approach. Government spending is driving record-high inflation. More government spending in the BBB is NOT a solution. https://t.co/uvJfF48MlC","date":"Mon Dec 13 18:41:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy 385th birthday to the @USNationalGuard! The Guard is the oldest military organization in the U.S., starting in 1636. Thank you for being Always Ready, Always There. https://t.co/1s5XazmuO8","date":"Mon Dec 13 15:02:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This week, I joined guest host Chris Berg on \"What's On Your Mind\". We discussed the supply chain crisis and the STOP the GRINCH Act, inflation, and government spending. You can listen to the full interview here. https://t.co/v9Kg9CfaYj","date":"Fri Dec 10 21:31:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Yesterday, the Nicaraguan dictator broke all ties with #Taiwan and said they only recognize the communist Chinese government. @SpeakerPelosi should put my #bipartisan bill HR 6069 on the Floor ASAP so we can promote new international ties with Taiwan and prevent their isolation.","date":"Fri Dec 10 16:50:33 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Inflation has jumped to the highest level in almost 40 years. Prices keep going up on everything, and yet the Left wants to spend even more to push their socialist agenda. Now is not the time for out of control government spending! https://t.co/F1Yt67l4jJ","date":"Fri Dec 10 15:34:05 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last weekend, my staff attended the @HomesForOurTrps Key Ceremony for Army SPC Lucas Schmitz and his family. MN and the nation are eternally grateful for Specialist Schmitz's sacrifice and continued service to his nation and community https://t.co/nNv9O2fp6y","date":"Tue Dec 07 19:25:22 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"On the 80th anniversary of the attack on Pearl Harbor, let us take a moment to remember the 2,403 Americans who were killed and to thank the Greatest Generation who fought for freedom in WWII https://t.co/ZetEffEhTB","date":"Tue Dec 07 15:34:33 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Tonight marks the last night of #Hanukkah! I hope for a joyous end of the holiday to all those celebrating, especially for our friends in #Israel https://t.co/ziw1MDXWvY","date":"Mon Dec 06 19:20:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks @TheJournalMN New Ulm you're absolutely right - these bills did not have rural Minnesota's interests in mind! I'll never stop looking out for #MN07 https://t.co/CjwH275hQJ","date":"Mon Dec 06 17:18:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today marks the two year anniversary of the tragic UH-60 Blackhawk crash that killed Charles P. Nord, James A. Rogers Jr., and Kort M. Plantenberg. This week, along with @RepTomEmmer , I will be proposing bills to rename post offices in their honor. https://t.co/Tk0JAPok6L","date":"Sun Dec 05 20:15:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"A disappointing jobs report when there should be a surge in seasonal hiring. I guess this is what Biden meant when he said Americans should \"lower expectations\" https://t.co/EISOhX8BxP","date":"Fri Dec 03 15:47:33 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"@WFreedomnexus @DanCrenshawTX Absolutely! There's a Jones Act waiver in the STOP the GRINCH Act https://t.co/NnFpn8NJqU","date":"Thu Dec 02 15:47:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was honored to be a part of history today at the #EmpowerWomenPromoteLife rally during the opening arguments of #Dobbs v JWHO. MS has taken a courageous step towards bringing the US into the modern world and protecting life. Pray #SCOTUS makes the right call! https://t.co/hvIuWY31IB","date":"Wed Dec 01 22:14:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I'll be speaking at the #EmpowerWomenPromoteLife Rally outside of the Supreme Court on December 1st ahead of the #Dobbs v. JWHO Oral Argument and I hope to see you there! If you can't make it in person, you can use this link to host your own watch https://t.co/nQ8AqR79ut https://t.co/HlCoSXEDkF","date":"Mon Nov 29 20:46:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy Thanksgiving! https://t.co/fVcR3GUMyK","date":"Thu Nov 25 16:16:14 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Yesterday, I introduced the Promoting Ties with Taiwan Act with @RepScottPeters, a #bipartisan bill that will encourage growth of relations between #Taiwan and new international partners. The full text of the bill can be read here https://t.co/lXWhxATaDJ","date":"Wed Nov 24 16:01:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last weekend, I had the opportunity to speak at the @MNFarmBureau Convention, following the election of Dan Glessing (pictured) as president and #MN07 resident Carolyn Olson @Westacre2CJ as VP! Congratulations to you both! https://t.co/ereO3PeIPY","date":"Tue Nov 23 17:43:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Adding #Israel to the list of 40 ally countries participating in the VWP will benefit the US economy and national security while further strengthening the unique US-Israel relationship. I’m proud to be a lead co-signer on this bipartisan letter to @SecBlinken and @SecMayorkas","date":"Tue Nov 23 16:03:22 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last week, I joined @senmikelee and introduced the #STOPtheGRINCHAct in the House to alleviate the supply chain crisis\nYou can get more information on my website:  https://t.co/OSQSah19RV https://t.co/AvSc6s709Q","date":"Mon Nov 22 19:09:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"In the spirit of Thanksgiving, @John_Burkel and I joined @westerncaucus Chairman @RepNewhouse on his podcast, A Voice for Rural America, to talk all things turkey! You can listen here https://t.co/JWkxzfzHGv","date":"Mon Nov 22 16:38:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Good luck to the @BemidjiState #Beavers tomorrow when they play @AugustanaSD in the @NCAAFootball Tournament for the first time EVER #MN07 https://t.co/mU7b7mxbtK","date":"Fri Nov 19 18:29:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a delicious lunch with State Senator Jeff Howe, and State Rep Lisa Demuth at Queen Bee's Bar &amp; Grill in #Paynesville! Thank you to Doris and her daughters for the warm welcome to your family-owned restaurant! #tbt #MN07 https://t.co/V0V6iuGhoK","date":"Thu Nov 18 19:11:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Have a listen to the latest episode of \"At The Table\" by @MedicalAlley where I have a conversation with Jessica about the healthcare challenges facing rural Minnesota https://t.co/3VXRLnYhBR","date":"Wed Nov 17 21:46:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Great news for our farmers!","date":"Wed Nov 17 17:53:41 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a great conversation with @Biodiesel_Media. They work to create sustainable biodiesel and renewable diesel industry growth through education, communication, and technical and quality assurance programs. Thanks for taking the time! https://t.co/QWhI0eo7qN","date":"Wed Nov 17 17:44:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Farm Bureau sent me a letter urging me to vote AGAINST BBB. They understand that the spending and increased taxes proposed (and make no mistake - your taxes will go up) will make life in rural America worse, not better. Don't worry @FarmBureau, I hear you loud and clear.","date":"Wed Nov 17 17:20:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Big thanks to Randy Aberle for coming and speaking at the CEEC subcommittee hearing! @HouseAgGOP","date":"Tue Nov 16 22:22:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you for the support @RepTomEmmer @RepHagedorn  @RepPeteStauber @RepAngieCraig  @RepDeanPhillips @BettyMcCollum04 @Ilhan","date":"Mon Nov 15 21:34:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"These bipartisan bills would rename the #Vergas Post Office after Jon Glawe, a veteran who dedicated 36 years to delivering mail in Vergas, taking over the route of his late father, https://t.co/p4lt3Y0JKK","date":"Mon Nov 15 21:34:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"and the #Oklee Post Office would be named in honor of Cornelia \"Coya\" Knutson, the first female elected to Congress from Minnesota. #MN07 https://t.co/q12pzK06t1","date":"Mon Nov 15 21:34:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I’m proud to have the support of the #Minnesota House delegation in renaming two post offices after local heroes.","date":"Mon Nov 15 21:34:26 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you Redwood Falls for including me in your wonderful #VeteransDay program yesterday! #MN07 https://t.co/knG932aJPA","date":"Fri Nov 12 19:26:01 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the #OliviaMN @AmericanLegion Post 186 for having me at your #VeteransDay celebration. It was so great getting to talk with some of you over coffee after the program. #MN07 https://t.co/rxVNqhChfc","date":"Fri Nov 12 17:17:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy Veteran's Day! This country is forever thankful for your service. https://t.co/n22FZrsqIh","date":"Thu Nov 11 18:13:53 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Consumer Price Index has hit a 30-YEAR HIGH, jumping 6.2% last month. Inflation has gone UP every month of Biden's presidency and Americans are paying more for just about everything! The proposed reconciliation package will only make this problem worse https://t.co/BOzbFyzZu0","date":"Wed Nov 10 21:13:07 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy 246th birthday to the US Marine Corps! As Ronald Reagan said, \"Some people live an entire lifetime and wonder if they ever made a difference in the world, but the Marines don't have that problem.\" @USMC #OohRah","date":"Wed Nov 10 14:49:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations @MN_Chamber on being named 2021 State Chamber of the Year! A very well-deserved honor.","date":"Tue Nov 09 21:04:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"#MN07 is proud to be the home of @farmmillennial! His family works together on a YouTube channel that gives a glimpse into farm life and they donate a lot of the profits from the channel to farm families in crisis https://t.co/lDq6bpGewO","date":"Tue Nov 09 19:23:48 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the Pioneer Equipment Dealers Association for having me at your conference yesterday! It was great meeting you all and speaking with you about agriculture, supply chain concerns, vaccine mandates, and rural broadband. Thank you so much for all the work you do. https://t.co/QwNTeTauna","date":"Tue Nov 09 16:56:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to cosign this letter with @RepHagedorn and @RepJohnRose - It's so important we reduce the burden on truckers and motor carriers who are working nonstop to delivery goods and stock America's shelves","date":"Fri Nov 05 18:53:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you @MN_Chamber for coming to talk with me about everything from infrastructure to immigration! https://t.co/a57rIZZVuq","date":"Fri Nov 05 16:30:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to have @prairieorganic - made with corn provided by #MN07 ‘s own @westacre2cj - at the awesome #FarmCreditMartketplace last night. Their #AgCountryCocktail was a big hit! @farmcredit @agcountry","date":"Thu Nov 04 16:47:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I will keep working towards continuing hours-of-service flexibility and anything else I can to turn this #SupplyChainCrisis around","date":"Thu Nov 04 16:41:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"@AgCountry it was great talking with you all today - come back anytime!","date":"Wed Nov 03 21:39:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you so much for having me for breakfast @farmcredit ! What a great way to start my day.","date":"Wed Nov 03 21:31:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The supply chain crisis is no laughing matter. Americans are facing empty shelves and increasing prices on everyday needs.","date":"Wed Nov 03 17:09:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"@FarmCredit thanks so much for having me this morning! It was great to start my day talking ag policy with so many smart women.","date":"Wed Nov 03 14:33:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"@cor_beck22 @FischbachMN7 Thanks Cory! So happy to have you on the team!","date":"Wed Nov 03 13:44:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congrats to Glenwood State Bank for being one of just 5 businesses selected as winners of the Minnesota Family Business Award! #MN07\nhttps://t.co/O2J5gxrNhJ","date":"Tue Nov 02 22:00:48 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Biden's supply chain, workforce, and energy crises are driving up prices for farmers, distributors, and ultimately the consumer resulting in the most expensive Thanksgiving ever. https://t.co/D2yFaQnAwk","date":"Tue Nov 02 18:38:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"#MN07 Shout out! Last week, about 80 #Minneota high school students raked and cleaned lawns across their town as part of #CommunityServiceDay. Way to set a great example for your community! https://t.co/YIPfMpGAgT","date":"Mon Nov 01 20:58:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This #BreastCancerAwarenessMonth we remember those who fought, thank those who treated, and celebrate those who survived https://t.co/eFT74J0Eqr","date":"Fri Oct 29 17:58:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Are you interested in learning about the legislative process and gaining valuable experience working in Congress? There's still time to apply for Spring internships in my Washington, D.C. and district offices! Click below if you’re interested!\n\nhttps://t.co/wQb28mAaW0","date":"Fri Oct 29 16:14:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to all first responders for protecting citizens across #MN07 and the country. The communities you serve are so grateful that you put your lives on the line each and every day. #FirstRespondersDay https://t.co/lyOOTYFFtZ","date":"Thu Oct 28 20:37:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Todd &amp; Louise Malecha and their family for hosting a discussion on agriculture, workforce, and supply chain issues at their farm, Malecha Enterprises. And thank you @SenWestrom, @RepMaryFranson, and Pope County Commissioner Cody Rogahn for attending. #MN07 https://t.co/pCqQGXQXQa","date":"Thu Oct 28 17:43:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There's only a handful of days left to participate in the Congressional App Challenge! Don't forget to submit your app by November 1st. Good luck! #MN07\nhttps://t.co/zPhzJgkCer","date":"Wed Oct 27 19:04:41 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was proud to support @RepLisaMcClain's bill to award the Congressional Gold Medal to the 13 men and women who lost their lives in Afghanistan. This is the highest expression of national appreciation we can bestow, and I wish we could do more. They will never be forgotten.","date":"Tue Oct 26 19:08:20 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is the last week to apply for a nomination to be a candidate for appointment to a military academy! If you're interested in a 2022 appointment, applications are due October 30. Click below to apply and good luck! https://t.co/PIBpw5W63e #MN07","date":"Tue Oct 26 18:26:26 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy 104th birthday to Hazel Krause! Your friendly attitude and love for those around you make you such an inspiration. #MN07 https://t.co/uGs9zSfYlY","date":"Tue Oct 26 16:18:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I'm happy to sign this letter with @HouseJudiciaryGOP asking AG Garland to withdraw his memo and protect the First Amendment rights of parents","date":"Mon Oct 25 21:14:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you @GOPLeader for hosting this important round table to fight for life as the radical Left is attempting to strip the Hyde Amendment from spending and normalize abortion on demand. I'm proud to be a part of this fight as co-chair of the #ProLife Caucus","date":"Fri Oct 22 19:12:33 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I’m accepting applications for a two-year paid Wounded Warrior Fellowship until December 31! If you're interested in a fellowship in either of our district offices, visit https://t.co/0CjCGPdsvt #MN07 #woundedwarrior","date":"Fri Oct 22 18:24:05 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I hope this is true and the #Democrats don't cave to their radical minority... again.\nhttps://t.co/elx5yi2qkx","date":"Fri Oct 22 17:03:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Parents are speaking out because they know mandatory #CRT is a bad idea. Why does the Left want to silence them? #Democrats blocked us from even showing this video in yesterday's hearing with #DOJ AG Merrick Garland","date":"Fri Oct 22 15:05:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last night, along with @RepSamGraves, we sent a letter to @POTUS on getting his priorities straight. Before we consider the crazy #Democrat social spending bills, we have to address the supply chain crisis","date":"Thu Oct 21 20:25:01 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the Students United board members Clara Kuerschner, Nico Arias, and Victor Ayemobuwa for coming to my office and for continuing to advocate for over 65,000 students attending #Minnesota’s state universities! It was great talking with you all. https://t.co/B9FuuTk0Bb","date":"Thu Oct 21 18:30:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We’re still accepting applications for #SpringInternships in my D.C. and District offices. This is a great opportunity for anyone interested in learning about how Congress works by getting first hand experience! https://t.co/wQb28mAaW0\n#MN07","date":"Thu Oct 21 15:40:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There's still time for middle and high school students from MN's 7th district to participate in the annual Congressional App Challenge! Apps must be submitted by November 1. Click below for more information, and good luck! #MN07  https://t.co/zPhzJgkCer","date":"Wed Oct 20 21:54:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The empty shelves we're seeing across U.S. are a daily reminder that we to take action to reduce our dependence on foreign supply chains, especially from governments like China's. Proud to extend tax advantages and encourage U.S. production with @RepChipRoy &amp; the BEAT CHINA Act","date":"Wed Oct 20 21:16:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to join @RepDustyJohnson and a bipartisan group of my colleagues in introducing legislation establishing a cattle contract library that will provide #cattle producers important market data and promote greater price discovery.","date":"Wed Oct 20 18:08:11 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last week, I got to join the @LigniteCouncil on their podcast, #Mined. It was so great talking to Kate and Geoff about realities facing rural Minnesota like the need for more reliable energy and less regulation. \nCheck out the whole interview here https://t.co/dKReQrsXga","date":"Wed Oct 20 16:10:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was honored to speak at the memorial service for Earl Halvorson, USN, where an updated headstone was unveiled. He enlisted in the Navy at just 17. It was wonderful to meet the family of this hero, especially his sister, Elaine. Read more here. https://t.co/71zNyFXUAJ https://t.co/RlwZmdJOAN","date":"Tue Oct 19 19:51:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As #MN07 continues to face workforce shortages, especially in #agriculture, it's great to see our technical colleges graduating enthusiastic and experienced young people https://t.co/RbDx1J27OP @RidgewaterColl @NorthlandCTC","date":"Tue Oct 19 18:58:54 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The deadline to apply for a nomination to be a candidate for appointment to a military academy is October 30! If you're interested in a 2022 appointment, I encourage you to apply now. For more information and for the application, click below. \nGood luck! \nhttps://t.co/PIBpw5W63e","date":"Tue Oct 19 13:58:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Shoutout to an amazing #MN07 company! #ActionTrackChairs made in #Marshall are all terrain power chairs that are giving people the chance to do things – like navigate this corn maze – in a way they never could before!  https://t.co/tp79dCviDi","date":"Mon Oct 18 18:29:20 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today we remember the life of Colin Powell. He was a true American hero whose legacy spanned four administrations and inspired thousands of lives. My heart is with the Powell family as they mourn the loss of a profound human being.","date":"Mon Oct 18 15:54:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The @MnDOT Commissioner Margaret Anderson Kelliher and her staff visited my office while they were in D.C.  Thank you for coming by to talk all things highway! https://t.co/J7eQbOs9QU","date":"Fri Oct 15 21:21:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The deadline to apply for a two-year paid Wounded Warrior Fellowship in both of our district offices is December 31, 2021. We would love to have you join the team! For more information, and to apply, visit https://t.co/0PV8ioe73o #MN07 #woundedwarrior","date":"Fri Oct 15 17:18:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Democrat #energy policies all but guarantee the price at the pump will continue to rise as we’re forced to ask foreign adversaries for help. I’ve cosigned a letter asking @POTUS to reverse his anti-American agenda and put American producers back in control of American energy https://t.co/4ChjRm32XF","date":"Fri Oct 15 15:16:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Are you interested in gaining first-hand experience working in a Congressional office? If so, you should apply to work with me as an #intern this spring in my D.C. or District offices! \n#MN07 https://t.co/wQb28mAaW0","date":"Thu Oct 14 17:00:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I attended the 100th anniversary of @First_Dist, an independent dairy cooperative in #Litchfield. It was great meeting CEO Bob Huffman, board president Josh Barka, the 68th Princess Kay of the Milky Way, &amp; the over 500 people that got to share this exciting milestone! #MN07 https://t.co/jQKiCtsx8a","date":"Wed Oct 13 16:12:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Middle and high school students from MN's 7th district are invited to participate in the annual Congressional App Challenge! Apps must be submitted by November 1. Click below for more information, and good luck! #MN07 https://t.co/zPhzJgkCer","date":"Wed Oct 13 13:28:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy #NationalFarmersDay to all the hard working men and women in #MN07 and across the country. I'm proud to be a voice for you on @HouseAgGOP. #ThankAFarmer today and every day! https://t.co/OGOUL1Jleq","date":"Tue Oct 12 17:41:09 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I have the distinct honor of nominating candidates for appointment to #MilitaryAcademies! If you or someone you know is interested in a 2022 appointment, follow the link below. Applications must be postmarked no later than October 30. Good luck! https://t.co/PIBpw5W63e","date":"Tue Oct 12 16:34:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the @MNPoliceAssn for coming by my office in D.C. to have a great conversation. The Association work towards passing laws that support public safety and against laws that harm the police profession. https://t.co/CVwhpQxnkk","date":"Tue Oct 12 15:01:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy Columbus Day, America! https://t.co/SELhwOQ7hd","date":"Mon Oct 11 19:25:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last month, I got to see some of the things Thief River Falls Regional Airport and Northland Community &amp; Tech College are working on including the drone program at one of the only accredited Unmanned Aerial Systems maintenance programs in the country. #NCTC #MN07 https://t.co/TyVEE7zRLy","date":"Sat Oct 09 21:30:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The @MinnesotaTurkey Growers Association came to visit by office in D.C. \nDid you know that Minnesota has the largest number of independent turkey farmers and the largest production of turkey in the United States? And that they’re primarily grown in the 7th district? https://t.co/nq1xoJy2vM","date":"Fri Oct 08 20:51:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I’m accepting applications for a two-year paid Wounded Warrior Fellowship in both of our district offices! The deadline to apply is December 31, 2021. For more information, and to apply, visit https://t.co/0CjCGPdsvt #MN07 #woundedwarrior","date":"Fri Oct 08 18:08:35 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a ton of fun touring @FarNorthSpirits near #Hallock with Cheri Reese and Michael Swanson. They are one of just a handful of distilleries that actually harvest their own grain, so their products go straight from field to glass! https://t.co/HUPvQlWMm0","date":"Thu Oct 07 20:11:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We’re accepting applications for #SpringInternships in my D.C. and District offices. Click below if you’re interested in gaining valuable experience learning how Congress works and working with me! \nPhoto below is D.C. Summer interns, Morgan and Val!\n#MN07\nhttps://t.co/wQb28mRLNy https://t.co/8onsICKgz9","date":"Thu Oct 07 14:55:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great talking with @NCTAconnect and @ConnectCTC about their great work getting broadband to rural Minnesota and ways we can ensure the last mile of the digital divide is connected!","date":"Wed Oct 06 19:58:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I cosigned a letter to @POTUS in July to reopen the Canadian border. Vaccinations are up. COVID is down. Canada is open. Canadians can fly into the U.S. What will it take to convince the Admin it’s safe for the thousands that live and work on the border to go back to their lives?","date":"Mon Oct 04 21:09:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I’m sorry, I must have misheard. You meant to say, “Life is a blessing, life is a gift, abortion is one of the biggest tragedies in our nation”, right?","date":"Thu Sep 30 20:08:33 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Are you interested in learning about the legislative process and gaining valuable experience working in Congress? We are now accepting applications for Spring internships in my Washington, D.C. and district offices! Click below if you’re interested! https://t.co/Zt5otxRxI2","date":"Thu Sep 30 14:15:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The #Line3 Replacement Project is complete! The new pipeline begins operations Friday. Thank you to the 4,000+ workers who worked tirelessly to accomplish this task. Your work will improve the health, safety, and livelihoods of the people that live and work along the pipeline.","date":"Wed Sep 29 20:49:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to #Medtronic! Out of 3,382 nominations, they are one of just 15 employers chosen to receive the 2021 Secretary of Defense Employer Support Freedom Award, the highest U.S. government honor to employers for support of #NationalGuard and Reserve employees. https://t.co/ADyGkteNdr","date":"Tue Sep 28 21:13:09 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Tomorrow, the House of Representatives will consider the Women’s Health Protection Act, or as it should be called, the Abortion on Demand Act. My colleagues and I spoke out against this attack on states' rights and innocent life on the House Floor last night. https://t.co/Pa6BqS8cw8","date":"Thu Sep 23 22:59:23 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks for having me!","date":"Thu Sep 23 13:14:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to stand with you!","date":"Thu Sep 23 13:13:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Amazing people doing amazing things, right here in our own communities. Well done, Amy!","date":"Tue Sep 14 14:27:04 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/ysuhkbaged","date":"Sun Sep 12 01:37:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was an honor to be in Marshall today for a ceremony at their 9/11 Memorial Park. \n\nWe will never forget the lives lost on September 11, 2001, nor we will we forget the incredible displays of heroism and bravery by the American people. https://t.co/Pdf3zZa2Qe","date":"Sun Sep 12 01:37:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We will never forget the lives lost on the September 11, 2001 terrorist attack. \n\nMay God bless America. https://t.co/Ybb183VKMf","date":"Sat Sep 11 14:19:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to CEO Kevin Wald and the folks at SpecSys in Granite Falls for the meeting and tour. We discussed the impacts of the workforce shortage, inflation, high costs of health insurance, and the importance of policy that reflects the needs of rural communities. https://t.co/QGA7SkJLbp","date":"Fri Sep 10 21:54:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I appreciate CEO Tom Schabel and the great employees at @a_industries for the meeting &amp; tour! We talked about the importance of manufacturing jobs for our rural communities, the need for workforce training to address skills gaps, inflation, and more. Thank you! https://t.co/vGmJdMxASa","date":"Fri Sep 10 01:18:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is an attack on the civil liberties of every American. The federal government has no authority to force companies and their employees to be vaccinated.\n\nIs this the “unity” President Biden promised? We’re still waiting.","date":"Thu Sep 09 21:27:09 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to CHS in Herman for the meeting and facility tour yesterday! We talked about trade, the farm bill, conservation, broadband, and much more. @chsincherman @CHSInc https://t.co/c0aLtI4i4g","date":"Wed Sep 08 18:32:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Democrats continue to push their extreme pro-abortion agenda—Speaker Pelosi even admitted that allowing taxpayer-funded abortions is a \"priority\" for Democrats.\n\nOutrageous! Taxpayer dollars should NOT be used to fund abortions! #HydeSavesLives https://t.co/uiKvtY9xFF","date":"Wed Sep 08 16:02:23 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden's economic crisis continues:\n\n❌ The August jobs report fell FAR short of expectations, missing the mark by 500,000+ jobs—the weakest report of Biden's presidency.\n❌ Inflation is at a 30-year high.\n❌ Americans are paying more for just about everything. https://t.co/JMelvSvHKg","date":"Tue Sep 07 17:46:41 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Have a great first day of school!","date":"Tue Sep 07 14:36:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"For most, tomorrow is the first day of school. Wishing all students, teachers, and staff a great school year! https://t.co/kqlHqqrj21","date":"Tue Sep 07 00:23:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am thankful for all the hardworking men and women across Minnesota‘a 7th District and beyond. Happy #LaborDay! https://t.co/N9PjCfdWNp","date":"Mon Sep 06 18:16:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"People in Minnesota support Line 3 because Line 3 supports Minnesota’s energy needs! 3/3","date":"Sat Sep 04 21:33:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"They say it's about the impacts of the pipeline on Indigenous people, but they have not met with the many Native American contractors who are currently on-site assembling the pipeline. #Line3 1/\nhttps://t.co/989C4snGSM","date":"Sat Sep 04 21:33:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"They say it's about tribal sovereignty, but they fail to note the agreement w/ Leech Lake Band of Ojibwe &amp; Fond du Lac Band of Lake Superior Chippewa.\n\nThey say it's about the people, but have not engaged w/ the cities, counties, and local businesses that benefit from #Line3. 2/","date":"Sat Sep 04 21:33:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Now, Democrats are pushing partisan legislation to enshrine their pro-abortion agenda into law—a move out of touch with the strong majority of Americans who oppose pro-abortion extremism.\n\nI will continue to defend the right to life for all, from conception until natural death.","date":"Fri Sep 03 15:27:11 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Abortion is one of our nation’s biggest tragedies. But this week’s SCOTUS decision allowing the Texas Heartbeat Act to remain in effect—protecting unborn children from abortion after a heartbeat is detected—is incredibly encouraging, and I am optimistic. https://t.co/xknx1WR2mp","date":"Fri Sep 03 15:27:11 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The \"Squad\" is headed to Minnesota to continue their misguided #Line3 protest.\n\nAfter the litany court decisions affirming Line 3, and with construction &gt;90% complete, a visit by a few out-of-town congresswomen isn’t going to stop the most studied pipeline project in MN history.","date":"Thu Sep 02 16:31:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Enjoyed being at @uponor’s facility in Hutchinson. They manufacture PEX pipes, which are used in residential &amp; commercial plumbing and other areas. I was impressed by their investment in the community and their commitment to workforce training in the trades. Thank you! https://t.co/MRLyumGC95","date":"Wed Sep 01 23:30:03 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"People in Minnesota support Line 3 because Line 3 supports Minnesota’s energy needs.\n\nRead the full response from me, @RepPeteStauber, and @RepTomEmmer: https://t.co/CkNaACxf9O","date":"Wed Sep 01 20:35:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"They say it’s about impacts on Indigenous people, but they have not met w/ the Native American contractors assembling the pipeline. They say it’s about tribal sovereignty, but they fail to note agreements w/ Leech Lake Band of Ojibwe &amp; Fond du Lac Band of Lake Superior Chippewa.","date":"Wed Sep 01 20:35:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This weekend, a group of far-left Democrats will visit Minnesota to protest the Enbridge Line 3 Pipeline Replacement Project.\n\nEven after a litany of court decisions affirming the project, and even with construction 90% complete, the misguided push to stop the pipeline continues.","date":"Wed Sep 01 20:35:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I have a list of the state and federal resources available to farmers, ranchers, communities, and businesses hard hit by the extreme drought: https://t.co/oxJnKqzHMF","date":"Wed Sep 01 17:10:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Some crops that are irrigated may look good, but most have significantly reduced yields or will be a loss. Much of the corn crop is being chopped due to losses, but also because it is needed for livestock feed as a result of hay and pasture shortages. https://t.co/b6KuVXCc61","date":"Wed Sep 01 17:01:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"After, Ben joined Blair &amp; Deb Hoseth and John Swanson, board members for @mncorn, on a crop and pasture tour in Mahnomen, Norman, and Polk counties. The impacts of the drought were abundantly clear. https://t.co/dVFlx2uVo7","date":"Wed Sep 01 17:00:26 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Ben, my district director, spoke at the Wild Rice Stockmen’s Association drought resource meeting in Waubun about supporting farmers during the drought and increasing meat processing facilities. https://t.co/f9htoT1Kv6","date":"Wed Sep 01 17:00:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Programs like TigerPath at Hutchinson High School are the future—providing students with the training they need for a career they want, all in partnership with local businesses. Critical for developing a skilled workforce! https://t.co/PHFBS88yhT","date":"Tue Aug 31 22:38:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Hundreds of American citizens have been left behind enemy lines in Afghanistan because of President Biden's disastrous troop withdrawal—and the Biden Administration has no plan to bring them home.\n\nWe don't leave Americans behind.","date":"Tue Aug 31 19:20:41 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Hutchinson HS’s TigerPath is a tremendous partnership with local industries that helps students learn the skills needed to succeed in today’s workforce. Career &amp; technical education is the way of the future!\n\nThanks for having me!","date":"Tue Aug 31 18:42:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I saw firsthand the great work being done at the Central Lakes College Ag and Energy Center during their annual Field Day. The agricultural industry is ever-changing, and their research is making a big difference as we look to the future. @clcmnedu https://t.co/Dvt9Dxo4Pe","date":"Mon Aug 30 18:52:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This morning’s sunrise was stunning! #mn07 https://t.co/MjKQionZQy","date":"Mon Aug 30 16:04:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations on a beautiful baby boy!","date":"Mon Aug 30 13:19:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"These are American heroes.","date":"Sat Aug 28 01:36:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/dldYbLIm3A","date":"Fri Aug 27 23:12:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was a wonderful day in Staples at the Central Lakes College Ag &amp; Energy Center Field Day. A special thanks to Dr. Hara Charlier, Keith Olander &amp; Cory Detloff for their hard work. Great to see MN Ag Commissioner @ThommyPetersen, State Rep John Poston &amp; so many others! @clcmnedu https://t.co/3I7thntNIM","date":"Fri Aug 27 23:12:20 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My district staff attended a @MNNationalGuard congressional staff briefing yesterday, where they toured Camp Ripley, as well as Army Aviation Support Facilities in Saint Paul and Saint Cloud.\n\nThank you to our National Guard—today and every day! https://t.co/tLO0MVw4d8","date":"Fri Aug 27 16:11:26 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Bemidji Veterans Home groundbreaking signals the beginning of a new era for Northland vets https://t.co/opGdlfxDBh","date":"Fri Aug 27 13:56:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/E3ROrCUh24","date":"Thu Aug 26 20:20:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was wonderful to be at the groundbreaking of the new veterans home in Bemidji today! Thanks to the incredible work of so many in the community, area veterans will soon be able to live and receive care much closer to home. https://t.co/NJ2yxXf686","date":"Thu Aug 26 20:20:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Anna Euerle of Litchfield, Minnesota's newest Princess Kay of the Milky Way!","date":"Thu Aug 26 17:56:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was horrified to learn of the attack in Kabul. Please join me in praying for our troops, allies, and Americans still stranded in Afghanistan.\n \nWe must leave no American behind!","date":"Thu Aug 26 16:30:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to the Green Plains ethanol plant near Fergus Falls for inviting my district office staff to its customer appreciation event today! https://t.co/vO2Fk4zqpz","date":"Wed Aug 25 20:17:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Welcome back, Beavers! @BemidjiState is at full capacity for the first time since March 2020.\n\nWishing all area students a great year! https://t.co/K4MYwpLnKR","date":"Wed Aug 25 17:40:35 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/Ya8DnFAlNk","date":"Tue Aug 24 22:50:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I voted against HR 4—an unprecedented power grab that empowers the attorney general to bully states and strips state and local governments of the ability to manage their own elections.\n\nI will continue to push for election safeguards that make it easy to vote and hard to cheat.","date":"Tue Aug 24 22:50:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Democrats are using smoke and mirrors to push through TRILLIONS of dollars in new spending and an unconstitutional federal takeover of elections.\n\n❌ Their budget resolution (written by Bernie Sanders) calls for the HIGHEST sustained spending levels in American history! https://t.co/GrA0d0F0Ss","date":"Tue Aug 24 18:29:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My staff toured the site of Habitat for Humanity of Douglas County's 2021 Women's Build Home. The home will eventually be occupied by a local family in need.\n\nThank you, @HFHdouglasCoMN, for all you do to serve our communities. @HabitatMN @Habitat_org https://t.co/9XUbctQOXZ","date":"Tue Aug 24 14:55:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My district office staff attended the groundbreaking ceremony for the Montevideo Veterans Home today. I was sad to miss it due to votes in DC.\n\nA long time coming and a true community effort. Congrats to committee chair Marv Garbe and all area veterans. Thank you! https://t.co/HIE4v0svom","date":"Tue Aug 24 01:33:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We had a great turnout at our community town hall in Warroad on Friday! Thanks to all those who came out to join @SenMarkJohnson, @RepJohnBurkel, and me—and thanks to community leaders for organizing the event and hosting us. https://t.co/FqwZXCIUkE","date":"Mon Aug 23 21:56:54 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We also met with folks from @TheMarvinBrand up in Warroad, including CEO Paul Marvin (virtually), Marvin Windows President Darrin Peterson, and SVP Rick Trontvet. Truly a pleasure! https://t.co/Ir3He2M0cL","date":"Mon Aug 23 19:42:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Mark Bertilrud, Betsy Theriault, and the board members of the Warroad Senior Living Center for the tour and discussion! They have truly set the standard for how a facility like this should be built and operated. https://t.co/5LA9q6cARf","date":"Mon Aug 23 18:53:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I sat down with members of Warroad Community Development, including interim president/CEO Cyndy Renfrow and other community members, for a discussion on parks &amp; trails, broadband, transportation, and more. Thanks to @SenMarkJohnson &amp; State Rep. John Burkel for joining us. https://t.co/x3dg1wHJxn","date":"Mon Aug 23 17:54:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is exasperating, particularly after Canada opened its border for non-essential travel earlier this month.\n\nI will continue pushing the Biden Administration to take meaningful action to resolve this once-and-for-all. https://t.co/HQF0qvINMj","date":"Mon Aug 23 17:30:40 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Great to be in Warroad on Friday! Thanks to Mayor Bob Marvin, City Administrator Kathy Lovelace, and city council members for hosting me, @SenMarkJohnson &amp; State Rep. John Burkel. We talked about the workforce shortage, infrastructure, ambulance reimbursement rates, and more. https://t.co/Kie1XhlXlL","date":"Mon Aug 23 17:01:53 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My staff, along with State Sen. Gary Dahms and State Rep. Paul Torkelson, visited Schult Homes in Redwood Falls last week—a homegrown business that has become an industry leader in quality, affordable manufactured and modular homes. https://t.co/iISutJLnG3","date":"Mon Aug 23 14:35:26 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was wonderful to visit the Northwoods Pregnancy Center in Bemidji. They are doing amazing work helping women, men, and families facing unplanned pregnancies and other challenges. Thank you! https://t.co/nUHAxdTvHM","date":"Mon Aug 23 00:35:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/96MWH11gLf","date":"Sun Aug 22 18:48:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to LaValley Industries in Bemidji for hosting me, @RepPeteStauber, @SenUtke, and @SenatorEichorn! They are an impressive team of innovators who help others solve their problems—and with their products, they send a piece of Bemidji around the world. https://t.co/UEm71Rzscq","date":"Sun Aug 22 18:48:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I stopped by Jennie-O, the second-largest and most profitable turkey company in the world, in Willmar this week. We talked about their workforce shortage—due to extra unemployment benefits, they’re short 350 employees. \n\nThanks to State Rep @DaveBakerMN for joining us! https://t.co/81f2b93Pgi","date":"Fri Aug 20 16:19:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was proud to be with @MarcusConst in Willmar yesterday as they received the Department of Defense Freedom Award. They are one of just 15 employers nationwide honored for their support of National Guard and Reserve employees and their families. Congratulations! https://t.co/VGVem5RcDS","date":"Fri Aug 20 13:58:05 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Shelly with Runestone Museum and Tara with the Alexandria Lakes Area Chamber of Commerce for the visit! https://t.co/2WVrP6OT0U","date":"Fri Aug 20 13:15:12 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Commissioner Keith Englund and Fair Board Director Brett Grinager for showing me around the Douglas County Fair! https://t.co/CWkjWOcMmN","date":"Fri Aug 20 01:28:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the men and women of the @CapitolPolice and the many other law enforcement agencies that responded to the situation near the Capitol today.\n\nGod bless our law enforcement!","date":"Thu Aug 19 21:36:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"On Tuesday, I visited Hidden Bison Ranch, a family-owner bison ranch near Sauk Centre, for a tour and discussion. Thanks to the Minnesota Bison Association for inviting me and to the Meyer family for hosting! https://t.co/1k7URULUJL","date":"Thu Aug 19 15:47:21 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There are numerous federal and state assistance programs available to farmers, ranchers, communities, and businesses hard hit by the drought. Go to https://t.co/oxJnKqzHMF for more information.","date":"Thu Aug 19 15:13:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I visited Dorrich Dairy, a fourth generation dairy farm near Glenwood, for a tour of their robotic milking facility and a discussion on dairy industry priorities. Thanks to @SenWestrom &amp; State Rep. Paul Anderson for joining us! https://t.co/p7zC8AVEuQ","date":"Thu Aug 19 14:53:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to these quick-acting Minnesota State Patrol troopers, mom and baby are doing just fine. Thank you, law enforcement! @MnDPS_MSP https://t.co/LLSYMxYOOW","date":"Wed Aug 18 13:42:33 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had the opportunity to speak at the Minnesota Ag Leadership Conference yesterday—a time for farmers, agribusiness leaders, policy experts, and elected officials to collaborate on solutions to the challenges facing agriculture and our rural economies. Thank you! https://t.co/KKLCgaamRL","date":"Tue Aug 17 15:36:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great to get a firsthand view of the @FMDiversion project, which will provide permanent, reliable flood protection to an estimated 230,000 people in the Fargo-Moorhead area. https://t.co/MCT3Vz1sVz","date":"Mon Aug 16 20:36:26 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"What’s happening in Afghanistan is an embarrassment to our nation—a direct result of President Biden’s incompetence and his Administration’s mismanagement of our exit strategy in the Middle East.","date":"Mon Aug 16 13:13:48 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As this Administration’s recklessness puts American lives in danger, the president is nowhere to be found. The Biden Administration has abjectly failed in its duty to keep the American people safe, both at home and abroad.\n\nMay God bless our troops.","date":"Mon Aug 16 13:13:48 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This broadband infrastructure project near Alexandria will bring high-speed internet to hundreds of unserved and underserved customers. The project is funded by the Minnesota Border-to-Border Grant Program with a local match. Thanks to @SenWestrom &amp; @sen_inge for joining me! https://t.co/uBpsWbQEm6","date":"Sun Aug 15 22:53:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was glad to support the Border-to-Border Grant Program when I served in the Minnesota Senate, and access to broadband remains a top priority for me in Congress. Having a high-speed internet connection is essential for growing our rural communities!","date":"Sun Aug 15 22:53:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"In my district, one in five farms lack access to broadband internet. Our @HouseAgGOP Broadband for Rural America Act will not only invest in the necessary infrastructure, but also make sure broadband makes it right to peoples' doors. https://t.co/uaZXfeoIDi","date":"Thu May 20 18:20:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I met with Elliot, Dennis, and JR Christensen for a tour of Elden’s Fresh Foods in Alexandria. We had a discussion about the grocery industry and the importance of good economic and tax policies for sustaining local, family-owned businesses in rural areas. Thank you! https://t.co/vMHx96QYt1","date":"Fri Aug 13 17:06:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/9OabG65Muy","date":"Fri Aug 13 16:42:09 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to @USACEHQ Lt. Gen. Spellmon for hosting me, @SenJohnHoeven, and many other area officials for a tour of the Fargo-Moorhead flood diversion project. This project, more than a decade in the making, will provide permanent, reliable flood protection for the Red River Valley. https://t.co/u2Rug6eg7z","date":"Fri Aug 13 16:42:04 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Diversion Inlet &amp; Control Structure https://t.co/4vGdvt5PRI","date":"Thu Aug 12 15:13:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Red River Control Structure https://t.co/hR0ipPezmt","date":"Thu Aug 12 15:07:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Touring the Fargo-Moorhead flood diversion project this morning with @SenJohnHoeven, LTG Scott Spellmon, Moorhead Mayor Shelly Carlson, Fargo Mayor Tim Mahoney, West Fargo Mayor Bernie Dardis, and others. An important project for the region! https://t.co/5XbSdH76jq","date":"Thu Aug 12 14:57:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the wonderful folks at the Willmar @HomeDepot for the tour! I learned about the store and company, and had a discussion on workforce and supply issues. The enthusiasm of the employees, and their great customer service, was truly impressive! https://t.co/S2MQr25EUf","date":"Tue Aug 10 21:04:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Some good news: the Canadian border is finally open to vaccinated Americans.\n\nHowever, there is still work to do to get the border fully re-opened, and I will continue to push the Administration on making that happen. https://t.co/Vjpif5BYMt","date":"Tue Aug 10 19:05:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Jeff and Kelsey at @ThriftyWhite in Willmar for hosting me this morning! We discussed legislative priorities, how Thrifty White serves area patients and health care facilities, and some of the technology in use at their pharmacies. https://t.co/3mRDgV2aop","date":"Mon Aug 09 21:07:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I also toured Waters Edge Assisted Living in Clinton. Thanks for hosting us at your wonderful facility! https://t.co/IR3GN0MVHb","date":"Fri Aug 06 16:22:23 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is a tragic loss for the community. Thank you to the first responders from Clinton and throughout the region. I am grateful there were no fatalities or serious injuries. \n\nMy staff and I stand ready to assist in any way that we can as the community works toward recovery.","date":"Fri Aug 06 16:16:11 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I visited Clinton yesterday to tour the damage from the recent grain elevator fire. I was joined by State Sen.  @SenWestrom, State Rep. @JeffBacker, Mayor Greg Basta, Big Stone Co. Commissioner Wade Athey, Stevens Co.  EMS Director Dona Greiner, and others. https://t.co/QW2MkXmtPu","date":"Fri Aug 06 16:14:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congress has repeatedly acted to provide relief to the American people, including allocating $46 billion in rental assistance. With multiple safe and effective vaccines available to all who want one, it is time to stop disincentivizing people from getting back to work.","date":"Thu Aug 05 20:23:50 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Despite the Supreme Court’s clear ruling that the Biden Administration did not have the authority to unilaterally extend the eviction moratorium, Biden’s unelected bureaucrats defied the judicial branch and did it anyway. https://t.co/nw0PZvjVAp","date":"Thu Aug 05 20:23:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It ties the hands of landlords who are already reeling from the past 18 months, depriving them of any recourse to enforce rent obligations. Not only does this increase the likelihood of future shortages in affordable housing, it also stokes existing inflation in rental prices.","date":"Thu Aug 05 20:23:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Jane Goplen of Canby, who was just honored as the 2021 Woman Farmer of the Year at @MNFarmfest! #mn07 #Farmfest21","date":"Thu Aug 05 17:57:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had the privilege of speaking to the Clay County Farm Bureau last night at their annual meeting. Thanks to their president, Mark Harless, for inviting me, and to @MNFarmBureau board member Shayne Isane for joining us! https://t.co/s2V7W2tz56","date":"Thu Aug 05 17:48:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I visited Four Hill Farms near Barnesville to see the challenges facing farmers in this extreme drought. Thanks to Jake &amp; Nathan Thompson for hosting, as well as @ClayCountyMN Commissioner @jenny_mongeau, Minn-Dak Farmers Co-Op, @AgCountry &amp; RD Offutt Farms for joining us. https://t.co/0muS7up7Jb","date":"Thu Aug 05 17:09:35 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Farmers have been hit hard by the extreme drought, and I saw it firsthand at Four Hill Farms near Barnesville today. https://t.co/4wfOgvmO7d","date":"Wed Aug 04 23:50:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Wishing a very happy birthday to my friend, colleague, and fellow Minnesotan, @RepHagedorn! 🎉","date":"Wed Aug 04 20:50:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/LvVsFGfqVZ","date":"Wed Aug 04 15:54:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"After participating in yesterday’s panel, I made my way around the @MNFarmfest grounds. It was great to see so many familiar faces from @MinnesotaPork, @mncorn, @MNFarmBureau, @MNSoyGrowers, @AgCountry, @ZippyDuvall, @UMNExt, @AURIcomm, @CompeerFinance &amp; more! https://t.co/PKh6n26wJ6","date":"Wed Aug 04 15:53:53 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I have compiled a list of the many federal and state resources available to help farmers, ranchers, communities, and businesses recover from natural disasters such as the extreme drought. ⤵️ https://t.co/XK7iAIf4OI","date":"Wed Aug 04 14:57:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great to visit with you! Thanks for hosting me at your booth.","date":"Wed Aug 04 14:48:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It’s wonderful to be back in-person at @MNFarmfest!","date":"Tue Aug 03 19:49:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Great to speak with with @Lynn_Ketelsen, “The Voice of Minnesota Agriculture,” at @MNFarmfest today! @LFNupdates https://t.co/duIdb3nRGd","date":"Tue Aug 03 17:53:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Ready for @MNFarmfest! https://t.co/sePbovMMBM","date":"Tue Aug 03 15:40:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to co-sign @RepFeenstra's letter urging President Biden to abandon his plan to limit like-kind exchanges—a move that could have devastating impacts on family farmers and family-owned businesses.","date":"Tue Aug 03 14:33:22 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We’re all set up and ready to go for @MNFarmfest! See you tomorrow. #FarmFest https://t.co/TJzro96WFl","date":"Mon Aug 02 23:42:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We remember Red Lake Nation Police Officer Ryan Bialke, who was laid to rest today after being killed in the line of duty on July 27, 2021.\n\nPlease join me in praying for Officer Bialke's family, friends, colleagues, and community during this difficult time. https://t.co/qgVDorRNtR","date":"Mon Aug 02 20:05:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congrats to @MarcusConst in Willmar for winning the 2021 Secretary of Defense Employer Support Freedom Award! They are one of just 15 employers nationwide honored for their support of National Guard and Reserve employees and their families. Well done!\nhttps://t.co/n2vzOSGIGq","date":"Mon Aug 02 14:19:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to @MnTurkey for including me in their recent newsletter update! I was glad to join them at their Summer Summit in Alexandria earlier this summer. We had a great discussion on how ag policy affects the turkey industry and how we can partner together. https://t.co/c8ZADa1sSq","date":"Fri Jul 30 18:32:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The bipartisan Hyde Amendment has protected taxpayers from being complicit in the tragedy of abortion since 1976—until now. \n\nDemocrats left it out of their bloated budget &amp; rejected our motion to add it back, effectively abandoning millions of pro-life Americans. #HydeSavesLives","date":"Thu Jul 29 18:39:04 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Wishing my D.C. interns a very happy #NationalInternDay! Thank you for all you do. I know you will go far!","date":"Thu Jul 29 17:28:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to folks from the @MNBroadcasters for making the trip out to Washington! It was great meeting with you today. https://t.co/6nEf1sJJcQ","date":"Thu Jul 29 15:44:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was glad to give virtual remarks at today’s Partners in Ag Innovation Conference in Willmar. The focus of this year’s event was growth and change in agribusiness and the ag economy. Thanks to @MinnWestTech and @KandiWillmarEDC for hosting! #AgPartnersMN https://t.co/D7VGYpKLwW","date":"Thu Jul 29 14:45:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Suni Lee on bringing home the GOLD! Minnesota is very proud.","date":"Thu Jul 29 13:24:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great meeting with these future leaders of the pro-life movement today in D.C. I’m proud of their passion and commitment to defending the right to life for all! https://t.co/lRMIAV0RNv","date":"Wed Jul 28 19:53:14 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to join my colleague, @RepDustyJohnson, in introducing a bill to allow for CRP emergency haying during primary nesting season. https://t.co/dXu0cxsDlC","date":"Wed Jul 28 16:46:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Rep. Fischbach Announces Resources for Drought-Stricken Farmers https://t.co/pRbt6YgZcd","date":"Wed Jul 28 15:38:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I want to recognize the summer interns in my D.C. office, Morgan and Val. We’re lucky to have them around—they’re doing a great job serving the people of Minnesota’s 7th District! https://t.co/mRrbJMtiqb","date":"Thu Jul 22 22:32:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"...as well as the entire community, and ask everyone to join me in keeping them in our prayers. I am eternally grateful to the men and women of law enforcement who put their lives on the line every day to keep us safe. https://t.co/9nJYME2KMi","date":"Wed Jul 28 01:07:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The killing of Red Lake Police Officer Ryan Bialke is an unbelievable tragedy, and my heart is heavy over the murder of another law enforcement officer. I want to express my sincere condolences to Officer Bialke’s family and friends...","date":"Wed Jul 28 01:07:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I’m in Washington for votes, so my district office staff participated in the annual @ChamberMarshall AgriBusiness State of Agriculture Panel earlier today. They had a great discussion about the issues facing agriculture and how we can grow the rural economy. https://t.co/nl9uvETlaw","date":"Tue Jul 27 21:46:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Wishing a very happy birthday to my friend and colleague @CongressmanGT!","date":"Tue Jul 27 18:56:20 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There are federal and state resources available to farmers, ranchers, businesses, and communities impacted by the extreme drought in Minnesota. \n\nMy office stands ready to assist constituents in navigating these programs. https://t.co/dtcfWd48AC","date":"Tue Jul 27 16:14:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just spoke with Clinton Mayor Greg Basta about yesterday's elevator fire. I told the mayor that my staff and I stand ready to assist in any way that we can as the community works toward recovery. \n\nPlease continue to join me in keeping the Clinton area in your prayers. https://t.co/cGB1yA1lb2","date":"Mon Jul 26 18:04:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Here is an important thread with updates from Big Stone County Sheriff Mark Brown regarding yesterday's elevator fire in Clinton.","date":"Mon Jul 26 17:38:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am proud to join @RepMariaSalazar's resolution condemning the horrors of socialism and declaring our support for the Cuban people as they seek freedom from the corrupt Communist regime.\n\nWe denounce socialism in all its forms! #SOSCuba https://t.co/NW019oB5yk https://t.co/dRHlxCB8CO","date":"Mon Jul 26 14:19:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I’m praying for the community of Clinton today as they deal with a grain elevator fire. My office is continuing to monitor the situation. May God bless those involved in fighting the fire, their families, and the community. https://t.co/5hlGxAcOAi","date":"Mon Jul 26 00:11:14 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Meet Val, the other summer intern in my D.C. office! Val grew up in Minnesota and says one of her favorite childhood memories is spending weekends at her family's cabin in Becker County. She currently attends Purdue University, where she studies biology and political science. https://t.co/tffd5lOlHi","date":"Fri Jul 23 16:49:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Says Val: \"My favorite part has been how welcoming and hardworking the Congresswoman and her staff have been. They've taught me invaluable skills that I'll take with me forever. I'm honored to be a part of this office and serving the constituents of Minnesota's 7th District!\"","date":"Fri Jul 23 16:49:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Meet Morgan, one of the summer interns in my D.C. office. She grew up in Minnesota and is currently a junior at Liberty University, where she studies pre-law. Morgan also serves in the Virginia Army National Guard. \n\nThanks for your hard work, Morgan! https://t.co/PO6uGuqb1m","date":"Fri Jul 23 14:53:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Morgan says, \"I'm proud to be able to make a difference by serving constituents and supporting the staff in Rep. Fischbach’s office. I have really enjoyed learning more about the innerworkings of government and touring the city and historical landmarks of Washington, D.C.\"","date":"Fri Jul 23 14:53:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I want to recognize the summer interns in my D.C. office, Morgan and Val. We’re lucky to have them around—they’re doing a great job serving the people of Minnesota’s 7th District! https://t.co/mRrbJMtiqb","date":"Thu Jul 22 22:32:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"With most of Minnesota facing an extreme drought, I have asked the Administration to allow emergency haying and grazing on CRP lands. Unfortunately, that request was met with silence. If the situation continues to worsen, the impacts on our entire economy will be far reaching. https://t.co/XzbXRRSiwB","date":"Thu Jul 22 20:31:23 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was wonderful to have State Rep. Tim Miller and his wife, Cherie, visit my D.C. office this morning. Thanks for stopping by! https://t.co/6TErH2G220","date":"Thu Jul 22 17:15:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I spoke with @JoeKASMRadio yesterday about the drought, infrastructure, the pandemic, some of my recent visits across the district, and much more. Give it a listen! https://t.co/ffpkIy7xQX","date":"Thu Jul 22 14:41:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great to see my friends and constituents, @SenMarkJohnson and his wife, Sky, in D.C. today. Thanks for stopping by my office! https://t.co/waL0dQsE2k","date":"Wed Jul 21 20:26:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"With most of Minnesota in a severe drought, I want to make you aware of the many federal and state resources available to assist farmers, ranchers, communities, and businesses navigate the challenges and begin to recover.\n\nFind more information 👇🏻\nhttps://t.co/XK7iAIf4OI","date":"Wed Jul 21 18:01:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I'm proud to join @RepTenney in an amicus brief to the Supreme Court defending our right under the Second Amendment to conceal carry.\n\nAs Democrats continue pushing radical gun control on law-abiding Americans, I will always stand up for our Constitution. https://t.co/mStZe4ar9N","date":"Tue Jul 20 21:35:11 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to be a co-sponsor of legislation to restore year-round sales of E-15, which benefits the environment, strengthens our rural economy, makes us more energy independent, and brings stability to farmers and biofuels producers across Minnesota. https://t.co/fXCxN9Vcz8","date":"Tue Jul 20 14:07:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the Anderson family for hosting me on their farm near Belgrade. We had a discussion on the challenges of the ag labor shortage, how it is affecting rural communities, and possible solutions. Thanks to State Rep. Paul Anderson, @MinnesotaPork &amp; @NPPC for joining us! https://t.co/s49TnAoI1v","date":"Tue Jul 20 01:32:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Fully vaccinated Americans can enter Canada beginning Aug. 9 https://t.co/R6Mdjkq1A5","date":"Mon Jul 19 18:53:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Canadian government has announced that conditional cross-border travel will be allowed for fully vaccinated Americans beginning on 8/9. After more than 16 long, arduous months, it is long past the time for these punitive restrictions to meet their end. https://t.co/zXf3CbHK30","date":"Mon Jul 19 18:23:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Not only has the prolonged closure affected the ability of Americans to travel, it has also impeded their ability to earn a living. It has been particularly devastating for Minnesotans living in the Northwest Angle, and I am committed to doing all I can to help their recovery.","date":"Mon Jul 19 18:23:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"At an event last week, I spoke with @JoeKASMRadio about challenges facing the ag industry, including labor/workforce needs and broadband. Joe also spoke with our hosts, John &amp; Grant Anderson of Anderson Family Farms, and @MinnesotaPork CEO @DavePreisler. https://t.co/47R1BAU6vP","date":"Mon Jul 19 16:26:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Labor and workforce issues continue to be challenges for the ag industry, and they must be addressed. Thanks to Anderson Family Farms near Belgrade for hosting me for a discussion on this, and thanks to folks from @MinnesotaPork &amp; @NPPC for joining us. https://t.co/bTzkpI8IK3","date":"Mon Jul 19 14:24:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/3jjeM66aqU","date":"Fri Jul 16 22:45:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Our northern border communities need immediate action. I sent a letter to President Biden, joined by 13 of my border colleagues, urging that he not extend current travel restrictions along the northern border. https://t.co/C2Kmnli4u2","date":"Fri Jul 16 22:44:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I sent a letter to @SecVilsack urging @USDA to allow haying &amp; grazing on CRP lands in Minnesota. Much of MN is in a severe drought and there are reports that herd culling is already being done due to a lack of quality feed. We need immediate action. https://t.co/b6FjEZjOzu","date":"Thu Jul 15 20:18:54 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Since 1976, the Hyde Amendment has made sure American taxpayers are not forced to pay for abortion-on-demand. Nearly 60% of Americans agree—taxpayer dollars should not be used to fund abortion! #HydeSavesLives https://t.co/yVJi2l3gFi","date":"Thu Jul 15 15:42:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Together with @CongressmanGT &amp; our colleagues on @HouseAgGOP, we introduced the Broadband for Rural America Act in May. The legislation we passed unanimously today is an extension of that work.","date":"Wed Jul 14 18:36:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to join my @HouseAgGOP @HouseAgDems colleagues in unanimously passing the Broadband Internet Connections for Rural America Act. This legislation builds upon our work to provide increased funding for broadband deployment through @USDA.","date":"Wed Jul 14 18:34:05 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was in Melrose yesterday at Rahn’s Oil &amp; Propane, where @SenWestrom and I had a meeting and tour of the facility and fuel station. Thanks to Dave, Lisa, Tim, and Alyssa Rahn for hosting us. A wonderful family business! https://t.co/TCKsYlCFRG","date":"Wed Jul 14 17:08:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is from a farmer near Dane Prairie Township in Otter Tail County last night, who said one of the last times he can recall it being so dry was 1976. \n\nThe drought is becoming an increasingly dire situation. Please pray for rain and relief! https://t.co/KNRuS7pmhH","date":"Wed Jul 14 16:00:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Mike Skaug of Beltrami on being named president of the @MNSoyGrowers! Looking forward to working together on behalf of Minnesota farmers. https://t.co/K1KXaXisKB","date":"Tue Jul 13 13:50:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"One resort owner told us they typically have 80 boats at their docks at this point of the summer. This year, they are happy with 20 boats at their docks. They are understandably frustrated and anxious, and they need certainty.","date":"Mon Jul 12 21:28:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last week, I led a delegation to Minnesota’s Northwest Angle to call attention to the continued closure of the border between the United States and Canada and to visit with affected business owners, workers, and residents.\nhttps://t.co/3PglDxLNXC","date":"Mon Jul 12 21:28:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The eyes of the world are on Cuba. I am proud to stand united with the Cuban people and their quest for freedom. #SOSCuba","date":"Mon Jul 12 02:03:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I visited the Northwest Angle this week with @SenUtke and State Rep. Matt Grossell. We had the opportunity to speak with so many wonderful resort owners, workers, and residents who have relied on tourism for decades—but have been devastated by the border closure. https://t.co/iyzaxMnfpM","date":"Fri Jul 09 16:52:48 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Our final stop was at Ballard’s Resort for the Lake of the Woods Tourism Bureau meeting. We talked about the local economy and how it can be maintained and strengthened. I appreciate Lake of the Woods County Commissioners Ed Arneson and Jon Waibel joining us too. https://t.co/OAymRSOWRj","date":"Thu Jul 08 23:21:07 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"More misinformation from out-of-touch celebrities and wealthy donors that want President Biden to kowtow to the radical left. I represent Minnesota, not Hollywood—and my constituents overwhelmingly recognize the tremendous value of Enbridge Line 3. https://t.co/rD2ABPKbjg","date":"Thu Jul 08 19:27:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We just took off from the Northwest Angle back to mainland Lake of the Woods County. Thanks to Luke and Sam from @lakecountryair for the smooth ride! https://t.co/TXnxxdzMab","date":"Thu Jul 08 18:42:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Agreed, @RepStefanik. It is long past the time for President Biden and Prime Minister Trudeau to make the crisis at our northern border a priority.","date":"Thu Jul 08 18:27:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We visited the Angle Inlet School today—the last remaining one-room schoolhouse in Minnesota. We heard from students and their teacher, Linda, about the hardships their families are facing as a result of the border closure. https://t.co/AZ9aKApl4Y","date":"Thu Jul 08 16:59:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to the resorts, business owners, and cabin owners who shared their concerns and experiences of the border closure at the community meeting at Flag Island Resort. They need an even playing field. I’ll continue to work for solutions and pressure Biden/Trudeau to do the same. https://t.co/oiOdgbl0ct","date":"Thu Jul 08 02:03:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"For context, Oak Island is located in the far northeastern corner of the Northwest Angle, right on the border of the United States and Canada. https://t.co/1aaLpq5FP1","date":"Wed Jul 07 20:15:35 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Here’s a video of us approaching the Northwest Angle’s Oak Island via Lake of the Woods earlier today. It is an absolutely beautiful part of our state! https://t.co/5w2cyBLcq7","date":"Wed Jul 07 20:15:33 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Wishing my friend and colleague @RepHagedorn all the best as he battles cancer once again. Scott and I are praying for a speedy recovery!","date":"Wed Jul 07 18:41:54 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I appreciate the swift action by law enforcement, who handled the situation with the utmost professionalism. This behavior cannot and will not be tolerated.","date":"Wed Jul 07 18:35:03 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We also stopped at Sunset Lodge on Oak Island—another generational business devastated by the northern border closure. They’re proud of their tradition of hosting vacationers and anglers, but they need certainty and action from the Canadian &amp; U.S. governments. https://t.co/38SEf4LSnu","date":"Wed Jul 07 18:19:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As they pointed out, there’s nothing on the road to the Northwest Angle through Canada, so why does it remain closed? Even our Canadian counterparts don’t understand. They need answers and a solution!","date":"Wed Jul 07 17:47:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We just wrapped up a meeting on Flag Island with area resort owners. They normally have 80+ boats at the docks—now, they’re happy if they have 20 boats. They’re understandably frustrated and anxious not knowing what their future holds. https://t.co/CXsBrOGdqn","date":"Wed Jul 07 17:47:26 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My staff assistant, Rieder, accepted a seal of the @usairforce that will proudly hang in my D.C. office, right next to the seals of our other military branches. Thank you! https://t.co/HOfw886rfe","date":"Wed Jul 07 16:07:21 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We just left Baudette and are crossing Lake of the Woods on our way to the Northwest Angle! We’ll spend today and tomorrow meeting with community members and business owners who have been devastated by the U.S./Canada border closure. https://t.co/HD1wWnEeMP","date":"Wed Jul 07 14:34:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I’m visiting the Northwest Angle this week with @SenUtke &amp; State Rep. Matt Grossell. We will meet with community members &amp; business owners who have been devastated by the border closure as we continue to press President Biden on a bilateral solution. https://t.co/nlA5h0FQvK","date":"Tue Jul 06 23:57:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The deadline for small businesses, ag co-ops &amp; nonprofits in Beltrami, Kittson, Lake of the Woods, Marshall &amp; Roseau counties to apply for @SBAgov Economic Injury Disaster Loans (EIDL) is July 12! EIDLs are available due to the excessive rain/flooding from July 7-August 1, 2020.","date":"Tue Jul 06 18:07:40 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Under this declaration, the EIDL program is available to eligible farm- and nonfarm-related entities that suffered financial losses as a direct result of this disaster.\n\nFind more information here: https://t.co/YqTL2zvSJd","date":"Tue Jul 06 18:07:40 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had an excellent meeting at the Millerville Co-op Creamery—among the last remaining creameries in Minnesota to produce small batch butter. We discussed the importance of these longstanding cooperatives for our rural communities. Thanks for having me! https://t.co/dq97WW18GL","date":"Tue Jul 06 15:51:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to the Fergus Falls Noon Kiwanis Club on 100 years serving the community! https://t.co/lgvaIBK6QG","date":"Tue Jul 06 13:39:53 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As we celebrate another Independence Day, we do so with the same sense of hope and pride that our Founding Fathers had so many years ago.\n\nHappy #IndependenceDay! May God bless America. https://t.co/JAqRD88ww4","date":"Sun Jul 04 12:30:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"#StanleyCup","date":"Sat Jul 03 00:23:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Even with vaccines driving infection rates way down, there does not appear to be an end in sight. The families and businesses of the Angle desperately need the Biden Administration to engage with Canada on a bilateral solution.","date":"Fri Jul 02 19:52:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am grateful to the Minnesota Legislature for passing a $5 million forgivable loan program for Northwest Angle businesses that have been impacted by the U.S./Canada border closure. It has been devastating for these businesses, many of which have been operating for generations. https://t.co/tClp5CdoAt","date":"Fri Jul 02 19:52:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Whether you're traveling out of town, going to a parade, or spending time at the lake, please be safe out there. Have a great weekend! https://t.co/d6eFIHk22m","date":"Fri Jul 02 16:17:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Since 1976, the Hyde Amendment has been passed and signed into law on a bipartisan basis. But President Biden and Democrats want to end these protections and force the American people to fund abortion.\n\nI urge the Biden Administration to reverse course. https://t.co/ULtPU0OsuY","date":"Fri Jul 02 14:45:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I’m proud to put this @SpaceForceDoD seal in my office alongside the seals of our military’s other branches. Thank you! https://t.co/YE3RORwqBB","date":"Thu Jul 01 02:09:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Students from Minnesota’s 7th District are invited to enter this year's Congressional App Challenge! All middle and high school students are invited to participate, regardless of coding experience. @CongressionalAC https://t.co/KknSVSeU3O","date":"Wed Jun 30 19:56:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Glad to join @RepJimBaird's letter to President Biden. The cyberattack against JBS USA must be met with the same priority as an act of terrorism—because that’s exactly what it was.","date":"Tue Jun 29 19:44:12 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Any interruption to our food supply chain can have devastating consequences on our economy and national security, and our government must make clear to the world that there are severe consequences for such acts. Cyberattacks against the American people cannot and will not stand.","date":"Tue Jun 29 19:44:12 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Thief River Falls Regional Airport has been awarded a $5.2 million federal grant. With thousands of passengers and over a million packages moving through the airport each year, the funds will bring needed improvements to a critical transportation hub. https://t.co/GzWBm325oK","date":"Tue Jun 29 19:41:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Canadian Government giving exemptions to moneyed interests over the communities devastated by the border closure is nonsensical at best. #StanleyCup","date":"Tue Jun 29 17:21:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"NHL players get a cross-border travel exemption from the Canadian government for the #StanleyCup playoffs, but the tourists, fishing guides, bartenders, waiters, and cleaning crews trying to get to and from Minnesota’s Northwest Angle do not?","date":"Tue Jun 29 17:21:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was glad to speak with @EWTNProLife @CatSzeltner about being named co-chair of the House Pro-Life Caucus, the Democrats' radical pro-abortion agenda, and the work my colleagues and I are doing to protect the fundamental right to life, from conception until natural death. @EWTN https://t.co/JMXbEXxWI4","date":"Tue Jun 29 14:22:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The radical left’s movement to re-write American history has made its way to the National Archives, which they now deem racist.\n\nThey want to tell us what to think and how to think it. When will this madness end?\nhttps://t.co/iaDYZUBvWM","date":"Mon Jun 28 20:37:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Ashlyn Brouwer, a freshman at Central Minnesota Christian School, and Katelyn Graves, a senior at Central Minnesota Christian School, received honorable mentions. Their respective submissions will be displayed at my district offices in Willmar and Moorhead. https://t.co/uSUoejDJE0","date":"Fri Jun 25 16:15:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Cora Watson, a sophomore at Central Minnesota Christian School in Prinsburg, earned second place for her ‘Jersey Cow’ scratch board portrait. It will be displayed in my Washington, D.C. office. https://t.co/qDPanCD9Ls","date":"Fri Jun 25 16:15:22 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"In first place was 'March for Life,' submitted by Vy Pham, a senior at Hillcrest Lutheran Academy in Fergus Falls. It will be displayed for one year in the tunnel from the U.S. Capitol to the Cannon House Office Building. Congratulations! https://t.co/OAPQQwGrOL","date":"Fri Jun 25 16:15:21 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to the winners of this year's Congressional Art Competition! We received many wonderful submissions from talented students across the district. https://t.co/uzJJwt1UyC","date":"Fri Jun 25 16:15:20 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Don’t miss the latest news from Washington and across Minnesota’s 7th District. Sign up for my e-mail newsletter! https://t.co/WRduiIYf2n","date":"Thu Jun 24 23:54:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Heroes. https://t.co/teQ9MCmsQW","date":"Thu Jun 24 14:33:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am proud to honor the fallen servicemembers from Minnesota’s 7th District. Let us never forget their sacrifice. May God bless their memory and those they left behind. https://t.co/Zg0ctWZqOh","date":"Wed Jun 23 21:24:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden said it best in 1994: “Those of us who are opposed to abortion should not be compelled to pay for them.”\n\nAnd in 2006, when Biden said he “won’t support public funding” of abortion.","date":"Wed Jun 23 14:04:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Since 1976, the Hyde Amendment has protected American taxpayers from being complicit in the atrocity that is abortion on-demand—until now, as Democrats want to eliminate those protections altogether.\n\nThat's why we must pass the No Taxpayer Funding for Abortion Act. https://t.co/IqM05KtLoy","date":"Wed Jun 23 14:02:14 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It is an honor to be recognized as a top conservative first-year Member of Congress by the @ACUConservative! I'm proud to be a new voice for western Minnesota in Washington, D.C. https://t.co/wZ6ZrcbM4y","date":"Tue Jun 22 16:08:50 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Not only is the Enbridge Line 3 Replacement Project a boon for northern Minnesota's economy, it will also be far safer than the current pipeline, which is badly deteriorating and in need of replacement.\n\n#Line3 makes sense for Minnesota. I'm proud to support it. https://t.co/l1aZyiXbcL","date":"Mon Jun 21 15:43:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy Father's Day! https://t.co/oYNaSPg349","date":"Sun Jun 20 17:10:22 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"…I will continue to press the Canadian &amp; US administrations to heed the calls of border communities &amp; allow them to recover. I also urge my colleagues to pass my ANGLE Act to provide aid to the communities that face a second straight summer of virtually no tourist travel.","date":"Fri Jun 18 22:41:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It is disappointing to see these unnecessary restrictions continue. Americans have a right to travel to their own country, and commonsense tweaks to travel protocols can effectively facilitate travel while minimizing the risk of COVID-19…","date":"Fri Jun 18 22:41:54 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It’s a beautiful summer night in Minnesota. This is from Aurdal Township in Otter Tail County. https://t.co/Hdkebu6moW","date":"Fri Jun 18 02:32:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, @RepMMM and I introduced a resolution to protect the intellectual property of COVID-19 vaccines. https://t.co/hKFN0DqQBd","date":"Thu Jun 17 18:34:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"...to lead the effort to deliver vaccines around the world. Waiving intellectual property rights for these vaccines will not only upend our ongoing pandemic response, it will also discourage the innovation &amp; investment required to develop such lifesaving treatments in the future.","date":"Thu Jun 17 18:34:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Operation Warp Speed and its unprecedented public-private partnership, the U.S. led the world in developing safe, highly effective COVID-19 vaccines in record time. As a direct result of that American ingenuity, the U.S. is well on its way to recovery and able...","date":"Thu Jun 17 18:34:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to @AAHSGirlsGolf on winning the 2021 Class AAA state championship! Great job! @alexmnschools @aahsactivities  https://t.co/af3uv2QpTe","date":"Thu Jun 17 14:21:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great to have two #mn07 constituents testify at the hearing. Kent Mattson, CEO of @LRH_Health, testified on behalf of @MNhospitals, and Bob Fox, member of the @RenvilleCtyMN Board of Commissioners, testified on behalf of @NACoTweets. Thanks for being there!","date":"Tue Jun 15 21:17:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today was my first hearing as Ranking Member of the House Ag Committee’s Subcommittee on Commodity Exchanges, Energy, and Credit. It was an excellent opportunity to focus on the needs of our rural communities and the challenges they're facing. https://t.co/mM6NdVcVxj","date":"Tue Jun 15 21:17:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As an American, as a Minnesotan, as a woman of faith, and as a mother and grandmother, the issue of life is personal to me. Life is sacred – and it’s worth fighting for and protecting.","date":"Tue Jun 15 18:15:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It is an honor to serve as a co-chair of the House Congressional Pro-Life Caucus, and I am proud to join so many of my colleagues in defense of the fundamental right to life. https://t.co/FuLtHZhRaL","date":"Tue Jun 15 18:15:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It is unacceptable that the Biden Administration would push for “green energy” while leaving out the homegrown, sustainable fuel produced by Minnesota farmers.\n\nThese proposals have been discussed before. They were wrong then, they’re wrong now. https://t.co/wUfuIEi6Kc","date":"Mon Jun 14 18:56:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Once again, the courts have rejected the misguided demands of far-left special interests and are allowing Line 3 construction to proceed.\n\nLine 3 brings thousands of skilled labor jobs and millions in tax revenue directly to our communities. Proud to support it!","date":"Mon Jun 14 15:45:41 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy #FlagDay—a day to commemorate the adoption of the Stars and Stripes as the official flag of the United States and to celebrate all the flag represents. We are truly blessed to live in the greatest nation on earth! https://t.co/30nn9wVXQA","date":"Mon Jun 14 14:22:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Just months after President Biden stopped the Keystone XL Pipeline for good, urban environmentalists and far-left special interests are demanding that he also ground Enbridge Line 3.\n\nIf they succeed, it would be catastrophic for northern Minnesota. https://t.co/JKMzUqTWbx","date":"Fri Jun 11 16:30:21 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden has an opportunity to discuss the U.S./Canada border with Prime Minister Trudeau at the #G7. A bilateral resolution to our northern border crisis MUST be a top priority. Lives and livelihoods depend on it!","date":"Fri Jun 11 13:32:53 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I'm a proud co-sponsor of @RepMMM's resolution to uphold President Trump's Navigable Waters Protection Rule. We should be partnering with farmers and landowners in support of clean water—not actively working against them. @westerncaucus","date":"Thu Jun 10 18:12:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Trump reversed the harmful Obama-era \"Waters of the US\" rule because it was a massive federal land grab that came at the expense of American farmers and landowners.\n\nNow, the Biden Admin wants to bring the rule back—again threatening the livelihoods of rural Americans. https://t.co/M4qOeaIOci","date":"Thu Jun 10 18:12:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was a beautiful morning in western Minnesota today! This photo is from just north of Rothsay in Wilkin County. https://t.co/36EEe7BCwF","date":"Wed Jun 09 20:03:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"🚫MYTH: Dairy products are unhealthy.\n\n✅FACT: Dairy is crucial to the growth and strengthening of bones. A simple glass of milk, some yogurt, or a piece of cheese helps to fight off brittle bones and osteoporosis.\n\n#NationalDairyMonth https://t.co/KZTLVrl7ni","date":"Wed Jun 09 16:24:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just wrapped up a great virtual meeting with the Edge Dairy Farmer Cooperative. We discussed workforce needs, dairy nutrition and labeling, sustainability, taxation, and more. Glad to meet with them, especially during #NationalDairyMonth. Thank you! @VoiceOfMilk https://t.co/MZvhXtjfJg","date":"Wed Jun 09 15:36:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My Washington, D.C. office is now accepting internship applications for the fall of 2021! Congressional internships are a great way for college students to gain valuable experience on Capitol Hill. More info: https://t.co/XD4cAHgRgp","date":"Tue Jun 08 20:08:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the Kerfelds &amp; @UMNExt for inviting me to Kerfeld Hill-View Farm near Melrose for the Stearns County Breakfast on the Farm!\n\nI appreciated the tour and discussion on policies that work for generational farms like the Kerfelds. Thanks to all who made it a success! https://t.co/Xw7INdDYNj","date":"Tue Jun 08 19:27:40 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to R.D. Offutt Farms for the meeting and tour of their facilities and RDO Equipment Co. store in Moorhead last week. They are the nation’s largest potato grower and play a critical role in our ag economy. It was a great visit! https://t.co/PkVM4gKq0J","date":"Tue Jun 08 18:16:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was with @cityofmoorhead leaders last week for a discussion on local infrastructure needs, economic development, city priorities, and ways I can partner with the city on behalf of our constituents. Thanks for having me! https://t.co/nJIJJlVXIZ","date":"Tue Jun 08 14:50:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you, @ClayCountyMN, for the opportunity to meet with the Board of Commissioners and hear about the issues facing our constituents. https://t.co/ej076MXhjk","date":"Tue Jun 08 14:44:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Line 3 is critical for so many reasons—good paying jobs, economic investment, safety, and energy independence. I am proud to support it! #Line3","date":"Tue Jun 08 00:42:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The criminal behavior by “protesters” of Enbridge Line 3 today has been completely unacceptable. I am grateful for the work of law enforcement, who made sure everyone was safe despite this recklessness.","date":"Tue Jun 08 00:42:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a great meeting with the @ClayCountyMN Board of Commissioners last week. We discussed the pandemic response, infrastructure, childcare, and ending the \"enhanced\" unemployment benefits. We need to get Americans back to work! https://t.co/2sDurcWm3n","date":"Mon Jun 07 15:14:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"🚫MYTH: Humans are not designed to drink cow’s milk.\n\n✅FACT: Milk is the only food that you can survive on alone. It's packed with flavor and essential\nnutrients.\n\n#NationalDairyMonth https://t.co/aTDeAJF8iJ","date":"Mon Jun 07 14:08:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations, @ISD347 Class of 2021! https://t.co/CrIF5Fcftl","date":"Mon Jun 07 13:44:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was glad to meet with members of the Granite Falls Economic Development Authority and city, county, and tribal officials earlier this week. We discussed rural development, housing, workforce, and more. Thanks for having me! https://t.co/ZQOJb7hgsR","date":"Thu Jun 03 19:44:04 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Only in Minnesota! #mn07","date":"Thu Jun 03 19:24:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Rick Electric of Moorhead and Comstock Construction of Fergus Falls for showing me their worksite at Dilworth-Glyndon-Felton’s new elementary school addition and renovation. I appreciate their work and commitment to our communities! https://t.co/s3wyYLJp0l","date":"Wed Jun 02 23:52:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I will be meeting with agricultural leaders from the northern part of the district later this week, and will continue to hold these meetings throughout the year. Hearing directly from these leaders, and the issues the ag community is facing, helps inform my work in Congress.","date":"Wed Jun 02 16:26:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I appreciated meeting with agricultural leaders from the southern part of the district yesterday. We discussed the importance of family farms, keeping crop and livestock value in our rural communities, and ensuring the success of the next generation of farming. Thank you! https://t.co/XJisj8XmPc","date":"Wed Jun 02 16:26:35 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I'm proud of these Bertha-Hewitt seniors, who went out of their way to make sure their classmate received the graduation she deserved. Well done! https://t.co/JftVI0Lf6N","date":"Wed Jun 02 14:10:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Family-owned businesses like @fellingtrailers in Sauk Centre and Litchfield are the hearts of many of rural communities. Thanks for inviting me and State Rep. Paul Anderson for a tour—looking forward to working together to make our rural economy stronger. https://t.co/8uZNJyPZPT","date":"Tue Jun 01 17:17:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy #WorldMilkDay! Please join me in thanking Minnesota's hardworking dairy producers and recognizing the many benefits of milk. In fact, the healthy nutrients found in milk help make it nature's most nearly perfect food! https://t.co/ljNJTmPQzh","date":"Tue Jun 01 16:37:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was an honor to participate in the Deer Creek Memorial Day service and Veterans Park dedication yesterday. May the sacrifices of our fallen veterans never be forgotten. #MemorialDay2021 https://t.co/0NFP7tzMXc","date":"Tue Jun 01 15:03:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, we remember the sacrifices made by generations of courageous Americans in pursuit of our freedoms, and we honor those who paid for our liberty with their lives. It is because of them that we are free. #MemorialDay https://t.co/QFYt6v6LwM","date":"Mon May 31 13:05:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Northwest Angle resorts and small businesses cannot survive a second summer of no visitors. It is long past time for our two countries to find a solution. https://t.co/IpUhWDO9UD","date":"Mon May 31 00:06:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Glad to join many of my Republican colleagues in signing this letter. China must be held accountable.","date":"Sun May 30 16:51:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to Bushmills Ethanol in Atwater for the meeting and tour today. I greatly appreciate the role of ethanol plants in our rural economy—adding value to our products, giving family farms another market, and bringing economic activity to our small communities. https://t.co/mQtM37wkGS","date":"Wed May 26 22:33:21 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Nothing short of a full border reopening can begin to mitigate the negative effects this indefinite border closure has had on Northwest Angle lives and livelihoods. https://t.co/ljDP66hh8Q","date":"Wed May 26 17:17:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We also visited Mr. B’s Chocolates, a renowned chocolatier that imports the best chocolate from Belgium to craft wonderful truffles, caramels, chocolate bars, and other treats. https://t.co/L7R1uzcFWQ","date":"Tue May 25 22:21:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Brian started Bollig Engineering to help rural communities with their infrastructure needs, and the majority of their projects are in #mn07. All of them are important, but I especially appreciate Bollig’s work in helping the Northwest Angle establish an airport.","date":"Tue May 25 22:21:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to Brian Bollig for welcoming me and State Senator @SenatorLangMN to his businesses today, located on the @MinnWestTech Campus in Willmar—a center of innovation and economic growth in my district. https://t.co/85DmhgvA87","date":"Tue May 25 22:21:09 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My Washington, D.C. office is now accepting internship applications for the fall of 2021. If you are interested, please apply here: https://t.co/XD4cAHgRgp","date":"Tue May 25 20:41:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Dave Benson of Alexandria, who was recognized by the American Legion Post 87 for five decades of continuous membership, as well as his service on the city council and as a police officer. A well deserved honor! https://t.co/UxHevUeQS1","date":"Tue May 25 17:16:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"After 40+ years teaching our kids, Marshall High School band director Wayne Ivers is retiring. Congratulations—and best wishes for the future! https://t.co/DgssQZMx5V","date":"Tue May 25 13:57:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was a great virtual discussion with UK Consul @JanLBauer, UK Consul General Alan Gogbashian, Minnesota Ag Commissioner @ThommyPetersen, and others today. The UK is an important partner for Minnesota's ag economy, and I look forward to continuing that strong relationship. https://t.co/PyR12KRvKa","date":"Mon May 24 20:06:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Canada eases border travel restrictions for residents of Minnesota's Northwest Angle https://t.co/YVqAVZ5T20","date":"Mon May 24 16:33:22 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am pleased that residents of the Northwest Angle can again travel freely between their homes and the mainland United States. But while this is indeed progress, the border remains closed to non-resident travel, and nothing short of a full re-opening can begin to mitigate...","date":"Fri May 21 23:16:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Canada has announced that residents of Minnesota’s Northwest Angle are now exempt from its pre- and post-travel COVID testing requirement. https://t.co/H6iJiamlws https://t.co/AVfeTkfYCw","date":"Fri May 21 23:16:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"...the many negative effects of the indefinite closure on Angle lives and livelihoods. I will continue to aggressively pursue a solution.","date":"Fri May 21 23:16:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Along with @RepPeteStauber and members of the Canadian Parliament, I held a roundtable discussion in International Falls to hear directly from those affected by the closure and to push our governments toward action. https://t.co/J1S73mjRZc","date":"Fri May 21 15:17:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Last week, along with @RepPeteStauber and @RepTomEmmer, I unveiled our legislation to help re-open the border and get assistance to impacted small businesses. We also sent another letter imploring the Biden Administration to get involved in discussions. https://t.co/AdekA8rsJI","date":"Fri May 21 15:17:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My colleagues and I will continue to push for a solution to an issue that has gone on for far too long. I remain hopeful that President Biden will engage with the Canadian government on a plan to resolve the northern border crisis once-and-for-all.","date":"Fri May 21 15:17:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"When @PressSec was finally asked about the closure by a reporter, she demonstrated just how little attention the Biden Administration has paid to the crisis. https://t.co/YW9JIsyWqM","date":"Fri May 21 15:17:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"After President Biden took office in January, I joined my colleagues from border states in urging his administration to prioritize bilateral negotiations between our two countries. Unfortunately, we were met with silence. https://t.co/sFOPRTblgl","date":"Fri May 21 15:17:01 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"At the end of February, I led my colleagues in another letter to President Biden, again urging him to work with the Canadian government to re-open the border.\n\nAgain, it was met with silence from the administration. https://t.co/qXWvu8YBcM","date":"Fri May 21 15:17:01 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My staff visited the Northwest Angle in February. Since the Angle is only accessible by road through Manitoba, residents plowed a 22-mile ice road across the frozen lake as a temporary solution. Now, the ice has melted and residents remain cut off.\nhttps://t.co/f7CgrCWENg","date":"Fri May 21 15:17:01 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am disappointed that Canada has chosen to extend its border closure for yet another month. Minnesotans living in the Northwest Angle rely on cross-border travel, but they've been cut off for 15 months now. A bilateral resolution is LONG overdue.","date":"Fri May 21 15:17:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"In my district, one in five farms lack access to broadband internet. Our @HouseAgGOP Broadband for Rural America Act will not only invest in the necessary infrastructure, but also make sure broadband makes it right to peoples' doors. https://t.co/uaZXfeoIDi","date":"Thu May 20 18:20:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Israel is under attack by Hamas terrorists who are bent on destroying the only Jewish state in the world. Hamas is not interested in peace; they want to destroy Israel, and they're willing to use women, children, and journalists as human shields to do so. #StandWithIsrael https://t.co/Fmvih4Fep2","date":"Thu May 20 00:12:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great meeting with @SBAList leaders today! We discussed how we can continue to partner together to stand for life and push back on the most pro-abortion administration ever.\n\nI'm proud to be part of an historic number of pro-life women elected to the U.S. House! https://t.co/ElOPnnNYVE","date":"Wed May 19 16:38:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to the folks from ABATE for a great meeting today. It is nice to have visitors in the office again! https://t.co/OXy2rziKb4","date":"Tue May 18 20:03:21 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It's Norway's Constitution Day! Wishing a very happy #SyttendeMai to our Norwegian friends and neighbors in Minnesota. Gratulerer med dagen! https://t.co/oUGarCIfD9","date":"Mon May 17 16:55:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today is the Minnesota #FishingOpener—the unofficial beginning of summer in the Land of 10,000 Lakes! https://t.co/N3tERCJXjN","date":"Sat May 15 14:49:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations, @RepStefanik! I have every confidence that she will be an effective leader for our conference as we push back against the socialist Democrat agenda. Republicans are united in our fight for the American people!","date":"Fri May 14 14:26:04 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"A resolution to the prolonged U.S./Canada border closure is long overdue. Today, along with @RepPeteStauber and @RepTomEmmer, I unveiled a series of measures aimed at getting the border open and helping impacted small businesses. https://t.co/k1jQepKhba","date":"Thu May 13 20:05:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I proudly spoke on the House floor tonight to mark National Police Week and to speak in support of our law enforcement officers.\n\nTo the men and women of law enforcement, in Minnesota and around the country: THANK YOU! https://t.co/EFU6GV3Kof","date":"Wed May 12 23:41:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, @PressSec demonstrated how little attention the Biden Admin has paid to the crisis at the US/Canada border.\n\nWhile they rent hotels for migrants illegally crossing the southern border, they won’t lift a finger to help American citizens who just want their gov't to listen. https://t.co/oOMd8DF4Hg","date":"Thu Apr 15 20:37:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The prolonged closure of the U.S./Canada border has had a major impact on those who live and work in border communities. Thanks to those who joined @RepPeteStauber and me today as we continue our call for an immediate bilateral solution. https://t.co/3fnGBJlIHR","date":"Tue Apr 06 19:36:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"For almost a year, the US/Canada border has been closed. That’s a big problem for residents of Minnesota’s Northwest Angle, which is only accessible by road through Manitoba.\n\nSo, Angle residents plowed a 22-mile ice road across the frozen lake, hoping to attract visitors back. https://t.co/N4qBeh30Dl","date":"Tue Feb 23 18:05:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Along with @RepPeteStauber &amp; @RepTomEmmer, I sent a letter to President Biden urging him to work with the Canadian government to re-open the border for non-essential travel.\n\nThe closure has devastated local border economies, which rely heavily on tourism &amp; cross-border travel. https://t.co/2Avlcd82iG","date":"Mon Feb 22 23:40:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"For nearly a year, the Angle has been virtually shut off from the world as the US/Canada border remains closed. That's why I joined colleagues from border states to implore the Biden Admin. to work towards a bilateral plan to re-open the border to more non-essential travel. 2/2 https://t.co/Dmbgguyzpz","date":"Fri Jan 29 20:17:20 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great seeing my fellow members of the @RepublicanStudy Committee at today's lunch. These meetings give us an opportunity to discuss the legislation we're working on and advance our shared conservative values. https://t.co/Y4vD9a69cu","date":"Wed May 12 21:02:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to be an original co-sponsor of @RepAshleyHinson's bill. I will always defend the Second Amendment rights of my constituents.","date":"Wed May 12 19:56:40 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was honored to give brief virtual remarks at @ATCCMN's commencement ceremonies today. Thanks for letting me be a part of your special day.\n\nCongratulations to all! https://t.co/7hJbcC8PB5","date":"Wed May 12 19:50:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Please join me in praying for Israel, which is again under attack by Hamas terrorists. President Biden must make clear to the world that the United States stands with Israel and its right to defend itself against such terrorist attacks.","date":"Tue May 11 21:27:48 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today is the 163rd anniversary of Minnesota's statehood. Happy #StatehoodDay to the Land of 10,000 Lakes! https://t.co/KBWFSWMVn8","date":"Tue May 11 18:17:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to the @UMNCrookston Class of 2021! https://t.co/E58EBrkmnY","date":"Tue May 11 14:35:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"THANK YOU to the many brave men and women of law enforcement who work every day to keep our communities safe. We appreciate you! #NationalPoliceWeek https://t.co/bAeHwZGUmB","date":"Mon May 10 17:45:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to the @SMSUToday Class of 2021! https://t.co/pl7XEYaE3a","date":"Mon May 10 14:04:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy #MothersDay! https://t.co/lsU8z26yl4","date":"Sun May 09 18:01:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I also met with leaders from Life-Science Innovations and Nova-Tech Engineering at their offices in Willmar. We discussed how their innovative equipment is used around the world and how we can grow rural, family-owned businesses like these. Thanks for meeting! https://t.co/46S4S1EkkK","date":"Fri May 07 14:34:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I met with Col. Karl Jansen, Commander of the U.S. Army Corps of Engineers St. Paul District, at my Willmar office. We discussed some of the projects happening in the district and how we can work together. Looking forward to our partnership! @StPaulUSACE https://t.co/Xn4Pq7Cl4B","date":"Fri May 07 14:27:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Our economic recovery is stalling because of President Biden's anti-growth policies, and the president's proposed massive tax increases will only make it worse. https://t.co/xUszwZGKhP","date":"Fri May 07 13:37:07 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"On this #NationalDayofPrayer, please join me in praying for our state and country. May God continue to bless Minnesota and the United States of America! https://t.co/BKEUbIIsjQ","date":"Thu May 06 15:09:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Without a step-up in basis, the next generation of farmers will absorb massive tax increases just to continue their family farm. I cannot and will not support a plan that pads the federal coffers at the expense of America’s farmers. https://t.co/09Szkbt1I4","date":"Wed May 05 23:11:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden’s plan to eliminate stepped-up basis and assess capital gains taxes at death would be devastating for the agricultural economy.\n\nToday, @RepAdrianSmith and I wrote a letter, signed by 130+ of our colleagues, opposing the president's proposal. https://t.co/Jzq7H7YAMf","date":"Wed May 05 23:11:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations, graduates!","date":"Tue May 04 15:18:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It's Firefighter Appreciation Day, and I want to say THANK YOU to the brave men and women across the district who keep us safe. We appreciate you! https://t.co/ma2HgoteUO","date":"Tue May 04 14:41:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I couldn’t be prouder of these Osakis High School students and their willingness to serve our state and country. Thank you! @ISD213","date":"Tue May 04 14:20:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to all! https://t.co/RgiIcsGZSu","date":"Tue May 04 13:49:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"TODAY is the final day for high schoolers in Minnesota's 7th District to enter the Congressional Art Competition! All submissions must be received by 5:00 p.m. CT. Learn more here: https://t.co/R9RDJRxRrd","date":"Mon May 03 15:50:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to constituents with @NACSonline @NACSGR for a great virtual meeting. We discussed where they stand on some of the legislation moving through Congress &amp; the importance of these local retailers for our local communities. https://t.co/scIq150VNs","date":"Fri Apr 30 16:32:40 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Here's the letter @RepTomEmmer, @RepHagedorn, @RepPeteStauber and I sent to Governor Walz and leaders in the Minnesota Legislature: https://t.co/TgNsB6ycIO","date":"Fri Apr 30 15:11:03 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The #PaycheckProtectionProgram has been a godsend for businesses across #mn07. I joined my Republican colleagues from Minnesota in urging Gov. Walz &amp; the legislature to help support these businesses by exempting forgiven PPP loans from state income taxes. https://t.co/Tu8FiUY6Lq","date":"Fri Apr 30 15:06:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Marshall community celebrates historic ‘Trey Day’ https://t.co/Y3Y4yHOpTB","date":"Fri Apr 30 14:16:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to #mn07’s own @treylance09, a Marshall High School grad. Wishing you the very best!","date":"Fri Apr 30 00:45:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"\"The first 100 days of the Biden-Harris administration have brought an unprecedented tsunami of anti-life extremism. Almost daily, there are fresh assaults not only on the unborn and their mothers, but on the foundations of America itself...\" @SBAList  https://t.co/Zez83CXv7v","date":"Thu Apr 29 16:16:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations, @BobcatCompany! With the expansion now complete, Bobcat has tripled its footprint in Litchfield and is in the process of adding 100+ new jobs. Great news for our region!","date":"Wed Apr 28 18:41:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to the Chippewa Valley Ethanol Company on 25 years as a leader in Minnesota's ethanol industry. They now have nearly 900 shareholders and have brought tremendous benefit to farmers in the region. Wishing them another 25 years of success! https://t.co/yFzzodfteh","date":"Wed Apr 28 15:49:23 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Just a few days left until the deadline to enter the annual Congressional Art Competition! All high school students in Minnesota's 7th District are invited to submit their artwork.\n\nThe deadline is Monday, May 3 at 5:00 p.m. CT.\nhttps://t.co/7Pf8AZ5pTl","date":"Wed Apr 28 14:45:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"These are a few of the heartbreaking letters I received from elementary students in the Northwest Angle, where they are effectively trapped due to the U.S./Canada border closure.\n\nWhen will President Biden act on behalf of these American citizens? https://t.co/QUcizCiO33","date":"Tue Apr 27 19:52:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The deadline to participate in the annual Congressional Art Competition is Monday, May 3—and we need submissions! High school students from across the district are invited to participate.\n\nLearn more here: https://t.co/shQlXh7cKA","date":"Tue Apr 27 16:41:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I'm so proud of these 6th graders at Detroit Lakes Middle School, whose powerful lesson in kindness has been viewed by millions around the world. https://t.co/DCMK6H5gwF","date":"Mon Apr 26 19:01:50 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It's good to see @MN_Chamber recognize the major ramifications of the U.S./Canada border closure on northern Minnesota and the economy of our state.\n\nI continue to urge President Biden to engage with Prime Minister Trudeau on a bilateral solution. https://t.co/aRGLPNz9Wp","date":"Mon Apr 26 17:25:04 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to @RalcoUSA and the Knochenmus Family on 50 successful years! Even with its explosive growth over the past five decades, Ralco remains headquartered in Marshall. Thank you for your commitment to our communities!","date":"Thu Apr 22 20:08:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just voted NO on D.C. statehood. Instead of tackling the many challenges facing our country, Democrats are pursuing this for one reason and one reason only: consolidating their political power by adding two senators and a representative from a highly progressive constituency.","date":"Thu Apr 22 16:18:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There is a reason the push for statehood for the District of Columbia has failed in previous Congresses. It is not at all sensible policy, and playing politics at a time when many challenges remain unaddressed is a regrettable use of Congress’s time. https://t.co/VHv5v5Zk6O","date":"Thu Apr 22 16:18:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just wrapped up a great meeting with members of the International Dairy Foods Association, which includes a number of dairy processors in Minnesota—a critical piece of our agricultural economy! @dairyidfa https://t.co/bJ45Qma6K8","date":"Wed Apr 21 20:18:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My staff and I met with @JamesRajotte, the Senior Representative to the United States from Alberta, Canada, to discuss the ongoing restrictions at the U.S./Canada border.\n\nI will continue to push for a bilateral agreement between President Biden and Prime Minister Trudeau. https://t.co/E2cdPgzMvv","date":"Wed Apr 21 16:07:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to folks from @MinnBankers for taking the time to meet virtually today. We spoke about the continued economic recovery, the impacts of the president's proposed tax hikes, and more. https://t.co/GU4ySi6KU8","date":"Wed Apr 21 15:26:40 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I met with members of the @EthanolRFA Board of Directors this morning, including some producers from #mn07. It was a great discussion about the importance of the renewable fuels industry and how I can help in Congress. Thank you! https://t.co/YY1miqPI7A","date":"Wed Apr 21 15:04:18 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The crisis at the northern border is going to require a bilateral solution at the highest levels, but that will not happen until the Biden administration acknowledges the problem.\n\nThese are American citizens that need help!\nhttps://t.co/o9MeJRr6m9","date":"Tue Apr 20 13:39:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"\"In order for our state and the nation to heal, the focus on accountability must not be contingent upon political affiliation as every Member of Congress must ensure their actions as an elected official contribute to an atmosphere of unity, rather than lawlessness.\"","date":"Mon Apr 19 23:40:23 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I join @RepTomEmmer, @RepHagedorn, and  @RepPeteStauber in condemning @RepMaxineWaters's inflammatory rhetoric and incitement of violence in our home state last weekend.\n\nWe urge @SpeakerPelosi to provide for the immediate consideration of a resolution censuring Rep. Waters. https://t.co/U8NxVPKg1Q","date":"Mon Apr 19 23:40:21 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Scott and I are thrilled to announce the birth of our newest granddaughter, Hazel. We are blessed! https://t.co/CjlZFktIS9","date":"Mon Apr 19 22:06:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Learn more at: https://t.co/YiqwmiceFl #FindYourPark","date":"Mon Apr 19 15:43:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy #NationalParkWeek! My district includes the beautiful Pipestone National Monument—home to dozens of pipestone quarries still in use by American Indians today and surrounded by 301 acres of tallgrass prairie and a stunning waterfall.\n\nIt's worth a visit! #FindYourPark https://t.co/xgaMxrGfQR","date":"Mon Apr 19 15:43:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations!","date":"Fri Apr 16 23:04:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I met with students on their senior trip from Southwest Minnesota Christian High School in Edgerton today! Since the Capitol complex remains closed due to COVID, we met outside at The Spirit of Justice Park.\n\nThey are the first school group to visit me in Washington. Thank you! https://t.co/FwocpuYiUX","date":"Fri Apr 16 19:38:50 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Expecting taxpayers to foot the bill for a procedure many find morally reprehensible is callous, at best, and organizations that capitalize on the heartbreak of women as they line their own pockets have no businesses being funded by the government.","date":"Fri Apr 16 18:38:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, I introduced the Protecting Life and Taxpayers Act of 2021, which prohibits organizations that perform abortions from receiving federal funding and establishes a firewall between federal spending and the abortion industry. https://t.co/ZZXq4xlDrd","date":"Fri Apr 16 18:38:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Supreme Court is supposed to be insulated from partisan politics, but Democrats want to pack it with more justices to cement a permanent liberal majority.\n\nThat’s why I’m proud to cosponsor @RepDustyJohnson’s constitutional amendment to keep the Court at nine justices. https://t.co/1ADbLLTKcP","date":"Thu Apr 15 22:57:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"These are Canada's restrictions, and they have only gotten stricter in recent months. My colleagues and I have repeatedly attempted to elevate this issue – which can only be solved through a bilateral agreement at the highest level – to no avail.\n\nAgain, what is it going to take?","date":"Thu Apr 15 21:46:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"American families are separated, lives and livelihoods are on hold, and generational businesses have been brought to the brink of bankruptcy.\n\nWhat is it going to take to get this administration’s attention? https://t.co/oH3CnuWl8F","date":"Thu Apr 15 20:37:53 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, @PressSec demonstrated how little attention the Biden Admin has paid to the crisis at the US/Canada border.\n\nWhile they rent hotels for migrants illegally crossing the southern border, they won’t lift a finger to help American citizens who just want their gov't to listen. https://t.co/oOMd8DF4Hg","date":"Thu Apr 15 20:37:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Reminder: outdoor tornado warning sirens will sound across Minnesota at 1:45 p.m. and 6:45 p.m. today as part of Severe Weather Awareness Week.","date":"Thu Apr 15 17:22:48 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"“We Honor Veterans” is a program from @HRRV that honors veterans in end-of-life care for their service to our country. Congratulations to Bob Elliott and Normal Feld, both of Moorhead, who were recognized this week.\n\nThank you! 🇺🇸 https://t.co/HrZh25Uwjo","date":"Thu Apr 15 14:13:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Glad to support @RepMMM's resolution in support of the Trump Administration's Navigable Waters Protection Rule. Going back to the Obama-era rule would be harmful to Minnesota farmers, small businesses, and communities.","date":"Wed Apr 14 22:02:09 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just signed the discharge petition to force a vote on the Born Alive Abortion Survivors Protection Act.\n\nBabies born during botched abortions deserve to be given lifesaving care. All life is precious! #EndInfanticide https://t.co/KE2z3eGSx3","date":"Wed Apr 14 20:40:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"@SBAList @SteveScalise @Kat_Cammack @RepAnnWagner Proud to add my name. Life is worth defending! #EndInfanticide","date":"Wed Apr 14 20:31:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is great news for the right to life. Disability has no bearing on human value. All lives are precious, and babies born with special needs are no different.","date":"Wed Apr 14 15:09:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"State Rep. @jordanrasmusson and I also toured @LRH_Health in Fergus Falls. We toured their impressive facility and saw the top-notch care they’re providing for people all over the region. Thanks for having us! https://t.co/XbUECSkj8i","date":"Tue Apr 13 01:32:22 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We also visited the @USFWS Prairie Wetlands Learning Center in Fergus Falls, where they offer impressive environmental education programs to learners of all ages. Thank you to Mayor Ben Schierer &amp; many others for joining us! https://t.co/4xZDUnWmsW","date":"Tue Apr 13 00:39:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was glad to be joined by State Rep. @jordanrasmusson for a great meeting with business and community leaders in Fergus Falls last week. We discussed workforce development, housing, broadband access, and more. Thanks to @FergusChamber for putting on a great event! https://t.co/bhDB6fDRLo","date":"Tue Apr 13 00:39:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was a great visit to the @USFWS Prairie Wetlands Learning Center in Fergus Falls on Friday! https://t.co/2DRccXJaHY","date":"Sun Apr 11 02:37:07 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Line 3 is critical for so many reasons—good paying jobs, economic investment, safety, and energy independence.\n\n@RepPeteStauber and I support #Line3! https://t.co/l43RfT79Uf","date":"Fri Apr 09 16:14:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the folks at Enbridge for the tour of the Line 3 Pipeline Replacement Project today. #Line3 is a critical project for Minnesota, both in terms of economic development and safety.\n\nI am proud to support Line 3! https://t.co/putARdjRO7","date":"Fri Apr 09 03:14:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/Voz5PDHGzW","date":"Fri Apr 09 02:22:53 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The number one issue for employers in Greater Minnesota is attracting a qualified workforce. @RepPeteStauber and I met with community and industry leaders today at @clcmnedu in Staples to discuss workforce development programs, child care, housing, broadband, and more. https://t.co/PUJSf1v0Rb","date":"Fri Apr 09 02:22:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Roseau, Minnesota is the birthplace of @PolarisInc, so I stopped by for a tour of their facilities today. With a workforce of 1,400+ in Roseau alone, they are a major asset to the region and state. @PolarisORV https://t.co/WvA7aQRC4J","date":"Thu Apr 08 01:50:14 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I also met with the Roseau County Board of Commissioners and county staff today. We discussed their needs at both the state and federal levels, as well as the urgency surrounding the prolonged US/Canada border closure. https://t.co/WjpSkjY8qf","date":"Thu Apr 08 01:29:53 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had an excellent discussion with city officials and community leaders in Roseau this morning. We discussed their need for affordable housing, workforce development, and much more. Thank you to my friend Mayor Dan Fabian and others for hosting me at City Hall! https://t.co/l1vWZyHATA","date":"Thu Apr 08 01:21:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I met with leaders from LifeCare Medical Center in Roseau this morning.  They run an impressive facility—a “Top 100 Critical Access Hospital” and an important medical hub for northwest Minnesota. https://t.co/UDgHhzeMhI","date":"Wed Apr 07 17:09:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to those who joined @RepPeteStauber and me in International Falls today, as well as the Canadian Members of Parliament who joined us virtually. We are going to keep pushing our governments for action to address the US/Canada border closure. https://t.co/3qPnZ4gJTX","date":"Wed Apr 07 02:44:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I also met with officials from Lake of the Woods County today. Their top priority is the U.S./Canada border, the closure of which has affected everything from commerce to medicine to family relationships for residents of this border county. https://t.co/oRF4fM9Gpp","date":"Wed Apr 07 02:24:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to Baudette Mayor Rick Rone &amp; city officials for hosting me this afternoon. We had a great discussion on the city’s needs and how I can help be their advocate in Congress. https://t.co/9Am73H41Hr","date":"Wed Apr 07 01:30:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The prolonged closure of the U.S./Canada border has had a major impact on those who live and work in border communities. Thanks to those who joined @RepPeteStauber and me today as we continue our call for an immediate bilateral solution. https://t.co/3fnGBJlIHR","date":"Tue Apr 06 19:36:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"He is Risen! Happy Easter! https://t.co/hy9RNxWVBs","date":"Sun Apr 04 14:58:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had an excellent visit to Ash Grove Dairy near Lake Benton this week. It was great to hear directly from dairy farmers in the district about the industry and their needs. Thank you for hosting me! https://t.co/kEQnXeJwta","date":"Sat Apr 03 20:35:10 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"May God be with the family, friends, and colleagues of @CapitolPolice Officer William “Billy” Evans, who was killed in the line of duty protecting our Capitol today. Please continue to keep the men and women of law enforcement in your prayers.","date":"Sat Apr 03 00:44:54 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Glad to be with the Lyon County Board at this morning’s meeting in Marshall. Thank you for having me! https://t.co/BCTV76A07Z","date":"Fri Apr 02 20:14:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to the Mayor Bob Byrnes, the City of Marshall, and the Marshall Chamber of Commerce for hosting me this morning. https://t.co/ESJE4alSFz","date":"Fri Apr 02 18:20:01 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I met with Southwest MN State University President @KumaraJayasuri2 &amp; @RalcoUSA executives today, highlighting their partnerships in ag education &amp; research. I appreciate their focus on growing the ag sector and creating jobs in rural communities. https://t.co/cBvNjnl2m1","date":"Fri Apr 02 18:16:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Please join me in praying for the @CapitolPolice, first responders, and all law enforcement involved.","date":"Fri Apr 02 18:11:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Great being in Marshall today and checking in with @AveraMarshall CEO Debbie Streier &amp; Chief Medical Officer Dr. Steve Meister. We’re fortunate to have such great medical care available right here at home. https://t.co/blncrWWX3Y","date":"Thu Apr 01 23:39:03 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden's \"infrastructure\" plan will raise taxes, kill jobs, and create massive new bureaucracy to fund their Green New Deal pet projects.\n\nDemocrats want TRILLIONS in new spending, and they'll raise taxes on families, small businesses, farms, and retirements to do it. https://t.co/0KuU5RZgRm","date":"Wed Mar 31 15:45:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I toured @HyVee’s new Dollar Fresh store in Glencoe &amp; met with some of their employees this afternoon. The store is a great addition to the community! Thanks for having me. https://t.co/UTiBbcGnhV","date":"Wed Mar 31 02:48:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"https://t.co/uBncba5v9Q","date":"Wed Mar 31 02:21:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proposed veterans homes in Bemidji &amp; Montevideo will finally receive their federal match. They have been working for 10+ years to get this done. I was honored to support them in the MN Senate &amp; continue to support them today. They are going to make a big difference for area vets.","date":"Wed Mar 31 02:21:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The deadline for small businesses to apply for a forgivable loan under the Paycheck Protection Program has been extended until May 31, 2021.\n\nLearn more on the @SBAgov website:\nhttps://t.co/HbW0CEbyIA","date":"Tue Mar 30 19:43:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Ron Mackedanz of Kandiyohi on being honored with the Order of Saint Maurice for his \"continued service to the infantry community.\"\n\nRon served in Vietnam, where he received two purple hearts and, later, the Silver Star. https://t.co/nKdyrKqC1z","date":"Tue Mar 30 14:08:40 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to firefighters &amp; law enforcement for their work to keep this situation under control.\n\nConditions remain ideal for wildfires to spread uncontrollably. Please be safe!","date":"Tue Mar 30 02:47:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Beginning tomorrow, all Minnesotans over the age of 16 will be eligible to receive the COVID-19 vaccine. Here's how you can sign up: https://t.co/6TWQnH6Jzf","date":"Mon Mar 29 13:53:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Hosanna! Blessed is he who comes in the name of the Lord! #PalmSunday https://t.co/qbJWydPSDV","date":"Sun Mar 28 19:52:26 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was hosted by the Nelson family and the Red River Valley Sugar Growers Association yesterday for a tour &amp; roundtable discussion on the industry’s importance to our ag economy. Thank you! #mn07 https://t.co/XS2e2v55yY","date":"Sat Mar 27 22:40:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"High school students from Minnesota's 7th District are invited to participate in the annual Congressional Art Competition! This longstanding U.S. Capitol tradition is open to all public, private, charter &amp; home school students in grades 9-12. #mn07 https://t.co/R9RDJRxRrd","date":"Thu Mar 25 16:43:01 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, on National Medal of Honor Day, we recognize the heroism of those who have received our nation's highest honor.\n\n72 Minnesotans have received the Medal of Honor \"for the Conspicuous Gallantry and Intrepidity in Action at the Risk of Life Above and Beyond the Call of Duty.” https://t.co/Vamog1JX0Q","date":"Thu Mar 25 15:03:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This afternoon, my colleagues and I again urged @SecVilsack and @USDA to reopen the Coronavirus Food Assistance Program (CFAP) and provide needed assistance to biofuels producers &amp; processors. https://t.co/jinvFYcO7Z","date":"Wed Mar 24 19:05:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Finding affordable childcare remains a difficulty for families. As working moms, @RepAshleyHinson, @RepMaryMiller &amp; I understand that challenge, and are putting forward policies to make childcare options more readily available &amp; support parental choice. https://t.co/BlSC2v5Hpw","date":"Wed Mar 24 16:28:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Great to see Theresia Gillie of Hallock recognized. As a @MNSoyGrowers director &amp; Kittson Co. Board chair, she is an advocate for ag &amp; her community and, after tragedy struck her family, a powerful voice for farmers struggling with mental health. #mn07 https://t.co/120Q7SDYK3","date":"Wed Mar 24 16:07:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Finding affordable childcare has become nearly impossible for many working families. @RepAshleyHinson, @RepMaryMiller &amp; I have been working on legislation to encourage more providers to enter the market and give more flexibility to parents. https://t.co/JpBctwKqxK","date":"Tue Mar 23 18:13:20 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I proudly joined my colleagues in this letter to @SpeakerPelosi. The votes in #IA02 were counted, recounted, and certified by a bipartisan panel, but now Democrats are trying to steal the race and pad their razor-thin majority. Stop playing politics!","date":"Tue Mar 23 15:03:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, we celebrate the hard work of farmers and producers across Minnesota and the country, and we honor the essential role agriculture plays in our society.\n\nHappy National Agriculture Day! #NationalAgDay #AgDay21 https://t.co/kxmCRArppN","date":"Tue Mar 23 14:36:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"More information can be found on the State of Minnesota's Vaccine Connector site https://t.co/Xw1hWCn37S","date":"Tue Mar 23 14:30:53 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The State of Minnesota has opened a temporary community vaccination site at the MERIT Center in Marshall. The state also has community vaccination sites in Worthington, Mankato, St. Cloud, St. Paul, Bloomington, Rochester, Duluth, and Minneapolis. https://t.co/JmOwB1GtNV","date":"Tue Mar 23 14:30:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Red River has been named one of the top fishing destinations in the country! #mn07 https://t.co/pwvFTzduOk","date":"Tue Mar 23 13:54:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congrats, @BSUBeaversMHKY! 🏒","date":"Sun Mar 21 23:23:01 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Our new district office in Moorhead is open to serve the people of Minnesota’s 7th District! There’s another district office in Willmar.\n\nMy staff is available to help constituents with federal issues and more. Visit https://t.co/LayrQ7Yoy0 for more info. https://t.co/sa1I3RpVw7","date":"Sat Mar 20 20:13:01 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is an important, personal message from my friend and colleague @RepHagedorn. \n\nEarly detection saves lives!","date":"Sat Mar 20 15:47:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Finding affordable child care has become a near-impossibility for many working families. When making decisions for their own family, parents know best—and we should be supporting them in choosing which child care option works for them.","date":"Thu Mar 18 19:43:12 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just introduced my first bill in Congress! The Child Care Choices Act is aimed at easing the child care shortage by prioritizing choice and opening the doors for more home-, family-, and faith-based child care options in our communities. https://t.co/A5Y2EzKSSt","date":"Thu Mar 18 19:43:11 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congrats to Sergeant Paul Gorski on his retirement after 33 years with the Minnesota State Patrol! Sgt. Gorski served with integrity as part of the executive protection detail for the past four governors.\n\nWishing him a wonderful retirement! @MnDPS_MSP","date":"Thu Mar 18 17:40:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Democrats politicized it and packed the bill with provisions straight from their progressive wish list. I am a co-sponsor of a ‘clean’ reauthorization bill to funds these critical programs without questionable, partisan policies attached. Democrats were unwilling to consider it.","date":"Thu Mar 18 01:15:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Acts of violence against any individual are reprehensible, and I will strongly support any policy that protects against domestic violence, sexual abuse, and harassment. This bill, however, falls short.","date":"Thu Mar 18 01:15:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I voted against the Violence Against Women Act reauthorization. It’s a highly partisan distortion of the original Act, which passed 3+ decades ago with wide, bipartisan support. The original Act was uncontroversial &amp; Congress has routinely reauthorized it on a bipartisan basis.","date":"Thu Mar 18 01:15:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Women do not need a constitutional amendment to tell us we are equal; the Constitution and federal law already provide equal protection for ALL Americans. https://t.co/f8XNXlyiPU","date":"Wed Mar 17 21:13:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just voted against extending the deadline to ratify the Equal Rights Amendment. This unconstitutional resolution does nothing to advance equality. Instead, it is being used by far-left special interests and activists to enshrine pro-abortion rights in the Constitution. https://t.co/7VawV9h5hB","date":"Wed Mar 17 21:12:03 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"On Saturday, Adeline Litzau of Glencoe celebrated her 100th birthday. What a milestone!\n\nCongratulations, Adeline! https://t.co/cTmwcLcSzq https://t.co/p3nypaCubJ","date":"Wed Mar 17 17:24:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy Saint Patrick's Day! https://t.co/WD5zyrpXZf","date":"Wed Mar 17 14:24:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Four decades after the deadline to ratify, Democrats are using the Equal Rights Amendment to enshrine a right to an abortion in the Constitution.\n\nI do not need a constitutional amendment to tell me I am equal. The Constitution already requires equal protection for all Americans. https://t.co/sFVsQeOGLY","date":"Wed Mar 17 01:31:05 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"All enrolled veterans served by the St. Cloud VA Health Care System are eligible to schedule a COVID-19 vaccine appointment at the St. Cloud VA Medical Center or at VA clinics in Alexandria, Brainerd, and Montevideo. \n\nSee the link for more information. https://t.co/vxbOZAGUV6","date":"Tue Mar 16 14:19:11 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The 2nd annual Otter Tail County Polar Plunge raised more than $50,000 for @SOMinnesota. Incredible job for a great cause! https://t.co/kMLG4QpMgT","date":"Tue Mar 16 14:09:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The Lac qui Parle Valley/Dawson-Boyd dance team won its third consecutive state title in both Jazz and High Kick at this past weekend's state tournament. Yellow Medicine East placed second in both events.\n\nCongratulations to all! https://t.co/2cyaTipwJM","date":"Mon Mar 15 21:06:20 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Dan Fabian was a champion for northwest Minnesota in the state legislature. Now, he’s continuing to serve his community as mayor of Roseau—and doing a great job! https://t.co/i6uMRuVZe7","date":"Sun Mar 14 22:02:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"More than 1 in 5 farms in my district lack access to high-speed internet, which is critical for health care, education, farming, and much more. It's a top priority of mine to get broadband access to these rural communities—and not just to cities, but to peoples' doors. https://t.co/p1n6MnjAyK","date":"Sat Mar 13 20:52:15 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is great! Students at @alexmnschools Discovery Middle School raised more than $45,000 for @SOMinnesota at their third annual Cool School Plunge.\n\nThank you for making a difference! https://t.co/1nIUwBrjk5","date":"Fri Mar 12 17:12:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to Terry Wolters of Pipestone on being named president-elect of the National Pork Producers Council! Terry is a leader in the pork industry and a strong advocate for farmers. @NPPC @PIPESTONEpigs  https://t.co/51ABcNdzCq","date":"Thu Mar 11 19:19:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"These bills do NOT stop criminals from getting guns, but they do undermine the ability of my constituents – many of whom are hunters and sportsmen – to exercise their Second Amendment rights.","date":"Thu Mar 11 18:00:03 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Universal background checks criminalize private firearm transfers &amp; make it impossible for law-abiding gun owners to acquire, or borrow/lend, firearms. The bills also give government the ability to delay a firearm transfer indefinitely without proof that a person is ineligible.","date":"Thu Mar 11 18:00:03 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just voted against the Democrats' gun control bills. I oppose any attempt to restrict the constitutional rights of law-abiding Americans, and that’s exactly what these bills do. https://t.co/YiLseHODN6","date":"Thu Mar 11 18:00:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was glad to meet with mayors and city councilmembers from across the district for a discussion on how these communities are recovering from the pandemic and the challenges they face moving forward. Thank you! #mn07 https://t.co/gxLDFcXWgB","date":"Thu Mar 11 17:25:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This was never about COVID-19; this has always been about advancing a far-left agenda. With millions for Planned Parenthood, $1.7b for Amtrak and $50m for ‘environmental justice,’ the bill does nothing to help struggling small businesses or bring kids back to the classroom.","date":"Wed Mar 10 19:20:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"If Democrats were serious about providing relief to the American people, it would be temporary, targeted, and tied to COVID-19. \n\nThis bill falls far short.","date":"Wed Mar 10 19:20:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just voted against the \"relief\" bill—a $1.9 trillion barrel of pork of which only a fraction is for actual relief. Democrats left Republicans completely out of the discussion, opting to negotiate among themselves and arriving at a bloated, divisive bill cloaked as a compromise.","date":"Wed Mar 10 19:20:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Students are back for full-time, in-person learning at @WillmarSchools, and things are running smoothly! Thanks to these students, educators, and staff for setting a great example. https://t.co/1rzslExrRD","date":"Wed Mar 10 18:08:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Minnesota has a proud history of supporting organized labor, and I support the right of employees to collectively bargain. However, this is a misguided, unbalanced approach that could permanently alter the job market &amp; threaten the constitutional rights of employees &amp; employers.","date":"Wed Mar 10 01:28:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I voted against the PRO Act. There must be a balance between a union’s right to organize and an employer’s ability to respond, but this bill leaves employers—many of which are small businesses—to absorb the extra costs and navigate the vague legal standards.","date":"Wed Mar 10 01:28:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a great virtual meeting with with constituents from @mnwheat this afternoon. We discussed agriculture and how I can assist them &amp; their industry. https://t.co/AtNH5cGBEa","date":"Tue Mar 09 21:30:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"More than 1,100 @MNNationalGuard soldiers have been deployed to the Middle East as part of Operation Spartan Shield, including units from Detroit Lakes, Crookston &amp; Sauk Centre in #mn07. I'm praying for them and their families as they serve our country. https://t.co/hl8HnFaOIq","date":"Tue Mar 09 19:19:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Democrats are pushing a series of divisive, highly controversial bills – including two extreme gun control bills that undermine the constitutional rights of Americans. I just spoke on the floor of the House against these egregious measures. https://t.co/IZEB9hjQLk","date":"Mon Mar 08 22:32:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am proud to be a member of the 117th Congress with a record class of strong, inspiring Republican women. \n\nOn this #InternationalWomensDay, we honor and celebrate women across the country doing amazing things. https://t.co/emaTJma8QY","date":"Mon Mar 08 18:51:14 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I agree! This is so critical for the many Minnesotans who rely on cross-border travel and tourism. @RepPeteStauber, @RepTomEmmer, and I are committed to continuing our push for a bilateral agreement to re-open the Canadian border.","date":"Sun Mar 07 00:07:39 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations to the 2020 University of Minnesota Farm Families of the Year from the 7th District! #mn07 @umn https://t.co/uXLhoXpIF2","date":"Fri Mar 05 17:44:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It was great to spend some time with the men and women of law enforcement at this morning’s @MNPoliceAssn virtual meeting. Thanks for having me! #mn07 https://t.co/UEaXJ5ObRv","date":"Thu Mar 04 19:48:14 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Elections belong to the people. The so-called “For the People Act” would concentrate power among entrenched Democrat politicians instead. https://t.co/L7rR0M6RMD","date":"Thu Mar 04 04:20:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The path forward is through supporting law enforcement and working together on solutions that assist them in developing the tools necessary to keep our communities safe and protect the rights of the citizens they serve. Unfortunately, this bill falls far short.","date":"Thu Mar 04 02:07:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Just voted no on policing “reform” bill. Disguised as ‘accountability,’ it demonizes law enforcement &amp; hinders their ability to do their job. There is room for common ground, but Democrats rejected any attempt by Republicans to weigh in w/ solutions that might make a difference.","date":"Thu Mar 04 02:07:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just spoke against the Democrats’ so-called “policing reform” bill.\n\nThis bill demonizes law enforcement, hinders their ability to do their job, and limits their capacity to respond to calls for help. I’m voting no! https://t.co/5PJ3GYesXA","date":"Thu Mar 04 01:17:07 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Democrats just tried to amend their so-called “election reform” bill to lower the voting age to 16. Apparently felon voting and taxpayer funding of their campaigns wasn’t enough.","date":"Wed Mar 03 20:26:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Speaker Pelosi's top priority is a bill that funds campaigns with taxpayer dollars, legalizes voting for convicted felons, weakens election security, and makes it harder to protect against voter fraud.\n\n@GOPLeader lays it all out:\nhttps://t.co/XrGcc4cgCk","date":"Wed Mar 03 17:01:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to the @USNavy House Liaison’s Office for stopping by this morning! I will proudly display the Navy seal in my office. https://t.co/eh4FJZpCAq","date":"Wed Mar 03 16:39:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"You just can’t make this stuff up. Democrats in the House just put up an amendment to allow a person convicted of ANY CRIME (yes, even violent felonies) to vote, even if they’re still in prison.\n\nThese are the Democrats’ priorities?","date":"Tue Mar 02 18:33:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I'm tracking the situation in Minneapolis. While officials will be pulling troopers, DNR officers &amp; Nat Guard personnel for the trial, #mn07 will not see a decrease in law enforcement services. I appreciate the continued work from @MNNationalGuard, @MnDPS_MSP &amp; others involved.","date":"Tue Mar 02 17:18:17 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As we debate police reform in the Rules Committee, I am proud to support my colleague @RepPeteStauber, a former police officer himself, as he highlights the importance of building trust between law enforcement and the communities they serve. https://t.co/YJ4l194SAb","date":"Mon Mar 01 22:49:14 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The so-called “For the People Act” is really an egregious liberal wish list that creates taxpayer-funded campaigns, overrules state voter ID laws, politicizes nonpartisan federal agencies, and removes the ability of states to manage their own elections. This is BAD for democracy! https://t.co/1gGaT7vXNY","date":"Mon Mar 01 18:38:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am pleased to announce the Bemidji Regional Airport is the recipient of a $1 million federal grant under the FAA's Airport Coronavirus Response Grant Program. https://t.co/ZMHWD1t4pl","date":"Mon Mar 01 18:01:05 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Lawmakers from struggling border districts pressure Biden to ease coronavirus travel restrictions https://t.co/cpSP2PyHTG","date":"Mon Mar 01 14:13:27 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The $1.9 trillion so-called “relief” bill might be good for ultra-liberal progressives in San Francisco, but it does not come close to meeting the needs of the people of Minnesota’s Seventh District. https://t.co/ugsPni4A4X","date":"Sat Feb 27 20:58:50 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Only 9% of the bill goes toward COVID-19 relief.\n\nThis might be good for ultra-liberal progressives in San Francisco, but it does not come close to meeting the needs of the people of Minnesota’s Seventh District. https://t.co/uLKZ0KG8bN","date":"Sat Feb 27 06:52:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just voted against the $1.9 trillion so-called \"relief\" bill. \n\nWhile the bill includes billions for Planned Parenthood, underground rail in Silicon Valley, paying federal employees to stay home &amp; foreign aid, it does nothing to help small businesses or get kids back in school.","date":"Sat Feb 27 06:52:44 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My Willmar district office is open and ready to serve the people of Minnesota’s 7th District! We’ll be announcing a second district office soon.\n\nMy staff is available to help constituents with federal issues and more. Visit https://t.co/LayrQ7Yoy0 for more info. https://t.co/4QRFucgJKt","date":"Fri Feb 26 19:14:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just voted against the so-called \"Equality Act.\"\n\nThe bill threatens the free exercise of religion, undermines the freedom of conscience, and is a backdoor for anti-life activists to create a legal right to an abortion. Read my full statement here: https://t.co/qk7GEafP39","date":"Thu Feb 25 21:30:54 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy #NationalFFAWeek! FFA has such a rich history in Minnesota, preparing its members for careers in agricultural science, business, and technology. These students are our future! @MNFFA @NationalFFA https://t.co/dZqfXy4g2K","date":"Thu Feb 25 17:20:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to Whip @SteveScalise for stopping by my office today with such a thoughtful gift. Looking forward to working together! https://t.co/5kGrAXWOWy","date":"Thu Feb 25 16:17:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Important information for residents of #mn07 as many of these locations are in the district.","date":"Thu Feb 25 04:22:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"My district office staff also visited Angle Inlet, the Angle town of ~60, last weekend to check in and see how our office can help support them. The community is facing serious challenges because of the prolonged border closure. https://t.co/hYs9pMdCMW","date":"Thu Feb 25 02:55:07 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I spoke on the floor of the House tonight against the so-called \"Equality Act,\" a bill that's really about advancing the pro-abortion agenda—not protecting women or promoting equality. https://t.co/6sdtJ2c53r","date":"Wed Feb 24 02:10:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Here are a few more photos from the 22-mile ice road connecting the Northwest Angle to the mainland U.S. https://t.co/Tj3uN2jmbV","date":"Tue Feb 23 23:11:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I love Minnesota, and it is an honor to serve my community and state. Thank you to the @IWF for the profile! https://t.co/opxBstKK3v","date":"Tue Feb 23 18:34:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"But that’s a temporary, inconvenient solution—and when the ice thaws in the spring, the Angle will be cut off again until the border is re-opened.\n\nI urge President Biden to work with the Canadian government on a solution that gives these Minnesotans their livelihoods back. #mn07","date":"Tue Feb 23 18:05:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"For almost a year, the US/Canada border has been closed. That’s a big problem for residents of Minnesota’s Northwest Angle, which is only accessible by road through Manitoba.\n\nSo, Angle residents plowed a 22-mile ice road across the frozen lake, hoping to attract visitors back. https://t.co/N4qBeh30Dl","date":"Tue Feb 23 18:05:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As President Biden Canadian PM Justin Trudeau meet today, I hope the yearlong border closure will be a topic of discussion. The closure has hit Minnesotans along our Canadian border especially hard, and they need a solution. https://t.co/NuEYlQDYy4","date":"Tue Feb 23 16:28:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Along with @RepPeteStauber &amp; @RepTomEmmer, I sent a letter to President Biden urging him to work with the Canadian government to re-open the border for non-essential travel.\n\nThe closure has devastated local border economies, which rely heavily on tourism &amp; cross-border travel. https://t.co/2Avlcd82iG","date":"Mon Feb 22 23:40:58 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"“Do you believe in miracles? YES!” #MiracleOnIce https://t.co/7ehXHluIad","date":"Mon Feb 22 18:40:05 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"ON THIS DAY in 1980, the US Men's Olympic Ice Hockey team stunned the world with a 4-3 upset over the Soviet Union. The #MiracleOnIce is one of the greatest sports moments in history.\n\n12 players were from MN, with 2 from #mn07: Dave Christian of Warroad &amp; Neal Broten of Roseau. https://t.co/hIKVkHwjB6","date":"Mon Feb 22 17:05:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"While the CDC has said schools can safely re-open, many remain shuttered—and students are suffering. We can and must safely re-open all schools for in-person learning now.\n\nWhat do you think? I invite you to share your story. https://t.co/NnLXq9Bngc","date":"Mon Feb 22 16:44:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I spoke with @cspan for their series on new Members of Congress. We covered a lot of ground in a short time, so take a listen.\n\nAfter more than 30 years, I am proud to be a new voice for western Minnesota in Congress! #mn07 https://t.co/1XaihvrGg9","date":"Sun Feb 21 00:00:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The malicious actions of a small group of protesters today put the lives of residents, workers, and law enforcement at risk. As we learn more about the situation, I am grateful for the quick response from law enforcement.","date":"Sat Feb 20 00:23:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Digi-Key is another business in my district seeing explosive growth. They employ 4,000 people at their Thief River Falls HQ and are looking to hire hundreds more. Such a critical part of our region! @digikey  https://t.co/cIbtzT6IXY","date":"Fri Feb 19 15:46:23 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"As we enter the season of Lent, we do so with solemn reflection and joyful anticipation of Christ's victory over sin. Wishing you peace and blessings on this holy #AshWednesday. https://t.co/46nZUsPWcd","date":"Wed Feb 17 16:15:06 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Arctic Cat has been a major community partner in Thief River Falls for 60+ years. They’re even looking to hire hundreds more workers to keep up with demand. Thanks for the tour! https://t.co/qpEJojzGL6","date":"Wed Feb 17 14:56:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I loved visiting Arctic Cat in Thief River Falls today. They’ve actually doubled their output compared to last year as people want to get outside, and they’re hiring. Thanks for having me! @arcticcat_snow https://t.co/MZ2n4Chx0f","date":"Wed Feb 17 01:55:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden and @GovTimWalz should follow the science. Our schools need to re-open for full-time, in-person learning for all students. https://t.co/DbpDKVrEgN","date":"Tue Feb 16 21:16:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Glad to be in Thief River Falls today! I just left a meeting at the historic Carnegie Library, which was a gift from philanthropist Andrew Carnegie more than a century ago and was recently restored by the community. I enjoyed seeing this piece of local history! #mn07 https://t.co/tshrBRxBVH","date":"Tue Feb 16 19:54:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is disappointing news for Minnesotans in border communities whose livelihoods rely on tourism and cross-border travel. We need a plan for allowing non-essential travel to resume.","date":"Mon Feb 15 21:06:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"There is currently $1 TRILLION+ in unspent COVID relief funds.\n\nWe should be focused on putting that money to work for the American people before spending trillions more. https://t.co/kzDvYJbndC","date":"Mon Feb 15 18:24:54 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Happy #PresidentsDay! https://t.co/qmoyOdMBai","date":"Mon Feb 15 15:59:28 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Great meeting with the folks at @AgCountry this morning! https://t.co/YjEBbcMhTW","date":"Fri Feb 12 19:00:40 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Despite agreement that this is a real issue facing millions of Americans, my Democrat colleagues called our proposals to invest in rural connectivity a “poison pill” and promptly blocked them. https://t.co/8YlqYEQjJZ","date":"Thu Feb 11 17:35:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Just as it was my turn during our committee hearing to speak in favor of broadband funding, my internet connection dropped—highlighting the \"digital divide” in my district, where 1 in 5 farms lack access to high-speed internet. https://t.co/BNa49uff5Z","date":"Thu Feb 11 17:32:32 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It's time for President Biden to uphold his \"unity\" pledge.\n\nAt a time when the American people need every competitive advantage, the president threatens to stifle our “Great American Comeback” in its tracks. https://t.co/PztLw9dKu5","date":"Wed Feb 10 14:31:59 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is an unspeakable tragedy. Scott and I join all Minnesotans in praying for the victims, their families, law enforcement, and the community.","date":"Tue Feb 09 22:37:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The abortion industry is using the pandemic to permanently enact its extreme agenda. This ultimately harms babies, mothers, and families. \n\nI will continue to defend the right to life. https://t.co/U69CyMLvs5","date":"Tue Feb 09 17:38:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Another big victory for the Line 3 pipeline replacement project and all its benefits for Minnesota.","date":"Tue Feb 09 01:21:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Democrats want to hike the minimum wage to $15/hour in the next COVID relief bill, but the nonpartisan Congressional Budget Office says it would increase the deficit by $54 BILLION and cost 1.4 MILLION jobs over the decade.\n\nThat is not acceptable.","date":"Mon Feb 08 17:27:07 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am so sad to hear of my colleague @RepRonWright’s passing. My sincere condolences to his family, friends, and constituents.","date":"Mon Feb 08 16:25:03 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Looking forward to representing Minnesota’s 7th District as the Ranking Member of the House Ag Subcommittee on Commodity Exchanges, Energy and Credit, R&amp;D, and Broadband. https://t.co/yvjPn7hMJn","date":"Sat Feb 06 20:37:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am honored to be named the Ranking Member of the House Agriculture Subcommittee on Commodity Exchanges, Energy and Credit, R&amp;D, and Broadband! \n\nI will be a voice for the thousands of farmers and producers that call our district home. #mn07","date":"Fri Feb 05 23:36:37 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Buoyed by President Biden denying #KeystoneXL its federal permits, urban environmentalists and far-left special interests are demanding the Administration ground Enbridge #Line3, too.\n\nIf they succeed, it would be catastrophic for northern Minnesota. https://t.co/AZClOdemYd","date":"Fri Feb 05 00:30:04 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is wonderful news. Kids need to be in school!","date":"Thu Feb 04 15:15:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I voted against the Democrats’ budget resolution tonight. With more than a trillion in unspent COVID relief, we should be focused on putting that money to work for the American people before spending trillions more. https://t.co/2NR5cN4tQn","date":"Thu Feb 04 01:33:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"We remember the life of U.S. Capitol Police Officer Brian Sicknick. As he lies in honor in the Capitol Rotunda, we mourn his loss and honor his sacrifice. https://t.co/wkkishRjX4","date":"Wed Feb 03 17:19:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thanks to the @USArmy House Liaison Office for the visit this morning and for the Army seal! It will proudly hang in my office. https://t.co/HCFJPrJOlY","date":"Wed Feb 03 15:28:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am glad the Minnesota Court of Appeals denied the challenge to the #Line3 replacement pipeline project. \n\nThis is why it’s so important for the communities I represent 👇🏻","date":"Wed Feb 03 02:24:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is excellent news!","date":"Wed Feb 03 01:12:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The CDC says schools can safely re-open. President Biden repeatedly promised he would \"listen to the scientists,\" but now he's siding with his political allies and Big Labor over what the experts are saying.\n\nOur kids need to be back in school! #OpenSchools https://t.co/o25cMvk7d0","date":"Tue Feb 02 17:05:08 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden has been in office for only 12 days, but he's already signed 25 executive orders. That’s the most ever so soon in a presidency. https://t.co/oKH0gPc49o","date":"Tue Feb 02 02:28:30 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is important vaccine information for Minnesotans over the age of 65.","date":"Mon Feb 01 15:30:34 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Outstanding job by these New London-Spicer HS National Honor Society students. Their polar plunge raised over $5,000 for the Special Olympics! https://t.co/yf9lbQtDkU","date":"Mon Feb 01 15:22:47 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This move, while welcome, runs contrary to President Biden’s order cutting off direct aid to ag producers. Instead of legislating by executive fiat, it’s past time for the “unity” president to work w/ Congress on bipartisan solutions for the ag community. https://t.co/HXB09e1ght","date":"Sun Jan 31 22:01:07 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Line 3’s tax revenue supports our schools, funds essential services, and helps protect our environment. It will aid in our pursuit of affordable, sustainable energy for Minnesota consumers. Its benefits are immediate and long-term.\n\nI am proud to support #Line3! \n3/3","date":"Sun Jan 31 02:09:43 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The project brings $162 million in construction-related revenue to communities along its route. It supports thousands of skilled labor jobs filled by Minnesotans who cannot simply “build solar panels instead,” as one of the president’s advisors suggested. 2/","date":"Sun Jan 31 02:09:42 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Among those protesting the Enbridge Line 3 Replacement Project today was Rep. Ilhan Omar. While Line 3 has been a favorite punching bag of Minneapolis liberal special interests for years, they could not be more wrong about what it means for our communities. 1/","date":"Sun Jan 31 02:09:41 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"For nearly a year, the Angle has been virtually shut off from the world as the US/Canada border remains closed. That's why I joined colleagues from border states to implore the Biden Admin. to work towards a bilateral plan to re-open the border to more non-essential travel. 2/2 https://t.co/Dmbgguyzpz","date":"Fri Jan 29 20:17:20 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I represent the Northwest Angle of Minnesota—the only point in the mainland U.S. above the 49th parallel. Surrounded by Canada on one side and Lake of the Woods (USA) on the other, you must first enter Canada before crossing back into the U.S. to reach the Angle by land. 1/2 https://t.co/4oaUlGMdAy","date":"Fri Jan 29 20:17:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Warroad, Minn. comes together on a miles-long skate path https://t.co/oc7Z7tQ7V3","date":"Fri Jan 29 19:15:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"It started with two neighbors connecting their backyard ice rinks along a frozen river. It turned into a 2.5-mile frozen skate path connecting seven ice rinks in the community of Warroad, just miles from the Canadian border.\n\nMinnesotans are the best. #mn07 https://t.co/RiiE7rIvmV","date":"Fri Jan 29 19:15:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden's \"unity\" agenda is proving to be divisive and radical. His dozens of executive actions, far more than any previous president so soon in an administration, puts campaign promises to the far-left before supporting American workers.\n\nThat’s not unifying. https://t.co/1V49xfa14H","date":"Fri Jan 29 00:06:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden continues to undo, by executive order, much of the bipartisan work done by President Trump. Now, the Biden Administration has suspended CFAP payments to farmers until further notice, freezing billions of dollars in relief. More here: https://t.co/7fAfsvWObX","date":"Thu Jan 28 19:23:50 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, we commemorate the 76th anniversary of the liberation of Auschwitz-Birkenau, and we remember the six million Jewish lives—and the millions of other lives—lost during the Holocaust. We must never forget. #HolocaustRemembranceDay https://t.co/TYgnl8F4D7","date":"Wed Jan 27 17:58:07 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Looking forward to serving Minnesota's 7th District as a member of the Committee on Agriculture, Committee on the Judiciary, and the Committee on Rules in the #117thCongress! https://t.co/uoO9qydasa https://t.co/Xsxk3XOA87","date":"Wed Jan 27 17:12:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Congratulations!","date":"Wed Jan 27 14:04:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I had a great meeting with Maj. Gen. Manke, Lt. Col. Hull, Brig. Gen. Gabrielli &amp; 1SG Thompson of the @MNNationalGuard today. Glad for the opportunity to learn about their federal priorities and discuss how we can work together. Thank you! https://t.co/lDsKmil10M","date":"Tue Jan 26 18:21:25 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to join nearly 200 of my colleagues in support of the Hyde Amendment. For four decades, the bipartisan Hyde Amendment has prevented our tax dollars from funding abortions. Americans should NOT be forced to subsidize abortions! #SaveHyde https://t.co/pUyP4EZkHQ https://t.co/cJrFF8Oo4B","date":"Tue Jan 26 15:19:02 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Minnesota’s 7th District is among the top ag-producing districts in the nation and home to more than 30,000 farms.\n\nAs a member of the House Agriculture Committee, I am committed to being a strong voice for our farmers and producers @HouseAgGOP","date":"Tue Jan 26 03:13:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am pleased to announce that I will be serving on the House Agriculture Committee, Judiciary Committee, and Rules Committee for the 117th Congress! \n\nRead more: https://t.co/uoO9qydasa","date":"Mon Jan 25 23:41:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"After the Trump Administration’s steadfast support for Minnesota’s mining industry, any move by a new Administration to block mineral development would be a major step back.\n\nI join @RepPeteStauber in supporting this important legislation.","date":"Mon Jan 25 23:14:16 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was proud to join @RepTomEmmer, @RepPeteStauber, @paulgazelka, @kdaudt &amp; other Minnesota leaders at this year’s @MCCL_org virtual #MarchForLife. \n\nWe stand together in our commitment to defending the right to life for all. https://t.co/vOVkce8M14","date":"Sat Jan 23 15:22:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I was so sorry to learn of the passing of former Minnesota state Senator Jim Vickerman. Jim and I served together for many years, and I knew him to be a thoughtful person and effective public servant. Sending prayers and condolences to his family. https://t.co/w09ur4j14A","date":"Fri Jan 22 22:20:45 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, we mark the 48th anniversary of the Roe v. Wade tragedy. Abortion has taken more than 60 million innocent lives, and affected countless mothers, fathers, and families.\n\nWe must continue to speak out against the murder of unborn children. If we don’t speak up, nobody will. https://t.co/GG3VHFryNU","date":"Fri Jan 22 16:22:38 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Another mandate from @GovTimWalz, who wants to bypass the legislature and unilaterally enact California's vehicle standards in Minnesota.\n\nMinnesota is not California. This extreme proposal would drive up vehicle costs and limit choice. https://t.co/D4PvhqBbQc","date":"Fri Jan 22 15:00:51 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Biden talked a lot about unity, then went to the White House and signed executive orders to block the Keystone XL Pipeline, stop deportations (even for criminals), and weaken border security.\n\nThese divisive actions will only hurt our recovery. https://t.co/6jnQ61TW9Q","date":"Thu Jan 21 15:33:46 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you, President Trump, for serving our country these past four years and for always putting America First.\n\nCongratulations, President Biden. We have much work to do on behalf of the American people.","date":"Wed Jan 20 16:52:00 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"President Trump brought the U.S. closer than ever to energy independence, but President-elect Biden is already rolling it back. Blocking construction of the Keystone XL Pipeline would kill thousands of good-paying jobs and undermine our national security. https://t.co/0aUEGNkY6E","date":"Tue Jan 19 20:42:21 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Today, we celebrate the life of Rev. Dr. Martin Luther King, Jr., and we honor his legacy. #MLKDay https://t.co/vfQy8a3uE5","date":"Mon Jan 18 16:18:35 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Religious freedom is a fundamental right guaranteed to all Americans. I am more committed than ever to defend those liberties. #ReligiousFreedomDay https://t.co/de4N9gGyYz","date":"Sat Jan 16 17:40:13 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I caught up with @TheFlagWZFG this morning about my first two weeks in Congress, my thoughts on the incoming administration, and what I hope to accomplish for Minnesota's 7th District. Take a listen! https://t.co/MMXsAtw6WV","date":"Fri Jan 15 18:51:31 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"The #PaycheckProtectionProgram provides forgivable loans to small businesses for help with payroll, rent, utilities, and more.\n\nToday, @SBAgov re-opened the application portal for first &amp; second draws. Learn more: https://t.co/mFW3ygNY0M","date":"Fri Jan 15 17:48:49 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Expect blizzard conditions across western Minnesota today. Be safe out there!","date":"Thu Jan 14 14:45:56 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I just voted against impeachment. With fewer than seven days remaining in this administration, we should be focused on moving forward and getting back to work on behalf of the American people.","date":"Wed Jan 13 21:06:21 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to join a bipartisan group of my colleagues in defense of the Renewable Fuel Standard. Read the full letter:","date":"Wed Jan 13 16:48:55 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Thank you to the many brave men and women across the country who protect our communities and keep us safe. We support you! #LawEnforcementAppreciationDay https://t.co/SlrAJFkAYM","date":"Sun Jan 10 01:33:36 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I am deeply saddened about the death of U.S. Capitol Police Officer Brian Sicknick, who died protecting our Capitol.\n\nWe are praying for his loved ones and all law enforcement. This affront cannot and will not be tolerated. https://t.co/Nri5ThKrGq","date":"Fri Jan 08 16:59:24 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"This is a step in the right direction. We need to get small businesses back open and Minnesota's economy back on track! https://t.co/ssupZK9zOL","date":"Thu Jan 07 18:30:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Respectful disagreement is fundamental to our democracy. The violence that we're seeing, especially toward law enforcement, is unacceptable.","date":"Wed Jan 06 19:46:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I plan to vote for the objections to the certification of electoral votes in certain contested states. \n\nRead my full statement: https://t.co/xn6RfZeQDQ","date":"Wed Jan 06 19:37:05 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Western Minnesota's own @farmmillennial is using his platform to bring awareness to the dangers of grain bins and to help train small, rural fire departments to respond to grain bin accidents. He raised more than $60,000 for these communities. Incredible! https://t.co/dM1f2Vw8I2","date":"Tue Jan 05 22:00:19 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"\"Michelle Fischbach was sworn in as a member of the 117th Congress representing Minnesota’s Seventh Congressional District during a ceremony on Sunday.\" #mn07 https://t.co/11LPmjIuFH","date":"Tue Jan 05 14:59:52 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Fischbach blasts Dems for House rules changes https://t.co/vOZ9BcaUKU","date":"Tue Jan 05 14:57:41 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Just voted against the House Democrats' \"rules\" proposal, which is really an attempt to quell minority dissent &amp; throw a lifeline to Nancy Pelosi.\n\nThere are many reasons Americans are so frustrated with Congress—and these shenanigans are chief among them. https://t.co/tL37H3WXtm","date":"Mon Jan 04 22:18:09 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"After more than three decades, western Minnesota finally has a new representative in Congress.\n\nProud to be serving #mn07! https://t.co/4WBG1ckY1a","date":"Mon Jan 04 20:30:29 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Taking a photo outside the Capitol with @GOPLeader and my fellow new members of the 117th Congress. Happy to serve with such amazing Americans! https://t.co/t94tGj2bQp","date":"Mon Jan 04 15:04:35 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I will fight for Minnesota and our country every day! https://t.co/OydiBlZpQz","date":"Mon Jan 04 04:40:11 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"I took my oath of office earlier today on the floor of the U.S. House of Representatives. It is an honor to represent the people of western Minnesota in Congress! https://t.co/EcenzHSh3D","date":"Mon Jan 04 00:10:57 +0000 2021","user_id":"1344375287484723205"},{"handle":"RepFischbach","text":"Proud to take my oath to represent Minnesota's 7th District in the U.S. House of Representatives! Follow along for updates from my congressional office.\n\nIt is an honor to serve! https://t.co/D0sGmwAmOW","date":"Sun Jan 03 17:33:45 +0000 2021","user_id":"1344375287484723205"}]