[{"handle":"RepGosar","text":"105,000 fentanyl overdose deaths in 2021 alone. \n\nRecord high inflation. \n\nRecord high costs &amp; prices. \n\nRecord high illegal immigration. \n\nThis is Biden's America, and an increasingly large share of the population cannot afford to live under these disastrous policies any longer.","date":"Thu Jun 16 20:29:02 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The OPT program was never authorized by congress.  It allows 500,000 foreigners to take American jobs every year.  These are not jobs to pick lettuce either.  These are well paying high-tech jobs. This is pure #AmericaLast.\n\nhttps://t.co/mYJlxvfgt9","date":"Thu Jun 09 20:22:29 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"On this day in 1944, true heroes landed on the beaches of Normandy, charging forward under a barrage of enemy gunfire. We are forever grateful for their service to our country. Let us remember their sacrifice, and honor their memory. https://t.co/Xe4WFEb0wV","date":"Mon Jun 06 22:44:44 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/HtGdYOhvrR","date":"Sun Jun 05 01:24:22 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The left has reminded us in the past few months that they want to protect abortion (murder) with zero restrictions yet also want to totally disarm Americans to \"protect life\".\n\nThey don't care about our broken economy, record high costs, or inflation. \n\nThey don't care about you.","date":"Fri Jun 03 19:59:15 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@RepAndyBiggsAZ Proud to stand with you on an issue as important as this. Thanks for putting America First, Andy!","date":"Fri Jun 03 16:38:11 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"In other words, @DineshDSouza made a difference.\n\n#2000Mules","date":"Fri Jun 03 16:36:13 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@ThisIsKyleR @bennyjohnson We're all glad you're still with us. 🇺🇸","date":"Fri Jun 03 02:23:19 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I stood up for Laura Loomer.\n\nI'll stand up for you, too.\n\n\"SHALL NOT BE INFRINGED.\"\n\nhttps://t.co/9lrZ50sBiQ","date":"Fri Jun 03 01:46:56 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I especially want this message to reach the youth, the future of our country. Gen Z. You know who you are.\n\nIt's MAGA time.\n\nWe need you! https://t.co/5uSOWR9vUt","date":"Fri Jun 03 00:17:22 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Elections have consequences.\n\nStolen elections have even bigger consequences. \n\nOur country desperately needs brave &amp; capable patriots to unite and get involved in the political process if you are able.\n\nHistory is watching and future generations are counting on us.","date":"Thu Jun 02 23:53:37 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"When the leftist Regime and their mouthpieces viciously attack patriots like @WendyRogersAZ, @RepMTG, @michellemalkin &amp; others, it tells me that what they're doing is brave &amp; effective. \n\nControlled opposition, on the other hand, is rarely attacked by the usual suspects.","date":"Thu Jun 02 20:31:43 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Thanks to Joe Biden and the puppetmasters behind him, narco-terrorists and human traffickers are now in control of our southern border.\n\n It should be totally and completely closed - but everyone knows the left isn't going to want to stop importing voters anytime soon.","date":"Thu Jun 02 18:39:32 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"It is not hateful or extreme to ask that elected representatives of Americans put the interests of those Americans first. \n\nAmerica First shouldn't be considered \"far-right\", it should be the bare minimum.\n\nYou shouldn't settle for anything less.","date":"Thu Jun 02 01:48:26 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"If elected officials can't put America First, then there may as well be no America at all - just a giant supermarket of quickly diminishing wealth and resources where anyone else can take whatever they want with both hands.","date":"Thu Jun 02 00:50:00 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Gab is one of the only social media platforms to actually make an effort towards reducing pornography on their platform. Hats off to them for leading by example.","date":"Wed Jun 01 20:08:32 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I'm not a prude. But the flimsy \"porn is protected free speech\" argument wasn't true 50 years ago and it's not true now. Porn does not empower women or men - it actually harms them and their brains.\n\nIt's simple gratuitous prurience.","date":"Wed Jun 01 19:33:43 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"There is abundant research that porn harms developing brains and harms relationships. Cohen nevertheless promotes and supports porn. \n\nI don't.","date":"Wed Jun 01 19:33:43 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"For example, Instagram only pretends to do an age verification.  It is fully pretextual. It simply asks what your birthday is - there is no verification that it is accurate. Kids can type anything they want for a birthday and IG will pretend it's all good.","date":"Wed Jun 01 19:33:42 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"There is a place in society for healthy sexuality. Exposing 13 year old children to hardcore pornography on so many social media platforms is not the time or place. This is a form of desensitizing children and grooming them.","date":"Wed Jun 01 19:33:42 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"NEW: Cohen is virulently pro-pornography, despite the average age of first exposure to porn being 13 (according to the APA). Cohen also omitted the part where I talked about the rampant drug abuse &amp; sex trafficking in the porn industry, I wonder why.\n\nThanks, Cohen!","date":"Wed Jun 01 19:21:53 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Thanks, Jack!\n\nhttps://t.co/bZNDsK8GRT","date":"Wed Jun 01 18:41:14 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"This, combined with the horrible effects it's having on our young men &amp; women, means that one who opposes any restrictions on porn is ignorant at best and malicious at worst. \n\nThis should be common sense.\n\nBut leftists refuse to budge an inch for the sake of sexual immorality.","date":"Wed Jun 01 16:53:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"JD Vance @JDVance1 is right to call for restrictions on pornography. Liberal courts have declared porn to fall under \"free speech\". What a joke.\n\nPorn is simply too accessible, not to mention the rampant drug abuse and sex trafficking within this subversive, immoral industry.","date":"Wed Jun 01 16:53:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Canada is continuing its plunge into total Regime control over their citizens. \n\nJustin Trudeau is acting like a dictator. \n\nAmerica can become just like Canada if we allow ourselves to get comfortable and complacent.","date":"Wed Jun 01 15:09:28 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The #TrueTheVote hearing proves, yet again, that significant and substantial FRAUD occurred in Arizona during the Nov. 2020 election. \n\nThe best time to do something about this fact was when it happened. \n\nThe second best time is right now.\n\nCALL YOUR STATE OFFICIALS!","date":"Wed Jun 01 00:30:29 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Over 63 million unborn lives have been taken from us since Roe v Wade. Enough is enough.\n\nBan abortion. Now.","date":"Tue May 31 20:03:36 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"We know why:\n\nThe Biden Regime refuses to put America First.","date":"Tue May 31 02:03:45 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Memorial Day is to commemorate our fallen soldiers. Life is precious. We should not risk the lives of our soldiers on useless foreign wars defending the borders of other countries. I pray for peace for the fallen and the living.","date":"Mon May 30 02:10:22 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"In case anyone forgot, our border is still wide open.\n\nWe desperately need a total immigration moratorium.","date":"Sat May 28 19:28:50 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nIt's 'paused' for now, but what exactly IS the \"Disinformation Governance Board\"? Here are the facts. WATCH: https://t.co/kcreIGcSH7","date":"Sat May 28 02:24:28 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Globalist forces are consolidating against all America First fighters right now. \n\nWe must have the courage and the conviction to put up real opposition. \n\nNo more fakers. No more grifters. We don't have time for them anymore.","date":"Fri May 27 21:53:59 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Just checked the status on America First... \n\nYep, still inevitable. \n\nCongratulations @RepMTG https://t.co/MM0BpxgiiD","date":"Wed May 25 00:58:46 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"We must stop the Great Reset and defund the WHO.","date":"Tue May 24 23:37:24 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"We've proven time and time again that the 2020 election was stolen from President Trump. \n\nIt's long past time for state officials to DO something about it.","date":"Tue May 24 18:03:01 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@FoppoliForSC07 Absolutely right, Alex. Fentanyl is driving the national overdose epidemic - it must end ASAP and it starts with closing our borders.","date":"Tue May 24 04:59:37 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"An 'incredible transition' to a lower standard of living, maybe. Remember when a gallon of gas was $2 or less? You know, back when we had a President who wasn't actively trying to harm the country?","date":"Tue May 24 02:13:40 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"America First doesn't mean 'globalism second'.\n\n It means the interests and goals of the global elites aren't even on our list.","date":"Mon May 23 23:37:09 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Democratic party is the party of hatred. They hate America, they hate people who love America, and they hate the religion and the descendants of the people who built America.","date":"Mon May 23 19:54:41 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Before we restore our country, we must restore the hearts, souls, dreams &amp; ambitions of the forgotten Americans between the coasts. The backbone &amp; foundation of America has been stepped on &amp; spit on for far too long by elites who hate us.\n\nLet's put Americans first again.","date":"Mon May 23 17:33:03 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/zwsIu02A7t","date":"Sun May 22 21:00:28 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Severe economic distress may be on the horizon due to the Biden Regime's gross incompetence. Plus, millions of illegals are pouring across the border, causing irreversible economic and social harm.\n\nBut hey! At least we sent $62 billion to Ukraine! 🙄","date":"Sun May 22 19:10:29 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Record crime, record immigration, record costs, record inflation... \n\nRussia didn't do this to us. \n\nLeftists did this to us, and this is their idea of \"progress\".","date":"Sat May 21 22:57:15 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"120,000 followers on Gab since November means more and more people get their news from the Gosar Minute and reject CNN.\n\nFollow me over on Gab.\n\nhttps://t.co/06u65cWfXW \n\n#UltraMAGA https://t.co/ap2Au9nWsh","date":"Sat May 21 15:33:59 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"With millions of illegals flooding into our country bringing record amounts of fentanyl, crime, and trafficking every state is now effectively a 'border state'. We need to stop this. A finished border wall and a total immigration moratorium is the bare minimum.","date":"Sat May 21 00:39:45 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nI recently introduced important legislation to impose economic sanctions on Mexico for their failure to stop deadly drugs like fentanyl from entering our country. WATCH: https://t.co/aPFDTaeenV","date":"Fri May 20 20:49:37 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@elonmusk @Jim_Jordan Their whole narrative is fake. All lies from the Democrats.\n\nAs usual.","date":"Fri May 20 18:37:51 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"It's not a 'conspiracy theory' and it isn't 'disinformation'. \n\nThey're open about their plans for America's future now.","date":"Fri May 20 18:26:31 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Fentanyl poisoning remains a leading cause of death. It comes from China and Mexico through our open borders. 105,000 Americans killed last year. Watch this discussion with @KariLake @sherifflamb1 to learn more. \n\nhttps://t.co/Y0eFjtjKv0","date":"Fri May 20 18:01:39 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"We must stop the WHO 'pandemic treaty' and reject the false song of globalism.\n\nLet's put America, our sovereignty, and our interest first instead of a cabal trying to take everything away from us.","date":"Fri May 20 15:45:17 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@elonmusk Funny how the knives come out the day after you say you're voting Republican. Is anyone surprised?","date":"Fri May 20 03:32:11 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Under the Biden regime our military has been steadily declining. The reports of horrific and substandard living conditions in the Navy has led to record problems and low morale. I recently wrote to @SECNAV to look into this. https://t.co/FuFdMxnC8N","date":"Fri May 20 01:37:43 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Ministry of Truth is dead. \n\nNext up: Roe v. Wade.","date":"Wed May 18 21:02:13 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@elonmusk Welcome, Elon. Glad to have you. 🇺🇸","date":"Wed May 18 18:47:45 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Did anyone else notice how quickly they dropped the 'build back better' nonsense once they made everything objectively worse?","date":"Wed May 18 17:27:45 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Record high gas prices and inflation are crushing our families, homeless veterans, and senior citizens with fixed incomes. Knowing this, RINOs and Democrats voted to send $40 billion to Ukraine anyway.","date":"Tue May 17 19:36:11 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Biden's Regime is treating illegal aliens (criminals) better than our own citizens. This goes far beyond incompetence - this is malice.","date":"Mon May 16 21:27:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Those who fight for America the hardest get attacked the most.","date":"Mon May 16 17:20:01 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"When we take power, and we will, never forget how these monsters treated the January 6th political prisoners.","date":"Sun May 15 22:16:49 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"This is HUGE. \n\nhttps://t.co/74rKpUeR4z","date":"Sun May 15 18:14:07 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nRecently, the Biden Administration announced it will end the Title 42 Public Health Policy that was implemented under President Trump. WATCH: https://t.co/k1MWxjZmpo","date":"Sun May 15 03:21:27 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Total number of Russians invading our Southern border since 2021: 0\n\nTotal number of illegal aliens walking through Mexico into our country since 2021: Over 2.7 million","date":"Sun May 15 00:39:10 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/x8mNJRcQ6O","date":"Sat May 14 20:30:21 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Total Number of Americans killed by Russia in 2021:  0\n\nTotal number of Americans killed by Mexican fentanyl in 2021: 105,000","date":"Sat May 14 17:31:36 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nI recently voted to permanently place fentanyl into Schedule I of the Controlled Substances Act. 'What does that mean?' WATCH: https://t.co/66VS5k5Yel","date":"Sat May 14 02:44:46 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"DC globalists focus on “human rights,” “regional strategy,” and “foreign security” while our own border is open to criminals, terrorists, drug cartels, and human trafficking. I always put America First. They prefer America Last.","date":"Fri May 13 19:46:31 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I commend Governor Ron DeSantis for his decision recommending children NOT take the vaccine. They don’t need it. Why risk it? @GovRonDeSantis\n\nhttps://t.co/LSNlMmbE5x","date":"Fri May 13 18:40:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Our movement must never forget that our struggle is of a spiritual nature. Satan would much rather have us be demoralized, distracted, &amp; compromised - this is exactly why we must stay focused and never give up!\n\nChrist is King!","date":"Fri May 13 17:26:27 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Apparently, we're only supposed to be 'fiscally conservative' when it comes to helping the American People. Over $30 trillion in national debt, record high costs of practically everything, but God forbid we vote NO on tossing $40 billion to Ukraine.","date":"Fri May 13 15:24:53 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The war in Iraq was a mistake.\nA proxy war with Russia is a mistake too, and could potentially lead to world-ending consequences. This shouldn't be controversial, a proxy war with Russia to uphold a corrupt socialist oligarchy is simply not in America's interest.","date":"Thu May 12 23:33:18 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Total US help to Ukraine will soon be around $54 billion. At this point, it's inaccurate to say that we're not at war with Russia by proxy. NO MORE!","date":"Thu May 12 20:13:51 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Remember when democrats and RINOs nickel and dimed President Trump on wall funding? They all said \"oh no, heaven forbid, we can't afford $8 billion. Maybe we will give you $2 billion.\" But Ukraine? Open the money spigot! It's always America Last with these clowns.","date":"Thu May 12 17:02:26 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Ukraine is not our ally. Russia is not our enemy. We need to address our crippling debt, inflation and immigration problems. None of this is Putin's fault.","date":"Thu May 12 01:31:53 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Calling us names is not a logical position. I have no principle to follow but the path of peace and non-intervention. My grown children have known nothing except American war and intervention for naught. \n\nAll losses: in men, material, time, and treasure.","date":"Thu May 12 01:31:52 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Biden's agenda is simple: Every other country and their people come FIRST, our country and her people come LAST. America is tired of being looted and systematically destroyed - another reason why I voted NO to give 40 billion dollars to Ukraine. AMERICA FIRST!","date":"Wed May 11 21:33:06 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Zelensky made $100 million last year as a public servant somehow. Where do you think a sizeable chunk of that $40 billion is really going? We shouldn't be sending a dime, especially not until our long list of problems at home are solved.","date":"Wed May 11 19:02:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Biden wants to send FORTY BILLION that has been taken from taxpayers to Ukraine while our borders remain wide open with historic crossings. This Regime prioritizes every other country before it even thinks about our own - this is the definition of America Last. I VOTE NO!","date":"Wed May 11 01:56:13 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨\nHillary Clinton's campaign SPIED on Donald Trump. WATCH: https://t.co/C8nswka2E5","date":"Wed May 11 01:50:52 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The most dangerous enemies of America are not in Russia - they're in Washington DC.","date":"Tue May 10 20:09:14 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Do not let the left bully you or anyone you know into silence, especially as the mass genocide of our unborn continues.","date":"Tue May 10 18:22:21 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨 Mineral Monday 🪨\nToday I'd like to discuss a beautiful and highly coveted Arizona Turquoise. WATCH: https://t.co/dNWBxa0KPT","date":"Tue May 10 04:04:41 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Secretary Mayorkas thinks you are a terrorist if you believe there was election fraud in 2020. He must resign. https://t.co/9nSEOEzMUJ","date":"Tue May 10 00:59:29 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"When Roe is overturned, I call on all governors to end abortion IMMEDIATELY in their states.","date":"Mon May 09 20:55:04 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The lunatics protesting outside of the personal houses of Supreme Court justices are violating federal law. They should all be investigated and charged. But that won't happen, because the Biden Regime desperately wants these intimidation tactics to work.","date":"Mon May 09 00:30:48 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The men holding rosaries, Bibles, and wearing America First hats bravely defending their churches against the abortionist horde are heroes, every single one of them. Heroes.\n\nhttps://t.co/PnaKkaz3qQ","date":"Sun May 08 20:31:58 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"We will win back the House.\nWe will win back the Senate.\nThen, we WILL fix 2020 so it won't happen again and our America First candidates will prevail.","date":"Sun May 08 18:51:30 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nA recent news article details how the CDC intentionally withheld valuable data on COVID-19 hospitalizations from the American People. WATCH: https://t.co/Picjf8p8WZ","date":"Sun May 08 03:30:40 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@catturd2 2000 Mules.","date":"Sat May 07 23:53:34 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@RepGosar https://t.co/TzwyEL9vFU","date":"Sat May 07 21:26:45 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Immigration moratorium NOW, for 10 years - bare minimum.\n\nBuild the Wall. \n\nMass deportations.","date":"Fri May 06 22:22:43 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"It is our moral obligation and duty as a nation to end the genocide of the unborn.","date":"Fri May 06 20:23:52 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Our momentum is unstoppable.","date":"Fri May 06 19:16:43 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/Muk1qqPX5z","date":"Fri May 06 16:01:28 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nNew economic indicators just came out showing #Bidenflation surged by 7.5% in January 2022 alone. WATCH: https://t.co/LccVNjil5f","date":"Fri May 06 01:56:59 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"We are going to save God's children. No matter what. \n\nWe have to.","date":"Thu May 05 21:29:51 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Abortion isn't \"health care\".\n\nAbortion is murder.","date":"Thu May 05 21:05:55 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The establishment is working hard to tear down \"Ultra MAGA\" loyalists like @CawthornforNC, @mattgaetz, and @RepMTG because they are the people the Regime fears the most. It's that simple.","date":"Thu May 05 01:31:10 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Life begins at conception. The left can scream all they want, but reality won't change simply because they would rather murder their own children than live in a society with morals.","date":"Thu May 05 00:57:16 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The violence we're already seeing at protests over the leaked SCOTUS draft is disgusting and unacceptable. These people are acting like the world will come to an end if it ever becomes slightly more inconvenient for them to murder millions of infants.","date":"Wed May 04 23:25:52 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nYou likely didn't hear on the #FakeNews that President Biden recently extended the COVID-19 National State of Emergency. WATCH: https://t.co/r3ElSO9yZX","date":"Wed May 04 21:10:10 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Yes.","date":"Wed May 04 03:05:29 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Our fight is best characterized as We the People vs The System.\n\nCongratulations to @JDVance1 for winning his primary. Onward, to dominate the general election and fight for We the People and the MAGA agenda in the Senate! See you in DC!","date":"Wed May 04 01:26:21 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Looks like Elon Musk plans on challenging much more than just Big Tech. 👀","date":"Tue May 03 22:27:28 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The SCOTUS leak is proof that the left will stop at nothing to continue the mass murder of America's children. 63 million aborted babies since Roe - it must stop NOW!","date":"Tue May 03 20:26:19 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Our children are counting on us, and history is watching. We must end abortion, and we must end it now.","date":"Tue May 03 17:07:16 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nThe Department of Labor recently reported that #Bidenflation soared to 7.9%, the highest in four decades. WATCH: https://t.co/BhXI4D5VLq","date":"Tue May 03 16:21:04 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Over 63 million Americans have been murdered through abortion since Roe. It's long past time to end this barbaric practice. Less than 1% of women obtain an abortion because they became pregnant through rape, and less than 0.5% do so because of incest. End abortion now. #RoeVsWade","date":"Tue May 03 04:36:23 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The leaked SCOTUS draft was likely from a far left law clerk who is trying to derail the final decision by creating mass outrage, hoping to scare a Justice to change his or her mind.","date":"Tue May 03 04:07:03 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Thank you to President Trump for making this possible. Pray that SCOTUS makes the right decision!","date":"Tue May 03 03:54:26 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Pray that Roe v Wade, an egregiously immoral and unconstitutional decision, is overturned. \n\nPray for the unborn.","date":"Tue May 03 03:36:21 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨 Mineral Monday 🪨 \nIt's amazing how far American technology can advance. Previously closed mining sites can now be re-mined for new materials that were missed. WATCH: https://t.co/JnJlKpL7tI","date":"Mon May 02 17:19:21 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The elites joke and laugh about sky high prices of gas, food, and rent. \n\nWe the People aren't laughing.","date":"Mon May 02 01:32:27 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Justice for the J6 prisoners and election integrity are two big issues that voters should never allow their representatives to forget or stop fighting for. We must never allow these topics to become 'old news' in the national conversation.","date":"Sun May 01 22:12:15 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨GOSAR MINUTE🚨 \nThe fake media, big tech, and their Democrat partners spent years lying about President Trump. They worked tirelessly in concert to bury a true story by the @nypost that a laptop, abandoned in a Delaware repair shop, belonged to Joe Biden's son, Hunter. WATCH: https://t.co/GxSyebS6KE","date":"Sun May 01 19:52:01 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nIn line with his open border policies bent on destroying America and its heritage and culture, Joe Biden just changed the USCIS mission statement. WATCH: https://t.co/th2q6Z7gMn","date":"Sat Apr 30 20:38:42 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"#AOCLovesElon is now trending. 😂\n\nThe momentum shifted when @elonmusk bought Twitter - can you feel it?","date":"Sat Apr 30 03:42:14 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The right wing needs to stop being a speed bump for the left in this country and be more like a concrete road barrier. \n\nThen we have to turn this ship around - and fast.","date":"Sat Apr 30 03:25:20 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"They're trying to rip the names of every America First fighter off the ballot - everyone who truly represents the forgotten men and women of this country. The real, authentic human beings. We can't let the left win. https://t.co/iPz1bN6MO3","date":"Sat Apr 30 01:57:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 GOSAR MINUTE 🚨 \nHave you heard of the phrase, \"Struggle Session\"? Or \"Denouncement\"? These are Communist and Totalitarian concepts where people were encouraged to attack their neighbors because of some perceived action contrary to what the regime was promoting. WATCH: https://t.co/ZZS7ANyNVa","date":"Fri Apr 29 21:31:18 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The smugness and sarcasm from the liberals on Twitter evaporated overnight when Elon Musk bought the platform. Why does the possibility of an equal playing field on Twitter scare them so much? 🤔","date":"Fri Apr 29 15:07:54 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The party who doesn't believe in borders, differences between men and women, a baby's right to be born, etc. now wants to control what is and isn't \"disinformation\" online. 🤦‍♂️","date":"Fri Apr 29 01:01:35 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Proclaiming the Christian Faith as the truth and proclaiming Jesus Christ as our Lord must never be sacrificed for the sake of appearing less controversial.","date":"Thu Apr 28 20:27:47 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@RepMTG @RepMattGaetz @RepScottPerry @RepThomasMassie @RepDanBishop @replouiegohmert @Rep_Clyde @RepAndyHarrisMD @RepAndyBiggsAZ @RepBobGood @RepMaryMiller Anytime. Keep up the great work! America is with you. 🇺🇸","date":"Wed Apr 27 22:22:31 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"105,000 Americans poisoned to death in 2021 alone from fentanyl being smuggled into our country through our southern border. That's 105,000 more reasons we should close our borders and 105,000 more reasons Biden should be removed from office.","date":"Wed Apr 27 21:30:31 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Remember when our government sent planes to Afghanistan and brought over 100,000 Afghans in less than a week? We have in the range of 40 million illegal aliens in our country. Using trains, busses and planes the US could deport 115,000 illegal aliens every week.","date":"Wed Apr 27 17:58:58 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/ncOUzc5uDV","date":"Wed Apr 27 14:51:03 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Eventually, we will prevail.\nIn the end, God wins.","date":"Wed Apr 27 01:43:51 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/3YKDAEN8Tz","date":"Tue Apr 26 20:41:15 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Tragic. According to a new study of Centers for Disease Control and Prevention data, The study found that deaths from opioid overdoses in teens ages 14 to 18 increased by 94% between 2019 and 2020 and by an additional 20% between 2020 and 2021. \nhttps://t.co/fpoY5M7dBS","date":"Wed Apr 20 23:55:15 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Ever hear about cobalt? No, it does not make Superman weak, that’s Kryptonite. It’s malleable, conducts heat and electricity, is corrosion resistant, and it looks cool. The top use for cobalt is in lithium-ion battery production. There you have it. Cobalt! https://t.co/kl5oAznPo6","date":"Mon Apr 18 17:38:35 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"He is not here: He is Risen!\nLuke 24:6-7 https://t.co/GYHbiAkrIT","date":"Sun Apr 17 23:17:45 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I commend these brave marine pilots for standing against a mandate to take an experimental drug. \n \nhttps://t.co/yVXwxhexHb","date":"Mon Apr 11 20:56:02 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 FORE! Anyone who lives in Arizona or visits knows that Arizona has some of the best golf courses in the world. What makes Arizona’s golf courses so beautiful and lush? \n \nPotassium. \n \nPotassium is a mineral that assists in better water and nutrient uptake. https://t.co/qyI01uxmWW","date":"Mon Apr 11 17:11:05 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"“I disapprove of what you say, but I will defend to the death your right to say it.” -Voltaire\n@elonmusk","date":"Mon Apr 11 15:01:56 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Pentagon has simply become a welcome wagon for illegals unlawfully crossing our southern border. https://t.co/wolX7DKqps","date":"Wed Apr 06 22:13:41 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today, we are going to talk about clay. Did you know that clay is a very important material in engineering? Clay can be used in road construction, buildings and high-rises, dams and even landfills. https://t.co/SDGAnuqpt2","date":"Tue Apr 05 06:38:47 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"This is full scale invasion. This is 540,000 in one month. Putin sent 150,000 troops into Ukraine and we are ready to set fire to the world. Eliminating Title 42 will only add fuel to the fire. Madness. \n\nhttps://t.co/LljcvIkQbA","date":"Mon Apr 04 14:00:04 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨In 1909, Japan gifted the United States 2,000 Cherry Trees, as a token of friendship between nations. In 1948, the Cherry Blossom 🌸 Princess Program was created. This program is a cultural exchange honoring the friendship fostered from the gift given by Japan. https://t.co/MfJhMIs0dM","date":"Sun Apr 03 18:16:57 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/Fg1kQovqPL","date":"Sat Apr 02 16:26:51 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Today I voted to permanently classify fentanyl as a schedule 1 drug, the highest level for illegality. Unfortunately, Democrats in Congress voted against this as they do not take this crisis seriously and Americans will continue to suffer because of it.\n\nhttps://t.co/ds4ARQfCSO","date":"Fri Apr 01 21:44:51 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Why is Ray Epps not charged for J6?","date":"Fri Apr 01 13:50:34 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"WALLOPED!","date":"Fri Apr 01 13:45:26 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"A fundamental issue at stake today within woke ideology is people thinking that your kids belong to them or to some sort of collective community. They don’t. Your kids are YOUR kids. Period. You raise them how you see fit.","date":"Fri Apr 01 13:42:23 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"On average, Americans will have to spend an extra $5,200 this year due to record high. #Bidenflation","date":"Thu Mar 31 19:07:04 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 The U.S. Constitution says that Congress is solely empowered to declare war, not the executive branch. The American people are tired of endless U.S. military involvement in overseas wars, particularly when there is zero national security interest. https://t.co/EF8AR5XqmG","date":"Wed Mar 30 19:46:01 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Border Patrol expects to encounter 8,000 illegal immigrants per day this spring, and according to Border Patrol Chief Raul Ortiz.\n\nThat’s one million encounters in SIX MONTHS, more than most FULL fiscal years Border Patrol has data for: https://t.co/qF6UtCIpC2","date":"Wed Mar 30 18:30:14 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Well folks, the numbers are in for 2021 and when it comes to mining Arizona is crushing it. Crushing rocks that is. The rock products industry direct output was $2.9 billion, with employment of 8,116 people and payrolls of $570 million. Arizona is #1! https://t.co/BxpmZd1pg0","date":"Tue Mar 29 15:03:40 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 According to multiple reports, border officials are expecting as many as 9,000 border encounters per day by this spring! This is nearly 40% MORE than last year’s peak, which averaged 6500 apprehensions per day. SECURE OUR BORDER NOW! https://t.co/ftTxGpq9rN","date":"Thu Mar 24 21:00:31 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Beryllium! Found and mined in Utah &amp; Arizona.\nBeryllium is the 4th element on the periodic table and the 44th most abundant element in the earth’s crust &amp; is a part of many of the things you rely on each day, including phones, appliances, thermostats &amp; laptops https://t.co/IhZhhYwx3s","date":"Thu Mar 24 00:52:16 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Under the current national emergency declaration, more than 120 emergency statutory powers can be invoked, including the power to draft Americans without consent, raising Fauci’s salary, further barricading our Capitol, &amp; placing the Public Health Service under military control.","date":"Mon Mar 21 15:52:17 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Time to move my discharge petition to force Pelosi to allow a vote to end the COVID national emergency declaration.","date":"Mon Mar 21 15:49:28 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"President Biden must restart the federal leasing program and immediately issue pending permits to #FlipTheSwitch on American energy. @NatResources","date":"Sun Mar 20 00:04:02 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I’m demanding a full report on Enforcement &amp; Removal Operations. Shouldn’t have to rely on whistleblowers for this data. “It’s like telling the highway patrol you can only arrest drunk drivers on a Tuesday if they’re driving a blue F-150 in the right lane.”https://t.co/4iM0s1YLe2","date":"Sat Mar 19 23:55:58 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Tele-town hall tonight. My constituents want to know why congress keeps passing bad legislation under the guise of “emergencies.” They don’t want a ground war in Ukraine and do want to secure our own border. Inflation and Fentanyl crisis also major issues. https://t.co/YjIaRlXbca","date":"Fri Mar 18 02:30:49 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨Let’s discuss the highly coveted AZ turquoise, a true-blue gemstone, donned by Pharaohs &amp; Aztec Kings. AZ is home to ~9 turquoise mines, but regulatory burdens have halted many of their operations. Kingman is one of the last full-time mines operating in the US. https://t.co/R8HBbm5cdF","date":"Tue Mar 15 03:00:54 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Has Russia secretly funded U.S. green groups that advocate against domestic oil and gas production? \n@RepJimBanks @RepublicanStudy \n\nhttps://t.co/oX6wos4Q17","date":"Sun Mar 13 16:31:42 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"To be clear, the so-called “Don’t say gay bill” prohibits instruction about sexual orientation or gender identity between kindergarten and 3rd grade, when students are roughly between five and nine years old. Anyone who has an issue with this should be investigated by the police.","date":"Sun Mar 13 15:40:22 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Beware of the tyranny of the collective.","date":"Fri Mar 11 15:24:55 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Paul is right. If it’s not grown, it’s mined - in everything we do and use.","date":"Fri Mar 11 15:21:47 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Biden Administration has blocked over 4,600 permits to drill for oil. Remember that next time you pump for gas.","date":"Thu Mar 10 23:37:02 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Without explanation, on day one of Biden’s presidency he cancelled the Keystone Pipeline. With the stroke of a pen, he put Americans at risk. Now, due to feckless leadership, the unthinkable has happened and Americans are feeling an entirely self-imposed energy choke hold.","date":"Thu Mar 10 20:35:46 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Trump was right.","date":"Thu Mar 10 01:33:10 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"DON’T USE UKRAINE TO JUSTIFY A BAD SPENDING BILL.","date":"Wed Mar 09 18:17:08 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The omnibus spending bill for $1.5 trillion is 2,700 pages long. It was released at 1:30 am. They want us to vote now. This is atrocious process.  All members with a conscience should vote no until we have hearings and can debate.","date":"Wed Mar 09 18:00:59 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"While many families are choosing between putting food on the table or gas in the tank, this Admin is actually giddy with the high prices. Watch the Harris-Buttigeig presser. They are saying now we can all go electric and solar. They must not know where electricity comes from. 🧠","date":"Tue Mar 08 16:14:30 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"We should focus on nuclear energy.","date":"Tue Mar 08 01:32:07 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Gas prices surged to highest levels since 2008. Biden should reverse poor decisions to sell out American workers and subjecting U.S. to dependence on Russia for energy. #BidensEnergyCrisis","date":"Tue Mar 08 01:31:21 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Rhodium (found  in Bagdad AZ) is used in making catalytic converters - a part of a vehicle designed to make exhaust less harmful. Criminals are increasingly stealing catalytic converters due to its value having recently risen to more than 15 x’s that of gold. https://t.co/Pb0H9uqn4L","date":"Mon Mar 07 21:48:17 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨The term “downwinders” refers to individuals who’ve developed cancer following the above-ground atomic weapons testing in the Southwest from 1945-1962. The Radiation Exposure Compensation Act (RECA) is set to expire on July 7, 2022. Congress must reauthorize it. https://t.co/lHNLrEjwkQ","date":"Fri Mar 04 20:04:58 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Why do they keep sending Kamala to carry Biden’s water on the international stage? Where is 46? Does he have something better to do?","date":"Fri Mar 04 18:07:09 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Biden recently extended the COVID-19 national emergency for another year despite painting an optimistic portrait of life for Americans after COVID during his recent SOTU address.  The extraordinary powers given to Biden to deal with the pandemic are no longer justified.","date":"Fri Mar 04 00:00:23 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Under the COVID national emergency declaration, 123 emergency statutory powers can be invoked by Biden, including the power to draft Americans without consent, raising Fauci’s salary, further barricading the United States Capitol, &amp; placing health services under military control.","date":"Fri Mar 04 00:00:23 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Twice I have moved to terminate the national emergency &amp; both times Pelosi changed House rules to prevent consideration. I'm pleased that today the Senate passed a companion to my resolution &amp; I look forward to filing a discharge petition early next week to force a House vote.","date":"Fri Mar 04 00:00:23 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Today I introduced a resolution: Supporting the People of America. https://t.co/17KAlSRVdg","date":"Thu Mar 03 23:39:26 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I will not send constituents to die in another unconstitutional war with no U.S. national security interest.\n\nDid you sign up to fight? Here’s your invite: https://t.co/7GlLYlAf4M","date":"Thu Mar 03 17:18:19 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Congress takes an exclusive oath to defend the Constitution of the U.S., not Ukraine, NATO, globalist initiatives, or anything else\n\nAZ, USA is the frontline of democracy. Congress must prioritize the the strong national defense of our republic &amp; exercise Constitutional restraint","date":"Thu Mar 03 03:55:06 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Talk to me when our border is secure.","date":"Wed Mar 02 22:30:21 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Hearing Democrats chant USA and to fund the police was perhaps the most rich. Their poll numbers must be worse than we thought.","date":"Wed Mar 02 16:38:51 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Emperor has no clothes.","date":"Wed Mar 02 03:49:26 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Tonight was the last gasp of a dying and desperate Administration. It was a list of things he knows he cannot pass, meant to do nothing more than to provide false hope and divide Americans.","date":"Wed Mar 02 03:48:14 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today I want to talk about the mineral, Fluoride. There is evidence that fluoride helps to prevent tooth decay. However, is the prophylactic use of fluoride to improve oral health outweighed by any other health risks caused by the fluoride? Listen to hear more. https://t.co/nUxwXm6DEM","date":"Tue Mar 01 01:50:32 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Weak men create hard times.","date":"Mon Feb 28 17:24:21 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"NATO has no business inviting Ukraine into membership. This is Russia's backyard. Biden failed to recognize this geopolitical reality.","date":"Fri Feb 25 01:53:19 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"This is why he mean tweeted.","date":"Thu Feb 24 17:42:34 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Administration should immediately reinstate the Keystone pipeline - but they won’t.","date":"Thu Feb 24 16:52:04 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Trump did the impossible and brought peace to the Middle East. Biden did the impossible and brought war to Europe.","date":"Thu Feb 24 12:41:28 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"God be with the people of Ukraine.","date":"Thu Feb 24 03:43:00 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I signed @approject’s Big Family Pledge &amp; here is why: it commits to defending girls’ sports by prohibiting biological males from participating, protects children from experimental gender transition procedures, the harmful teachings of CRT, &amp; pornography. https://t.co/MAPXGciEcW","date":"Wed Feb 23 02:05:30 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Had Gov. Ducey done his job and protected the border &amp; committed to finishing the wall, Arizona could get the unfinished wall materials. Instead those materials are being sent from our desert to Texas, which has a governor willing to protect his  state. \n\nhttps://t.co/FgKACZl5ts","date":"Tue Feb 22 18:09:53 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today we discuss the Federal Government’s latest assault on American citizens - the EPA. Watch to hear the case of an Idaho couple who’ve been in a 15-year battle with the EPA over plans to build a home on their residential lot that the EPA claims is a wetland. https://t.co/4uItfTfZZU","date":"Mon Feb 21 21:42:18 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Presidents Day! You know who you are! 🇺🇸 https://t.co/wEbPfHzylt","date":"Mon Feb 21 20:16:33 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"“We must also stop the definition creep around “terrorism,” a term whose use has become so elastic that it now even includes angry moms fighting school boards.” -@DavidSacks \n\nhttps://t.co/PpiITURYtA","date":"Mon Feb 21 13:09:37 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The guy that took a knee against police brutality is completely fine with his own police trampling grandmas and disabled people.","date":"Sun Feb 20 00:41:44 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨Welcome to 2021 where Biden’s woke State Department announced a major passport policy change. Applicants who identify with a third gender option will have their passport marked with an “X” standing for non-binary, intersex, &amp; gender non-conforming U.S. citizens. https://t.co/Siza1H83Zf","date":"Sat Feb 19 17:55:30 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/Q6vyXRaJ0E","date":"Sat Feb 19 16:49:55 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"We should just call ourselves Ukraine and then maybe we can get NATO to engage and protect our border.","date":"Fri Feb 18 21:17:53 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Our country is facing a national shortage in blood supply due the COVID-19 pandemic.\nWithout a large enough supply, patients may not be able to get the life-saving blood transfusions needed to survive. Please find a blood drive and help save lives! @gopdoccaucus https://t.co/CKlyJp0QjS","date":"Fri Feb 18 18:09:19 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"It’s not the responsibility of children to protect adults. It’s the other way around.","date":"Fri Feb 18 00:58:17 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"This week, I joined @RepChipRoy in addressing our concerns to the Finnish parliament about overt and draconian Finnish persecution of Christians in that country.  #Finland has proud Christian roots and such persecution and the globalists that engage in it need to stop. https://t.co/PmOJVyN8mu","date":"Thu Feb 17 04:46:04 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Nuclear is clean, reliable and the way of the future. https://t.co/4CaGLrLWw4","date":"Thu Feb 17 04:39:49 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"There is explosive growth in independent media. This terrifies the MSM. Their only response is to call you a racist.","date":"Thu Feb 17 04:19:06 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Please give blood. We are facing a national shortage.","date":"Wed Feb 16 19:28:04 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"A sitting President was spied on in his White House by his political opponent. This is infinitely worse than Watergate.","date":"Wed Feb 16 19:16:09 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Our bodies require minerals to stay healthy. Beef is packed full of essential mineral nutrients like iron, zinc, selenium, riboflavin, niacin, vitamin B6, vitamin B12, phosphorus, pantothenate, magnesium, &amp; potassium. WHERE’S THE BEEF?🥩Hopefully on your plate! https://t.co/aC8FqgBHEr","date":"Mon Feb 14 23:33:27 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Birthday Arizona! 🌵🇺🇸","date":"Mon Feb 14 23:22:22 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"From your favorite America First freedom fighter. 💕🇺🇸 https://t.co/ektMxqvMlk","date":"Mon Feb 14 19:38:38 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Mandate Freedom!","date":"Sun Feb 13 20:48:22 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Bengals.","date":"Sun Feb 13 19:13:37 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Clinton campaign paid for a spy operation on a sitting President in his White House. This is the biggest crime in U.S. history. \n\nhttps://t.co/wWU6GXgQAR","date":"Sat Feb 12 23:30:44 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"We did it Joe! https://t.co/j98OXMN0kN","date":"Sat Feb 12 20:48:10 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The tyrants feel their grip on power loosening. They don’t like it.","date":"Sat Feb 12 19:00:10 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Trudeau says “This unlawful activity has to end and it will end.“ You know what’s unlawful? Forcing private businesses close their doors for two years and forcing people to inject their bodies with an experimental vaccine. It’s time for THAT unlawful activity end.","date":"Sat Feb 12 03:31:56 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Trudeau is a tyrant.","date":"Fri Feb 11 22:12:35 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Biden threatens to cancel a pipeline to punish Russia.  As a sanction. \n\nIn his first week in office Biden cancelled two pipelines in our country. \n\nWhat was he sanctioning us for?","date":"Fri Feb 11 20:06:22 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Biden’s Border Crisis has gotten out of control. Proud to cosponsor this important legislation. Thank you to my colleague from Texas, @RepPatFallon for leading this effort.","date":"Fri Feb 11 19:20:39 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"👇","date":"Fri Feb 11 19:15:49 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"This equates to an average of just 100 deportations a day, even as border patrol agents encountered up to 7,000 illegal immigrants daily. #BidenWorstPresidentEver #BidenBorderCrisis","date":"Fri Feb 11 19:14:42 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"“The breadcrumbs lead to the speaker's office,” says @RepJimBanks of Pelosi, adding, “She's covering something up, and the American people deserve to know what those documents say.\" via @MaryMargOlohan @DailySignal https://t.co/tVSlfSWixs","date":"Fri Feb 11 18:48:48 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"It’s time to end Biden’s tyrannical mandates. Sign below to demand that @SenateGOP filibuster any funding bill which pays for enforcement of the Biden Vax Mandates. \n\nhttps://t.co/qOdxZ0p6a3 https://t.co/Fw4iT3HETF","date":"Fri Feb 11 18:37:49 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Not true. If @GOPLeader was beholden to me you would be removed from the conference and enrolled as a Democrat.\n\nhttps://t.co/0NUIZ7z45R","date":"Fri Feb 11 18:29:16 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Ironic that extreme heat in a nuclear reactor might be the thing that saves us from extreme heat across the planet. https://t.co/5RtogpSouQ","date":"Fri Feb 11 18:15:02 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Can you imagine what inflation would be had the Democrats passed their “Build Back Broke” bill?","date":"Fri Feb 11 18:13:34 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Canadian police just arrested a 78 year-old great grandfather for honking his horn.","date":"Thu Feb 10 18:26:17 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Science hasn’t changed, their poll numbers have. Oh and #freedomconvoy22 is making an impact. The last thing the want is an American trucker convoy.","date":"Thu Feb 10 18:13:33 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Inflation is going up faster than wages. #Bidenflation","date":"Thu Feb 10 18:06:18 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 The Biden Admin’s war on parents is absolutely outrageous and should infuriate every family across this nation. Parents ARE NOT DOMESTIC TERRORISTS for simply wanting insight and oversight in their child’s education. https://t.co/XoCPQT7rB0","date":"Thu Feb 10 17:56:06 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Bidenflation, a hidden tax on all Americans, just broke another record for February: 7.5%.","date":"Thu Feb 10 17:10:57 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Today I introduced the Independent Veterans Affairs Audit Act. The American people want to see an independent audit of the @DeptVetAffairs healthcare system by an outside private auditor, not by the VA. https://t.co/cnVTGKkrHu","date":"Thu Feb 10 04:30:03 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"SAVAGE. #2ndAmendment @KariLake","date":"Thu Feb 10 01:43:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today @MacayleCarey discusses Titanium. Although the United States pioneered the commercial production of titanium sponge during the Second World War; we now import 100% of our titanium sponge; almost all of it from Japan, China or Russia. https://t.co/s75E2bBc4X","date":"Tue Feb 08 02:36:41 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"You won’t hear about Biden’s thievery from the MSM. That’s why it’s important you get your news from the Gosar News Network!","date":"Mon Feb 07 22:49:06 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨Did you know the Biden Admin illegally pulled more than $2 billion dollars that was authorized by Congress to combat the coronavirus pandemic &amp; instead diverted it shelter illegal aliens who stormed across our southern border? https://t.co/GghPVm2Dup","date":"Mon Feb 07 22:47:09 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Joe Rogan is one of the most influential voices in America today. He questions authority and that makes him dangerous. They want his scalp. Don’t let them have it. This is bigger than Joe Rogan. @joerogan is all of us.","date":"Sun Feb 06 02:32:00 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Trudeau just got a competitor.","date":"Sun Feb 06 01:16:23 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Share this everywhere.","date":"Sun Feb 06 00:46:42 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Good luck trying to convince people that @joerogan is a racist. We’ve been to this movie too many times. Stay strong Joe!","date":"Sat Feb 05 23:59:59 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":".@gofundme has a history of doing this to what it perceives as regime threats.  No one should ever fundraise on this platform.","date":"Sat Feb 05 02:34:05 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"#StopTheCensorship","date":"Fri Feb 04 18:33:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨3.6 million Americans who lost their job during the pandemic have yet to get them back. Since taking office, Joe Biden has presided over the largest inflation crisis since the 1970s. Mr. Biden needs to wake up. These socialist policies are not helping our economy! https://t.co/ouDo9uXXlb","date":"Thu Feb 03 22:54:00 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The narrative the Canadian Left is attempting to portray about the truckers is the same narrative that the American Left tries to portray regarding 1/6. Don’t let them.","date":"Thu Feb 03 18:05:42 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Democrat lockdowns as a means to combat COVID will go down in history as the equivalent of bloodletting to combat disease. People lived despite these ridiculous practices. Not because of them.","date":"Wed Feb 02 17:01:35 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 We are again joined by special guest @MacayleCarey of the @NYYRC. \n\nIt is in your pocket. It’s in your purse.   It is in your car and mainly it is in your hands. I am talking about your cell phone.  \n \nEver wonder what minerals are used to make a cell phone? https://t.co/WGs7caBGFW","date":"Mon Jan 31 23:02:34 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I’m calling on the Biden Administration to take action against Chinese phone maker Yealink for sharing U.S. messages and data with the #CCP.\nhttps://t.co/Yu1HhbGS0X","date":"Mon Jan 31 03:03:22 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Parents should get a tax credit for home schooling.","date":"Sun Jan 30 22:46:07 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Another leaked video shows the Biden Administration is flying illegal immigrants in the dead of night to locations across the country.","date":"Sun Jan 30 02:06:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"After a year of firing staff with natural immunity, employers got rid of those least likely to infect others. It’s time to reinstate those employees with an apology.\n\nhttps://t.co/YhDNu89rzo","date":"Sun Jan 30 01:36:04 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"MAKE AMERICA GREAT AGAIN!","date":"Sun Jan 30 01:18:54 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"It’s anti-mandate. Not anti-vax.\n#TruckersForFreedom2022","date":"Sun Jan 30 00:34:25 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"One of my employees was harassed and had her property vandalized at @AmericanU simply because she worked for me. Click below to read more. @campusreform \nhttps://t.co/suHNshP5wI","date":"Sun Jan 30 00:23:38 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Who has blocked more shots:\n\nA. This little girl\nB. Hakeem Olajuwon https://t.co/kHuORiwIki","date":"Sun Jan 30 00:08:33 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"#Fraudci","date":"Sun Jan 30 00:07:24 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨Tinkering with a virus in the lab to make it more infectious to humans is known as gain of function research. It’s dangerous and very controversial. A startling new report by Project Veritas proves that Dr. Fauci lied about NIH funding gain of function research. https://t.co/mj9w0rPhb1","date":"Sat Jan 29 00:11:41 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Benjamin Franklin was walking out of Independence Hall after the Constitutional Convention in 1787, when someone shouted out, “Doctor, what have we got? A republic or a monarchy?” Franklin responded, “A republic, if you can keep it.”","date":"Fri Jan 28 20:49:38 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"This Admin really just thought it could Tik Tok dance its way through a Presidency.","date":"Fri Jan 28 17:29:44 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Trudeau calling his fellow Canadian citizen’s views “unacceptable” is the epitome of out of touch elitism.","date":"Fri Jan 28 15:40:15 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"MUST READ: ‘You Find People that do it Five, Six Times…for the Incentive.’\n\nhttps://t.co/8CTRyBMW8b","date":"Fri Jan 28 15:24:46 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"FREEDOM!","date":"Fri Jan 28 15:19:30 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 There are huge shortages for COVID-19 tests. The Biden Admin says it will start to send at home tests to those who request them - but they will take nearly two weeks to arrive! This is longer than the CDC’s own recommended quarantine time. What a mess. https://t.co/WAHAljx1g9","date":"Thu Jan 27 16:07:31 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Border patrol literally turned their backs on @SecMayorkas during this disastrous meeting.","date":"Wed Jan 26 21:53:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Biden Admin’s decision to cancel Twin Metals Minnesota mine is devastating. Thousands of jobs lost. Critical minerals we need and will simply go get elsewhere in countries that utilize slave labor and have terrible environmental standards.","date":"Wed Jan 26 20:20:49 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Fentanyl is freely flowing across our borders as seizures increased by 134% in FY2021. Under President Biden’s watch. https://t.co/NSBEt2oCyA","date":"Tue Jan 25 20:51:51 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Since Biden took office, nearly 2 MILLION illegal immigrants have been apprehended at our southern border. This doesn’t include the nearly half a million that have escaped into the U.S. without being caught under Biden. https://t.co/BWBxrnJ4iU","date":"Tue Jan 25 17:54:47 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Boom. Roasted.","date":"Tue Jan 25 16:09:03 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Good morning! #GosarGrindset","date":"Tue Jan 25 15:02:29 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 This week we are joined by @MacayleCarey of the New York Young Republican Club. As a resident of New York City, she discusses the minerals that were used in building that great city. Let’s start with the iconic Empire State Building. Take it away Macayle! 🌃 https://t.co/DDfKqrN3cE","date":"Mon Jan 24 23:38:47 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 January 22nd marked a very somber and disheartening anniversary for our country. On that date, 49 years ago the Supreme Court of the United States made the decision allowing for abortion on demand. Since then, 62 million innocent babies have been murdered. https://t.co/3CTQ1NYA3i","date":"Mon Jan 24 22:04:51 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Ukraine is over 5,000 miles away. Dangerous drugs and violent crime are crossing my constituents’ backyards.","date":"Mon Jan 24 19:16:53 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Russia invading Ukraine is not an immediate threat to the security of the American people, homeland, and way of life. The flow of dangerous drugs, crime, and criminals over our sovereign border is.","date":"Mon Jan 24 16:21:38 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"It’s been one year since Biden’s inauguration and it’s been an actual dumpster fire.","date":"Sat Jan 22 02:09:10 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Proud to be recognized as an A+ defender of the unborn. Thank you to all who are at March for Life today! #WhyWeMarch #MarchForLife","date":"Fri Jan 21 19:38:42 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Everyone Deserves a Birthday #prolife #WhyWeMarch https://t.co/cYPVfgvxrK","date":"Fri Jan 21 18:01:42 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I fight for the Unborn #prolife #WhyWeMarch https://t.co/B26c3yNtdU","date":"Fri Jan 21 17:54:16 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Good morning! Today is a great day to march for life! #MarchForLife","date":"Fri Jan 21 14:10:50 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Joe Biden ran on \"shutting down the virus\" yet a year later, the United States recorded over 1 million new cases in a single day. Biden even continues to repeat the lie that we are in a \"pandemic of the unvaccinated\" despite undeniable evidence to the contrary. https://t.co/3ZG1bgc6g6","date":"Thu Jan 20 16:35:40 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Biden promised to shut down the virus, not the country.","date":"Wed Jan 19 19:09:17 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Proud to cosponsor H.J.Res.67 led by @RepJeffDuncan to oppose the CMS vaccine mandate and protect the rights of America’s healthcare workers.","date":"Wed Jan 19 17:47:03 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I miss Trump’s press conferences and sense of humor but Biden’s bumbling babbling pressers have proven to be nearly equally entertaining, albeit for different reasons. Looking forward to 4 o clock to hear him attempt to discuss his Admin’s “successes.”","date":"Wed Jan 19 16:01:00 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"More Americans now identify as Republican than at any point in the last 30 years. \nhttps://t.co/as10539RjK","date":"Wed Jan 19 15:37:53 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"\"Destroying Taiwan's democracy is essential to giving China's Communist Party license to destroy all other democracies.\" — Richard Fisher to Gatestone, January 2022.\nhttps://t.co/I0MDD49cQi","date":"Wed Jan 19 15:20:05 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Fentynal is killing our citizens. Close the southern border!","date":"Wed Jan 19 14:18:46 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Big Tech and the Biden Administration continue to collude, unconstitutionally censoring lawful political speech. I support Section 230 reform and President Trump’s lawsuit against Big Tech on behalf of censored Americans citizens.","date":"Tue Jan 18 19:22:32 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Border security is national security.","date":"Tue Jan 18 19:21:17 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Sen. Chuck Schumer can’t seem to find enough votes to pass Mr. Biden’s radical agenda in the Senate. So, he is threatening to eliminate the filibuster rule. This would fundamentally alter the way the senate is run and forever change our republic. https://t.co/mFrS9cezPr","date":"Tue Jan 18 17:50:05 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 The Olympics are fast approaching and this week we discuss the Olympic medals that athletes are awarded and what they’re made from. You’d be surprised. Watch to find out! https://t.co/bVnG5vkl0k","date":"Tue Jan 18 01:26:31 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Still rings true today. #MLK https://t.co/P3hYzxnJHb","date":"Mon Jan 17 22:47:19 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Read this piece by @julie_kelly2 \n\nhttps://t.co/bY6JT0Sezw","date":"Sun Jan 16 21:04:15 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨Next week, Democrats will try to ram through their radical, so-called election “reform” legislation. This is all about power. Democrats want to nationalize our elections to ensure they never lose. This isn’t about protecting the voter, it’s about protecting them. https://t.co/L0tbuVcqPY","date":"Fri Jan 14 22:27:25 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Low taxes! No forced vaxxes!","date":"Fri Jan 14 18:06:07 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"No jab? No job! Not so fast, Joe! Today’s SCOTUS ruling is a win for all freedom-loving Americans.","date":"Fri Jan 14 01:02:23 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"My statement on today’s SCOTUS ruling. 👇 https://t.co/0zRdDJDrtN","date":"Thu Jan 13 22:28:09 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"I have been to this section of the wall in Yuma many times. You can see where the wall ends thousands of illegal aliens cross through. On the ground there lies enough sections of wall stacked up to complete the wall.   Biden wants chaos and criminality and open borders. https://t.co/FhTubIdi5L","date":"Thu Jan 13 19:23:01 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Ironically, the Democrat election bill requires a voter verified paper ballot “for the purposes of any recount or audit” I guess now that Trump is not on the ballot we are back to the understanding that using a computer to separate a voter from their ballot is a serious issue.","date":"Thu Jan 13 16:59:40 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The Constitution gives states control of elections, out of the hands of power hungry DC politicians. Limited federal government constrains the swamp &amp; they can’t stand it so they want to nationalize elections. Anyone who loves liberty should firmly stand against this power grab.","date":"Thu Jan 13 16:22:49 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Today Democrats will take their first step to “save democracy” by orchestrating a federal takeover of elections. This is the real threat to democracy.","date":"Thu Jan 13 16:15:18 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Bidenflation explained: let’s say you earn $40k/year. Your salary is now worth $37,200. That’s Bidenflation! Thanks for the pay cut, Joe.","date":"Thu Jan 13 13:38:08 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The newest Bidenflation numbers showed that prices in December leaped 7% from a year ago, the highest inflation rate since 1982. What has Joe Biden done well?  Jimmy Carter would be an improvement.","date":"Wed Jan 12 18:48:23 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The city that was attacked by foreign, radical Islamic terrorists 20 years ago just signed into law the right of non-citizens to vote in their elections.","date":"Tue Jan 11 19:22:47 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"The rest of the world recognizes natural immunity.","date":"Tue Jan 11 16:01:28 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"@eric_stutzman5 @PeterWelch @timburchett @RepBrianHiggins @Jim_Banks @RepBarbaraLee @CarlForAlabama @RepRobinKelly Ask and you shall receive.","date":"Tue Jan 11 15:47:25 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"What other decisions has Justice Sotomayor made on the basis of completely false, made up information?","date":"Tue Jan 11 15:05:12 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Jaw dropping report just dropped by Project Veritas. Never before seen military Documents obtained by #ProjectVeritas about Gain of Function directly contradict Dr. Fauci testimony under oath. #ExposeFauci\n\nhttps://t.co/nSTDrAmNcI","date":"Tue Jan 11 04:39:38 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today we visit Arizona State Mine Inspector, Paul Marsh to give us the rundown on what’s happening with mining in Arizona. Take it away, Paul! https://t.co/Sz8PtU9PE7","date":"Tue Jan 11 02:49:18 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨With so many folks flying home this weekend from holiday travel, let’s talk about the No Fly List. Nearly 1,000 American citizens are on the No Fly List. Absolutely no due process is provided to these citizens. I recently introduced the Freedom to Travel Act. https://t.co/wC9xXjwrAt","date":"Sat Jan 08 20:19:37 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🍊🍊🍊","date":"Sat Jan 08 20:12:22 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Who doesn’t love a good old fashioned snowball fight?","date":"Sat Jan 08 20:11:21 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/G2VAlH7GgR","date":"Sat Jan 08 02:04:35 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Terrible.","date":"Sat Jan 08 01:44:14 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Pretty abysmal jobs report…","date":"Sat Jan 08 01:27:15 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"If you do one thing today, please read this column by historian Victor Davis Hanson. Articulate and brilliant. Please RETWEET! \n\nhttps://t.co/IihAs1OZBf","date":"Thu Jan 06 05:52:04 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"Inflation is a tax on all Americans, and it has gone up every month of Joe Biden's presidency.","date":"Tue Jan 04 23:08:28 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 This week we focus on the Duluth Complex in Minnesota, which is estimated to contain 95% of the America’s known nickel reserves; 88% of the cobalt; 51% of the platinum and 48% of the palladium. These are important strategic metals that our nation needs. https://t.co/NTdr93zINI","date":"Tue Jan 04 02:26:16 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"HAPPY NEW YEAR! 🎆🎊","date":"Sat Jan 01 05:09:36 +0000 2022","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Special guest @KariLake discusses how parents across the country have learned that their children’s schools are neglecting the basics, &amp; are instead enforcing mask mandates, promoting &amp; teaching obscene &amp; deviant sexual practices &amp; promoting Critical Race Theory. https://t.co/EVdNJdzoiu","date":"Thu Dec 30 22:15:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Read this article from immigration and terrorism expert Michael Cutler on the recent indictment of an immigrant terrorist. \n\nhttps://t.co/k8B602rU2s","date":"Thu Dec 30 21:56:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today we focus on global mineral demand.  One of the reasons I started Mineral Monday’s was to highlight the energy and national security challenges we are facing as we enter a new energy paradigm. Critical Minerals are vital to our future. Enjoy! https://t.co/XQXpRLFdPg","date":"Tue Dec 28 03:10:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"MERRY CHRISTMAS!🎄 https://t.co/eTas5ZPGsI","date":"Sat Dec 25 20:17:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🎄Gosar Minute🎄 This is a very special holiday edition of the Gosar Minute.\n \nI’ve been especially good this year 😉 so for this holiday season I’ve come up with my very own 12 days of Christmas for America. \n\nENJOY! https://t.co/Y20AETCb4I","date":"Sat Dec 25 01:24:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 The Biden Administration has put quite the damper on this holiday season with sky rocketing inflation, vaccine mandates, and mass illegal immigration. Nevertheless, we have much to be thankful for - family, friends, this country, and Christ our savior. 🎄🙏🏻 https://t.co/KxJJmBKi1h","date":"Fri Dec 24 03:11:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Our country is in the middle of a catastrophic supply chain crisis caused by Biden’s incompetent administration. Will Biden be the Grinch that stole Christmas?🎄 https://t.co/ytkaRBULHr","date":"Thu Dec 23 03:14:29 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The cost of Lithium — a mineral that is key for electric car batteries — has skyrocketed more than 250% over the last 12 months, hitting its highest level ever, jeopardizing the ongoing transition to renewable energy outlined by Western governments.\n\nhttps://t.co/moTYruWHxd","date":"Wed Dec 22 20:46:18 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 This Christmas season we are reminded to drink responsibly or better yet, use a ride share and avoid driving if you are out partying. Sadly, tens of thousands of American citizens have been killed by drunk drivers. Take this story out of Florida. https://t.co/asHFR3vkqF","date":"Wed Dec 22 01:39:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Secure the border! https://t.co/H4ASdJyhlZ","date":"Tue Dec 21 19:48:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today’s topic is wind turbines. As the country transitions to more clean energy, new energy technologies differ profoundly from traditional hydrocarbon resources. One example are wind turbines, which require 9 x’s more mineral resources than a gas-fired plant. https://t.co/I2RGB2EbhO","date":"Tue Dec 21 01:57:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/SdGXmMNXDc","date":"Mon Dec 20 18:13:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 STUDENT EXPERIENCES: Hate, Assault, Violence, Property Destruction. All on @AmericanU 's \"woke\" campus. No accountability. AU Admin hiding from the reality that their campus propagates bigotry and hatred.  WATCH FOR YOURSELF! \n\nhttps://t.co/IMK8yL4HTr","date":"Sun Dec 19 00:58:57 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"IMMIGRATION MORATORIUM! https://t.co/2AHUhFbhiY","date":"Sat Dec 18 16:57:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨As a Catholic, I take God’s creation of life seriously. Since 1973 and the disaster of the Roe v. Wade decision, when the Supreme Court created a fake “right to privacy,” 62 million babies have been murdered. https://t.co/c5flaOUTkL","date":"Fri Dec 17 01:42:29 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"ALL citizens of our great country, enjoy the presumption of innocence until proven guilty. The cruel and unusual punishment that the #J6 detainees have been subjected to is occurring at the hands of Deputy Warden Landerkin who must be held accountable and be fired. @RepMTG","date":"Fri Dec 17 01:19:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thanks to my colleague from Virginia, @RepBobGood for leading this effort to ensure that the @DeptVetAffairs allows this great tradition to continue. Proud to sign onto this letter which was sent to Secretary McDonough this morning.","date":"Thu Dec 16 23:44:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Recent reports that there are bigoted, anti-Christian groups, criticizing the patriotic works of volunteers who lay wreaths on the graves of our nation’s fallen heroes is unconstitutional and even refer to the wreaths as “gang signs.”","date":"Thu Dec 16 23:40:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Our mining needs aren’t happening in a vacuum, we need minerals, &amp; a more electrified future will require more &amp; more minerals. Chinese and Congolese rare earth mining is causing significant human &amp; environmental destruction. It’s time to unleash mining in the U.S. @NatResources","date":"Thu Dec 16 22:44:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Big Tech censors lawful speech while promoting and monetizing child exploitative material. Democrats are prioritizing political prosecutions and protecting Big Tech instead of protecting vulnerable Americans from predatory and illicit industry.","date":"Thu Dec 16 19:25:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"IMMIGRATION MORATORIUM!","date":"Wed Dec 15 23:20:54 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Democrats have no plan on how to manage the Biden Border Crisis or sustain our sovereignty while also removing all of President Trump’s successful illegal immigration deterrence policies. #BidenBorderCrisis","date":"Wed Dec 15 22:31:58 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Biden’s Border Crisis is killing innocent people and communities all across America. Democrats are talking about controlling the climate while fentanyl and the border crisis are man-made and have contributed to over 100,000 American deaths this year. https://t.co/neP2zZ3hgh","date":"Wed Dec 15 22:29:33 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Joe Biden’s almost-year in charge of the federal executive branch has provided America with the strongest argument yet for a smaller federal government. In order to preserve freedom &amp; liberty for future generations, we must reduce the size of government. https://t.co/37AZHe5yPj","date":"Wed Dec 15 16:14:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Democrats have wasted trillions advancing their liberal agenda and are now asking the taxpayers to bail out the government on their behalf. Their out of control spending is unsustainable. I will not lend credit to the Democrats socialist spending spree. Last night I voted NO.","date":"Wed Dec 15 14:36:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨Biden’s open border policies are an open invitation to criminals and drug cartels to cross into our country unchecked. The crisis has reached a new level &amp; what is taking place in Yuma, Arizona is unconscionable. Joe Biden is destroying America. #BidenBorderCrisis https://t.co/pJotgDawG7","date":"Tue Dec 14 22:08:22 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Taiwan remains a strategic ally. It is a sovereign nation whose status remains as an independent state among states and is fully supported by the U.S.","date":"Tue Dec 14 20:04:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Read more here:\nhttps://t.co/NBz6Ekble3","date":"Tue Dec 14 19:57:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"If Democrats were serious about curtailing abuses of presidential power or providing transparency and accountability they would have supported my amendments requiring separation of powers, bodycams for Congress, and ending the COVID-19 national emergency.","date":"Tue Dec 14 19:57:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Dems are pushing Ilhan Omar’s International Islam Act [Countering International Islamphobia Act] but refuse to hold China accountable for Uyghur Muslim slave labor or stop the indefinite detention of U.S. citizens. Biden’s Build Back Bolshevism plan supports slave labor with US💰","date":"Tue Dec 14 17:34:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today we discuss solar panels. In Arizona we know the power of the sun and we are getting more and more of our power from it. Unfortunately, most of these solar panels are made in China using slave labor. Let’s fix that and mine here in America. #AmericaFirst https://t.co/wy3lR9LkDQ","date":"Tue Dec 14 01:31:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"When are Kamala and Joe going to visit the southern border?","date":"Mon Dec 13 22:27:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Doesn’t change my support for the worthwhile programs. \n\nOnly a low IQ person believes it’s a zero sum game. That a member must support 100% of a package or 100% oppose it. I support the good. Oppose the bad.","date":"Mon Dec 13 21:17:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Exactly. There are many programs. I support and I support my constituents’ applying for grants, loans and incentives. Often leftists take programs we all support and then load it down with Marxist drivel and wasteful programs and we are forced to call the Dems out with a no vote.","date":"Mon Dec 13 21:16:17 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Yup! We take credit for the stuff we support especially if the Dems load up a bill with BS and force us to vote no.","date":"Mon Dec 13 20:58:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨Let’s talk.\n\n•5 weeks an unborn baby has a heartbeat.\n•10 weeks an unborn baby can kick and jump.\n•15 weeks an unborn baby has fully formed lips and nose.\n•15 weeks an unborn baby feels pain.\n\nRead that again. Democrats say this is all completely meaningless. https://t.co/9NSCMMWyzJ","date":"Mon Dec 13 20:22:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The right to defend yourself if someone else is trying to kill you should not even be a debate. Proud to cosponsor this legislation. Thanks to my colleague from the great state of Florida for leading this effort. @RepMattGaetz","date":"Mon Dec 13 20:10:17 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Big tech monopolies become bolder daily with their censorship of conservative ideas. Help me fight back - follow me on Gab! https://t.co/9lz7sjg3FY https://t.co/GXYWcDeKBD","date":"Mon Dec 13 19:39:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Yup.","date":"Fri Dec 10 20:52:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Recently there has been a lot of talk about violence against members of Congress. Let’s talk about that. Is my colleague @RepMattGaetz correct? Is it open season on Republicans? Here are the facts. https://t.co/DZNAiTYIT4","date":"Fri Dec 10 20:21:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"ICYMI—🚨Gosar Minute🚨Former professional news anchor Kari Lake shows us why she was the top rated anchor in Arizona.  @KariLake https://t.co/aBF4KmQhae","date":"Fri Dec 10 00:10:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Joe Biden and Democrats: “Build Back Better is completely paid for.”\n\n👇 https://t.co/l4jKWetp5g","date":"Wed Dec 08 21:38:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Maybe we should look here in America, where we have the world’s best environmental and labor laws to protect our environment and people.  Oh wait, we did and found it in MN, but the @POTUS wants to shut that down in favor of importing from this.\n@RepPeteStauber @NatResources","date":"Wed Dec 08 21:34:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@PaulNeal123 @NecatiAslannn @elonmusk Facts.","date":"Wed Dec 08 21:24:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Hey, @elonmusk gets it. People should listen. Shutting down clean affordable base load energy makes no sense - on earth or in space.","date":"Wed Dec 08 21:24:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I am cosponsoring a Resolution to designate the first week of December 2022 as “National United States Miners Week”. Mining makes our world work. Thanks to my colleague from Minnesota, @RepPeteStauber for leading this effort. ⛏ https://t.co/oyBCJYqJCs","date":"Wed Dec 08 21:13:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Fact Check: True ✔️","date":"Wed Dec 08 20:54:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The physical conditions described by these political prisoners can only be described as unusually cruel and inhumane. Please read the full report below. @RepMTG \n@replouiegohmert @RepMattGaetz","date":"Tue Dec 07 23:05:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨No American should EVER have to worry about losing their job for choosing to not get the #Jab - or in NYC, to simply grab a burger. Joe Biden and Mayor De Blasio are on the wrong and very dark side of history.  #NoVaccineMandates https://t.co/s7LQaKbnoG","date":"Tue Dec 07 22:50:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Unreal. Stay tuned for a #GosarMinute on this nonsense.","date":"Tue Dec 07 22:33:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Join me and my fellow #G4 colleagues at 1:00 PM to discuss the atrocities going on inside the DC Jail as it relates to #J6 political prisoners. We cannot have a two-tiered justice system in our great country.  \n@RepMattGaetz \n@replouiegohmert \n@RepMTG","date":"Tue Dec 07 16:04:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 This week we discuss mineral water. In Arizona we know the importance of staying hydrated and healthy and minerals are critically important to our health. Our body is a machine and it needs energy and minerals to run. Bottoms up! https://t.co/BD0WasnxYt","date":"Tue Dec 07 00:32:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"America’s Lawyer @JennaEllisEsq https://t.co/Kth2IWlAfr","date":"Mon Dec 06 02:53:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🔥🔥🔥","date":"Sat Dec 04 18:15:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@con_national Thank you!","date":"Fri Dec 03 05:10:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Gosar #wrapped https://t.co/hakGtPowKt","date":"Fri Dec 03 01:15:50 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Seriously, what in the hell is going on in Australia? #Mandates https://t.co/yE9yA7F5Qr","date":"Thu Dec 02 20:22:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Cars don’t kill people.","date":"Thu Dec 02 14:43:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 This week we discuss a set of minerals known as platinum-group metals. While most folks associate platinum with fine jewelry, the automotive industry is the primary user of PGMs as palladium, platinum &amp; rhodium are used in catalytic converters on automobiles. https://t.co/VfAKn7JBJJ","date":"Tue Nov 30 00:35:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What a great compliment from Arizona’s next Governor! Thank you, @KariLake !","date":"Sun Nov 28 01:14:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"A special Thanksgiving message.🦃🍁 https://t.co/cRIuSua9Tb","date":"Thu Nov 25 19:10:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Wishing everyone a very happy Thanksgiving. Thankful for the great people of Arizona’s 4th District for trusting me to be your Representative in Congress. God bless! https://t.co/ztzZr1Tia3","date":"Thu Nov 25 18:23:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Fun Fact!","date":"Thu Nov 25 17:15:29 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 This week’s mineral is Manganese. No this isn’t the creamy condiment that you put in your potato salad or on your BLT! That’s MAYONAISE! I’m talking about Manganese, which is a critically important metal not just to our national security but our energy future. https://t.co/eAlEohgaTS","date":"Mon Nov 22 23:48:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Censure response. https://t.co/JYvAwuz5cJ","date":"Sun Nov 21 20:45:29 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"THE BEST IS YET TO COME!","date":"Fri Nov 19 16:18:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Once again, the Biden Administration’s war on oil and gas (why you are paying more at the pump) hurts Americans and in this case Navajo Allottees. They were never consulted on this misguided, unscientific and directly harmful policy. \nhttps://t.co/iqaWnMWuRu","date":"Thu Nov 18 23:56:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨GOSAR MINUTE🚨Recently, the AZ Senate released a report regarding the #AZAudit. Among other things, the report concluded that Maricopa County received 9k MORE mail-in ballots than it mailed out. Additionally 165k more ballots were scanned &amp; counted than were collected &amp; imaged. https://t.co/yCgtoT7uX5","date":"Thu Nov 18 21:09:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Going LIVE on @GETTRofficial at 6:00 PM. Tune in and follow me over there! https://t.co/3rhtji7QjV","date":"Wed Nov 17 22:50:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"My response on the House Floor addressing the House of Representatives’ censure of me and removal from my Committees due to an anime cartoon Tweet last week.","date":"Wed Nov 17 20:12:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thank you, @BarnettforAZ","date":"Wed Nov 17 14:11:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thank you, @iVoteArizona","date":"Wed Nov 17 14:10:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thank you, @AnthonySabatini","date":"Wed Nov 17 13:51:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thank you,\n@LimitGovt https://t.co/jK1QIZQcM7","date":"Tue Nov 16 22:38:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"EXCLUSIVE: https://t.co/VEWbZe2elm","date":"Tue Nov 16 21:16:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"BREAKING: https://t.co/kDeIU9cXxt","date":"Tue Nov 16 20:04:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 This week I’m at the Old Pueblo &amp; joined by Matt Bingham of Hudbay Minerals. Did you know that in 2018 Arizona was ranked 8th Most attractive region in the world for mining and exploration? AZ has 380 active mines and extremely important to the mining industry. https://t.co/p2l0J8TlL1","date":"Mon Nov 15 22:33:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The reality is this is the Biden agenda.\n\n•Strip native people of their rights if they want to use the “wrong” energy (oil and gas). \n\n•Use the 30x30 banner to shut down federal lands to all energy development.\n\n•Then, beg Russian Dictators and Saudi Princes for oil.","date":"Mon Nov 15 18:11:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This buffer strips potential development rights away from allottees with their own mineral rights within the new boundary. Hear directly from from the allottees here who oppose this rash action.- https://t.co/wMKEO7c9Qz....","date":"Mon Nov 15 18:09:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today @SecDebHaaland will take one of the first Biden 30x30 actions and strip hundreds of Navajo Allottees of their rights to their own lands by imposing an unscientific and overreaching buffer around Chaco Canyon…","date":"Mon Nov 15 18:08:17 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Over the summer, parts of our beautiful west coast suffered from massive wildfires. This is mostly due to  these areas being filled w/ fuel sources such as trees, brush, grass and leaves. Forest thinning is the only proven method of preventing catastrophic wildfires.@NatResources https://t.co/ShRbjbHueR","date":"Sat Nov 13 22:09:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Wow.","date":"Fri Nov 12 13:03:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Veterans Day 🇺🇸 Thank you to all who served!","date":"Thu Nov 11 17:56:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Next week Democrats will try to ram their massive spending bill through Congress. This is money we DON’T have. It would be the largest tax increase and expansion since the “Great Society.” It would also grant amnesty to nearly 25M illegals. https://t.co/8hOpoA8Q91","date":"Wed Nov 10 22:06:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great read by @KatiePavlich. I’ve been saying this all along. https://t.co/m5QN7Qxmvg","date":"Wed Nov 10 20:11:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Birthday to the few, the proud, the Marines. #SemperFi @USMC 🇺🇸","date":"Wed Nov 10 16:51:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Our southern border is being invaded by illegal aliens. 2.3 million lawbreakers will pour into the U.S. this year. AOC and Joe Biden continue to defend their open border policies. I will always fight for the rule of law, securing our borders &amp; defending the America First agenda.","date":"Tue Nov 09 18:07:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/WgX9P2FdHh","date":"Tue Nov 09 15:24:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today we discuss Mineral Exploration. Have you ever wondered how mining companies know what minerals are underground and where the minerals are? One of the first steps is exploration! https://t.co/RaMvzM6Rgt","date":"Tue Nov 09 00:50:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We will never have carbon free emissions with this type of methane gas leak. @ericswalwell amirite? #RoyalFartJoe \n\nhttps://t.co/dKmG35hXoC","date":"Mon Nov 08 17:02:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This is @SenSchumer last night in Puerto Rico. Dancing. Maskless. Indoors. Full of people. He looks like he’s having a pretty good time! Well, the rest of of us would like to have a good time too. \n\nLift the mandates. Unmask children. Unmask everyone.","date":"Sat Nov 06 23:01:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Me omw to end immigration. https://t.co/oa78dh3dZV","date":"Sat Nov 06 18:59:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’ve introduced a Resolution to Terminate Vaccine Mandates. There is nothing in the Constitution or the law granting the federal government the power to force anyone to inject medicine into their body as a condition of employment.\n\nhttps://t.co/pxvWCtYmiK","date":"Sat Nov 06 17:55:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"November is #NationalHealthySkinMonth. As Arizonans, we love our sunshine and we know that sunshine is essential for our health and well-being. However too much of it without proper protection can lead to skin cancer and early aging. Protection and early detection are KEY! https://t.co/dP5FdW1Ccs","date":"Sat Nov 06 17:50:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Keeping an eye on US citizens stuck in war-torn Ethiopia. This could turn into another crisis. Biden’s State Department says it will not be able to perform the basic task of evacuating US Citizens should commercial flights become unavailable. @RaheemKassam https://t.co/A2EqxXL2ME","date":"Sat Nov 06 17:26:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I voted against this so-called “infrastructure” bill. This bill only serves to advance the America Last’s socialist agenda, while completely lacking fiscal responsibility.  Less than 9% of the $1.2 trillion price tag goes toward hard infrastructure.","date":"Sat Nov 06 14:49:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The Biden Admin is trying to destroy ICE from within by preventing agents from enforcing our laws. Proud to sign onto this letter. Thank you to my colleague from Montana for leading this effort. @RepRosendale","date":"Thu Nov 04 18:27:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Going to be a good year for the trial lawyers.","date":"Thu Nov 04 16:46:26 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨MINERAL MONDAY🪨 Today’s mineral is ZINC! You might think of those zinc throat lozenges taken when you start to feel sick. I’ll be honest, they taste terrible, but they do help shorten the severity of a cold. Zinc also plays a critical role in a lot of other things… https://t.co/96cCrEUhOK","date":"Tue Nov 02 01:28:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨GOSAR MINUTE🚨Did you know that Biden withdrew a lawsuit filed under Trump against the University of Vermont Medical Center for violating federal conscience protection laws?UVMMC forced 10 nurses who registered conscience objections to assist with performing abortion procedures https://t.co/zOg0gulS3y","date":"Sat Oct 30 09:22:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Brilliant.","date":"Fri Oct 29 13:37:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Our open border is a national security threat. Today my colleagues and I sent a letter to @DHSgov asking what measures it is taking to secure our border from any terrorist threats from foreign individuals who would seek to bring harm to our homeland and the American people. https://t.co/uYGvSsenYN","date":"Thu Oct 28 23:17:29 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The foreign minister of Panama says that they have apprehended 52 individuals associated with Al-Qaeda. \n\nRead that again. \n\nWhere do you think they were heading?","date":"Thu Oct 28 23:12:14 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Interesting quote from “A Bug’s Life” movie. https://t.co/h7kBU4cCJJ","date":"Thu Oct 28 21:33:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It already takes decades for drilling and mining projects to get through the permitting process. Now, by raising royalty rates through the roof, Democrats will drive the final nail in the coffin of domestic oil and gas, forcing our own companies to take their business overseas.","date":"Thu Oct 28 21:29:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The Democrat’s reconciliation package declares an all-out war against the American domestic energy industry. @NatResources","date":"Thu Oct 28 21:28:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We knew this was the plan all along but to hear them admit it? Wow. \n\nNEW JERSEY #PhilMurphy thinks he can pull one over on you. https://t.co/zbJc9X0Mha","date":"Thu Oct 28 20:58:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Between the No Fly List and the NICS  List, there are two secret lists the government uses to strip American citizens of their constitutional rights.  But they do so in secret. With no charges. No hearing. No due process.   It is a remnant from Soviet Russia and it needs to end. https://t.co/CtvAq1fWxi","date":"Thu Oct 28 19:42:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"\"The liberal media say that Gaetz is like the part of the duck that you see above the water and Gosar is like the legs that are churning below the water to get things done\".\n\n~ Matt Gaetz, Scottsdale Gun Club - October 23, 2021.\n@mattgaetz https://t.co/w3U3g3Fatq","date":"Wed Oct 27 15:43:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The pups are safe with me. #FauciLiedDogsDied #FIREFAUCI https://t.co/bLqHdhbjSn","date":"Mon Oct 25 20:44:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today’s mineral is Phosphate, which is important to our agricultural economy. Phosphate is 100% natural and helps farmers grow more crops on fewer acres. Doesn’t that sound better than using manure? I think so and that’s no bull. 😉 https://t.co/tNlXMre8FY","date":"Mon Oct 25 20:09:57 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@DreisbachPenny Yup.","date":"Sun Oct 24 14:04:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We’ve got too many gangsters doing dirty deeds. Too much corruption and crime in the streets.","date":"Sun Oct 24 13:56:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Now we need to take real action. Americans should demand that Biden roll back restrictions, free American energy producers to produce the energy we need and stop begging other countries to lower our prices. We have the ability, technology and resources to be energy independent.🎤","date":"Fri Oct 22 17:53:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Obviously they should reverse their terrible policy decisions but that isn’t their action instead \"Biden team asks oil industry for help to tame gas prices\" -- Politico, October 2021\n@POTUS @NatResources @US_OGA \n\nhttps://t.co/CYv4N2O5o0 https://t.co/maF3xBa1nl","date":"Fri Oct 22 17:52:26 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Despite all the begging the reality sets in on the results of Biden’s actions \"Oil Price Jumps Above $80 and Natural Gas Races Higher, Turbocharged by Supply Shortages\" -- Wall Street Journal, October 2021 @POTUS @NatResources @US_OGA \n\nhttps://t.co/AipmeNSWNI https://t.co/pDiNL8RaOm","date":"Fri Oct 22 17:50:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Now we get the worst response, instead of backtracking on the terrible decisions Biden starts begging foreign governments - \"Top White House aide discussed oil prices with Saudi Arabia\" -- Reuters, September 2021 @POTUS @NatResources @US_OGA \n\nhttps://t.co/S80AGHUFja https://t.co/AkWdnKZrmF","date":"Fri Oct 22 17:50:14 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"And suddenly, after harming oil and gas workers, driving up inflation, and hurting the middle class \"Biden Pressures OPEC to Speed Production to Lower Gas Prices\" -- Bloomberg, August 2021 @POTUS @US_OGA @NatResources \n\nhttps://t.co/rWGSwLsDYE https://t.co/140O9BJ2ok","date":"Fri Oct 22 17:49:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Right now we see the impacts of Biden’s actions on American families and supply chains \"Gas is above $3 and it will go higher if OPEC doesn't act soon\" -- CNN, July 2021 @POTUS @US_OGA @NatResources \n\nhttps://t.co/jm1BqGSUpb https://t.co/TxeAtPyGJM","date":"Fri Oct 22 17:48:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"But you simply can’t stop \"Supply &amp; demand is when the price of a good tends to increase when the supply of that good decreases or when the demand for that good increases.\" -Every High School Economics Teacher Since the 1700s https://t.co/AiJW98t4nB @POTUS @NatResources @US_OGA https://t.co/t0RXf9Ibxh","date":"Fri Oct 22 17:46:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Our nation needs oil and gas. Biden lives in magic fairy land claiming otherwise. \"Despite some turbulence, global oil demand is” back.  World Oil magazine, March 2021\n@US_OGA @POTUS @NatResources \nhttps://t.co/o1yC9ZiX3D https://t.co/qA9xZp48yD","date":"Fri Oct 22 17:45:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Gutting oil and gas operations - \"Biden suspends oil and gas leasing in slew of executive actions\" -- CNBC, Jan 2021 @US_OGA @NatResources @POTUS\nhttps://t.co/EeScjr3xgJ https://t.co/mSKtHsyA7j","date":"Fri Oct 22 17:43:22 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Soon as he could by Executive Order - “No more drilling on federal lands. No ability for the oil industry to continue to drill, period, ends.\" -- Biden, March 2020\n@NatResources @US_OGA\n@POTUS\nhttps://t.co/59kSjDeVmA https://t.co/A3hvhyDro6","date":"Fri Oct 22 17:42:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"That we know, because he said that what he was going to do -\n“We are going to get rid of fossil fuels.\" -- Biden, Feb 2020 \n@US_OGA \n@NatResources \n@POTUS \n https://t.co/IbzBc8intl https://t.co/MmSoJ2fYVO","date":"Fri Oct 22 17:41:50 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Everything is based on Biden’s irrational hatred of oil and gas.  Referring to oil producers Biden said  \"Hold them liable for what they have done ... when they don't want to deliver, put them in jail.\" Dec 2019\n@POTUS @US_OGA @NatResources \n \nhttps://t.co/CKgAUVgDnh https://t.co/45MgAjMg1R","date":"Fri Oct 22 17:26:23 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Let’s talk: Biden on oil/gas and energy prices: “How It Started and How It's Going”\n@POTUS @NatResources @US_OGA \nhttps://t.co/0v9CUHBbcy https://t.co/qAHJzdOrXj","date":"Fri Oct 22 17:24:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"In the studio. Talking about minerals. 🪨 https://t.co/kdNOfYvktw","date":"Fri Oct 22 16:17:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/V2ue7uPOZ7","date":"Thu Oct 21 23:11:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 Did you know that 220 House Democrats recently voted to spend 3 quarters of a $BILLION on convicted and imprisoned violent felons? What a slap in the face to the American taxpayer! https://t.co/L45FVVqrfn","date":"Thu Oct 21 16:26:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Here’s the deal: that cup of coffee costs more than it did a year ago, along with a tank of gas and other common goods - that is if we can even find them on the shelves to purchase them. Hyper inflation is coming and your Admin is a dumpster fire.","date":"Wed Oct 20 16:23:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Well we know that Kerry has been working against American interests for a long time, here we see him actually say it out loud. America First, American Jobs, American Auto Workers should always come first, too bad the Biden Administration doesn’t believe that.","date":"Wed Oct 20 16:15:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Gave remarks this morning to a great group of freedom-loving conservatives about current issues. https://t.co/5IQWnR7cdf","date":"Wed Oct 20 16:10:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s #NationalFreeSpeechWeek! Please see a recent #SCOTUS decision upholding our First Amendment  protections and rights to make anonymous donations. Cancel culture is real. The main reason to  disclose this info is to damage those w/ whom they disagree.\n\nhttps://t.co/XZAcmzH5dk","date":"Wed Oct 20 16:08:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Nuclear energy is clean, safe and reliable. As Chairman of the Nuclear Energy Caucus, I love to see this! #NuclearScienceWeek","date":"Tue Oct 19 14:08:21 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Recently, I introduced The Stopping Terrorist Minerals Trade Act. Americans paid nearly $90M for geological surveys and other infrastructure designed to help Afghanistan. After Biden’s disastrous pull-out, those precious resources are now in Taliban hands. NO. https://t.co/SfoPDlliXi","date":"Mon Oct 18 23:25:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"If he had worn a helmet cam, Gulliver’s travels would pale. Oh the stories he was involved in! He knew no strangers!","date":"Mon Oct 18 14:53:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"✝️ https://t.co/WTyTzAwQUF","date":"Thu Oct 14 14:17:14 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Birthday U.S. Navy! 🇺🇸\n\n@USNavy #Resilient and #Ready","date":"Wed Oct 13 16:32:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 There’s gold✨ in these hills! Today we discuss the “Vulture Mine” in Wickenburg, AZ. The Vulture Mine was AZ’s largest producing gold mine before it was shut down by the Feds for allegedly underreporting a couple nuggets here and there. 😉 https://t.co/FnYWya7hwP","date":"Wed Oct 13 15:21:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Should we send our wives and daughters to war via a Military Draft?","date":"Mon Oct 11 21:06:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"HAPPY COLUMBUS DAY!","date":"Mon Oct 11 17:26:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Here's to the crazy ones. The misfits. The rebels. The troublemakers. The round pegs in the square holes. The ones who see things differently. They're not fond of rules, and they have no respect for the status quo. You can quote them; disagree with them; glorify or vilify them.","date":"Sun Oct 10 19:36:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"About the only thing you can't do is ignore them. Because they change things. They push the human race forward. And while some may see them as the crazy ones, we see genius. Because the people who are crazy enough to think they can change the world are the ones who do.” -Kerouac","date":"Sun Oct 10 19:36:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Crime is up, illegal border crossings up, America’s credibility around the globe is down.\n\nThat’s failure.","date":"Sun Oct 10 19:12:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What the hell is going on in Australia??","date":"Tue Oct 05 22:12:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Women are women.","date":"Tue Oct 05 19:26:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🪨Mineral Monday🪨 Today we discuss Uranium. Uranium is required for nuclear energy production which is vital to our national defense and provides 20% of our electricity. https://t.co/1SvtnurAV0","date":"Mon Oct 04 23:39:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The #GosarGrindset is about getting things done. https://t.co/AVXgjaD7gM","date":"Mon Oct 04 00:12:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 #BidenBorderCrisis: Nearly 200K illegals crossed our border in August. Just last week, @SecMayorkas told agencies to prepare for up to 400k for the month of October. SECURE OUR BORDER NOW! https://t.co/nL6XJmLnBW","date":"Sun Oct 03 22:20:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/UqV5EacCD8","date":"Sat Oct 02 17:30:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"\"Mayorkas admits 'tragic rise' of delta variant at US-Mexico border 'surprised' him.” 🤦‍♂️\n\nhttps://t.co/WXYnmLoIVF","date":"Sat Oct 02 15:25:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Let’s give all the migrants MAGA hats to wear. Guarantee the border will get closed real quick. https://t.co/Rm634G0EUV","date":"Sat Oct 02 14:45:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Did you know that tucked inside the Dem’s $3.5T spending bill is a special journalism “tax credit” equal to 50% of the salary of each journalist? Your tax dollars would be paying 50% of the salary of many journalists whether you like their reporting or not.https://t.co/UvTiUQhB4S","date":"Sat Oct 02 14:11:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What do you think foreign leaders think when they visit our nation’s capital city and see vast homelessness, drug use and even have fear for their safety? Have you no pride? How are you not embarrassed?@GOPoversight https://t.co/27QPI1Ytfd","date":"Sat Oct 02 14:02:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Department of Homeland Security is asking officials to be prepared for the possibility of 350,000 to 400,000 illegal border apprehensions in October.\n\nFor context: the entire French Army has 200,000 active personnel.","date":"Sat Oct 02 13:34:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Don’t talk to me about the “highly transmissible delta variant” and injecting children to save adults, while our southern border remains wide open.","date":"Sat Oct 02 13:30:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Since when has a “one-size-fits-all” approach to medicine EVER been acceptable? Every human is built differently. Penicillin, for example, is an absolute miracle drug for most people but for a handful of people, can cause a severe allergic reaction. People are different.","date":"Sat Oct 02 13:06:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"COVID-19 poses almost zero risk to children. It is simply wrong to require them to be injected with a vaccine in order to protect adults.","date":"Sat Oct 02 12:22:02 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We need to stop talking about vaccinated and unvaccinated and start talking about immune and not immune.","date":"Sat Oct 02 12:11:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"SECURE OUR BORDER NOW!","date":"Sat Oct 02 01:30:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Due to COVID, parents spent the entire last year teaching their kids at home. They didn’t like what they saw. They realized their kids were being taught CRT &amp; many other bizarre things. Many parents are now speaking up at city council &amp; school board meetings - as is their right!","date":"Sat Oct 02 01:19:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨Vaccine Mandates: As recently as July, Mr. Biden promised that there would be no Federal COVID-19 Vaccine Mandates. He has broken his promise. As we speak, there are American citizens being forced to choose between getting jabbed or their feeding their families. https://t.co/jwOKPCdKGD","date":"Sat Oct 02 00:06:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Interesting how the Obama Biden administration set Bowe Bergdahl free after his actions literally caused his teammates to die and Lt. Col. Scheller was simply suggesting that there be accountability up to and through the chain of command and he gets thrown in the brig.","date":"Fri Oct 01 22:49:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The personal consumption expenditures price index (PCE), a key inflation gauge, hit a 30-year high in August. This comes at a time when Democrats are pushing a $5.5 TRILLION package, which would only cause inflation to continue to skyrocket. https://t.co/wARd364BRf","date":"Fri Oct 01 17:27:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Panama’s foreign minister warned Wednesday that up to 60,000 mostly Haitian migrants are making their way through Central America, toward the US-Mexico border. That is the size of a small army. https://t.co/06Ka0dPpp4","date":"Thu Sep 30 21:22:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’ll be on The Jeff Oravits Show at 4:06 P.M today. @JeffOravits \nTune in at 97.1FM in NAZ, 107.9FM in Prescott. Streaming everywhere on https://t.co/jkgOp64sCX","date":"Thu Sep 30 19:58:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Listen to these accounts of election fraud uncovered by the audit.  Don’t listen to the Big Lie—“BeSt EVeR eLeCTIon”\n\nhttps://t.co/qrR9H5SL0O","date":"Thu Sep 30 00:06:33 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I call on @SenMarkKelly and @SenatorSinema to vote no and reject her nomination, Arizona deserves a @BLMNational Director who doesn’t have a history of supporting terrorism, we can do better.","date":"Wed Sep 29 17:05:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"There is no question that Tracy @StoneManning is unfit to lead our nation’s largest federal land agency @BLMNational  and rural Arizona deserves better. Spiking trees isn’t a harmless activity, it is terrorism.","date":"Wed Sep 29 17:05:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Tomorrow @SenateDems will vote for an unrepentant terrorist who supported spiking trees, endangering loggers and forest firefighters as the new @BLMNational Director. America can do better.","date":"Wed Sep 29 17:05:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great podcast with @realannapaulina! Listen to me discuss how Biden and the Democrats' open-borders agenda is devastating American communities and threatening national security. We also dig into the results of the Arizona election audit. https://t.co/EnNpVIK87q","date":"Wed Sep 29 12:36:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It was an honor to meet the Gold Star mothers and family members of the soldiers who we lost in the line of duty. Lake Havasu has given our country many of its most precious sons and daughters, and there are no words to thank them enough. https://t.co/8wugCoCqf4","date":"Wed Sep 29 12:15:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"#MineralMonday is BACK! This week we discuss Tellurium - an essential component of cadmium telluride, a semiconductor material that converts sunlight into electricity and is used to manufacture thin film photovoltaic solar panels. Currently we import more than 50% of our supply. https://t.co/XfIEqoLiV3","date":"Mon Sep 27 17:51:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"As founder of the nuclear energy caucus, enjoy this short video for nuclear energy week. Nuclear is cleanest energy available and the way of the future.","date":"Sat Sep 25 15:03:09 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"More bad news from Bad News Biden: Due to his shutting down natural gas production gas prices this winter are set to sky rocket. On the other hand, no mean tweets.  \n https://t.co/h1XIDttZ54","date":"Fri Sep 24 00:59:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Project Veritas has uncovered serious fraud with at least one hospital in Arizona not reporting vaccine injuries. I’ve got something to say about it. https://t.co/kaMVtTluor","date":"Fri Sep 24 00:05:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Tomorrow. https://t.co/KwlwUT2RIT","date":"Thu Sep 23 20:14:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"If health care providers are under reporting vaccine injuries, they are not only breaking the law but hurting their patients. HHS must respond to this. https://t.co/xTp9AfwD7Q","date":"Thu Sep 23 19:48:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The crime spree is only beginning. But raping a minor and trying to strangle a woman are the first of many to come from the unvetted Afghans. https://t.co/gbGevisI2u","date":"Thu Sep 23 14:56:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Hey siri, play “Nightcall” by Kavinsky. https://t.co/sLUI0MAJia","date":"Wed Sep 22 16:08:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Invasion.","date":"Mon Sep 20 19:25:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Stop masking children.","date":"Mon Sep 20 19:24:18 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@JoeBiden stay out of people’s bank accounts.","date":"Mon Sep 20 19:02:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@FordFischer Hello @fordfisher. My support of Looking Forward America &amp; @mattbraynard remains unwavering. My comment is on the blatantly over-the-top response by leadership for law enforcement. People have a right to protest without a 100-1 law enforcement presence. This is pure intimidation","date":"Sat Sep 18 23:41:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The defense of the politically persecuted is real and necessary.  But the overreaction of law enforcement leadership to this rally is a joke.","date":"Sat Sep 18 23:03:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/7j8xgpZWFq","date":"Sat Sep 18 23:02:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thank you for your service, Officer Erfle. God bless you and your family.","date":"Sat Sep 18 21:31:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"There is an invasion occurring at our southern border.","date":"Sat Sep 18 14:43:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/VNwdPZ2hWz","date":"Fri Sep 17 20:21:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/75TZkzTMY7","date":"Fri Sep 17 17:00:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Didn’t we pass “Right to Try?”","date":"Fri Sep 17 16:51:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"On this day, 234 years ago 39 men signed what is still the greatest political document of all time. It wasn’t written to restrict citizen’s behavior. It was written to restrict government’s behavior. Happy #ConstitutionDay! 📃 \n\nRead it here. https://t.co/sjqW1q4EA6 https://t.co/WOdGCcxZcs","date":"Fri Sep 17 16:33:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Just met with the Masada Charter School 5th Graders. I was so impressed by their bright young minds. Everyone received a pocket Constitution and a handshake. Invest in our children. They are our future. https://t.co/D9yo49cHQc","date":"Thu Sep 16 16:54:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Biden’s vaccine mandate &amp; censorship are enforced by a government monopoly on violence. \n\nSuch a mandate cannot be effective without violent enforcement - It’s not conspiratorial.\n\nThis is the inevitable trajectory of imminent vaccine enforcement: https://t.co/UTdE3tHnRA","date":"Tue Sep 14 21:43:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Stopping terrorism trade amendment: \n\nProhibiting the import of minerals and products produced by the Taliban. https://t.co/4je3USk0al","date":"Tue Sep 14 18:29:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Military-industrial complex monopoly amendment: \n\nRequires the Comptroller General to submit a report to Congress on the impact of mergers and acquisitions of defense contractors on the DoD procurement process. https://t.co/S2jRStVtj9","date":"Tue Sep 14 18:29:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Downwinders amendment: \n\nExpands a program that compensates individuals who were exposed to radiation from atmospheric nuclear testing and subsequently developed cancers. It also extends the Radiation Exposure Compensation Trust Fund for 5 additional years. https://t.co/mGc7zHzAtj","date":"Tue Sep 14 18:29:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Portugal-CCP amendment: \n\nStrikes provision making Portugal eligible for E category visas because of their easily-exploitable golden visa scheme that could allow Chinese Communist Party associates and foreign adversaries to enter the U.S. as “Portuguese” citizens. https://t.co/7Q2y5Xwrke","date":"Tue Sep 14 18:29:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Southern border wall construction amendment: \n\nAuthorizes the Army Corps of Engineers, through the Department of Defense, to construct a wall on the southern border with Mexico. https://t.co/70Ys6okkiH","date":"Tue Sep 14 18:29:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Separation of powers amendment: \n\nRepeals the War Powers Resolution and all states of emergency (including COVID), blocks unconstitutional presidential orders, and gives the People standing to challenge executive orders in court. https://t.co/FF90tJAcD3","date":"Tue Sep 14 18:29:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"War powers amendment: \n\nRestores Constitutional &amp; Congressional war authorities to raise and introduce U.S. forces into conflict. https://t.co/OiA4XoUGUO","date":"Tue Sep 14 18:29:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Afghanistan war records collection amendment: \n\nRequires the expeditious disclosure of all records related to the war in Afghanistan to the public. https://t.co/3ZQsnzbSJV","date":"Tue Sep 14 18:29:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I offered a number of amendments to the National Defense Authorization Act (NDAA). \n\nHere are some:","date":"Tue Sep 14 18:29:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"#BodyCams4Congress https://t.co/tiY1T1LLE1","date":"Tue Sep 14 17:43:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’ve introduced legislation requiring House of Representatives leadership to lead a program where members of Congress wear body cameras &amp; share the footage with the public: https://t.co/P2zNcoadjR","date":"Tue Sep 14 17:25:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today, I, along with @RepWesterman &amp; @RepPeteStauber sent a letter to U.S. Geological Survey Acting Director Dave Applegate, requesting information pertaining to the extent of the Taliban’s ability to develop Afghanistan's natural resources. @NatResources https://t.co/JYmmT2mXOC","date":"Mon Sep 13 20:40:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Anarcho-tyranny https://t.co/qwdJMgzqdE","date":"Mon Sep 13 17:29:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🤡\nhttps://t.co/XOE0WOS5sl","date":"Mon Sep 13 15:18:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today marks the 20th anniversary of the 9/11 terrorist attacks on our nation. My heart continues to be with the families of the nearly 3000 American civilians that were killed by Islamic terrorists that horrific day. Thank you to all those who defend freedom. #NeverForget 9/11/01 https://t.co/ZxfARp9vqv","date":"Sat Sep 11 19:51:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Joe Biden is from the government and he’s here to help. So we have nothing to worry about.","date":"Sat Sep 11 13:00:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Those who would give up essential Liberty, to purchase a little temporary Safety, deserve neither Liberty nor Safety.\" - Benjamin Franklin \n\n“This is not about freedom or personal choice it’s about protecting yourself and those around you.” - Joe Biden","date":"Sat Sep 11 12:56:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The @NatResources Democrat Budget Reconciliation passed 13 – 24.\n \n$31 Billion in spending, $6 billion in new fees and royalties, kills oak flat and grand canyon, includes $200 million Pelosi Payout.\n \nUGH…","date":"Fri Sep 10 17:29:57 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Anybody have any new conspiracy theories out there? Mine are all coming true.","date":"Fri Sep 10 16:26:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Many Americans are pro-vaccine but anti-mandate. The WH is on the wrong side of this issue.","date":"Fri Sep 10 16:21:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Taking away personal freedoms and forcing mandates upon people doesn’t usually make them trust you.","date":"Thu Sep 09 22:04:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Democrats already decided to continue lockdowns through the next election and are making excuses to justify their unconstitutional and authoritarian power grab. \n\nJoining me in demanding Congress stop the endless COVID national emergency declaration.","date":"Tue Sep 07 17:57:14 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’ve offered 3 bills to end the COVID national emergency declaration:\n\nH.J.Res.46\nH.J.Res.52\nH.R.4317\n\n@SpeakerPelosi responded by waiving constitutional requirements for congressional oversight and extending lockdowns through 2022.","date":"Tue Sep 07 17:57:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Arizona AG declares Tucson's COVID vaccine mandate for city employees ‘illegal’ @GeneralBrnovich https://t.co/rnUWHvPZA4 #FoxNews","date":"Tue Sep 07 16:50:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Shot. Chaser. https://t.co/ymgkc1RWAJ","date":"Tue Sep 07 16:39:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Here are some of the bills I’m pushing for:\n\nSecure Border/Elections\nEnd COVID nat. emergency\nImmigration moratorium\nAmericans not Aliens\nCriminal Alien Removal\nSeparation of Powers\nRelease of Afghan war records\nVaccine choice\nNo Tax on Social Security\nStop the Censorship\nImpeach https://t.co/GIK6xMk9mI","date":"Tue Sep 07 16:38:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What is going on over there? https://t.co/gCmg3NRtQ5","date":"Tue Sep 07 16:35:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"\"The price of liberty is eternal vigilance.\"\n-Thomas Jefferson","date":"Mon Sep 06 22:08:54 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Labor Day! https://t.co/SKzeeGLaiM","date":"Mon Sep 06 19:18:58 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Last week, ahead of Labor Day, @OversightDems voted against my amendment to ensure their “environmental justice” agenda does not include slave or child labor. \n\nWhy do @TheDemocrats support slave and child labor? https://t.co/KVtk8ZdoAK","date":"Mon Sep 06 16:06:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Labor Sunday https://t.co/TTOmTyNFWQ","date":"Sun Sep 05 14:04:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/p3OAKeeP6y","date":"Sun Sep 05 13:48:22 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@Idyll_Dream @mtgreenee Can we talk about where the electricity comes from for electric vehicles?","date":"Sat Sep 04 13:27:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Can we have a conversation about where the electricity for electric vehicles comes from?","date":"Fri Sep 03 14:30:29 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today in @GOPoversight, Democrats moved to unnecessarily electrify the federal fleet. In attempt to correct this bad policy I offered an amendment to ensure the minerals in the vehicles were not a product of slave and child labor. They voted it down.","date":"Thu Sep 02 22:47:23 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@ninnynoomy Do you know where the electricity comes from for the electric vehicles?","date":"Fri Sep 03 14:00:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I knew @repmikelevin couldn’t work in a bipartisan manner when he took my bill and wouldn’t let me be an original cosponsor due to politics, but to see him vote against his own bill - a bipartisan effort, that we worked on together for years, was just wild.","date":"Thu Sep 02 23:21:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today in @GOPoversight, Democrats moved to unnecessarily electrify the federal fleet. In attempt to correct this bad policy I offered an amendment to ensure the minerals in the vehicles were not a product of slave and child labor. They voted it down.","date":"Thu Sep 02 22:47:23 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’m offering amendments to promote American mining, new renewable energy and revenue sharing with our counties in Arizona, stop trade in Afghan minerals, promote hunting and fishing, and stop the new “dirt tax”. @NatResources https://t.co/1ypIwDSOir","date":"Thu Sep 02 17:36:09 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today in Natural Resources I am voting against more than $31 billion in new democrat spending, while at the same time they impose billions in new taxes and fees on America’s mining and energy industries. @NatResources https://t.co/6rvWHDjfvW","date":"Thu Sep 02 14:57:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I will be offering a number of amendments in Democrats’ sham mark-up today an effort to combat their out-of-control, socialist wish list, which would hamstring the economy, cripple domestic energy production, &amp; make the U.S. dependent on foreign adversaries. @NatResources","date":"Thu Sep 02 14:16:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Biden: “perception around the world and in parts of Afghanistan, I believe, is that things are not going well in terms of the fight against the Taliban...And there is a need, whether it is true or not, there is a need to project a different picture.”https://t.co/oDIEpxVirT","date":"Thu Sep 02 02:59:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We’re hitting levels of America last that shouldn’t even be possible. Biden securing the Afghanistan-Tajikistan border but not the U.S.-Mexico border is preposterous.","date":"Thu Sep 02 02:24:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Prioritize American citizens. https://t.co/OzbqQgfgyA","date":"Wed Sep 01 21:12:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“8.7 million [Americans] remain unemployed” and Democrats are demanding permanent residence for foreign nationals with temporary work visas, &amp; no cap on “immigrants from India, China, and other countries with large populations of workers”","date":"Wed Sep 01 20:53:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“no connection between the vetting of Afghans and their admission to the United States...every Afghan on board, regardless of background or possible security threat, became a de facto permanent resident of the U.S.”\n https://t.co/qy1r2etn3B","date":"Wed Sep 01 19:41:18 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We went to Afghanistan to fight them there. Not bring them here. \n\nNow Biden is offering unlimited  \"humanitarian parole\" to unvetted, visa-less foreigners to stay in the U.S. forever even if they commit crimes.\n\nSays for \"significant public benefit”","date":"Wed Sep 01 17:16:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"How it started      How it’s going https://t.co/i53pPnrN0c","date":"Wed Sep 01 17:16:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Similar situation in Yuma, Arizona where cartels/criminals are stealing materials for the border that Democrats refuse to build. https://t.co/8nPhNApE8G","date":"Wed Sep 01 16:05:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Meanwhile at the border... https://t.co/AyJ6QovKcp","date":"Wed Sep 01 15:18:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"GREAT NEWS!","date":"Wed Sep 01 13:28:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/9NchsocRca","date":"Wed Sep 01 01:38:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/GkgUDRJ3Dg","date":"Wed Sep 01 00:02:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Time to require Biden, CIA &amp; all Gov agencies &amp; contractors to archive &amp; expeditiously disclose of all records relevant to the war in Afghanistan. \n\nThere R no more ongoing operations to protect. Americans want the truth. All of it.\n\nComing: Afghanistan War Records Collection Act","date":"Tue Aug 31 21:22:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/5Rws4BlL6S","date":"Tue Aug 31 19:52:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/ApEQ51kPnR","date":"Tue Aug 31 15:39:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Announcement: 🚨Mineral Mondays and The Gosar Minute will taking a few weeks off due to August recess. Don’t worry, we’ll be back in full swing with your favorite content faster than a “Gosar Minute.” https://t.co/75gVYd2RPl","date":"Tue Aug 31 01:50:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/qnnGTJCncB","date":"Mon Aug 30 22:23:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/4BdOaktzqU","date":"Mon Aug 30 21:54:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Convicted illegal drug &amp; gun trafficker was deported &amp; re-entered the U.S. illegally for a 3rd time, an additional felony and one of the most frequent federal felonies. \n\nJudge ruled felony unconstitutional because it has “disparate impact on Latinx” 🤡\nhttps://t.co/krkV431e7z","date":"Mon Aug 30 19:13:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Disparate impact is the dubious basis of bad ideas like CRT &amp; Affirmatively Furthering Fair Housing (AFFH) which I successfully blocked under Obama, Trump eliminated, &amp; Biden brought back. \n\nAFFH bars $ to communities that don’t conform to “disparate impact theory” https://t.co/qftfYgV6tI","date":"Mon Aug 30 19:13:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"More incompetence and indifference by the Biden Admin. Using the Taliban as the equivalent of door bouncers was sheer insanity. https://t.co/LtBvmR3ywI","date":"Mon Aug 30 17:44:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Gosar Grindset: https://t.co/yyN2msrAP2","date":"Sun Aug 29 00:03:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/N3fvpiC2cj","date":"Sat Aug 28 23:42:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Apologize and retract.","date":"Fri Aug 27 23:55:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I spoke with the great @JamesTHarris about putting #AmericaFirst\n\nListen here:\nhttps://t.co/17bTHOh8ai","date":"Fri Aug 27 21:08:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’m demanding answers and accountability from @SecBlinken for canceling President Trump’s Contingency and Crisis Response Bureau, which was setup to protect Americans during the Afghanistan withdrawal\n👇🏻 https://t.co/1eYc3s0woH","date":"Fri Aug 27 19:25:48 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Hope the “incident” was a @KamalaHarris condemnation of the racist term ‘Havana syndrome’ https://t.co/UHDJjSY2XC","date":"Wed Aug 25 13:18:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"You know it’s true. https://t.co/zvqJAC3ipU","date":"Tue Aug 24 13:05:18 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thanks to @TuckerCarlson and @BillFOXLA for reporting on our raised concerns to Homeland Security @SecMayorkas regarding freed Afghan prisoners and our porous southern border. We need border security, now. https://t.co/9u25y7EJba","date":"Tue Aug 24 10:49:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Proud to sponsor Stop the Censorship Act https://t.co/FhUJduas10","date":"Sun Aug 22 01:43:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Prayers for Cardinal Burke 🙏\n\nChrist is king","date":"Sun Aug 22 00:34:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thanks @FAIRImmigration for your support of Americans not Aliens Act:“Congressman Paul Gosar’s common-sense bill will prohibit any removable aliens from receiving work permits. We applaud Congressman Gosar’s long and continuing leadership on this issue.\"","date":"Fri Aug 20 21:01:22 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thanks to Americans not Aliens Act cosponsors @RepBrianBabin @RepRosendale @RepJeffDuncan @RepMattGaetz @replouiegohmert https://t.co/G9MXraSvyn","date":"Fri Aug 20 20:58:50 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I introduced Americans not Aliens Act👇🏻🇺🇸 \nhttps://t.co/3hA6uuib6H","date":"Fri Aug 20 20:56:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Canceling this successful [Trump] program before the withdrawal that would have helped tens of thousands Americans reach home is beyond disgraceful. Our withdrawal was conditions-based and perfect...nobody would have even known we left.”\n-President Trump\nhttps://t.co/MH1aHKt2fi","date":"Wed Aug 18 20:38:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Ninety to ninety-five percent of these are one-off cases... Then you have five percent, maybe, of these militia groups that were more closely organized. But there was no grand scheme with Roger Stone and Alex Jones and all of these people to storm the Capitol and take hostages.\"","date":"Fri Aug 20 14:36:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"While Biden is closing American mines and killing American jobs, his allies at CNN are already supporting enriching the Taliban by mining American discovered minerals.\n\nhttps://t.co/pFVQIhdd1D","date":"Fri Aug 20 14:06:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s a positive development when women and children are protected. Glad to see @OnlyFans move to ban illicit content.\n\nEarlier this year I initiated the pressure for an investigation:","date":"Thu Aug 19 22:09:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🇺🇸\n https://t.co/7rAVq9yEcd","date":"Thu Aug 19 21:33:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Canceling this successful [Trump] program before the withdrawal that would have helped tens of thousands Americans reach home is beyond disgraceful. Our withdrawal was conditions-based and perfect...nobody would have even known we left.”\n-President Trump\nhttps://t.co/MH1aHKt2fi","date":"Wed Aug 18 20:38:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Gosar Minute🚨 For too long, Coptic Christians living in Egypt have been assaulted and even murdered solely for their Christian faith. This is unacceptable. Recently, I co-sponsored H. Res. 117, a bipartisan resolution supporting Coptic Christians in Egypt. https://t.co/TnGXAdNWpR","date":"Wed Aug 18 14:11:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Perhaps You Were Born for Such a Time as This.” - Esther 4:14","date":"Tue Aug 17 21:56:17 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What is the plan to get our equipment back? https://t.co/EhRck7cwzJ","date":"Tue Aug 17 21:45:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Facts.","date":"Tue Aug 17 21:43:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Repressive regimes require face covering, close schools, confiscate weapons, and don’t allow citizens to fly. \n\nAre you awake yet?","date":"Tue Aug 17 12:58:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s #MineralMonday! Today we talk about vitamins and the minerals we put in our bodies. They make us healthy, wealthy and wise, after all. 😉 https://t.co/MUMezjtPmL","date":"Mon Aug 16 23:52:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I want Trump back on Twitter.","date":"Mon Aug 16 15:38:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Special forces veteran and former CIA operator, Joe Kent, details who Congress should subpoena and what questions to ask regarding January 6th. And reiterates call for Capitol Police to release all footage: https://t.co/MOFCGOqD6p","date":"Sun Aug 15 19:14:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Authoritarian regimes force people to  cover their faces and stay at home","date":"Sun Aug 15 16:04:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This is insane. https://t.co/YslFkev5Np","date":"Sat Aug 14 16:56:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Who needs state-run media when tech oligarchs just do it for you?","date":"Fri Aug 13 13:58:57 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨GOSAR MINUTE🚨 Did you know that after working for your entire life and paying taxes, the government THEN taxes your social security income? That money has already been taxed! This is NOT cool. My bill fixes this. https://t.co/SsSA9VTUoa","date":"Wed Aug 11 15:10:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I teamed up with @RepAnnWagner and 100+ colleagues on this bipartisan follow-up letter to @TheJusticeDept regarding missing children and child exploitation associated with @OnlyFans \nhttps://t.co/5NuVhX1Apk","date":"Tue Aug 10 20:12:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We need to have a field hearing to address the #BidenBorderCrisis. \n\nWe need to put Americans First. \n\nThank you to my colleague from New Mexico, @RepHerrell for leading this effort.","date":"Tue Aug 10 17:27:18 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"He’s right.","date":"Tue Aug 10 17:09:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I’m writing the U.S. Attorney General requesting an investigation into @OnlyFans for promoting, and profiting from, online prostitution. I encourage @TheJusticeDept to vigorously protect vulnerable people from platforms that promote coercive immoral and sexual activity.\n\n👇 https://t.co/byb03hG3ya","date":"Thu Apr 01 19:47:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s #MineralMonday! Today we discuss, gold, jewelry, gemstones and the rarest stone on earth- musgravite. Ladies, if your man truly loves you, he would get you a ring with a musgravite setting. 💍 https://t.co/5UMgdueaWJ","date":"Tue Aug 10 01:04:26 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The President is not a king.","date":"Thu Aug 05 19:01:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The Biden admin is breaking the law by extending the eviction moratorium without congressional approval.\n\nLiterally • Breaking • the • Law.","date":"Thu Aug 05 16:16:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Fact check: 100 https://t.co/RXLwNOEChF","date":"Thu Aug 05 14:56:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@glennbeck called all of this a decade ago.","date":"Wed Aug 04 22:14:17 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“I’m from the government and I’m here to help” are still the most terrifying words in the English language.","date":"Wed Aug 04 19:32:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Just more crime from illegal aliens. \n\nIf you commit 3 crimes when you come to this country:\n•crossing illegally\n•staying illegally\n•and working illegally\n\nCan we be surprised more crimes will result? \n\nhttps://t.co/PQaAURWSEk","date":"Wed Aug 04 18:56:17 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Oh","date":"Wed Aug 04 18:22:48 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"2/2 Why limit this to COVID? Flu shots? Taking HIV meds? Birth control? Anti-anxiety or anti-depression meds? Why not a passport for all meds. If you think that is crazy (and it is) then draw the line here because crazy today is normal tomorrow.","date":"Wed Aug 04 17:05:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"1/2 If we accept vaccine passports now, there is no reason why they won’t be used every year for the rest your life to force you to receive your “booster.” If you’re not a fan of this idea, the time to push back is NOW and I mean NOW.","date":"Wed Aug 04 17:04:21 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨 #GosarMinute 🚨 We cannot have legal immigration when we are experiencing an invasion of rampant illegal immigration at our southern border. It’s a threat to our national security and economy. We must wrap our arms around this and press pause until we do. #10yearmoratorium https://t.co/8hRMI3TTn7","date":"Wed Aug 04 15:36:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"If you let politicians break the law during an emergency, they will create an emergency in order to break the law.","date":"Wed Aug 04 02:52:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Did you know that there are capitol police officers who are trying to testify but Speaker Pelosi is banning them from testifying? Look at my statement and the letter from the police union on this travesty. https://t.co/CAuVPpBvDa","date":"Tue Aug 03 20:10:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Immigration moratorium. Americans, first.","date":"Tue Aug 03 16:26:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"FACTS","date":"Mon Aug 02 21:44:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s #MineralMonday and today, I invite  you to join me for breakfast. 🍳 The glass I’m drinking out of, the plate I’m eating on, the silverware I’m using and even the salt I’m enjoying - all come from minerals derived from the earth and had to be mined. \n\nENJOY! https://t.co/wdy9XLfezX","date":"Mon Aug 02 21:21:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The Biden admin clearly thinks you are stupid. They are going to try and lockdown and shutter your businesses for a second time, while our southern border remains an open sieve. \n\nHow many of these people have covid? Are any of them wearing masks?","date":"Mon Aug 02 15:51:50 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"On 7/27/2021, the CDC reversed course, yet again and is now saying “all vaccinated people must wear masks indoors.” When will this end? Schools requiring vaccines that are ineffective? Constantly being told to wear a mask? Not being able to rely on any source? \n#GosarMinute https://t.co/EtbZYvcRqP","date":"Mon Aug 02 14:15:54 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’m asking for a friend too. 👇\n\nI even have a tracker keeping track of how long it’s taking on the landing page of https://t.co/ruAhO2wo6k. \n\nThis is the ticker mark at of this tweet. https://t.co/QqJWKqBNBg","date":"Sun Aug 01 23:09:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I am launching “The Gosar Minute.” My team will discuss current events in short one minute clips and my take or involvement in them. Today’s topic is my recent visit to the DOJ with \n@RepMTG\n@RepMattGaetz \n@replouiegohmert\n\nENJOY! 🇺🇸 https://t.co/K9gBpaW9Dj","date":"Sun Aug 01 21:04:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"MAKE AMERICA FREE AGAIN!","date":"Sat Jul 31 20:45:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thanks for the socks! @RepJohnCurtis https://t.co/6VbWHcYs2g","date":"Fri Jul 30 22:02:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"#ForAshli https://t.co/9XjoQlhgW1","date":"Fri Jul 30 02:04:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today is #NationalInternDay. I have the best and most based interns out there. Cheers to you! 🇺🇸 https://t.co/qWnD5tohnm","date":"Thu Jul 29 20:06:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@RepTedBudd @RepRalphNorman @RepArrington @DesJarlaisTN04 @Robert_Aderholt @TXRandy14","date":"Thu Jul 29 02:10:54 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"...Congressman Gosar and Senator Kennedy are trying to do the opposite. Their bill is a reasonable solution that would keep American communities safe. We’re proud to support it.”\n-RJ Hauman, Government Relations Director, @FAIRImmigration","date":"Thu Jul 29 02:10:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"\"NumbersUSA is pleased to support Congressman Gosar’s Criminal Alien Removal Clarification Act. Convicted criminal aliens should be removed from our country so they can no longer victimize Americans or legal immigrants. This bill would make our neighborhoods safer.\" @NumbersUSA","date":"Thu Jul 29 02:10:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thanks cosponsors @RepBrianBabin @RepAndyBiggsAZ @RepDLesko @RepBoebert @RepKenBuck @RepMoBrooks @RepKatCammack @RepJeffDuncan @RepMattGaetz @RepBobGibbs @replouiegohmert @RepBobGood @RepMTG @RepGrothman @CongressmanHice @RepMcClintock @RepScottPerry @RepRosendale @RepHerrell ...","date":"Thu Jul 29 02:10:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Biden, Secretary Mayorkas, and Democrats on Capitol Hill have one objective on our issue – a borderless nation with virtually no enforcement of immigration laws, including the deportation of criminals...","date":"Thu Jul 29 02:09:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"...This straightforward proposal is an important first step toward restoring our national security and public safety.” John Zadrozny, Director for the Center for Homeland Security and Immigration @A1Policy","date":"Thu Jul 29 02:09:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“open-borders policy is inviting violent criminals into the U.S. I’m grateful that Congressman Gosar is introducing the Criminal Alien Removal Clarification Act in the House to help deport dangerous criminals who are putting American communities at risk every day”\n@SenJohnKennedy","date":"Thu Jul 29 02:09:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"...Current statutory language is unnecessarily complicated and has provided federal judges with the ability to create truck-sized loopholes...the net result of which is criminal aliens remaining free on our soil and hurting Americans...","date":"Thu Jul 29 02:09:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Proud to sponsor Criminal Alien Removal Clarification Act with @SenJohnKennedy\n\nThis common-sense legislation would remove any alien who has committed a felony or two or more misdemeanors.\nhttps://t.co/cisoDWuiFx","date":"Thu Jul 29 02:09:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“The America First Policy Institute supports Rep. Paul Gosar’s efforts to protect American citizens and communities by clarifying the conditions under which criminal aliens can be removed from the United States...","date":"Thu Jul 29 02:09:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Look at this. Look at the spike in drug seizures. This is just what we’re catching... https://t.co/bqQeC9SpYV","date":"Wed Jul 28 20:57:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Our Northern Border with Canada is still closed due to COVID while our Southern Border is wide open.","date":"Wed Jul 28 20:53:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’m sorry but there is no world in which vaccine passports are ok and voter ID is not.","date":"Wed Jul 28 20:32:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"RT if you’re sick of paying more for gas.⛽️","date":"Wed Jul 28 20:24:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Stone-Manning is playing the ‘ole “but my terrorism was 30 years ago,” card. \n\nIt’s an honor to serve the American people. There are plenty of more qualified individuals to lead the @BLMNational.","date":"Wed Jul 28 19:17:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What’s worse, did you know they prioritized this over funding American National Security? Not kidding.\n\n#Priorities","date":"Wed Jul 28 19:11:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Did you know House Democrats just voted to give themselves a 13% raise?","date":"Wed Jul 28 19:07:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Illegal Immigration destroys the environment. @RepWesterman","date":"Wed Jul 28 18:40:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Get this done. \n\nhttps://t.co/l0AAEEZaEb","date":"Wed Jul 28 14:08:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today, I joined this letter asking DHS to release secret OPT data. Thanks to my colleague from North Carolina, @RepCawthorn for leading this effort.","date":"Tue Jul 27 20:56:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Where is the @ACLU, @amnesty, @hrw? https://t.co/AIggJB0Lfe","date":"Tue Jul 27 17:17:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Her life mattered.","date":"Tue Jul 27 16:42:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Jenny Jenny, I got your minerals.” This week for #MineralMonday we discuss phones and computers. The screen you’re watching this on is likely a liquid crystal display. The liquid crystals are encased in a polymer, indium tin oxide, silicon dioxide and glass on either side. https://t.co/Pjgxor01nA","date":"Mon Jul 26 22:53:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Fair criticism. Last congress I sponsored:\n-Stop the Censorship Act (23 cosponsors)\n-Don’t Push My Buttons Act\n-Break Up Big Tech Act\n\nAll were bipartisan.","date":"Mon Jul 26 21:02:23 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I offered two dozen reasonable amendments to Pelosi’s partisan appropriations package, including prohibiting funds for gender studies in Pakistan and requiring the release of J6 security footage. https://t.co/hGbui6Vkue","date":"Mon Jul 26 15:54:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Simply stated, the Biden Administration has placed its political push for amnesty ahead of its constitutional obligations to American citizens... Americans also deserve at least the courtesy of having the same freedom as illegal aliens on American soil.”\nhttps://t.co/1Kln0ohM7Y","date":"Mon Jul 26 14:32:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The best is yet to come!","date":"Sun Jul 25 20:13:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“I praise the efforts of Congressman Paul Gosar in drafting the Fairness for High Skilled Americans Act and encourage his colleagues in both the House and Senate to join him in protecting opportunities for America’s STEM graduates,” Kevin Lynn, Founder of @USTechWorkers","date":"Sat Jul 24 00:28:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“We applaud Rep. Gosar's steadfast commitment to protecting American workers with the reintroduction of the Fairness for High-Skilled Americans Act,\" added Rosemary Jenks, Director of Government Relations, @NumbersUSA","date":"Sat Jul 24 00:28:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“The America First Policy Institute supports Rep. Paul Gosar’s efforts to prioritize the interests, careers, and futures of American citizens,” stated John A. Zadrozny, Director for the Center for Homeland Security and Immigration, @A1Policy","date":"Sat Jul 24 00:28:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I also reintroduced Fairness for High-Skilled Americans Act which eliminates the illegal OPT program - a foreign labor subsidy for Big Tech that incentivizes employment discrimination against U.S. citizens #AmericaFirst","date":"Sat Jul 24 00:28:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This week I sponsored a 10-year moratorium on immigration until we can figure out how to put Americans first https://t.co/L7zPvfQIDs","date":"Fri Jul 23 20:49:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Got Milk? 🥛 \n\nTonopah Dairy Farms sure does! They produce 300,000 lbs of the stuff per day! Thanks guys for teaching me all about the process. Interesting stuff! https://t.co/jmZ2qZtBMn","date":"Fri Jul 23 20:44:22 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"STOP CENSORING THE AMERICAN PEOPLE! @GOPoversight","date":"Fri Jul 23 14:48:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"FINISH THE WALL!","date":"Fri Jul 23 14:35:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Truly Disgusting.  #HydeSavesLives","date":"Thu Jul 22 18:57:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Stop the censorship\n https://t.co/fBM76CZW5d","date":"Thu Jul 22 15:15:33 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"FRIENDLY REMINDER THAT BIDEN’S @BLMNational NOMINEE IS AN ECO TERRORIST.","date":"Thu Jul 22 13:55:54 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"NO TAXING SOCIAL SECURITY BENEFITS!\n\nThose taxes have already been paid!","date":"Wed Jul 21 19:47:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This week for #MineralMonday, I flew into DC from AZ and recorded the importance of critical minerals as it relates to airplanes. It’s funny how many of my colleagues would like to shut down mining - how will they get back and forth? Maybe they want to take a horse? 🐎 https://t.co/4TzDHn4RnV","date":"Wed Jul 21 02:32:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The #2A protects all of the other amendments. I oppose the unconstitutional gun control measures at stake in the upcoming Supreme Court case NY State Rifle &amp; Pistol Association (NYSRPA) v. Corlett. I was proud to join 168 of my colleagues &amp; @RepTenney to defend your #2A rights. https://t.co/Ye8ufU5jhi","date":"Wed Jul 21 00:48:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@RepMoBrooks COS has a very cute puppy. Thanks for stopping by Peanut! 🐶 https://t.co/LebNCpIRhz","date":"Tue Jul 20 20:30:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The dam is breaking at our border. Migrants are literally flooding across. This is unsustainable and the Biden admin knows it. \nhttps://t.co/QV5WuKBLLx https://t.co/APCA6Pd0Oo","date":"Tue Jul 20 14:42:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Mineral Monday delayed until Tuesday because of travel. Might have to rename it Titanium Tuesday. 🪨 👷","date":"Mon Jul 19 18:59:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Peter Doocy is #based. @pdoocy","date":"Sat Jul 17 03:43:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today we took a step toward ending Big Tech’s deathlike grip on censorship, power and agitprop by launching the Freedom From Big Tech Caucus. @RepKenBuck @Lancegooden @RepBurgessOwens @RepCawthorn \nhttps://t.co/8bcLNbAGlU","date":"Fri Jul 16 15:51:48 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It only took us about 20 minutes to collect nearly 1,500 of trash and there is SO MUCH more left. Where are our Democrat friends who claim to have the moral authority on protecting the environment? Please let me know if you find any. https://t.co/Hk9xPoTgHe","date":"Thu Jul 15 22:13:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’m in Casa Grande with @sherifflamb1 visiting a known route from the Mexican border into AZ for human, sex and drug trafficking. Illegals leave thousands of lbs of trash on these routes - destroying the environment. Plastic bottles, clothing, Plan B, knives, you name it. https://t.co/7dDwLjeqI9","date":"Thu Jul 15 21:07:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Quick reminder that Biden’s BLM nominee, Stone-Manning is “an eco-terrorist, who maimed and hurt working people in the timber industry.” This radicalism is on full display. Stone-Manning should never be BLM Director. https://t.co/OROGOF5bDQ","date":"Thu Jul 15 16:10:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Birthday Sheriff Lamb! 🇺🇸@sherifflamb1 https://t.co/hTXqh7EaLK","date":"Thu Jul 15 14:42:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"For more than 40 years, the Hyde amendment has ensured that American tax dollars are not used to fund abortions, resulting in nearly 2.5 million lives saved. This year, Democrats have stripped this protection from the appropriations bill. Congress must Hyde. #HydeSavesLives https://t.co/FPMhqGsL3q","date":"Thu Jul 15 14:38:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The people of Cuba are not protesting because lack of access to the vaccine. \n\nRepublicans do not want to defund the police. \n\nThis was not the most secure election in U.S. history.","date":"Wed Jul 14 02:01:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The Biden Administration in partnership with the DNC, plans to monitor the private text messages of American citizens who question experimental, mRNA, emergency authorized, non-FDA approved vaccines. \n\nI can’t believe I am writing this. \n\nhttps://t.co/J0TD1bdmIv","date":"Tue Jul 13 20:07:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Who is spending $500,000 on artwork by Hunter Biden?","date":"Tue Jul 13 19:27:09 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/tDTW8WgqeM","date":"Mon Jul 12 23:19:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This week for Mineral Monday, I’m at the Hoover Dam. When first built, it was the largest masonry structure in the world since the pyramids. Imagine 4.4 MM cubic yards of concrete, 88 MM lbs of steel 6.7 MM pounds of pipes, 45 MM lbs of steel. ALL these materials had to be mined. https://t.co/R81vfa8xlC","date":"Mon Jul 12 22:35:29 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This is great.","date":"Mon Jul 12 21:28:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"If you don’t like America, don’t represent her in the olympics.\n\nI am proud to sign onto this letter. Thank you to my colleague from Montana, @RepRosendale for leading this effort. \n\n#GodBlessAmerica","date":"Mon Jul 12 19:24:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s simply unacceptable that our veterans &amp; their families are waiting in some cases over a year to receive the records needed from the National Personnel Records Center for the purpose of ensuring proper military honors at a funeral, small business loans, medical claims &amp; more.","date":"Mon Jul 12 17:12:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/bTs3ICA0aU","date":"Sun Jul 11 22:18:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Minerals make our world work. Mining makes our world work.\n\nAnd that’s the “dam” truth. https://t.co/zs1EJJzR3j","date":"Sun Jul 11 18:41:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"My deepest condolences to the families of two brave firefighters who  passed away this afternoon providing reconnaissance intel regarding the Cedar Basin Fire near Wikiup, Arizona.\nhttps://t.co/gqfesdIhyQ","date":"Sun Jul 11 03:26:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Call to schedule an appointment today! https://t.co/citVNu2IbE","date":"Fri Jul 09 15:19:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Haters get mad https://t.co/bGbo9dnnqJ","date":"Fri Jul 09 13:17:33 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Mood going into the weekend: https://t.co/gn7bHG2z8S","date":"Fri Jul 09 13:17:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"In June, Biden shared a list of critical infrastructure which told Putin should be \"off-limits\" from Russian-backed cyberattacks. The Admin should focus on strengthening our critical infrastructure, not broadcasting its weaknesses to foreign adversaries. \nhttps://t.co/vQFj60Qvhj","date":"Wed Jul 07 15:47:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Ask not what your country can do for you – ask what you can do for your country.” - John F. Kennedy, 1961","date":"Tue Jul 06 15:32:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s no wonder that President Biden and House Democrats are attempting to rewrite history surrounding their support of the defund the police movement. https://t.co/z3K7MHau6h via @nypost","date":"Tue Jul 06 15:18:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This week for Mineral Monday I’m joined by my good friend Doug, a geologist, who explains the modern day “leaching” method for extracting minerals. This is not your grandfathers mining folks. Previously abandoned mines are now being reignited thanks to modern day technology. https://t.co/lvonCAOwXt","date":"Mon Jul 05 22:22:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Birthday America! 🇺🇸\n\nI hope you are enjoying celebrating your freedom with those closest to you. After the year we’ve had, freedom means more to all of us than ever before. We must cherish it and honor it. God bless America! #IndependenceDay https://t.co/M9gh8pcxVO","date":"Sun Jul 04 18:06:22 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Excellent autopsy report on the 2020 election by @approject. In order to win future elections the #GOP must embrace the #MAGA movement and push back hard against “wokeism.” https://t.co/9h9jNeayLK","date":"Thu Jul 01 21:24:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today’s Supreme Court ruling is a huge win for election integrity and huge blow to the Democrats’ partisan lies.","date":"Thu Jul 01 18:56:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thanks to cosponsors @RepThomasMassie, @RepMTG, and @RepBoebert","date":"Thu Jul 01 16:22:21 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Democrats unconstitutionally eliminated the requirement for Congress to consider my bill that terminates COVID-19 emergency powers. In response, I’m sponsoring the Separation of Powers Restoration Act. \n\nCongress and the President must follow our Constitution: https://t.co/cLWyevq9XY","date":"Thu Jul 01 16:22:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Congrats @Suns for winning the western conference last night! Next stop, finals! #rallythevalley https://t.co/J3xlMczC4N","date":"Thu Jul 01 13:33:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The National Emergencies Act requires congress to engage in debate by meeting to discuss the termination for national emergencies. I am calling on Congress do what is required of us under the law and have this debate. https://t.co/nQTg24ALR7","date":"Thu Jul 01 02:34:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"8 years ago, we lost 19 brave heroes in the Yarnell Hill Fire. The Granite Mountain Hotshots were fighting the fire and protecting the great people of Prescott, AZ when they were unexpectedly overrun with fire. They were sons, husbands, brothers &amp; fathers. We will never forget. https://t.co/Pl27T2XYhB","date":"Wed Jun 30 19:45:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The Biden Admin is telling top Border Patrol brass, who are simply trying to enforce the laws at our southern border, to resign, retire or relocate. Mayorkas has spoken of wanting to bring “cultural change” to the Border Patrol.   https://t.co/Fh7rjNUEkI","date":"Mon Jun 28 23:45:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This week for Mineral Monday, I’m joined by Paul Marsh with CalPortland to discuss concrete and aggregates. Aggregates are used to build roads and bridges but they also build our communities and are critical to our way of life. #MineralMondays https://t.co/KmSy4cmHqk","date":"Mon Jun 28 18:47:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/y6l8QZN8jI","date":"Mon Jun 28 18:19:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"If you don’t like America, don’t represent her in the Olympics.","date":"Sun Jun 27 23:38:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Good to see 45 feeling the love.  https://t.co/ImsgWX6Xjk","date":"Sat Jun 26 21:54:48 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This whole “Latinx” thing strikes me as contrived, superficial and colonialist. I reject it categorically.  #LiberalLogic","date":"Sat Jun 26 21:50:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"RISE UP!","date":"Sat Jun 26 21:24:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"At the Natural Resources Hearing I had a chance to talk with @SecDebHaaland about working with Navajo Nation and bringing good jobs in helium, lets make it happen @NNVP_Lizer. https://t.co/PDNKt75D4L","date":"Thu Jun 24 21:04:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I look forward to working with the @SecDebHaaland to keep water from NGS in Northern AZ and solve our local problems and get areas cleaned up. https://t.co/52r9H4IDV8","date":"Thu Jun 24 21:01:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@AJW_SP I could not agree more. Anyone focused on finding solutions, I will chat with at anytime. Thank you for your constructive thoughts.","date":"Thu Jun 24 20:28:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@AJW_SP No problem. I’ll write the comments. \n\n“Insurrectionist, traitor, your family hates you.” \n\nDid I miss anything? So boring. Over it. 🥱","date":"Thu Jun 24 16:10:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Democrat mayors have no idea why homicide is soaring in major American cities. 🤡  They have eyes but do not see and ears but do not hear. https://t.co/n9P6XCqfiM","date":"Thu Jun 24 15:29:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"No.","date":"Thu Jun 24 02:31:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The Biden-Harris Admin knows exactly what it is doing. If they thought the individuals pouring across our border were going to vote Republican, it would be shut down and secure in two seconds flat. This is about power. Thank you Dr. Gina Louden for having me @realamericasvoice. https://t.co/2wqNoOpcLM","date":"Thu Jun 24 02:05:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I joined my colleagues in support of a resolution that affirms state’s rights to protect their citizens from the border invasion because the Biden-Harris Administration has failed to do so. I thank my colleague from Texas @RepArrington for leading this effort. https://t.co/6dV8ZHCkhk","date":"Thu Jun 24 01:23:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Nineteen years ago, on Oct. 10, 2002, Congress voted to authorize the use of military force against Iraq. The American taxpayer has been paying to support that country ever since. It’s time to end forever wars. \n\nMy OpEd in the @WashTimes. 👇\n\nhttps://t.co/kK6sixNEHm","date":"Thu Jun 24 00:53:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"China lied. Millions died.","date":"Wed Jun 23 14:34:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I stand with the lives of the unborn. 4 million little innocent lives are murdered through the abortion pill, and made more accessible through mail telAbortion. Join @SFLAction tonight to put an end to this. https://t.co/nSgyPaziGW https://t.co/QK7fWfwwuR","date":"Tue Jun 22 22:49:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@RepGosarFan @RepLouBarletta @PennPaleocon In the works. 😉","date":"Tue Jun 22 20:45:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What a great podcast by the BASED  ⁦@SamJacobs1776⁩. We discuss everything from the border, Big Tech to our power grid and more. Give it a listen. ⁦@ammodotcom⁩  https://t.co/JYrOs8W8iA","date":"Tue Jun 22 20:17:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Finally, Kamala is visiting a border state! #wrongborder, Kamala. https://t.co/YZkTg8yJx5","date":"Tue Jun 22 19:59:50 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"President Biden Doesn’t Think A 15-week-old Unborn Baby Is A Human Being.","date":"Tue Jun 22 00:18:26 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This week for Mineral Monday, I’m joined by my friend @SteveTrussell3, head of @azmining. We are at Pinto Valley Mine, discussing Molybdenum. Pinto produces 4B lbs of it / yr &amp; contributes $270M to AZ’s economy. “Moly” is used for hardening steel &amp; is critical to our way of life. https://t.co/rhuOz3PmpE","date":"Mon Jun 21 22:20:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Father’s Day! https://t.co/UFG85QW8ca","date":"Sun Jun 20 14:44:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It is unacceptable that the Wuhan virus lab that may have caused the pandemic remains eligible to receive US funds. I’m proudly cosponsoring the Defund Wuhan Institute of Virology Act to ensure US taxpayer dollars never again fund this dangerous lab. https://t.co/6LpzhXghQu","date":"Thu Jun 17 15:20:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Special thanks to @USEnergyStream for allowing me to talk about American energy and how we can continue an American Century of energy dominance. https://t.co/zsQGGWyIad","date":"Thu Jun 17 14:55:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Click here to read my statement on why I voted NO on the Juneteenth National Independence Day Act. https://t.co/7ViLZzGulf https://t.co/j5jM1GS1bq","date":"Thu Jun 17 04:08:02 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Political appointees have an obligation to the American people not to bring their special interest agenda to the table. We need answers to the real questions about who the BLM Department Director is working for, special interests or the American people. https://t.co/OOSzGT3Nzp","date":"Wed Jun 16 23:15:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Democrats in Congress are committed to killing all fossil fuel jobs, now holding hearings on why fossil fuel worker communities don't have good jobs.  Maybe we should just keep the good jobs in the first place.\n https://t.co/LjXQcOufcs","date":"Wed Jun 16 23:10:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Like FBI Director Wray has said, “Video footage is often very useful to document an event”... What is he so scared to uncover in this video documentation? The public deserves answers.","date":"Wed Jun 16 20:39:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"How I sleep at night knowing I live rent and guilt free in Jayapal’s head. \nhttps://t.co/nxFcaZV0RY https://t.co/aOMbTnWx2v","date":"Wed Jun 16 04:47:26 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s time for Fauci to hit the road. Proud to be a cosponsor of the Fire Fauci act. Thank you to my colleague from Georgia, @RepMTG for leading this effort. https://t.co/Q8m9WmEf5Y","date":"Tue Jun 15 22:55:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/wCOA6cISju","date":"Tue Jun 15 18:27:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Lie 11) Officer Sicknick was killed by 1/6 rioters. \n\nTruth: Videos show the officer was never struck with a fire extinguisher. Medical examiner’s report found that he died on 1/7 from two strokes caused by arterial blood clots. No physical harm. Not a scratch.","date":"Tue Jun 15 17:43:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great article by @mgoodwin_nypost highlighting the stream of lies fed to the public by the fake news media. Everything from COVID origins to the Russia hoax. I’m adding:\n👇 https://t.co/iGacLsudcG","date":"Tue Jun 15 17:43:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today Democrats blocked consideration of my effort to terminate the COVID-19 national emergency declaration: https://t.co/pQVJzZXL7L","date":"Mon Jun 14 23:35:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"One nation, under God, with liberty and justice for all. #FlagDay 🇺🇸 https://t.co/uS3TFur9Kd","date":"Mon Jun 14 23:20:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s Mineral Monday! This week is was joined by @RepPeteStauber to discuss mining is his great state. Minnesota is the home to the Duluth Complex, an ancient mineral formation that holds 95% of America’s nickel, 80% of America’s cobalt, and just over 1/3 of America’s copper. https://t.co/1Xxps7eJbb","date":"Mon Jun 14 22:37:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/3CCx2QeenP","date":"Sun Jun 13 03:15:23 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Give @IAMTOMMACDONALD’s new song “Snowflakes” a listen. You’re welcome. https://t.co/ktXBPLf6NF","date":"Sun Jun 13 00:21:50 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This June 12 World Day Against Child Labor, we come together to raise awareness of the exploitation of millions of children engaged in child labor &amp; demand action to ensure that children around the world have the opportunity to learn and grow. @USDOL #EndChildLabor2021 #WDACL2021 https://t.co/1jIkwBj0MK","date":"Sat Jun 12 22:29:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"#AmericaLast https://t.co/or8yPXQtbX","date":"Sat Jun 12 18:34:57 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Who else is missing this energy right about now? Time to bring back 45. https://t.co/gu847uwwhy","date":"Sat Jun 12 18:30:14 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Money\nIt's a gas\nGrab that cash with both hands and make a stash\nNew car, caviar, four star daydream\nThink I'll buy me a football team...” https://t.co/tKxvUIuYqg","date":"Sat Jun 12 17:55:09 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Not yours to give. #Theft #AmericaLast","date":"Sat Jun 12 00:02:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"👇","date":"Fri Jun 11 18:22:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"In other words, your conscience is irrelevant. Personal autonomy means nothing. It is no longer your body, it is no longer your choice. When it comes to the vaccine, there is no escape.","date":"Fri Jun 11 17:37:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Exemptions, “will not be granted based on a philosophical, moral, or conscientious objection.”\n\nhttps://t.co/xvDj1vguh0","date":"Fri Jun 11 17:36:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I am proud of my former intern Beni Harmony as she represented the State of Arizona as Miss Cherry Blossom. 🌸 This cultural program with Japan brings a better understanding between our countries. https://t.co/MF58rVYqS1","date":"Fri Jun 11 17:28:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/kn01Duefwe","date":"Thu Jun 10 19:48:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Click here to watch me blast some dynamite 🧨 at the Pinto Valley Copper Mine. https://t.co/vodcQ1LhU7","date":"Thu Jun 10 18:41:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"America is full of patriots who love their country. Don’t let the haters on the left get you down by telling you otherwise. 🇺🇸","date":"Thu Jun 10 17:19:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Listen to her and others like her. They know what they are talking about. https://t.co/4HAOk1THYh","date":"Thu Jun 10 16:14:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Let me be clear, these minerals are VITAL to our way of life. If not mined here, they will still be mined. It will simply be less safe for the environment, less safe for workers and mean less jobs for Americans. It’s time to get serious about this. https://t.co/yy0ISLNkXM","date":"Thu Jun 10 16:02:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Biden has agreed to allow U.S. taxpayer dollars to pay for abortions overseas. #AmericaLast","date":"Thu Jun 10 01:25:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Biden wants to send hundreds of millions of dollars to Hamas.  Since 10/8/97 Hamas has been listed as a Foreign Terrorist Organization by the US State Dept. #AmericaLast","date":"Thu Jun 10 00:55:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The fake news says that Biden is giving away $500 million work of vaccines doses to other countries. The truth is that is tax payer money, not Biden’s money. This is America Last in action.","date":"Thu Jun 10 00:53:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This is out of control.","date":"Thu Jun 10 00:48:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"There is no good answer as to why Harris hasn’t visited the border. If Biden wanted her there, she would be there. The buck stops with him.","date":"Wed Jun 09 18:00:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The DREAM TEAM. 🇺🇸 #AmericaFirst \n@RepAndyBiggsAZ \n@SonnyBorrelli \n@RealMarkFinchem https://t.co/cMCN9KaQ2A","date":"Wed Jun 09 17:57:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Imagine if it were @DonaldJTrumpJr.  https://t.co/Qr4KhMR8ZD","date":"Wed Jun 09 13:40:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Lake Havasu City Lincoln Day Dinner. GREAT PATRIOTS! 🇺🇸 https://t.co/xZbgoNMIBW","date":"Wed Jun 09 12:11:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"So embarrassing.","date":"Wed Jun 09 12:03:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Border towns have had it with the #BidenBorderCrisis https://t.co/lcdAomHB1U","date":"Mon Jun 07 22:05:54 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Lieutenant Colonel Matthew Lohmeier must be reinstated!","date":"Mon Jun 07 21:57:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s Monday so you know that that means! Today’s mineral is cobalt. A recent report by the @IEA noted that by 2040 demand for cobalt will grow roughly 21 x’s. America must work to produce domestic supply of cobalt to allow us to build the technology of the future. #MineralMondays https://t.co/AyFHCBafuM","date":"Mon Jun 07 19:10:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"On this day in 1944, over 150,000 troops from the Allied Expeditionary Force landed on the beaches of Normandy, France &amp; smashed through Hitler’s Atlantic Wall. We’re eternally grateful for the courage and sacrifices made by those men on that day of days.#DDay #GreatestGeneration https://t.co/qGidMJFck8","date":"Sun Jun 06 22:14:09 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great interview by @LRacheldG with @RepChipRoy on CRT.\n\n“The danger is that we destroy the republic because we’re no longer united under the idea of what it is to be an American.\"🔥","date":"Thu Jun 03 14:47:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"👇","date":"Thu Jun 03 14:33:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"SECURE THE BORDER!","date":"Thu Jun 03 14:29:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This hearing should be a non issue. Why must we beg them to do their job? This Committee held multiple hearings during the Trump Administration on the treatment of children at the border. The #BidenBorderCrisis is out of control and this admin needs to AT LEAST hold a hearing.","date":"Wed Jun 02 20:26:09 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I spent Memorial Day honoring our nation’s heroes with the great people of Yavapai County at the historic Prescott Citizen’s Cemetery. \n\nPictured last are the Arizona Rangers, who provided security for the event. All great patriots! 🇺🇸 https://t.co/Kh4u7ChgLc","date":"Wed Jun 02 18:41:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Had a great time yesterday with Los Matadores in Bullhead City. A GREAT group of leaders doing GREAT things in our community. Shout out to Mehdi Azarmi at Fairway Constructors for hosting. https://t.co/DehIe1IsqK","date":"Wed Jun 02 18:08:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We knew massive spending would lead to inflation. How does the Biden admin plan to address? @GOPoversight is demanding answers. https://t.co/MrA2vjg8cH","date":"Wed Jun 02 17:17:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Joe Biden promised a moderate, bi-partisan administration. Since Inauguration Day, he has abandoned both. We’re quickly seeing the results of his disastrous, far-left policies with #BidenFlation already here. Today, I joined my colleagues on @GOPoversight to demand solutions.","date":"Wed Jun 02 17:02:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What’s worse? Fauci’s leaked emails or Hillary’s deleted ones?","date":"Wed Jun 02 13:41:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What possible justification could there be for removing these basic questions? https://t.co/rVqOb5DxKL via @washtimes","date":"Tue Jun 01 21:01:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"A life cut far too short. Thank you for your service to your community, Officer New. Praying for your family at this difficult time.","date":"Tue Jun 01 20:49:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"If it turns out that the Covid pandemic was caused by a lab leak in Wuhan, China, it will rank among the greatest scientific scandals in history. Is the bigger scandal the long refusal by too many media gatekeepers to take the lab-leak theory seriously?  https://t.co/yioqYJRTc1","date":"Tue Jun 01 20:41:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Monday! Here is Part II of the introduction to our new video series, Mineral Mondays. Our first mineral discussion kicks off next Monday. First on deck - Cobalt. #MineralMondays https://t.co/GPaAEZZeeR","date":"Mon May 31 23:14:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This is the land of the free because of the brave. This weekend we honor those and their families who have made the ultimate sacrifice defending our freedoms and way of life. God bless our brave heroes and God bless the U.S.A. https://t.co/Y4eApuucWZ","date":"Mon May 31 19:59:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Take a cruise with me through our beautiful state.  This is in Superior, AZ. #PaulGoCar https://t.co/yMPnZ7FYHH","date":"Sun May 30 22:58:03 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Did you know solar panels, wind turbines &amp; electric vehicles ALL require critical minerals from mining? \n\nIf not mined here, these minerals are often obtained using slave labor w/ terrible environmental standards in other parts of the world. \n\nIt’s time to mine again in the U.S. https://t.co/4AK4Xaz6aI","date":"Sun May 30 22:49:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This weekend I hosted a round table discussion w/ mining industry representatives &amp; local leaders to discuss the future of mining in AZ. These minerals are vital to our way of life. We have the highest safety &amp; environmental standards in the world. Let’s mine. ⛏ https://t.co/zcyq6WY4bl","date":"Sun May 30 22:45:54 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Paper Scissors Rock https://t.co/apPZD7CPSM","date":"Sun May 30 20:08:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"ROCK 🪨 ON! Great tour of the Pinto Valley Copper Mine Today! #Copper #MineralMondays https://t.co/410xiYZwBo","date":"Sat May 29 00:29:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"People were deplatformed for merely suggesting that Wuhan Lab theory might be worth looking into. Accused of spreading “misinformation.” Now evidence is mounting that this is exactly what happened. If true, big tech &amp; media conspired in one of the biggest cover ups of all time.","date":"Fri May 28 19:46:18 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great tour of an amazing project at the \"eye of Casa Grande\" Cactus mine. Thanks @ElimMining for a great day. https://t.co/DRKdZ8wkWa","date":"Fri May 28 17:41:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Border agents have had interactions from 160 countries in recent months. That is over 80%  (160/195 countries) of the world's citizens flooding to the U.S. \nhttps://t.co/4dHPpTSEUf","date":"Thu May 27 19:32:48 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This week I was honored to provide a Congressional update to the Yavapai County Veterans Association. Amazing group of patriots! 🇺🇸 https://t.co/1g8PKK5Zmu","date":"Thu May 27 17:50:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This week I had the opportunity to present a law enforcement recognition certificate to Officer Steve Jones of the Chino Valley Police Department. #BackTheBlue https://t.co/vX9hznUExq","date":"Thu May 27 17:36:22 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"American colleges and universities are places for learning and debate, absent of foreign influence and espionage. \n\nRead more about my efforts to protect students, institutions of higher education, and our national security.\n👇https://t.co/kebIVZvsGb via @aztodaynews.","date":"Thu May 27 02:17:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Proud to support Repaying the Rural Borderlands Act led by @RepHerrell to reimburse ranchers, farmers, homeowners, small businesses, property owners, and local government for the cost, damage, and harm caused by illegal aliens and the #BidenBorderCrisis. https://t.co/GBeSIIAHvR","date":"Wed May 26 20:51:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Covid is a crisis on paper. Meanwhile, the government is exporting vaccines, repealing mask mandates, and reopening states. These policies don’t align and Congress must act to determine the merit of living in a state of emergency.","date":"Wed May 26 18:06:57 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“We need not simp for any nation other than America” -Thomas Jefferson, I think https://t.co/cS6m8JTaHs","date":"Wed May 26 16:28:58 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Patriots who love our country are being purged from government and our armed forces. Biden and Bishop Garrison are prioritizing bigotry and anti-white hatred over national security. It’s unacceptable and my constituents demand accountability. https://t.co/zvtPUe1w9f","date":"Wed May 26 14:50:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Old Glory is the only flag that should be flown at U.S. Embassies, not LGBT or BLM flags. Proud to join @RepJeffDuncan to protect the flying of American flags abroad. https://t.co/eEEL0nQ3dP","date":"Tue May 25 22:07:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Proud to sponsor Making Excellence Replace Identity Traits (MERIT) Act to ensure that no federal funds are provided for affirmative action hiring. \n\nThe people deserve competency and merit, not racial or other bigotry, when the government hires people.\n https://t.co/x7pXK1XdHw","date":"Tue May 25 11:52:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Thank you @RepJeffDuncan.","date":"Mon May 24 21:02:48 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I am thrilled to introduce to you my new video series, called “Mineral Monday’s.” \n\nIn this series, you’ll be hearing from me and some of your favorite members of Congress every Monday, about a different critical mineral and why that mineral is vital to our way of life. Enjoy! https://t.co/xHEQVtTRro","date":"Mon May 24 19:10:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"America First. America Always. 🇺🇸\n\n@RepMattGaetz \n@RepMTG \n@RepAndyBiggsAZ https://t.co/pV8ORVKGiZ","date":"Sun May 23 23:02:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Please meet George Jaeger, a Korean Veteran, patriot and constituent of mine. Our office was able to assist him with home appraisal and disability rating with the VA. It was great to personally meet George! 🇺🇸 https://t.co/uMjI12Kqfj","date":"Sun May 23 00:21:57 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"But mean tweets are at an all time low and that is truly what matters.","date":"Fri May 21 23:03:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"This week I offered an amendment, again asking for the release of all Capitol security footage on and before January 6.\n\nNo more propaganda and lies. Show America the full videos. \n\nWhy do Democrats oppose the truth?","date":"Fri May 21 15:46:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"With cases falling, immunization rising, and states reopening, it’s necessary for Congress to consider the merit of the emergency continuation.\n\nMy resolution requires that Congress debate and terminate the emergency declaration, as required by law. https://t.co/ZqLfAZpxYK","date":"Fri May 21 13:37:21 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"In the middle of his unprecedented border crisis, the Biden Admin’s deportation numbers are at a record low. Pretty shocking but not surprising. https://t.co/6KMc8bJsm8","date":"Thu May 20 18:35:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The Biden administration is step-by-step abolishing ICE…","date":"Thu May 20 18:32:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"#BASED. \n\nAlso, who is proofing these letters?🧐 “Masssie”\n\n@RepThomasMassie","date":"Wed May 19 20:08:57 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"STOP ABORTING CHILDREN.","date":"Wed May 19 16:08:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"STOP PUTTING MASKS ON CHILDREN.","date":"Wed May 19 13:41:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Honchos at the Post Office run the Internet Covert Operations Program (ICOP) while they are in massive debt and derelict in their delivery duties. \n\nProud to work with @RepMattGaetz and @RepMTG to stop the spying, and streamline @USPS","date":"Tue May 18 20:38:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I promise my constituents and the American people that I will pursue the truth. You can join me in calling for the release of the security video. I’m happily married and do not support your proposal to date or defund the police. \n\nSo can I add you as a cosponsor of my amendment?","date":"Tue May 18 19:10:14 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Must read by @SteveScalise and @GroverNorquist stressing the need for Congress to reject a costly, job-killing carbon tax that would devastate American families and small businesses and guarantee the collapse of America's energy dominance. @GOPConference \nhttps://t.co/wFsG4r7xKJ","date":"Tue May 18 18:48:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The DOJ should be assisting the Arizona audit to make sure voters were not illegally disenfranchised instead of attempting to obstruct justice. https://t.co/rURZnDJULE","date":"Tue May 18 17:49:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Because we live here.","date":"Tue May 18 02:10:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Every man a King. Every woman a Queen.\n\nThis is America.","date":"Tue May 18 01:55:17 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"A monarchy is bonkers, innit?\n\nChrist is King.","date":"Tue May 18 01:40:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Insurrection” https://t.co/uO2fixy0uZ","date":"Tue May 18 01:24:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"A woman, a veteran, was killed in the U.S. Capitol and her family and country deserve answers. Say her name. #AshliBabbitt","date":"Tue May 18 01:17:23 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s called we put America First","date":"Tue May 18 00:47:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/qXXNrcN5Nn","date":"Mon May 17 23:54:50 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great Presidents. https://t.co/FBprn1jMoy","date":"Mon May 17 23:37:58 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“Americanism, not globalism.” \n- President Trump","date":"Mon May 17 23:24:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The @JoeBiden admin is diverting $billions meant for COVID relief and sending it the southern border in an attempt to stem the bleeding of his self-inflicted crisis. If this is not acknowledgment of a crisis, I don’t know what is. \n\n https://t.co/UIvmRPlSKr via @politico","date":"Mon May 17 16:54:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What do we have to lose?","date":"Mon May 17 15:07:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Keeping America Great, one bill at a time. 🇺🇸 https://t.co/fBkli8By24","date":"Fri May 14 15:49:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"\"Some U.S. border patrol agents are so frustrated with President Joe Biden’s more liberal border policies that they are considering early retirement, while other disgruntled colleagues are buying unofficial coins that say ‘U.S. Welcome Patrol.\"\nhttps://t.co/LkUs9o4Lbr","date":"Fri May 14 14:58:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Men must be governed by God or they will be ruled by tyrants.","date":"Fri May 14 01:57:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Americans are dreamers. \n\nNot the other way around. \n\nNo amnesty.","date":"Thu May 13 15:32:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/t4GkCUxtuv","date":"Wed May 12 19:13:14 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"As usual there’s a lot of fretting in The Swamp and media about personalities. The truth is that forever wars are really not conservative.","date":"Wed May 12 19:08:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Lawful political speech and activism must be tolerated in a purportedly free society. I oppose the Biden regime’s efforts to represses political dissent and human rights in the United States.","date":"Wed May 12 19:07:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@CNN just cut the feed of our @GOPoversight committee hearing regarding Jan. 6 calling it “unproductive and a waste a time.”\n\nI call that a win. \n\nThanks @RepJamesComer for sending. https://t.co/MEMVyHSLoL","date":"Wed May 12 16:11:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Israel, like all sovereigns, has a right to self defense and the freedom to choose the time, manner and method of protecting its people, culture and borders.","date":"Wed May 12 02:19:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Israel burning. \n\nChina rising. \n\n@JoeBiden 🦗","date":"Tue May 11 19:37:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I joined my colleagues on @GOPoversight in a letter to the @CDCgov demanding to know why unelected teachers unions are potentially influencing decisions as to when our children go back to school. https://t.co/SHBfyqwIPs via @dailycaller","date":"Tue May 11 19:25:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"What’s been washed more this year?","date":"Tue May 11 14:42:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@GerAmGroyp Vrooooooom!","date":"Tue May 11 14:13:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"GOOD MORNING! https://t.co/Gqe6tjQQjn","date":"Tue May 11 13:11:14 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Do masks work this week? Asking for a friend.","date":"Mon May 10 15:01:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Biden and the Federal Reserve are destroying what is left of our currency and Democrats have Maxine Waters in charge of @FSCDems. It’s not surprising that #Doge is gaining more trust than the dollar.","date":"Mon May 10 14:26:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"MAKE AMERICA GREAT AGAIN!","date":"Mon May 10 13:52:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Mother's Day to all the wonderful Mother's out there. None of us would be here if it weren't for you and we truly appreciate all you do! https://t.co/ica0IT7AGP","date":"Sun May 09 21:38:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Proud to be a cosponsor of this important legislation. Thank you to my colleague from Colorado @RepBoebert for letting this effort.","date":"Fri May 07 20:25:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"As a fierce opponent of illegal immigration, I too am glad to see the city of Phoenix honor Cesar Chavez. I actually requested the U.S. Mint produce a commemorative coin. Thank you @MayorGallego for bringing attention to such a strong ally in our cause. https://t.co/1fqKs4qrUD","date":"Fri May 07 01:19:02 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"As a member of @NatResources protecting our environment is very important to me. Our southern border has been inundated by garbage left behind from illegal aliens pouring over our border. Last week my team and I went down to clean it up. Enjoy a few highlights from our trip below https://t.co/wJ3gA9YK9k","date":"Thu May 06 20:56:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Yet instead Dems are advancing bills that work to shut down domestic energy, kill jobs for miners and steelworkers in Arizona, and fail to focus on the real issues facing our role in the global energy and mineral future.","date":"Thu May 06 15:24:31 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"If the @NRDems were actually concerned with how our nation’s energy future will develop, we should be focusing on real solutions.  We should be fighting to stop slave labor in China from fueling our solar industry and stop child labor in Congo from fueling our battery systems.","date":"Thu May 06 15:23:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"While the Dems are focusing on making job creation and energy security harder for America, in the real-world global energy leaders are calling on nations to defend themselves by advancing more mineral production and processing. https://t.co/dZ6oPEoLNQ","date":"Thu May 06 15:22:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We completed our second day of Markup @NatResources yesterday  where the @NRDems kept up the agenda of voting to shut down American jobs and domestic energy and mining.","date":"Thu May 06 15:21:51 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The left is triggered that @caitlyn_jenner knows people are moving to Arizona because of the rampant crime/homelessness created in California by leftists. Real Americans are welcome in Arizona and real refugees are fleeing socialism.","date":"Thu May 06 14:40:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Yep. And 105 days since #OpenBorderJoe has refused to go to the border. We’re keep track on https://t.co/9f4QErzehO. \n\nAs of 9:59 A.M. EST this morning. https://t.co/xcTzMx68mG","date":"Thu May 06 14:11:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Well well well... no surprises here. #openborderjoe\nhttps://t.co/CHDuDWPZDD","date":"Wed May 05 23:37:24 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s time to investigate potential fraud in the census numbers. ⁦⁦@Rasmussen_Poll⁩ ⁦@GOPoversight⁩  https://t.co/3s0UTSjztW","date":"Wed May 05 21:56:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Tuesday morning at Prescott Valley Police Department, I presented Officer Cameron Loughmiller with a Law Enforcement Appreciation Certificate. \nOfficer Loughmiller earned the award of Officer of the year for 2020 with the @PolicePV. Thank you for your service sir! 🇺🇸 #BackTheBlue https://t.co/NGovO99GdV","date":"Wed May 05 18:34:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Pleased to see the Mohave County Board of Supervisors has unanimously voted to support the Downwinders Parity Act of 2021. This bill extends funding to communities harmed by years of nuclear testing during the early Cold War &amp; is a signature issue of mine. https://t.co/FNLPrziQ39","date":"Wed May 05 18:30:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"These numbers are staggering.","date":"Wed May 05 15:05:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"After alarming reports about Secretary Kerry potentially leaking highly sensitive information about Israel, a U.S. ally, to Iran, a state sponsor of terror and enemy of the United States, I joined my colleagues on @GOPoversight in asking the WH to review his security clearance.","date":"Tue May 04 19:50:21 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"There needs to be a forensic audit these #CCP linked firms who received PPP money meant for American taxpayers. https://t.co/UH3XdNx1z0 via @news_ntd","date":"Tue May 04 18:35:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We have a crisis at our southern border and Democrats are focused on trying to pass amnesty using dirty back door political tricks. https://t.co/7dGX0sm4UI","date":"Tue May 04 16:47:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Visit https://t.co/Giz1E9V2Uh to see a daily tracker of the number of days @JoeBiden continues to ignore our southern border. #BidenBorderCrisis https://t.co/6hHKtCVw0e","date":"Tue May 04 16:28:26 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"For all you Star Wars fans out there. #MayThe4thBeWithYou https://t.co/kF82d61QVr","date":"Tue May 04 13:00:29 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Correct. This is child abuse.","date":"Mon May 03 17:28:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"She clearly tackled the border issue with ease. Why not assign her outer space?\n\nBeam her up: Harris to chair the National Space Council  https://t.co/4ixwXlvxkr via @politico","date":"Mon May 03 13:47:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Because there IS no good explanation. \n\n“Postal Service 'wildly unprepared' to answer allegations it spied on Americans”\n\nhttps://t.co/FiOmChmgNI","date":"Fri Apr 30 18:57:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I’m cosponsoring HR 2890, a GREAT bill by @RepThomasMassie that repeals a law that currently prevents adults under 21 from buying a handgun. If an 18-year-old can vote, join the military, and take on student debt, they should be able to protect themselves. https://t.co/k4H1DsQtBd","date":"Fri Apr 30 18:41:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Arbor Day! Proud cosponsor of @RepWesterman’s #TrillionTreesAct @NatResources","date":"Fri Apr 30 18:33:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great to hear this update from @DanCrenshawTX. Glad you’re doing well and back in the fight. Praying for your full and swift recovery.","date":"Fri Apr 30 18:31:58 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Worthy read by @MarkPaoletta. People are tired of journalists who exist simply to carry water for team Biden. \n\nAlso, I will be following the Biden  @OMBPress’ decision regarding funding for the border wall very closely. @USGAO \nhttps://t.co/taYZULDc4q","date":"Fri Apr 30 18:27:38 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The @USPS has NO business spying on Americans. Proud to co-sponsor this important legislation. Thank you to my colleague from Florida @RepMattGaetz for leading this effort.","date":"Fri Apr 30 15:28:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Still NO mention of the border...","date":"Thu Apr 29 01:52:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@JoeBiden says millionaires and billionaires need to “pay their fair share.” \n\nWhat about you, “Big Guy?”","date":"Thu Apr 29 01:44:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@JoeBiden wants to raise minimum wage to $15/hr. \n\nhttps://t.co/iVR4TmIKRM","date":"Thu Apr 29 01:32:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"24 min in and still no mention of the border... What’s the over under? Will he?","date":"Thu Apr 29 01:23:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Oh boy... here we go...","date":"Thu Apr 29 01:07:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@JoeBiden’s biggest accomplishment in his first 100 days has been the vaccine rollout - and that’s thanks to President Trump.","date":"Wed Apr 28 22:53:22 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Republicans on @NatResources  are trying to save American mining jobs. Democrats on @NRDems are trying to destroy them. #HR1884","date":"Wed Apr 28 17:43:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I sent a letter to @POTUS with other members of the @NatResources calling on the #Biden Administration to stop selling American mining jobs to foreign nations.\n https://t.co/TgTtBVtLqR","date":"Wed Apr 28 17:39:33 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Taiwan established itself on the global stage during the COVID-19 pandemic as an example for the rest of the world to follow and deserves to be included in the upcoming World Health Assembly. #LetTaiwanHelp @MOFA_Taiwan #Taiwan @WHO https://t.co/1ljXYdaIy9","date":"Tue Apr 27 14:52:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s time. https://t.co/9LcrTopP36","date":"Mon Apr 26 19:50:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We can’t have two standards of justice. Everyone must be treated equally under the law, regardless of their last name. @RepBobGood","date":"Mon Apr 26 19:45:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“I am more fair and balanced than local media.” I'm putting that on my vaccination passport.","date":"Sat Apr 24 18:32:58 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"FINISH THE WALL! https://t.co/TWYnxpaqL5","date":"Sat Apr 24 17:33:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s hard to believe that infanticide is not already illegal in this country, especially when more than 90% of Americans DO NOT support abortion in the last 3 months of pregnancy. I’m a proud supporter of the Born-Alive Survivors Protection Act. #EndInfanticide @SFLaction https://t.co/iewVglz5Gl","date":"Sat Apr 24 15:54:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Some really fantastic photos where you can actually see this morning’s Crew-2: Crew Dragon launch out of Florida from Capitol Hill. @NASA @SpaceX https://t.co/IoTlyBUsTd","date":"Fri Apr 23 14:43:47 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The astronauts launching out of NASA’s Kennedy Space Center had a very successful launch this morning! Here’s the video of the launch. 🚀\n\nWatch NASA's SpaceX Crew-2 Launch to the International Space Station https://t.co/BFrZoGgUMD via @YouTube","date":"Fri Apr 23 14:41:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"My Republican colleagues on the @GOPoversight committee and I sent a letter to the Postal Service to request an immediate briefing as to why our @USPS is running a covert operations program to spy on Americans’ social media use.","date":"Fri Apr 23 13:09:57 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today we take time to honor Pat Tillman, a great American who gave all for the country he loved. If you don’t know Pat’s heroic story, I’d encourage you to read it here: https://t.co/VGNrXgUBxy #HERO #PatTillman https://t.co/YbozcSd7TC","date":"Thu Apr 22 21:23:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Earth Day 2021. Conservation plays a major role in reducing emissions. I am proud to cosponsor the Trillion Trees Act because it provides actionable solutions to achieve cleaner air, reduce wildfires, and reverse the effects of deforestation. @NatResources https://t.co/AjDbflMmCl","date":"Thu Apr 22 20:12:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Were the FBI and NSA not incompetent enough?","date":"Thu Apr 22 18:18:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The Postal Service is surveilling Americans’ social media. \n\nUnder what authority?  \n\nI will be demanding answers.\n@GOPoversight @OversightDems \nhttps://t.co/976qnobnsU","date":"Thu Apr 22 15:27:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The same mainstream media outlets that lecture us about foreign collusion and disinformation are taking free trips from the Chinese Communist Party in exchange for “favorable coverage.”\n\n@NatalieGWinters drops their names in her latest scoop:\n https://t.co/BwBJnJvYd6","date":"Thu Apr 22 01:06:55 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It doesn’t get swampier than this. We need answers. @GOPoversight","date":"Wed Apr 21 21:36:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Gulf War Illness affects about 30% of the 700,000 people who served in the 1991 Persian Gulf War. I will always fight for the thousands of Gulf War veterans who served our country with honor and courage.","date":"Wed Apr 21 20:31:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The @joebiden Administration offers grants to teach children '1619 Project.'\nhttps://t.co/gsahF1NECJ","date":"Wed Apr 21 20:17:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"CRITICAL MINERALS ARE CRITICALLY IMPORTANT","date":"Wed Apr 21 20:05:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"FIRE = Already a bottleneck crisis at southern border. \n\nGASOLINE = Democrats: Let’s immediately guarantee a lawyer to individuals pulled out of the customs and border patrol line for a second screening. \n\nThis is what H.R.1573 Access to Counsel Act does. #BidenBorderCrisis","date":"Wed Apr 21 20:01:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"“This is not a Democratic or Republican problem. It’s an American problem,” said Sinema. \n\nThank you @SenatorSinema","date":"Wed Apr 21 18:23:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@SecPompeo and I used to sit next to each other on the House Floor. Was pleased to join him and @RepublicanStudy in co-sponsoring a bill that would impose highest EVER amount of sanctions on #Iran. It was great to catch up with my friend and former colleague. https://t.co/t5VOx0W9E3","date":"Wed Apr 21 17:09:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Love working on your behalf! https://t.co/51zvmzilva","date":"Wed Apr 21 15:57:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"People underestimate the role that critical minerals play in our everyday lives. All of these minerals the United States has in abundance. Let’s take control of our supply chain and prepare ourselves for the future. @NatResources","date":"Wed Apr 21 13:53:40 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"SMH https://t.co/90DfD40h3D","date":"Tue Apr 20 20:15:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"For real though. #BidenBorderCrisis https://t.co/1Lxr2ZHcd2","date":"Tue Apr 20 19:12:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Is this acceptable to you? https://t.co/sa8by7FsZB","date":"Mon Apr 19 23:36:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"FINISH THE WALL! @GOPoversight","date":"Mon Apr 19 23:30:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The #TrillionTreesAct is a bipartisan legislation that will make our forests healthier, stronger, and more resilient. Proud to cosponsor. @NatResources https://t.co/MV7fGjnlOM","date":"Mon Apr 19 23:10:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Raynard Jackson: The twisted tale of the America First Caucus and the leftist media https://t.co/T8g3QyGTkE via @Arizona Today News","date":"Mon Apr 19 21:48:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Once again @RealRaynardJ speaks truth to the leftists.   \nhttps://t.co/EF4yFj8RlC","date":"Mon Apr 19 16:52:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The nominee for @DeptofDefense policy said sending troops to the border would be a “dangerous precedent.”\n \nFact: Having troops at the border helped keep American families safe.\n \nColin Kahl’s judgment is flawed. The Senate must reject this nomination.\nhttps://t.co/nVDlBLNGd7","date":"Mon Apr 19 16:04:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@POTUS’s nominee for under secretary of defense policy shows he’s not taking the border crisis seriously at all. Colin Kahl has called security problems at the border a “fake crisis.”\nhttps://t.co/2fHPDovSt2","date":"Sun Apr 18 16:21:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/GfyI39tPg8","date":"Sat Apr 17 20:03:19 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Accurate article by @ronaldjhansen regarding false claims by @RepJayapal","date":"Sat Apr 17 01:56:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Proud to co-sponsor the SOS for Seedlings Act. I thank my colleague from Oregon @RepBentz for leading this effort.","date":"Fri Apr 16 17:05:45 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Imagine if President Trump had used EPA Staff to secure the border. \nI mean just imagine, but yet here we are. @EPA clearly has too many staff since @EPAMichaelRegan thinks they can just spend time on the #bidenbordercrisis. https://t.co/gZ72JN6FuY","date":"Thu Apr 15 21:00:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"#SAVESCOTUS https://t.co/DKnmK7WEbQ","date":"Thu Apr 15 18:45:25 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@SBAList @SteveScalise @Kat_Cammack @RepAnnWagner Proud to sign my name and defend life!","date":"Wed Apr 14 20:40:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The US is worried about its critical minerals supply chains – essential for electric vehicles, wind power and the nation’s defense. https://t.co/PQFKHvAX0b","date":"Wed Apr 14 18:01:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I stand in strong support of the discharge petition for H.R. 619, the Born Alive Abortion Survivors Protection Act. It’s time to #EndInfanticide.","date":"Wed Apr 14 16:41:35 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I will sign onto the discharge petition to send the “Born Alive Abortion Survivors Act” directly to the Floor for a vote. #EndInfanticide \n\nShould babies who are born alive through a botched abortion be provided medical care so that they can survive?","date":"Wed Apr 14 15:49:59 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"It’s Back! Say Goodbye to Suburban Housing; Say Hello to Multistory Public Housing! https://t.co/4e5PEdNvmm","date":"Wed Apr 14 14:15:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Correct. That’s what #AmericaFirst looks like. Citizens have rights. Illegal aliens do not.","date":"Wed Apr 14 14:02:06 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"9% of the Democrats’ $1.9T COVID-19 relief bill went toward COVID-19. \n\n6% of the Democrats’ proposed $2.3T infrastructure bill goes toward infrastructure.  \n\nThis is a bad trend.","date":"Tue Apr 13 20:56:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"FINISH THE WALL!","date":"Tue Apr 13 20:42:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Check out these polls on immigration that ⁦@Heritage_Action⁩ just released. Spells big trouble for Dems in 2022. #BidenBorderCrisis  https://t.co/NsH3n1Uh6N","date":"Tue Apr 13 20:24:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Exclusive: Most blame Biden for border crisis, spells 2022 doom for Democrats.\n\nAmericans from both parties are rejecting @JoeBiden’s open-border, America-last policies. @Heritage_Action #BidenBorderCrisis https://t.co/ty4HpWn8nQ","date":"Tue Apr 13 20:21:26 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Proud cosponsor of the “No Taxpayer Funding for Vaccine Passports Act.” No American should be subject to the question “Where are your papers?” I thank my friend from Montana for leading this effort. @RepRosendale","date":"Tue Apr 13 18:44:23 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Looking forward to seeing everyone’s submissions! For more information, click here: https://t.co/4pa5fXoB5c https://t.co/mwvPh6IGu8","date":"Tue Apr 13 17:03:33 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"These unused border materials are not only an ineffecient and purposeless waste of taxpayer dollars, but are directly contributing to an avoidable border crisis which @SecMayorkas recently disclosed as the worst the situation has been in 20 years. https://t.co/G3VjkiWC07","date":"Tue Apr 13 16:40:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"A desperate plea from the @JoeBiden Admin to various Federal agencies. \n\nEmail reads: “Will you consider taking a four-month paid leave from your job to help care for migrant children.”  \n\nBut there is no crisis. 🥴https://t.co/tzHuYzosOX","date":"Mon Apr 12 21:11:52 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Taxpayers paying for resorts and hotels for illegal aliens. Please go to work today. Illegal aliens need your tax money. \n\n“U.S. Immigration and Customs Enforcement confirmed it will use hotels in cities, including Phoenix and Chandler, to house migrants.”\nhttps://t.co/MHiFeG9HhR","date":"Mon Apr 12 18:37:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"A clear case of @CNN literally making up a “news” story and refusing to retract and apologize.\n\n#cnnisfakenews \n\nEVIDENCE: How CNN Faked a Story about Matt Gaetz, Got Caught, But Still Won't Remove It. https://t.co/Kvp43RzlBK","date":"Mon Apr 12 13:57:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"One of the most fulfilling parts of my job is having the honor of presenting Congressional certificates to our nation's heroes upon successful completion of their treatment program at our Veteran Courts. You’re nation is PROUD OF YOU! https://t.co/V9uSsqkQoC","date":"Sat Apr 10 20:02:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great to have these in-person gatherings again. Provided a Congressional update to great patriots from Lake Havasu yesterday. Great discussion on tax increases, criminal border activity, gun rights, lack of Rule of Law, and how they help. THANK YOU! https://t.co/itPJ4v6IYc","date":"Sat Apr 10 19:39:23 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Praying for a full and swift recovery for @DanCrenshawTX whom I have no doubt is facing this challenge with strength and courage.","date":"Sat Apr 10 17:02:17 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@Govdesantis  asked for a true #BigTech reform bill in Florida. This article shows he may not get it if things don't change. Let’s get it together @blaisegonewild and do real reform. https://t.co/AAmCnvkEyn","date":"Fri Apr 09 23:22:30 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"State of the Union?","date":"Fri Apr 09 19:49:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The right of the people to keep and bear Arms, shall not be infringed. https://t.co/O732qsMQqb","date":"Fri Apr 09 18:36:08 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Start calling your Senators folks. This guy is lethal to our second amendment. https://t.co/Cyj7O9x6TV","date":"Thu Apr 08 23:13:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The first step in fixing our border crisis is for the Biden Harris Administration to admit that there is one. @POTUS @VP #BidenBorderCrisis https://t.co/XUpLHlDs8n","date":"Thu Apr 08 22:27:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We are at a 15 year high in illegal border crossings. We are on pace to hit 2 million apprehensions this year. We have a crisis at our border and an Administration who refuses to admit that. #BidenBorderCrisis https://t.co/6aQQVlaqjA","date":"Thu Apr 08 21:52:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Interesting read here.","date":"Thu Apr 08 19:36:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"PROTECT THE 2nd AMENDMENT!","date":"Thu Apr 08 18:33:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Border Walls are infrastructure. #infrastructure #realinfrastructure https://t.co/UjmiB154R5","date":"Thu Apr 08 15:13:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The head of domestic security for our nation is now “considering” security at our southern border. How many Yemeni terrorists are acceptable?  How many abandoned children by traffickers? #FINISHTHEWALL \nhttps://t.co/wjebBKAF6S","date":"Wed Apr 07 15:30:21 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"#BIDENBORDERCRISIS","date":"Wed Apr 07 14:37:23 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"GOOD MORNING!","date":"Wed Apr 07 13:23:21 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Pleased to announce that Mohave County will receive critical funding from @USDOT to reconstruct the access road to Laughlin Bullhead International Airport. https://t.co/1cpwy7LiPg","date":"Wed Apr 07 02:10:28 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Pleased to announce that the Colorado River Indian Tribe will receive critical funding from @Interior to address substantial water seepage along a section of the canal of the Colorado River Irrigation Project. https://t.co/TKvYRLnT7Q","date":"Wed Apr 07 01:51:54 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Hey @RobManfred, want a mulligan on your All Star Game decision? \n\nMoving your game from a city of 50% minority population to a city of 10% minority population with an estimated $100M loss because the @MLB supports racial equity?🥴\n\nAnd oh yeah, about that #Augusta membership?🦗","date":"Tue Apr 06 16:14:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Kudos to @marcorubio for calling out the blatant hypocrisy of @MLB commissioner Rob Manfred. Asks if he'll give up Augusta golf club membership.  https://t.co/1JLYzKgLpB","date":"Tue Apr 06 15:32:53 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"For years, foreign governments who do not share American values of freedom, tolerance and open discourse, have essentially bribed major universities with rich programs that often undermine our own government and culture. It's time to stop. https://t.co/O37voBlNlT","date":"Mon Apr 05 15:39:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"He is risen! Happy Easter! https://t.co/LRJVWXw40o","date":"Sun Apr 04 14:09:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"We call him Lord and declare that all kings and kingdoms will one day bow before Christ on his throne. https://t.co/IGa6r6oNu1","date":"Sat Apr 03 19:25:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Put me in coach. Time to end the @MLB’s antitrust exemption. @RepJeffDuncan","date":"Sat Apr 03 17:41:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Very sad day. Praying for the fallen Capitol police officer’s family and the injured police officer. Thank you to our law enforcement for all you do every day to keep us safe.","date":"Fri Apr 02 19:23:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"https://t.co/AfUvxJlXMo","date":"Fri Apr 02 18:59:15 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"I have cosponsored HR 1883 which halts all immigration for the next 4 years, funds completion of the border wall, speeds deportation of illegal aliens, cuts off funding for sanctuary cities and rescinds damaging executive orders and amnesty programs. https://t.co/UYUBaf9dAg","date":"Fri Apr 02 18:09:56 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great article about Big Tech engaging in Big Prostitution across state lines. \n\nTHOT PATROL: Rep. Gosar Calls Paywall Porn Site OnlyFans Out, Citing Mann Act https://t.co/ZuaSnsHc4O","date":"Fri Apr 02 15:01:34 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Confucius Institutes at U.S. colleges and universities are spewing CCP propaganda. Today I introduced the Higher Education Transparency Act which mandates oversight and transparency over Confucius Institutes and foreign influence programs: https://t.co/ukHhw2goD0","date":"Fri Apr 02 00:01:26 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Proud to be an original cosponsor of this important America First effort led by @repMoBrooks","date":"Thu Apr 01 22:02:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today I’m writing the U.S. Attorney General requesting an investigation into @OnlyFans for promoting, and profiting from, online prostitution. I encourage @TheJusticeDept to vigorously protect vulnerable people from platforms that promote coercive immoral and sexual activity.\n\n👇 https://t.co/byb03hG3ya","date":"Thu Apr 01 19:47:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Most popular President in the history of the world.","date":"Thu Apr 01 19:14:36 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"He was right.","date":"Wed Mar 31 23:32:00 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Birthday #CesarChavez! A devoted opponent of illegal immigration, Chavez saw firsthand how the influx of illegal immigration over our southern border deprived honest, hardworking American farmworkers of the power to bargain for a decent wage and provide for their families. https://t.co/XnvkR9HOV8","date":"Wed Mar 31 21:03:17 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Click below to listen in on a great podcast with Rebecca Weber of @matureamericans and hear me discuss the #BidenBorderCrisis, my recent invitation to @POTUS to tour the Yuma border, H.R. 1, Veterans, the pork-filled #Covid_19 relief bill and more.\nhttps://t.co/5tpD7Cg0pn","date":"Wed Mar 31 20:44:32 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great job #Yuma Sector Border Patrol. Keeping our communities safe! @CBP","date":"Wed Mar 31 12:48:54 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy National Doctors Day! @GOPDoctors https://t.co/BTXxBOqvmf","date":"Tue Mar 30 20:32:13 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"So touching to see such respect for our flag. Thank you to this patriot!","date":"Tue Mar 30 19:09:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The @WHO continues its collusion with the Chinese Communist Party. This report about the origins of COVID-19 is little more than #CCP Propaganda. No one is buying it. @GOPoversight  https://t.co/mUvdVM4LHk","date":"Tue Mar 30 18:20:37 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Gosar Poll: Should the Federal Government mandate vaccine passports to prove vaccination in order to work, travel, vote or recreate or engage in commerce?","date":"Tue Mar 30 17:37:07 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Hey citizens! Get back to work. The Democrats are giving $4.3 billion of your tax dollars to illegal aliens. You need to work so they don’t have to. #clownworld #immoral \nhttps://t.co/Zk8hJ0oIwt","date":"Tue Mar 30 15:38:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The war in Afghanistan has cost more than 2 thousand American lives and $2 trillion American dollars. \n\nCostly litigation is a terrible excuse for perpetual war and nation building abroad. Let’s secure our border instead.","date":"Tue Mar 30 01:13:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"On this Vietnam War Veterans Day, I was humbled to join Lake Havasu City Mayor Cal Sheehy for a special ceremony honoring Vietnam Veterans from Mohave County where I presented Certificates of Patriotism to these brave heroes. Thank you for your service! https://t.co/dmPCikQ4Ce","date":"Tue Mar 30 00:11:41 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"NTIA put the 1993 Report on its website but has failed to make the updated 2021 Report available.\n\nWhat is the Deep State hiding? My constituents deserve to know the facts regarding the prevalence of internet inspired hate crimes. @BreitbartNews","date":"Mon Mar 29 23:10:39 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Recent findings may undermine common narratives touting a relation between internet free speech &amp; hate crimes, but nothing is more valuable than the truth as demonstrated by evidence.\n\nI’m calling on the NTIA to provide citizen access to the updated report https://t.co/5R8aYICOLH","date":"Mon Mar 29 23:09:42 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".⁦@elviadiaz1⁩ says in her recent article that my claims about the border being wide open are “a lie.” \n\nHad Ms. Diaz gone to the border &amp; spoken to ⁦@CBP⁩ like I have, she would know that’s not true.\n\nOh that’s right, she can’t. Access Denied. https://t.co/CGTNDkqll6","date":"Mon Mar 29 22:56:21 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"🚨Claim by @JoeBiden: “We’re sending back the vast majority of the families that are coming.”\n\nTruth: Only 13% are. The “overwhelming majority” are allowed to stay in the U.S.\n\nGosar Fact Check Results: Biden gets 10 Pinocchio’s, pants on fire. 🤥\n\nhttps://t.co/RIpisOD92C","date":"Mon Mar 29 22:04:16 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Vaccine passports but no voter ID. Lol. Clown country.","date":"Mon Mar 29 20:02:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Today is Vietnam War Veterans Day! Every year on March 29th we honor our heroes who served our country in Vietnam and answered the call when their country needed them. We love our Vietnam Veterans! Thank you for your service! https://t.co/I4erVJcF2D","date":"Mon Mar 29 17:22:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Palm Sunday! https://t.co/tPqYY9GY1O","date":"Sun Mar 28 17:09:46 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Two conservative fixes to our broken immigration system that I was proud to cosponsor. Thanks to my colleagues @RepMTG and @Lancegooden for leading the way on these important bills. #BidenBorderCrisis https://t.co/3Gcw0jId5H","date":"Sun Mar 28 16:57:49 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Happy Passover! https://t.co/m6o6vDJk6x","date":"Sun Mar 28 03:56:10 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Attention Kingman area residents! April 14 my staff will be holding office hours. If you would like to schedule a meeting, please call 928-445-1683. \nPLEASE SHARE! 🇺🇸 https://t.co/QMt7jG8a4y","date":"Fri Mar 26 18:56:20 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Was great to see old friends and be able to provide a Congressional update to a great group of patriots in Prescott Valley yesterday. 🇺🇸 https://t.co/hIk4jQYoBo","date":"Fri Mar 26 18:39:05 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Let’s put an end to all the BULL coming out of DC and get BIG DAN to Washington! @DanRodimer","date":"Fri Mar 26 16:07:12 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Great to see @generalbrnovich leading the way once again. @joebiden's attempt to micromanage state budgets through his Tax Mandate skewers state sovereignty and is unacceptable and unconstitutional. https://t.co/tazkaQG58i","date":"Fri Mar 26 15:59:33 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Democrats aggressively pursued border investigations in 2019 when President Trump faced a migrant surge. Now that @JoeBiden is in the White House, they have lost all interest. I join my colleagues on @GOPoversight to ask @CarolynBMaloney to hold hearings on the #BidenBorderCrisis","date":"Fri Mar 26 15:14:44 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@JoeBiden is literally reading notes...","date":"Thu Mar 25 18:10:04 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"March 25th is National Medal of Honor Day. It is our nation’s highest military award. These brave soldiers have shown true valor, risked their lives, and many have died in order to save the individuals they fight beside. Thank you deeply for your service. #NationalMedalOfHonorDay https://t.co/125rDCFKeK","date":"Thu Mar 25 16:52:01 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Only thing worse than kids in cages is kids in cages with COVID. Where is the media? Oh that’s right - ACCESS DENIED. #BidenBorderCrisis https://t.co/GcLxRk0MZl","date":"Thu Mar 25 15:07:27 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"The double standard is sickening. #BidenBorderCrisis \n\nBorder Patrol union president slams muted 'liberal media': 'This is \"kids in cages\" again' | Fox News https://t.co/mPzjkaGEEn","date":"Thu Mar 25 14:59:43 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"Even the President of Mexico is blaming the Biden Administration for this crisis. #BidenBorderCrisis\nhttps://t.co/ybhOUn9zvJ","date":"Wed Mar 24 23:30:18 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"#BidenBorderCrisis\nhttps://t.co/QIvE09AQwk","date":"Wed Mar 24 23:28:14 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"\"That’s simply not true. This administration is lying to the American people.\" -Tom Homan, former Acting Director of ICE\nhttps://t.co/Nxon8WB50B","date":"Wed Mar 24 23:25:11 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":".@joebiden is being forced to open new facilities to house illegal aliens instead of actually taking steps to secure our border. SMH. #BidenBorderCrisis \nhttps://t.co/OCp8MAJGUL","date":"Wed Mar 24 23:20:26 +0000 2021","user_id":"240760644"},{"handle":"RepGosar","text":"@pdabrosca This is pretty funny.","date":"Wed Mar 24 23:02:19 +0000 2021","user_id":"240760644"}]