[{"handle":"RepGregoryMeeks","text":"As #NY05 continues to rebuild from Hurricane Ida and COVID-19, I stand with my colleague @RepStricklandWA to hold @SBAgov accountable for disaster loans. Small businesses need answers.","date":"Thu Jun 16 23:30:00 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Americans are seeing the truth about the violence from #January6th. I applaud the @January6thCmte for continuing to bring transparency back to our democracy. Learning how this attack came to fruition will hold people accountable &amp; help prevent this violence in the future.","date":"Thu Jun 16 22:14:00 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Families have been feeling the weight of inflation and the House has responded by passing the Lower Food and Fuel Costs Act. This great bipartisan legislation will lower prices in grocery stores, reduce gas prices, and empower families across America.","date":"Thu Jun 16 21:13:44 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"For 10 years, Dreamers have shaped and enriched our communities &amp; economy. DACA works and is a shining example of how we can offer protection, education, and a better life for those who seek it. We embrace you and aim to create better ways to citizenship for all. #NoSonOlvidado https://t.co/7bCVRZBWHi","date":"Thu Jun 16 01:22:00 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today's @TheJusticeDept‘s charge on the Buffalo shooter sets a precedent to the prosecution of domestic terrorism motivated by hate. I hope more hate crimes will be met with serious accountability in NY and the nation. We need justice for the victims and their families.","date":"Thu Jun 16 00:45:20 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Corporate Governance Through Diversity Act will hold corporations accountable and improve plaguing diversity issues by requiring disclosures of the make-up of these companies. Thank you to @RepMaloney &amp; @RepRitchie for working with me to promote diversity. (3/3)","date":"Thu Jun 16 00:23:43 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Strengthening minority banks through the Ensuring Diversity in Community Banking Act, which provides a crucial lifeline, will uplift underbanked communities. Creating true racial equity includes providing capital to the very institutions that serve low-income communities. (2/3)","date":"Thu Jun 16 00:23:42 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I am pleased to announce the passage of 2 of my bills -- the Corporate Governance Through Diversity Act and Ensuring Diversity in Community Banking Act -- part of @FSCDEMS' larger package to promote racial equity. (1/3) https://t.co/Le1KIed1tm","date":"Thu Jun 16 00:23:41 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I was honored to join @JamaicaHospital in commemorating this community’s commitment to the health of patients and #NY05. This collaboration with King of Kings, @LIFECampInc &amp; @_ShelteringArms to expand outreach is an exemplary show of force to end gun violence in our community. https://t.co/9xNVSpPi55","date":"Tue Jun 14 12:33:03 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congress needs to do all it can to address the crisis of gun violence in our communities. I am encouraged to see the recently announced bipartisan framework by the Senators. While I applaud all efforts to combat gun violence, there is still much more work to be done.","date":"Sun Jun 12 23:58:20 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Orlando Pulse Massacre is one of many mass shootings burned in our memories. I remember and honor the victims and the crime committed against the LGBTQ+ community. In light of current events, I hope we can push forward live-saving legislation to protect all communities.","date":"Sun Jun 12 11:25:00 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This #MensHealthMonth, I encourage my brothers to join me in staying educated about our physical and mental health, seeking help when needed and promoting healthy lifestyles that will benefit our families. (1/2)","date":"Sat Jun 11 17:34:07 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We know that the lack of access to quality healthcare and support for mental health for communities of color deepens health disparities. I remain committed to fighting against these inequities in our community and making healthcare accessible for those who need it the most. (2/2)","date":"Sat Jun 11 17:34:07 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We take June to recognize the Caribbean people’s significance in our history and culture. Since its founding, Caribbean immigrants have been contributing to America’s culture, public institutions, and economy. Happy #CaribbeanAmericanHeritageMonth to all especially in #NY05!","date":"Sat Jun 11 12:23:00 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"59 years ago, the #EqualPayAct became law and yet the gender wage gap persists for women across this nation. This inequity is even more severe for Black and Latina women, who on average make 64 and 57 cents for every $1 a white man earns. More must be done. #equalpayforequalwork","date":"Fri Jun 10 20:22:00 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I am excited to for the future of @JFKairport's new Terminal One. This renovation will bring thousands of jobs to #NY05 and ease to many travelers. Thank you @GovKathyHochul and @PANYNJ for your partnership!","date":"Fri Jun 10 19:20:00 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The deadly violence on #January6th deserves to be uncovered and explained as the scheme that would aim to destroy our democracy and the Constitution. Last night the @January6thCmte shared this story with the nation.","date":"Fri Jun 10 18:19:24 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, I spoke w/ @bdgCongress on how to expand economic opportunity in communities of color &amp; increase opportunities for MBWEs.\n\nMy 2 bills, the Corporate Governance Through Diversity Act &amp; the Ensuring Diversity in Community Banking Act, are a crucial step in that direction. https://t.co/6u6S8QNPWp","date":"Thu Jun 09 01:40:39 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#OTD, 56 years ago, @SCOTUS ruled on Griswold v. Connecticut in favor of the right to privacy concerning the use of contraceptives. 56 years later, we continue to fight for rights protected by cases like Griswold and Roe. We will not rest until we move forward, not back.","date":"Tue Jun 07 20:39:46 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Our planet is the #onlyoneearth, &amp; we must do everything to nourish and protect it. Today, let’s recognize sustainable living through individual choices. As Chair of @houseforeign I will continue to advocate for sustainability in the U.S. and across the globe #WorldEnvironmentDay","date":"Sun Jun 05 12:00:03 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We wish our Jewish community in #NY05 and across the world a happy and meaningful Shavuot! I hope you all gather in joy with friends and family during this holiday of feasting and celebration.","date":"Sun Jun 05 00:30:00 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy birthday @FLOTUS! We thank you for your leadership, service, dedication, and compassion. You are a wonderful role model to all. I hope your day is filled with family, friends, and love.","date":"Fri Jun 03 20:03:07 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"With millions traveling through @LGAairport, I'm excited to celebrate the reconstruction of the new Delta Air Lines terminal, which will bring more jobs and opportunities for Queens. Thank you @GovKathyHochul and @PANYNJ for bringing us one step closer to a whole new LGA. https://t.co/4jeIWOCGIQ","date":"Fri Jun 03 17:27:07 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I #WearOrange in solidarity with the victims and survivors of gun violence. As we recognize Gun Violence Awareness Day, I aim to remember and honor those who have lost their lives to this preventable crisis. We must all work to #EndGunViolence and keep our communities safe. https://t.co/Ud68R838Ll","date":"Fri Jun 03 16:13:42 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@POTUS is right. We need rational and common sense gun reform legislation. This is about protecting our freedom to go to the grocery store, church, or school without fearing for our lives and safety.","date":"Thu Jun 02 23:47:58 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#PrideMonth is upon us &amp; we must stand in solidarity with our LGBTQ+ community against all forms of bigotry and hatred. Let’s celebrate and honor the many individuals who fought &amp; continue to push for a more just and equal society for our LGBTQ+ friends, family, and loved ones. https://t.co/doxkv6RlLZ","date":"Wed Jun 01 19:41:13 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today we express gratitude for the sacrifices of the men and women who have served in the U.S. Military. This #MemorialDay, we thank you for your service and willingness to defend the values of our nation.","date":"Mon May 30 12:00:02 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As a community, let’s work together to educate others about the impact of lupus to support the 1.5 million lupus warriors for #LupusAwarenessMonth","date":"Fri May 27 18:22:54 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Our Guyanese community is part of what makes our district so vibrant and strong. Happy 56th Independence Day to the people of Guyana especially those celebrating in #NY05! https://t.co/i7CGkZTj7i","date":"Thu May 26 21:16:34 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Gun violence is the leading cause of death among children and numbers are rapidly trending upward across the country.\n\nIn 2020, 4,357 children were shot and killed. Enough is enough. This country is long overdue for gun violence prevention legislation.","date":"Thu May 26 20:28:03 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is just the beginning. There is still much more work to do to ensure that people of color feel safe and protected living and working in their communities. (3/3)","date":"Wed May 25 21:35:04 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today marks 2 years since the tragic murder of #GeorgeFloyd and I wish his loved one’s solace and peace today. We have lost too many Black lives to police brutality. \n\nAlthough we passed the George Floyd #JusticeinPolicing Act twice in the House, the Senate failed to act. (1/3)","date":"Wed May 25 21:35:04 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We know that there is no justice without true reform. Today, in consultation with @theBlackCaucus, @POTUS signed an executive order that promotes accountability, increases transparency, and reforms the criminal justice system. (2/3)","date":"Wed May 25 21:35:04 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The death toll of last night's tragic massacre is now at 21. When will it be enough to pass commonsense, life-saving legislation into law?\n\nThe House has already passed bipartisan gun reform. It's now up to the Senate to deliver for the American people.","date":"Wed May 25 21:06:22 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Heartbroken, angry and disgusted. Today we grieve 14 children and a teacher while we are still mourning the victims from Buffalo last week.\n\nNo parent should ever have to worry if they will see their child again after they drop them to school.\n\nPraying for Uvalde, TX.","date":"Tue May 24 22:48:57 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The court’s decision to block the end of Title 42 is disappointing. I applaud @POTUS’ decision to appeal the decision and ensure this Trump-era rule comes to an end. https://t.co/LXLmKSNMQe","date":"Sat May 21 14:37:31 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I joined @SpeakerPelosi, my colleagues in the @TheBlackCaucus, @CAPAC, and @HispanicCaucus to condemn this past weekend's shooting in Buffalo. White supremacy is a threat to our democracy, and we must do everything we can to stop these acts of hatred. https://t.co/9osADJbedZ","date":"Thu May 19 20:57:34 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It’s important to prioritize your mental health. During #MentalHealthAwarenessMonth, remember that you do not deserve to suffer in silence. Let's bring awareness to the importance of mental health, ending the stigma, and seeking support.","date":"Wed May 18 20:29:46 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congrats @StJohnsU for officially breaking ground! I'm proud to have secured $1.25M in funding to contribute to the new facility, which will strengthen the learning environment for a new nursing program. https://t.co/BpSlj7Cjop","date":"Wed May 18 19:24:06 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This #JewishAmericanHeritageMonth, let’s praise the immense resilience and strength of the Jewish American community, a community that contributed to the very fabric of NYC.","date":"Mon May 16 19:55:00 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Disgusted by the racist mass murder by a white supremacist yesterday. My heart is with the people of Buffalo. Sending condolences to the loved ones of the victims and wishing a swift recovery for those who were wounded.","date":"Sun May 15 16:39:37 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It was an honor to deliver the keynote address at the @ElliottSchoolGW's commencement ceremony and address our next generation of global leaders and problem solvers.\n\nCongratulations to the @gwtweets Class of 2022. Go out and lead—and remember if you want to go far, go together. https://t.co/1TA8QgA30n","date":"Fri May 13 23:34:33 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"During #AAPIHeritageMonth, while we uplift, support, and celebrate the many contributions of Asian Americans and Pacific Islanders in NYC, let us not forget to fight against the prejudice that these communities are facing #StopAsianHate","date":"Fri May 13 16:01:17 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I applaud the Senate for the historic confirmation of Dr. Lisa Cook as the first Black woman to serve on the @FederalReserve. This long overdue moment brings the central bank of our nation closer to representing the diversity of its' people.","date":"Thu May 12 20:06:42 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Russia’s war of choice on #Ukraine is a threat to democracies everywhere. The U.S. must continue to support the people of Ukraine, &amp; impose significant costs on Russia. As @houseforeign chair, I proudly voted yesterday for @FSCDems' bills to isolate Russia through economic means.","date":"Thu May 12 19:42:42 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Senate Republicans - again - voted against the #WomensHealthProtectionAct. Until the right to abortions is codified, millions of women will continue to be at risk. This fight is not over &amp; we cannot let a few individuals get in the way of protecting these civil rights.","date":"Wed May 11 22:36:48 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thanks to the Bipartisan #Infrastructure Law and @POTUS, eligible families will have access to high-speed internet for no more than $30/ month through the Affordable Connectivity Program.\n\nGo to https://t.co/JNYaVvAvr2 to learn more.","date":"Tue May 10 17:50:53 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Although my mother is no longer with me, today especially I am thinking of her, my wife and two of my daughters. Throughout my life I have been mentored, edified, and loved by strong and powerful women. #HappyMothersDay to everyone celebrating!","date":"Sun May 08 12:11:40 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Enjoyed stopping by @100suits, a cured violence program. Organizations like this are the backbone of NY05. https://t.co/VrlcvHGRcS","date":"Fri May 06 21:07:46 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congratulations to Southeast Queens’ very own, and my good friend @KPJ46 on this monumental moment in your career. You’ve made myself, NY-05, and many others proud.","date":"Fri May 06 13:38:43 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The CRA is one of the most important civil rights laws and I look forward to reviewing this long awaited proposal to see how it will promote increased financial inclusion. (2/2)\n\nhttps://t.co/ZfjY8HpdJR","date":"Thu May 05 22:54:57 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I commend the @federalreserve, @FDICgov, and @USOCC for working together to revamp the Community Reinvestment Act, which expands access to credit, investment, and basic banking services in low- and moderate-income communities, and has not seen major revisions in 45 years. (1/2)","date":"Thu May 05 22:54:57 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Overturning Roe &amp; Casey will disproportionately harm low income communities and communities of color. They will face even more limited access to health care and reproductive choice than they already do. We must keep fighting.","date":"Wed May 04 21:03:05 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Great meeting with @WTO Director-General @NOIweala last week. We discussed how constrained global agricultural supply chains harm communities in Africa and the Middle East, and how the U.S. can better marshal a more equitable global recovery from #COVID19. https://t.co/b1wCr8F1q1","date":"Wed May 04 15:28:55 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Access to abortion is essential. This draft decision is a devastating attack on women’s rights. Overturning Roe and Casey will be detrimental and we must fight to ensure that all have the right to reproductive freedom.","date":"Tue May 03 03:14:53 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As we approach the end of the holy month of #Ramadan, I wish everyone a safe and joyous #EidAlFitr with family and loved ones. Eid Mubarak!","date":"Mon May 02 17:38:45 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Sending my prayers and condolences to the family of Firefighter Timothy Klein. As the Rockaway and NYC community continues to grieve, we honor and thank him for his service and heroism.","date":"Fri Apr 29 18:17:05 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We must send a clear message to Putin and his cronies: the US is not a safe haven for their corrupt assets.\n@RepMalinowski’s Asset Seizure for Ukraine Reconstruction Act would rebuild Ukraine from the same source of funds that have helped bankroll this illegal war. https://t.co/5aPoJXLTJj","date":"Thu Apr 28 13:30:15 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"“#NeverAgain” can ring hollow in moments like this. We must not let that be the case. We must never forget, and  keep fighting antisemitism, racism, and injustice wherever we see it.","date":"Thu Apr 28 01:24:49 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Just over a month ago, we watched in horror as Russia invaded Ukraine, desecrated Holocaust Memorial sites, and remains engaged in behavior @POTUS has labeled “genocide.”","date":"Thu Apr 28 01:24:48 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The recent @ADL report showing antisemitic incidents in the U.S. reached an all-time high in 2021, representing the highest number on record since ADL began tracking #antisemitic incidents in 1979, reminds us of the persistence of prejudice and hate. https://t.co/tRiOjywLhg","date":"Thu Apr 28 01:24:48 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tomorrow, in Israel, a siren will be heard across the country for two full minutes as the nation pauses to reflect on the horrors of the Holocaust. Today, we join them in mourning and remembrance, so that we may never repeat mistakes of the past. #HolocaustRemembranceDay","date":"Thu Apr 28 01:24:48 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"April is #FinancialLiteracyMonth 💵 📖 check @FSCDems resources page to learn about:\n\n- Federal Financial Services Agencies\n- International Financial Institutions and Multilateral Development Banks\n- Congressional Resources\n\nhttps://t.co/pp9jTeKlYe","date":"Wed Apr 27 18:37:58 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Sending my deepest condolences to the loved ones of both Firefighter Timothy Klein, and the victim in the fire. \n\nPraying for Brooklyn and the @FDNY community as we mourn this tragic loss.","date":"Mon Apr 25 15:03:03 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Under the #FairHousingAct, housing discrimination based on your race, color, national origin, religion, sex, family status, or disability is illegal. \n\nIf you’ve experienced discrimination, file a complaint👇🏽\n\n💻: https://t.co/9RQw2EKcjT\n☎️: 1 (800) 669-9777\n \n#FairHousingMonth","date":"Tue Apr 19 17:21:31 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy #Easter to everyone celebrating in New York’s 5th district and across the globe.\n\nWishing you a blessed and joyful day! https://t.co/lE8fqKSZVC","date":"Sun Apr 17 13:03:29 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Wishing a happy Passover and #ChagSameach to all who celebrate in NY-05 and across the world!","date":"Sat Apr 16 15:35:53 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy #Vaisakhi to all who celebrate! As we enjoy this festival, we must also commemorate the resilience of the Sikh community. In light of the recent horrendous attacks on members of the Sikh community in Queens, I pray that the Sikh new year brings peace and prosperity to all.","date":"Thu Apr 14 20:37:58 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Outraged by the senseless attack this morning. This horrific act of violence has no place in NYC. Praying for all the victims and those impacted in Brooklyn a safe and full recovery. Thank you to our first responders who arrived on the scene and are working to find the suspect.","date":"Tue Apr 12 18:51:27 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I'm pleased that the Senate confirmed the historic nomination of Judge Ketanji Brown Jackson to the Supreme Court of the United States. Her achievement is a testament to the many contributions of Black women to our American system.  #BlackWomenAreSupreme","date":"Thu Apr 07 18:28:29 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Restaurants and other small businesses in New York have made it clear that they need more relief. Today, I was proud to vote to pass a targeted bill to #ReplenishRRF with $42B and create a new $13B grant program for hard hit small firms.","date":"Thu Apr 07 17:29:44 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Earlier today I tested positive for COVID-19 and I am asymptomatic. I am vaccinated + boosted and I will follow CDC guidelines to quarantine.\n\nI encourage everyone to get vaccinated and tested periodically to mitigate the spread of COVID-19.","date":"Thu Apr 07 02:41:11 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I strongly condemn the shameful attack in Richmond Hill yesterday &amp; wish Nirmal Singh a full recovery. We stand in support of our Sikh community and must hold the culprit of this abhorrent crime accountable. Hate has no place in the world's borough. https://t.co/Q0wFjYsxEH","date":"Mon Apr 04 20:36:41 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Ramadan Kareem to all who celebrate ✨!  May this month of #Ramadan bring peace, prosperity and time with loved ones to all!","date":"Sat Apr 02 17:59:27 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"More than 600,000 Americans are still arrested each year on cannabis charges, despite reform laws passed in 47 states. \n\nThat’s why I voted YES on #WeNeedMORE. https://t.co/Lg7jSIpRHp","date":"Fri Apr 01 16:46:36 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today on #TransDayofVisibility we celebrate the contributions of the transgender community. As Chair of @HouseForeign, I will continue to support transgender communities both at home and abroad. #TransRightsAreHumanRights","date":"Thu Mar 31 21:21:31 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"No American should have to choose between paying for lifesaving insulin and other basic necessities like food &amp; rent. That’s why I’m supporting the #AffordableInsulinNow Act to lower insulin prices to no more than $35 a month for Americans with diabetes.","date":"Thu Mar 31 17:13:45 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"New York is one of seven states that have reduced their uninsured rate by at least half through enrollment in marketplace coverage and expansion of Medicaid to adult populations. All thanks to the #AffordableCareAct.","date":"Thu Mar 31 16:52:43 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Appraisals are critical to ensure homebuyers:\n✔️Pay a fair, reasonable price for their 🏘️\n✔️ Receive the full value their 🏘️ is worth\n✔️ Can access all the equity in their 🏘️\n\nToday, @FSCDems discussed the role of appraisers + needed industry reforms. https://t.co/vPQcPfmxHm","date":"Tue Mar 29 20:47:02 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Despite more than 200 attempts, the act of lynching has never before been designated a federal hate crime, meaning that 99% of lynching perpetrators historically escaped punishment.\n\nToday, @POTUS will correct this injustice by signing @RepBobbyRush's #AntilynchingAct into law.","date":"Tue Mar 29 20:24:22 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I had the privilege to visit @StJohnsU and meet @BrianTBrowne’s students studying American Government. The conversations I had with diverse students from my community reminds me of why I chose to be a public servant.\n \nRead more at https://t.co/POzB8YBMEw","date":"Mon Mar 28 20:53:55 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"All New Yorkers should share in the benefits of the tourism and travel industry’s recovery; @NYCMayor and @JetBlue’s workforce partnership program will help break down barriers to employment for diverse professionals, especially in Queens – the gateway to America. https://t.co/t1YbfufFLz","date":"Mon Mar 28 19:40:58 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Queens would not be what it is today without the tenacity and grit of our Indian-American community. As we celebrate #Holi, the Festival of Love, let us commemorate the tremendous impact of Indian immigrants in culture throughout New York City.","date":"Fri Mar 18 17:36:43 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I know you see the low ‘fro 😏.  \n\nToday, the House passed the #CROWNAct, preventing discrimination against one’s hair texture or hairstyle in employment and other opportunities. It ensures people can be their authentic selves and still pursue the American Dream. #FlashbackFriday https://t.co/YxrRf3FbI6","date":"Fri Mar 18 15:09:09 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today we celebrate the tremendous impact of the Irish community in NY-05 and across NYC. Our communities flourish because of the rich heritage and influence that Irish immigrants have brought through generations. Happy #StPatricksDay to the Irish people!","date":"Thu Mar 17 19:39:07 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Join me Thursday, March 24th at York College for a town hall for a federal update on what’s going on in D.C. and right here in NY’s 5th Congressional District. Proof of vaccination is required and for those who cannot join in person, please join us on Zoom. See you there! https://t.co/JG0vJjPAfQ","date":"Wed Mar 16 17:57:58 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congratulations Shalanda Young for being confirmed as the @WhiteHouse OMB Director, the first Black woman to serve in this position.\n\nLooking forward to the amazing work you will accomplish in this role!","date":"Tue Mar 15 21:38:56 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My heart aches for the unhoused New Yorkers and Washingtonians here. I wish our law enforcement safety in detaining whomever is responsible for these horrific targeting and killings of our most vulnerable community members.\n\nhttps://t.co/6GgWdBOAGc","date":"Mon Mar 14 11:55:16 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"These meaningful investments throughout Queens and Nassau County will provide our community leaders with the resources they need to rebuild following COVID-19’s disruption and I am proud to have advocated for these programs. (10/10)","date":"Fri Mar 11 20:45:05 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"$1.25M for @StJohnsU for the Skills and Simulation Center Project to expand the learning environment for a new nursing program. (7/10)","date":"Fri Mar 11 20:45:05 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"$2.5M to @YorkCollegeCUNY to perform a comprehensive health care study, and to train students in healthcare and business (9/10)","date":"Fri Mar 11 20:45:05 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"$4M to @StJohnsEpisHosp to renovate the Behavioral Health, Maternity/NICU and Labor and Delivery Units within the hospital. (8/10)","date":"Fri Mar 11 20:45:05 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"$2M for @LIFECampInc for youth engagement program that is focused on reducing bullying, violence, and gang recruitment through mentorship and social emotional services. (5/10)","date":"Fri Mar 11 20:45:04 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"$2M for @longislandfqhc for the Elmont Health Center renovation and repair project to increase access to comprehensive primary and preventative health care, and to improve the health of the underserved and vulnerable communities. (6/10)","date":"Fri Mar 11 20:45:04 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"$1.5M to @jpafhc to help complete the construction and renovation of both an existing facility and a new facility to provide a holistic care center for the community. (4/10)","date":"Fri Mar 11 20:45:04 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"$350k to @EasternQueens for an after-school program for children at the Environmental Science Center. (2/10)","date":"Fri Mar 11 20:45:03 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I am proud to have secured $15.1M in funding in @HouseDemocrats’ historic government funding package that will Make NY’s 5th Congressional district healthier, safer, stronger, and even more resilient. \n\nThe 10 projects I secured Community Project Funding for include: (1/10)","date":"Fri Mar 11 20:45:03 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"$1.5M to @JamaicaHospital to cover the construction costs associated with updating and doubling the Emergency Department’s MRI capabilities which is the first step in a larger effort to modernize the hospital's emergency facilities. (3/10)","date":"Fri Mar 11 20:45:03 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy #InternationalWomensDay! Today and every day we recognize and celebrate the social, political, and economic accomplishments of the extraordinary women in this world.  Thank you to the women who have sacrificed and paved the way for generations to come.","date":"Tue Mar 08 22:05:24 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My visit to the 🇵🇱🇺🇦 border today was heartbreaking. \n\nThe Polish people’s honorable efforts and Ukrainian bravery are inspiring. We can all do more. \n\nWhen back in the US, I’ll work with the House to do just that. #StandWithUkraine https://t.co/KmEXuPv1s4","date":"Sun Mar 06 20:37:32 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Excited to be back at my Alma Mater @HowardU today to speak at its 155th Charter Day Convocation.\n\nTune in LIVE at 11 to watch the ceremony at https://t.co/8vipkZlVcH https://t.co/FdRKmncz0D","date":"Fri Mar 04 15:44:16 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Yesterday's bombing by Russia hit Babyn Yar, the memorial site where over 33,000 Jews were executed, and tens of thousands more fell victim during German occupation. A holocaust site desecrated by an invasion offensively justified as \"de-nazifying\" Ukraine. https://t.co/NF7xdH2ZPf","date":"Thu Mar 03 02:31:37 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@POTUS: The State of the Union is strong because the American people are strong 💪🏾💪🏾💪🏾","date":"Wed Mar 02 03:18:59 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Reuniting families is not just the right thing to do but an economically smart thing to do. I stand with @POTUS in increasing the number of immigration judges so that we can hear these cases in a more efficient manner and reach a just outcome for these families #SOTU","date":"Wed Mar 02 03:08:55 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We have made significant strides fighting COVID under @POTUS’ leadership.\n\nWe have reached a point where it no longer control our lives and have more tools to continue to mitigate the spread. You can now order more FREE at-home tests at https://t.co/uq3Rjppazm #SOTU","date":"Wed Mar 02 02:59:24 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I stand with @POTUS in calling on the Senate to confirm his nominees for the @FederalReserve. His nominees will not only fight inflation, they’ll bring the Fed closer to representing the diversity of our nation.  #SOTU","date":"Wed Mar 02 02:48:38 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thanks to @POTUS we’re done talking about infrastructure weeks, we’re talking about an infrastructure decade with meaningful investments in communities that need them the most. #SOTU","date":"Wed Mar 02 02:29:05 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Join me tonight LIVE at 5PM for a pre-discussion on the 2022 State of the Union Address at https://t.co/9Ar1qnver7 https://t.co/gfzsjPRhD2","date":"Tue Mar 01 18:35:35 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I applaud @POTUS’ historic nomination of Ketanji Brown Jackson to the SCOTUS as an important step towards greater inclusion. While she will inspire generations of Black women to come, she’ll also add value to the Court &amp; broaden its perspective given her strong legal background.","date":"Fri Feb 25 15:24:22 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump’s praise for Putin represents a dangerous pro-authoritarian under-toe in the American Right, and it should be universally condemned.","date":"Thu Feb 24 01:50:07 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"While the typical Black household’s income has risen since the 1970s, Black households still earn just 62 cents for every dollar earned by white households – a difference of ~$30,000 per year.  #JECxCBC\n\nhttps://t.co/fj6PPfH0t3 https://t.co/nHvj9VV3B5","date":"Wed Feb 23 17:48:18 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Several other notable convictions have been reached since this push. Let today’s verdict serve as a strong pronouncement that hate has no place in our society. (3/3)","date":"Tue Feb 22 19:25:12 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In many ways, Democratic efforts in Congress were critical to today’s verdict including passage of @RepGraceMeng’s COVID-19 Hate Crimes Act, an already aggressive @TheJusticeDept was ordered to expedite reviews of federal hate crimes including Arbery’s case. (2/3)","date":"Tue Feb 22 19:25:12 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, a jury confirmed that the three men who murdered Ahmaud Arbery were motivated by racial hatred. Tomorrow marks the two year anniversary of Arbery’s tragic death, and unfortunately hate crimes and stories like this are ever increasing. (1/3)","date":"Tue Feb 22 19:25:12 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Black girls across America should be afforded the same opportunity to see themselves as protectors and perfecters of all our democratic institutions, especially the Supreme Court.\n\nhttps://t.co/IKlS668ayj","date":"Mon Feb 21 14:39:29 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"MDIs and CDFIs are lifelines for small businesses &amp; underserved communities; that’s why I reintroduced my Ensuring Diversity in Community Banking Bill. As we look forward to its advancement, I applaud @FSCDems for being laser focused on expanding financial opportunities. https://t.co/n51rSWiMPd","date":"Wed Feb 16 21:41:36 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As we celebrate the chosen birthday of influential abolitionist Frederick Douglass, let us remember that \"without a struggle, there can be no progress.\" #BlackHistoryMonth","date":"Mon Feb 14 21:49:27 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Known for her works that address the intersectionality of Black identity, feminism, marginalization &amp; climate change, Amanda Gorman gained notoriety from her poem \"The Hill We Climb\" read at the 2021 inauguration of @POTUS. #BlackHistoryMonth https://t.co/jesQpxx6A4","date":"Thu Feb 10 20:49:59 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"From reaching America’s unbanked to securely delivering humanitarian aid abroad, the potential digital assets present are great. Today’s @FSCDems hearing on stablecoins was critical to understanding how lawmakers can best protect the public while enabling responsible innovation. https://t.co/aj8w4CUYVD","date":"Tue Feb 08 20:34:09 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thank you @POTUS for making N95 masks free and available.\n \nResidents in the district can pick up free masks at Community Healthcare Network 90-04 161st St, Jamaica while supplies last.\n \nGo to https://t.co/axnj3lV1n1 for more info","date":"Tue Feb 08 14:53:48 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"A two state solution is the only way to assure that both peoples are provided the freedom, security and justice they deserve. I think Amnesty International report, due to its purposefully inciteful nature, doesn’t help that effort.","date":"Wed Feb 02 16:48:50 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As Chairman, I have traveled to Israel and the West Bank and have met with Israelis and Palestinians young and old, rich and poor. I have met Israel’s new government, as well as Palestinian Authority leadership. They both have an enormous amount of work to do.","date":"Wed Feb 02 16:48:50 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"But, issuing such an inflammatory report - which makes no effort to explain the challenges Israel faces, or the history of the Jewish people - does not do justice in seeking real solutions to the conflict.","date":"Wed Feb 02 16:48:49 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Amnesty International plays an important role around the world, and civil society needs to be supported and nurtured. But it is clear that even the title of the report is intended to be more inflammatory than a report from Amnesty should aspire to be.","date":"Wed Feb 02 16:48:49 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The extensive #humanrights reporting about the plight of Palestinians in the West Bank and Gaza cannot be overlooked. Demolitions, settlement expansion, arbitrary detentions, harassment and other injustices can and must end.","date":"Wed Feb 02 16:48:49 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The seemingly biased report issued yesterday by Amnesty International on the Israeli-Palestinian conflict only emboldens those who organize tirelessly to eliminate the Jewish State.","date":"Wed Feb 02 16:48:48 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We should not forget, American security assistance, for items such as the Iron Dome missile defense system, protects Jewish and Muslim lives alike. And the bulk of the aid is utilized to defend against foreign attack.","date":"Wed Feb 02 16:48:48 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"These aren’t only harmful policy recommendations, but Amnesty International appears to be going out of its way to lobby countries to end their support for Israel. I don’t support that, nor do the bulk of my constituents, nor does this Congress.","date":"Wed Feb 02 16:48:48 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Wishing the NYPD Officer that was wounded a swift recovery.\n\nThe rise of gun violence and violent crimes is a public health crisis. Residents in the Rockaways and all over the city should feel safe. https://t.co/ldsk6yIlNA","date":"Wed Feb 02 14:56:03 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy Lunar New Year! As we enter this #YearoftheTiger, may you carry bravery and strength as we overcome the current pandemic. Wishing you a year of great prosperity and fortune!","date":"Wed Feb 02 04:09:15 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As we enter the first day of #BlackHistoryMonth, we are reminded that change is still deeply needed. The threats that my alma mater @HowardU received are unacceptable. HBCU's are a cornerstone of Black history and Black communities. They must be protected. https://t.co/PfLeNR67rd","date":"Tue Feb 01 21:18:05 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The @WhiteHouse released a new, comprehensive resource on @POTUS’s Bipartisan Infrastructure Law. The guidebook, available at https://t.co/I7N1KvEERN, can help NY communities navigate available funding opportunities and historic benefits.\n \nTogether, we're #BuildingABetterAmerica","date":"Mon Jan 31 19:23:48 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I applaud @POTUS for standing by his commitment to nominate the first ever Black woman to the Supreme Court and look forward to him fulfilling this promise. (2/2)","date":"Thu Jan 27 18:25:13 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Supreme Court Justice Breyer has been an exemplary judge and I thank him for his 28 years of service on the bench. I wish him a happy retirement. (1/2)","date":"Thu Jan 27 18:25:12 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As Holocaust Survivor Elie Wiesel once said \"The opposite of love is not hate, it's indifference.\" Today, on #HolocaustRemembranceDay, we remember the six million Jewish lives lost. #NeverAgain","date":"Thu Jan 27 17:16:47 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today marks the 49th anniversary of Roe v. Wade. Reproductive rights and access are still under attack across the country disproportionately harming communities already facing systemic discrimination.\n\nThe Senate must pass the Women’s Health Protection Act #WHPA","date":"Sat Jan 22 14:33:03 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Go to https://t.co/2LloZQWoL4 to order your FREE at-home COVID-19 rapid antigen testing kits. One order includes 4 individual tests.\n\n- Get vaccinated. \n- Get boosted. \n- Get tested. \n- Wear a mask. \n\nThe only way out of this pandemic is together!","date":"Tue Jan 18 21:49:50 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"To truly honor #MLK, we must secure voting rights through law. \n\nLike those who fought against Dr. King’s vision of America, a minority of Senators have consistently blocked proposals protecting the core of our democracy. \n\nAs I often say, the cameras of history are rolling. https://t.co/omoj70IJYF","date":"Mon Jan 17 16:16:24 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The historic nominations of two Black economists to the Federal Reserve is especially pleasing at a time when our country is in dire need of an equitable recovery from a pandemic economy. \n\nThe greater need for diversity at the Federal Reserve is long overdue. (2/2)","date":"Fri Jan 14 17:58:26 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I commend @POTUS for nominating Sarah Bloom Raskin as Vice Chair for Supervision to the @federalreserve. If approved by the Senate, she will be the first woman to ever serve in this role and lead the most diverse Fed Board of Governors in its 108-year history. (1/2)","date":"Fri Jan 14 17:58:26 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Join me LIVE on Facebook tonight with:\n\n- Elmont Family Health Center \n- Jamaica Hospital\n- Joseph P. Addabbo Family Health Center\n- St. John’s Episcopal Hospital \n- NYC Health + Hospitals (Queens)\n\nWe’ll chat about COVID-19 and how it’s impacting their facilities. See you at 5! https://t.co/tirRbAWd9n","date":"Tue Jan 11 20:13:30 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Preserving the People’s power in representative government should override preserving procedure. \n\nThe question before the Senate on the filibuster is this: do you put perfunctory procedure over the People? \n\nHanging in the balance is our Democracy itself. #VotingRightsAct","date":"Tue Jan 11 18:32:12 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The right to vote is essential to the democracy of the U.S. and if we’re going to lead in Democratic circles, we should lead by example.\n\nCongress needs to pass #VotingRights reforms. The American people can’t wait any longer https://t.co/R35h98hXUd","date":"Sun Jan 09 18:42:16 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Sidney Poitier lived the American Dream. Of Afro-Caribbean descent, he made theatrical history in classics like “A Raisin in the Sun” and advanced Black culture on the screen. I pray his family is comforted during this time.  \n\nhttps://t.co/mr7qd1KU3Z","date":"Fri Jan 07 16:00:23 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today on @BNCNews I discussed my experience on Jan 6, 2021.\n\nSince that day, House Democrats have taken steps to protect our democracy including the passage of the John Lewis #VotingRightsAct. It’s now time for the Senate to do the same. https://t.co/ZdBq8efn9Q","date":"Thu Jan 06 21:40:46 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As I reflect on that day, I’m more determined than ever to prevent another Nadir. The advancements we’ve made as a Nation, and as Black people, must be secured by renewing our commitment to Democracy and promoting racial equality. (10/12)","date":"Thu Jan 06 14:06:31 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In the past year, we witnessed more coups worldwide than the previous 5 combined. If we fail to address the threats to our Democracy that Jan 6 put on display to the world, we risk losing not only our moral authority abroad, but our country itself. (12/12)","date":"Thu Jan 06 14:06:31 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"To do that we must pass the #VotingRightsAct. Ensuring equitable access to the ballot box remains key. And as Chair of @HouseForeign, I’ll be leading efforts to promote Democracy globally. (11/12)","date":"Thu Jan 06 14:06:31 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Given this history, it only made sense that I would be bunkered in my office on January 6 with my Fraternity brother. That day the insurrectionists did more to remind us of our collective purpose in Congress than anything else; it was a call to social action. (9/12)","date":"Thu Jan 06 14:06:30 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Despite the grimness of the Nadir, Black institutions like @apa1906NETwork emerged as an act of resistance and source of refuge. Quoting one of our founders: “society offered us . . . no security. Out of our need, our Fraternity brought social purpose and social action.” (8/12)","date":"Thu Jan 06 14:06:30 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Alpha emerged during a period of American history referred to as the “Nadir of American Race Relations” coined by historian Rayford Logan. It’s the period after Reconstruction where we saw significant backlash against efforts to ensure a healthy multi-racial Democracy. (6/12)","date":"Thu Jan 06 14:06:29 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Lynchings and white supremacy were rampant, voting and political rights were denied, and Black codes were enacted forcing the formerly enslaved to choose between unfair labor conditions or jail.  The hopes and promises of Reconstruction were delayed. (7/12)","date":"Thu Jan 06 14:06:29 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Not only does @RepDavidScott share with me the honor of being the first Black Chairman of his Committee, we are both proud members of Alpha Phi Alpha Fraternity which was founded by Black students at Cornell in 1906 especially for moments like January 6.  (5/12)","date":"Thu Jan 06 14:06:29 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The week of Jan 6, Congress certified the US’ resounding preference for @POTUS, and marked the swearing-in of the largest number of Black Members in our history. 6 are now Chairs of @FSCDems @HouseForeign @HouseAGDems @HouseScience @HomelandDems @EdLaborCmte (2/12)","date":"Thu Jan 06 14:06:28 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Buttressing @theBlackCaucus’ work are dozens of Black Subcommittee Chairs and other Members that represent Americans from rural communities to mega metropolises. The week of Jan 6 was indeed a watershed moment in Black political history. (3/12)","date":"Thu Jan 06 14:06:28 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"So, when I witnessed the insurrection from my office’s front row seat, I felt a profound sadness - yet, determination. As the violent crowd swelled before my eyes, I got a call from @RepDavidScott, who was seeking a safe refuge to shelter. (4/12)","date":"Thu Jan 06 14:06:28 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Jan. 6, 2021 began peacefully. As I viewed the Capitol Dome that morning, I reflected on all its history as a structure completed after the Civil War’s failed insurrection. Little did I know what started off as a calm morning would dissolve into another failed insurrection.(1/12)","date":"Thu Jan 06 14:06:27 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Proud to swear in my sister @CMAdrienneAdams, the FIRST Black woman to serve as Speaker of the New York City Council.\n\nThis is a historical moment for Queens, for New York City, and for our country.\nhttps://t.co/SnpFhrY5LZ","date":"Wed Jan 05 20:15:02 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today members of the Haitian diaspora celebrate 218 years of freedom. \n\nHappy Independence Day to the world’s first Black republic!","date":"Sun Jan 02 00:48:24 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#HappyNewYear and welcome to 2022! Here’s to this being a year of growth and happiness for communities across our country. https://t.co/uGK0A52wMI","date":"Sat Jan 01 16:19:35 +0000 2022","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My deepest condolences to the family and friends of Sen. Harry Reid. He truly fought the good fight. He was a master legislator and keen tactician; Americans to come will benefit from his life’s work.","date":"Wed Dec 29 01:50:59 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"To observers, have a Joyous Kwanzaa! As we reflect on our Seven Principles, also remember our ancestors that continue to guide our steps. Let’s fulfill their greatest aspirations. https://t.co/tAY9psLFzp","date":"Sun Dec 26 17:11:31 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"From my family to yours, Merry Christmas 🎄 and Happy Holidays! https://t.co/gvEhijbWEH","date":"Sat Dec 25 14:45:57 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thank you @GovKathyHochul for expanding COVID-19 testing. We are seeing a rise in breakthrough cases. Getting tested can help protect your loved ones during the holidays.\n\nStarting 12/29 you can get free Covid tests at York College. Go to https://t.co/N97flXS8ch for more info","date":"Fri Dec 24 19:32:44 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Daunte Wright should still be here with us today. While his loved ones continue to mourn an immeasurable loss, I hope they find peace in today’s verdict. \n\nThe story of a Black American losing their life to police brutality is one we know too well and hear too often.","date":"Thu Dec 23 20:32:06 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The fact of the matter is the Dem. Party is the most forward-thinking. \n\nPolicies we’ve championed, though oft-mischaracterized by others, save lives and grow in demand. Let’s cut the noise, build on our accomplishments and #BuildBackBetter \n\nhttps://t.co/lyxilgWgRK","date":"Wed Dec 22 17:11:44 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, I joined a #NewDems letter to @SecRaimondo &amp; @AmbassadorTai urging them to expeditiously end Trump’s tariffs on alum./steel. This policy challenges our trade partnerships when cooperation is key towards promoting our shared interests, easing inflation, &amp; promoting growth","date":"Tue Dec 21 20:03:36 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We are seeing breakthrough cases all over the country and must take all precautions. For those of you who are eligible – get boosted! The only way to get through this pandemic is together. (2/2)","date":"Tue Dec 21 19:35:07 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Omicron variant made it very clear that we are not yet out of the dark. Before seeing your loved ones, get vaccinated AND get a COVID test. Limit the size of your gatherings and if you can, social distance and wear a mask. (1/2)","date":"Tue Dec 21 19:35:06 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The future of innovation in the financial markets is inevitable.\n\nThe use of digital assets can help underserved communities access additional financial tools - but we must make sure there is global coordination around regulation. https://t.co/2DbvTZKMvp","date":"Wed Dec 08 22:11:28 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, we remember over 2,400 service members and civilians who were killed during the attack on Pearl Harbor.\n \nWe continue to honor their lives and commemorate the bravery and sacrifice of those who fought for our country in the days that followed. https://t.co/OwfvtrMjRI","date":"Tue Dec 07 21:46:33 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy 115th Founders’ Day to @apa1906NETwork. As Chair of @HouseForeign, I’ll make sure our collective commitment to service remains ALL inclusive and global.  🤙🏾 https://t.co/iWrvgBNKIn","date":"Sat Dec 04 14:21:15 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Omicron or Omarion, either way, please get vaxxed or boosted like you “Post to Be”.","date":"Tue Nov 30 14:33:19 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"For those observing Hanukkah, may the lights of the menorah fill your home with brightness, and your hearts with hope and happiness as you celebrate with those you love. \n\nI wish you a #HappyHanukkah and your family a season of love, laughter and light. https://t.co/HVNR3PqnsI","date":"Sun Nov 28 23:34:01 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My deepest condolences to the Meek family. I had the honor of overlapping in Congressional service with Carrie Meek. \n\nAt her core, she was an educator and I’m thankful for all that I learned from her.","date":"Sun Nov 28 23:05:46 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"From the Meeks family to yours, I hope everyone has a #HappyThanksgiving! Today we give thanks and gather with our family and friends to enjoy this beautiful holiday. https://t.co/IyhghM4YdB","date":"Thu Nov 25 16:08:06 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As Ahmaud Arbery’s family continues to grieve in his absence, I pray that they find some comfort in today’s verdict, though things will never be the same without him. \n\nI hope today’s verdict serves as a strong deterrent to those who find vigilantism and lynching acceptable.","date":"Wed Nov 24 20:06:28 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I commend @POTUS on moving forward with the historic nomination of Shalanda Young as OMB Director. Her bipartisan support and her ability to sift through the complexities of government makes her the best candidate for this role.","date":"Wed Nov 24 17:10:37 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Further, Lael Brainard as Vice Chair is an excellent supervisory nomination. I had the benefit of working with her closely on CRA reform and I’m confident she will be a progressive force on banking regulation.  (3/4)","date":"Mon Nov 22 15:13:10 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As @POTUS considers filling other Fed vacancies, diversity in background &amp; thought must be at the forefront. From dynamic labor leaders like @wspriggs to others, there are a plethora of qualified candidates that could help broaden the Fed’s perspective. (4/4)","date":"Mon Nov 22 15:13:10 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"President Biden’s nomination of Jerome Powell to continue as Fed Chair, and Lael Brainard as Vice Chair is appropriate. (1/4)","date":"Mon Nov 22 15:13:10 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As our country continues to navigate a pandemic economy, one where inflation has emerged as a new challenge, Powell will be a steady hand that promotes stability during uncertain times. (2/4)","date":"Mon Nov 22 15:13:10 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Let us not forget that two people died unnecessarily, one injured, and their families are left behind with today’s judgment, but no recourse. \n\nRittenhouse was never the victim here - those making him out to be a hero are degenerates.\n\nhttps://t.co/bqrRP4xYZl","date":"Fri Nov 19 19:50:03 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As someone who grew up in NYCHA, I’m mostly looking forward to the approx $40 billion towards @NYCHA Housing that will address repairs and affordable housing for families in NYC. \n\nI look forward to the bill’s passage in the Senate and its signage into law.","date":"Fri Nov 19 14:57:01 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today @HouseDemocrats passed the #BuildBackBetter Act which will deliver: \n\n✅ universal pre-k\n✅ healthcare \n✅ affordable housing\n✅ lower Rx drug costs\n✅ climate action \n✅ millions of jobs","date":"Fri Nov 19 14:57:01 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Looking forward to doing our part in the House and advancing the #BuildBackBetter Act! https://t.co/Dq0qHA8ViP","date":"Fri Nov 19 00:20:26 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This #VeteransDay, we celebrate and honor the millions of men and women who have served our country. \n\nWe thank you for your service today and every day. https://t.co/JKoMpEba7b","date":"Thu Nov 11 13:17:03 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy 246th Birthday, @USMC\n\nToday and every day, we recognize the men and women of the Marine Corps and the time spent serving our country. Thank you for your bravery and dedication!","date":"Wed Nov 10 20:44:58 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The $1.2 trillion Bipartisan Infrastructure Bill has just passed the House! \n\nI look forward to @POTUS signing the Bipartisan Infrastructure Bill into law and working with my colleagues to pass the #BuildBackBetter Act!","date":"Sat Nov 06 04:14:28 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#OTD 53 years ago, Shirley Chisholm became the first Black woman elected to Congress, and later, the first black candidate to run for President of the United States. \n\nToday, we celebrate her and how her victory has inspired women and African Americans for generations to come. https://t.co/dnr7EwyVKJ","date":"Fri Nov 05 20:37:24 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I’m proud to support @RepMaloney’s resolution to make Diwali a federal holiday.\n\nFor those celebrating, I hope the Diwali lights brighten your life and fill your day with happiness.\n\nHave a blessed #Diwali https://t.co/ASZk5bzw8N","date":"Thu Nov 04 14:57:31 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Every vote counts, and your voice matters. New York, be sure to research the five statewide ballot proposals that YOU can vote on today.\n\nFind your local polling place and cast your vote today!","date":"Tue Nov 02 15:28:00 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Looking forward to welcoming @VP to NY’s 5th Congressional District to discuss our shared goals on climate.   \n\nWe must #BuildBackBetter through ambitious reforms. \n\nhttps://t.co/SzA4U3gaI8","date":"Mon Nov 01 14:44:24 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"1 in 3 women and 1 in 4 men have been physically abused by an intimate partner. We recognize survivors and we honor those who have lost their lives.\n\nIf you or a loved one are experiencing Domestic Violence, call 1-800-799-SAFE #DomesticViolenceAwarenessMonth","date":"Fri Oct 29 20:31:56 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I’ve been working closely with world leaders, my colleagues in Congress, and local officials in NY to push for significant climate policies &amp; bolster resiliency in my district. Let this anniversary be a reminder of the urgency of our mission &amp; the importance of govt action. (4/4)","date":"Fri Oct 29 19:24:29 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"But our work does not stop there. Last month, Hurricane Ida caused damage &amp; severe flooding across NY. It was a reminder that extreme weather events will only increase in frequency and severity, and we must be diligent in adapting &amp; mitigating the risks to our communities. (3/4)","date":"Fri Oct 29 19:24:29 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"9 years ago today, New York was hit by the second-largest storm on record, #HurricaneSandy. The superstorm caused $19 billion in damage, flooded 51 square miles, and left nearly 2 million residents without power. Tragically, the lives of 43 New Yorkers were lost. (1/4)","date":"Fri Oct 29 19:24:28 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We rebuilt our city in the years that followed. Federal and local officials worked together to secure disaster relief funding, rebuild housing, assist displaced tenants, and bolster coastal defenses. (2/4)","date":"Fri Oct 29 19:24:28 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I introduced the #EAGLEAct, to energize US climate leadership and ensure that the most vulnerable in the Indo-Pacific and around the world don’t see climate impacts exacerbated. The US must lead to hold China, the world’s biggest emitter, accountable. (4/4)","date":"Wed Oct 27 18:59:35 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I also signed onto two letters to the Army Corps of Engineers requesting that funds in the Disaster Supplemental go toward two ecosystem restoration projects that would benefit Jamaica Bay and toward a NY/NJ harbor &amp; tributaries feasibility study. (3/4)","date":"Wed Oct 27 18:59:10 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I’m a co-sponsor of the NY-NJ Watershed Protection Act, which would fund local restoration projects of the watersheds that flow into the NY/NJ harbor, protect wildlife habitats, increase public access, mitigate flood risks, and benefit frontline communities. (2/4)","date":"Wed Oct 27 18:58:39 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Passing legislation to accelerate a green energy transition is a top priority for Congressional Democrats. Conducting oversight to ensure that federal funds and programs reach vulnerable communities - including those in my district - is part and parcel with that aim. (1/4)","date":"Wed Oct 27 18:58:18 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As a Representative of a district severely impacted by extreme storms, I know firsthand the local &amp; immediate consequences of inaction. I know firsthand how poor environmental conditions impact childhood health &amp; development. These realities demand a strong federal response (2/2)","date":"Wed Oct 27 18:40:50 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As the second-largest emitter of greenhouse gases, the US plays a critical role in slowing the warming of the planet and saving lives and livelihoods for generations to come by setting an example and reducing emissions here at home. (1/2)","date":"Wed Oct 27 18:40:07 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Climate diplomacy is just one aspect of the international climate change agenda. Our work does not end when @COP26 is over, and it is critical that the U.S. and our global partners remain focused on consistent progress toward our shared climate goals.  (2/2)","date":"Wed Oct 27 18:27:52 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In addition to a shared understanding of how our global climate commitments put us on track to meet our ambitious climate targets, I am hopeful that we will collectively leave with renewed motivation and excitement to get to work. (1/2)","date":"Wed Oct 27 18:27:23 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Time is running out to address the climate crisis, which most severely impacts marginalized communities in developing countries, including women, communities of color, &amp; indigenous communities. The @GreenClimateFund targets this by financing developing nations’ climate efforts.","date":"Wed Oct 27 18:15:54 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I’ve seen how bottom-up pressure can yield significant progress for a clean energy transition. Creating a global climate revolution takes public pressure &amp; involvement, starting from community-based, climate-friendly practices - at schools, businesses, and places of work.","date":"Wed Oct 27 18:03:44 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I stand with Chair @RepBeatty and fellow members of @TheBlackCaucus to ensure that policies benefitting our Black communities are prioritized and included in the #BuildBackBetter Act https://t.co/grwtGyYIF8","date":"Wed Oct 27 16:17:51 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Black women are more likely to die from #BreastCancer than any other racial group.  \n\nMore likely to be diagnosed with the later-stage disease than other women AND have the lowest survival rates in each stage of diagnosis. \n\nIt's time to change that. #CBCPinkFriday https://t.co/5rfcEnZQig","date":"Fri Oct 22 19:41:55 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It takes Latina women two years to earn what white men earn in one year. Latina women only typically earn fifty-seven cents for every dollar earned by white and non-Hispanic men. \n\nEqual pay for equal work is long overdue #LatinaEqualPay","date":"Thu Oct 21 21:10:18 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The #FreedomToVote Act will:\n\n- Ensure free and fair access to the ballot.\n- Protect the integrity of our elections.\n- Prohibit partisan gerrymandering.\n- End the era of big money in our politics.\n \nThe Senate must pass this legislation to protect the fundamental right to vote.","date":"Wed Oct 20 15:07:05 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"About 1 in 8 women in the United States will develop breast cancer in her lifetime. Remember those who have been diagnosed, and those who have lost their lives to this deadly disease. Early detection is key.  #BreastCancerAwarenessMonth https://t.co/vrfxQ430S0","date":"Tue Oct 19 21:57:52 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Glad to see the return of @JeanMontrevil to his family and the community he loves. Shoutout to @das_alina and her colleagues at @nyulaw for their fierce and compassionate advocacy.","date":"Tue Oct 19 14:25:31 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Due to COVID-19, 12 million women across the globe lost access to contraception. On International #DayOfTheGirl we recognize that when girls have equal access to education &amp; health services, they are empowered to transform the world.","date":"Mon Oct 11 23:04:11 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today we celebrate #IndigenousPeoplesDay, by honoring Native cultures, reflecting upon their histories and dedicating ourselves to preserving their future. https://t.co/UZf0NOOn2Y","date":"Mon Oct 11 14:19:46 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I support @FSCDems’ Housing Title of the #BuildBackBetterAct that would provide long-overdue investments in housing resources, such as:\n\n🏡 Affordable housing\n\n💵 Downpayment and rental assistance\n\n🏠 Efforts to end homelessness\n \n#HousingIsInfrastructure","date":"Fri Oct 08 16:38:02 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My closing remarks from @HouseForeign's briefing on reassessing U.S. policy towards Haiti with Ambassador Foote: https://t.co/8MjBHHx752","date":"Fri Oct 08 16:15:13 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I applaud the @usedgov for making loan forgiveness more accessible for public servants. The program has long been riddled with logistical hurdles that don’t speak to the spirit of the law. This action will bring thousands closer to debt cancellation. \nhttps://t.co/2UosOpqsLa","date":"Thu Oct 07 15:15:28 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today on #WorldTeachersDay we recognize the efforts and contributions from educators internationally. Thank you to all teachers for everything that you do!","date":"Tue Oct 05 20:23:30 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"LIVE: Watch @HouseForeign hearing with testimony from key decision-makers spanning our 20 years of war in #Afghanistan. https://t.co/eA8ydyGO8H","date":"Tue Oct 05 17:04:03 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"LIVE NOW: @HouseForeign Reviews Legislation  https://t.co/g8piyWtxaR","date":"Thu Sep 30 17:14:43 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today is #NationalVoterRegistrationDay! It’s important for Americans to register to exercise their right to vote for our great democracy. Make sure you are registered, help your family &amp; friends to register, or update your voter registration information at https://t.co/RMuxLp9wRp","date":"Tue Sep 28 16:19:52 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My full statement on the deportations of Haitian migrants: https://t.co/Ih26G3eaO8","date":"Tue Sep 21 21:58:54 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Join me LIVE at 5PM tonight with representatives from @FEMAregion2, @SBAgov, and @nydfs as we discuss relief available to residents and businesses affected by Hurricane Ida in Queens and Nassau County.\n \nTune in at https://t.co/9X6B8tptMj","date":"Tue Sep 21 15:56:31 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Deportations were halted by the U.S. after Haiti's earthquake in 2010. Today, the Haitian people are fleeing both a natural disaster and political crisis. \n\nThis is a time for humanitarian assistance and relief, NOT deportation.\n\nhttps://t.co/pKm3L0oa3j","date":"Mon Sep 20 15:56:24 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My office is requesting public feedback be e-mailed to habitablehousing@mail.house.gov by October 16, 2021. (3/3)","date":"Thu Sep 16 20:30:12 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In response to the tragic deaths of 11 New Yorkers who drowned in their basement apartments when Hurricane Ida inundated the City, I released a discussion draft of legislation - the Habitable Housing Conversion Pilot Program Act of 2021. (1/3)","date":"Thu Sep 16 20:30:11 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The discussion draft expands FHA’s Rehab Program to cover financing of improvements to basement rental units of owner-occupied homes. Read more at https://t.co/Oxz8f1O3Q9 (2/3)","date":"Thu Sep 16 20:30:11 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"May those observing #YomKippur have an easy and meaningful fast! https://t.co/wQTLYxgW5O","date":"Thu Sep 16 15:27:34 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy #HispanicHeritageMonth! This month we recognize the history, heritage, accomplishments, and community of Hispanic Americans. Thank you to all Hispanic Americans who contribute every day to this country.","date":"Wed Sep 15 18:25:55 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Join me TONIGHT at 6PM with @NYCSchools' Queens South Executive Superintendent Dr. Mauricière de Govia, for Congressional and district updates, and a conversation on COVID-19 masks and testing protocols and safety measures in NYC schools at https://t.co/9X6B8t7SUL","date":"Tue Sep 14 18:52:54 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Glad I still blend in with the cool kids at Subway. See you on TikTok 💁🏾‍♂️\n\nWishing all the new interns a great semester on the Hill!","date":"Tue Sep 14 17:10:04 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Watch @HouseForeign LIVE to hear from \n@SecBlinken about humanitarian concerns, refugee processing and resettlement, and P-2 status updates in #Afghanistan. https://t.co/xFD6nVKxin","date":"Mon Sep 13 18:15:36 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"On the 20th anniversary we will remember the tragedy, but we will also stand stronger together as a united country. While #WeRemember let us also stay faithful and hopeful for the future of this nation. (4/4)","date":"Sat Sep 11 13:18:00 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, we commemorate the 20th anniversary of the terrorist attacks on September 11th, 2001. For many New Yorkers it seems hard to believe that it’s been two decades because we can remember the day so clearly. (1/4)","date":"Sat Sep 11 13:17:59 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I still remember the immediate sense of shock and pain I felt trying to process as it was still happening. The dust and smoke that filled the air throughout NYC for days still haunts me. It’s a day I haven’t, nor will I ever forget – and neither will this country. (2/4)","date":"Sat Sep 11 13:17:59 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We will always remember the lives that were lost on September 11th, 2001 and the heroic contributions of our healthcare workers, first responders – @FDNY and @NYPD.  As well as the taxi drivers and @twulocal100 workers who made sure people got home safely. (3/4)","date":"Sat Sep 11 13:17:59 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"For more information and additional locations you can go to https://t.co/rbyrjZbZtS or call 1-800-621-3362 or 1-800-462-7585 TTY. (4/4)","date":"Thu Sep 09 23:48:04 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"For Queens residents, the following Disaster Recovery Center will be open from 8 a.m. to 7 p.m. daily until further notice: \n\nQueens College, Student Union - 152-45 Melbourne Ave, Flushing, NY 11367 (3/4)","date":"Thu Sep 09 23:48:04 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today @JacksonLeeTX18 and I visited Hurricane #Ida survivors in Hollis and discussed relief efforts with @FEMA officials. \n\nBusinesses and residents need relief immediately and we need to be prepared for the next storm. We simply cannot wait another day. (1/4) https://t.co/5CcL6e57b5","date":"Thu Sep 09 23:48:03 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@GovKathuHochul &amp; @FEMA announced NYers who were impacted by Ida’s devastating floods and storm damage can now receive in-person, one-on-one assistance with professionals equipped to assist in the recovery process. (2/4)","date":"Thu Sep 09 23:48:03 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I commend @GovKathyHochul’s nomination of Adrienne Harris as Superintendent of @NYDFS. Ms. Harris has a strong history of protecting consumers and brings with her a wealth of knowledge and experience that will be critical to the economic growth of NY.","date":"Thu Sep 09 15:17:58 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"To my colleagues concerned about the price tag of reconciliation: inequality has cost us more. This is a rare opportunity for us to transform this economy. \n\nhttps://t.co/EXhapNILDY","date":"Thu Sep 09 11:58:34 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I’m in Queens today with @POTUS and my colleagues in the NYC Delegation as we work on recovery efforts from #Ida \n\nResidents and businesses in affected areas can apply for help at https://t.co/RcsqxTWPXm or call 800-621-3362 https://t.co/Sd0KdIP6hT","date":"Tue Sep 07 21:40:41 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Wishing all those who celebrate #RoshHashanah a happy, healthy, and peaceful new year!","date":"Mon Sep 06 23:39:46 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy #LaborDay! American workers are the backbone of our country and today we remember all who have fought for workers’ rights.","date":"Mon Sep 06 18:30:01 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"For residents in the district that can avoid travel for now, please do. If you and your family need assistance, please call my district office at 718-725-6000 (4/4)","date":"Thu Sep 02 15:29:04 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My 3.8M request to address Southeast Queens flooding that was approved by @TransportDems should be included in the reconciliation package. Queens cannot wait any longer - we need action NOW. (3/4)","date":"Thu Sep 02 15:29:03 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Working w/ @GovKathyHochul @SenSchumer, @NYCMayor and @DRichardsQNS to address last night’s flooding and future flooding issues. (2/4) https://t.co/5H8OORNzEd","date":"Thu Sep 02 15:29:03 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My condolences and prayers to the victims of last night’s storm and their families. (1/4)","date":"Thu Sep 02 15:29:01 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My priority as @HouseForeign Chair is to make sure we keep our word to safely remove every American citizen and ally out of Afghanistan.\n\nCc:  @HallieOnMSNBC https://t.co/ukKrJ7m7Df","date":"Wed Aug 18 16:30:43 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"LIVE on @CNN right now discussing the most recent events in Afghanistan.","date":"Mon Aug 16 00:12:21 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I’ll be on MSNBC’s #PoliticsNation with @TheRevAl to discuss the developing situation in Afghanistan momentarily.","date":"Sun Aug 15 21:44:58 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My prayers are with the people of Haiti as they again face tremendous tragedy as a result of a devastating earthquake. We must be ready to provide support and relief.","date":"Sat Aug 14 16:01:50 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Nonetheless, let us not overlook this historic moment. As New York moves onward, it enters a new chapter welcoming its first woman governor. I look forward to working with Lieutenant Governor Kathy Hochul as we continue to rebuild New York and fight COVID-19. (2/2)","date":"Tue Aug 10 20:52:40 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It was in the best interest of New Yorkers for Governor Cuomo to resign. New York’s focus should be addressing the challenges and recovery the state is facing against COVID-19. (1/2)","date":"Tue Aug 10 20:52:40 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My statement on @SECGov's approval for new board diversity standards and disclosures: https://t.co/p6dgXm11aT","date":"Fri Aug 06 21:59:36 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, we lost one of the most courageous labor leaders. Im saddened to hear of the passing of @AFLCIO President Richard Trumka. Richard was a champion for working people across America and he will be deeply missed. My sympathies go out to his family and loved ones.","date":"Thu Aug 05 18:49:00 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@RepTomSuozzi @RepJeffries and my statement on Governor Cuomo. https://t.co/C6C2Ig01R9","date":"Tue Aug 03 17:04:45 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congratulations to @UrJaddou on becoming the first woman, and first person of Arab and Mexican decent to lead the @USCIS.","date":"Mon Aug 02 16:07:22 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy #NationalInternDay! Thank you Finn, Cassia, and Shaquille for all your hard work to help serve #NY05! https://t.co/WmgKRzeOHa","date":"Thu Jul 29 20:48:51 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"So proud of my friend @TishJames for testifying before the @SenateBanking on an issue important to many New Yorkers and Americans (3/3)","date":"Tue Jul 27 20:02:33 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Public servants devote their careers to helping Americans.  At minimum we should be helping ease their burden of student debt as the program intends. (2/3)","date":"Tue Jul 27 20:02:32 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@NewYorkStateAG is right - we need to adapt new measures to fix the Public Service Loan Forgiveness Program including to expand it to ALL federal loan borrowers who devote ten years of public service, regardless of the type of federal loan or loan repayment plan. (1/3)","date":"Tue Jul 27 20:02:32 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tonight I am back with another NY-05 Facebook Live for updates on COVID-19, the House and the district at 5PM. Hope you will join me tonight at https://t.co/9X6B8t7SUL","date":"Tue Jul 27 18:33:17 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today is difficult for many of us who were at the Capitol on January 6th especially for our brave Capitol Police Officers who defended our Capitol and are testifying today. \n\nThank you to the Commission and those testifying today. We simply cannot move forward without answers.","date":"Tue Jul 27 15:09:38 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Good luck to @TeamUSA especially  @tinacharles31 and @McdowaldCurtis from my district representing Queens, NY!","date":"Fri Jul 23 18:18:51 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I thank Qatar for its contribution to WFP, which will provide relief to the worst humanitarian crisis in the world. This is an important step in support of regional peace and security that will save many lives.","date":"Thu Jul 22 20:34:49 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Wishing everyone celebrating a Happy Eid today! All the best to you and your family #EidMubarak  #EidAlAdha https://t.co/ouf10xOLpq","date":"Tue Jul 20 16:30:33 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It’s been one year since we lost a leader, activist, and my dear friend, John Lewis, but his legacy still lives on. \n\nWe will continue to honor his memory each and every day. https://t.co/aVt7eROBSF","date":"Sat Jul 17 20:08:25 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"MDIs &amp; CDFIs  play a critical role in advancing racial equity in banking and supporting their longevity should be an important part of the DOJ’s bank merger review. (5/5)","date":"Fri Jul 09 17:58:14 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The DOJ should also consider coordinating with state banking regulators as they were the first to adopt antitrust laws &amp; have a unique perspective on the local outcomes of bank mergers. (3/5)","date":"Fri Jul 09 17:58:14 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As @TheJusticeDept considers this new directive, I hope there’s sufficient coordination with the federal banking regulators especially the Federal Reserve which is considering an overhaul of its Community Reinvestment Act framework. (2/5)","date":"Fri Jul 09 17:58:14 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Lastly, the DOJ should closely examine bank mergers’ impact on small community-focused institutions including Minority Depository Institutions and Community Development Financial Institutions. (4/5)","date":"Fri Jul 09 17:58:14 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The @WhiteHouse’s announced effort to promote competition and better scrutinize mergers, especially in the banking sector, is welcomed news. (1/5)","date":"Fri Jul 09 17:58:13 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today marks the birth of American independence, borne of the revolutionary conviction that all men are created equal. Today we celebrate those ideals and all those who work tirelessly for this nation to live up to them. #Happy4th","date":"Sun Jul 04 14:04:10 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@HouseDemocrats just passed the #INVESTAct which includes my requests for funding towards the Van Wyck Expressway Access Improvement to JFK &amp; for funding to address flooding in SE Queens. Completion of these projects will be a key component to an equitable recovery in my district","date":"Thu Jul 01 16:28:43 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I have always been a champion for LGBTQI+ rights, which is why I held the first @HouseForeign full committee hearing on advancing the human rights of LGBTQI+ individuals abroad. (3/4)","date":"Mon Jun 28 15:15:49 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"All people should be treated equally, regardless of who they are or who they love. This month, we recognize and celebrate our LGBTQI+ community and the challenges they have overcome and are still overcoming. Happy #PrideMonth! (4/4)","date":"Mon Jun 28 15:15:49 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"During #PrideMonth and every other month we must recognize that LGBTQI+ rights are civil rights and now is the time to celebrate and advance #LGBTQI+ issues. (1/4) https://t.co/723OVwXqaK","date":"Mon Jun 28 15:15:48 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"LGBTQI+ rights are human rights which is why the House passed the #EqualityAct. It is long overdue for the Senate to do the same. (2/4)","date":"Mon Jun 28 15:15:48 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This June, we celebrate #CaribbeanAmericanHeritageMonth and the contributions of Caribbean immigrants to the US. My home district of Southeast Queens has many Caribbean Americans, and I am grateful for the experiences and diversity they bring to the community and this country.","date":"Mon Jun 21 18:48:00 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Wishing all the dads out there a happy #FathersDay!","date":"Sun Jun 20 18:38:57 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy #Juneteenth! Today we reflect on those formerly enslaved who experienced freedom for the first time, while continuing to dismantle the remnants and legacy of America's original sin. https://t.co/puhQckb1YI","date":"Sat Jun 19 17:48:08 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I thank @SecFudge for taking the bold move to assist first time homebuyers who have student debt to better access FHA’s insurance program.  Student loan debt &amp; high down-payments have been significant barriers to homeownership for many young people of color.","date":"Fri Jun 18 12:26:15 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Icing on the cake? @Usher was there! https://t.co/oVWnQCzGy1","date":"Fri Jun 18 00:01:28 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Glad to be at the White House today with my colleagues to witness the history of #Juneteenth becoming a federal holiday. While we commemorate Black freedom know that there is still work to be done. https://t.co/TRfjJh1kII","date":"Fri Jun 18 00:01:27 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The House just passed HR 1187, which includes my Board Diversity Amendment with @RepMaloney and @RepRitchie.\n\nAs we build back better, holding public companies accountable for their public commitments to diversity will be a necessary step toward closing various wealth gaps.","date":"Wed Jun 16 22:16:51 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thanks to New Yorkers doing their part and getting vaccinated, NY is BACK!\n\nI still encourage those who haven’t - to get vaccinated as soon as you can.","date":"Wed Jun 16 13:50:04 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I join @VP Harris, @RepMaxineWaters, and @MarkWarner in excitement for the initial release of funding to 863 community development financial institutions, including a number of NY entities that serve my district like the Greater Jamaica Local Development Company","date":"Tue Jun 15 21:33:13 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"On DACA's 9th anniversary today, let’s recommit to granting a path to citizenship for the dreamers who’ve only ever known the U.S. as home, as well as TPS holders who I will continue to advocate for as Chair of @HouseForeign.","date":"Tue Jun 15 17:01:11 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It shouldn't be the case that one's pursuit of higher education causes them to miss out on one of the most reliable wealth building tools: homeownership. (3/3)","date":"Mon Jun 14 22:09:37 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My bill reforms federal guidelines to make access to low-down payment mortgages, financed through federal insurance, more open to individuals with student debt. (2/3)","date":"Mon Jun 14 22:09:37 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I introduced the Making FHA Work for Borrowers with Student Debt Act of 2021 with @RepNikema. Currently, potential homeowners with student loans face unfair barriers to obtaining a mortgage. (1/3)","date":"Mon Jun 14 22:09:36 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thanks to the hard work from our City agencies, residents and business owners in Hollis and Queens Village will experience relief from the upgraded infrastructure in their neighborhoods.","date":"Tue Jun 08 14:31:45 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Justin Wallace was a 10yr old from the Rockaways who was taken from his family entirely too soon from gun violence. I’ll be meeting with his family to share my deepest condolences. (1/2)","date":"Mon Jun 07 14:30:01 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Taking action is an imperative, and I implore my colleagues on the local level to evaluate how we can curb such violence in our communities, and I will continue to push for meaningful gun reforms on the federal level. (2/2)","date":"Mon Jun 07 14:30:01 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This #MemorialDay, we remember the immeasurable sacrifices of our country’s service members. May they rest in peace, and may we never forget them.","date":"Mon May 31 22:22:07 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Exactly one year ago, the world witnessed the murder of George Floyd as a police officer knelt on his neck.\n\nWe have lost too many Black lives to police brutality and we must continue the fight for the #JusticeinPolicing Act to make significant reforms to how we enforce the law.","date":"Tue May 25 14:32:59 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, my Debt Collection Practices Harmonization Act, which I authored to curb certain industry abuses, passed through a larger package of bills to strengthen #DebtCollectionProtection policies. I look forward to the passage of this important legislation in the Senate.","date":"Thu May 13 23:05:34 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Sending my warm regards to Muslims in my family and around the world celebrating Eid al-Fitr and marking the end of Ramadan. Wishing you peace and health. Eid Mubarak! https://t.co/YHeq6ajSXV","date":"Thu May 13 14:44:06 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thank you @nycdca for joining me for our weekly Facebook Live to discuss the #ChildTaxCredit. \n\nFile your taxes before May 17 to make sure your family starts getting your payments ASAP.","date":"Tue May 11 21:58:12 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy #MothersDay! To all the women in our lives who selflessly pour their time and energy into their children’s lives, we thank you.","date":"Sun May 09 21:04:05 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Old and young, healthy and sick, our lives are all touched by nurses’ selfless work. During the pandemic especially, nurses have risked their lives to protect ours. Nurses - I can’t thank you enough for all you do. Happy #NationalNursesDay!","date":"Thu May 06 16:50:44 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@SergioMassa @HouseForeign Always a pleasure to engage in inter-parliamentary dialogue with @SergioMassa, especially now as our hemisphere recovers from Covid-19. It is imperative we get everyone at the table to find a sustainable, long-term solution.","date":"Wed May 05 23:14:51 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy Asian American Pacific Islander Heritage Month! Let's celebrate the invaluable economic, cultural, and historical contributions Asian Americans and Pacific Islanders make in our rich and diverse community. #AAPIHM","date":"Tue May 04 20:07:56 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It's not a surprise: strong speech by a strong President. And similarly not surprising are two strong women at the helm that are equally as strong, guiding our country to a better tomorrow #StateOfTheUnion","date":"Thu Apr 29 02:27:13 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As Biden mentioned, our war on immigration is exhausted.  And in fact, it's misguided given that immigrants are inextricably interwoven within the fabric of this nation.","date":"Thu Apr 29 02:24:30 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"2 million women have dropped out of the workforce during the pandemic. The American Jobs Plan will provide the support people need to get back into the workforce. #StateOfTheUnion","date":"Thu Apr 29 01:28:15 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tonight was the first time we heard “Madam Vice President” during a #PresidentialAddress I’m honored to be here at the Capitol for this historical moment https://t.co/PMAt9ixGgy","date":"Thu Apr 29 01:13:52 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I was saddened and disappointed to learn of the senseless attack on a member of our community in Elmont. This act of violence is disturbing and unacceptable. I wish Nafiah a quick and complete recovery. https://t.co/SzjGm2tu1T","date":"Fri Apr 23 21:23:27 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I voted YES. It’s time for #DCStatehood!","date":"Thu Apr 22 16:38:00 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy #EarthDay! As a global community, we have a responsibility to one another. Climate change disproportionately impacts countries which produce the least emissions. As chair of @HouseForeign, I’ll continue to fight for a sustainable future for all.","date":"Thu Apr 22 15:20:18 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"While justice was served by this verdict, that does not absolve Congress of its duty to pass meaningful police accountability legislation.","date":"Tue Apr 20 22:03:45 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Robust federal investments in affordable public housing made a difference in my life and is the reason I'm a Member of Congress today. We can and should do more to reinvest in affordable and resilient housing. https://t.co/fsWdJIO1i4","date":"Wed Apr 14 21:25:40 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Good Evening and to all my Muslim friends and neighbors - Ramadan Mubarak. From my family to yours, I wish you peace and joy. https://t.co/q5baaY2w27","date":"Tue Apr 13 00:29:58 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"At last month's hearing, a bipartisan panel agreed that June's referendum would not be legitimate or helpful. Witnesses said the proposed referendum violated the Haitian Constitution &amp; was an attempt to consolidate power in the hands of the executive. 2/2 https://t.co/bGcLgim2kG","date":"Mon Apr 12 21:12:29 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The current Haitian government lacks credibility to hold a constitutional referendum, it has done nothing to include civil society and the Haitian Parliament in the draft process. (1/2)","date":"Mon Apr 12 21:12:28 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I stand with my constituents and the global Jewish community in remembering the horrors of the Holocaust which claimed 6 million Jewish lives, and recommit myself to make certain such an atrocity will never happen again. #YomHaShoah #WeRemember #NeverAgain","date":"Thu Apr 08 13:40:17 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"On #WorldHealthDay we recognize the importance of public health. As Chair of @HouseForeign, I’ll continue to fight for our global community’s well-being.","date":"Wed Apr 07 18:18:13 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I write with a heavy heart. Rep. Alcee Hastings was a true public servant, an incredible fighter for civil rights and an even better friend. Sending my condolences and prayers to his family. May he rest in power.","date":"Tue Apr 06 16:34:02 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"From my family to yours, I hope you all have a Happy Easter and God bless!","date":"Sun Apr 04 23:12:00 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Sadly, we have lost another Capitol Police officer in the line of duty. I’m sending my sincere condolences and prayers to the family and loved ones of the Capitol Police officer that was killed earlier today. I am praying for a full recovery for the officer that was wounded.","date":"Fri Apr 02 20:44:23 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"NY-5 is among the most diverse in the nation, and Asian Americans &amp; Pacific Islanders are an invaluable part of our rich and diverse community. Today, they face senseless racial violence &amp; discrimination. I proudly stand with my brothers and sisters in the fight to #StopAsianHate https://t.co/CJDz7TUcrW","date":"Thu Apr 01 22:24:42 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Along with several of my colleagues from the NY Delegation, I am proud to reintroduce legislation to establish the African Burial Ground Museum in NYC.\n \nThe resilience of enslaved Africans and their descendants should be commemorated, and their plight never forgotten. https://t.co/2wlUXqaYuK","date":"Thu Apr 01 15:07:22 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I'm proud to reintroduce a bill w/ my NYC delegation colleagues that helps relieve the burdens exacerbated by the pandemic on thousands of taxi drivers. By not considering debt forgiveness they receive as taxable income, we’ll be able to save these drivers from a debt trap. https://t.co/QPwG6BHshJ","date":"Fri Mar 19 20:07:08 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Irish Americans have made an everlasting impact on New York City.   \n\nWishing the Irish people a happy #StPatricksDay!","date":"Wed Mar 17 22:47:40 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Last week, my friend and colleague @RepGraceMeng reintroduced the COVID-19 Hate Crimes Act, which addresses the hate and bigotry Asian Americans are facing. I’m proud to stand with her and co-sponsor this legislation and encourage my other colleagues to do the same. (2/2)","date":"Wed Mar 17 16:40:09 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Sending my condolences to the families and loved ones of the eight victims who died in last night’s shootings.\n\nDuring the pandemic, senseless hate crimes against Asian Americans have risen across the nation - even right here in Queens.\n\nThese acts of violence must stop. (1/2)","date":"Wed Mar 17 16:40:08 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Great to have you and I know folks appreciated the update on the JFK Redevelopment Program. \n\nIf anyone missed yesterday’s Facebook Live, you can view it here:\n\nhttps://t.co/nnyaR1FQ2w\n\nTune in every Tuesday at 5PM!","date":"Wed Mar 17 12:44:09 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My statement on Governor Cuomo: https://t.co/McLyFGg8YB","date":"Fri Mar 12 23:06:32 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"At the @WhiteHouse for the ceremonial signing of the American Rescue Plan. This landmark legislation helps American families, businesses and communities as we put an end to this deadly virus and ensure an equitable recovery. https://t.co/KbPTiquINY","date":"Fri Mar 12 19:45:35 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Last night, the House passed the Protecting the Right to Organize (PRO) Act. After decades of declining union membership across the country, this legislation will empower workers to organize and advocate for their rights.\nhttps://t.co/nXZXeQlp9Y","date":"Wed Mar 10 18:04:43 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As we remember this turning point in the civil rights movement, I urge my colleagues to pass the #JohnLewisVotingRightsAct to honor my late friend and hundreds of others who marched for voting rights in Selma.","date":"Mon Mar 08 20:13:02 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My full statement on the future of St. John’s Episcopal Hospital in Far Rockaway. https://t.co/6Q4Um1tavi","date":"Fri Mar 05 22:03:34 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My colleagues and I will continue to fight for a long-term solution to address the health care demands that are growing in Far Rockaway. https://t.co/Ta2V621eDe","date":"Fri Mar 05 21:56:17 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As a champion in Congress for greater board diversity at public companies, and author of HR 1277, I'm glad to see this. Boards shouldn't be ivory towers but rather reflective of the American populace, in ALL its racial and background diversity. \n\nhttps://t.co/3yPfpAHHXl","date":"Thu Mar 04 13:54:48 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tonight, the House passed the George Floyd Justice in Policing Act.  As Chair of @HouseForeign, I reminded his family - after the vote - that Mr. Floyd truly changed the world, like his daughter said with grace last year. https://t.co/wW2i4sk9kc","date":"Thu Mar 04 02:52:01 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@TheRockawayWave I’m going to work with the state legislators and St. John’s Hospital to push back on the proposal to prevent it from happening.","date":"Wed Mar 03 19:48:21 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My full statement on St. John’s Episcopal Hospital in Far Rockaway https://t.co/qd30fqNnxY","date":"Wed Mar 03 17:27:02 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@brigidbergin @DrichardsQns St. John’s will not be able to serve the neighborhood if another emergency comes along with only the proposed 15 beds. To downsize the hospital will only enhance the racial disparities that run rampant in our health care system, and not better serve the community.","date":"Wed Mar 03 17:19:58 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I'm saddened to hear we have lost an incredible and inspirational figure. Vernon Jordan will forever be remembered for his contributions to civil rights, as well as his business prowess. My condolences to his family and loved ones. May God Bless his soul.\n\nhttps://t.co/NOaUvztFj8","date":"Tue Mar 02 15:40:36 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, the MTA launched a pilot program to enhance access to mass vaccination sites. Getting vaccinated is one of the best ways you can protect yourself and your community against COVID-19. \n\nCheck your eligibility and book an appointment at https://t.co/UhmOlmH9f2.","date":"Mon Mar 01 20:11:08 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If history books are honest, they will convey that forced family separation was not new to Trump, but rather the rearing of a public policy as old as Black history in America.\n \nhttps://t.co/EYr6dDf0OJ","date":"Fri Feb 26 19:54:31 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, I reintroduced the American Dream Down Payment Act with my colleagues @RepAlGreen and @RepBeatty. By boosting the path for Black and Brown home ownership, this bill will also help close the stubborn and pernicious racial wealth gap. https://t.co/aVed1ueEdb","date":"Thu Feb 25 21:43:50 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Queens residents, have you checked your vaccine eligibility? A vaccination site under FEMA recently opened at York College. #VaccinateNY https://t.co/UhmOlmH9f2","date":"Thu Feb 25 17:15:09 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"REMINDER: Vaccine appointments began today at York College. Eligible Southeast Queens residents can register online. #VaccinateNY","date":"Wed Feb 24 21:17:14 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Glad to reintroduce the Improving Corporate Governance through Diversity Act with my colleagues @senatorMenendez and @repMaloney. Robust data is a necessary step toward ensuring diversity, equity and inclusion. I implore both Chambers to pursue that aim by passing this bill. https://t.co/H1YC9TKbOe","date":"Tue Feb 23 19:43:53 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Starting TOMORROW eligible Southeast Queens residents can make vaccine appointments at York College. Vaccinations will begin Wednesday, February 24th. #VaccinateNY https://t.co/myXvIIIwkI","date":"Fri Feb 19 22:43:55 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It was a great pleasure meeting with Ambassador @giladerdan1 today, discussing the importance of the US-Israel relationship, addressing our shared challenges, and the promotion of peace in the region. I look forward to continuing that work together.","date":"Thu Feb 18 22:27:38 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I look forward to discussing what happened with #Robinhood and #GameStop at today’s hearing with my colleagues from @FSCDems to ensure that not only are our markets fair and transparent but that investors are also protected. https://t.co/Jc8KKyYbzV","date":"Thu Feb 18 17:26:26 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I appreciate your tuning in. Being able to communicate directly with the people of NY's 5th district through these weekly virtual town halls, providing updates and answering questions, is an opportunity I've greatly enjoyed. \n\nTalk to you next Tuesday at 5pm!","date":"Wed Feb 17 01:23:56 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The excellent case made by the impeachment managers is irrefutable. \n\nThose Senators that voted to acquit Donald Trump on technicalities which hold no legal water have set a dangerous precedent and sent a dangerous message.","date":"Sat Feb 13 22:43:44 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"York college will be one of two new mass-vaccination sites opened by FEMA, providing 3,000 local vaccinations a day to local residents. I thank Gov. Cuomo and the Biden admin for working with the community to provide help where it is most needed. https://t.co/MQFceKI9B8...","date":"Wed Feb 10 23:32:46 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I co-led a letter to @SecBlinken with @RepYvetteClarke to condemn President Moïse's undemocratic actions in Haiti, urging for a Haitian-led democratic transition of power. The full text of the letter: \n\nhttps://t.co/CDGgmpM45L https://t.co/pkuriOY5TS","date":"Sat Feb 06 22:42:24 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I engaged with @AFLCIO Chief Economist @WSpriggs after some of my R colleagues on FSC argued that the COVID stimulus package is too generous. His testimony that doing too little was riskier to the economy, particularly for hard-hit communities, is absolutely correct. https://t.co/Q0E3yvsA8R","date":"Fri Feb 05 20:21:48 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It is refreshing to see a US president that not only understands the value of diplomacy, but the importance of diversity in our foreign service. Our presence abroad should be representative of all Americans. I look forward to working with the administration to rebuild State.","date":"Thu Feb 04 19:48:10 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"From Lena Horne to W.E.B. DuBois, my district has been home to some historic black leaders that made the ideals of American freedom more realized. On #BlackHistoryMonth we reflect on that history and challenge ourselves to deploy our talents to achieve a more perfect union.","date":"Tue Feb 02 03:35:48 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Agreed. The offensive dual loyalty trope insinuated by the article is unacceptable, and NBC is correct to acknowledge it was wrong to have posted it. Anne Neuberger is a professional and this administration will benefit from her expertise.","date":"Fri Jan 29 04:09:31 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As Chairman of @HouseForeign, I am committed to debating policies on their merits and respecting all positions. When anyone instead resorts to ad hominem attacks and innuendo, our foreign policy and national security suffer as a result. 2/2","date":"Thu Jan 28 18:29:47 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The racist attack on Maher Bitar is outrageous. Public servants working to make our country safer shouldn't have to endure ugly, bigoted attacks. The Biden admin reflects a diversity of backgrounds and viewpoints—a welcome change from the last 4 years. Let them do their jobs. 1/2","date":"Thu Jan 28 18:29:46 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is great news. I applaud President Biden's swift action to not only reverse the former administration's discriminatory ban, but also correct the record for anyone that was dismissed as a result of it.","date":"Mon Jan 25 20:19:08 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The only remaining ideology in the Republican party is one of retaining power. That's why everything is looked through a political prism, why the last four years were allowed to happen, and why Sen. Cornyn here can't imagine why Biden would do something just because it's right.","date":"Sun Jan 24 14:21:11 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Such a powerful moment. From Howard (HU!) to the White House. Proud to watch my Phirst Pham sister Kamala Harris be sworn in today.","date":"Thu Jan 21 03:17:15 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today's inauguration of Joe Biden &amp; Kamala Harris is significant for many reasons, not least of which is the message it sends to the world. America is not defined by the last 4 years.\n\nAs we turn the page, I'm eager to work with this administration to repair our global standing.","date":"Wed Jan 20 16:01:27 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"State and municipality assistance should’ve been above partisanship. Some of the most vital workers are being laid off because the Trump administration and Senate GOP refused to provide financial assistance to local governments. Good on Biden for prioritizing this funding.","date":"Fri Jan 15 00:37:27 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Biden is right. The increased stimulus checks not only help the economy, it helps workers who’ve lost hours due to the pandemic and gives working families who are walking a tight rope stay above water.","date":"Fri Jan 15 00:32:06 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Eager to see Biden announce his COVID stimulus package. This closes the $2 trillion gap between the HEROES act Congress passed last summer, and the stimulus bill we were able to negotiate under Trump and McConnell. Refreshing to see an executive take this pandemic seriously.","date":"Fri Jan 15 00:21:15 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Some Republicans are admitting what he did was impeachable, yet are unwilling to impeach. If they want our country to heal, instead of going to Biden, they should march to the WH in unison and say the gig is up, it is time to resign. Then there won’t be a need to impeach.","date":"Sun Jan 10 18:12:18 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Healing is not incompatible with justice. Can there be healing without it?\n\nRepublican’s have long enabled Trump’s most dangerous tendencies by never setting consequences. They should be leading the call for his removal after Wednesday, not obstructing it.\nhttps://t.co/GQee0pjJbU","date":"Sun Jan 10 18:12:18 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is incredibly disturbing. City law explicitly prohibits officers of the law from placing their knee on someone’s neck, or otherwise blocking the airway. I applaud @QueensDAKatz for launching an investigation.","date":"Fri Jan 08 22:34:40 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If Trump can’t be trusted with Twitter, he shouldn’t be trusted with the power of the Oval Office, even with what little time he has remaining at 1600. One way or another, he must step down or be removed.","date":"Thu Jan 07 15:12:12 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My morning interview with Pix11 regarding yesterday's events: https://t.co/lZwcz8iwFv","date":"Thu Jan 07 15:05:08 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"However, our institutions have ultimately held up, even in a moment of insurrection. I hope we can prove in a bipartisan way that these last four years were only an aberration. (2/2)","date":"Thu Jan 07 14:32:22 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There will be significant ramifications to US credibility on the world stage after yesterday’s events. While our allies mourn, authoritarian regimes watching the American model of democracy falter are rejoicing. (1/2)\nhttps://t.co/lkNQ3K0NEx","date":"Thu Jan 07 14:32:22 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Update: I am safe and sheltered, but utterly devastated by today’s events.","date":"Wed Jan 06 21:47:05 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The world is watching as the greatest democracy braces against an attempted coup, stirred by its leader who’d rather watch the country burn than transition power. \n\nOur ability to advocate for democracy around the world will be significantly hurt after this tragic day in America.","date":"Wed Jan 06 20:32:47 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump should immediately condemn Russia. He won’t. \n\nHe’s ignored the Kremlin’s meddling in our 2016 election, their destabilizing actions around the world, bounties on our troops, and I expect he’ll conclude his presidency subserviently silent on this massive cyber hack.","date":"Tue Jan 05 22:55:31 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My full statement regarding the serious and disturbing allegations made against Milan Taylor:\n\nhttps://t.co/8F5mFw4k5I","date":"Tue Jan 05 01:48:01 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Honored to be sworn in for the #117thCongress. https://t.co/4QBkQdjegl","date":"Mon Jan 04 02:18:13 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"However fruitless these attempts are, America's ability to stand up for democracy around the world is tarnished when its president is actively trying to overturn the results of our own free and fair election.","date":"Sun Jan 03 18:39:57 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"... getting nothing in return for the concessions Trump gave to N Korea. Why is Pompeo listing their foreign policy failures like a greatest hits list? #SoundAndFurySignifyingNothing.","date":"Sat Jan 02 20:39:49 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"So according to the GOP, lawsuits are \"frivolous\" if they're filed by workers exposed to COVID by reckless corporations, but totally fine when it's Republicans trying to overthrow an election.\n \nMaybe its democracy that could use legal protection. https://t.co/eFJaQXLD4t","date":"Sat Jan 02 17:00:18 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Heartbroken by this news. My deepest condolences to my colleague @RepRaskin and his family. No family should have to suffer such a loss.","date":"Fri Jan 01 03:54:07 +0000 2021","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Democrats have fought for larger stimulus checks for months. Time for McConnell to do right by the American people and hold a vote on increasing the stimulus checks included in the COVID relief bill.","date":"Mon Dec 28 23:11:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump should have used the Defense Production Act months ago. Glad to see a return leadership in the White House.","date":"Mon Dec 28 18:31:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Wishing a happy #Kwanzaa  to all who are celebrating. https://t.co/erekeJI8p5","date":"Sat Dec 26 15:22:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"https://t.co/zAzwnrrxwF","date":"Sat Dec 26 15:21:09 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Merry Christmas!🎁 https://t.co/c4emxdTfy1","date":"Fri Dec 25 20:15:28 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Just horrible. Hoping no one has been injured.","date":"Fri Dec 25 15:06:49 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Just so we’re clear on who is for what, Republicans blocked the $2,000 stimulus checks on Christmas Eve.\n\nIf Trump wasn’t just bloviating about wanting to get more relief in the bill, he should talk to the members of his party and get them on board. https://t.co/QrrCLcpk4U","date":"Thu Dec 24 16:14:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Nothing about this is surprising, not from this president. He ends his presidency just as he started it, like a two-bit mob boss and con man.","date":"Thu Dec 24 01:01:06 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Being a human rights lawyer and exposing corruption is not a crime. The arrest of @nickopiyo by the Ugandan government is straight out of the authoritarian playbook, and undermines free and fair elections.","date":"Wed Dec 23 16:52:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I released a joint statement with Chairman @RepSires and @RepAndyLevin regarding the situation in Haiti:\n\nhttps://t.co/qVgqgFQ0qk https://t.co/9rHbF1fjWI","date":"Tue Dec 22 23:19:24 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The emperor isn’t used to being told he has no clothes.","date":"Tue Dec 22 16:19:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Opposition members in Belarus have demonstrated incredible bravery. The US must continue making clear our support of their inspiring fight for democracy and human rights. The crackdown on protestors must end immediately. #StandWithBelarus #PeoplesTribunal","date":"Tue Dec 22 01:23:51 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Moscow is going to do as Moscow does. Other adversaries will probe as well. We need to be better prepared to rebuff digital espionage. We can’t afford to be behind the curve. (2/2)","date":"Mon Dec 21 17:54:14 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump may have lowered our guard on Russian aggression, but our cyber vulnerabilities go beyond his lack of leadership. I plan on holding hearings in HFAC to identify how we can better work with our allies to strengthen our cyber defenses. (1/2)","date":"Mon Dec 21 17:54:14 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There is no reason to revere in our nation’s capital those who fought to tear our union apart over the preservation of slavery. Glad to see this edifice to the confederacy removed.","date":"Mon Dec 21 17:34:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is a microcosm of their general COVID policy. Hide it, undercount it, and let it spiral out of control.","date":"Sat Dec 19 20:49:23 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I got my first shot. My trust has always been in science and physicians, and they’ve determined that the vaccine is safe and effective. \n\nI know there’s skepticism, especially in communities like mine, but this is how we turn the page on the pandemic and return to normal. https://t.co/j7WTi5oPG7","date":"Sat Dec 19 16:44:43 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Unemployment claims are rising. People can't afford their rent. Businesses are closing down. \n\nIt’s past time for Congress to pass a COVID relief bill that provides enhanced UI, stimulus checks and funding for states &amp; localities. American families can’t afford to wait.","date":"Thu Dec 17 20:43:31 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Infrastructure will be a significant focus of the next Congress and next administration. Good to know someone as bright and determined as @PeteButtigieg is being asked to lead DOT.","date":"Tue Dec 15 20:34:33 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is a historic moment. Glad that that there’s finally light at the end of the tunnel, especially for heroes like Sandra who’ve been on the front lines of this pandemic.","date":"Mon Dec 14 14:34:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We have lost too much time under the Trump administration in the fight against climate change. This five year anniversary of the the #ParisAgreement marks a moment of opportunity to re-honor that commitment and once again lead as a global climate champion. 🌎","date":"Sat Dec 12 19:10:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Susan is a brilliant and extremely competent individual who will no doubt be exceptional leading our domestic policy. Congratulations @AmbassadorRice! We will be well served with you on the team.","date":"Fri Dec 11 01:21:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"106 Republican Members openly abetting in an attempt to overturn the will of voters.\n\nThere was a time where democracy itself wasn't a partisan issue. History will not not look back kindly on this.","date":"Thu Dec 10 23:27:05 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"To everyone around the world lighting the first candle, I wish you and your loved ones a #HappyHanukkah. May your celebrations be peaceful and full of joy. https://t.co/93e9yCUY3T","date":"Thu Dec 10 22:16:38 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This #HumanRightsDay comes on the dawn of a new US administration, one that is committed to promoting human rights around the world. But our ability to champion those rights requires a moral authority gained only by practicing at home what we preach abroad. Let's do better.","date":"Thu Dec 10 15:53:28 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"First they tried to outright block the transition, now they're trying to slow it down where the can't shut the door entirely. This is dangerous, particularly at the State Department where Biden's team needs access and confidentiality. \nhttps://t.co/M6k7waDURE","date":"Wed Dec 09 21:33:37 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The first black commander of CENTCOM, General Lloyd Austin is set to once again make history as the first Defense Secretary. \n\nWith Xavier Becerra announced to HHS, it has been a great week for diversity in the coming administration.","date":"Tue Dec 08 15:32:47 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"They have mismanaged the pandemic at every critical juncture, downplaying the severity, not producing PPE and ventilators, not ramping up testing, not issuing guidance. \n\nNow we’re learning they passed on more life saving vaccines. This is their “America first”?","date":"Tue Dec 08 13:56:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is fantastic news and a major victory in the fight to protect Dreamers. We are long overdue for restoring sanity to our immigration policy, and there will be more work to be done with the Biden-Harris administration. #HereToStay","date":"Fri Dec 04 23:54:30 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Standing alongside my brothers for the 114th Founders Day of Alpha Phi Alpha, with three of us now proudly serving as Chairs of Congressional committees. #AlphaPhiAlpha https://t.co/jpJD6Bslvi","date":"Fri Dec 04 23:40:49 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I’m extremely honored to be elected Chair of the House Foreign Affairs Committee. The new era of US foreign policy will not be just a return to normal, but an opportunity to broaden the committee focus and forge new coalitions to address global challenges.\nhttps://t.co/oY0hxyHJ05","date":"Thu Dec 03 22:29:06 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This deal is an important step. Access is critical in Ethiopia as the Tigray conflict has stopped both humanitarian aid from going in and information from coming out. What we have learned is already very concerning.","date":"Wed Dec 02 17:35:01 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I applaud @Nasdaq for this proposal. As the sponsor of the Corporate Diversity bill in the House, which would require companies to disclose the diversity of their boards and C-suites, I've long argued that more diversity isn't just the right thing to do, it's good business.","date":"Wed Dec 02 01:37:42 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We have made considerable progress in the fight to eradicate #AIDS since @PEPFAR and the @GlobalFund were founded, but coronavirus this year has made the global response more difficult. Congress must allocate more funding and not allow a resurgence of this disease. #WorldAIDSDay","date":"Tue Dec 01 19:40:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The assassination is a reckless escalation that will only undermine Biden’s ability to re-establish an agreement with Iran. I’m concerned that was the intention. \n\nThis will do little to curb Iran’s push for nuclear capabilities, but will derail the diplomatic pathway to peace.","date":"Fri Nov 27 23:42:39 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There’s always a human cost to the insane conspiracies churned out by right wing media and championed by those in power like Trump. Imran and his family suffered so some Rs could have another partisan witch hunt. That’s the cost of their brand of politics. https://t.co/TESsuBqn5j","date":"Thu Nov 26 03:54:58 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This year, it’s the turkey that’ll need to pardon the president.","date":"Wed Nov 25 02:09:33 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"With the passing of David Dinkins, NYC’s first Black Mayor, we have lost a giant. He carried himself with kindness and compassion, guiding our city with a vision towards inclusion and justice. \n\nHe was a trailblazer and will be dearly missed. Rest in Power, my @HowardU brother.","date":"Tue Nov 24 20:14:04 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Big congratulations to Rep. @GerryConnolly on being voted President of NATO PA! @natopapress will be well served with you at the helm.","date":"Mon Nov 23 20:39:57 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Any of the candidates on President-elect Biden’s shortlist would have been excellent choices, but Tony Blinken will be a fantastic Secretary of State. I look forward to working together on restoring U.S. foreign policy and diplomacy.","date":"Mon Nov 23 16:32:17 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Trump Administration wants to FORCE banks to lend to oil and gun companies.  The OCC has been a nonstop disaster under President Trump, systematically siding against main street and being on the wrong side of every important issue.  January 20 can’t come soon enough.","date":"Fri Nov 20 20:29:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Trump Administration has failed on controlling the pandemic, costing not only lives but historic job losses and financial insecurity.  Today, they pulled the rug out from under the economy.  Beyond incompetent, this is reckless. https://t.co/Xjf7y5kw1P","date":"Fri Nov 20 17:41:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Beyond being nakedly partisan, it is extremely dangerous to self-sabotage US foreign policy on the way out the door just to spite the incoming administration. Republican or Democrat, we'd all be under the same burning roof.","date":"Thu Nov 19 22:31:02 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Proud to have joined  @RepTomSuozzi, Korean Ambassador Lee Soo-hyuck, Consul General Kwon, Chairman Song, and Assembly Members Kim and Yoon in celebrating the passage of a resolution honoring the US-Korea alliance. https://t.co/FQGNOaCwxA","date":"Thu Nov 19 22:20:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today l passed a bill that would prohibit the use of federal funds for the purpose of inviting Russia back into the G7. Russia cannot have a seat at the table until it shares the democratic values &amp; respect for international law it currently undermines: https://t.co/KMnRue1ZTx https://t.co/EdfeglJ6iH","date":"Wed Nov 18 22:55:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congratulations to president-elect @sandumaiamd. I look forward to working together in strengthening our transatlantic cooperation between our nations. https://t.co/mOZg2V9k5q","date":"Mon Nov 16 22:21:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It is past time that governments reflect the people they represent, infusing new ideas and broader perspectives into leadership through diversity. The US should be leading the charge with the EU in fostering that diversity across all levels of government. https://t.co/9kgOoOMLor","date":"Mon Nov 16 21:44:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"To all celebrating the Festival of Lights, I wish you a happy #Diwali !","date":"Sat Nov 14 18:23:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It'll be a small gathering at Four Seasons Landscaping.","date":"Fri Nov 13 17:56:34 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Their choice, our bodies. That's not how this works. Wearing a mask protects others as much if not more than it protects you.","date":"Fri Nov 13 17:51:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"On this #VeteransDay, we honor all who have served in our armed forces. Though we can never fully repay the debt they are owed for their sacrifice and duty, we are forever grateful for their dedication to our nation. https://t.co/teBeMuDH7O","date":"Wed Nov 11 18:34:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This undermines the credibility of the United States to call for free and fair elections abroad, to say nothing of how destructive this is for our own democracy. This statement alone disqualifies Pompeo from Sec of State.","date":"Tue Nov 10 19:04:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Trump administration's death rattle is leaving our national security more vulnerable than it already would be during this transitionary period. I wish I could say I was surprised at how many Republicans are willing to go along with it.","date":"Tue Nov 10 18:20:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Waving goodbye to Trump like... https://t.co/8JUz6Fh2aJ","date":"Sun Nov 08 01:54:00 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Your vote matters. This is why. Immediate change for the better.","date":"Sun Nov 08 01:15:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Democracy is alive and well in the United States of America.","date":"Sat Nov 07 18:40:50 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Fitting.","date":"Sat Nov 07 18:23:04 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Howard in the (White) house. https://t.co/e79c57PduH","date":"Sat Nov 07 18:20:32 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congratulations @JoeBiden and @KamalaHarris. Our nation will be in capable hands now.","date":"Sat Nov 07 16:33:53 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Let's evict him from 1600.","date":"Fri Nov 06 09:24:20 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Never take our democracy for granted. It's been made clear that it is threatened from within. But it's this advocacy that helps keep it honest. The fight is never over.","date":"Fri Nov 06 09:17:27 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Just deserts.","date":"Fri Nov 06 08:52:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Someone just cut this liar off already.","date":"Fri Nov 06 00:01:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thank you to the people of the 5th Congressional district of New York for giving me the honor of representing you once more in Congress. It is a privilege and duty I never take lightly. Let’s keep working together.","date":"Wed Nov 04 19:08:27 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If the Trump administration had a platform or plan on managing COVID - which 9 months in they still don't - its apparently to root out anyone with any competence or public trust.","date":"Mon Nov 02 19:14:14 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"1 day. \n\n#VOTE","date":"Mon Nov 02 18:37:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congratulations to the brave people in Belarus (led by women) in their fight for freedom, liberty, and a new democratic election. This prize is just one way to keep the world’s eyes on you. @Europarl_EN \n\nhttps://t.co/SfxtniHItz","date":"Mon Nov 02 17:52:24 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Closely monitoring the election in Cote D'Ivoire and hoping for calm.","date":"Sat Oct 31 19:49:35 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Southeast Queens lost a godfather of politics last night. New York City lost a great leader last night, and our nation lost a great man. \n\nArchie Spigner will be missed dearly. May god rest his soul","date":"Fri Oct 30 14:52:32 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My colleagues @JoaquinCastrotx and @BradSherman are absolutely correct. Trump continues to deteriorate America’s ability to be an honest broker. I look forward to a Biden administration that can repair that credibility.","date":"Fri Oct 30 01:36:45 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There you have it.","date":"Mon Oct 26 15:29:30 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Queens claims Trump like Canada claims Nickelback. #PresidentialDebate","date":"Fri Oct 23 02:33:03 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Did you know no one did more for the Black community than Donald Trump? Breaking news. #PresidentialDebate2020","date":"Fri Oct 23 02:12:37 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The president just said “good” to 500+ kids screaming for the parents that were ripped from them by his administration. #PresidentialDebate2020","date":"Fri Oct 23 02:10:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trumps tax returns are around the corner, just like his healthcare plan, or his COVID one. #PresidentialDebate2020 https://t.co/5A05bhPJdq","date":"Fri Oct 23 01:35:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congratulations to Luis Arce. I look forward to a continued US-Bolivian relationship as our nations work on the issues facing our hemisphere. https://t.co/7nOQpm0G6W","date":"Wed Oct 21 19:50:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I am following closely developments in Nigeria, and am deeply troubled by reports of security forces shooting at #EndSARS protesters.  The government should de-escalate and engage the protesters constructively for a peaceful resolution.","date":"Wed Oct 21 19:49:19 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The now-regional conflict, which has already claimed hundreds of lives including civilians, is spiraling quickly. It is crucial for the US to be a continued presence in peace talks, making it clear that a new cease-fire and negotiations at the OSCE are the only course forward.","date":"Wed Oct 21 19:47:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Diplomacy. Now. Concerning to see Azerbaijan ramp up military action in Nagorno-Karabakh, and deeply concerned to see Turkey - a NATO member - help stoke the flames of a ‘frozen conflict.’ https://t.co/X5ghFBWW1y","date":"Wed Oct 21 19:47:58 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We know from reporting that the cruelty of this policy was intentional. This isn't an unintended consequence, this is the predictable outcome of an incompetent administration that thought ripping families apart would send a message.","date":"Wed Oct 21 13:34:26 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Joyce Burrows Dinkins had an exemplary life sharing her gifts, time and talent with her family and community. New York City owes a debt of gratitude to its first Black First Lady for her endless dedication &amp; life’s work. My deepest condolences to Mayor Dinkins and all her family.","date":"Fri Oct 16 00:18:00 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Don’t let this administration obstruct you from your constitutional right to be counted, and your community from receiving the federal resources it deserves. #BeCounted today before it’s too late. https://t.co/JRJZYj66Vq","date":"Thu Oct 15 17:33:47 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We've seen this song and dance. We know why Trump chose Amy Coney Barrett.","date":"Tue Oct 13 21:16:04 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The politicization of every agency under this administration is so extreme they do not even bother to hide it. What message does having a hyper political State department send to our allies? To our enemies?","date":"Fri Oct 09 18:52:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It is shameless to exploit a grieving family to laud a foreign policy that has clearly failed. The Trump administration's policy on Iran has put us all at greater risk. Their nuclear program is further today than it was when Obama left office. That is fact, Mr. Vice President.","date":"Thu Oct 08 02:03:48 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Cruelty is the feature not the bug.","date":"Wed Oct 07 00:20:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"And that's with social distancing. Trump is back to likening COVID to the flu and endangering anyone who will listen.","date":"Tue Oct 06 14:02:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I wish the President and First Lady a speedy recovery, but let this be a warning. Even POTUS, with all the rapid testing the WH has access to, can contract the virus if not careful. If we all do our part, we can turn this corner. Wear a mask. Be safe.","date":"Fri Oct 02 14:44:14 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"“I am incredibly honored to receive the Woodrow Wilson Award for Public Service... I am always mindful of the responsibility that those in public service have to promote justice and opportunity for all.”\n\nFull release: https://t.co/ot0JZRChTM","date":"Thu Oct 01 21:14:15 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"They think they can only win by cheating. Voter suppression is their core strategy.","date":"Thu Oct 01 18:45:29 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As always, Trump only means to divide, incite and dog whistle. This disgusting attack against @Ilhan is as un-American as it is vile.\n\nWe are a nation of immigrants, working collectively to realize the best potential of our country. Our diversity is our strength.","date":"Thu Oct 01 18:12:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Watch our discussion!","date":"Thu Oct 01 15:42:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Can anyone name one thing Trump said today that spoke to the issues affecting American families? The issues we face deserve more seriousness than he has ever demonstrated.","date":"Wed Sep 30 02:57:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump wants to bring democracy down with him.","date":"Wed Sep 30 02:38:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"So Trump’s climate change plan is hiring more arborists?","date":"Wed Sep 30 02:20:26 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In any other debate, asking the president whether he’d condemn white supremacy would be considered a soft ball.","date":"Wed Sep 30 02:13:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Asking Trump to behave during the debate is as hopeless as waiting for him to start acting presidential.","date":"Wed Sep 30 02:06:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"At this point just cut his mic.","date":"Wed Sep 30 01:52:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Can't overstate how dangerous it is to have a DNI sully their office by weaponizing it politically. The security of our nation rests on following accurate intelligence. Ratcliffe has shown complete disregard for that responsibility, choosing instead to be a sycophant for #45.","date":"Wed Sep 30 00:43:20 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Wishing everyone observing #YomKippur a meaningful and easy fast.","date":"Mon Sep 28 20:09:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"He is a con man, racist, liar, and a cheat. Don’t go by me, play back the video of Graham, Cruz, McCarthy and Romney in 2016. \n\nHe has proven all of them right.","date":"Mon Sep 28 00:23:31 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I co-led a letter, joined by 273 of our transatlantic allies, demanding Lukashenko immediately release political prisoners like Kalesnikava and those arrested in the spring of democratic protests in Belarus. This violent crackdown on pro-democratic protests must end. https://t.co/6xRm0NWugM","date":"Thu Sep 24 20:07:44 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is the broken system that has driven thousands across America into the streets demanding change. This is not the justice we are fighting for.","date":"Thu Sep 24 01:26:45 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We need to end the mentality that says that black talent is rare.  Talent and potential are equally distributed.  Opportunity is not.  Invest in creating opportunities and leveling the playing field and you will be overwhelmed by talented people of color. https://t.co/MS7d5IeDX7","date":"Wed Sep 23 18:07:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"He tells it like it isn't.","date":"Tue Sep 22 17:33:51 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"CDFIs, MDIs have supported low income and minority communities most devastated by COVID. But they’re disappearing at an alarming rate, leaving families and businesses vulnerable to predatory lending. Grateful for the bipartisan support for my bill to help these institutions. https://t.co/704TEFDJQg","date":"Mon Sep 21 21:06:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Says a lot that Republicans won't put aid for states and localities in their COVID relief bill but they'll let Trump twist federal agencies into playing out his inane politics, threatening funding when people need it most. \n\nThis would be funny if it wasn't downright dangerous.","date":"Mon Sep 21 18:53:42 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Ruth Bader Gingsberg was an inspiration and a titan beyond measure. With an unwavering commitment to justice, she was an unparalleled steward of civil and women’s rights. America mourns a hero tonight.","date":"Sat Sep 19 01:47:29 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"To everyone celebrating #RoshHashanah, I wish you a safe and wonderful New Year to you and yours, here in New York and across the world.","date":"Fri Sep 18 21:53:46 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The safety of school faculty and students is the prime concern right now. I stand with @UFT, our teachers and families working to make sure every precaution is met as we move forward to reopen schools in the best way for everyone.","date":"Fri Sep 18 21:14:43 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Even in a pandemic killing thousands of Americans, for Trump it’s still only about “me, me, me”","date":"Fri Sep 18 12:39:46 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This administration's focus wasn't overcoming COVID, it's focus was convincing the public the crisis wasn't happening. They allowed the pandemic to fester, and as a result we are the coronavirus capital of the world.","date":"Thu Sep 17 22:35:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There will be a tremendous amount of work in our post-Trump foreign policy to repair the extensive damage he has inflicted on American credibility and reputation.","date":"Thu Sep 17 15:42:37 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Ah yes... the Republican health care plan, always just around the corner. Their imaginary plan will be old enough to qualify for Medicare by the time they announce specifics.","date":"Wed Sep 16 18:36:50 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"(2/2) Because local governments don’t have millions sitting around, they go to financial institutions to borrow money. My bill would require banks that  profit from these settlements to release this information.","date":"Tue Sep 15 21:20:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Though there’s finally some justice for #BreonnaTaylor, something that doesn’t get enough attention is that taxpayers foot the bill in these settlements. I’ve introduced legislation (HR7261) that would bring transparency into that system.","date":"Tue Sep 15 20:50:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"On the anniversary of September 11th, we remember all the lives we lost and the selfless sacrifice of the first responders. Every New Yorker, every American remembers where they were on that day and how we as a nation united together in the aftermath of the attack. #NeverForget https://t.co/gpxXsz87Xg","date":"Fri Sep 11 15:24:10 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#BlackJewishUnity Week is an opportunity to reflect on and engage in the common objectives the Black and Jewish communities share. Thank you @AJCGlobal and @NatUrbanLeague for collaborating to host this event.","date":"Thu Sep 10 14:53:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Had the pleasure of joining Acting Israeli Consul General @IsraelNitzan and my elected colleagues at Tomchei Shabbos Queens Rosh Hashonah food distribution ahead of the Holiday celebration. Thanks to TSQ for all your generous work. https://t.co/V70CvX6eBW","date":"Thu Sep 10 14:16:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It’s like the administration is actively trying to make matters worse. There is no reason to scale back safeguards when what’s needed is more precaution and testing. Curious to see their explanation for this one... https://t.co/Vn3rehAjhs","date":"Wed Sep 09 19:56:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Again, what we find out happens behind closed doors only proves what’s been evident all along. Donald cherry-picks intelligence to suit his narrative and political interests over our nation’s best interests.","date":"Wed Sep 09 19:36:29 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump downplayed COVID, refused to lead a response, and fueled a skepticism about the virus that allowed it to spiral out of control. Countless lives have been lost, our economy's in shambles, and we have the tapes to show he knew the danger all along and did worse than nothing.","date":"Wed Sep 09 18:02:43 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Yesterday I joined @SenSchumer and my House colleagues to spell out how insufficient the Senate bill is compared to the #HeroesAct in addressing what we need to overcome this pandemic. Now they want to push it for a vote. \n\nMcConnell is bringing a watering can to a house fire. https://t.co/Qnkroy7k8s","date":"Tue Sep 08 15:22:28 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"On #LaborDay we remember the hard fought victories that secured a livable wage, a 5 day work week, family leave, and all that we sometimes take for granted. But this year let’s reflect on the many inequities highlighted by COVID and create opportunities for all American workers.","date":"Mon Sep 07 18:20:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, @RepAlGreen and I introduced the American Dream Down Payment Act. This bill would aid families by establishing tax-exempt savings accounts and help close the racial gap in home ownership rates for black and brown families. See our press release:\nhttps://t.co/mDuHGLIp4T","date":"Fri Sep 04 21:53:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The President’s comments are reprehensible but not surprising.\n\nFrom the beginning, he has said disparaging things about veterans and people with disabilities. \n\nThis President does not understand the meaning of service nor sacrifice. He is who he is.\nhttps://t.co/6DPXcBtHcy","date":"Fri Sep 04 17:20:48 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump doesn't want to heal our nation, he wants to wedge it apart and exploit that division. Never be surprised by low he will go; there is no floor and no line he won't cross. I can't help think of the victims' loved ones watching the president defend their killer.","date":"Tue Sep 01 02:11:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It is with great sadness to learn #JohnThompson has passed. A literal giant among men Coach Thompson groomed his players to not only become NBA standouts but also humanitarians. RIP Coach.","date":"Mon Aug 31 20:08:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Russia is again trying to support the Trump campaign. Meanwhile the President has repeatedly attacked our own intelligence agencies and now his admin wants to cut their Congressional briefings right before the election. Doesn’t pass the smell test.","date":"Mon Aug 31 16:54:26 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#ChadwickBoseman is gone way too soon, but he left us with so much.  We will forever be uplifted by his talent and inspiration. #WakandaForever #HowardU","date":"Sat Aug 29 11:21:39 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Propaganda so cynical they don’t even care to mask it.","date":"Thu Aug 27 21:51:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Rhetoric has consequences. This president has chosen to wage a propaganda war against BLM protests and people are taking up arms to follow what they see as marching orders. \n\nVigilantism is not \"LAW AND ORDER\" - Trump should make that clear.","date":"Wed Aug 26 21:00:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As if this administration hasn't failed Americans enough with a lack of COVID strategy, costing more lives and economic damage than necessary, now they're pulling back on testing.\n\nTrump's focus is sweeping the pandemic under the rug, putting PR over people.","date":"Wed Aug 26 18:59:19 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"More than breaking norms, it broke law: the Hatch act.\n\nPompeo has brazenly politicized his office and our foreign policy, abandoning our international interests in favor of pursuing nakedly partisan interests. He and Trump use the State dept as an extension of the campaign.","date":"Wed Aug 26 16:06:14 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"What possible reasonable justification was there for an officer to unload his weapon into Jacob Blake's back? How many more videos do people need to see with their own eyes before they're convinced serious action must be taken to address police brutality in black communities.","date":"Tue Aug 25 16:44:08 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Powerful and heartfelt speech by @JoeBiden. A reminder of the kind of leadership our nation deserves, and the kind of character so absent from the current oval office.","date":"Fri Aug 21 03:44:02 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Abhorrent. Let's not allow the most cruel and incompetent administration get another four years at their amoral agenda.","date":"Thu Aug 20 20:20:34 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"By this own administration's language, they withdrew from the JCPOA. You can't force a provision of an agreement you're no longer party to. This failed attempt to force the JCPOA participants' hands will only show how much US global leadership has atrophied under Trump.","date":"Thu Aug 20 17:19:47 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"President Obama speaks to the seriousness of the moment and the moments that are still to come. We are a nation united behind the principles of our country, and share in the mission to fully realize them.","date":"Thu Aug 20 03:43:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Russia wanted to interfere in our elections and the Trump campaign rolled out the red carpet. Collusion, coordination... to my colleagues across the aisle, pick the word that calls it for it is. Let's not make casual the subversion of our democracy.","date":"Wed Aug 19 20:11:20 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As expected, the fight to save the Postal Service is far from over and the words Postmaster General's announcement yesterday will ring empty until they are met with action.","date":"Wed Aug 19 20:03:23 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Postmaster General announced during our press conference that they will be suspending these \"operational changes\". While this is certainly a win and a sign that advocacy works, we must make sure the sabotage that's already happened is reversed. https://t.co/GT1mxw8WpW","date":"Tue Aug 18 21:05:30 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I held a rally during the #DontMessWithUSPS Day of Action with @RepTomSuozzi, @AOC, @DavidWeprin &amp; @RoryLancman, standing against this administration's attacks on the USPS in their efforts to disenfranchise voters ahead of the election. \n\nRelease: https://t.co/OKwJcPXROV https://t.co/gU49aaGPbl","date":"Tue Aug 18 21:05:29 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Claire Schulman rescued Queens from a low point and lead it to the top. We are indebted to her for her dedication to our borough. (1/2)","date":"Tue Aug 18 01:10:38 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Last week she called about a project in the community, spending her last days in service to the people of Queens. That's who she was. \n\nShe'll be dearly missed. (2/2)","date":"Tue Aug 18 01:10:38 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My full statement regarding the Israel-UAE agreement: https://t.co/B9NLKLa4io","date":"Fri Aug 14 23:56:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I can speak to the value of visiting Israel and seeing firsthand the reality on the ground. Exposure adds a level of context and nuance too often absent on twitter.","date":"Fri Aug 14 19:24:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"2016 we saw a foreign attack on our democracy. 2020 we're watching a domestic attack on our democracy.","date":"Fri Aug 14 02:57:31 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"When he says the quiet part out loud, he tries to make something corrupt sound casual, because we’re used to scandals being revealed over secret recordings or something of the like.\n\nBut don’t be fooled; this is a scandal. He wants to obstruct your fundamental right to vote.","date":"Thu Aug 13 16:41:43 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This would be a significant step for the two nations to make official their cooperation and open relations. I await to be fully briefed as I continue to receive information on the details of this agreement.","date":"Thu Aug 13 16:30:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Public transit needs to fully funded, otherwise we’re compounding crisis with transit crisis. Anything short of this would be detrimental to the economy and the riders who depend on public transportation. It’s a no brainer.","date":"Mon Aug 10 19:33:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My thoughts are with the people of Belarus bravely fighting for their democracy. I met with Lukashenko five years ago to denounce human rights violations, urging the release of political prisoners. Concerned by this response now; violent crackdown against protestors must end.","date":"Mon Aug 10 17:09:48 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Investing in minority banks and community development financial institutions is a proven way to lift unbanked and underbanked communities, reversing the harmful legacy of redlining and disinvestment. My full release with Chairwoman @RepMaxineWaters: https://t.co/EUbZooK48H","date":"Sat Aug 08 21:10:37 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The pandemic has made it even more difficult to make sure every person is counted, and now it seems this administration is pushing to cut those constitutionally mandated efforts short. \n\nBe counted. It matters for you and for your community.\n\nhttps://t.co/5bKyZjDJZq","date":"Tue Aug 04 19:58:51 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It undercuts the US mission abroad when our international facing agencies are staffed by the very intolerance we disavow globally. USAID should continue to root that intolerance out.","date":"Tue Aug 04 14:48:50 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The underlying attitude that has deepened this crisis from the start.","date":"Tue Aug 04 14:25:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"John was soft spoken and humble, but a lion on the House floor. No matter the trials and tribulations, he never once let them bitter his soul. We carry his spirit forward by following his example, getting into good trouble to right the wrongs and injustices wherever they may be. https://t.co/t1zYPTR5OC","date":"Sat Aug 01 00:09:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#EidMubarak to everyone observing in New York and across the world. May it be a peaceful and meaningful celebration. #EidAlAdha","date":"Fri Jul 31 15:47:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The HEROES act has been sitting in the Senate for months, and part of it specifically addresses a crisis that has now gone from looming to here.\n\nIt's Friday. The American people can't afford to wait in limbo, @senatemajldr.","date":"Fri Jul 31 15:31:44 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This whataboutism is a common refrain in Trump's defense of Russia, but it is incredibly concerning the lengths he is willing to go in giving Russia cover for its actions, even so far as to give Putin a pass at targeting our troops.","date":"Wed Jul 29 17:15:50 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Once again, Burr runs out the clock by acting puzzled and asking for clarification on the Democrats' time, and takes R time to spin his actions uncontested.","date":"Tue Jul 28 16:56:01 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Rest in power, my friend.","date":"Tue Jul 28 00:52:57 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"(2/2) As the conscience of Congress, he fought for humanitarian rights not just here at home, but across the world, with no less passion and moral leadership. He is dearly missed. Our full statement: https://t.co/EKzCh6V8Vm","date":"Fri Jul 24 18:30:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"(1/2)Each year @RepHastingsFL &amp; I work with @repjohnlewis to appropriate funding for fostering greater diversity in our international affairs and combating discrimination abroad. It is with a heavy heart that we sign that appropriations request with John's signature now absent.","date":"Fri Jul 24 18:30:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The same essential workers we need to work through a pandemic have had high deductible health insurance that isn't there when you need it. \n\nCongrats @32BJSEIU for righting that wrong and securing affordable health care for your workers. #PovertyDoesntFly #HealthyTerminalsAct","date":"Fri Jul 24 14:58:57 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":".@AOC is completely correct. Putting aside the respect she should expect as an equal Member of Congress, no PERSON should be spoken to in that way. This should not have happened and never should happen again.","date":"Thu Jul 23 17:40:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Notably absent from what the W.H. has detailed about their conversation is the bounties Russia put out on U.S. troops. You’d think that’d be front and center in their discussion.","date":"Thu Jul 23 17:39:13 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Considering the value of diversity at USAID and it’s contractors, we should expect USAID to be transparent with its data on that diversity. Yearly reporting reqs would create much needed accountability, and push USAID to reflect the diversity of our nation it represents globally.","date":"Thu Jul 23 15:22:26 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In part because of the GOPs complicity or refusal to stand up to Trump's inaction, half the country is careening towards a second wave. And this is their response to those still out of work from the first wave? This is insanity.","date":"Wed Jul 22 18:29:27 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"While simultaneously working to block Congressional funding to test Americans.","date":"Tue Jul 21 16:29:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Proud to join the community in Roy Wilkins park rallying for peace from gun violence. Special thanks to DA Katz, BP Lee and our local electeds for organizing the peace rally. https://t.co/faXN1Atnv2","date":"Mon Jul 20 03:01:53 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump to CDC: “snitches get stitches”","date":"Sun Jul 19 18:18:42 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"One of the greatest honors of my life is having served with John, such a humble man with the courage of a lion. His voice will echo in the chambers of Congress forever. Rest In Peace and rise in power my friend.","date":"Sat Jul 18 15:33:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"US foreign policy post-Trump cannot be consumed by only fixing what's been fractured. We must move proactively forward, broadening our focus and inspiring leadership with a renewed moral authority. My statement on seeking the Chairmanship of HFAC: \n\nhttps://t.co/aLYVFKI6ho","date":"Fri Jul 17 20:37:17 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"And that’s when there was a camera.","date":"Fri Jul 17 20:36:35 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Senate needs to pass the #JusticeInPolicing Act which the House passed nearly a month ago already. Follow the link and tell @senatemajldr enough stalling:  https://t.co/ILxGDYSxdF.  \n#GeorgeFloydLaw https://t.co/TBUJcbqOVv","date":"Thu Jul 16 19:31:50 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"https://t.co/OYAYztMU4Z","date":"Wed Jul 15 03:37:03 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Good. There was never any sound reasoning for this policy that stood up to scrutiny. As always, we need to be hyper vigilant with everything immigration related this administration does, as this won't be the last time they'll try to sneak an anti-immigration policy past us.","date":"Tue Jul 14 20:39:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Republicans silent on this are letting Trump drag the presidency through the mud with yet another flagrant abuse of power that would be administration ending in normal times.","date":"Sat Jul 11 16:29:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"William P. Barr should remind his client that he can't actually shoot someone on 5th ave and get away with it.","date":"Thu Jul 09 14:42:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Trump Administration’s CFPB leadership gutted a key regulation that ensured borrower ability to repay and limited rollovers, simple practices that protect consumers from harmful debt traps. The CFPB should protect consumers, not payday lenders. \n\nhttps://t.co/XTXTf8X1S6","date":"Wed Jul 08 16:58:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump must've gotten his medical degree from Trump University. Who are you going to believe, him or Dr. Fauci?","date":"Wed Jul 08 15:51:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"No matter how much he'd like to convince us otherwise, we are in the middle of a pandemic. \n\nAs always, the president's sole focus is on exiting or dismantling every multilateral institution, no matter the cost on our nation's interests or on the well-being of its people.","date":"Tue Jul 07 22:16:51 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Like all of Trump's immigration policies, they're arbitrary and motivated by this administration's prejudice against immigrants. There is no reasonable justification behind this federal guidance and it must be reversed. https://t.co/xOsecdmeO4","date":"Tue Jul 07 19:17:20 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy independence day! Let us all recommit ourselves to forming a more perfect union, one which realizes the founding principle of our nation, that we are all created equal. \n\n#4thofJuly #WearAMask","date":"Sat Jul 04 17:15:29 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Beijing’s #NationalSecurityLaw contradicts the \"one country-two system\" policy for Hong Kong. Testimonies today at the @HouseForeign hearing reaffirm the importance of the United Stands standing by the Hong Kong people in their calls for democracy and human rights. https://t.co/SDf15NW5Nc","date":"Wed Jul 01 14:27:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is the result of the administration's failure to lead during a pandemic, and yet another example of the United State's diminishing role as a global leader.\n\nBut more than costing us our nation's reputation, Trump's \nhas cost us invaluable time to get COVID-19 under control.","date":"Tue Jun 30 17:48:35 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Why should Democrats take seriously the Republicans’ police reform bill, a bill so unenforceable and empty it might as well be a suggestion. The people are flooding into the streets demanding true reform. Let’s get it.✊🏾 #JusticeInPolicingAct https://t.co/L5FFgc9fbi","date":"Tue Jun 30 14:17:44 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Big congratulations to @Dr_BJEanes on becoming President of @YorkCollegeCUNY.\n\nYork was in good hands under your stewardship as interim President, and I'm glad we'll continue to work together going forward.","date":"Tue Jun 30 03:31:44 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I was born in 1953, before the Civil Rights Act was law, before Brown v Board was decided, a decade before the Voting Rights Act. \n\nThe times again are upon Congress, and we must act. The camera of history is rolling. Let it not reflect as unfavorably on us now as it did on '53. https://t.co/Mc99e4rJ4z","date":"Sat Jun 27 22:19:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Throughout the time the WH knew, Trump was working to get Russia into G7 and further ingratiate himself with Putin. \n\nTrump has a clear pattern of deference to Russia, over the safety of our own troops, foreign interests, and our democracy. My statement: https://t.co/ku4h3lxWVV","date":"Sat Jun 27 22:16:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In the 7 years since SCOTUS struck down the Voting Rights Act, our democracy has become less democratic. Voter rolls have been purged, polling locations eliminated, all to make it harder for (certain) people to vote.\n\nWe must return the VRA's safeguards and #RestoreTheVote. https://t.co/TlKEsBKB1P","date":"Thu Jun 25 17:11:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There is no justice without true reform, and there is no reform without transparency and accountability. Today we vote on the historic #JusticeInPolicingAct, because this is our nation's moment to no longer hear #ICantBreath and do nothing. It is time for progress. https://t.co/hCdmIVPtKi","date":"Thu Jun 25 15:40:35 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Hearing reports that some voting locations are not distributing both ballot sheets, and I have notified BOE. When you vote, you should receive two ballots, one presidential and one congressional/local. If you have not been given both, you should ask for the complete ballot.","date":"Tue Jun 23 14:40:53 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My joint statement with Council Member @DRichards13 on the chokehold used today by an officer in Rockaway: https://t.co/Qk4oTyEBSJ","date":"Mon Jun 22 00:53:14 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Joining 100 Hundred Black Men to distribute food and masks in Cedar Manor! Big thanks to Michael Garner and the men of 100 Black Men, and Pastor Richard Hogan TA President of Cedar Manor for making this happen. https://t.co/nC8Ynrza3C","date":"Sat Jun 20 20:02:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"\"By shining a light on the police brutality bond market, we can bring about positive change both in law enforcement and the financial services sector.” https://t.co/AUQlMmu9pA","date":"Fri Jun 19 23:15:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thank you to Consulate General for the Republic of Korea, Ambassador Won-Sam Chang, and President Minsun Kim of the Museum for Korean American Heritage for this generous PPE donation to the Joseph P. Addabbo and Elmont Family Health Centers! https://t.co/jybnSXIZmq","date":"Fri Jun 19 17:16:13 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We don’t educate enough on our nation’s original and long enduring sin. #Juneteenth is an opportunity to celebrate emancipation, and recognize slavery only ended in our recent history. We live with the legacy of that institution every day. We must do better in reckoning with it. https://t.co/Hq8s3IapJg","date":"Fri Jun 19 16:55:28 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"More good news out of SCOTUS. Congratulations DREAMers, America is your home and Donald Trump is not entitled to rip you from it on a whim. \n\nNext step: fighting for a path to citizenship.","date":"Thu Jun 18 14:49:43 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The supposed leader of the free world encouraged the creation of what's essentially concentration camps.\n\nAnd instead of letting Americans know as Congress was ruling on whether he's fit for the title, Bolton sat on that information to get a book deal. No heroes in this story.","date":"Thu Jun 18 02:17:58 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Fill out your Census. Be counted. Pass it on. #2020census \n\nhttps://t.co/q2jsqG0gjp","date":"Wed Jun 17 19:08:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"LGBTQ rights are civil rights. Glad to see the Supreme Court landed on the right side of this\n\nHappy #PrideMonth indeed.","date":"Mon Jun 15 14:19:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Marching for today’s FarRock NPHC &amp; Queens Defenders March with Us Rally. https://t.co/UNR3Xqh7Kd","date":"Sat Jun 13 21:43:58 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Our ports, railways, bridges and tunnels are critical to our economy, as well as the thousands of jobs these projects generate. We cannot allow the losses caused by the coronavirus pandemic to derail our transportation system.  https://t.co/sOYGLuujah","date":"Fri Jun 12 15:48:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We made PPP accessible so relief could be distributed fast to the businesses that needed it urgently, knowing we could return once the dust settled to scrutinize for abuse.\n\nIt’s why I’ve been pushing the Treasury for transparency, but this administration has been everything but.","date":"Thu Jun 11 20:34:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"But let's not whitewash the historical context of these symbols. The majority of confederate symbols were erected at the height of Jim Crow, long after the civil war, as tools of oppression and intimidation against a growing civil rights movement. (2/4) https://t.co/TnYpYJmjei","date":"Wed Jun 10 19:34:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In last year's NDAA, I successfully passed an amendment to prohibit DOD from naming its assets after the Confederacy. It passed with significant bipartisan support. (3/4)...\n\nhttps://t.co/RQIncfRwvN","date":"Wed Jun 10 19:34:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"And so if we acknowledge that naming DOD assets after the confederacy would be a hurtful mistake now, it follows that we recognize it was wrong then too. Clearly Trump is just trying to divide, inflame, and distract, but it is a serious conversation worth having. (4/4)","date":"Wed Jun 10 19:34:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Calling it for what it is.","date":"Wed Jun 10 16:51:43 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is a turning point in American history, as our nation takes a hard and imaginative look at reforming law enforcement. The #JusticeInPolicing Act we unveiled yesterday says no to chokeholds, no to qualified immunity, and yes to accountability and transparency. https://t.co/bvHmk1Ilaf","date":"Tue Jun 09 19:21:58 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"What we are calling for is the demilitarization of police forces across the country. We are calling for transparency and accountability. We are calling on an end to the blue wall of silence. https://t.co/RYlJ9tboRs","date":"Mon Jun 08 18:57:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"When our nation is in need of unity, this president has only tried to sow more division. In using the military to clear peaceful protestors so he can stage a photo op at a church, he is acting just like Kim Jong-un and all the dictators he's befriended. He's got to go. https://t.co/7J15VEtnUs","date":"Mon Jun 08 18:51:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The instructions were on the mask and they chose to do the opposite?","date":"Fri Jun 05 04:23:57 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Powerful rally today at Queens Borough Hall. \n\n“Let us not become weary in doing good, for at the proper time we will reap a harvest if we do not give up.” \n\n#letusbreathe https://t.co/wBdnLQ06lG","date":"Fri Jun 05 00:38:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We're all in the same storm, but not all in the same boat. MDIs and CDFIs are helping local small businesses access PPP for desperately needed relief they may have otherwise been unable to apply for. Yesterday I chaired our first ever virtual hearing. My opening statement: https://t.co/frq36bW6Tk","date":"Thu Jun 04 18:04:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There needs to be accountability. There needs to be justice. We are tired of losing our brothers and sisters without recompense. Say his name. #GeorgeFloyd https://t.co/MFoHMuKU7w","date":"Wed Jun 03 17:13:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Join us as I chair the first ever virtual @FSCDems subcommittee hearing, looking at how we can help #CDFIs and #MDIs continue to help under-served and minority-owned businesses access PPP. https://t.co/EHTizA8NsE","date":"Wed Jun 03 16:20:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As Chair of the Subcommittee on Consumer Protection and Financial Institutions, I will be gaveling in the first virtual hearing in the Financial Services Committee’s history. \n\nJoin us tomorrow at 12pm for “Promoting Inclusive Lending During the Pandemic: CDFIs and MDIs”","date":"Wed Jun 03 01:15:09 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump didn't say one word about the police brutality that killed George Floyd. He's not concerned about saving the protests from opportunistic hijackers, as he says.\n\nBy trampling over peaceful protests to stage an authoritarian photo-op, he's the biggest opportunist of them all.","date":"Mon Jun 01 23:41:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Yup.","date":"Mon Jun 01 23:20:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"He'll set the country on fire if he thinks it'd help him politically.","date":"Mon Jun 01 23:18:49 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"What’s his name? #GeorgeFloyd","date":"Mon Jun 01 18:09:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It is hard to imagine a president more unqualified, less empathetic, and smaller than who Donald Trump shows himself to be every day.","date":"Mon Jun 01 17:18:49 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"See my full statement on what can only be described as the murder of George Floyd: https://t.co/9sYdiEjGtf https://t.co/cb8Pl4ClJv","date":"Sat May 30 00:54:27 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We cannot be numb to this. We shouldn't wait until a bomb is sent to a Member of Congress or a news network before recognizing the very real danger posed by this president's extreme language.","date":"Fri May 29 15:55:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This month is Asian and Pacific Islander American Heritage Month. Unfortunately, it is also a month where we’ve seen terrible acts of bigotry and hate against the AAPI community during this pandemic. My message: #AAPIHeritageMonth https://t.co/sv2eilN61S","date":"Thu May 28 15:59:34 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#TeamMask, because, if you haven’t noticed, we’re in the middle of a pandemic.\n\nWear a mask. https://t.co/ofATpFmxtU","date":"Wed May 27 21:14:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This was done while the cameras were on. Think what happens when there aren't any. Everyone watching could see they were killing him. And still they pressed on his neck.\n\nThis cannot be tolerated - there needs to be justice, real justice.","date":"Wed May 27 15:59:48 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"On #MemorialDay we remember and honor the fallen who made the ultimate sacrifice in service to their country. We are forever grateful to their bravery, and to all who serve and fight to protect our democracy. https://t.co/CdQrGk8EhK","date":"Mon May 25 17:21:03 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#EidMubarak to everyone celebrating the end of Ramadan. Though this year’s celebrations will have certainly been made different by the pandemic, I wish you and your loved ones a joyous and meaningful time adjusting and observing together.","date":"Sun May 24 18:42:03 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Incredibly touching - and heartbreaking - @nytimes video on St. John's and the fine work they're doing during this pandemic. Please, let's all respect these workers and victims by taking every precaution to be safe so we don't have a round two. https://t.co/0N0UsNt2Ie","date":"Fri May 22 21:19:48 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The administration already has a deep credibility problem, with only pockets of trust remaining for certain experts in the administration. This only exacerbates the former and strains the latter.","date":"Fri May 22 19:07:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"No question, federal assistance for the Port Authority is critical for the functioning of our region's economy, now and after this crisis. The drop in revenue caused by COVID-19 must be mitigated immediately through federal aid.","date":"Thu May 21 20:37:13 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As far as asinine things presidents have done to convey an image of strength, we can file this one just under President Harrison's refusal to wear a coat in the bitter cold for his inauguration speech.","date":"Thu May 21 20:22:38 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Not only am I disappointed that Otting decided to ram through incomplete reforms to the Community Reinvestment Act, but abandoning leadership during legacy rulemaking + a financial crisis is as unprecedented as it is on-brand for him &amp; this administration:\nhttps://t.co/8Cn23kBp6X","date":"Wed May 20 23:07:45 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Make sure you're taking great care to avoid the scams we're increasingly seeing take advantage of this pandemic.","date":"Wed May 20 16:02:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Last month I sent a letter urging Treasury to distribute economic impact payments via secure debit cards. Glad to see IRS is heeding calls to use technology that would more quickly provide economic relief to underbanked and unbanked Americans.  https://t.co/VJYh5ASUND","date":"Wed May 20 14:16:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Republicans have given carte blanche to the president and his rampant abuse of power. This undemocratic purge of checks and balances has become the norm under their silence.","date":"Sat May 16 02:13:13 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@Rajivjassi1 @NYSLabor @NYSDOLCommish Hello Rajiv,\n\nSorry you're experiencing this delay. Please contact my office at 718-725-6000 so we can help look into your claim.","date":"Fri May 15 19:21:06 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Cutting SNAP during normal times is heartless enough. During a pandemic with 36 millions unemployment claims, overburdened food banks, and countless food-insecure families? Inhumane and cruel. #HandsOffSNAP https://t.co/SoLbnIRBxt","date":"Fri May 15 16:39:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Dr. Bright's testimony so far makes clear the lack of urgency by this administration at the onset of this pandemic, and an ample amount of wishful thinking that proved dangerous to the American public.\n\nLike the doctor argues, trust expertise and listen to the scientists.","date":"Thu May 14 16:09:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"From the beginning, this administration has responded to the pandemic as a PR crisis first, and a health crisis second. You don't get to pick your facts.","date":"Wed May 13 18:24:32 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Very concerning to see such stark disparities between communities. Enforcement of social distancing rules shouldn't vary by zipcodes or demographics.  I applaud our AG for taking this action.","date":"Wed May 13 15:50:06 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Proud that the Protect our Checks Act of 2020 @RepPressley and I introduced today - prohibiting banks from garnishing economic impact payments - was incorporated into House Democrats’ next phase of support for American families. Read more here: https://t.co/YaYytSOTn1 https://t.co/BVoe2z57Sv","date":"Wed May 13 14:42:03 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#Supportnonprofits 👇🏾","date":"Mon May 11 14:28:50 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"What a platform. No tests, no insurance, no problem.","date":"Thu May 07 15:48:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#AhmaudArbery was murdered for daring to take a jog in his own neighborhood. Justice is due.","date":"Thu May 07 15:24:48 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"...","date":"Wed May 06 21:30:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Local restaurants have been devastated by COVID, and they're likely to continue hurting even as our nation begins to open. I led a letter to leadership outlining what measures Congress can take next to address their specific needs. Read more here: https://t.co/LTIzWf6tMh https://t.co/SYk4b46x8D","date":"Wed May 06 21:16:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Amen. \n\nThere is no excuse for this level of aggression. Disparities in enforcement of social distancing has become a disturbing trend. We've got to put a stop to this.","date":"Wed May 06 14:49:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Kushner has zero experience and should not be at the helm of this administration's coronavirus response. It takes a great deal of arrogance to discount expertise in times of crisis, let alone when you're already so ill-equipped to execute on these responsibilities.","date":"Tue May 05 17:17:02 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The purpose of economic impact payments is to provide families financial relief during a crisis, not for banks to garnish over existing debts. The letter @RepPressley and I sent demanding agencies issue guidance or regulation to make that clear: https://t.co/MwPaqHP3TA https://t.co/PKvtNybH8n","date":"Fri May 01 21:19:33 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congrats @andersoncooper!","date":"Fri May 01 02:29:44 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Shout out to our healthcare heroes and sheroes like Linda Silva, a healthcare veteran of 17 years selflessly working on the front lines. Linda contacted my office about needing PPE at her facility, which I secured for her and her essential co-workers in Far Rockaway. @1199SEIU https://t.co/HB9uwzYMjg","date":"Thu Apr 30 21:37:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I wrote a letter with @SenKamalaHarris to SBA and Treasury regarding widespread reports that community banks, CDFIs and MDIs are experiencing technical issues on SBA's portal for PPP. This needs to be resolved immediately. https://t.co/48kLwUNXXG","date":"Thu Apr 30 21:28:44 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Yes, it is important large corporations pay their invoices as soon as possible to our small businesses!","date":"Thu Apr 30 18:23:49 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Black communities are on the front lines of this pandemic. Inspiring to see the intensity brought by each and every Member of the CBC as we fight for our communities. ✊🏾","date":"Thu Apr 30 17:59:38 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Another step in the right direction following my NDAA amendment prohibiting the naming of DOD assets after confederate figures and battles. There is no question about the divisiveness and hurt caused by these symbols of enslavement and oppression.","date":"Thu Apr 30 17:50:44 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Don’t tell me it’s “hard on everyone”. I’ll tell you who it’s hard on, it’s the child on the ground on the receiving end of excessive force. \n\nOutrageous.","date":"Wed Apr 29 14:13:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"\"In our line of work, you wear masks\"","date":"Tue Apr 28 20:27:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Cheering on the everyday super heroes at St. John’s Episcopal Hospital during their shift change for #SuperheroDay. Our nation owes them a bottomless debt of gratitude and so much more for the work they do. We’ve got to keep fighting to get them all the PPE they need to stay safe https://t.co/IHVF8sLw85","date":"Tue Apr 28 20:19:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":".@SenKamalaHarris and I co-led a letter today to the Fed and Treasury asking for emergency support to CDFIs and MDIs so they are better able to assist with the credit needs of truly small businesses during this crisis.\n\nRead more: https://t.co/jBzPNPYEu0 https://t.co/ud7cwh5lUe","date":"Fri Apr 24 22:46:24 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My heart hurts to hear this news. Sending my prayers to you and your family, @RepMaxineWaters.","date":"Thu Apr 23 20:34:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"#RamadanMubarak to all observing this time of reflection, healing, and prayer around the world. I wish all a very safe, joyous and blessed Ramadan season. https://t.co/7ZbQB1YJ9x","date":"Thu Apr 23 18:45:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I sent a letter with @RepAlGreen @repcleaver @RepBillFoster encouraging financial technology companies to partner with minority depository institutions (MDIs) and community development financial institutions (CDFIs) in distributing PPP. \n\nRead more here: https://t.co/x9ENNaL0qb https://t.co/EUy2ZSRxC1","date":"Thu Apr 23 17:28:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Saddened to hear of this news. My condolences to you and your family, @ewarren.","date":"Thu Apr 23 17:18:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I can tell you where he's pulling that evidence from.","date":"Wed Apr 22 22:37:51 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is just a chilling reminder of what it means to have 45 at the helm during a pandemic. He's bullying the scientists and doctors to paint a dangerously rosy picture so that it reflects better on him.","date":"Wed Apr 22 22:34:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump has only one trick and that's to shift the media narrative away from news he doesn't like. This is just another attempt to divert attention from a crisis of his own making. \n\nGet to work Mr. President. We need resources not finger pointing. https://t.co/SJMTQNl67F","date":"Tue Apr 21 17:51:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My analysis found minority communities have far less banks per capita. We're seeing today how a lack of banking relationships compounds a crisis, slowing or stalling access to relief on top of all the other inequities modern day redlining causes.\n\nMy oped:\nhttps://t.co/TSRublqH14","date":"Mon Apr 20 16:45:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As was announced today, I am partnering with Gov Cuomo to start a pilot program bringing testing to NYCHA housing. Lower income communities, which are disproportionately on the front lines of this crisis, have been hardest hit and we need to take care of our most vulnerable. https://t.co/HZfMn6VLwC","date":"Mon Apr 20 16:28:15 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"PPP funds need to be replenished immediately, with greater transparency so we make sure the program is actually going to actual small businesses, including MWBEs, and not just big companies that have an edge in applying for the program.\n\nRead more: https://t.co/bn6ApUMeIt","date":"Thu Apr 16 21:14:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I sent a letter to the GEO run Queens Detention Facility demanding they provide answers on how they plan to control the coronavirus outbreak at their facility, and full transparency on the situation there. \n\nSee more:\nhttps://t.co/L4UGw3LPek https://t.co/GriEObD9rE","date":"Thu Apr 16 19:15:08 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Yesterday, I told Treasury Secretary @stevenmnuchin1 it is critical we track diversity of who is getting stimulus money.  I am very concerned that minorities are losing out in access to stimulus funds.  We cannot stand by while there is a minorities great depression.","date":"Wed Apr 15 17:28:06 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is an absurd attempt to scapegoat and rewrite history. This administration was briefed by its own intelligence about coronavirus, and ignored the ugly truth for political reasons. Cutting funding to the WHO doesn't erase that, it just makes a global pandemic worse.","date":"Tue Apr 14 22:41:19 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Structural inequities that have existed for small businesses long before COVID is now hurting their ability to receive aid. Dems are working to make sure they don't slip through the cracks. \n\nThat isn't hostage taking, that's called negotiation. Read:\nhttps://t.co/RLW1CvWKF4","date":"Mon Apr 13 17:28:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Though celebrations may be different this year, the spirit of the day remains the same. Wishing everyone a #HappyEaster. https://t.co/vutiJaFoVM","date":"Sun Apr 12 16:11:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"For those who either don't have direct deposit with the IRS or are unbanked, stimulus checks will take weeks if not months to arrive. Today I sent a letter with @RepTipton  asking Treasury to consider issuing debit cards Americans can access immediately. https://t.co/qgg7Wrcmvw","date":"Sat Apr 11 22:05:32 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today, @repcleaver @RepBeatty and I addressed a letter to Chairman Powell asking that the Fed look to incorporate minority asset managers and broker dealers in their economic response programs.\n\nRead more: https://t.co/H4EsJHr4pM https://t.co/pzqePbAeiQ","date":"Fri Apr 10 21:44:48 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Anyone who works in the health care industry, in nursing homes, as first responders, or anyone who knows someone that does... I can't imagine these lies and attitude by the president are anything but infuriating.","date":"Fri Apr 10 20:14:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Technically true.","date":"Fri Apr 10 20:03:03 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Agree with @NYGovCuomo that more testing needs to happen in minority communities, directly where rates have shown to be higher.","date":"Wed Apr 08 16:46:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is vile. My thoughts are with this poor woman. In a vain attempt to deflect blame, Trump's dangerous rhetoric is putting people in harm's way and it needs to stop.","date":"Tue Apr 07 17:51:17 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There are people in my community who are dying -  DYING - while this administration flippantly tells state's to figure it out for themselves. There is no leadership from the top, only lies, and I'm tired of it. https://t.co/LMgZ36h2ZJ","date":"Tue Apr 07 17:32:10 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This administration's response is not commensurate to the state of the crisis in New York and across the United States. They continue to drag their feet and downplay the realities of coronavirus, while those on the ground continue raising the alarm. https://t.co/BbusGDMVyn","date":"Tue Apr 07 17:26:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tragic numbers. These heroes are on the front line keeping essential workers moving. If you don't have to leave home, stay home and do not take public transit. You are needlessly putting these workers at risk.","date":"Mon Apr 06 20:48:04 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The actions of a president more concerned about his political standing than your health.","date":"Mon Apr 06 00:29:03 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Small business owners are contacting my office about their #PPPloan applications being rejected by @BankofAmerica and @Chase because they don’t have existing credit accounts with the banks.  This requirement is not in the #StimulusBill, and banks should remove them immediately.","date":"Fri Apr 03 18:50:08 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Whether it's a pandemic or an economic downturn, or in this case both, those who are already most vulnerable are always hit the hardest. That should be especially taken into account when we allocate federal assistance. https://t.co/eu2fg6cyH9","date":"Fri Apr 03 17:02:08 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Reminder, today you can apply for the small business loan program. It is first come first serve, so act quickly.\n\nhttps://t.co/KWmbCqCiQP","date":"Fri Apr 03 16:20:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Don't forget to get counted! It can all be done online, and doing so will bring vital resources to your community. Fill out the form #CensusDay2020","date":"Wed Apr 01 19:21:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Queens lost two legends today. Johnnie Joyner and Ben Wright were titans of southeast Queens. Our community mourns their passing.","date":"Sun Mar 29 03:14:49 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Deeply saddened to hear of Rev. Joseph Lowery's passing. He was a pillar of the civil rights movement and we all owe him much gratitude for all that he did. Today we mourn his death but we celebrate his legacy.","date":"Sun Mar 29 01:08:15 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I will cast my vote in DC to pass the $2 trillion coronavirus relief package. This bill is not perfect, but it will provide immediate relief for the many people hurting as a result of coronavirus, it will support for our health care workers, and will help small businesses. https://t.co/ziXtAsiqBE","date":"Fri Mar 27 17:29:06 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Horrific reports out of Kabul yesterday as ISIS extremists targeted Sikh worshippers. I stand with religious minorities, including Sikhs worldwide. Religious freedom is a human right - we must push back against those who'd attack peaceful practitioners.\nhttps://t.co/TFTwBbKky6","date":"Thu Mar 26 17:28:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We need supplies and we need them fast. The federal government should be mobilizing resources to provide them. Unacceptable that our health care workers are settling for sub-par makeshift protection during a pandemic.","date":"Thu Mar 26 03:00:09 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Good on @JetBlue. We need everyone coming together to make sure our health system is prepared for the coming weeks.","date":"Thu Mar 26 01:22:54 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Good advice.","date":"Tue Mar 24 20:08:17 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We're going to need swift comprehensive action in Congress to address both the health and economic consequences of coronavirus. I've released my priorities for a response package. See below: https://t.co/NuMRjEcjpx","date":"Tue Mar 24 13:59:30 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Any bailout for the airline industry must be conditioned on help for airport workers. These workers put themselves at risk every day, and they're the most vulnerable to losing their jobs during this crisis. Thousands already have. I stand with @32BJSEIU. #ProtectAllWorkers","date":"Mon Mar 23 16:32:37 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@aizaazk Please contact my district office at 718-725-6000 asap and provide me the best email to contact you.","date":"Mon Mar 23 16:24:42 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"“America, you’re having it bad, but I’m having it worse” - Trump, probably.","date":"Sun Mar 22 23:23:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"He thinks it's a campaign strategy. Glad he's still thinking through that lens during a pandemic.","date":"Sun Mar 22 23:04:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"\"Woe is me\"","date":"Sun Mar 22 23:02:59 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Goes without say. Where Trump goes, Pence unwaveringly follows.","date":"Sun Mar 22 23:01:35 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Maybe Tatooine then.","date":"Sun Mar 22 22:47:00 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Vindictive behavior during a time of crisis, what else can we expect from Donald Trump.","date":"Sun Mar 22 22:41:00 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is not how you get ahead of the curve. Why not take immediate action to address the needs our hospitals have right now? Enraging.","date":"Sun Mar 22 22:37:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Not comforting to see POTUS burying his head in the sand during a crisis, thinking that will save face. It was a fair question and tracks with people's experiences. \n\nTests were greatly delayed. Tests are what we'll need to control the situation and start returning to normal.","date":"Fri Mar 20 17:23:02 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The president is misleading the public about potential treatments and calling news outlets rightfully asking whether that's dangerous as \"sensationalist\". He is a threat to public safety.","date":"Fri Mar 20 16:35:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thank you to all the health care professionals working during this pandemic to keep us safe. Their job was never an easy one, least of all during this time. We are all grateful. https://t.co/Rqub7VN7uo","date":"Fri Mar 20 16:22:02 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"And it couldn't be more transparent. The contrast between Trump's self-absorbed press conferences and Governor Cuomo's is stark.","date":"Fri Mar 20 16:14:50 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Anyone watching these press conferences are walking away confused, and feeling that Trump is more focused on deferring blame than he is on handling this situation. A capable and thoughtful president would be nice right about now. Without one, let the specialists speak.","date":"Thu Mar 19 16:55:10 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is why it's imperative we do all we can right now to reduce risk of exposure.","date":"Mon Mar 16 18:06:44 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Please Share:\n\nIn NYC, school meals are available in every school from 7:30am-1pm.\n\nAnd it’s any school, so if you live closer to another school, go there.","date":"Mon Mar 16 13:45:02 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We understand that this will not be easy, but it is necessary to take all precautions right now in order to begin getting coronavirus under control and to keep families safe. Schools must be temporarily shut down.","date":"Sun Mar 15 21:27:04 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Remember to join tomorrow at 3pm for my Facebook live Q&amp;A on Coronavirus. Meanwhile, here’s a breakdown on the Families First act passed yesterday to help address the disruptions families are grappling with as a result of Coronavirus. https://t.co/MpySQQO9uO","date":"Sat Mar 14 22:33:01 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tonight we worked across party lines to ensure that testing is available, that emergency sick leave and family leave is available for those that need it, and that states are financially supported.\n\nThis is an important step towards getting coronavirus under control.","date":"Sat Mar 14 05:05:34 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is a smart move. We need to be prepared to take care of families struggling with the downstream effects of coronavirus.","date":"Fri Mar 13 18:28:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This administration plugged their ears and covered their eyes and allowed a pandemic to spread... because the reality was inconvenient for them?\n\nThey were more concerned about optics than by the people who’d get infected. Complete incompetence.","date":"Thu Mar 12 22:52:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The war on truth can have real victims.","date":"Thu Mar 12 22:33:01 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This 👇🏾. There is a lot of misinformation spreading. Make sure to stay informed through accurate, credible sources.","date":"Thu Mar 12 22:21:26 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Coronavirus response and precautions will inevitably complicate the Census campaign on the ground, which is vital for an accurate count. It’s only reasonable to receive an extension for the 2020 Census so we have better data. \n\nWe only do this every ten years; let’s do it right.","date":"Thu Mar 12 21:47:13 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It's in everyone’s interest that coronavirus testing is made available and free, that families can take emergency sick leave, and that government is able to quickly respond to the public's needs. \n\nLearn more about the #FamiliesFirst Act: https://t.co/6teYDsBlk5","date":"Thu Mar 12 21:26:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Even when adjusting for income, black/brown communities have as much as 7 times fewer banks than their white counterparts. To eliminate banking deserts, we can start by making sure CRA is modernized in a way that keeps it true to its civil rights purpose.\nhttps://t.co/32oITwwfK9","date":"Thu Mar 12 14:06:05 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Is anyone keeping count? Wells Fargo's board was asleep at the wheel while the ship cruised from avoidable disaster to avoidable disaster.","date":"Wed Mar 11 16:34:06 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The con-man's game is now more dangerous than ever.","date":"Tue Mar 10 19:29:43 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There is a confirmed case of Coronavirus in Far Rockaway. I’m in communication with the Mayor’s office and will update as more information becomes available. Meanwhile, I recommend everyone continue to follow CDC’s best practices. https://t.co/KfNVMXxwkk","date":"Sat Mar 07 17:32:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"https://t.co/EAUQcJgDVu","date":"Fri Mar 06 17:09:26 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My friend and colleague @RepAlGreen mentioning the @Newsday investigation which found  pervasive discrimination by Long Island realtors, reminding us how systemic discrimination can be throughout the home buying process. @FSCDems https://t.co/CJxznIu7ul","date":"Fri Mar 06 17:07:53 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Not being able to access credit is a major barrier for building generational wealth. As my former pastor used to say: rent the car, buy the house. Because the car depreciates, but the house appreciates. \n\nAddressing banking deserts can start with modernizing CRA correctly. https://t.co/jhxn4hobZV","date":"Fri Mar 06 16:50:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Chairing a @FSCDems field hearing at Jamaica Performing Arts Center, receiving testimony from a panel of experts on the topic of modern-day redlining. \n\nThe legacy of redlining has led to today's underbanked and unbanked communities, which we've found to be prevalent in Queens. https://t.co/WsHGtxwkgJ","date":"Fri Mar 06 15:55:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Putting his name on buildings doesn’t make Trump an architect. Maybe let’s leave federal buildings to the creative professionals.","date":"Thu Mar 05 21:02:58 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is not the way to set the public at ease and assure them that this administration has its act together.","date":"Tue Mar 03 23:52:49 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Let’s not forget what is at stake this next election. Americans’ health insurance is on the line. Let’s keep our eyes on the ball.","date":"Mon Mar 02 19:56:49 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As we're working to monitor corona virus, It's helpful to practice these preventative steps recommended by the CDC to reduce risk: https://t.co/0JQzpROSu8","date":"Sat Feb 29 22:51:33 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We strongly support free, fair, and peaceful elections in Guyana that reflect the will of the Guyanese people. Read our statement: https://t.co/acTsjiPTXg","date":"Fri Feb 28 19:01:29 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is what happens when you don't take a pandemic seriously, but view it only from the lens of politics. Pence's appointment and the revelation that this whistle-blower is facing retaliation is an alarming indication of what we can expect from the Trump administration.","date":"Thu Feb 27 22:10:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Excited to announce that I'll be Chairing a Congressional Field Hearing on modern-day redlining: the burden of underbanked and excluded communities in New York. Join us on Friday morning, March 6th, at JCAL. https://t.co/CTRbimmAke","date":"Thu Feb 27 18:48:22 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Proud to have cast my vote today on a bill to finally recognizing lynchings for what they've always been: a hate crime used to terrorize and oppress black communities.","date":"Wed Feb 26 22:15:28 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is the logical next step for Trump's war on truth and war on the press. Undemocratic.","date":"Wed Feb 26 22:03:17 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"“They asked Katherine Johnson for the moon, and she gave it to them.”\n\nRest In Peace - #BlackHistoryMonth \n\nhttps://t.co/DdU8Ok5pXv","date":"Mon Feb 24 15:49:34 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As expected. https://t.co/t0TsruTRQN","date":"Thu Feb 20 23:09:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My full statement: https://t.co/wL4san52dr","date":"Thu Feb 20 21:53:33 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Taxi drivers were lured into a debt trap, taking massive loans to buy over-valued medallions, and left to work off that debt by competing in an uneven market.\n\nSelling off their debt to a hedge fund that'll squeeze them for everything is not justice. https://t.co/quBgcanx37","date":"Thu Feb 20 17:35:29 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@brianstelter They already turned that into a rec room.","date":"Tue Feb 18 16:26:58 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Serving the personal interests of the president, showing leniency to friends and launching sham investigations into rivals is antithetical to DOJ and a functioning democracy. \n\nI can't believe that requires being said, but here we are.","date":"Tue Feb 18 16:25:28 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This #BlackHistoryMonth2020, I'm proud to introduce the Harriet Tubman Bicentennial Commemorative Coin Act honoring her life and legacy. Read more -&gt; https://t.co/opXAzdI1xM\n\n#BlackHistory https://t.co/Z5ktha255e","date":"Fri Feb 14 19:38:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Two years ago, 17 young lives were tragically taken from this world at Marjory Stoneman Douglas High School. We honor their memory by continuing the fight to #EndGunViolence, side by side with the survivors who inspired the nation in their movement to pass gun reform. #MSDStrong https://t.co/yafAr9QJsW","date":"Fri Feb 14 18:04:14 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"So far following the typical formula of: 1) He didn't do it. 2) If he did, it'd be okay.\n\nWaiting on 3) He did it.","date":"Wed Feb 12 15:45:39 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As Chair of the Subcommittee on Consumer Protection and Financial Institutions, redressing banking discrimination and encouraging diversity have been among my chief priorities. Proud to have passed my Corporate Diversity legislation this Congress.\nhttps://t.co/Rspa31myO0","date":"Wed Feb 12 15:25:43 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Before we get distracted by the next erosion of democracy perpetuated by this administration, just a daily reminder that Trump wants to de-fund: Medicare, Medicaid, Social Security, children's healthcare and food stamps. \n\n#TrumpBudget","date":"Tue Feb 11 18:24:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"And dog-whistling a MAGA militiaa call to arms for intimidation. Dangerous rhetoric.","date":"Tue Feb 11 16:55:25 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Don't just read the transcript, read the budget too. \n\nJust as he lied about a perfect call, he lied when he said he won't cut social security or Medicare.\n\nHe's lied 16,000 times in office because that's what a con man does. #TrumpBudget https://t.co/RU4A16RuLm","date":"Mon Feb 10 20:56:20 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Every week Trump says something that leaves the world astonished he's actually the President of anything, let alone the United States.\n\nThis week we made it to 1pm on a Monday.","date":"Mon Feb 10 18:26:37 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@RepJoeMorelle @Cardinals Congratulations Joe, there is nothing better!!","date":"Sat Feb 08 11:58:34 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump’s suspension of preclearance for NYers is petulant bad policy. He’s over-burdening TSA just to retaliate against NY for standing up to his racist immigration policies. \n\nThis is an administration driven by vendetta, and we’re less safe for it in more ways than I can count.","date":"Thu Feb 06 22:37:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"An agency as willing to accept responsibility as the President that directs it.","date":"Thu Feb 06 19:12:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My heart hurts listening to his brother describe what happened. He was unarmed...\n\nThis is unacceptable. https://t.co/PBvVQIHBFV","date":"Thu Feb 06 18:54:28 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If the president wanted to do something on pharmaceutical prices, he’d have his subservient Senate take up HR3 passed in the House and let us negotiate down drug prices.\n\nThe “something” he mentions in the Senate does not do that. Broken campaign promise. #SOTU","date":"Wed Feb 05 02:50:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Might as well have Trump testify while we have him here in front of the Senate. #SOTU","date":"Wed Feb 05 02:20:52 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"MRW Trump claims credit for the low unemployment rate during the #SOTU: https://t.co/ddFYhaEP1J","date":"Wed Feb 05 02:17:00 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My guest tonight for the #SOTU is Debra Fraser-Howze, founder of the National Black Leadership Commission on AIDS. https://t.co/Xze91Io7w0","date":"Wed Feb 05 00:36:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My guest tonight for the #SOTU is Debra Fraser-Howze, founder of the National Black Leadership Commission on AIDS. https://t.co/99FuHpI6p1","date":"Wed Feb 05 00:34:36 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Was live on @AftertheBell ahead of the #SOTU to discuss that, while Obama’s economy is still running strong, too many working families are struggling. And what is Trump’s answers for them? Broken promises on prescription drug costs and court challenges to the Affordable Care Act. https://t.co/QdYv7jeVbs","date":"Tue Feb 04 23:32:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There was a time when a president's list of \"enemies\" meant to be targeted by the executive branch was damning evidence.\n\nThere was also a time when the Senate cared about evidence or the rule of law, regardless of party affiliation.","date":"Tue Feb 04 02:47:22 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I led a letter to NCUA asking the agency not to sell off taxi medallion debt. NCUA should not be throwing taxi drivers to potentially predatory debt collectors &amp; financial strain, not just when some lenders are finding fairer solutions. \n\nFull release: https://t.co/s627SmLpgk https://t.co/jPugYYyEkO","date":"Mon Feb 03 20:58:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Come join next Saturday! Details below 👇🏾 https://t.co/3PsGIya7cr","date":"Sun Feb 02 01:18:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"What a historic sham.\n\nThe cameras of history will remember this moment. I'm comfortable how it will have remembered my record. I truly wonder if the Senators who voted against witnesses will be comfortable with theirs.","date":"Fri Jan 31 23:35:20 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The US has been a leader in funding R&amp;D and initiatives to combat NTDs, which impact 1/6 of the world's population. But we can't rest on our laurels. Let's redouble our efforts to #beatNTDs and make communities across the globe healthier and more prosperous. #WorldNTDDay","date":"Thu Jan 30 22:06:45 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"https://t.co/TeWP6u4qhu","date":"Wed Jan 29 19:41:38 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Mob boss.","date":"Wed Jan 29 17:04:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"\"We have to correct misinformation in real time.\" \n\nGood on @HeidiNBC and every other reporter there who had her back. This is journalism.","date":"Wed Jan 29 15:16:28 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If you haven't been able to tune in to Trump's defense today, here's a recap:\n\nThe lawyers have talked about everything but the facts and evidence surrounding Trump's abuse of power. They don't have a defense that holds water under the slightest of scrutiny.","date":"Mon Jan 27 21:46:40 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This flys in the face of everything our nation of immigrants stands for. McConnell stealing the Supreme court will have long-lasting effects, and this is just one of them.","date":"Mon Jan 27 18:49:47 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"ICYMI, see me dscuss national and local politics with Marvin Scott on Pix11 from this Sunday.\nhttps://t.co/Gr8IJ3scFP","date":"Mon Jan 27 15:28:14 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Kobe wasnt a only legendary athlete on the court. His love for his family and work off the court made him a stand out role model - one of the greats who inspired awe.\n\nRIP #Kobe, Gianna and all involved in today’s tragic crash. My thoughts are with their family and loved ones.","date":"Mon Jan 27 02:33:10 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The truth always comes out. Will Republicans in the Senate continue to bury their heads, or will they finally let the American public know the facts by calling Bolton to testify.","date":"Mon Jan 27 01:48:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tune in tomorrow at 6:30am to Pix11 and see me join Marvin Scott to discuss impeachment, my work on my subcommittee, and our For the People agenda this Congress.","date":"Sun Jan 26 00:26:26 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The census is critically important to New Yorkers. Come learn how you can find employment for a great cause Friday, Feb. 7th. 👇🏾 https://t.co/wJWz69cN6r","date":"Fri Jan 24 17:07:00 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Another smoking gun from the constitution's execution by firing squad.","date":"Fri Jan 24 17:00:28 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As I continue to monitor the situation regarding the #coronoavirus, I have addressed a letter to @StateDept and @CDCgov asking for clarification on the steps being taken to prevent the outbreak from spreading through JFK. https://t.co/Gcvg3G7k1w","date":"Fri Jan 24 16:08:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Great morning joining Marvin Scott on Pix11 to discuss what’s happening in Congress and the issues we’re working on to help New Yorkers. https://t.co/9dIw8wUjgo","date":"Fri Jan 24 15:52:48 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I am very concerned about these announced changes to FICO. This will undoubtedly further hurt low income and underbanked communities.  It once again raises questions about the accountability of credit reporting agencies and the FICO system. https://t.co/PGiOggJXKG","date":"Fri Jan 24 15:20:29 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Same. That's why it'd be great if the President of the United States wasn't abusing his office to game the election.","date":"Fri Jan 24 01:14:13 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This week I traveled with a Congressional delegation to #Guyana with House Foreign Affairs Western Hemisphere Subcommittee Chairman @RepSires and @RepYvetteClarke to meet with Guyana's leadership. Read more here: https://t.co/7dKZrOTxkZ https://t.co/FIg8FpokE7","date":"Thu Jan 23 15:54:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"He also admitted to inviting foreign nations meddle in our election on live TV. \n\nOr as Republicans in the Senate would call it, irrelevant evidence.","date":"Wed Jan 22 17:06:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Ten years ago today, the Supreme Court made the destructive decision to allow unlimited anonymous donations to campaigns, fundamentally hurting our democracy. One of the first actions Democrats took after taking back the House was passing HR1 to #EndCitzensUnited.\n\n#ForThePeople https://t.co/WRqMioXXHL","date":"Tue Jan 21 20:44:42 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This morning I had the pleasure of joining a panel at Jack &amp; Jill’s MLK event with State Sen @LeroyComrie, Assembly Members @clydevanel and @AliciaHyndman, and Council Member @DRichards13. https://t.co/nFtIK8FgdY","date":"Tue Jan 21 01:13:12 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"“History will have to record that the greatest tragedy of this period of social transition was not the strident clamor of the bad people, but the appalling silence of the good people.\"\n\n-  Dr. Martin Luther King Jr., December 3, 1959. #MLKDay","date":"Mon Jan 20 18:54:47 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"“Brazen and Unlawful” - title of his memoir. https://t.co/PP4SH0QrlJ","date":"Sun Jan 19 00:17:23 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Leading a press conference today with the @NYTWA to announce my legislation that would help taxi drivers get financial tax relief when their medallion debt is forgiven. https://t.co/yQcDGO8oRe","date":"Fri Jan 17 14:34:09 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"McConnell may have already indicated that he'll be working with the administration to assist their cover-up, but I hope that at least four Republican Senators uphold their oath of office to get to the truth and call up witnesses with direct knowledge of what transpired. https://t.co/Ne8sTzgStn","date":"Wed Jan 15 22:09:29 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Say what you will about the Bush administration, but at least their Secretary of State had the guts to come to Congress and defend their bogus intelligence on Iraq. \n\nSitting here for the @HouseForeign Committee hearing on Iran and I’m wondering #WheresPompeo? https://t.co/ue35rCtvzI","date":"Tue Jan 14 16:45:21 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The credibility crisis long preceded this latest riff. And \"struggled\" implies there was ever an effort to be factual, which there has not been.","date":"Tue Jan 14 15:17:50 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is terrible. However we must remember that bigoted acts like these are overcome through the solidarity Queens has shown in condemning anti-semitism. \n\nWe remain united holding those with hate in their hearts accountable for actions like these.","date":"Mon Jan 13 23:05:27 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We need to make sure that our financial regulators are taking steps to insulate us from potential cyber attacks. Iran has already demonstrated its aptitude at cyber sabotage, so we need to be prepared in the unfortunate event that tensions with Iran continue to escalate.","date":"Fri Jan 10 19:36:48 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There is so much wrong with this tweet, from false equivalence to bold-face lies. It's incredible that the WH spokesperson is spreading it from the official account.\n\nCome before the WH press corps and say this.","date":"Fri Jan 10 19:02:46 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"\"Or this?\"\n\nhttps://t.co/3zRavUD0bA","date":"Fri Jan 10 18:33:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"\"Hold on just a moment while I look that up for you.\"\n\n\"I found these results:\n\nhttps://t.co/tV6FHcS6lt","date":"Fri Jan 10 18:33:18 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I'll just leave this here: https://t.co/9fp8aQUq5J","date":"Fri Jan 10 18:20:11 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is crazy if it's true. You don't make foreign policy decisions to game your own domestic politics, but Ukraine has already proven that the president isn't above that. \n\nOnly this time that foreign policy decision made - allegedly made for personal gain - was an act of war.","date":"Fri Jan 10 17:59:51 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I voted for a War Powers Resolution to limit Trump's abilities to engage in hostilities with Iran. The reckless strike against Suleimani was not a sign of strength, it was a sign of more disarray and lack of strategic thinking. Congress is meant to be a check and balance. https://t.co/jSpNEBo0cq","date":"Thu Jan 09 22:43:08 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As Chair of the Consumer Protection and Financial Institutions Subcommittee, I look forward to holding a hearing on the status of 409ks in America.","date":"Thu Jan 09 19:14:56 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Meeting with @nyuniversity Abu Dhabi students about the importance of dialogue and restoring bipartisan cooperation to overcome challenges. https://t.co/ZMUpSJx7U8","date":"Thu Jan 09 17:18:26 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tune in at 8:30am ET!","date":"Thu Jan 09 13:19:08 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I was here in 2002, and though I voted against the Iraq threat, we at least had the opportunity to ask questions and try to verify the claims they were making. \n\nToday's classified briefing stands in stark contrast. For a matter this serious, they gave us nothing. https://t.co/67GoUBnw9G","date":"Wed Jan 08 23:57:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"•ISIL operations on pause &amp; US presence in Iraq at risk.\n\n•Shiites throughout the region are livid with US.\n\n•Iranian hardliners get to say “I told you so” to moderates who risked negotiating with us.\n\n•Iranian people are more united against us\n\nBy what metric is this a win?","date":"Wed Jan 08 22:48:07 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"After exiting the classified briefing, I remain completely unconvinced that this administration had legal justification for its attack on Suleimani. \n\nWhat I’ve learned? Zero.","date":"Wed Jan 08 19:40:16 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump’s bluster is not constructive in reaching a resolution. He scrapped a deal negotiated multilaterally with our allies, now he’s dragging those allies into the diplomatic disaster he himself has created. \n\nThere’s a vacuum of sensible US leadership and everyone can see it.","date":"Wed Jan 08 17:10:57 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Further escalation will only result in more casualties and accomplished little else. American lives do not need to be lost.\n\nThe only way to win this war is to preserve the peace. I urge this administration to find restraint.","date":"Wed Jan 08 15:03:39 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Grossly incompetent.","date":"Wed Jan 08 01:50:45 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Heartbroken about the latest disaster to strike Puerto Rico. We must make sure to provide assistance to help victims recover.","date":"Tue Jan 07 19:32:03 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Who could’ve predicted?\n\nThose who advocated for pulling out of the JCPOA owe an explanation as to how this obvious result makes America safer.","date":"Tue Jan 07 14:19:19 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Gang of 8+Fox-Democrats","date":"Tue Jan 07 02:29:05 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Walking over Brooklyn Bridge in solidarity to send a message that there is #NoPlaceForHate and anti-Semitism in New York. https://t.co/00QG7vLnJc","date":"Sun Jan 05 21:57:39 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This president is a habitual liar, and we will need evidence of the imminent threat he's claiming necessitated the strike against Suleimani, a strike which now risks an escalation that can lead to war. It is our duty as a co-equal branch to conduct this oversight. https://t.co/rRJOk2dFj9","date":"Sun Jan 05 01:36:37 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Cut off one head and three more grow back. It's unclear how the strike against Sulemani will keep America safer. If anything, it will create an escalation that can lead to war. We should all be skeptical as to whether this administration has any coherent strategy. https://t.co/goKYWDCw2p","date":"Sat Jan 04 22:20:41 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Yesterday I joined my colleagues to call for more funding to combat domestic terrorism like the anti-semitic attacks in Monsey and Jersey City. Hate has spread like a cancer throughout our nation and we must do more to stop it in its tracks. https://t.co/SRgdl4WPS7","date":"Fri Jan 03 15:23:22 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My full statement on the strike that killed Iranian General Suleimani: https://t.co/IoU0qLKcmy https://t.co/IFSbHpGNvc","date":"Fri Jan 03 14:07:22 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump has been played time and again by Kim, taking advantage of Trump’s lack of strategy and reality TV diplomacy to gain concessions in exchange for nothing.","date":"Wed Jan 01 19:00:55 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"https://t.co/dBzblmPmKO","date":"Wed Jan 01 18:40:31 +0000 2020","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If anyone can beat the odds, it is my good friend and lifelong fighter John Lewis. I've never known a stronger will than his. \n\nPraying for our living legend as he prepares for the fight ahead.","date":"Mon Dec 30 17:03:34 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Devastated by the horrific attack in Monsey last night. This string of anti-Semitic attacks and rising hate crimes is deeply concerning, and New York has zero tolerance for it. \n\nMy thoughts are with the victims, their families, and the Jewish community. \nhttps://t.co/PbXMk4rf6j","date":"Sun Dec 29 13:40:21 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"From my family to your, Merry Christmas! https://t.co/MW9nGQzTiN","date":"Wed Dec 25 15:27:20 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Sham justice, conducted with the blessings of the United States Presidential seal.","date":"Mon Dec 23 23:57:46 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Pretty clear what was happening here. Any evidence to the contrary is welcome. \n\nAnyone not interested in hearing testimony from Mulvaney and his staff have allied themselves to a cover-up.","date":"Sun Dec 22 19:34:21 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"“DEP accepts responsibility”– good.\n\nI commend the City for addressing the pipe failure &amp; helping residents file claims. But a 30yr old pipe shouldn’t collapse. Look forward to working with the City to get people back home &amp; prevent this from recurring.\nhttps://t.co/3zQaRSvCIk","date":"Thu Dec 19 20:10:43 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thanks to Democratic leadership, the #USMCA builds and improves on our trade agreement with our closest trading partners, while protecting workers and the environment. https://t.co/MHR50qyMeU","date":"Thu Dec 19 16:51:54 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"\"Now these senators seem eager to endorse the very behavior they feared\" \n\nhttps://t.co/wZUUN10LTr #Impeached45 https://t.co/dQH4VWlzoK","date":"Thu Dec 19 15:36:48 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is not about animosity, as McConnell suggests, it is about abuse of power. Many of us, including Republican Senators, have long recognized Trump's proclivity for acting in his own interest. #impeachment","date":"Thu Dec 19 15:07:24 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":".@marcorubio: \n\nTrump is \"a con artist” \n\n\"dangerous\"\n\n\"an embarrassment\"","date":"Thu Dec 19 15:07:23 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":".@MittRomney: \"Dishonesty is Trump's hallmark\"\n\n\"He's not of the temperament of the kind of stable, thoughtful person we need as leader. His imagination must not be married to real power.\"\n\n\"Trump is, indeed, a phony.\"\n\n\"His promises are as worthless as a degree from Trump U\"","date":"Thu Dec 19 15:07:23 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If Senator McConnell wants to rattle off quotes from my colleagues in the House critical of Trump, as though that undermines our objectivity on impeachment, will he do the same with his colleagues? #Impeachment THREAD","date":"Thu Dec 19 15:07:23 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":".@LindseyGrahamSC:\n\n\"You know how you make America great again? Tell Donald Trump to go to hell,\"\n\n\"He's a race-baiting, xenophobic, religious bigot,\"\n\n\"He's the ISIL man of the year.\"","date":"Thu Dec 19 15:07:23 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"When Republicans bemoan impeachment and say “let’s get back to work”, this must be what they mean, taking healthcare away from countless Americans.","date":"Wed Dec 18 23:10:53 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We did not free ourselves from a King to turn the President into a monarch. https://t.co/naeYdP7YaW","date":"Wed Dec 18 22:51:44 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@CosWygs @kenanthompson It wouldn’t be the first time 👀","date":"Wed Dec 18 22:41:10 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It's unsettling how many U.S. Representatives are comfortable speaking verifiable falsehoods and outright lies to the American people during this historic moment. #impeachment","date":"Wed Dec 18 20:15:15 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We arrive today at impeachment as a result of President Trump's own conduct, his abuse of power for personal political gain. If the President had exculpatory evidence, he would have provided it instead of and obstructing Congress. See my interview this morning with @patkiernan https://t.co/G2qtJYG2F4","date":"Wed Dec 18 18:20:59 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is great news. Glad she's back home with her family. \n\nThankful for the NYPD's great work.","date":"Tue Dec 17 20:58:16 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I would not be the lawmaker I am today without my degree and experience from @howardlawschool. Joining my colleagues as @SpeakerPelosi signs the #FUTUREAct, which secures investment in HBCUs and MSIs to provide opportunity for students of color. https://t.co/FXOmkKeX4T","date":"Tue Dec 17 19:56:47 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump blocked witnesses, stalling for time while continuing to meddle in 2020. Because Dems didn't capitulate to obstruction, McConnell twists that into cause for not calling those witnesses.\n\nEvidence is clear. But, as McConnell admitted, he will work hand in glove to help Trump","date":"Tue Dec 17 15:49:34 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump’s invitation of foreign interference in 2020 is very much ongoing. Our republic is under siege in real-time and Republicans in Congress would rather cover up for the President than do anything about it.","date":"Tue Dec 17 14:30:01 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today's Articles of Impeachment were brought on by the President's own flagrant abuse of power, his unprecedented obstruction of Congress, and his continued attempts to interfere in 2020.\n\nIf this is not impeachable, what is?\n https://t.co/a3P2w7hbhd","date":"Fri Dec 13 20:00:02 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"When you send your child to college, you want to know they're safe. As a parent, this tragedy is your greatest fear. It breaks my heart. \n\nMy thoughts are with her family.","date":"Fri Dec 13 19:51:40 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Good news for the Jamaica Readiness center! Looking forward to seeing construction completed. https://t.co/CYhEDZ0Uat","date":"Fri Dec 13 18:51:44 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"“No quid pro quo” is Trump’s “I am not a crook”.\n\nSaying it doesn’t make it true.","date":"Fri Dec 13 17:21:31 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Proud to have had my MDI bill passed out of committee. This would be a big step towards helping banks and credit unions serving under-banked minority and low-income communities. Read more: https://t.co/DWBzbJf2ee https://t.co/Q5czJdPI6m","date":"Thu Dec 12 22:03:38 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Caught with the knife already halfway in, that is.","date":"Thu Dec 12 15:43:51 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@SelvenaBrooks31 @LisaAdele7 @nyc311 @DRichards13 @Stacey23AD @JSandersNYC Thanks for flagging. I'm reaching out to find out the status and see what's being done.","date":"Thu Dec 12 14:43:33 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Lots of Democratic victories in the NDAA, including a major victory giving millions of workers paid family leave for the first time. \n\nAlso proud to have passed my section that would prohibit the naming of DOD assets after Confederate leaders/victories: https://t.co/gN5U9uEAEC","date":"Wed Dec 11 23:00:31 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Not even trying to dress up the racism anymore. Just straight calling immigrants dirty. \n\nImmigrants in NYC are:\n\n- 37% the population\n\n- 43% its work-force.\n\n- 1/3 its economic output.\n\n- Half its entrepreneurs.\n\n- living mostly in BK, Bronx &amp; the *WORLD'S* borough of Queens.","date":"Wed Dec 11 19:55:34 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is not funny, this is threatening and dangerous.\n\nAlso, my staff informs me this clip is when he snapped and failed. How apropos.","date":"Tue Dec 10 21:05:16 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"They already paid the bribe.","date":"Tue Dec 10 20:56:25 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"What do you value it at? \n\n@GOPLeader @senatemajldr https://t.co/xaJR3Bav2D","date":"Tue Dec 10 19:25:32 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Speaking at \"Haiti on the Brink\" hearing, reiterating the concerns I expressed with my colleagues in a letter to Sec. Pompeo regarding the prolonged political and humanitarian crisis in Haiti. We continue to support the Haitian people and a peaceful resolution to the crisis. https://t.co/XH0yCokLUm","date":"Tue Dec 10 17:27:12 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Our responsibility is to the republic and its preservation. It is under the gravity of that oath to the constitution that we move forward with #ArticlesOfImpeachment. I know of no Representatives that take joy in this obligation, I sadly know too many who disregard it.","date":"Tue Dec 10 14:30:32 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This will go a long way towards having every person counted, especially given the attempts by this administration to scare people into the shadows.","date":"Mon Dec 09 19:12:52 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I see Rep. Collins has resumed the breakneck filibustering after the powerful cross examination by Berke made the case open and shut against the President.","date":"Mon Dec 09 18:44:02 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I joined my colleagues in government for the Expo to provide resources which help to end gun violence in our community. Thank you Pastor Eli Wilson for your support on this effort as well. https://t.co/lne4IGuciz","date":"Sun Dec 08 02:38:09 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Not long ago black Americans fought and shed blood for our right to vote. Yet the Supreme Court in 2015 declared racism over and gutted the Voting Rights Act, opening the door to voter suppression. \n\nToday we fought back these efforts to disenfranchise voters and passed #HR4","date":"Fri Dec 06 18:16:31 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Over a trillion dollars in taxes were cut for the wealthiest corporations under the Republican tax bill last Congress.\n\nNow they're taking the food off the table of food-insecure families. Another in a line of GOP attacks on working families. Outrageous.\n\nhttps://t.co/LjsZ5UT1sN","date":"Wed Dec 04 21:09:12 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"You know what would prolong impeachment proceedings? \n\nTestimonies from Mulvaney, Giuliani, Boltn, Pompeo, President Trump, etc.","date":"Wed Dec 04 17:46:14 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Trump called Zelensky the day after the Mueller investigation came to an end. What will happen the day after Ukraine? Where's it end? \n\nI hope my colleagues across the aisle consider the precedent this sets. It should keep anyone with respect for the constitution up at night.","date":"Wed Dec 04 17:24:36 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"What is the case for impeachment? \n\nBecause there's no indication the President his abuse of power given the obscene level of cover Republicans have afforded him. \n\nIn fact, there's evidence to the contrary. Exhibit A:","date":"Wed Dec 04 17:19:35 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Professor Karan highlighting how small the partisan theatrics by my Republican colleagues are given the scope of what’s at stake: our Republic. \n\nWhere are our patriots? #ImpeachingHearings","date":"Wed Dec 04 15:56:27 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"No.","date":"Wed Dec 04 15:52:23 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The only thing \"calling into question the legitimacy\" of our institutions is the blind fealty of my Republican colleagues, who even now can't argue the clear facts of what Trump conspired in Ukraine. \n\n#ImpeachingHearings","date":"Wed Dec 04 15:30:19 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"ICYMI, one of NY 5th Congressional District's own passed away last week. A true trail blazer, Barbara Hillary was an inspiring presence and always a joy to talk to. She'll be dearly missed, and always remembered. https://t.co/e9cbSwOEVl","date":"Wed Dec 04 15:00:21 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"How long before Trumps say he doesn't know Giuliani, but he hears he's a very good guy?","date":"Tue Dec 03 19:51:16 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As we announced yesterday with the Mayor, the City will procure emergency contractors to clean homes affected by the sewer blockage.\n\nMeanwhile, the Service Center at the Courtyard Marriott located at 145-11 N Conduit Ave will be open 9am-8pm through Friday for assistance. https://t.co/yMgSQYnhjm","date":"Tue Dec 03 16:55:45 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The terrorism he shrugged at when ISIS escaped as a result of his abandoning the Kurds? That terrorism?\n\nAll roads lead back to Putin.","date":"Tue Dec 03 14:45:13 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We in NYC believe that one's immigration status should have no bearing on their ability to open a bank account or access other financial services. \n\nIDNYC lets you do exactly that plus much more, regardless of your status. Renew/enroll today at https://t.co/gqUm4rvUMW https://t.co/f9ucmyDijN","date":"Mon Dec 02 17:02:09 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"All of the bills passed in the House are waiting in Mitch's graveyard.\n\nNot only is Trump and his Republican defenders obstructing the impeachment investigation, they're obstructing our legislative duty to the American people.  https://t.co/T6BNQXJdhJ via @voxdotcom","date":"Mon Dec 02 16:15:21 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"From my family to yours, wishing everyone a very happy Thanksgiving spent with loved ones!","date":"Thu Nov 28 17:23:15 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Giving up my Thanksgiving cooking recipes before going live. Tune in on CNN now to hear me discuss the latest on impeachment. https://t.co/9wejNY0zGL","date":"Wed Nov 27 17:56:59 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Critical military aid was released only after Trump was caught at the scene of the crime. Not sure why Republicans believe that was ever a convincing line of defense.","date":"Wed Nov 27 15:13:57 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Just, wow. \n\nThe Lester Holt interview has a sequel and it solidifies the President's confession to obstruction.","date":"Fri Nov 22 15:49:07 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"He is repeating a debunked conspiracy theory, which testimony this week rightfully called out as Russian talking points. \n\nNews hosts shouldn't be in the business of coaching/babying the President of the United States out of impeachable conduct. They shouldn't even entertain it.","date":"Fri Nov 22 15:43:20 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@RepDonBeyer When lacking an argument, just yell incredulously.","date":"Wed Nov 20 19:00:13 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"And you don't need to be Alan Turing to crack it.","date":"Wed Nov 20 18:08:09 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"None of the arguments Republicans have made - that it's \"hearsay\", \"no quid pro quo\", \"Ukraine didn't know of hold\" - survive Sondland's testimony. \n\nIndeed there's been no credible good-faith defense of Trump's conduct. \n\nFor the sanctity of our republic, put country over Trump.","date":"Wed Nov 20 15:22:54 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Sondland, who had direct communication with Trump, testifies:\n\n1) There was an explicit quid pro quo at the direction of the President.\n\n2) Ukraine was aware of hold on assistance and uncomfortable with being implicated in US politics.\n\n3) Pompeo, Mulvaney were directly involved.","date":"Wed Nov 20 15:22:53 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This investigation underscores the ugly truth of housing discrimination in America; de facto segregation remains the reality for minority home-ownership. \n\nNot to mention these discriminatory practices are compounded by discrimination in lending.\n\nhttps://t.co/EAUQcJgDVu","date":"Tue Nov 19 21:46:55 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Proud to have cast my vote just now to finally pass the “Improving Corporate Governance Through Diversity Act of 2019”. Now we'll finally have the transparency we need to see and push for more diversity in corporate board rooms and C-suites. https://t.co/C8h1u9CVVG","date":"Tue Nov 19 19:13:39 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"You're right, Mr. Jordan. We didn't expect the President to prove the whistle-blower right by releasing the transcript.\n\nOr by admitting it on the White House lawn.\n\n #checkmateus?","date":"Tue Nov 19 16:50:04 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is entirely shameful.","date":"Tue Nov 19 15:45:59 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I'm very proud to see my bill, the “Improving Corporate Governance Through Diversity Act of 2019”, come to the floor today for a vote.  It is the culmination of years of work dedicated to making the highest levels of corporate America begin to reflect the diversity of America. https://t.co/KJvFtfo656","date":"Mon Nov 18 23:29:40 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The reality tv foreign policy with NK has produced zero results while still providing Kim Jong-un the concession of cancelled joint exercises with SK. For what?\n\nThese exercises are necessary, yet Trump gladly compromises our national security interests for his own optics.","date":"Mon Nov 18 15:51:08 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thank you to everyone who came to my town hall last night and joined in the conversation. Special thanks to District Leader Richard David for putting together this meeting in Richmond Hill. https://t.co/XJXfy0X1wZ","date":"Mon Nov 18 02:00:24 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The American public heard testimony this week from dedicated public servants whose reputations are beyond reproach. They heard in vivid detail the shadow foreign policy conducted by Giuliani and Trump which put the President's political interests above our national security. https://t.co/AHi0LB7I4J","date":"Sat Nov 16 20:40:25 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The Republicans of today would be sitting at Nixon's impeachment saying, \"none of this matters until we find out who let it slip that there are tapes.\"\n\nThis isn't about who the whistle-blower is, but what he blew the whistle on, which is corroborated. What a flimsy defense.","date":"Fri Nov 15 18:35:30 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Just like \"she's going to go through some things\" wasn't a threat, it was speculation, which he's entitled to.","date":"Fri Nov 15 18:27:26 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Rs keep wanting to come back to the javelins provided by this administration to illustrate that Trump's foreign policy is good for Ukraine, and therefore our national security.\n\nExcept all that underlines is how damaging it is for Trump to hold that vital assistance hostage.","date":"Fri Nov 15 18:08:13 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"At this point Castor's line of questioning is more helpful to Democrats than to Republicans.","date":"Fri Nov 15 17:59:56 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"So the Republican lawyer's line of defense is now being built on the integrity of Ambassador Taylor? Noted.","date":"Fri Nov 15 17:33:53 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"One tactic employed by Rs is comparing impeachment proceedings to the Mueller investigation, what they call a \"hoax\".\n\nToday, Trump's adviser was found guilty of lying about his contacts to Wikileaks, what our intelligence assessed Russia of having used to interfere in 2016.","date":"Fri Nov 15 17:21:26 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Ambassador Yovanovitch testifies that Giuliani looped in corrupt Ukrainian henchmen (now arrested) to hijack foreign policy for Trump's personal interests.\n\nAll while Trump continues to intimidate this witness live on Twitter.\n\nDumbfounded by what Republicans will excuse.","date":"Fri Nov 15 15:48:42 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"And it used to matter for Republicans...","date":"Fri Nov 15 15:15:59 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The American publican can see for themselves that Ambassador Yavonovitch is principled, dedicated and a patriotic public servant. These are the caliber of individuals who we entrust carrying out U.S. policy. That used to matter at 1600 Pennsylvania.","date":"Fri Nov 15 15:15:17 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Minority Banks disproportionately serve low income, underbanked, minority communities. Their decreasing numbers, combined with irrefutable data on banking discrimination in non-minority banks, is a systemic problem I am working hard to address. https://t.co/4sgECY8oHv","date":"Thu Nov 14 22:05:22 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I continue to be disappointed by the OCC go-it-alone approach on CRA modernization.  Banking discrimination &amp; the legacy of redlining continues to harm minority communities nationally. Focus must remain on under-banked, minority, low-income communities.  \n\nhttps://t.co/yCsTSueG5u","date":"Thu Nov 14 21:43:05 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The cost of insulin has doubled in just four short years. This is unconscionable. \n\n@housedemocrats passed H.R. 3 as a first step to #Lowerdrugcosts for all Americans. #wolrddiabetesday https://t.co/GxIYAT4ej2","date":"Thu Nov 14 19:30:15 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As co-chair of the Congressional Brazil Caucus with @RepLaHood, it was my pleasure to welcome a delegation of Brazilian Congresswomen. We must continue to champion and elevate the power of women in all facets of society, here and abroad. Look forward to working together. https://t.co/0QhTlJUtrG","date":"Thu Nov 14 17:24:56 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Heartbroken by these reports. My thoughts are with the victims and their loved ones. \n\nWe need to stop this constant cycle of gun violence at our schools.","date":"Thu Nov 14 17:09:01 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Meeting Lech Wałęsa, the first democratically elected President of Poland, who’s testifying before our subcommittee today on the importance of the NATO alliance. We must continue to work multilaterally to promote and retain our shared democratic values. https://t.co/BPQTF2Tqsm","date":"Wed Nov 13 23:24:24 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Join us this Saturday, November 16th, from 11am-1pm for U.S. Service Academy Day! https://t.co/RipLy3s11W","date":"Wed Nov 13 21:51:35 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My statement on the anniversary of the La Saline Massacre, urging Haiti to hold those responsible accountable for their actions: https://t.co/4M4Lo1KIzV https://t.co/OK7NHWD4JP","date":"Wed Nov 13 21:31:09 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@IAmSouare Hello,\n\nPlease call my office at 202-225-3461 and ask to speak to Reggie. Thanks!","date":"Wed Nov 13 19:05:16 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As for #3, Taylor's testimony already reveals that Zelensky understood this would have been political meddling and was reluctant. \n\nRs are trying to obfuscate the facts by drowning the public in noise. I trust reporting will render clear the substance of today's testimony","date":"Wed Nov 13 18:39:57 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Republican strategy so far:\n\n1) Fringe conspiracy theories;\n \n2) Retconning the Ukraine call by saying that Trump's ask was about DOJ's probe. (it wasn't);\n\n3) Assurances from Zelensky, a hostage at Trump's gunpoint, that everything is on the level.\n\nNot looking well.","date":"Wed Nov 13 18:14:33 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Now it is clear to the American public why us Members of Congress present for Mr. Taylor's deposition were left in utter shocked. \n\nThis is the threat our democracy faces. The conduct this testimony reveals is indefensible and damning.","date":"Wed Nov 13 17:01:10 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The indiscriminate rocket attacks on Israel are a reminder of the danger its citizens face daily. The United States stands by Israel, and supports its right to defend itself.","date":"Wed Nov 13 16:23:36 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The vast majority of Americans understand that Dreamers were brought to this country through no choice of their own, and their #HomeIsHere. For many Dreamers it’s the only home they’ve ever known.\n\nThe House has passed the Dream and Promise Act, the Senate must act, and act now.","date":"Tue Nov 12 19:04:12 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We can never fully repay the debt owed to those who’ve served or continue to serve our nation, but on #VeteransDay we honor them for all they’ve given, and all they’ve sacrificed. Happy Veterans Day to all vets and their families. https://t.co/nqbBaDb0pP","date":"Mon Nov 11 16:19:44 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Republicans couldn’t defend substance so they attacked process. Can’t deny the conduct so they’ll try to legitimize it. \n\nThey’re telling the American public, ”who will you believe? Me or your lying eyes?” \n\nDon’t let it fool you. https://t.co/TBhto8XF91","date":"Thu Nov 07 18:08:27 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Now that transcripts are public, the American public can read for themselves the shocking testimony Taylor provided. And they’ll soon see and hear for themselves in public hearings both his character and claims that my colleagues across the aisle have been unable to discredit. https://t.co/zkxE3HmhX5","date":"Thu Nov 07 18:04:47 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"👇 Don't forget to vote! #VoteOnNov5 #nycvotes","date":"Tue Nov 05 16:18:51 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Yes, it is extraordinary. \n\nAs were the emails we’ve recently learned were collected in the Mueller investigation, showing his campaign was briefing Hannity. \n\nAnd past reports that Trump phones him every night. \n\nExtraordinary.","date":"Mon Nov 04 21:59:43 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I warn those close to the President who are not telling the truth this: Everyone close to Richard Nixon, except for Richard Nixon, went to jail. \n\nIf they are not being truthful, if they continue to cover-up his abuse of power, they risk the same consequences for themselves. https://t.co/quaElL1vqG","date":"Sun Nov 03 23:36:02 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"What is clear to me is that there was a scheme to cover-up President Trump's seismic abuse of power. The whistle-blower complaint has been consistently corroborated, and the public will soon see, hear and determine for themselves the veracity of these damning testimonies. https://t.co/Rsyunm4cQQ","date":"Sun Nov 03 23:21:21 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I’ll be on @CuomoPrimeTime early in the 9pm ET hour to discuss the latest on impeachment proceedings. Tune in!","date":"Sat Nov 02 00:45:53 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tune in!","date":"Thu Oct 31 20:37:32 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"When the constitution is under attack, when the fairness of our elections are compromised by an abuse of presidential power, we have the solemn responsibility to act. To do nothing would imperil our very democracy.","date":"Thu Oct 31 16:35:29 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Met one of my constituents of New York’s 5th. They tell me he may be famous. @50cent https://t.co/Lcvc3oKH22","date":"Wed Oct 30 22:25:24 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"All roads lead to...","date":"Wed Oct 30 17:04:54 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Critical win. It's a shame we had to fight for them to stand down on this abhorrent policy.","date":"Wed Oct 30 14:36:17 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I think it's past time Senator McConnell grabs a shovel to dig up all the House passed bills he's buried. \n\nHouse Democrats are working #ForThePeople; stop obstructing and start helping.\n\n#McConnellGraveyard https://t.co/VYXveWxmbM","date":"Tue Oct 29 20:23:23 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"What evidence is there that this administration's policy has done anything but worsen the situation with Iran? They abandoned the one thing keeping Iran from a nuclear weapon, the JCPOA.\n\nLike on healthcare, they were always heavy on repeal, and nothing on replace.","date":"Tue Oct 29 18:52:23 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"@jbarro @allahpundit Right, no Member would have the courage to introduce the AIR BUD Act - Affirming the Intent to Restrict the Balloting of Unauthorized Dogs Act","date":"Mon Oct 28 21:21:35 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Rep.. John Conyers spent his life in service to ridding the world of inequality, both racial and economic. The CBC will continue to work on advancing the priorities he co-founded the caucus to achieve. \n\nHe was an inspiration, and a friend. My thoughts are with his loved ones.","date":"Mon Oct 28 19:08:24 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tune in at 1:25pm ET!","date":"Mon Oct 28 16:34:47 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Grateful to the intelligence community and military for neutralizing al-Baghdadi, but it’s important to note that this operation risked being compromised because of the President’s Syria decision. \n\nWe should all be concerned by the cascading effects of his abrupt withdrawal.","date":"Mon Oct 28 15:04:26 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Because there was no there there. Compare that with the increasingly damning picture we have of this President's shadow foreign policy and it's clear to see why Republicans are making a circus around these revealing depositions. \n\nTheatrics because they can't defend the substance","date":"Wed Oct 23 21:12:35 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"About to go live. Tune in!","date":"Wed Oct 23 20:14:32 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Actions matter more than words. Mr. Zuckerberg was unable to answer whether Facebook, if it is so interested in servicing the under-banked, works with any Minority Depository Institutions. \n\nFacebook has a credibility problem, and not just on its supposed intent with Libra. https://t.co/jwfKPDLIuT","date":"Wed Oct 23 17:55:28 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I was completely shocked and astounded by what I learned from Mr. Taylor's testimony. It is clear that President Trump's shadow foreign policy was an abuse of power for selfish political ends that endangered U.S. national security. \n\nICYMI - My interview on @AC360 https://t.co/0evoXTFXzH","date":"Wed Oct 23 15:58:38 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Waiting for the goal post to once more be moved.","date":"Wed Oct 23 14:56:51 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Since this bears repeating, this President has not been thwarted from within, he has only become more emboldened to act on his more authoritarian inclinations. \n\nWe need patriots to come forward.  https://t.co/qZVal2ej1S","date":"Tue Oct 22 19:16:17 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If you’re rich/famous it’s not illegal seems to be Trumps prevailing theory of jurisprudence.","date":"Mon Oct 21 17:25:53 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Roll the tape.","date":"Thu Oct 17 22:01:42 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"\"This was a great thing for the Kurds\"\n\n...","date":"Thu Oct 17 18:26:31 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If the strategy was bury one scandal - that the President is enriching himself off the G7 - with even more explosive news, it worked.\n\nMulvaney admitted Ukraine aid was tied to an investigation into Trump's political opponents.","date":"Thu Oct 17 17:24:23 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"So now his advertising is coming straight from the White House?","date":"Thu Oct 17 16:53:04 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Unbelievably brazen. Taxpayer and foreign money funneled right to his own club as a result of a decision he is making as President.","date":"Thu Oct 17 16:52:18 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I came to Congress in 98. Elijah, who came just two years before me, was among the first to make me feel at home. I was always moved by how his voice carried command, garnered respect and inspired hope. Glad I got to know him and could say he was my friend. May god bless his soul","date":"Thu Oct 17 13:59:26 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Other nations are not taking the United States seriously as a result of this administration's incoherent foreign policy.\n\nThis just gives them another reason.","date":"Wed Oct 16 21:12:13 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Brushing past the inconsistencies and lies... It's unnerving that he talks about our military like it's a PMC for foreign governments.","date":"Wed Oct 16 17:44:54 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Even if he isn't stalling, Erdogan wanting Trump to do the talking is predictable. He's already rolled him once, he's confident he can do it again.\n\nTrump lowered the drawbridge and invited Turkey in on our allies. This admin doesn't grasp how difficult it'll be to reverse course","date":"Wed Oct 16 14:42:15 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As Co-Chair of the JFK Redevelopment Community Advisory Council, I've been focused on making this not just an investment in infrastructure, but an investment in the working families &amp; students of Queens. Announced today new business/workforce development and education initiatives https://t.co/I0cyVyNjfr","date":"Tue Oct 15 20:44:35 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The #Collegeaffordabilityact is a much needed step toward closing the opportunity gap for students of color and breaking cycles of poverty. As someone who was the first in his family to go to college, I want all students to have the opportunity to get an affordable degree. https://t.co/c4MLtCFKsh","date":"Tue Oct 15 20:26:05 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"And grenades don't go off without someone pulling the pin, which President Trump was more than eager to do.","date":"Tue Oct 15 18:33:18 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is beyond vile. And yet, who is surprised when the President himself has flirted with inciting language and calls for civil war? Who attacks the press daily?\n\nThe President has been playing a dangerous, dangerous game.","date":"Mon Oct 14 12:55:57 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"While in London at the NATO Parliamentary Assembly Annual Session, I was elected to be the Vice Chairman of the Economics and Security Committee. Honored to serve as Vice Chair as we work to address challenges both new and old for our alliance. #NATOPALondon https://t.co/vjrRH73v5P","date":"Sun Oct 13 15:51:42 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Happy international #DayoftheGirl. Let's continue working to empower girls all around the world with access to education and support to achieve their dreams.","date":"Fri Oct 11 17:25:29 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"It is a dangerous time in our nation's history when this requires repeating.","date":"Fri Oct 11 17:10:27 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Unbelievable. The value of the American word shrinks each day this President remains the occupant of 1600. Another dismal day for U.S. foreign policy and global leadership under Trump.","date":"Wed Oct 09 21:10:22 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Nothing in the White House's explanation for not cooperating holds legal water. Nowhere is there a requirement for a full House vote to pursue our impeachment inquiry.\n\nWe are not going to let the subject of our investigation dictate how we conduct that investigation. Full stop. https://t.co/3P1SosJTVS","date":"Wed Oct 09 17:01:42 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Yesterday I joined my colleagues @RepMaloney and @NydiaVelazquez for a round-table meeting on the Terrorism Risk Insurance Act where we had a dialogue with industry stakeholders on #TRIA re-authorization. https://t.co/NQAzD4wDrT","date":"Wed Oct 09 14:57:21 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Given this history of discrimination and disinvestment in America, any changes to the CRA must hold lenders accountable for meeting the local credit and investment needs of LMI communities. The letter @SenSherrodBrown and I led in sending to regulators: https://t.co/45qnXELqBF https://t.co/J7UiuCQKji","date":"Tue Oct 08 15:54:15 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"That the President abused his office for personal political gain is indisputable. He admitted to it. Our job now is to uncover the complicity of his administration.\n\nPatriotism does not mean blind loyalty to Trump. Patriotism means coming forward to defend our institutions. https://t.co/9PTnBVbLfr","date":"Mon Oct 07 21:34:00 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My statement on Trump's reversal of US policy towards Syria, and endangering our allies: https://t.co/oqln5bSkrV https://t.co/UsIdwrbmmK","date":"Mon Oct 07 20:22:54 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Thousands in HK are peacefully protesting in support of the same freedom of speech that makes America great. Meanwhile, Trump sold them out to Xi Jingping on a call hidden on a code-word server.\n\nGOP's more worried about covering that up than standing up for freedom.\n\nShameful.","date":"Mon Oct 07 18:48:48 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"About to go live on CNN, tune in!","date":"Mon Oct 07 15:39:03 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"I hosted a town hall today about gun violence and gun reform. The House did its job, now the Senate must stop stonewalling our legislation to implement universal background checks and close the gun show loophole. \n\nThank you to everyone who came. https://t.co/Z7wGAuU6Kj","date":"Sat Oct 05 20:25:17 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"ICYMI:","date":"Sat Oct 05 20:19:24 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"So Kushner's secured peace in the Middle East, then?","date":"Fri Oct 04 18:38:01 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Anyone else tired of telling the American public that the sky is green should join Senator Romney. There's no credible defense of this blatant misconduct.","date":"Fri Oct 04 16:37:11 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"When investigating Sec Clinton, Pompeo said it'd be \"investigatory malpractice\" if she wasn't interviewed. Now he's stonewalling witnesses from speaking to Congress.\n\nOur duty is to uncover what transpired. It'd be investigatory malpractice not to use every tool for that purpose. https://t.co/8Iz9B1ppzP","date":"Thu Oct 03 15:55:58 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Just as Trump doubled down after the Mueller report by saying it’s okay accept foreign interference, he is now doubling down after Ukraine by saying it’s ok to solicit foreign interference. \n\nThis will not end here. Are my colleagues across the aisle comfortable knowing that?","date":"Thu Oct 03 15:31:36 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"See my statement on the Guyanese election announcement. Read here: https://t.co/rQU2pzUusg https://t.co/ZzkTzpjj69","date":"Thu Oct 03 00:15:02 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Went with a delegation of my colleagues and USAID to visit the Bahamas to see firsthand the damage caused by the hurricanes. Happy to stand by our neighbors in the Bahamas and help them get aid as they work to recover. https://t.co/IG2oRAB9Bd","date":"Tue Oct 01 23:50:25 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"👇","date":"Mon Sep 30 19:58:06 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"A tragic loss. My heart goes out to his family and loved ones, and the NYPD.  https://t.co/x437cFr4s1","date":"Sun Sep 29 21:05:40 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"To those still working on the inside to steer the “steady ship”, it is time to step forward. Our nation does not need covert agents of democracy. It needs intrepid whistleblowers willing to step forward and defend our institutions. https://t.co/qZVal2ej1S","date":"Sun Sep 29 15:37:38 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Rudy Giuliani can't keep his story straight. What was his relationship with the State Department while he was in contact with Ukraine? The House will set out to clear these inconsistencies. https://t.co/xIQ2cvEuYA","date":"Sat Sep 28 19:40:00 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Just read the \"transcript\". Listen to the President's own admissions. It is clear as day that Trump abused his power, inviting a foreign government to meddle in our elections and put national security interests at stake. Now we need to uncover who else was involved. https://t.co/6AbqyFQogJ","date":"Sat Sep 28 18:31:36 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This cannot be brushed off as Trump being Trump. President Trump is threatening the lives of people in the intelligence community, in a fit of rage after having is criminality exposed. This is incredible.","date":"Thu Sep 26 17:22:23 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Would a reporter please end this filibuster?","date":"Wed Sep 25 21:07:52 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"\"I don't want to be inaccurate\"\n\nThere's the laugh line.","date":"Wed Sep 25 21:02:37 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"This is a cartoon of a press conference.","date":"Wed Sep 25 18:27:46 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Good point to note. \n\nAnd yet it’s still damning evidence of the President’s impropriety.","date":"Wed Sep 25 15:13:42 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"He seems like a very happy confident President, looking forward to a bright and carefree future. So nice to see! https://t.co/ePDZq8afqC","date":"Wed Sep 25 15:01:52 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Today I have called for impeachment proceedings to begin against this President. See earlier statement: https://t.co/5zp0WJfa8P https://t.co/1j3NUsr4PX","date":"Tue Sep 24 23:39:48 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Going live on NY1 now to discuss my call to begin impeachment proceedings on this President. https://t.co/6VSfoR8moR","date":"Tue Sep 24 23:11:53 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"The one thing gluing Trump to his #UNGA script is fear that the world will laugh at him again. And once again that script is all about him.","date":"Tue Sep 24 14:31:18 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tonight I hosted an immigration Town Hall in Cambria Heights. Thank you everyone who came out tonight and contributed to the discussion on the fight to protect immigrants from the abuses of this administration. https://t.co/mp13SDF77b","date":"Sun Sep 22 00:36:18 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"DNI judged that what the whistleblower brought forward was credible and of urgent concern. If reporting is correct, the President attempted to have a foreign nation meddle in our elections for his own gain. Republicans, it's time to stop making excuses for Trump. Enough is enough https://t.co/cuERWyycEF","date":"Sat Sep 21 21:33:21 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tune in to MSNBC at the top of hour. I'll be discussing the latest on the whistle-blower and alarming revelations about Trump's communication with foreign governments.","date":"Fri Sep 20 21:54:44 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"As a result of @GlobalFund and its partnership with @PMIgov @PEPFAR, and @USAIDGH, 32 million lives have been saved in the global fight against AIDS, TB and malaria since 2002. Ending these epidemics will require building on this incredible success. https://t.co/Qdrn4iWggr","date":"Thu Sep 19 21:45:42 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"On C-SPAN discussing Iran and Syria right now. Tune in!","date":"Thu Sep 19 12:36:13 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"About to go live on @BBCWorld to discuss our climate change hearing today and the necessity of moving forward to #ActOnClimate. Tune in! https://t.co/e5rJjYvLpd","date":"Wed Sep 18 18:34:54 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Lewandowski is treating this Judiciary hearing, and his subpoena, about as seriously as Trump treats the rule of law. \n\nIt is incumbent on the media to not treat this as a horse race, and instead spotlight Lewandowski’s egregious obstruction.","date":"Tue Sep 17 19:03:08 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"During #HispanicHeritageMonth we celebrate the strength of diversity, and recognize the contributions of Hispanic culture and communities throughout our nation. But this year let's also work to ensure every person is counted for #Census2020 and fight against acts of intimidation. https://t.co/TZuImFS56n","date":"Mon Sep 16 17:39:04 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Meeting with the Prime Minister of Trinidad &amp; Tobago Keith Rowley to discuss our bilateral relations and the region. https://t.co/KNebwulzKQ","date":"Thu Sep 12 16:06:53 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"We will never forget. Not the innocent lives claimed by the attack on our nation, nor the solidarity that we as as Americans felt. Eighteen years, we have not forgotten, we will never forget.","date":"Wed Sep 11 13:50:58 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"If we are in a competitive world, yet we leave our young individuals uneducated because they can't afford an education, then we are in danger as a country. Watch my time for today's student loan hearing: https://t.co/tcKZTbg0vN","date":"Tue Sep 10 22:02:40 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"My priority has been to avoid another financial crisis by strengthening regulatory oversight. H.R. 241 will streamline regulatory oversight without cutting corners, increasing coordination and giving consumers more faith in the stability of the banking system. https://t.co/KS5D7q83TY","date":"Tue Sep 10 19:05:03 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In Emancipation hall commemorating the 400th Anniv. of the first recorded forced arrival of African slaves. In that time since, we continue the work of overcoming that horrific legacy, to form a more perfect union, respecting all people with dignity, freedom and equality. https://t.co/VE1TE9lEfz","date":"Tue Sep 10 15:22:28 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Our ability to collect intelligence is hindered by the CIA’s own lack of faith in the President’s ability to keep our assets safe, and our operations covert. \n\nThink on that.","date":"Mon Sep 09 14:48:43 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Had the pleasure of addressing the Jewish Community Council of the Rockaway Peninsula (JCCRP) at their 47th Annual Legislative Breakfast. https://t.co/fe9RqodNFI","date":"Sun Sep 08 20:38:02 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Had the pleasure of hosting a welcome reception yesterday for York College's interim President Dr. Berenecea Eanes. https://t.co/zse63yXckV","date":"Fri Sep 06 16:29:53 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"In the two years since this President has tried to undo the DACA program, Democrats have worked to #ProtectTheDream for our young DREAMers by passing HR6. The US is and has been their home, and their legal status must be protected. https://t.co/xlPJYgl8HV","date":"Thu Sep 05 16:36:58 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Participating in a field hearing on discriminatory barriers for consumer credit and home ownership, discussing how to boost financial inclusion with my colleagues @RepAlGreen @RepSylviaGarcia @repcleaver and @RashidaTlaib.","date":"Wed Sep 04 17:27:33 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Tune in! \nhttps://t.co/q41ZEhPHTh","date":"Wed Sep 04 17:27:33 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Congress has the power of the purse and, last I remember, never allocated funding for Trump’s campaign gimmick of a wall. \n\n“Cash grab” is exactly what this is.","date":"Tue Sep 03 21:31:57 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"From the forty hour work day to paid sick leave, all were hard earned victories secured by unions and organizers who demanded the dignity of workers' rights. We must continue that momentum forward and fight for fair wages and preserve the right to organize.\n\nHappy #laborday!","date":"Mon Sep 02 18:34:20 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"There’s been a series of hateful, racist and anti-Semitic instances of vandalism in the Rockaways. I’ve spoken to Chief Barrere who assures me that he’s dedicating additional resources including officers to the area &amp; will investigate (1/2)...","date":"Mon Sep 02 18:03:10 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Our community will not tolerate any kind of racism and hateful acts.  (2/2)","date":"Mon Sep 02 18:03:10 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Regardless, interest rates are not a magic bullet for solving this President's incoherent economic policies and disastrous trade wars.","date":"Tue Aug 27 18:15:07 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Joining OCC Comptroller Otting on his bus tour gathering community feedback on the Community Reinvestment Act (CRA) modernization, one of my greatest priorities. We must bring CRA into the 21st century to continue fighting structural discrimination and financial exclusion. https://t.co/uacfPeVUz3","date":"Wed Aug 21 19:50:05 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"No one:\nThe voice inside Trump’s head: https://t.co/kkHCqShD5G","date":"Wed Aug 21 19:18:46 +0000 2019","user_id":"22812754"},{"handle":"RepGregoryMeeks","text":"Many found themselves in this facility after a minor infraction. Some are held like criminals for simply seeking safe harbor. And now this administration wants to use facilities like this to detain children. To that, Mr President, I say we will see you in court.","date":"Wed Aug 21 18:05:37 +0000 2019","user_id":"22812754"}]