[{"handle":"RepHerrell","text":"Leftist politicians and their media friends learned a lesson from \"mostly peaceful protests\"--now, when their goons firebomb pregnancy centers and vandalize churches, they simply don't acknowledge that anything is happening at all! \n\nGreat (infuriating) thread:","date":"Thu Jun 16 17:54:37 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm thrilled to have co-sponsored the Ocean Shipping Reform Act, which is being signed into law this afternoon! One solid step in reducing prices for hardworking American families and finally solving our supply chain problems. https://t.co/SMq5u56bCH","date":"Thu Jun 16 15:50:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Of COURSE he was. \n\nFrom NYC to Albuquerque, extreme Leftist DA's are letting violent criminals waltz away to hurt innocent people.\n\nThis is worse than \"soft on crime\"--they clearly sympathize with criminals more than law-abiding citizens.","date":"Thu Jun 16 15:38:39 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Unacceptable.","date":"Thu Jun 16 13:56:09 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It's crazy that terrorists are firebombing and vandalizing crisis pregnancy centers and churches and nobody in the Biden administration or their media lapdogs care!","date":"Wed Jun 15 17:43:59 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Ouch! The dangers of serving in Congress. I gave my arm a whack while running between meetings on Capitol Hill, so I’ll be working one-handed for a little bit! https://t.co/WAgACOPthV","date":"Wed Jun 15 15:11:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"🤣🤣🤣\n\nhttps://t.co/jYxEnBjPoJ","date":"Wed Jun 15 13:55:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"They look at me and I say, 'America's back.' And they look at me, and they say, 'For how long?'\"\n\nSome outstanding self-awareness from our President!","date":"Wed Jun 15 13:51:14 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe Biden's climate advisor @ginamccarthy46 is now calling for social media companies to silence and censor anyone who is critical of Joe Biden's disastrous energy policies. \n\nIt's amazing to see these petty authoritarians operate!\n\nhttps://t.co/G5TJsOGKwv","date":"Tue Jun 14 21:13:47 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Rep. Gerry Connolly is trying to make Covid-era telework PERMANENT for federal employees. \n\nMakes sense: all his Northern VA constituents are federal workers who would rather stay home.\n\nFor the REST of America--there's the SHOW UP ACT.\n\nhttps://t.co/iO79ej9244","date":"Tue Jun 14 20:52:59 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Lowering cost of living needs be our #1 priority in Congress.","date":"Tue Jun 14 16:09:58 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was a pleasure to attend!","date":"Tue Jun 14 15:06:25 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It is really bizarre that the @washingtonpost employs someone as dismissive of death threats and doxxing against conservatives as Taylor Lorenz, especially when she contributes a good bit of the doxxing herself. Seems like a liability.","date":"Tue Jun 14 15:05:18 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Happy Flag Day! Salute to Old Glory! https://t.co/6ev6LNWghN","date":"Tue Jun 14 13:47:32 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to co-sponsor the STOP II Act by @RepHudsonNC , which would strengthen school security and mental health resources to prevent violence against America's children! https://t.co/r9OK17zhrx","date":"Mon Jun 13 19:15:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Sports Illustrated seems to be under the impression that coaches and players praying on the field spells the end of American democracy. \n\nIf that were true, American democracy would have been destroyed long before the legendary Jim Thorpe threw his first pigskin.","date":"Mon Jun 13 13:33:07 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Skyrocketing gas prices, inflation hitting American families... who asked to go back to the Carter administration??\n\nhttps://t.co/M8GhRDyQkX","date":"Fri Jun 10 17:48:14 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The GOP has introduced a host of bills promoting safe &amp; secure schools and mental health resources, while making it easier to prosecute criminals illegally straw-purchasing guns &amp; keep violent criminals who use guns behind bars. But Nancy Pelosi isn’t interested!","date":"Fri Jun 10 14:11:55 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I DID support Thomas Massie’s amendment, which would require the National Criminal Instant Background Check System (NICS) to annually submit a report to Congress on the demographics of individuals who were denied or otherwise deemed ineligible to purchase a firearm...","date":"Fri Jun 10 14:09:51 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"H.R. 2377 would empower federal judges to nullify Second Amendment rights on a case-by-case basis and task federal agents with confiscating the firearms of private individuals who have neither been convicted nor even accused of a crime...","date":"Fri Jun 10 14:09:26 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"H.R. 7910 also unacceptably chips away at the Second Amendment by expanding vague definitions of firearms components and banning magazines higher than 10 rounds, which courts have ruled are themselves protected as elements of firearms.","date":"Fri Jun 10 14:08:48 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"H.R. 7910 includes an unconstitutional ban on firearms for law-abiding adults. If you're 18 in the USA, you can vote, join the military, take out a loan, &amp; are classified as a legal adult—Congress doesn’t get to decide that your Constitutional rights “kick in” sometime later...","date":"Fri Jun 10 14:06:45 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Nancy Pelosi’s gun bills—H.R. 7910 and H.R. 2377—would be terrible laws, because they attack the rights of law-abiding citizens while doing little to stop wannabe mass killers from striking again.\nHere’s why I voted against them... 🧵","date":"Fri Jun 10 14:05:16 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"One home burned, 30 others evacuated due to wildfire near Grants https://t.co/uBfAEpqD7D","date":"Fri Jun 10 13:58:48 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm thrilled that the @RepublicanStudy\n proposed budget for 2023 includes my POWER Act and the Energy Permitting Certainty Act, which get government out of the way, promote American energy independence, and lower prices for struggling families!","date":"Thu Jun 09 16:57:34 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Nancy Pelosi just blocked a bill to increase security for Supreme Court justices and their families--a day after a would-be assassin was caught trying to kill a sitting justice. No shame.","date":"Thu Jun 09 16:14:16 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to meet with these amazing young New Mexicans in @4H! They reminded me of my 4H Club days… where has the time gone? https://t.co/qfhbidyGlD","date":"Thu Jun 09 14:36:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"When my colleagues like @RepKatiePorter slander witnesses whose views they don't like, they only expose their ignorance of the law and fear of being proven wrong.","date":"Wed Jun 08 19:27:49 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"AMAZING testimony from a brave lady!","date":"Wed Jun 08 17:05:44 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Americans: \"can you tackle crime, gas prices, immigration, cost of living?\" \n\nDemocrats: \"best we can do is talk about cats\"\n\nhttps://t.co/VAAOIZJRLm","date":"Wed Jun 08 15:46:46 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A Leftist extremist was caught with a gun and burglary tools planning to assassinate Justice Kavanaugh. \n\nI wonder how quickly this will be forgotten by cable news? \n\nhttps://t.co/C0F4muLkYI","date":"Wed Jun 08 14:31:34 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Another thousands-strong caravan of illegal migrants, emboldened by Joe Biden's complete destruction of our border security. Those who get through will be released into our communities with no background checks.  \n\nhttps://t.co/H6WS3hOaul","date":"Tue Jun 07 19:22:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"European countries are starting to share our concern about the complete lack of accountability and oversight for US weaponry shipped to Ukraine. Americans should know whether their tax dollars are being used to enrich gangsters and terrorists.","date":"Tue Jun 07 16:27:33 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"When crazy Leftists run your city, you get this nonsense:\n\nhttps://t.co/iq54z8X3Qc","date":"Tue Jun 07 13:40:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Gas is on the way to $6 a gallon nationwide by August--in some places, gas cost has already surpassed the federal minimum wage. \n\nAmerica's families cannot afford the Biden administration's continued policy of sidelining our abundant natural resources.\n\nhttps://t.co/FXPF8MCFwj","date":"Mon Jun 06 18:29:35 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"Soldiers, Sailors, &amp; Airmen of the Allied Expeditionary Force: You are about to embark upon the Great Crusade, toward which we have striven these many months. The eyes of the world are upon you. The hopes &amp; prayers of liberty-loving people everywhere march with you.\" -EISENHOWER https://t.co/t0zbJ8MBnR","date":"Mon Jun 06 16:21:45 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thrilled to host @RepGarretGraves, @RepFeenstra, and @JayObernolte, as well as former Congressmen Harry Teague and Steve Pearce for an important roundtable in Hobbs on lowering energy prices for American families and unleashing our amazing natural resources! https://t.co/Y5VXjCLcfY","date":"Fri Jun 03 15:58:57 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It's PAST time to make the PUMP Act law, which would suspend the Federal Gas Tax on American families, who are paying more for energy than any other time in US history!\n\nhttps://t.co/uMjGthC37y","date":"Thu Jun 02 18:28:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I had a great time speaking at the New Mexico Rural Electric Cooperative Association's convention yesterday, where we discussed ways to lower energy prices for hardworking families--now onto Hobbs for my Congressional roundtable! https://t.co/gIktsCI3SM","date":"Thu Jun 02 15:30:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I introduced the POWER Act as soon as I came to Congress. And with energy prices skyrocketing, it has never been more important to pass this bill, and unleash American energy dominance:\n\nhttps://t.co/cePqTDzd0z","date":"Thu Jun 02 13:47:33 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Today I'm hosting a Congressional roundtable in Hobbs, New Mexico, where we'll be hearing from workers and businesses hurt by Biden's war on American energy. \n\nI wrote this with @SteveScalise--unfortunately, the Administration has only gotten worse since!\n\nhttps://t.co/wnSuhFhjQr","date":"Thu Jun 02 13:08:11 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Join me today in congratulating Margarita Porter of The New America School in Las Cruces for being named one of @charteralliance's Charter School Changemakers for her outstanding accomplishments! \n\nhttps://t.co/h4cBmPD7WY","date":"Tue May 31 15:58:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"On Memorial Day I was was honored to join so many incredible New Mexicans at the dedication of the Hobbs Veterans Memorial! https://t.co/mqgZO8NLGN","date":"Tue May 31 14:34:23 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/yKhbI74omP","date":"Mon May 30 13:00:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Do you hate constant scam robocalls?\n\nSo do I! \n\nI'm urging New Mexico's Attorney General @HectorBalderas to join with the FCC in fighting these stupid, infuriating, criminal scams, which bother Americans a staggering 50 BILLION times a year. https://t.co/cXJLVZ2u9A","date":"Thu May 26 17:05:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If we want to make life affordable again for American families, we need to champion domestic energy, not suppress it. Check out this piece I co-authored with @RepWesterman: \n\nhttps://t.co/j4XYwqtKZr","date":"Thu May 26 14:39:19 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please join me in praying for the families, schoolchildren, teachers, and first responders of Uvalde. \nhttps://t.co/SoaKD3mhql","date":"Tue May 24 22:06:56 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to lead this effort to establish oversight and accountability for billions in funds and weaponry the Biden administration is shipping to a foreign conflict. The American people deserve to know whether their tax dollars are going to make the world safer--or more dangerous.","date":"Tue May 24 19:21:58 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A tragic reminder of why the USA has not only a strategic interest in divesting from China, but a moral one. \n\nCommunist gulags are alive and well in 2022. \n\nhttps://t.co/go0lnnZV8z","date":"Tue May 24 16:02:58 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Smugglers, human traffickers, cartel members, violent criminals--and now terrorists are waltzing across our border, and often being released into our communities by our own government!","date":"Tue May 24 13:49:30 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I have it on good authority that Alicia's artistic talents are matched by her athletic achievements in Track and Field--hence her nickname. Keep up the great work, Zoom Zoom!","date":"Mon May 23 15:58:04 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"CONGRATULATIONS to Alicia \"Zoom Zoom\" Jaquez of Lordsburg, NM for winning the 2022 Congressional Art Competition for the 2nd District! Her piece \"Mimbres Heritage,\" a mesmerizing celebration of Indian artwork and folklore, will be seen by thousands of visitors to the US Capitol! https://t.co/BbP2LiritO","date":"Mon May 23 15:56:32 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe Biden's America: where you can't deploy the National Guard to the border, but the National School Board Association wants to sic them on concerned parents. Insanity!\n\nhttps://t.co/Gi84LXbA9f","date":"Mon May 23 14:11:10 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Good news: Title 42 has been preserved again--for now. \n\nAmericans shouldn't have to beg and plead with their President to enforce the law. We shouldn't have to rely on court orders to protect our communities. But under Joe Biden, that's where we are. \n\nhttps://t.co/LZixzmvE1S","date":"Mon May 23 13:59:16 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to be part of this bipartisan fight for New Mexico's agriculture and environment. Thanks for rallying the troops, @Rep_Stansbury!\nhttps://t.co/0rU1rHGeqb","date":"Fri May 20 15:37:43 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"America returns to work, but many federal employees continue pandemic-era telework, which Biden wants to make permanent. My SHOW UP Act would restore in-person care for veterans &amp; social security beneficiaries, and keep public employees serving the PEOPLE.\nhttps://t.co/yQ4UZCF9bq","date":"Thu May 19 22:04:18 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"192 Republicans, myself included, voted against giving $28 million to federal bureaucrats at the FDA to reward them for their failure--it would have done nothing to help families. \n\nWe support real solutions, like the Access to Baby Formula Act &amp; @SenMikeLee's new FORMULA Act.","date":"Thu May 19 19:36:36 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"GOP: H.R. 7791 &amp; @SenMikeLee's FORMULA Act fix supply chain issues, make it easier for families to get baby formula\n\nDEMS: Pass bill to raise salaries of FDA bureaucrats by $28 million\n\nI support bills that will help, not dump more $$$ into the pockets of feds who failed us.","date":"Thu May 19 18:51:33 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am monitoring this situation and working to ensure that first responders and locals whose lands are endangered by this fire have all the resources they need. \n\nhttps://t.co/QoiQWQDKKH","date":"Thu May 19 16:57:56 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In addition to the Rio Grande Water Security Act, the whole NM delegation is cheer-leading the Water Data Act, which will empower our communities to access critical water quality data and protect their health--we must protect our communities from water contaminated by PFAS/PFOA.","date":"Thu May 19 14:57:16 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico farmers are preparing for reaches of the Rio Grande to dry up this summer. That's why I’m proud to join @Rep_Stansbury for the bipartisan Rio Grande Water Security Act to improve water management &amp; support water conservation for the Rio Grande Basin.","date":"Thu May 19 14:41:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico farmers are preparing for reaches of the Rio Grande to dry up this summer. That's why I’m proud to join @Rep_Stansbury for the bipartisan Rio Grande Water Security Act to improve water management &amp; support water conservation for the Rio Grande Basin.","date":"Thu May 19 14:41:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"No surprise: Pro-Abortion fanatics' ignorance of science extends beyond their inability to recognize a human--they think men can get pregnant!  \n\nFrom sports to biology to abortion, why is the Left so eager to erase women?","date":"Wed May 18 18:19:38 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Bye, Felicia!","date":"Wed May 18 16:24:34 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to have co-sponsored legislation that would defund this unconstitutional, authoritarian \"Ministry of Truth\" permanently. Looks like enough Americans raised hell that even Joe Biden is realizing his mistake.","date":"Wed May 18 15:09:12 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Outsourcing supply chains, manufacturing, and vital energy components to China has always been both a moral and strategic mistake.","date":"Wed May 18 14:20:03 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Correct. \n\nThe border was open beginning on January 20th, 2021.","date":"Tue May 17 19:51:55 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe Biden trashing Title 42 as we hit the worst illegal immigration levels in US history is like taking off all the storm windows just in time for a hurricane.","date":"Tue May 17 18:23:20 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Inspiring words from @SenatorTimScott! We should work to build a country where every child and every mother has the opportunity to flourish.","date":"Tue May 17 17:06:15 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thanks for all you do!","date":"Tue May 17 16:27:06 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If we don't get this under control NOW, history books will point to these months as when America stopped being a country.","date":"Tue May 17 13:44:33 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Zing!","date":"Mon May 16 16:39:47 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Which country are we at war with, @LeaderHoyer? I don't remember a Declaration of War coming up for a vote recently.","date":"Fri May 13 17:22:07 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration's terrible policies encourage illegal immigrants and human traffickers to use children as \"get out of jail free\" cards and bargaining chips. This disaster is squarely on the shoulders of Biden and Mayorkas for reversing successful Trump-era policies.","date":"Fri May 13 14:35:24 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I was honored to present a wreath today at the National Law Enforcement Officers Memorial on behalf of all New Mexico police who lost their lives in the line of duty. \n\nTo those who have served, and all those who continue to protect our communities: thank you. 💙🖤 https://t.co/oYvKE2fayQ","date":"Thu May 12 19:53:27 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Heads up Lincoln County! The Small Business Administration and the New Mexico Small Business \nDevelopment Center Network are opening a SBA Business Recovery Center in Ruidoso to help businesses impacted by fires--details below: https://t.co/TCrWOaUsYl","date":"Thu May 12 17:38:21 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"More bad news for American businesses, workers, and their families.","date":"Thu May 12 15:37:39 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/S8e9nMQuPy","date":"Thu May 12 14:58:50 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is unacceptable. Everyone involved in this terrible decision should be fired.","date":"Thu May 12 14:46:28 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am THRILLED that the House has passed the Radiation Exposure Compensation Act (RECA) Extension. \n\nI have been fighting for months to extend compensation benefits for the uranium miners, mill workers, ore transporters, and downwinders of New Mexico!\nhttps://t.co/RPetiXeUuH","date":"Wed May 11 21:12:29 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thanks for the follow!","date":"Wed May 11 16:05:36 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In the midst of a national crime wave, while the media and movie stars revel in outrageous lies and hatred toward police officers, it is more important than ever that we support the brave men and women of law enforcement.  \n\nThey had our backs, now we have theirs. https://t.co/ldJdPM9Yur","date":"Wed May 11 14:43:14 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Our borders are crumbling, our communities becoming more dangerous due to crime, thousands of lives are lost to an opioid epidemic, and our country is sinking deeper into debt; we must tackle these serious issues at home before bankrupting ourselves with more foreign spending.","date":"Tue May 10 22:41:59 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The American people did not elect us to pour their hard-earned money into a conflict halfway around the world, especially at a time when they struggle under Biden’s skyrocketing inflation, high gas prices, and baby formula shortages...","date":"Tue May 10 22:39:35 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Having previously voted for substantial aid packages to Ukraine and sanctions against Russia, I cannot in good conscience rubber-stamp President Biden’s demand to take 40 billion dollars from American families and send it overseas with little idea of how it will be spent... 🧵","date":"Tue May 10 22:38:57 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"As even the liberal Washington Post editorial board admitted yesterday, this is illegal. \n\nJen Psaki, spokeswoman for the Biden administration, is encouraging people to break the law and harass federal judges to achieve the \"correct\" ruling.","date":"Tue May 10 20:16:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"$4.37 is now the national average for a gallon of gas. In Catron County, New Mexico, AAA reports the average has already hit $4.65. \n\nThis is unsustainable for New Mexico's hardworking families. We need to pass the PUMP and POWER Acts NOW!\nhttps://t.co/V5vd6pxyfX","date":"Tue May 10 18:06:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"There is a hatred and darkness behind these attacks that should make all Americans think twice about supporting radical pro-abortion activists.","date":"Tue May 10 17:49:36 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Fighting for New Mexico's families--who are struggling under Joe Biden's inflation--takes precedence over polls and elections any day of the week. \n\nRight now, we need to give Americans a lower cost of living, safe communities, and strong borders.","date":"Tue May 10 16:59:56 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If Joe Biden's policies helped inflation... they would have already. \n\n(You know, instead of driving it through the roof)","date":"Tue May 10 16:38:53 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe Biden is intent on blaming everyone but himself and his party (which controls both the House and Senate) for inflation, despite cheerleading for massive money-dumping bills he continues to propose. \n\nThis is not a competent administration.","date":"Tue May 10 16:24:16 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Churches around America are being vandalized by hateful bigots, and the Biden Administration's silence is deafening. \n\nhttps://t.co/SeTql6AAsT","date":"Tue May 10 13:50:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am chasing down answers from @forestservice so New Mexicans can get the full story of what went wrong. Prescribed burns need to be done carefully, precisely, and only at favorable times!","date":"Mon May 09 20:24:07 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Expensive gas, groceries, and inflation--now the Biden administration can add a baby formula shortage to their list of \"accomplishments\" for American families in the last year. \n\nhttps://t.co/91gmB8Y6Hl","date":"Mon May 09 17:00:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"When you see this visceral hatred oozing from crazy Leftist talking heads like Keith, it's no wonder their movement is dedicated to crushing school choice, homeschooling, and parental rights. \n\nSometimes it's good to see the veil drop.","date":"Mon May 09 14:54:05 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Was your property affected by the recent fires?\nCome learn about the US Forest Service Burn Area Emergency Response (BAER) process and methods that landowners can implement post-fire from the Forestry Division of the New Mexico Energy, Minerals and Natural Resources Department. https://t.co/8gVG8iuT2J","date":"Mon May 09 14:06:57 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Simply perfect: Biden put a Leftist conspiracy theorist in charge of his thought police.","date":"Mon May 09 13:51:30 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@SecMayorkas, my colleagues and I are urging you to consider the vital role that Title 42 border health protections play in staving off the flood of illegal synthetic opioids, which are a leading cause of death among young Americans. Please protect our country! https://t.co/rNB5336gtq","date":"Fri May 06 17:24:07 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to join this letter to FBI Director Ray. We must preserve the independence of our nation's highest court. I'm sure my colleagues who spent the last 6 years very concerned about \"norms\" would agree!","date":"Fri May 06 14:24:12 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"On this National Day of Prayer, \nMay our country be at peace.\nMay our families and communities prosper.\nMay our public servants lead us in a good direction. \nMay we always serve the poor, the downtrodden, the victim, the sick, the addict, and those who seek forgiveness. https://t.co/umq7E1PC7j","date":"Thu May 05 17:43:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thrilled that @SenTedCruz, @SenMikeLee, and @SenLummis have introduced my PAUSE Act to preserve Title 42 protections in the Senate! We must do everything to protect our borders and the health of America's families. \n\nhttps://t.co/fXMbi6WNWj","date":"Thu May 05 17:25:42 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am glad that the entire New Mexico delegation joined together in urging President Biden to issue this disaster declaration for the people of our state affected by wildfires, and we will continue bipartisan efforts to protect our communities. \nhttps://t.co/NgvOuesX3T","date":"Thu May 05 14:18:29 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We must preserve the independence of the Supreme Court. Extremists in the media have been leveling threats, promising to pack the court, and vowing retribution if decisions don't go their way. This is not how our democracy should function.","date":"Thu May 05 14:06:34 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to help defund Joe Biden's 1984-style propaganda and censorship operation. This thought-police nonsense has no place in America.","date":"Wed May 04 13:03:44 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Chief Justice Roberts has condemned the malicious leak of a possible future decision and ordered an investigation. Good! https://t.co/dPOCr9Toxs","date":"Tue May 03 20:04:55 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The possible leak of a Supreme Court decision is an unprecedented attack on the independence of the court. But if SCOTUS indeed leans toward protecting Life, I hope you will join me in praying that they decide wisely.","date":"Tue May 03 15:30:35 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Are you an active-duty service member or a veteran? Would you like assistance with a tax issue? Sign up for next week's New Mexico Taxpayer Advocate Service Problem Solving Day! https://t.co/OsZU9PL8Ht","date":"Mon May 02 19:55:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"As long as government emergencies and mandates remain in place, the American people should not be subjected to harsher standards than people arriving here illegally from other countries.","date":"Mon May 02 17:46:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Mayorkas literally admits he's taking actions that will make the border crisis worse. \n\nI think he's got a touch of whatever Joe Biden has, because he seems to forget what his job is.","date":"Mon May 02 17:35:53 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to urge New Mexico's Attorney General @HectorBalderas to protect women's sports and join 15 other state AG's in protesting Joe Biden's gutting of Title IX protections for female athletes.\n\nFemale students should compete against each other, not biological males. Full stop. https://t.co/erSa2NLN7r","date":"Mon May 02 16:59:49 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The federal government--or any government--has no business setting up a \"Ministry of Truth\" to control the news, opinions, and debates of its citizens. \n\nThe next GOP president must abolish this office and scatter its ashes to the four winds.\n\nhttps://t.co/3GoC7PYV8h","date":"Mon May 02 15:30:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to meet you, Livia! I am proud to be a strong supporter of Israel and her people.","date":"Mon May 02 14:13:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Another reason we have the Second Amendment:\n\nhttps://t.co/HwBBOFxShq","date":"Mon May 02 13:53:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Albuquerque is becoming one of the most dangerous cities in the nation, and the DOJ continues to hamstring local law enforcement. \n\nIt's past time we let @ABQPOLICE do their jobs, stop criminals, and protect the innocent. \n\nhttps://t.co/VPoaWYZ63W","date":"Fri Apr 29 14:27:20 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe and Nancy are taking America on a road trip to the Carter Administration and NOBODY is having a good time!","date":"Thu Apr 28 15:01:26 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"GDP shrinking. \nInflation rising. \nGas is more expensive. \nFood is more expensive. \n\nGee, thanks @JoeBiden! \n\nhttps://t.co/XPOA5DpbOH","date":"Thu Apr 28 14:21:21 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My great Veterans Liaison, Rick Pineda, attended the New Mexico Department of Veterans Services (@GONMDVS) 2022 Military Honors and Training Competition. Thanks to all our amazing veterans and active duty service-members who made it a wonderful day! https://t.co/2FxpxlMVTj","date":"Wed Apr 27 21:02:26 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Just days ago, Spc. Bishop Evans lost his life trying to save people from drowning in the Rio Grande (who turned out to be drug smugglers)--and these acts of valor are met by proposals from the Biden administration that are BEYOND insulting.","date":"Wed Apr 27 20:35:57 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Glad to join this effort. Americans deserve the truth.","date":"Wed Apr 27 18:49:40 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thrilled to get the support of the National Fraternal Order of Police @GLFOP for my efforts to establish student loan forgiveness and scholarships for the children of officers who lose their lives in the line of duty. https://t.co/xzlRC7MWxZ","date":"Wed Apr 27 15:54:34 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is terrible, but I'm glad all the kids are alive! \n\nPlease join me in praying for the quick healing of these precious children. \n\nhttps://t.co/oJjs87TSvG","date":"Wed Apr 27 15:49:38 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"And this isn't even counting the hundreds of thousands who weren't apprehended, and many thousands more who have been released into our homeland with zero accountability or consequences.","date":"Wed Apr 27 15:01:03 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This information session is tomorrow, so aspiring officers from New Mexico should sign up ASAP!","date":"Tue Apr 26 20:44:52 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A short list of people who might care more about *real* justice than @SenMarkey's phony \"algorithmic justice\"\n\n-Victims of the national crime wave\n-Victims of cartels, human traffickers, crimes by illegals\n-Victims of abortion, millions","date":"Tue Apr 26 18:35:38 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great plan. \"How dare you question how our border identifies!\"😆","date":"Tue Apr 26 16:53:23 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to get a 100% legislative score from @ACUConservative! \n\nI will continue to defend our borders, our Constitutional right to free speech and bear arms, and the Right to Life of every precious child. I am honored to fight for the people of New Mexico in Congress. https://t.co/etW8FUQ6CC","date":"Tue Apr 26 16:45:57 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Very happy to break it to @sunny: free speech is vital to the civil rights of every American of every race, sex, and creed. \n\nI'd love to join you on @TheView if the ladies would like a little brush-up on Civics 101!","date":"Tue Apr 26 16:14:40 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Team Biden really tackling the most important issues of our time: getting rid of light bulbs.","date":"Tue Apr 26 13:54:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"GOOD. But this is only temporary breathing room for Americans--we need to pass the PAUSE Act to keep Title 42 in place for the duration of all Covid-related mandates and emergencies. \n\nhttps://t.co/GYeH2hLbum","date":"Tue Apr 26 13:06:16 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congratulations, @elonmusk! Looking forward to a free-speech oriented twitter.","date":"Mon Apr 25 20:03:43 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Our New Mexico border families face an invasion, and so-called head of Homeland Security @Mayorkas has only made it worse. \n\nQuestion his suitability for office? \n\nPardon my French, but damn right I do.\n\nhttps://t.co/TlXuNbRyNC","date":"Mon Apr 25 18:15:21 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It is terrible that taxpayers are forced to participate in covering for these grave moral evils because our public institutions are cheerleading the culture of death.\n\nhttps://t.co/JcgzVESSIc","date":"Mon Apr 25 15:02:17 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please join me in praying for the missing Texas National Guardsman. The men and women who defend our borders put their lives on the line to save people every day. Tragic.","date":"Fri Apr 22 18:15:14 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Let's follow the science, end mandates, and get life back to normal as soon as possible. \n\nGreat piece from @CityJournal!\n\nhttps://t.co/nx68DcHCCu","date":"Thu Apr 21 16:11:44 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"On my way to review the burn scar from the Big Hole Fire, another fire broke out in Valencia County.  Please continue to pray for all those impacted by these blazes! https://t.co/9nRJe1Y90F","date":"Wed Apr 20 19:50:05 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Our border is broken. 221,000 encounters in March alone. \n\nDHS must start taking this crisis seriously.\n\nProud to sound the alarm with my colleagues @RepAndyBiggsAZ @PeteSessions @RepGrothman @RepDonaldsPress @RepGosar @RepJamesComer in @FoxNews  \n\nhttps://t.co/Do9DHyaP3z","date":"Wed Apr 20 13:47:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico businesses of every size--and the hardworking families who run them--are feeling the pressure every day from Joe Biden's thoughtless war on American energy. Blaming this failure on Russia just adds insult to injury.","date":"Wed Apr 20 13:10:49 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Holding Putin accountable for his brutality doesn't mean lying about why gas prices are going up--but Joe Biden's Tweeter in Chief didn't get the memo. Skyrocketing prices started at the beginning of the Biden administration, and are getting worse thanks to his policies.","date":"Wed Apr 20 13:05:47 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Have a blessed day! https://t.co/kEHHxUD8Kq","date":"Sun Apr 17 18:27:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I visited the brave men and women battling the McBride Fire in Lincoln County. We are actively monitoring the ongoing situation and helping to provide all the resources we can. Join me in praying for our first responders and the families of Ruidoso. #RuidosoStrong #McBrideFire https://t.co/FpRK6WGGXJ","date":"Fri Apr 15 16:40:22 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Interesting perspective from the President of El Salvador. Soft on crime policies and even softer borders hurt Americans and our allies alike.","date":"Wed Apr 13 14:06:39 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Do you know a young New Mexican interested in serving our country as an officer in the Army, Air Force, Coast Guard, Merchant Marine, or Navy? Register here for an information session on Wednesday 27th! https://t.co/U6qQrQFSCg https://t.co/ss0uizTDNR","date":"Mon Apr 04 15:12:23 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Glad to bring my colleagues to the border, so we could all see firsthand the challenges of securing our great country. \n\nhttps://t.co/0OrrW4QVyE","date":"Wed Apr 13 14:02:03 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"For anyone in Lincoln County who needs to shield livestock from this blaze, you’re invited to bring them to the Chaves county fair grounds. \n\nEntrance: Rodeo arena entrance on Poe Street. \n\nPoint of contact: Mark Steen: +1 (575) 420-3838","date":"Tue Apr 12 23:19:09 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A fire in Ruidoso has prompted evacuations in the area.\n\nThe Village of Ruidoso says those who live in Eagle Creek and Homestead Acres should evacuate as a fire begins to spread.\n\nThe Ruidoso Convention Center has been set up as an evacuation center. \n\nhttps://t.co/XtYQ9Bg6Er","date":"Tue Apr 12 21:45:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Nogal Canyon Evacuation--&gt; see more:","date":"Tue Apr 12 20:51:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/GCLx695J8j","date":"Tue Apr 12 15:53:50 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Time for my fellow prayer warriors to mount up--and for our brave men and women in blue to do what they do best. May this be the end of this senseless violence.\n\nhttps://t.co/7R1xY6Jq4v","date":"Tue Apr 12 14:55:10 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Household products, food, and gas cost more every day, while the money in Americans' wallets decreases in value from inflation. \n\nThanks, Joe and Nancy. \n\nhttps://t.co/hETOlijUlh","date":"Tue Apr 12 14:13:38 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Mayor Noblin of Belen asked my office to spread the word: If anybody is having respiratory issues due to the fire, they are welcome to come to the Belen Recreation Center at 305 Eagle Lane, close to the Belen High School.","date":"Tue Apr 12 00:46:15 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My staff is coordinating with local, state, and federal officials to offer any assistance. We will keep you updated on this ongoing situation. Please join me in praying for our friends in Valencia County.\n\nhttps://t.co/qIoN7iUEDX","date":"Mon Apr 11 23:02:34 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Former head of Border Patrol under Trump/Biden says it's difficult to get criminal histories of people flooding our border. It's why I introduced the Protecting Americans from Foreign Criminals Act, which would require comprehensive background checks. \n\n https://t.co/3hbP6jWWFJ","date":"Fri Apr 08 16:24:31 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Always great to see our amazing firefighter advocates in DC! Thanks for all you do to keep our communities and our brave first responders safe! https://t.co/jdnHLyX7pW","date":"Fri Apr 08 16:01:40 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I’m thankful @GOPLeader McCarthy named me a House Conferee for China Legislation. To counter the CCP, we must protect &amp; develop America’s amazing natural resources while defending our tech and academic research sector, &amp; I am proud to be in the fight.\n\nhttps://t.co/FxGdmGKAEU","date":"Fri Apr 08 15:01:33 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Why would anyone want to do this?","date":"Fri Apr 08 14:40:26 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Massive migrant caravans are a national security threat and an attack on American sovereignty. \n\nWe must make it clear to caravan organizers and participants: you will not breach our borders, and you will not violate our laws through sheer numbers.\nhttps://t.co/Qc87nebfxh","date":"Thu Apr 07 16:13:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"YES! I have been notified that certain restrictions on Capitol visitors are being lifted tomorrow--but the fight continues to fully re-open the PEOPLE'S House.\n\nAmericans deserve easy and regular access to their elected representatives!\n\nhttps://t.co/cIC5G3qBUn","date":"Thu Apr 07 14:27:30 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"Do you think it is worth child slave-labor to have these cars put in your fleet? Yes or no.\"\n\nExecutive Director Stephens: \"No.\"\n\nhttps://t.co/NcHFDcfxgc","date":"Wed Apr 06 21:00:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"So, DoD says they won't actually protect America's border, but they WILL provide bus service for illegals into our communities.\n\nPentagon politicos who whined about building a border wall are facilitating the final mile of trafficking illegal immigrants. https://t.co/SnWPsvATw7","date":"Wed Apr 06 20:22:48 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Once again, Joe Biden and Nancy Pelosi's allies in Congress BLOCK the PAUSE Act, which would preserve Title 42 health protections on our southern border.\n\nWhy is the Left happy to give illegal immigrants and COVID a free pass, as long as it means an unsecured border?","date":"Wed Apr 06 18:25:18 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Good question, Paul! Doesn't seem like anyone is home in the Biden administration.","date":"Wed Apr 06 14:33:43 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This tragedy, like so many in California, New Mexico, and across the country, happened because a violent criminal told society exactly who he was multiple times... and the authorities didn't listen. \n\nThen, innocent people suffer. \nhttps://t.co/itmwKmz7Sj","date":"Wed Apr 06 14:19:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Heads up for Social Security beneficiaries in New Mexico: SSA offices will restore in-person services, including for people without an appointment, on April 7, 2022!\n\nTo avoid waiting in line, you can still schedule an appointment at https://t.co/vZvvaxKC2K.","date":"Tue Apr 05 18:00:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Happy 100th Birthday to @KKOBradio, which first began broadcasting (in Morse code!) on this day in 1922 from New Mexico State University @nmsu \n\nhttps://t.co/r9nSnCnINe","date":"Tue Apr 05 17:51:05 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden admin claims that energy companies are sitting on over 9,000 “unused” permits to drill for oil and gas. \n\nThis is the most misleading statistic since they said that “Build Back Better” would cost taxpayers “zero dollars.”\n\nRead my op-ed here: \nhttps://t.co/LPVV1EgBZc","date":"Tue Apr 05 15:06:37 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Under Joe Biden, America has no borders.","date":"Tue Apr 05 14:47:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to join @jsolomonReports and @AmandaHead yesterday to discuss how the Biden administration is intentionally stripping itself of any tools to solve the Border Crisis, including throwing away Title 42.\nhttps://t.co/aDsvFhRuFx","date":"Tue Apr 05 14:41:24 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"As experts have been saying for ages, the Strategic Petroleum Reserve is intended for drastic emergencies, not policy-driven, self-inflicted crises by the Biden Administration. It is a \"drop in the barrel\" compared to unleashing American energy producers.\nhttps://t.co/Z0fgwpjzXJ","date":"Mon Apr 04 17:38:37 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Do you know a young New Mexican interested in serving our country as an officer in the Army, Air Force, Coast Guard, Merchant Marine, or Navy? Register here for an information session on Wednesday 27th! https://t.co/U6qQrQFSCg https://t.co/ss0uizTDNR","date":"Mon Apr 04 15:12:23 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to lead this fight to fully reopen the Capitol Building and give access BACK to the American people, who own these buildings and are our employers!","date":"Fri Apr 01 20:43:22 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Absolutely unacceptable. The politicians and media who have been demonizing law enforcement and celebrating criminals for the past few years have blood on their hands.","date":"Fri Apr 01 15:40:34 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Wow! Congratulations and many happy returns to Betty Reid Soskin!\n\nhttps://t.co/tUcsykKq7m","date":"Fri Apr 01 15:33:44 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/AbmFBTRIyx","date":"Fri Apr 01 13:49:21 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"That's the last bet I'm ever making with you, Congressman--the first rule in politics is never to wear a silly hat that someone hands you! 😆\n\nBut congrats to @RazorbackMBB for their March Madness performance!","date":"Thu Mar 31 20:36:40 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Punishing America’s energy producers with fees for land they have already leased is among the dumbest policies the Biden Admin could push in the middle of an energy crisis. Joe Biden either lives in a land of make believe, is trying to destroy our energy independence, or both.","date":"Thu Mar 31 18:15:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to see you, and happy to work together on this important issue!","date":"Thu Mar 31 17:30:15 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"After one year under Joe Biden, day-to-day life has become $5200 more expensive for American families.","date":"Wed Mar 30 14:55:22 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Let's be very clear: Biden officials are \"bracing for unprecedented strains at the border\" precisely because Biden officials are throwing out Title 42 and Remain in Mexico, while being publicly and infamously anti-enforcement.\n\nhttps://t.co/PExhrFyRiu","date":"Wed Mar 30 14:12:48 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Come and join our amazing team in Congress! https://t.co/PRBxDvcLM1","date":"Wed Mar 30 13:30:59 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This April marks 100 years of broadcasting by @KKOBradio, New Mexico's first radio station, founded in 1922! https://t.co/r9nSnCnINe","date":"Tue Mar 29 20:48:42 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Join me this Thursday evening for a tele-townhall, where you'll have a chance to ask me questions and discuss new ways we can serve the people New Mexico. See the graphic below for dial-in info! https://t.co/x00dYT7MJE","date":"Tue Mar 29 17:21:36 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I thank all the New Mexico families, friends, and patriots sharing love with our Vietnam Veterans today, who have demonstrated the very best of American courage and dignity.\n   \nMay God bless all those who have served our country with honor!\nhttps://t.co/nQFd5SIqvb","date":"Tue Mar 29 15:03:52 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/ZUACZclWYn","date":"Tue Mar 29 13:36:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"YOU DON'T SAY!?\n\nhttps://t.co/i5wI87ZMqo","date":"Mon Mar 28 19:51:31 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Maybe he should try different policies 🤷‍♀️\n\nhttps://t.co/cyLwCDa919","date":"Mon Mar 28 13:53:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Our Governor is ranked dead-last on economic freedom issues, and our President wages war against New Mexico's energy industry while abandoning our borders. \n\"Shocking, but not surprising\" as they say.\n\nhttps://t.co/6Hix4eMAna","date":"Fri Mar 25 16:46:09 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I invite @POTUS to New Mexico's border to meet the families and law enforcement forced to deal with drug runners, cartels, and criminal aliens. You don't have to visit foreign borders to show you care about people--there are Americans who need help NOW.\nhttps://t.co/Vz7hp21V2d","date":"Fri Mar 25 15:59:51 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great news for the families of New Mexico and their businesses! I'm proud to have pushed @USGSA and the House Appropriations committee to modernize the Santa Teresa Port of Entry so that our state can continue to lead the way in economic growth. \n\nhttps://t.co/Goffy8X6zM","date":"Thu Mar 24 22:51:25 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Are you the parent or teacher of an artistic 7th-12th grader in New Mexico's Second District? Their artwork could be chosen for display in our nation's capital! \n\nVisit this link for submission guidelines: https://t.co/KKQ8WdhCsA https://t.co/NRINMmeY5x","date":"Thu Mar 24 13:50:28 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Judges should be able to tell the difference between men and women--life must be very confusing for people who can't!\n\nhttps://t.co/veTya1A2Kk","date":"Wed Mar 23 14:49:05 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"God bless these brave men and their families.","date":"Tue Mar 22 19:01:18 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"To the farming families of New Mexico who supply America with dozens of wholesome products like pecans, milk, cheese, onions, and our famous chiles, happy National Agriculture Day! (Fortunately, farming tech has progressed a bit from this Pie Town cornfield in 1940!) https://t.co/eBw7lOpYC3","date":"Tue Mar 22 18:55:43 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"That's because it was always a dirty lie to smear the Border Patrol by their own superiors, and they want us to forget.","date":"Tue Mar 22 16:24:16 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration sees the disaster they've created, they know they are making it worse, and they don't care. \n\nhttps://t.co/vXtmrIGkNR","date":"Tue Mar 22 14:30:07 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Amazing--federal bureaucrats banning citizen-journalists from taking arial pictures of the chaos on our southern border, all to keep Americans in the dark. \n\nhttps://t.co/JgZP35SDfr","date":"Mon Mar 21 16:30:06 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@RepWesterman Surprise me--but don't count your brackets before they're won!","date":"Fri Mar 18 15:50:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Hey, @RepWesterman, if the Aggies win tomorrow you have to wear an @nmsu tie--and if the Razorbacks win, I'll wear a @UArkansas hat. What do you say?","date":"Fri Mar 18 15:33:43 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Victory! I'm glad I pushed the FAA to allow the historic Albuquerque International Balloon Fiesta to celebrate its 50th year!  \n\nhttps://t.co/NHO9ZIanqg","date":"Thu Mar 17 18:00:35 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Filling out my March Madness bracket--you know I had to put @NMSU right at the top! Go Aggies! https://t.co/Q3YPi8xH78","date":"Thu Mar 17 15:31:05 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to introduce legislation which would make the spouse and children of fallen police and firefighters serving at the local, state, and federal level eligible for scholarships and student loan forgiveness!\nhttps://t.co/lTmoYBplsN","date":"Thu Mar 17 14:14:56 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/mFtjAm1bS4","date":"Wed Mar 16 18:45:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you, friends!","date":"Wed Mar 16 16:42:50 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We read the same stories in New Mexico, California, New York, DC... someone commits terrible crimes for years, and is never imprisoned or institutionalized for long. Then they end up killing people. \n\nhttps://t.co/lKMRmSf1s7","date":"Wed Mar 16 14:18:08 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is tragic. My prayers are with these students, their families, and all the victims of this crash. \n\nhttps://t.co/3aemvmtFfS","date":"Wed Mar 16 13:33:28 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Join me this evening for a Q&amp;A on @GETTRofficial this evening:  https://t.co/n5UHMFVjL2 https://t.co/3GemO2311k","date":"Tue Mar 15 14:24:40 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please join me in praying for these officers and bystanders hurt in this senseless violence.\n\nhttps://t.co/ZLqRq6fGwV","date":"Tue Mar 15 13:22:10 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Big Congrats to NMSU Basketball on their win this weekend--now on to the NCAA! Go Aggies!","date":"Mon Mar 14 16:16:37 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thanks for the great interview, @cameron_arcand! Our broken border hurts countless Americans, including legal immigrants.  \n\nhttps://t.co/8wvWOxahu8","date":"Mon Mar 14 13:57:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to join @RepDustyJohnson, @RepOHalleran, and @RepAnnieKuster introducing the bipartisan Connect Unserved Americans Act, which will expand broadband coverage to more families in rural America!","date":"Fri Mar 11 16:04:09 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was great chatting with @ElAmerican_ about my fight in Congress for border security, an economy that serves all Americans, and a government that puts citizens and legal immigrants first. \n\nhttps://t.co/CdbwVE6QIu","date":"Fri Mar 11 15:50:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This week I had the honor of paying tribute to a great New Mexican and WWII hero, Sgt. Dan McBride, who passed away this February at the age of 97. He was among the greatest of the Greatest Generation.\n\nhttps://t.co/szmvhuskRQ","date":"Thu Mar 10 21:03:32 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Utterly horrifying. Human trafficking destroys lives on both sides of the border. \n\nhttps://t.co/LkzYUarZg2","date":"Thu Mar 10 19:48:45 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"American families are suffering from a double punch of the highest inflation in 40 years and skyrocketing gas prices. \n\nJoe Biden has taken America back to the Carter administration. \nhttps://t.co/t5UiBRyzTi","date":"Thu Mar 10 18:09:10 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to have you here, @KOBChrisRamirez! It is an honor to work in Congress for the people of New Mexico.","date":"Thu Mar 10 14:46:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Jen Psaki should talk to energy producers in New Mexico and across the nation whose permits are being held up by Biden's Bureau of Land Management in the middle of an energy crisis--because she clearly has no idea how any of this works.","date":"Wed Mar 09 19:43:43 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am glad that Governor Lujan Grisham is coming around to suspending the gas tax, one year after I introduced the PUMP Act. I hope she convinces sensible democrats in Congress to join me in providing relief for hard working American families. \n\nhttps://t.co/uMjGthC37y","date":"Wed Mar 09 19:01:18 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A government that enables a monster like this despises its own citizens. \nhttps://t.co/lMdKF7OB9s","date":"Wed Mar 09 16:13:31 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to meet with Albuquerque Area Firefighters from @iafflocal244! Thank you for your service, gentlemen, and enjoy your time in Washington! https://t.co/ELnGYqBAfr","date":"Tue Mar 08 21:25:50 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to join this legislation. Secretly building databases of law-abiding American citizens who merely exercise their Second Amendment rights is more Putin than Constitution.","date":"Tue Mar 08 17:46:40 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Darn straight!","date":"Tue Mar 08 16:33:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Not-so-fun fact: while the Biden admin continues to illegally freeze oil and gas leases, Bureau of Land Management has also stopped permitting--one company in the Second District still awaits approval for *80 PERMITS* on existing leases. \n\nJust stop attacking New Mexico energy!","date":"Tue Mar 08 14:59:59 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"NPR conveniently leaves out that the Biden administration has frozen domestic oil and gas leases from day one in office (illegally, I might add) which President Biden could reverse with a single phone call. \n\nhttps://t.co/Djl6H7rZVM","date":"Mon Mar 07 17:09:45 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Suppressing our domestic energy industry while sweet-talking tinpot dictators and murderers to pretty-please give us more oil: only Presidents who have spent four decades in the US Senate are capable of understanding the nuance and complexity of something so stupid.","date":"Mon Mar 07 17:00:51 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Pop quiz: to offset the cost of divesting from Russian oil and gas (a good idea!) the Biden administration is...\n\n1) expanding and promoting American domestic energy\nor\n2) coming crawling to other authoritarian governments around the globe\nhttps://t.co/R0lJoFzEvo","date":"Mon Mar 07 16:53:21 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Awesome. Very glad to hear when legislators from both parties cooperate to expand education options for New Mexico's children!","date":"Mon Mar 07 16:45:08 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This man, who was in our country illegally, was arrested for assaulting a cop... and then let go without deportation, because California refuses to help ICE enforce the law.\n\nA week later, he murdered his three beautiful daughters and their chaperone. \n\nhttps://t.co/edew8RwVgw","date":"Mon Mar 07 14:28:04 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I have requested that @OversightDems agree to hold a hearing with @GOPoversight on prescription drug prices and investigate how some Pharmacy Benefit Managers have inflated prices and exploited patients. \n\nAmerican families should not face extortion for lifesaving drugs! https://t.co/UXZQtA4Gp2","date":"Fri Mar 04 17:52:25 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My colleagues and I have been fighting for an entire year to hold vital hearings on the ongoing border disaster--but the extreme Left which controls Congress won't even acknowledge there's a problem!","date":"Fri Mar 04 16:01:24 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"👏👏👏","date":"Fri Mar 04 00:47:19 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to have you here!","date":"Thu Mar 03 18:28:05 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to support HR 3802: Medical Transport for Rural Vets, HR 2910: Vets Health Care Freedom Act, HR 2419: Affordable Housing for Homeless Vets, etc.\n\nWhy does Pelosi cram Vets bills into $2 trillion inflationary disasters, pack them full of poison pills, and block stand-alones?","date":"Thu Mar 03 17:57:49 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@DavidMo66984563 @KOB4 Proud to support HR 3802: Medical Transport for Rural Vets, HR 2910: Veterans Health Care Freedom Act, HR 2419: Affordable Housing for Homeless Vets, etc.\n\nWhy does Pelosi cram vet bills into $2 trillion inflationary disasters full of poison pills, blocking good stand-alones?","date":"Thu Mar 03 17:50:56 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If we're serious about a cleaner, affordable, and tech-driven future, we should put politics aside and invite all innovators (like @elonmusk!) to the table.","date":"Thu Mar 03 16:27:06 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please remember officer Robert Duran and his family in your prayers, as well as the civilian driver who was killed. Officer Duran helped to stop a kidnapper and carjacker, and made the ultimate sacrifice. \nhttps://t.co/tlzWiWxPab","date":"Thu Mar 03 15:56:13 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Nancy Pelosi is shutting out the Health Care for Burn Pit Veterans Act, which passed the Senate unanimously, &amp; which I support. Instead, she pushes a $282 billion spending bill that will never become law. I urge my Democrat colleagues to help veterans with the bipartisan bill.","date":"Thu Mar 03 14:54:50 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was great to meet with dedicated educators from the New Mexico Association of Secondary School Principals and discuss new ways we can help NM families and students! https://t.co/kBKOPClRFE","date":"Wed Mar 02 19:51:12 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In local news: I'm glad the whole NM delegation, regardless of party, is working to ensure that the 50th Anniversary Albuquerque Balloon Fiesta goes ahead as planned!   \n\nhttps://t.co/qArlrUFE5J","date":"Wed Mar 02 19:24:49 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great talking with you, Virginia!","date":"Wed Mar 02 14:28:28 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A study in true leadership and an outstanding vision for the American people from @IAGovernor!","date":"Wed Mar 02 05:09:48 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I've been discussing Ukraine, the US Border, America's economy, and much more with reporters in the hours leading up to the State of the Union. \n\nWatch for this interview on KOAT if you're in New Mexico! https://t.co/rEhrTrJBnS","date":"Tue Mar 01 19:02:04 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Agreed. We can have both sanctions and affordable energy, but we will need to work across the aisle to achieve American energy independence.","date":"Tue Mar 01 16:22:57 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Today, Joe Biden will lie to the American public and say that the state of our Union is \"Strong.\"\n\nBut he has weakened America more in one year than any President in our lifetime. https://t.co/kGXZCLruzs","date":"Tue Mar 01 14:29:46 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please join me in praying for an end to abortion, Speaker Pelosi.","date":"Tue Mar 01 14:08:37 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If you, a family member, or friend is a veteran living in Ruidoso or Socorro and interested in learning to use the VA's MyHealtheVet website and maximize your benefits, please check out these upcoming sessions hosted by our amazing Veteran Liaison! https://t.co/RuyfZI7eBX","date":"Mon Feb 28 23:02:16 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Necessary sanctions on Russia will raise domestic energy prices. To lower prices &amp; ensure national security, we must become energy independent. \n\nTo achieve this without American oil &amp; gas is less than a fantasy, it is a joke: just like the administration Jen Psaki represents.","date":"Mon Feb 28 18:46:27 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Now that the eyes of the world are off the petty authoritarians in the Canadian government, they are seizing the opportunity to destroy free speech and a free press.","date":"Mon Feb 28 17:40:27 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The State of the Union will be maskless (good!) but low-to-no-risk kids still get forced to wear the face diaper.  \n\nLeftists loudly proclaim faith in \"science\" because they define science as whatever helps them exert power over others.","date":"Mon Feb 28 17:12:45 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Drought is a constant threat for the businesses and families of New Mexico. I discuss some concrete water management proposals in this piece for .@CrucesSunNews  https://t.co/uI85DqxggM","date":"Mon Feb 28 15:23:05 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Fences back up around the Capitol, and our border still wide open.\n\nJoe Biden and Nancy Pelosi's public enemy #1 is the American public. https://t.co/lPtOHzXKIU","date":"Mon Feb 28 15:03:16 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I hope President Biden's nominee to SCOTUS upholds the Constitution, recognizes the rule of law, and is willing to defend our precious rights--especially the human rights of unborn Americans. Our nation will be watching.\nhttps://t.co/LP2dne2s7W","date":"Fri Feb 25 20:01:14 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Confirmed: dozens of Afghan evacuees deemed potentially dangerous have been allowed to slip away into our country by the Biden Administration.\n\nI am proud to lead my colleagues in Congress demanding transparency, and to ensure this never happens again. \nhttps://t.co/TWb6zF8KDm","date":"Fri Feb 25 15:57:53 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The blood of innocent people will be on Putin's hands. \nPlease join me in praying for the people of Ukraine, and for peace. \nhttps://t.co/Fnw1rCHOuK","date":"Thu Feb 24 04:40:30 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Good news, but will Trudeau put a stop to frozen finances, persecution of families handing out sandwiches, and tackling grannies? \n\nMy asylum bill for peaceful Canadian protesters stands until both the Emergencies Act AND the abuses it encouraged are over.\nhttps://t.co/a0XZHRPUZk","date":"Thu Feb 24 00:36:03 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was great to join @foxandfriends to discuss political asylum for peaceful protesters in Canada, and how all Americans and Canadians should stand up against heavy-handed government crackdowns!\n\nhttps://t.co/yiATGdtCCT","date":"Wed Feb 23 19:32:41 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"1) It's great that COVID vaccines exist\n2) The government shouldn't be forcing you to get them\n\nProud to cosponsor this legislation that would allow Americans who lose their job or livelihoods because of these mandates to sue the government!\n\nhttps://t.co/kk1ldaMhhK","date":"Wed Feb 23 16:42:59 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Are you a veteran who wants to make the most of your benefits and learn how to navigate the VA website? Or do you have family or friends who might find it useful? Join my team in Isleta, NM tomorrow! https://t.co/3UZf8ZkWcM","date":"Tue Feb 22 17:16:14 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Canadian people, like Americans, share a long tradition of rights under the law in a democratic society--if we don't stand for them now, who will stand for us if such brutal government crackdowns come to the States?","date":"Tue Feb 22 16:56:29 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration imported and lost track of DOZENS of potential terrorists from Afghanistan in the last few months, but letting truckers from Canada stay here for a while is beyond the pale for liberals.  \n\nhttps://t.co/KXRGQpPL6Y","date":"Tue Feb 22 15:41:38 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am introducing legislation that would temporarily grant asylum to innocent Canadian protesters who are being persecuted by their own government. We cannot be silent as our neighbors to the north are treated so badly. 3/3","date":"Sat Feb 19 16:36:28 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Just as we provide asylum for political prisoners, we should do the same for truckers who have been subjected to violence, had their property confiscated, and their bank accounts frozen by a government that is quickly becoming the embarrassment of the free world. 2/3","date":"Sat Feb 19 16:35:36 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Justin Trudeau’s heavy-handed crackdown against peaceful protesters in Canada is not the action of a Western Democracy, but that of an authoritarian regime like Venezuela... 1/3","date":"Sat Feb 19 16:34:56 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Our amazing Northern District Advisor had a fun time holding mobile office hours in Bosque Farms, and says their library is great if you want to swing by sometime! https://t.co/NmLGn1y5Nk","date":"Fri Feb 18 20:29:44 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was an honor to serve alongside Minnesota's Rep. Jim Hagedorn in Congress. Please keep his family in your prayers. Rest in peace, Jim.\n\nhttps://t.co/AJGdVoixXq","date":"Fri Feb 18 15:44:48 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is yet another example of how Washington agencies run roughshod over local expertise and wishes, especially for rural communities in the American West, who are considered an annoying roadblock to whatever policies the Feds wish to inflict.\n\nhttps://t.co/46rGkXE3Y1","date":"Thu Feb 17 19:34:50 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@nmcga @forestservice This method was inhumane, and risked leaving orphaned calves starving to death. Furthermore, as the pictures above (taken by locals) show, waterways have been contaminated by carcasses, which could also attract the same wolves the Feds want to stay away!","date":"Thu Feb 17 19:34:10 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Despite objections from local ranchers, the Cattle Growers’ Association (@nmcga), the New Mexico Livestock Board, and others, the federal @forestservice went ahead and slaughtered dozens of wild cattle from helicopters in the Gila National Forest--this is infuriating...🧵 https://t.co/2i7oHuOWeq","date":"Thu Feb 17 19:27:37 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If you're in Deming or nearby, or just interested in this important local issue, please see my statement on the unfortunate situation with their fire department: https://t.co/y4hru046gh","date":"Thu Feb 17 18:05:53 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is the kind of reporting we could use more of on the Hill!","date":"Thu Feb 17 18:01:12 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The US fell from 20th in Economic Freedom in 2021 to 25th in 2022--I wonder what happened in the last year? \n\nhttps://t.co/KZbcXM3MFq","date":"Thu Feb 17 15:54:56 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is what happens when you are more concerned with trashing Abraham Lincoln and George Washington than educating kids.\n\nAn important lesson: when school administrations go off the rails, parents can step up and throw out the wokesters.","date":"Wed Feb 16 16:08:44 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Politicians sabotaging American energy producers should consider how much money from oil/gas taxes and fees pours into our public schools. \n\nRead more in this piece I wrote with .@RepWesterman, Ranking Member of the House Natural Resources Committee!\nhttps://t.co/ewm1e3F0SS","date":"Wed Feb 16 15:45:39 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"✔️Hillary spies on White House communications\n\n✔️Financial orgs used to spy upon and sabotage our Canadian cousins\n\n✔️Biden ATF maintains illegal database on American gun owners and sales\n\nI'm sure we can trust these people not to abuse their power, right?\nhttps://t.co/M9B1ZMtjRK","date":"Tue Feb 15 20:55:50 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/j0z9pj8jLK","date":"Tue Feb 15 20:18:18 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Do you know a bright young person who wants to work in Congress, learn about our government and American history, and serve the people of New Mexico? I want to hire them! https://t.co/ebuMJLhGWl","date":"Tue Feb 15 17:10:17 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A bit late to the PUMP Act party, but the more the merrier! Let's get rid of the federal gas tax and save American families some money.","date":"Tue Feb 15 16:23:47 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Sounds like my kind of lady!","date":"Tue Feb 15 15:28:49 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"Mr. Nash has a history of misdemeanor arrests, court records show\"\n\nI wonder: who was the last DA, judge, or politician to let this guy go free? \n\nWe must hold such people accountable for the innocent Americans who suffer from their soft-on-crime policies.","date":"Mon Feb 14 17:02:08 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I ❤️ you, New Mexico! https://t.co/dmSaRFvpcm","date":"Mon Feb 14 16:52:30 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to be on the show! Democrat or Republican, no American should want their tax dollars to go to China--that's why we're working to ban federal funding of any research, experiments, and projects with Xi Jinping's brutal regime.","date":"Mon Feb 14 16:19:37 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is a tragedy for families in Albuquerque. \n\nFor the political leaders who passed no cash bail and forced a consent agreement on our police force, it's a farce. \nhttps://t.co/xDpsaTvp49","date":"Mon Feb 14 15:20:36 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank God, we are hearing that the NMSP officer is in stable condition. Please keep in your prayers. \n\nThis violence against our brave men and women in law enforcement will only get worse if we don't get serious about stamping out crime and supporting our police.","date":"Fri Feb 11 18:47:56 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Americans shouldn't be forced to fund any more Wuhan lab disasters. \n\nhttps://t.co/PIrANjzdbo","date":"Thu Feb 10 18:33:08 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to introduce legislation forbidding the use of American tax dollars from funding experiments and research with the Chinese government, as well as a bill that will help return vital pharma/medical production from China to the USA. \n\nhttps://t.co/U5qdPztEUI","date":"Thu Feb 10 16:42:11 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Getting rid of the federal gas tax is a great way to ease financial burdens on American families, which is why I introduced it in the House a year ago as the PUMP Act. Looking forward to building bipartisan support for this idea, Senator!","date":"Thu Feb 10 15:35:22 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm proud to cosponsor the @RodneyDavis bill to make the Trump Tax Cuts PERMANENT.","date":"Wed Feb 09 22:17:34 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe Biden handing out crack pipes to end racism was not on my bingo card for this year, and its only February. \n\nBy August I expect the White House will be releasing its Chainsaws for Kindergartners initiative to combat earthquakes.","date":"Wed Feb 09 16:28:22 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The extreme Left *should* continue campaigning on \"defund the police\"--when your intentions are clear, the American people will choose accordingly. \n\nI prefer law enforcement to be fully equipped, funded, and supported, along with most Americans.  \nhttps://t.co/XC9f4DaDCv","date":"Wed Feb 09 16:13:21 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I will continue to stand up for our ranching community and demand that the @forestservice abandon irresponsible proposals to shoot cattle in the Gila National Forest. @GilaNForest \n\nhttps://t.co/mIVV2EeyRG","date":"Wed Feb 09 14:37:39 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am introducing two bills: one to take back American pharmaceutical production from China, and another that forbids the federal government from using our tax dollars to fund research projects with the Xi Jinping's corrupt communist regime. \n\nhttps://t.co/vOGcPCmXC7","date":"Tue Feb 08 22:45:26 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Time for the EPA to get to work and clean up the Eagle Picher site in Socorro. \n\nhttps://t.co/ubKMyIMV1n","date":"Tue Feb 08 22:19:31 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"There's dumb, and then there's *opening a communism-themed restaurant in Miami* dumb. \n\nhttps://t.co/MiGsc2JIQd","date":"Tue Feb 08 17:13:43 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Heads up for Lincoln County: Bureau of Land Management will be conducting prescribed fire operations ten miles northeast of Ruidoso and six miles southeast of Capitan. \n\nSmoke may be visible from Capitan, Lincoln, Ruidoso and other communities. \n\nhttps://t.co/VbIYHOIXRN","date":"Tue Feb 08 15:40:22 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congratulations to Andrew at White Sands School for winning the Congressional App Contest for New Mexico's Second District!\n\nhttps://t.co/KEi0gIuDsb","date":"Mon Feb 07 20:33:06 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If all Americans knew what horrors their tax dollars were funding every day, the federal government would be a lot smaller.","date":"Mon Feb 07 20:24:43 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"All Americans should find China's genocide and civil rights abuses more \"personally offensive\" than the art protesting them. \n\nThe fact that a president at such a high-profile university is terrified of offending the communists is disgraceful.","date":"Mon Feb 07 18:16:14 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm continuing to fight for reliable, cost-effective rural broadband in New Mexico and across America. \n\nRead my piece below for thoughts on the challenges ahead and vigilance required to ensure that $$$ for rural broadband goes to worthwhile projects! \n\nhttps://t.co/4LnUlIdvKw","date":"Mon Feb 07 17:36:21 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to stand with the courageous men and women of the @ABQPOLICE Department and the thousands of families who demand a safer city. To end the violent crime wave, we must let law enforcement actually enforce the law. \n\nhttps://t.co/6wNq9fcijH","date":"Mon Feb 07 15:56:30 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/nkORMBSSP5","date":"Mon Feb 07 14:47:45 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I congratulate President Giammattei and the nation of Guatemala for taking human trafficking seriously--it shows how much progress we can make by working together. I just hope that President Biden can follow this example in our own country!","date":"Fri Feb 04 17:03:30 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My colleagues on the Left must be really worried about hurting their social credit score.  \nI’ve looked at their so-called “COMPETES” Act.\nThis bill mentions “coral reefs” more times than China. \nIt mentions “climate change” 156 times. \nIt actually awards China money.","date":"Fri Feb 04 15:54:12 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is happening in Albuquerque right now and crime is rising. Between our Governor, \"no cash bail,\" a Soros-picked DA, and a DoJ \"consent decree\" meddling with local law enforcement, innocent people will continue to suffer while violent criminals are allowed to run rampant.","date":"Thu Feb 03 22:29:44 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"-Came to this country illegally\n-Extensive criminal history\n-Deported twice before\n-Defaced public buildings in Washington with swastikas\n\nWould the Biden administration take action against this person? Of course not! \n\nhttps://t.co/dCqz3yLgkB","date":"Thu Feb 03 21:00:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe Biden's “National Strategy on Gender Equity and Equality” calls to end cash bail and pretrial incarceration.\n\nWe should give the police all the resources they need, but if we keep letting criminals out of jail, they will keep committing crimes. \n\nhttps://t.co/ExtL2o7tQR","date":"Thu Feb 03 19:10:12 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to stand for the men and women of the Albuquerque Police Department, whose efforts to protect our communities have been hurt by a DoJ consent decree foisted upon them for far too long. \n\nhttps://t.co/cTmVlAxmEC","date":"Thu Feb 03 18:59:31 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@POTUS Biden's dangerous rhetoric and actions show he doesn’t intend to treat criminals as criminals, rather, let them out of jail only to commit more crime. We should stand with law enforcement while holding dangerous criminals accountable, that’s how you solve the crime crisis. (2/2)","date":"Thu Feb 03 18:58:12 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"After letting the crime crisis in our nation seep into every neighborhood, .@POTUS agrees with Republicans in Congress that we should not defund the police--but he is changing the narrative again... (1/2)","date":"Thu Feb 03 18:57:28 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It's hard to imagine another country ON EARTH which would let an illegal resident kill a citizen, then say \"no, that's alright, you can still stay here.\"\n\nIn Joe Biden's America, all citizens are second class.\n\nhttps://t.co/QneULmVSZ9","date":"Wed Feb 02 22:00:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"One year ago I introduced the PAUSE Act to prevent Covid breakouts from coming through our broken borders. \n\nThe Left is thrilled to unnecessarily mask little kids &amp; strong-arm businesses into playing Covid Cop. Why not protect our health at the border? \n\nhttps://t.co/oIqTpahXmL","date":"Wed Feb 02 20:42:55 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We ask questions about Wuhan and Fauci, and the Leftist media and Washington politicians scream like a pug getting its nails clipped.\n\nWhy don't they want to shine a light on this mess? \n\nWhat do they have to lose from transparency?\n\nhttps://t.co/0YUGBvdRxy","date":"Wed Feb 02 18:22:31 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to join every GOP member of the Oversight Committee in demanding answers on the Wuhan Institute of Virology and involvement of government officials like Anthony Fauci. \n\nIf we don't get answers now, this type of disaster will only happen again. \nhttps://t.co/0YUGBvdRxy","date":"Wed Feb 02 18:16:47 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Have tax issues or questions? Make an appointment with the Taxpayer Advocate Service to help figure it out! https://t.co/zXx2t5wxLA","date":"Wed Feb 02 17:34:07 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"With illegal aliens quietly shuffled around the country by the Biden administration, every state is a border state. \n\nWith more and more migrants coming from all around the world, every country can access our broken Southern border. \n\nThis is dangerous.\n\nhttps://t.co/zJkSnj9RN5","date":"Wed Feb 02 16:43:51 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"People are streaming across the globe to illegally cross our borders.","date":"Wed Feb 02 16:15:21 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Team Herrell thanks Team @RepYoungKim for the potstickers and kimchi pancakes--Happy Lunar New Year! 새해 복 많이 받으세요!","date":"Tue Feb 01 22:43:41 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Get well soon, Senator! You and yours are in my prayers.","date":"Tue Feb 01 21:22:18 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Catch the @freedomcaucus hold our own hearing on the Biden Border Crisis right now! Witnesses include a New Mexican cattle rancher who has an up-close and personal view of the chaos on our southern border:\n\nhttps://t.co/JyrULAiYQv","date":"Tue Feb 01 20:15:58 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@TomDuncombe \"According to one of the program's studies, teenaged participants in the pilot trial were \"recruited\" to use the app in six different cities and traveled to attend \"interventions\" to discuss the sex education program, all without parental permission.\"","date":"Tue Feb 01 19:59:28 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If an individual were to secretly contact a 13 year old child and ask them to report their sexual behaviors, that person would rightly go to prison and end up on a watch list.\n\nThe government is using your tax dollars to do the same thing. \n\nhttps://t.co/ROaKTByySE","date":"Tue Feb 01 19:55:31 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@SecMayorkas despises the laws he was hired to enforce, and sabotages the brave men and women in uniform whom he was supposed to lead. \n\nHe should resign or be impeached. \n\nIf one doesn't happen now, we'll make sure the other happens next year.\nhttps://t.co/VCtDwBWB8b","date":"Tue Feb 01 18:32:26 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Leftist mayors and panic-profiting media will make America the last place in the world to follow the science.","date":"Tue Feb 01 18:22:42 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"157 years ago today, Abraham Lincoln signed a joint House and Senate resolution that became the 13th Amendment, once and for all abolishing slavery in the United States. \n\nHappy Freedom Day! https://t.co/bDX6fM4GBN","date":"Tue Feb 01 16:04:47 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@grantbosse @dbernstein 🙌","date":"Mon Jan 31 21:31:14 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Violent crimes in Albuquerque are soaring while the Biden DOJ uses \"consent decrees\" to paralyze police and endanger our communities.\n\nLittle Miss Hammer and Sickle Hat might want to stop laughing and start taking this seriously.","date":"Mon Jan 31 19:12:46 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'd rather entrust the government of the United States to the first 400 truckers driving through Las Cruces on a Monday morning than the Democratic Party.","date":"Mon Jan 31 15:13:25 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It's time to pass the Defending Our Defenders Act, which makes murdering a state or local police officer punishable by the federal death penalty. \n\nWe must tell violent criminals: pulling the trigger against a cop will be the last thing you ever do.\n\nhttps://t.co/XFXcYS4fc4","date":"Sat Jan 29 20:49:28 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Get woke, go broke.\n\n(Except if you're in charge, then run off with everyone's money and buy mansions)\n\nhttps://t.co/uoraYM5EG6","date":"Fri Jan 28 16:10:05 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Whether stifling energy production in New Mexico or mining in Minnesota, this administration seems hellbent on killing jobs and hindering America's energy independence.","date":"Thu Jan 27 16:02:50 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Why is Nancy Pelosi so scared of standing up to China? https://t.co/iLfcDFGZld","date":"Wed Jan 26 20:57:27 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If Americans were ruled by people who hated them and wanted to destroy their country... what would they do differently?\n\nhttps://t.co/VZrmO0efxM","date":"Wed Jan 26 16:23:07 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The United Nations funds a program that helps migrants uncover \"repressed memories\" that will help qualify them to get into America. Insanity.  \n\nhttps://t.co/5jFDV2n2DM","date":"Tue Jan 25 16:58:18 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@LetiNMPatriot Thank you, we're all in this together!","date":"Tue Jan 25 15:39:03 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is vile beyond words. \n\nIf this latest assault on American soil doesn't force the Biden administration to take vetting seriously, nothing will.\n\nhttps://t.co/GuGateU7rP","date":"Tue Jan 25 15:38:12 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"U.S. Customs and Border Protection (CBP) apprehended 178,840 illegal immigrants at the border in December 2021, making it the worst December at the border in Department of Homeland Security (DHS) history\"\nhttps://t.co/BOWqrLl1Th","date":"Tue Jan 25 15:21:07 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to join this push led by @RepBentz to make sure that the National Personnel Records Center cuts out the delays and serves America's veterans promptly! \n\nhttps://t.co/Pm04X9E198","date":"Mon Jan 24 20:39:25 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico is one of only 5 states to require the booster for healthcare professionals--and we are losing nurses every day because of it. \n\nMandates make liberals feel warm and fuzzy, but they're chasing away medical personnel when we need them most. \n\nhttps://t.co/wp0xo4PUoq","date":"Mon Jan 24 20:15:48 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Amen!\n\nhttps://t.co/voyjvipsEL","date":"Mon Jan 24 20:06:44 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm honored to get a solid 💯 Liberty Score from @CR, and I promise I'll keep fighting! https://t.co/Yd9Rbx9dYC","date":"Mon Jan 24 15:51:50 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was COLD but tens of thousands of Americans turned out in DC to March for LIFE! Great to see @mallorytq from the pro-life Susan B. Anthony List and so many cheerful patriots! https://t.co/tptzGZ3t4f","date":"Fri Jan 21 22:17:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Across our great country, hundreds of thousands of Americans are marching in solidarity with the unborn. This morning I will be marching with them. \nOur laws must reflect what science, ethics, and tradition tell us: children in the womb are human beings who have a Right to Life. https://t.co/3ens0JFpls","date":"Fri Jan 21 15:32:23 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Sounds like an awesome project! Let's shine a light and show the American people what's really going on.","date":"Thu Jan 20 17:43:23 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"😬","date":"Thu Jan 20 15:59:34 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is outrageous. Mayorkas is bragging about refusing to do his job. \n\n@GOPoversight, lets plan on doing some digging!","date":"Thu Jan 20 15:02:03 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Did Biden just claim that members of the press are the most knowledgeable Americans? \n\n😆😆😆","date":"Wed Jan 19 21:52:52 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"First we get Coronavirus from China.\n\nNow, completely unsupported by science or practicality, Nancy Pelosi wants to force all Members of Congress and their staff to wear KN95 masks at all times... bought and imported from China!\n\nIt would be hilarious if it wasn't so sad. https://t.co/sF8YwRug64","date":"Wed Jan 19 19:31:57 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I was thrilled to join @TuckerCarlson and discuss how illegal migrant caravans are hurting indigenous peoples in Panama and across Central America.\n\nWhy don't illegal immigration-loving Democrats care about these communities? \n\nhttps://t.co/ilNbuOgPqM","date":"Wed Jan 19 17:38:51 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Tune in tonight! https://t.co/aZPGpysXAk","date":"Tue Jan 18 21:57:12 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Catch me tonight on @TuckerCarlson as we discuss the continuing Biden Border Crisis and how massive illegal caravans are hurting indigenous communities in Central America!","date":"Tue Jan 18 20:19:21 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to be joined by @RepWesterman and many other GOP colleagues in demanding that the Department of the Interior STOP sabotaging American energy producers.\n\nhttps://t.co/8gq1vnuF3Q","date":"Tue Jan 18 20:10:57 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This insanity must be stamped out across America. We are in a battle for the mental health of children everywhere.","date":"Tue Jan 18 19:16:43 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"A just law is a man made code that squares with the moral law or the law of God. An unjust law is a code that is out of harmony with the moral law.\" -MLK Jr.","date":"Mon Jan 17 19:13:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Hahaha, when the Left is being led by people embarrassed by their own extreme ideology, you know they have a problem!\n\nhttps://t.co/itgJWDK6b4","date":"Fri Jan 14 23:46:18 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"When given the chance to actually stand up to Russia and defend American energy independence, the Democratic party has the spine of a wet washcloth.","date":"Fri Jan 14 22:31:02 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Democrats used the filibuster over 300 times during the last administration.","date":"Thu Jan 13 20:07:32 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"VICTORY. \n\nIt's time to follow the science, re-open, and get life back to normal for all Americans.","date":"Thu Jan 13 20:04:35 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"😆","date":"Thu Jan 13 15:52:44 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"Between March/August 2021, as a result of the Biden Administration’s failed border policies, over 270,000 illegal aliens have been dispersed into the United States with little chance for removal.\" \nThanks to my colleague @SenRonJohnson for this bombshell!\nhttps://t.co/O16nVCgaoG","date":"Thu Jan 13 15:48:47 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Inflation is a hidden tax on American families--and after one year under Joe Biden, it's at the worst levels since 1982. \n\nhttps://t.co/vsyx7ZdfCa","date":"Wed Jan 12 15:35:52 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am so proud to be a recipient of the 2021 Freedom Fighter Award--thank you, @FreedomWorks! \n\nIn 2022 we're going to keep battling against high taxes, dumb regulations, and outrageous cost of living for American families. \n\nhttps://t.co/qgblGgruOn","date":"Tue Jan 11 15:52:28 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Unacceptable.","date":"Tue Jan 11 15:49:54 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We CANNOT allow crazy authoritarians to lock the American people out of THEIR capital city with unnecessary and unscientific mandates!\n\nhttps://t.co/YUamlmIHkW","date":"Mon Jan 10 21:00:01 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congratulations to Carmen Chapin for snagging one of the coolest jobs in the West!\n\nhttps://t.co/cAfHfM5gjD","date":"Mon Jan 10 19:20:00 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"These were sent to me by someone guarding New Mexico's southern border. With zero support from the Biden administration, Border Patrol agents are forced to patch up holes in the old pre-Trump border fence, which smugglers easily cut through. \n\nThis is why we need a real wall! https://t.co/K6TEWdL5mC","date":"Mon Jan 10 18:08:17 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was an honor to join the Belen Chamber of Commerce and see so many great New Mexicans in Valencia County this weekend! I look forward to working with Belen’s new Mayor Robert Noblin. https://t.co/5ajb2vzHLV","date":"Mon Jan 10 17:35:55 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Today is National Law Enforcement Appreciation Day.\nTo all who guard our little slice of America... \nWho brave the darkness, the cold, the heat, at any hour of the day...\nWho bring justice to the evildoer, and safety to our homes…\nTHANK YOU! https://t.co/R5Ygr11WC9","date":"Sun Jan 09 17:40:30 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Lawrence Brooks, rest in peace!","date":"Thu Jan 06 18:31:17 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe Biden's weakening of America continues. The Nord Stream 2 pipeline gives Russia an iron grip on Europe's energy supply. If the Biden admin didn't despise America's energy producers so much, we could strengthen our allies, and achieve energy independence and low prices at home","date":"Thu Jan 06 18:20:51 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"UPDATE: Gavin Newsom has now allowed the fish to vote in California","date":"Tue Jan 04 19:52:25 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Mexican cartels are murdering tens of thousands of Americans every year. \n\nhttps://t.co/FW3bO6eEud","date":"Tue Jan 04 16:12:49 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I have called for hearings on unfair trade practices within the meatpacking industry. This action is a positive step, but more must be done empower our producers and ranchers to sell great American meat to the American people and protect our food supply.\n\nhttps://t.co/WIynbrLvWb","date":"Mon Jan 03 19:58:30 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is often Chinese-made poison, smuggled into our country by Mexican cartels. For every package seized, many more are getting through. We need to fight this like a war, because 100,000 Americans are dying every year.\n\nhttps://t.co/fEqaJgeDJE","date":"Mon Jan 03 18:59:26 +0000 2022","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"May your families be blessed with great peace and joy this Christmas, and may we each carry the spirit of this wonderful day in our hearts all year ‘round. Today, let us especially pray for our courageous men and women in uniform who protect our communities and our country! https://t.co/B5zXokWe7a","date":"Sat Dec 25 17:06:31 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Excited to talk to the National Shooting Sports Foundation about fond memories of hunting with my Dad, pro-Second Amendment legislation, and responsible firearm ownership. Thanks, @NSSF! \n\nhttps://t.co/TngCoZ0LHc","date":"Thu Dec 16 16:34:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Some centrist Democrats are urging President Biden to suspend the gas tax. Great news! I have legislation ready to go! \n\nhttps://t.co/etG0DLDgiP","date":"Wed Dec 15 19:08:45 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"230 years ago today, the first 10 Amendments to the Constitution were ratified, guaranteeing our freedom to worship, speak out, bear arms, and a host of other vital rights under the law. \n\nHappy Bill of Rights Day! https://t.co/yzDqnWp0s1","date":"Wed Dec 15 16:30:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A great story about helping inmates with education and reintegration in society. \n\nhttps://t.co/f2FSkdykIF","date":"Wed Dec 15 15:21:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"When they tell you who they are... believe them.\n\nhttps://t.co/Ain9w0Jw94","date":"Tue Dec 14 19:00:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"While Washington insiders and radical leftists want to release dangerous criminals with no bail and leave our borders wide open, drugs are pouring into our communities and devastating our neighborhoods, families, and future. https://t.co/eHdJ1ddbIH","date":"Tue Dec 14 18:45:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration continues to set all-time records--just not, you know, good ones. \n\nhttps://t.co/S6gLcapXBZ","date":"Tue Dec 14 18:21:06 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A devastating piece. On the plus side, this is America: presidents come and go, but the people and their country remain. \n\nhttps://t.co/DYaY1eqqOH","date":"Mon Dec 13 21:16:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Al Unser, RIP. https://t.co/E5gqdnAPrd","date":"Fri Dec 10 15:54:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I met with President Giammatei this week and the stories are 100% true: he is more concerned about our border crisis--and its ripple effects on Central American nations like his--than Joe Biden and Kamala Harris.\n\nEmbarrassing for this administration.\n\nhttps://t.co/L8e8jcpQZV","date":"Fri Dec 10 15:11:45 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This did not have to happen. \n\nhttps://t.co/tr5ycjWFmg","date":"Fri Dec 10 14:55:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Russiagate hoax crowd is pretty quiet now that their guy is literally giving land to Putin. \n\nhttps://t.co/huZYOHMXrC","date":"Thu Dec 09 19:43:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was great to join @USEnergyStream for their 2021 Energy Transition and Innovation Forum--we will NOT allow extremists in the Biden administration to destroy American oil and gas jobs! https://t.co/IAN2v6TdJm","date":"Thu Dec 09 17:11:31 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to be a co-sponsor for this vital bill we passed last night! American industries deserve a fair playing field in global trade, and the Ocean Shipping Reform Act protects our domestic businesses and consumers. https://t.co/Ehw8PSQsal","date":"Thu Dec 09 16:33:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was great to meet with Francisco Agapi, Mayor of Cémaco, Panama--we discussed how massive illegal caravans headed northward are hurting indigenous peoples in Panama and across Central America. Not a perspective you'd get from the mainstream media! https://t.co/uBG2AuM8ho","date":"Wed Dec 08 22:05:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is a DIRECT result of:\n\n1) Leftist DA's and a revolving door justice system that allows repeat offenders to continue victimizing innocent Americans.\n\n2) Political/media elite hellbent on demonizing police and glorifying crime as \"resistance.\" \nhttps://t.co/oLIfmP9hvb","date":"Wed Dec 08 19:37:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Glad to speak to Newsy about how my PUMP Act would suspend the federal gas tax and help American families!","date":"Wed Dec 08 15:18:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We also rejected a “red flag law” that would have authorized military judges to confiscate firearms without due process.","date":"Wed Dec 08 15:17:06 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We removed hundreds of terrible provisions that would have required women to register for the Draft, forced the Department of Defense to act as the diversity police, and shifted DOD’s focus away from warfighting","date":"Wed Dec 08 15:16:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This NDAA PROHIBITS military services from giving service members a \"dishonorable discharge\" for refusing the COVID-19 vaccine.","date":"Wed Dec 08 15:16:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This NDAA provides a 2.7 percent pay raise for both military service members and the Department of Defense civilian workforce, as well as a full range of special and hazard pays for our service members.","date":"Wed Dec 08 15:14:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to vote YES on this year’s NDAA. Although it is not perfect, it keeps America fighting-strong while STOPPING radical leftist plans to weaken our national defense... 🧵","date":"Wed Dec 08 15:14:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Last night, House Dems blocked a bill that:\n\n-Bars illegal gang members from USA, deports them\n-Allows revocation of citizenship for certain naturalized individuals who are gang members\n-Bans criminal gangs from asylum or protected status\n\nWhy do they love gangs so much?","date":"Wed Dec 08 14:26:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"So glad I got the chance to commemorate my friend and hero, the late Dianne Hamilton, on the floor of the House of Representatives. \n\nHere's to you, Dianne! Thanks for everything you taught me. \nhttps://t.co/CZOamfCEiN","date":"Tue Dec 07 20:24:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"December 7th, 1941. \n\nNever forget. https://t.co/8Hp0Po1hXb","date":"Tue Dec 07 15:17:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thanks! Proud to stand with American farmers, American industry, and American energy. The first priority of any policy in Congress should be protecting our hard-won prosperity at home.","date":"Mon Dec 06 19:19:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Excited to meet Scott McLaughlin, Executive Director of Spaceport America in Las Cruces, NM. Spaceport America has some exciting projects, including Virgin Galactic pioneering commercial space flight travel, and SpinLaunch, which is revolutionizing kinetic space launch systems! https://t.co/HMGLj3Fut6","date":"Mon Dec 06 16:43:35 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Yet another reason why the Biden administration's suspension of ICE workplace raids is idiotic: migrant workers, especially illegal ones, are often exploited.  \n\nhttps://t.co/J7v0xxqIJz","date":"Mon Dec 06 15:50:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Bob Dole was a legend of the US Senate, a member of the Greatest Generation whose valor in WWII made him truly worthy of the name, and an American patriot. God bless the Dole family, and may he rest in peace.\n\nhttps://t.co/UX0pob5SVm","date":"Sun Dec 05 18:57:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The economy and jobs are a #1 issue for the vast majority of Americans, regardless of political party or geography. Unfortunately, the Biden administration doesn't have good news for them:","date":"Fri Dec 03 15:27:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My colleagues on the Left will say that GOP opposition to this CR threatens to shut down government. But they have willfully created a bill fully of unacceptable moral, legal, and budgetary problems. I will be happy to vote for a funding bill that is offered in good faith.","date":"Thu Dec 02 22:01:49 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"4) The CR includes $7 billion for Afghan evacuees brought to America. It's confirmed that 82,000 Afghans received no vetting at all--Biden administration lied. We cannot pour more taxpayer dollars into this possibly dangerous situation until the American people have transparency.","date":"Thu Dec 02 21:55:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"3) Funding in this CR could be used to support Biden’s dangerous open boarder immigration policies, pay for his efforts to fund abortions, support school policies that push Critical Race Theory, or subvert parents’ educational rights. I cannot support these things.","date":"Thu Dec 02 21:51:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"2) The bill FAILS to specify that funding cannot be used to enforce an unconstitutional vaccine mandate. I cannot in good conscience vote for funding that could go to forcing injections on American citizens.","date":"Thu Dec 02 21:51:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"1) This CR kicks the can down the road instead of forcing Congressional Democrats to face the consequences of prioritizing a reckless social spending agenda (\"Build Back Better\") over funding the government.","date":"Thu Dec 02 21:47:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm voting NO on the CR because my Democrat colleagues, rather than prioritizing funding for our government, have mixed in unacceptable measures or omitted necessary ones... 🧵","date":"Thu Dec 02 21:45:54 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@RepBlakeMoore Congratulations! Momma and baby look beautiful!","date":"Thu Dec 02 20:44:23 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico has suffered more violence under no-cash bail and other soft-on-crime policies. Extremist DA's and prosecutors don't care who gets hurt. Now, the Biden administration is trying to force this lawlessness on all 50 states:\nhttps://t.co/ExtL2o7tQR","date":"Thu Dec 02 20:32:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"GOOD. Remain in Mexico is back, after the Biden administration howled like a Pug getting its nails clipped at doing the bare minimum to protect our borders. Title 42 is still in place as well, although enforcement is lax. \n\nWe keep fighting. \n\nhttps://t.co/w1x3LKpv80","date":"Thu Dec 02 18:40:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Agree!","date":"Thu Dec 02 17:24:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"THRILLED to join the bipartisan \"Congressional FFA Caucus\" launched by @RepMann and @RepJimmyPanetta. I was a proud member of Future Farmers of America back in high school. Can't wait to work with caucus members to promote American agriculture and education. @NationalFFA https://t.co/DFcgrEs36D","date":"Thu Dec 02 17:00:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I have officially requested that Appropriations Committee Chairwoman @rosadelauro and Ranking Member @RepKayGranger allocate funds to complete a New Mexico border wall and other physical security, as well as upgrades for the Santa Teresa Port of Entry.\n\nhttps://t.co/7FJmvuEiol","date":"Wed Dec 01 20:23:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Over many generations, our nation has fought--often struggled--to defend every American's right to \"Life, Liberty, and the Pursuit of Happiness.\" \n\nOverturning Roe v. Wade is a crucial step to our national moral reckoning and full protection for unborn Americans.","date":"Wed Dec 01 18:14:16 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We already know that the IRS can't protect the privacy of thousands of Americans... yet this is the agency we're giving massive new spying powers? Insane. \n\nhttps://t.co/wCyCgGVC74","date":"Wed Dec 01 15:06:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great🧵from my colleague. Protecting the environment is important, but when you look at the costs, effects, and science behind extreme \"green\" policies, few of them are worthwhile, effective, or fact-based--and certainly not worth destroying our economy over.","date":"Tue Nov 30 18:10:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"As the Biden administration oversees the worst border crisis in US history, they are now hiding reports on illegal immigrant numbers from the American people to cover up their failure.   \n\nhttps://t.co/slQY71iQ3F","date":"Tue Nov 30 15:54:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Broadband mapping is one of the biggest hurdles to closing the digital divide. Some estimates show 33.5% of New Mexicans can't access broadband, while the FCC says it's only 16.7%. Accurate maps are a must--I urge the FCC to work hard to release them ASAP\nhttps://t.co/iOh36qwUpp","date":"Mon Nov 29 17:07:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"While Americans were eating Thanksgiving leftovers last Friday, the White House released their blueprint to destroy New Mexico jobs in #NM02. Governing by Friday news dump is not how our government should operate. \nhttps://t.co/e76kZpmhhR","date":"Mon Nov 29 16:49:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Pay attention when big media corporations take marching orders from China. If they'll censor jokes to keep a genocidal Communist regime happy, what else are they willing to manipulate, censor, and lie about to Americans? \nhttps://t.co/glbCRKHaVz","date":"Mon Nov 29 14:52:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Wishing a Happy Hanukkah to our Jewish friends and communities in New Mexico and across America. May God bless you and your families during this Festival of Lights!","date":"Mon Nov 29 14:19:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Today is Small Business Saturday! If you're doing any Christmas shopping this weekend, please remember to support our local New Mexico businesses and employers!","date":"Sat Nov 27 15:09:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/UOv2gVM0ad","date":"Thu Nov 25 15:00:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Another thing for New Mexicans to celebrate this Thanksgiving, between the turkey and the biscochitos: Dr. Fabián García, the \"father of New Mexico's food industry\" and creator of our the No. 9 chile, has been inducted into the Agriculture Hall of Fame!\nhttps://t.co/XgI4vbLPZg","date":"Tue Nov 23 22:22:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Good boys. \n\nThe Best Boys. \n\nhttps://t.co/pzgFvbgMCH","date":"Tue Nov 23 19:20:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New day, new Thanksgiving week tweets.\n\nGod bless the babies!\n\nhttps://t.co/0txU1PNSzh","date":"Tue Nov 23 17:00:02 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Another entry in our Thanksgiving series! (And thank you for your service, Mr. King!)\n\nhttps://t.co/8u5mdSxPmP","date":"Mon Nov 22 23:00:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Next up in our Thanksgiving series:\n\nSomeone raised this young man right!\n\nhttps://t.co/Fgl0GPv0Ed","date":"Mon Nov 22 19:00:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In honor of Thanksgiving week, I'm going to take a break from posting about politics and share some stories that give us all reason to laugh, celebrate, and be thankful. \n\nFirst up: Grandmas are the best medicine.\n\nhttps://t.co/4h2sJKFqae","date":"Mon Nov 22 17:00:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The BEST part of my job is calling young people to tell them they've earned my nomination to one of the United States service academies. These amazing New Mexicans are going to be the next generation of officers in the Army, Air Force, Navy, Marines, and Merchant Marine! https://t.co/EzTouEqK3L","date":"Fri Nov 19 20:36:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"It's not bad at all, really. Maybe it just needs a little love.\" https://t.co/j6ix9zyffD","date":"Fri Nov 19 17:29:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Build Back Broke will go down in history as more disastrous than \"Too Big to Fail\" bailouts, Obamacare, and the 2016 Ghostbusters movie combined.","date":"Fri Nov 19 15:07:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"100K deaths in a year. Fentanyl smuggled by Chinese and Mexican gangs is more than an illegal drug--it's mass poisoning. Proud to support @RepChipRoy's H.R.2600 to officially designate factions of the Gulf Cartel and Los Zetas as terrorist organizations.\n\nhttps://t.co/SjqAvbASWm","date":"Thu Nov 18 21:31:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Happy birthday!","date":"Thu Nov 18 18:03:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New caravan incoming. @VP Harris? @SecMayorkas? @POTUS? Are any of you doing anything? \n\nhttps://t.co/i7vufHGhVZ","date":"Thu Nov 18 15:05:06 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"😆\n\n😥","date":"Wed Nov 17 21:46:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Parents have a right to guide the education of their children, and to change the system when it is broken. https://t.co/KdKLZNPjK0","date":"Wed Nov 17 18:36:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"100,000 Americans dead. \n\nThe opioid epidemic has not gone away--it has only gotten worse. \n\nFentanyl from China and Mexico is causing the same amount of fatalities every year as a major war.  \n\nhttps://t.co/7Jhl5uap3G","date":"Wed Nov 17 15:40:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to join this resolution that recognizes the 1500 Iranians brutally killed by the authoritarian regime ruling their country. We honor the struggles of all who suffer under oppressive governments across the world. \n\nhttps://t.co/Frun0nx3W1","date":"Wed Nov 17 15:19:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Ben Skardon was the only survivor of the Bataan march to walk the eight miles of the annual Memorial Death March at White Sands Missile Range in 2006... at the age of 88! \n\nThe memory of Bataan carries on. Rest in peace. \n\nhttps://t.co/whcjaY8QGG","date":"Wed Nov 17 14:30:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Couldn't have said it (at all) myself!","date":"Tue Nov 16 20:39:18 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"From a 6th Grade teacher in Lea County:\n\n\"In 2020, oil and gas production on federal lands brought in $1.5 billion in revenue for the state of New Mexico; $734 million of that went to public schools and education.\"\n\nhttps://t.co/eSIFxAbFtQ","date":"Tue Nov 16 20:00:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congratulations to the great @CBP officers for intercepting this poison before it hit our communities!","date":"Tue Nov 16 18:09:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Share if you know any talented young New Mexicans who would like to get their start in Congress! https://t.co/FjMknmghrg","date":"Tue Nov 16 15:11:43 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@mikeroweworks came to Carlsbad, NM and filmed an episode of \"How America Works,\" featuring the hardworking folks at United Salt. It's going to rerun on Fox Business Thursday and Friday evening--check out our fascinating local industry! \n\nhttps://t.co/bLQoLMwnty","date":"Tue Nov 16 15:01:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In October, over 164k illegal immigrants were apprehended crossing the border, highest number for October in the history of @DHSgov. Thousands evade law enforcement. Joe Biden and Kamala Harris have abandoned our border. \n\nhttps://t.co/8d2WrUkfHZ","date":"Tue Nov 16 14:45:45 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"o The price for a Costco pumpkin pie is UP 17%\no The price for a 3lb bag of Russet potatoes is UP 13%\no The price for a 2lb bag of carrots is UP 47%.\no Apples are UP 6.7%\no The price for cranberries is UP 5.2%\no The price for biscuits is UP 4.8%\nhttps://t.co/EQ5OkrAofF","date":"Mon Nov 15 18:29:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Some good news for Southern New Mexico!\n\nhttps://t.co/oOAytdfA63","date":"Mon Nov 15 18:06:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"😆😆😆","date":"Mon Nov 15 15:22:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to introduce three pieces of legislation to commemorate Veterans Day: honoring the sacrifices of military spouses, speeding up the process for veterans' service dogs from the VA, and memorializing the Bataan Death March. Read more--&gt;\n\nhttps://t.co/HRMvE694fl","date":"Thu Nov 11 21:03:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A proud day for our Veterans Representative, Gunnery Sgt. Rick Pineda (Ret), whose son Ricardo just became a Private in the USMC, and whose daughter Crystal Marie serves in the US Navy! Selfless service is a family tradition in New Mexico! https://t.co/4bwl2RsTNE","date":"Thu Nov 11 14:22:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Today we salute the amazing men and women who have defended our country and continue to inspire all Americans! https://t.co/BnhuYOKt3m","date":"Thu Nov 11 14:12:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to introduce the Veterans Affairs Canine Reporting Act of 2021, which would speed up the process for America's veterans who need service dogs from the VA. Service dogs have proven to be a vital tool in promoting mental health and physical assistance to veterans! https://t.co/6lb3oN20F2","date":"Wed Nov 10 20:44:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Saddened that my dear friend, colleague, and great New Mexican Dianne Hamilton has passed away. She served her fellow citizens in the NM House of Representatives, and she raised up an amazing family. Please join me in praying for them and celebrating Dianne's wonderful life! https://t.co/C5UvcJkaQw","date":"Wed Nov 10 19:29:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This administration is run by extremist ideologues who don't mind publicly admitting that they want to destroy entire industries and leave entire towns unemployed.","date":"Wed Nov 10 16:36:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This bipartisan effort is co-sponsored by my fellow NM Representative, @RepTeresaLF, and is supported by local chapters of the Veterans of Foreign Wars (VFW), Disabled American Veterans, and the Las Cruces Veterans Advisory Board.","date":"Tue Nov 09 19:46:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to introduce legislation to rename the @DeptVetAffairs clinic in Las Cruces, NM the “Las Cruces Bataan Memorial Clinic” in honor of the brave New Mexican servicemen who heroically resisted the Japanese Army and were forced to march over 60 miles on the Bataan Peninsula","date":"Tue Nov 09 19:45:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Of these men, 829 were killed in battle, a POW camp, or later died as a result of their mistreatment. Today, we have the opportunity to honor their sacrifice and enshrine their memory forever.","date":"Tue Nov 09 19:44:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The brutal legacy of the Bataan Death March is only matched by the unbowed spirit of New Mexico's servicemen. Of the 75k Allied troops stationed on the Bataan Peninsula, 1,816 were from New Mexico, by far the most per capita of any state. https://t.co/n9aOCg2klf","date":"Tue Nov 09 19:43:58 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I received a lovely letter from Amb. Alfonso Quiñónez of Guatemala, who shares my conviction that governments should protect families &amp; treasure every human life, no matter how small. Guatemala recently joined the Geneva Consensus Declaration, as I hope the USA will rejoin soon! https://t.co/WMPgOknxGK","date":"Tue Nov 09 17:08:38 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to lead Members of Congress of both parties with a Resolution to honor the spouses of past and present members of the Armed Forces for their sacrifices and home-front service to America.\n\nhttps://t.co/RUgFn3jLKT","date":"Mon Nov 08 22:39:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Leftist Infrastructure bill was MORE concerned with policy unicorns, but I'll continue voting for bills that actually HELP the families of New Mexico!","date":"Mon Nov 08 21:35:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Big salute for the Military &amp; Veterans Appreciation Week at @nmsu, where fallen alumni service-members were honored. Vet. Rep. Gabriel Barcenas was happy to meet Brig. General &amp; Physical Science Laboratory Dir. Eric Sanchez and Military &amp; Veterans Program Dir. Hector Sanchez. https://t.co/peWPbGKPfc","date":"Mon Nov 08 19:56:47 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Ending cash bail has hurt innocent Americans in New Mexico and cities across the country. We can't allow the Biden administration to force more states to coddle criminals and victimize law-abiding citizens. Read my op-ed in the Albuquerque Journal---&gt;\n\nhttps://t.co/ExtL2o7tQR","date":"Mon Nov 08 15:40:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Team Yvette representing at the Heroes 5k Run in Roswell! God bless our Veterans and all those who keep our communities safe! https://t.co/JP4qSvn5le","date":"Sun Nov 07 20:24:54 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Instead of paving the road to a brighter future for our country, the Democrats' massive spending bill heaps crippling debt on future generations of Americans.\n\nWe can and MUST do better!","date":"Sat Nov 06 05:01:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is just embarrassing for Nancy Pelosi. 😆\n\nhttps://t.co/ols6waafJQ","date":"Fri Nov 05 18:17:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"FIRST Biden admin announces $450k payments to reward illegal immigrants. \n\nTHEN Joe Biden calls the idea \"garbage.\"\n\nNOW the WH corrects Biden, says payments will be happening. \n\nIs anyone at home? Does Joe Biden know what's going on in his own office?\n\nhttps://t.co/6qfN7cPsbQ","date":"Fri Nov 05 14:29:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm proud to be among them. The men and women of law enforcement can't handcuff criminals if they're being handcuffed by Washington!","date":"Thu Nov 04 21:32:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is horrifying.\n\nAnd this happens regularly. \n\nThank God she was alive.","date":"Thu Nov 04 19:38:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"From New Mexico to Pennsylvania, the men and women who power the USA work hard every day to fuel our cars, heat our homes, and light up our communities. It was a pleasure to get together and explore ways we can champion American energy and American workers!","date":"Thu Nov 04 19:24:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A 24 year old illegal immigrant posed as a minor (are government officials BLIND?) and stabbed to death the father of his host family in America. \n\nThis is what happens when our leaders have given up protecting Americans.\n\nhttps://t.co/OePyncHntU","date":"Thu Nov 04 14:38:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"You bet we did. Amnesty, encouraging illegal immigration, and turning a blind eye to Chinese/Mexican fentanyl smuggling doesn't build back ANYTHING better.  \nhttps://t.co/YP9YTtvohM","date":"Wed Nov 03 20:33:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is National Veterans Small Business Week! There are 351,000 veteran-owned businesses in America, with 9 million veterans part of our great workforce. If you're a veteran thinking about starting a business, be sure to check out this list of resources! https://t.co/Vmr8sV3rnE","date":"Wed Nov 03 20:04:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Really cool!\n\n\"Researchers at Kennedy spent 2 years evaluating more than 2 dozen pepper varieties from around the world.\" They came up with \"a hybrid developed by NMSU that combines the ‘Hatch Sandia’ &amp; the traditional ‘Española’ pepper of northern NM.\"\nhttps://t.co/Mlbl7PehNT","date":"Wed Nov 03 14:36:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We always knew that New Mexico's green chile was the best on Earth--now it's the best in space too! 😆","date":"Wed Nov 03 14:30:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Education is the cornerstone to any prosperous society. I believe parents are stakeholders in their children's education and should be listened to, not sidelined by radical ideologies and politicians who are scared of free thinking Americans. #ParentsWin https://t.co/iltJ4Moq7q","date":"Wed Nov 03 13:35:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Today I joined @SteveScalise &amp; @RepStefanik in calling out Biden's reckless proposal of sending $450,000 to illegal immigrants. Instead of securing the border, finishing the wall, and protecting Americans, this administration wants to give away your hard earned tax dollars. https://t.co/cOO4ha8Bl3","date":"Tue Nov 02 16:36:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"As crime continues to impact our communities and families, now is the time to stand with law enforcement and give them the tools they need to keep New Mexicans safe. #backtheblue https://t.co/7opKPGd8qE","date":"Mon Nov 01 17:05:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden admin is FORBIDDING the Fish and Wildlife Service from considering the economic impact of its rulings, no matter how many livelihoods and communities they hurt. That's why my @NatResources colleagues and I are taking action. Read more--&gt;\n\nhttps://t.co/hcQTUI4w18","date":"Wed Oct 27 15:13:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This administration's policy of \"act first, think later\" has already hurt Americans on our soil, and they show no signs of remorse.","date":"Wed Oct 27 13:11:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I joined @IngrahamAngle to discuss the latest alleged assault on American soil by an Afghan national, this time in Montana. \nThis isn't going to stop until our leaders take the security of our country and the safety of our communities seriously. \nhttps://t.co/gNRNE77WHD","date":"Tue Oct 26 20:56:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to join @RepGaramendi and @RepDustyJohnson in this bipartisan legislation that would help correct our trade imbalance with China. We are not going to tolerate unfair trade practices any more.  \n\nhttps://t.co/2OZlOByuXw","date":"Tue Oct 26 13:31:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Democrat $5 TRILLION tax-and-spend bill... \n\n- Imposes $2.1 trillion in tax increases \n\n-Allows wealthy families earning $800k to receive over $100k in tax credits\n\n-Hires 85k new IRS agents to spy on American families\n \n-Gives amnesty to 8 million illegal immigrants https://t.co/5em0qvH0oV","date":"Mon Oct 25 19:50:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to join my colleagues in pushing for New Mexico's rural communities to have better access to reliable broadband internet. Read our letter to the FCC here: https://t.co/XPUirNH1pJ","date":"Mon Oct 25 18:36:34 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"There have been 1.7 million encounters on our Southern border in the last fiscal year, the largest number on record. \n\nThe Biden Administration has broken our borders, and they don't care. \n\nhttps://t.co/yx683tlX4l","date":"Mon Oct 25 16:24:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Parents ABSOLUTELY have a right to guide their kids' education. Don't trust anyone who says they have better authority to teach your kids than you.","date":"Mon Oct 25 14:40:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is why I have demanded equal health and safety standards for produce from Mexico and other foreign countries. Better yet, let's try to buy as much of our fresh produce and other products from within New Mexico and the rest of the USA.\n\nhttps://t.co/J2JIw8rUQu","date":"Fri Oct 22 19:27:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This horrific attack in Montana is just the latest in a outrageous series of assaults by Afghan nationals on American soil that underscore the importance of proper vetting for anyone we bring to our nation. My prayers are with the young lady and her family.","date":"Thu Oct 21 21:02:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@SenMarkey Is this you, Senator?\n\nhttps://t.co/shbPm7Pm1d","date":"Thu Oct 21 19:33:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I will always stand for babies and their mothers!","date":"Thu Oct 21 19:28:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"THANK YOU to the brave men and women of the Border Patrol for protecting our families, our communities, and our nation! Cowardly politicians and their media friends spread lies, but the American people are grateful for your hard work! @CBP @BPUnion https://t.co/RAuCbJLKn8","date":"Thu Oct 21 19:23:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"How can we sustain the Biden Border Crisis? We can’t! That is why I have introduced legislation to enforce our laws and secure our Southern border. Share if you agree it’s time to end the #BidenBorderCrisis! https://t.co/9986gGP5uW","date":"Thu Oct 21 16:25:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A government that enables crimes like this against its own citizens is no government at all.","date":"Wed Oct 20 18:38:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Democrats still want to spy on our bank accounts, they've just changed the $$$ amount for bank accounts they'll take a peek at. \n\nAnd it's still unconstitutional. https://t.co/nwksdgATVf","date":"Wed Oct 20 17:25:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"Build Back Better\" means making gas, groceries, and cars more expensive for American families. https://t.co/A473EA7d1y","date":"Wed Oct 20 13:42:58 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Glad to meet with officials from the Panamanian Embassy to discuss solutions to the Biden Border Crisis. We must work with our neighbors in Central and South America to halt these massive caravans headed toward our borders. @Embpanamausa https://t.co/NXMxTWfRcN","date":"Tue Oct 19 20:50:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Liberals have given up trying to cover for Joe Biden's failure, and are telling Americans to just be happy with a broken economy. \n\nLet's see how that works out for them.","date":"Tue Oct 19 17:33:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The $5 trillion Democrat tax-and-spend package includes 3.5 billion to create a Green New Deal \"Youth Patrol,\" which uses our tax dollars to pay jobless climate activists to be obnoxious full-time. \n\nCan you think of a few better things to spend our money on?","date":"Tue Oct 19 14:13:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We cannot endlessly delay and let spies off the hook. Proud to stand with my colleagues in Congress to ensure timely prosecution of those who try to hurt our country.","date":"Tue Oct 19 13:58:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My new friend, Ambassador Alfonso Quiñónez of Guatemala, is spreading the word that his nation protects families, women, and children. As President Alejandro Giammattei said: \"Every person has the right to live, from conception until their natural death.\"\n\nhttps://t.co/h22FGVL2K1","date":"Fri Oct 15 15:05:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We stand for the courageous men and women of law enforcement during National Police Week! https://t.co/CkF8JHrg1f","date":"Thu Oct 14 16:59:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I joined @stinchfield1776 to discuss the terrible situation facing New Mexico border towns because of Joe Biden's inaction. Leaked reports indicate that the government is dropping off thousands of illegals in our communities.\nhttps://t.co/8E8pVtiemL","date":"Thu Oct 14 16:37:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Inflation has risen every month of Joe Biden's presidency. The price of gas has risen over 42 percent. The price of food, tools, home goods, and a variety of products has gone up.\n\nThe numbers don't lie. Americans are worse off than they were one year ago.","date":"Wed Oct 13 15:28:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Gee, thanks Joe!","date":"Tue Oct 12 19:04:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Woke bathroom/locker rules are leading to girls being sexually assaulted--and yet Merrick Garland wants to treat angry families like domestic terrorists, while parents are told they they're not qualified to make educational decisions. Absolute insanity.","date":"Tue Oct 12 19:02:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"No arrests, no charges, and the Biden administration is BANNING journalists from the scene of an assault on a US soldier at Fort Bliss! Check out my exclusive report with @IngrahamAngle--&gt; \n\nhttps://t.co/s0wvYcN4WZ","date":"Fri Oct 08 16:41:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A fancy way to describe a minority in both houses of Congress.","date":"Thu Oct 07 16:52:12 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/pmmOOxJyry","date":"Thu Oct 07 15:18:16 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The men and women of the Border Patrol deserve our gratitude, not condemnation by Joe Biden and left-wing media. RT if you agree!\n\nhttps://t.co/mNCBSmhQ4B","date":"Wed Oct 06 21:19:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Ranking Member @RepJamesComer joined me in requesting that the Department of Homeland Security's Inspector General investigate irregularities and problems with vetting Afghan nationals. @DHSgov @DHSOIG\n\nhttps://t.co/RMuVb4YsHI","date":"Wed Oct 06 21:13:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I’m glad that Chairman James Comer joined me in requesting that the Office of Inspector General at DHS investigate troubling issues in the Afghan evacuee vetting process. \n\nMore info coming...","date":"Wed Oct 06 20:11:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I will be touring Fort Bliss tomorrow to seek answers regarding the assault of a female soldier by a group of Afghan men on base--as of my latest briefing, no attackers have been arrested, charged, or had their immigration parole status revoked.","date":"Tue Oct 05 18:25:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden Admin wants to bring back the disastrous Obama-era \"Waters of the United States\" rule, where the feds went after Americans who had tiny ponds or streams in their yards. We can't allow the EPA to run roughshod over local conservationists and private property. https://t.co/eOezJZwySY","date":"Tue Oct 05 17:21:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Take a look at this great report from KOB4--it's clear that we need the National Guard to assist in handling the Biden Border Crisis. \n\nhttps://t.co/RbHbercMRZ","date":"Mon Oct 04 19:40:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"God bless @FLCaseyDeSantis!!! Prayers for her health and well-being.","date":"Mon Oct 04 17:08:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Hey, if @SenSanders thinks House and Senate minorities should always win against the majority party, who are we to complain?","date":"Fri Oct 01 19:12:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration gleefully cripples its own ability to secure our borders, while new reports say that tens of thousands of additional Haitian migrant caravans are headed here. \n\nIf you were TRYING to hurt America, what would you do differently? \nhttps://t.co/ChUfBaCVsi","date":"Fri Oct 01 18:13:48 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Many thanks to Dr. Skop for testifying for @GOPoversight about the tragedy of abortion and the need to truly care for mothers and their children.    \nhttps://t.co/4mRwjHViRW","date":"Fri Oct 01 14:54:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We cannot hide behind clinical euphemisms to ignore the truth: abortion takes the life of a child, often in the most inhumane and brutal ways. \nhttps://t.co/f09Kny3WD7","date":"Fri Oct 01 13:00:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Moving the BLM headquarters back to Washington is yet another example of how disconnected and out of touch the Biden Administration is with my constituents in rural New Mexico.\n\nhttps://t.co/eCvELXht6s","date":"Thu Sep 30 17:53:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Incredible. With a crisis on our Southern Border, unanswered questions about Afghanistan chaos, spikes in violent crime... Oversight Committee Democrats have found the REAL villains--Border Patrol agents doing their jobs. https://t.co/cckbXRf2qO","date":"Thu Sep 30 17:32:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"He wouldn't qualify for the Fat Bear competition--looks a bit too buff--but New Mexico-born Smokey Bear is always my favorite! https://t.co/Gd9S74wzIX","date":"Wed Sep 29 20:35:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I urge my colleagues in the Senate to oppose the nomination of Tracy Stone-Manning to lead the Bureau of Land Management. Our farmers, ranchers, loggers, hunters, and energy producers deserve a nominee who cares about them--not a wannabe eco-saboteur. \n\nhttps://t.co/WLSyBOKTwp","date":"Wed Sep 29 16:50:49 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Wow--let's take a break from politics for a moment to watch this heroic officer in action. It's like a scene from a movie. Good job, Officer Garcia!","date":"Wed Sep 29 14:16:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Democrat budget:\n\n$4.3 TRILLION in new spending \n\n$2.1 TRILLION in new taxes on American families and job creators, the largest tax increase in American history.\n\nFewer jobs, lower wages, more expensive products.","date":"Tue Sep 28 16:43:14 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Last night on @IngrahamAngle: A female soldier has been attacked by a group of Afghan men on Fort Bliss, and government officials confirmed that nobody has been arrested, nobody has been charged, and nobody has had their ICE parole revoked. Disgraceful.\n\nhttps://t.co/V1bH7xRZzj","date":"Tue Sep 28 14:32:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I was thrilled to join the great folks at the Independent Women's Forum for their podcast--give them a listen!\n\nRep. Yvette Herrell on What She Saw At An Afghan Refugee Camp via @IWF https://t.co/Dw7cHuE5LR","date":"Mon Sep 27 17:54:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Coastal city-dwelling leftists are perfectly fine encouraging violence and terrorism, as long as it's against those yucky people and industries in flyover country--you know, the ones that power the country.","date":"Mon Sep 27 17:20:16 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thousands of Haitians have been released into the United States, with nothing more than a promise to present themselves at an immigration hearing months from now. \n\nHow many do you think will show up?\n\nhttps://t.co/2fsUJ6zMbU","date":"Mon Sep 27 16:59:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'll be on @FoxNews Live at 12PM MT/2PM ET today to discuss the disastrous Biden Border Crisis. Tune in!","date":"Sat Sep 25 16:00:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My prayers are with the courageous soldier and her family. This is yet another tragic failure in the vetting process for Afghan nationals. The American people deserve answers.\nhttps://t.co/UB8ehTjCwO","date":"Fri Sep 24 20:22:49 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I voted NO on Nancy Pelosi's extreme abortion bill, which would allow babies to be killed up until the day they are born! https://t.co/wvyWroOraV","date":"Fri Sep 24 18:54:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"Those people will pay\" -Joe Biden\n\nPresident Biden is threatening federal agents he is in charge of, for enforcing laws he is also supposed to be enforcing. Disgusting. \n\nhttps://t.co/JmCeHk0XjH","date":"Fri Sep 24 16:27:17 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Glad to meet with Guatemala's Ambassador to the USA, Alfonso Quiñónez, to discuss crisis on our southern border. He is more invested in helping us solve the problem than Joe Biden! https://t.co/B0kKyxlppE","date":"Fri Sep 24 16:17:31 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Some New Mexican's great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great-great grandma or grandpa made their mark!\n\nhttps://t.co/ZTMOXvcHoY","date":"Fri Sep 24 14:24:03 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Earlier this week I discussed the Biden Border Crisis with @DanNewsManBall--check it out! \n\nhttps://t.co/QCus5XrlN2","date":"Fri Sep 24 13:32:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Not only does eliminating reliable energy sources raise costs, but foreign producers like Russia step in to fill the gap with energy from sources that are much worse for the environment.","date":"Thu Sep 23 20:00:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"THIS is why we need a stronger vetting process, not just to protect American citizens, but Afghans themselves. Heartbreaking. \n\nhttps://t.co/WR49F3lgMF","date":"Thu Sep 23 17:44:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Strange that the President of South Korea is more interested in honoring our fallen service members than anyone in the Biden administration.   \n\nhttps://t.co/nHO3Ffdtso","date":"Thu Sep 23 14:10:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thrilled to meet @MarioMocciaNMSU, Director of Athletics for New Mexico State University @NMSU! Go Aggies! https://t.co/kCB4Co2crD","date":"Wed Sep 22 17:10:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"God bless the men and women of @ICEgov &amp; @CBP!  These unacceptable attacks on Border Patrol Agents, ICE Officers, &amp; other American workers are attacks on American sovereignty. Haiti must ensure safety of our personnel in their territory, like the flight crew in Port-au-Prince. https://t.co/wd8MITJOhu","date":"Wed Sep 22 15:46:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe Biden is ignoring the crisis he created, but I just met with Haitian Ambassador @BocchitEdmond to address the humanitarian disaster on our border and discuss how we can safely resolve the situation in a way that secures America while treating illegal immigrants humanely.","date":"Tue Sep 21 21:53:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Reminder for New Mexico taxpayers: tomorrow is Taxpayer Advocate Service Problem Solving Day. Take advantage of this free service to help resolve tax issues and questions. https://t.co/zMJi3IwWS0","date":"Tue Sep 21 18:29:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to meet with wonderful folks representing @SkillsUSA from Deming, New Mexico, who are doing amazing work helping High School Students prepare for careers after graduation. Keep up the good work! @SkillsUSANM https://t.co/1m0SKb1S2N","date":"Tue Sep 21 14:52:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"DHS @SecMayorkas says that we don't have open borders.\n\nHe must be talking about our border with Canada, because this one sure looks open:","date":"Mon Sep 20 19:29:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It's certainly easier to march Uyghurs into internment camps, torture dissidents, and ban free speech when you've disarmed the population.","date":"Mon Sep 20 16:42:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Good. Drastic changes to our immigration system should be debated on their own, in the open, not hidden from the American people in a multi-trillion dollar grab-bag bill.","date":"Mon Sep 20 14:15:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The $3.5 trillion Democrat budget bill includes new taxes and fees designed to drive New Mexico's energy producers out of the state, taking good paying jobs with them. Read more in my op-ed:\nhttps://t.co/BLGv7YmiX2","date":"Sat Sep 18 16:24:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Under President Biden, our borders aren't just weak, they are disappearing.","date":"Sat Sep 18 16:15:38 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We cannot allow one unelected judge to further weaken our border &amp; endanger Americans to new outbreaks of COVID. If the Biden Admin cares about families in border states, they should appeal this order and resume the successful Remain in Mexico Policy.\n\nhttps://t.co/f0dmtt3MEh","date":"Fri Sep 17 14:45:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"234 years ago the US Constitution was ratified, setting in place the greatest legal protections for citizens the world had ever known. Today, it is more important than ever to know your rights, and proclaim them loudly. Happy Constitution Day!  \n\nhttps://t.co/LdTYnpj7Uy","date":"Fri Sep 17 14:21:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden Border Crisis continues to spiral out of control.","date":"Thu Sep 16 14:19:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We lose 22 veterans a day to suicide. Service dogs are proven to assist with PTSD symptoms, but our courageous veterans are forced to wait up to 18 months for a canine companion. I have requested that @DeptVetAffairs Sec. McDonough expedite the service dog approval process. https://t.co/qmCiXGWRFq","date":"Thu Sep 16 13:45:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If a general vows to give advance warning to our enemies, he is no longer working for the United States.","date":"Tue Sep 14 17:26:47 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Americans deserve transparency in the vetting process for refugees. My visit to Holloman AFB revealed a dangerously vague system. Read my full account: \nhttps://t.co/44aIOv7AwG","date":"Tue Sep 14 15:12:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This has happened many times now. Who at the White House is forbidding President Biden from answering questions? Love him or hate him, President Trump would answer hostile questions for an hour straight. Why can't Biden? \n\nhttps://t.co/kwp7sbrLd9","date":"Tue Sep 14 14:46:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Glad to see my colleagues on the Democrat side speaking out. Our budget should not destroy good paying jobs and sacrifice American energy independence just to satisfy Nancy Pelosi's radical base.  \nhttps://t.co/XXgbvcKhk0","date":"Tue Sep 14 14:36:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"When your proposed tax rate is higher than Communist China's, you should go back to the drawing board. \n\nhttps://t.co/Ts2DvMFZlm","date":"Mon Sep 13 19:04:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"\"This group, which appeared to be at least seven to nine individuals, is camouflaged from head to toe and are wearing carpet booties over their shoes.  This is what is crossing into our state and making it further into the nation.\" -NM rancher, 15 miles north of Mexico border https://t.co/rKJcXve5XE","date":"Mon Sep 13 18:13:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please see upcoming mobile office hours for the Second District. Issues? Questions? Something we can help with? Give us a call. https://t.co/tXnvIfCQXg","date":"Mon Sep 13 17:51:40 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Of course, @JoeNBC is completely wrong. Abortion is not \"enumerated\" in the Constitution, specifically or otherwise, &amp; its invention as a right in Roe v. Wade rests on garbage legal reasoning. America will be a better place when abortion joins eugenics on the ash heap of history.","date":"Mon Sep 13 15:57:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I commend all the first responders, volunteers, and countless Americans from all backgrounds who helped us to heal in the wake of this great tragedy, and continue to pray for all families who lost their loved ones. \n\nMay God bless America.","date":"Sat Sep 11 13:46:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Following the attacks, 42 of New Mexico’s finest traveled across the country to assist in search and rescue operations; our country will forever be grateful for all first responders who served their fellow Americans. 5/x","date":"Sat Sep 11 13:45:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This community-sponsored Memorial Monument in the Village of Williamsburg was created by hardworking and dedicated New Mexicans to pay solemn tribute to those we lost on 9/11, and the heroes who rose amid the flames. 4/x","date":"Sat Sep 11 13:45:02 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Regardless of political party, race, or creed, the 9/11 attacks on our nation remind us of the unifying values that can bring Americans together on the darkest of days. Today, I want to especially commend the work of the those responsible for the 9/11 Memorial Monument in NM. 3/x","date":"Sat Sep 11 13:44:23 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Heroic first responders ran towards danger, risking their own lives to rescue victims; their selfless fortitude will always be remembered. The brave passengers of Flight 93 prevented further tragedy by overwhelming terrorist hijackers; their courage saved countless lives. 2/x","date":"Sat Sep 11 13:43:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"20 years ago today, 19 al Qaeda terrorists hijacked four aircraft and claimed the lives of 2,974 people, shocking our nation and the entire world.\nThe devastation and destruction was heartbreaking, but swiftly overcome by American resilience following the attacks. 1/x","date":"Sat Sep 11 13:41:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Joe Biden's vaccine mandate is unconstitutional and unscientific. He has no authority to make such decrees, as his administration admitted only months ago. It is a disgrace to his oath of office, and is more worthy of impeachment than anything done by his predecessor.","date":"Fri Sep 10 15:58:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to be joined by @RepJimBanks and so many of my House colleagues demanding transparency and accountability in the vetting process for Afghan nationals. Read our letter to @POTUS to see how criminals and abusers have already made it to our shores: https://t.co/PEjjKUVV4x","date":"Thu Sep 09 15:03:49 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"There are still more questions than answers--and the answers I got at Holloman aren't very reassuring. I'll be discussing my concerns on Fox Primetime tonight at 7ET/5MT.","date":"Wed Sep 08 20:35:49 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'll be appearing on @FoxNews Primetime at 7PM ET/5PM MT to discuss what I saw touring the Afghan evacuee camp at Holloman AFB, as well as my new letter to @POTUS joined by @RepJimBanks and 40 US Representatives demanding transparency in the vetting/resettlement process. Tune in!","date":"Wed Sep 08 20:26:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"While I was glad to review conditions on Holloman AFB, senior DHS and State officials were dismissive &amp; hostile on vital questions of vetting, security, and the identities Afghan nationals on base. I will be publishing my full account shortly. https://t.co/vnCK2oHBwb","date":"Wed Sep 08 18:06:58 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/jiDaXIyOBG","date":"Wed Sep 08 15:47:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration has a track record of releasing dangerous criminals into our communities. New Mexicans see it on our southern border every day, which is why questions about the vetting process for Afghan nationals are so important.","date":"Tue Sep 07 16:34:16 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I will be visiting Holloman AFB on Tuesday to review living conditions for refugees as well as their vetting process and plans for their future. I will report on the situation as soon as possible. The people of New Mexico deserve transparency. \nhttps://t.co/ZfWlWKepdu","date":"Mon Sep 06 18:42:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Today we celebrate the workers who have built America. Every policy we craft in Congress must first serve the men and women who strengthen our country through their labor, preserving their communities and defending their families. Happy Labor Day!","date":"Mon Sep 06 15:36:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congressional oversight is needed NOW. We cannot bring rapists and human traffickers into this country and allow them to be resettled alongside the people they have abused. \n\nhttps://t.co/BrDeDPzYY8","date":"Fri Sep 03 19:13:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I have introduced amendments to the budget bill that would suspend the gas tax on American families until the federal public health emergency order related to COVID-19 expires, as well as preserve funding for public education and first responders.\n\nhttps://t.co/qGFxqdpipT","date":"Fri Sep 03 15:25:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Correct. That would be a disaster!","date":"Thu Sep 02 19:04:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Disgraceful. \n\nhttps://t.co/mZG38tVLT2","date":"Thu Sep 02 15:05:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Interested in becoming an officer in the Marines, Army, Air Force, Space Force, Coast Guard, or Merchant Marine? On Sept. 9, the New Mexico Congressional delegation is hosting a virtual information event for our great service academies. Register here: https://t.co/kYVbMshL8p https://t.co/q3yaLVUEVB","date":"Wed Sep 01 19:39:21 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Don't mess with babies in Texas!","date":"Wed Sep 01 18:02:27 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to co-sponsor the Teleabortion Prevention Act. It is a single but necessary step toward building a society that values every human life, no matter how small.","date":"Wed Sep 01 17:57:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Despite clear studies (https://t.co/Z7Uz8ikZY8) showing possible applications of Ivermectin in helping against COVID, Joe Biden's party would rather politicize medicine. \n\nDon't take horse dewormer. Do encourage research/tests with Ivermectin by doctors. It's that simple.","date":"Tue Aug 31 16:24:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to join @RepLisaMcClain to cosponsor a bipartisan bill awarding Congressional Gold Medals to our 13 fallen heroes. Their sacrifice and the loss borne by their families will live forever in the thankful hearts of all Americans.\nhttps://t.co/QGD98n30Or","date":"Tue Aug 31 16:02:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The people of New Mexico deserve to have a say in this process, to know how vetting is being conducted, and to know the results of that vetting. \n\nhttps://t.co/5NX0ZuDiT5","date":"Tue Aug 31 15:49:43 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@thepaperabq peddling outrageous lies, bad science. Studies (https://t.co/Z7Uz8ikZY8) show Ivermectin useful under right conditions. Pretending I am pushing horse-dewormer, rather than exploring a medicine with possible human applications, is disgusting. https://t.co/jMqcNzpQwg","date":"Tue Aug 31 15:40:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@POTUS chaotic withdrawal from Afghanistan leaves countless bodies and unknown number of Americans behind Taliban lines. But the incompetence of Biden/Brass can't erase 2 decades of selfless service by our armed forces. Honor their sacrifice by rescuing every American we can.","date":"Mon Aug 30 22:04:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico's Second District is on track to host more Afghan refugees than any other congressional district in the nation. We need transparency on vetting, numbers, and resettlement plans. \n\nhttps://t.co/Lf5N63Hd2i","date":"Mon Aug 30 17:06:43 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@SecBlinken relaxing in the Hamptons while Kabul fell. \nhttps://t.co/1MHMWV8Ita","date":"Mon Aug 30 15:07:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Chaves County Board of Commissioners passed a resolution to support my PAUSE Act, which would defend our borders and preserve health protections against new COVID cases entering the country. Thank you Chaves County!","date":"Mon Aug 30 14:23:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A disgraceful dereliction of duty by President Biden and senior brass. @SecBlinken, @SecDef, and Gen. Milley @thejointstaff should resign and hand the reins to leaders who actually want to protect Americans and the brave men and women who serve in our military.","date":"Mon Aug 30 01:25:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please join me in praying for our servicemen and women in Kabul, as well as all Americans behind Taliban lines.","date":"Thu Aug 26 15:07:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"What else do you expect from this \"America Last\" administration?\n\nhttps://t.co/2pVBxwnnZ1","date":"Wed Aug 25 18:54:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"RT if you agree: Border Security is actually infrastructure--not the grab bag of Nancy Pelosi's leftist wish list! https://t.co/zVv5cbvUBK","date":"Tue Aug 24 15:25:48 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"RT if you agree: the infrastructure bill MUST prioritize jobs and energy independence! https://t.co/LZ2fXjhi5d","date":"Tue Aug 24 15:20:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We should focus on getting every American out of Afghanistan. @GovMLG, not content with throwing our border open to illegal immigration and criminal cartels, asked @POTUS to fly thousands of foreign nationals into NM w/o consent or consultation of our families and communities. https://t.co/bK2bKHlhrg","date":"Mon Aug 23 19:10:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Under @GovMLG's mandate, low-risk children &amp; otherwise healthy families are banned from the NM State Fair. I've joined legislature leaders @BacaForSenateNM, @LeaderTownsend, &amp; NM Cattle Growers @nmcga asking that COVID-negative people be allowed to attend our great state fair. https://t.co/HjAAPpI4U2","date":"Fri Aug 20 15:40:06 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you @glennbeck for your amazing efforts to rescue Christians in danger of persecution from Afghanistan!\nhttps://t.co/rxbQaunqzg","date":"Fri Aug 20 13:59:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It is sad and troubling that this administration did not do more to help the families of those who sacrificed to help us. Please watch this brave man talk about his experiences:\n\nhttps://t.co/OqiilJF6XN","date":"Thu Aug 19 19:15:48 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I encourage anyone in NM-2 who is having issues with the IRS to participate in the virtual Taxpayer Advocate Service Problem Day on September 22. Call in! https://t.co/qFRRD4SLO2","date":"Thu Aug 19 17:24:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please join me in praying for these officers and their families.","date":"Thu Aug 19 16:09:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"There are NINE intelligence elements inside the DoD--this isn't counting the CIA--and our leaders don't even know how many Americans they have stranded in Afghanistan? The incompetence is mind boggling.","date":"Thu Aug 19 16:07:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to join my colleagues on the Oversight Committee to demand answers on the disastrous situation in Afghanistan. The American people deserve to know why their leadership failed them so badly.","date":"Thu Aug 19 15:22:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Based on the disastrous situation in Afghanistan, the continuing crisis on our Southern Border, and a blind campaign against America's energy producers, one has to wonder if anyone is home at the White House.","date":"Thu Aug 19 02:37:14 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"On the 100th anniversary of the #19thAmendment, let us celebrate our grandmothers and great-grandmothers who fought for representation, and remember the women of the Western states and territories who forged a path of equality and independence! https://t.co/5dwkxOiUYj","date":"Wed Aug 18 16:38:54 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is completely unacceptable.","date":"Tue Aug 17 17:42:34 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"After 20 years, it was long past time to leave Afghanistan. But it did not have to be this disaster. The Biden admin. presides over a complete tactical failure and international embarrassment, as well as a tragedy for families who will suffer under a new Taliban regime.","date":"Mon Aug 16 14:18:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was great visiting with folks at the Glenwood Trading post and Alma Grill in Catron County! Inspiring patriots and good friends. https://t.co/w7B4pWLoyV","date":"Sat Aug 14 16:24:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"There is a humanitarian crisis on our Southern Border, and the Biden Administration has bent over backwards to make it worse. \n\nhttps://t.co/W6JQU3qlho","date":"Wed Aug 11 20:53:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/NKUeqUnMaj","date":"Wed Aug 11 16:35:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@Illuminortii @RepAnnWagner @OnlyFans Please see full letter here: https://t.co/INKshBrW8R","date":"Wed Aug 11 15:28:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to join 100 House colleagues of both parties, led by @RepAnnWagner, urging the Department of Justice to investigate @OnlyFans for child exploitation and sex trafficking. https://t.co/qlNzNqfujP","date":"Wed Aug 11 15:22:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Every single GOP member of the House Oversight Committee @GOPoversight has signed on to my letter calling for a field hearing on the New Mexico border to address the Biden Border Crisis. \n\nBy end of FY2021, a population the size of New Mexico will have illegally entered the US. https://t.co/wGjhunQeZm","date":"Tue Aug 10 16:15:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to be on @EricShawnTV to discuss our efforts to protect the people of New Mexico from the Biden Border Crisis!\n\nhttps://t.co/INixCI8Wvf","date":"Mon Aug 09 15:58:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration is failing to protect the people of New Mexico. Our Governor must be willing to defend our citizens and their communities, or why have a state government at all?\n\nhttps://t.co/Zk2SpaGzIt","date":"Mon Aug 09 14:42:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Questions? Concerns? Issues we can help with? Second District Field Representative Kim Perry will be holding mobile office hours next week in Hobbs, Carlsbad, Artesia, and Ruidoso. https://t.co/aIaZaHrBrU","date":"Fri Aug 06 18:05:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I had a wonderful time at the Lea County Fair connecting with the talented folks who are bringing jobs, business, and travel options to the community through HOB airport. Proud to have supported their grant from the Small Community Air Service Development Program! https://t.co/0XeukFM7BX","date":"Thu Aug 05 16:19:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Urgent requests to secure our southern border and stop the flow of COVID-19 into New Mexico should warrant a response from  Gov. Grisham, not petty and partisan slurs from her staff. \nNew Mexicans need her help and she is no where to be found. \nhttps://t.co/EtTRn6or2T","date":"Thu Aug 05 14:39:54 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Violence against the brave men and women of law enforcement is a direct result of the Leftist campaign to defund, demonize, and destroy police. It's why I introduced a bill to make the murder of police a federal crime punishable by the death penalty: \nhttps://t.co/E1Ft9ntW1e","date":"Wed Aug 04 15:12:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Pure joy! Congratulations Tamyra, and thanks for doing the USA proud!","date":"Tue Aug 03 20:59:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Special thanks to @RepBrianBabin, @RepBobGood, @RepAndyBiggsAZ, @RepTroyNehls, and @RepGregSteube for supporting this vital action to help the people of New Mexico, the border states, and all Americans.","date":"Tue Aug 03 18:49:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I have requested that NM Governor Grisham @GovMLG deploy the New Mexican National Guard to assist our heroes in law enforcement and border patrol handle the Biden Border Crisis and address public health concerns. \nWe have waited on Washington for too long. https://t.co/Fe9lMuIp5N","date":"Tue Aug 03 18:47:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thanks to @KevinRobertsTX and the great folks at the @TPPF for spreading the word about the SHIELD Act I've introduced with @SenTedCruz. We need to protect our communities from Covid by preserving the Title 42 public health rule!\nhttps://t.co/tq5uSZpxHM","date":"Tue Aug 03 14:20:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please join me today on a Facebook Live hosted by the House Freedom Caucus at 2PM ET/12PM MT. We will be talking with virologist and medical doctor Dr. Li-Meng Yan about the origins of Covid--&gt;\nhttps://t.co/sTlcPnLuJZ","date":"Tue Aug 03 13:36:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm for infrastructure--REAL infrastructure. That means jobs, roads, bridges, energy, etc., not a Leftist wish-list designed by Dems so they can never be voted out of power.","date":"Mon Aug 02 16:53:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I agree, @RepCuellar! I hope you'll consider supporting my PAUSE/SHIELD legislation, which preserves Title 42 protections for our border and defends our communities against new cases of COVID. We need to protect the American people.","date":"Mon Aug 02 14:01:14 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"So glad that Independent Women's Voice supports my PAUSE Act, which would help protect Americans from new cases of COVID as well as defend our borders. Thank you, ladies! @IWV  \n\nhttps://t.co/XfeuQx28El","date":"Mon Aug 02 13:45:49 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Does the White House have any coherent message at all? Or are they trying to protect themselves from criticism by not having a clear position on anything? Americans deserve better leadership. https://t.co/glP6azVSSt","date":"Sat Jul 31 19:52:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Tune in tonight to catch our conversation on the border, COVID, mask mandates, mainstream media, and more!","date":"Fri Jul 30 20:34:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is great news, and further proof that additional mandates, lockdowns, and closures are insane. The American people deserve to live and work in peace one more. We cannot destroy more jobs and businesses to satisfy a Democrat power trip.","date":"Fri Jul 30 17:57:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Nancy Pelosi is a great example of why we need term limits in Washington. https://t.co/lObOqR2QUE","date":"Fri Jul 30 15:58:03 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"By order of Nancy Pelosi, Democrats in Congress are using the hardworking men and women of the Capitol Police to enforce their dangerous and politicized mask mandates. Arresting staffers who believe in science is absurd.","date":"Thu Jul 29 13:42:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This week I've been flooded with phone calls and emails from families in the Second District and all across New Mexico about the Biden Border Crisis. I wanted to let you know: I hear you. I share your anger. And I'll keep fighting for you every day. https://t.co/AEMfkwsuV7","date":"Wed Jul 28 21:51:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A government that cannot protect its own borders and communities has failed its essential duties under the Constitution.","date":"Wed Jul 28 13:19:17 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"DHS @SecMayorkas is cancelling in-person events because of Covid, while planning to end Title 42 protections that keep Americans safe from more cases entering the country! Why do Washington bureaucrats protect themselves and not the rest of America?  \n\nhttps://t.co/ZVP81hHkTQ","date":"Tue Jul 27 21:03:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is an outrage. Stopping illegal immigration at the border is meaningless if we release people into this country on the ‘honor system.’ The Biden administration and Democrats in Congress are failing to keep our families and communities safe.","date":"Tue Jul 27 18:58:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Amazing! Congratulations, Lt. English!","date":"Mon Jul 26 21:16:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to co-sponsor the VIP Act offered by my friend @RepMMM, which would give active duty service-members, veterans, and gold-star families free admission to our glorious national parks. \nhttps://t.co/3FWLizUHth","date":"Mon Jul 26 20:44:58 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Mexico's cartels are armed to the teeth, literally invading our land, and Washington leftists rail against ICE, Border Patrol, and law enforcement. \n\nThere is a crisis on our southern border. The Biden administration is not taking it seriously.","date":"Mon Jul 26 15:49:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great to meet these amazing young people in DC who are out here building support for the @SpecialOlympics! https://t.co/25MgObfCpy","date":"Fri Jul 23 17:33:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is why we must not de-fund the police. This is why we must not abolish ICE. \n\nThank you to our brave men and women in law enforcement for serving the people of New Mexico and bringing these children home. \n\nhttps://t.co/dNjpGigpsP","date":"Fri Jul 23 14:21:27 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Glad to have supported Lea County and the @CityofHobbs, who were just awarded a Small Community Air Service Development Program (SCASDP) grant to ensure that HOB airport continues to serve the families and businesses of New Mexico.","date":"Thu Jul 22 18:40:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I am proud to introduce the SHIELD Act, which would stop the Biden administration from opening our borders to illegal immigrants at risk of spreading Covid in our communities. Read more here--&gt; https://t.co/kHeEbQMLfl https://t.co/GP1UMCwi6H","date":"Thu Jul 22 16:18:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Inflation is an unfair, invisible tax on America's families. Wages have stagnated for too many years, and inflation makes every dollar they own worth less than before.","date":"Thu Jul 22 13:22:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Lovely to see @lacyjackson18 at my House office today! https://t.co/SEDTzPK0IM","date":"Wed Jul 21 19:29:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The people of Iran have long suffered under brutal rulers, but a government which so harshly oppresses its own citizens cannot last. Freedom will prevail.","date":"Wed Jul 21 18:36:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration must admit that our border crisis is also a public health crisis. \n\nI urge my colleagues in the House and Senate to pass the SHIELD/PAUSE Act, which would preserve America's ability to stop Covid at our borders.\n\nhttps://t.co/mlehhyEzY1","date":"Wed Jul 21 13:41:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to help protect our forests, our wildlife, and our communities from wildfires. Click here to learn more: -------&gt;https://t.co/1i2LldZyn6 https://t.co/1mCFzcV0aB","date":"Tue Jul 20 20:39:47 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was a pleasure to se New Mexico State Senator David Gallegos in our nation's capitol to plan an ever brighter future for the people of our great state. @gallegos4nm https://t.co/lGusqwhABu","date":"Mon Jul 19 20:17:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It was wonderful meeting with @MilenaMayorga, El Salvador's Ambassador to the United States, and discussing how our shared vision of freedom and opportunity can benefit both nations. https://t.co/qXQ0Kp5q00","date":"Mon Jul 19 19:47:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I led more than a dozen of my House colleagues in a letter last month urging senators to oppose Stone-Manning’s confirmation because of her ties to eco-terrorism. \n\nhttps://t.co/07qwmvBxnQ","date":"Fri Jul 16 14:18:31 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Hyde Amendment has saved 2.5 MILLION lives from abortion since 1976.","date":"Thu Jul 15 16:02:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The lack of transparency and apparent pattern of ethical issues raises questions about the stewardship of @ENERGY by the Biden admin. https://t.co/asuZQtEnFb","date":"Wed Jul 14 14:18:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The first bill I introduced sought to keep Title 42 in place, and I’m proud to continue leading the House effort to maintain this crucial safeguard.","date":"Tue Jul 13 18:14:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great meeting today with New Mexico doctors and my colleague @RepMMM. We talked about issues with health insurance as well as the need for greater transparency in drug pricing. https://t.co/obVESNps4V","date":"Mon Jul 12 20:13:35 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The crime rampage in America can only be solved with proactive policing in our communities, not by defunding the police or going after legal, law-abiding gun owners.\n\nhttps://t.co/ZIkR1xwD5g","date":"Mon Jul 12 17:14:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congratulations to Sir @richardbranson and the crew of @virgingalactic's #Unity22 on their successful flight from New Mexico's Second District!","date":"Sun Jul 11 15:40:54 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"An attack on those who 'protect and serve' us is an attack on our communities and the rule of law. \n\nIt cannot stand — we must defend those who defend us so selflessly and bravely.","date":"Thu Jul 08 18:47:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"There have been 27 ambush-style attacks on law enforcement officers so far this year. \n\nI've introduced a bill to make the murder of a state or local LEO a federal crime punishable by the death penalty.\n\nhttps://t.co/s3yqmxoeO3","date":"Thu Jul 08 15:45:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"So far in 2021, 128 police officers have been shot in the line of duty. \n\nWe need to protect our officers by passing legislation like the “Defending Our Defenders Act.” \n\nhttps://t.co/KkQo2B9nUn","date":"Wed Jul 07 18:12:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The American people remember who championed and cheered on the \"defund the police\" movement. With crime rates skyrocketing, we're now seeing the dangerous consequences of that mantra.\n\nhttps://t.co/EOygNoinIu","date":"Wed Jul 07 15:48:45 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Every politician who supports \"defunding the police\" should take responsibility for this crisis.","date":"Tue Jul 06 19:26:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This will turn what is already a crisis into an uncontrollable catastrophe.","date":"Tue Jul 06 16:08:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Las week I offered @HouseDemocrats the opportunity to vote on my bill to keep these border health protections in place. \n\nhttps://t.co/8SqFCIPI1j","date":"Tue Jul 06 15:38:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Title 42 allows Border Patrol to quickly expel illegal immigrants instead of risking the health of agents and immigrants alike. The Biden administration plans to end it this month. \n\nhttps://t.co/ITcgHGngEx","date":"Tue Jul 06 14:31:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Happy Independence Day! May God continue to bless the United States of America. 🇺🇸 https://t.co/TlK59M4MDs","date":"Sun Jul 04 12:47:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congratulations to Kei and to all the talented young artists who participated in this annual competition.\n\nhttps://t.co/538j9caqP7","date":"Sat Jul 03 23:25:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I received this note from a constituent yesterday. \n\nThe first duty of a nation is to defend its border and its people. President Biden has been derelict in this duty. https://t.co/mnc78UwBMj","date":"Sat Jul 03 19:31:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@WhiteHouse Gas prices are at a 7 year high going into the weekend. \n\nMy PUMP Act would save families 18 cents a gallon every time they fill up. https://t.co/RqOtLkzMYC https://t.co/thQ6qaLYc0","date":"Fri Jul 02 02:22:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Reminder: Fireworks are always prohibited in National Forests. https://t.co/G3aE3AcF8A","date":"Thu Jul 01 19:22:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Americans need a gas tax holiday.","date":"Thu Jul 01 15:08:21 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Donald Rumsfeld served our nation as a member of Congress, White House staff, and twice as Secretary of Defense. He passed away today at his home in New Mexico. I offer my sincere condolences to his family.","date":"Wed Jun 30 20:03:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden admin has created a humanitarian crisis at the border that didn’t have to be. https://t.co/vdjDXzPh3G","date":"Wed Jun 30 18:41:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Heading into the 4th, gas prices have surged to their highest level in 7 years. We need a gas tax holiday to ease the pain at the pump. \n\nhttps://t.co/ZjWBL270N9","date":"Wed Jun 30 18:01:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@GovMLG should not only deploy New Mexico National Guard troops to the border, she should also ask other states for assistance as Governor Abbot and Governor Ducey have done. \n\nhttps://t.co/SQoHylUfK8","date":"Wed Jun 30 15:18:23 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Ending Title 42 now, while fewer than half of American citizens are fully vaccinated, sends the message that illegal immigration is more important than protecting Americans.","date":"Wed Jun 30 13:51:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Title 42 protections are the only major Trump-era border policy left in place under this administration.\n\nToday, House Democrats BLOCKED consideration of my bill to keep those vital border restrictions in place. https://t.co/qgqVtsUdpX","date":"Tue Jun 29 21:33:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Ending Title 42 would turn what is already a crisis into an unmitigated, uncontrollable, and undeniable catastrophe.","date":"Tue Jun 29 13:22:14 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm going to the border with President Trump this week to show the Biden admin the policies and programs that led to the most secure border in decades. https://t.co/H4izWASxY2","date":"Tue Jun 29 01:42:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Given the Biden admin's supposed concern for domestic terrorism, the nomination of Tracy Stone-Manning is particularly puzzling and worrisome. \n\nhttps://t.co/wcxLiQsHWN","date":"Mon Jun 28 21:43:40 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Roughly 18,000 fires are started each year by fireworks.. Please be careful as you celebrate this Independence Day. https://t.co/eNut9kIwc1","date":"Mon Jun 28 17:49:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Reminder: The 180,034 border crossings in May is a new 21-year high.","date":"Mon Jun 28 17:22:49 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I wrote to the Biden administration last week urging them to keep Title 42 in place. https://t.co/jOKDdHukdf https://t.co/SZfR5Vtu2D","date":"Mon Jun 28 15:12:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I’m shocked and deeply saddened by the news of this morning’s hot air balloon crash in Albuquerque. My thoughts and prayers are with the victims and their families.","date":"Sat Jun 26 22:55:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"She talked to immigration activists, but didn’t have time to listen to the farmers, ranchers, and residents who live in our border communities.","date":"Fri Jun 25 20:28:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Lawmakers from every state along the southern border have signed onto my letter urging CDC and DHS to keep Title 42 in place. \n\nThank you Chip, @RepBrianBabin, @RepAndyBiggsAZ and @RepMcClintock.","date":"Fri Jun 25 14:50:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Ending Title 42 authority now, while the pandemic rages in Latin America, sends the message that illegal immigration is more important than protecting Americans.\n\nhttps://t.co/zdWtvyJYDM","date":"Fri Jun 25 13:31:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Obama administration considered 1,000 migrants per day a “crisis.”\n\nAn average of more than 5,800 illegal immigrants crossed our southern border EVERY DAY last month.","date":"Fri Jun 25 00:58:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden admin plans to end Title 42 next month. This is the only thing preventing his border crisis from turning into a complete and uncontrollable catastrophe.\n\nTitle 42 must remain in place. https://t.co/pioewVQpTw","date":"Thu Jun 24 19:20:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@CBPMarkMorgan is right. \n\nTitle 42 will help prevent the introduction of new cases and variants of COVID-19 from Central America and Latin America, where the pandemic still rages.","date":"Thu Jun 24 15:17:13 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If Title 42 is lifted, a surge of illegal immigration will hit our border, dwarfing what is happening today.","date":"Thu Jun 24 14:30:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"To truly understand the crisis, @VP needs to hear from the ranchers, farmers, and residents who live with the effects of this administration’s open borders policy every day.","date":"Thu Jun 24 14:06:03 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It's about time Kamala visited the border, but she could learn a lot more about what works from the previous administration. ⤵️","date":"Thu Jun 24 14:02:23 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Visiting the border needs to be more than just checking a box.\n\nTo truly understand the #BidenBorderCrisis, @VP needs to hear from the ranchers, farmers, and residents who live with the effects of this administration’s failing policies.","date":"Wed Jun 23 22:28:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It's about time @VP visited the border. \n\nTo understand the situation, she needs to bring a bipartisan delegation and listen to the ranchers, farmers, and residents who see the #BorderCrisis every day.","date":"Wed Jun 23 17:53:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congress must act to restore Americans’ faith in the fairness of our election process. \n\nI'm proud to support my friend @RepDonaldsPress's bill. \n\nhttps://t.co/NK2BoI2BEF","date":"Wed Jun 23 15:02:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"President Trump could give @VP an in-depth briefing on the programs that led to the most secure border in decades. \n\nhttps://t.co/UXerjL7BlK","date":"Wed Jun 23 12:32:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If @VP won't visit the border with me, she should go see it with President Trump and @GovAbbott next week. https://t.co/E1rR21ZZNf","date":"Tue Jun 22 19:02:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We know what works. The Biden administration should bring back President Trump’s border policies. https://t.co/PDoodXZGHh","date":"Tue Jun 22 17:44:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"BTW... I invited Kamala to visit the border with me 29 days ago. https://t.co/eMg06uPykj","date":"Tue Jun 22 15:31:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Where’s Kamala? https://t.co/17EIRkRMhF","date":"Tue Jun 22 13:38:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Any procedure that forever stops a beating heart is not healthcare.","date":"Mon Jun 21 20:40:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@PressSec @POTUS Are you finally realizing gas prices are too high? That’s why I introduced the PUMP Act 33 days ago. https://t.co/bVvQkPudso\n\nRepublicans want to cut taxes for American families. Where are @HouseDemocrats?","date":"Mon Jun 21 18:07:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The military has a huge presence in New Mexico. It’s important as a member of Congress to understand all the missions to be a good voice and good advocate for our military installations in Washington.\n\nhttps://t.co/E9R34DgLPV","date":"Mon Jun 21 15:30:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Happy Father’s Day to all the amazing dads out there. https://t.co/n4eAXQsy6B","date":"Sun Jun 20 18:13:18 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"“These people are not turning themselves in, they do not want to be caught.”","date":"Fri Jun 18 17:35:16 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Met this week in DC with Major General Sean Bernabe. He was visiting from Ft. Bliss to highlight the vital work being done in the El Paso area. https://t.co/J01xvWWcbV","date":"Fri Jun 18 15:20:27 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The #BorderCrisis in rural New Mexico is not like the situation at major cities and ports of entry like El Paso.\n\nHere’s the difference ⤵️ https://t.co/C6xegdKsqp","date":"Fri Jun 18 14:04:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The situation on our border is wrong. \n\nIt is dangerous. \n\nAnd it is a crisis. https://t.co/iKba6zNHW7","date":"Thu Jun 17 19:12:06 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I’ll always stand up for our #2A rights. https://t.co/bUCgt9EyUc","date":"Thu Jun 17 18:10:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@krqe ℹ️ This claim is disputed.","date":"Thu Jun 17 15:03:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"2 of the 3 New Mexico border counties support my Protecting Americans from Foreign Criminals Act.\n\nHere’s why: https://t.co/xBkUTcbDHU","date":"Wed Jun 16 22:18:38 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Even before Biden's EPA acted to bring back #WOTUS, I signed on as an original cosponsor of @RepMMM's resolution stating that the Navigable Waters Rule ought to be left in place.\n\nhttps://t.co/bOmODCRJpZ","date":"Wed Jun 16 18:10:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is good news, but it sadly won’t be the end of this president’s efforts to “end fossil fuels.”","date":"Wed Jun 16 16:15:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm grateful to have this show of support from leaders who have a firsthand understanding of the #BidenBorderCrisis.","date":"Wed Jun 16 14:39:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Hidalgo and Luna County, which together include 146 miles of New Mexico's 180 mile international border, both approved statements in support of the Protecting Americans from Foreign Criminals Act. https://t.co/xBkUTbU2Qm https://t.co/lk8RAh7ZSG","date":"Wed Jun 16 13:41:45 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Three months ago I led a bipartisan letter warning the Biden admin their moratorium on new leases and permits on federal lands violated the law and the constitution. \n\nNow a federal judge has agreed. https://t.co/eAds8MK8NL","date":"Tue Jun 15 23:57:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Looking forward to it! Maybe we can talk about a federal judge blocking Biden's oil and gas leasing ban too.","date":"Tue Jun 15 23:46:21 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Trump’s border policies were working. \n\nNow ⤵️ https://t.co/x14pZv7ep5","date":"Tue Jun 15 22:01:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Substituting Washington regulations for rural common sense won’t make our water any cleaner, but it will put our hardworking farmers and ranchers out of business. https://t.co/oNVnEGvFaQ","date":"Tue Jun 15 15:37:34 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Fact: The 180,034 border crossings in May is a new 21-year high.","date":"Mon Jun 14 22:16:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Happy Birthday, @USArmy! https://t.co/59kCaHccjG","date":"Mon Jun 14 20:45:02 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"244 years ago, the Second Continental Congress adopted the flag of the United States. \n\nToday, we stand and honor the Stars and Stripes that bind us together as Americans. https://t.co/Lj7sh7fiFo","date":"Mon Jun 14 16:42:13 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"These photos are from yesterday morning, 15 miles north of the border in my district. \n\nThe #BidenBorderCrisis is only getting worse and there is no end in sight. https://t.co/M7E4ozReSo","date":"Mon Jun 14 14:44:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great having the NM Builders Trust Board in DC. Thank you Chairman Liessman for inviting me to visit with several of the Board Members. https://t.co/RsZoed31G9","date":"Sun Jun 13 17:30:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Remember when we had American energy dominance and border policies that made sense? \n\nThank you President Trump! https://t.co/VEeCjbPPme","date":"Fri Jun 11 18:56:23 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Month after month, Biden’s border crisis gets worse. https://t.co/SGRPvzmzo3","date":"Fri Jun 11 16:20:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Inflation is rising and American pocketbooks are stretched. https://t.co/rOKpkdp2ME","date":"Thu Jun 10 20:37:48 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"With water levels the lowest in recent memory, Elephant Butte faces an existential crisis. I'm working with local stakeholders because our tourism and agricultural industries both require a healthy and sustainable reservoir. https://t.co/r66vWmk5EW","date":"Thu Jun 10 18:11:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We must maintain the Navigable Waters Protection Rule. #WOTUS https://t.co/mgUF9NHPrk","date":"Thu Jun 10 17:59:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Keystone XL was infrastructure.","date":"Thu Jun 10 00:39:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Love this painted buffalo in the Cibola County Courthouse! https://t.co/lXJIlMe4wI","date":"Wed Jun 09 21:23:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The 4 largest meatpackers control more than 80 percent of the beef processing market. \n\nI’ve requested an Oversight hearing on the lack of competition within the beef processing industry and its threat to our nation’s food supply. \n\nhttps://t.co/rbiTM9uBTg https://t.co/ZFUauuGNvY","date":"Wed Jun 09 14:24:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@AnnHendrickson1 Clemens, M.A., &amp; Postel, H.M. (2018) Deterring Emigration with Foreign Aid: An Overview of Evidence from Low-Income Countries. Population and Development Review. 44(4): 667–693.\n\nhttps://t.co/nXamNgtm1l","date":"Wed Jun 09 02:16:21 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Foreign aid won’t stop illegal immigration.","date":"Wed Jun 09 01:42:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In the last few years, the price of cattle has dropped dramatically. However, the price of beef at the grocery store has slightly increased.\n\nCongress and DOJ need to get answers from the meatpacking industry. https://t.co/rbiTM9uBTg https://t.co/14mkgOF9xZ","date":"Tue Jun 08 21:32:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Concentrated control of the beef industry presents a risk to America’s food supply. \n\nI’ve asked @OversightDems / @GOPoversight to hold a hearing, and I joined @SenatorRounds’s bipartisan, bicameral letter asking @TheJusticeDept to investigate. \n\nhttps://t.co/rbiTM9uBTg https://t.co/LZ9kouVdfY","date":"Tue Jun 08 18:53:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Taking somebody on your trip who has the experience and represents a state that borders Mexico would've been a great idea, @VP.","date":"Tue Jun 08 12:56:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Speaking at the @nmcga Mid-Year Meeting this evening.\n\nEarlier today I requested a House Oversight Committee hearing on the lack of competition within the beef processing industry and its threat to our nation’s food supply. https://t.co/mbpep6lZTO","date":"Tue Jun 08 01:50:47 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In 75 days as border czar, Kamala Harris hasn't been to our southern border even once.","date":"Mon Jun 07 18:06:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In Biden’s America, we’ve gone from a domestic energy boom to a bust.","date":"Mon Jun 07 14:49:16 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"77 years ago today, 156,000 young men like Bill and Clive stormed the beaches of Normandy. Thousands of them would not live to see their friends’ and allies’ eventual triumph over tyranny. May we never forget the bravery and sacrifice of our Greatest Generation. https://t.co/wVq2eJWdDE","date":"Sun Jun 06 20:12:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration's refusal to spend what Congress already appropriated is unacceptable.\n\nhttps://t.co/AD7N4NNdWr","date":"Sat Jun 05 21:12:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thanks to my staff member, Brandon, for being available to constituents in Ruidoso today. Visit my website to see when Mobile Office Hours are coming to your community. https://t.co/PPNuWCUYQ4","date":"Fri Jun 04 22:45:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@VP has gone 72 days without visiting the border.","date":"Fri Jun 04 19:48:27 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I strongly oppose @USFWS’s proposal to release Mexican Gray Wolves in Sierra County. https://t.co/QEkJJKjg9Y","date":"Fri Jun 04 18:06:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This photo was taken at a ranch in my district. https://t.co/35Kxc6DFNB","date":"Fri Jun 04 18:06:23 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Having a problem with the IRS? The Taxpayer Advocate Service may be able to help. \n\nYou can call 505-737-6308 or 505-837-5505 on or before June 16, 2021 to schedule a telephone appointment to speak with a case advocate about your tax issue. https://t.co/EFbEt8yTIv","date":"Fri Jun 04 16:22:43 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Saddened to hear U.S. Forest Service Smokejumper Tim Hart passed away from injuries he sustained last week while responding to the Eicks Fire in Hildago County. \n\nMy prayers are with his family, friends, and colleagues. https://t.co/BZCr21D5yl","date":"Thu Jun 03 19:30:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration has made the federal government the last link in the chain of human smuggling. https://t.co/OM0LXqiQYV","date":"Thu Jun 03 16:11:27 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Toured the construction site of the Career and Technical Education Center (CTECH) in Hobbs today. This state of the art vocational training facility is set to open in August 2022. https://t.co/sJyOKSEclH","date":"Thu Jun 03 00:06:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Since she won’t visit our southern border herself, @VP should bring along border state lawmakers with firsthand knowledge of what the border crisis means for those who live there and are affected daily.","date":"Wed Jun 02 19:40:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Biden’s open border policies incentive human trafficking. \n\nIt is cruel and it is a crisis.\n\nhttps://t.co/Hpb1nUmvwX","date":"Wed Jun 02 14:08:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Mooooooove over Wisconsin... \n\nDid you know New Mexico is home to the largest cheese plant in the world?! https://t.co/1wkRowjzvy","date":"Tue Jun 01 21:33:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This week's Mobile Office Hours are in Lordsburg, Silver City, Ruidoso, Alamogordo, and Truth or Consequences. https://t.co/tDnlaHIjrX","date":"Tue Jun 01 20:09:38 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Taxpayer $$ should never fund abortion.","date":"Tue Jun 01 15:46:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"“Greater love has no one than this,” Scripture tells us, than “to lay down one’s life for one’s friends.” \n\nToday we honor the men and women of America’s armed forces who gave their lives for their friends, for their families, and for a grateful nation. https://t.co/Nzbc9FhQCa","date":"Mon May 31 14:46:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Gas prices are the highest they’ve been since 2014. My legislation would suspend the 18.4¢/gal federal gas tax for at least six months. \n\nLearn more: https://t.co/DknrxWBUAY https://t.co/ZrMAL7Tu6j","date":"Sat May 29 13:52:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Families are paying more for beef at the grocery store, while independent cattle producers are going broke. \n\nI signed @SenatorRounds letter because #WeHaveBeefWithPackers https://t.co/mj7lleDTtX","date":"Fri May 28 14:52:14 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Be sure to follow me on Instagram for more updates on my work in New Mexico and on Capitol Hill. https://t.co/fD2QhlbUUA","date":"Thu May 27 21:31:35 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The #BidenBorderCrisis is cruel, it’s costly, and it’s impossible to think the administration can’t see that for themselves. https://t.co/XOwCJuVMUT","date":"Thu May 27 17:56:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Had a chance to visit COPE, our Domestic Violence Shelter in Alamogordo, and met their newest staff member, Jetti the therapy dog! https://t.co/41h9mZtP8W","date":"Thu May 27 14:10:23 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@onemorederrick @VP https://t.co/IgdJAnLYzI","date":"Thu May 27 13:59:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@pamgraf Here are just a few examples: \n\nDamage to fences &amp; water supplies:\nhttps://t.co/tzPuFUnmsc\n\nThreats to livestock: \nhttps://t.co/SP3YpKKzw7\n\nKidnapping: \nhttps://t.co/DG3BuwZvsN","date":"Wed May 26 21:37:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The cost of caring for illegal immigrants strains the budgets of the most impoverished communities along the border, many of which are still reeling from the economic effects of the COVID-19 lockdowns.\n\nMy new bill would repay those costs. https://t.co/lCfNOkfNZp","date":"Wed May 26 20:02:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Legislation I introduced this week would prevent the release of any alien prior to the completion of their immigration case if they have any criminal convictions; terrorism, cartel or gang ties; or cannot be properly vetted. https://t.co/z4dxM8yBFp","date":"Wed May 26 16:50:21 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@VP should join me at the southern border of New Mexico to see the crisis firsthand and how it is affecting Americans in my district who fear violence and property damage along the border.\n\nhttps://t.co/vCmWUYfadU","date":"Wed May 26 15:30:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In my district, illegal immigrants have torn down fences, destroyed crops, broken irrigation pipes, killed cattle, stolen vehicles, and even kidnapped ranch employees. \n\nThis week I introduced the Repaying the Rural Borderlands Act. https://t.co/8zsM3Z4cWK","date":"Wed May 26 13:40:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The root cause of the border crisis ⤵️\n\nWe’re stealing money from American taxpayers and making a better life for kids coming here illegally than we are for our own kids. https://t.co/PbWGWk5WNC","date":"Tue May 25 20:54:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden admin is welcoming 1000s of people into our country with little, if any, time for in-depth criminal &amp; national security background checks. This poses a clear and present danger to our communities.\n\nToday I introduced the Protecting Americans From Foreign Criminals Act. https://t.co/X2sKXbN9j1","date":"Tue May 25 18:25:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@thehill Additionally, it is imperative that @VP's discussions with the governments of Mexico and Central American countries include members of Congress, especially those members from border communities and those on both sides of the aisle. \n\nhttps://t.co/eRQ7ybgdlH","date":"Tue May 25 15:07:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@thehill You can read my letter to @VP here: https://t.co/3x44N9YOJG https://t.co/fp2IDdzdTD","date":"Mon May 24 22:19:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It is time we cut out roadblocks that prevent veterans from accessing the care they need in their own communities.\n\nhttps://t.co/gXxsMvaOiA","date":"Mon May 24 13:48:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Today New Mexico became the third state from which humans have flown into space. Congratulations to Virgin Galactic’s crew and support team!","date":"Sun May 23 00:12:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The PUMP Act would suspend the 18.4¢/gal federal gas tax for at least six months. https://t.co/FGaUJd7rgs","date":"Fri May 21 19:04:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I think it’s important that we give the American taxpayer a break. The PUMP Act is a great way to let consumers keep some money in their pocket book.\n\nhttps://t.co/ZjWBL270N9","date":"Fri May 21 15:07:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My team and I are showing our support for America’s friend and ally. Join us as we lift Israel up in prayer. https://t.co/dBZi2TmBgX","date":"Thu May 20 18:37:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"High gas prices are hurting our economic recovery. I’m proposing a federal gas tax holiday for at least six months. https://t.co/IFnGvNETej","date":"Thu May 20 18:13:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Higher taxes are the last thing American families and small businesses need right now. https://t.co/cCuXf9pELV","date":"Thu May 20 14:55:06 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you @RepGregSteube @RepHarshbarger @RepGosar @RepBurgessOwens @RepLaTurner @RepLisaMcClain for cosponsoring the PUMP Act. \n\nTemporarily suspending the 18.4¢ federal gas tax will provide direct relief to drivers around the country. https://t.co/AfZkcUB1Dk","date":"Wed May 19 18:28:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The PUMP Act will put more money in the pockets of American consumers. https://t.co/nKiEsRnH6q","date":"Wed May 19 16:01:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Gas prices are higher than they’ve been since 2014. \n\nI talked first to @koat7news about my new bill to temporarily suspend the 18.4¢ federal gas tax. https://t.co/jS9OREOlSe","date":"Tue May 18 14:54:31 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Israel has the right to defend itself.","date":"Mon May 17 19:36:27 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A special thank you today to the men and women of America’s Army, Navy, Air Force, Marine Corps, Space Force, and Coast Guard. 🇺🇸 https://t.co/tgplwlFkMs","date":"Sat May 15 19:22:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"us*","date":"Fri May 14 15:02:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"You can’t train courage. These are the people — the thin blue line — who keep is safe. https://t.co/FJrr7FpUa8","date":"Fri May 14 14:44:02 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I’m proud to cosponsor this resolution. We must continue to stand with our ally Israel.","date":"Thu May 13 20:54:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Happy birthday @SenTomCotton and thank you for leading the Senate version of the Defending Our Defenders Act. \n\nOur bill will subject those who murder police officers to a punishment they deserve: life in prison or the death penalty. https://t.co/QzAhFvgrGB","date":"Thu May 13 18:14:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Today, and every day, we honor our fallen and we honor our finest: the men and women in blue. #PoliceWeek https://t.co/Jd3fYYnOKy","date":"Thu May 13 14:40:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"America stands with Israel! 🇺🇸 🇮🇱","date":"Wed May 12 20:03:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Employers posted a record number of available jobs in March. But as long as we keep giving stimulus money out though COVID relief and enhanced unemployment, people are not going to want to get back to work.\n\nhttps://t.co/PQgQIdhbu7","date":"Wed May 12 15:47:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In March, I introduced the Defending Our Defenders Act to make the murder of a state or local law enforcement officer a capital crime. We must defend those who defend us so selflessly and bravely.\n\nhttps://t.co/KkQo2B9nUn","date":"Wed May 12 15:01:03 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Law enforcement officers regularly put their lives on the line to serve and protect our communities. They have our backs, we must have theirs. https://t.co/zjmjV4Jaor","date":"Tue May 11 20:47:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@NesterNat9 @NewMexicoGOP @POTUS @VP The number is from this Harvard-Harris poll. https://t.co/6kGkMHgNJP https://t.co/uXgJFvseRZ","date":"Mon May 10 22:38:01 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Mr. @POTUS and Madam @VP, I invite you to come visit the southern border in my district .\n\n77% of Americans think you should get there ASAP. \n\nhttps://t.co/PLCXWng5cU","date":"Mon May 10 21:40:18 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Happy Mother’s Day! https://t.co/Kn1Cns9wbA","date":"Sun May 09 13:35:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Photos from this week’s Mobile Office Hours in Alamogordo.\n\nNext week staff will be in Hobbs, Carlsbad, Magdalena, Socorro, Artesia, Portales, Ft. Sumner, and Santa Rosa. https://t.co/9QXGSdlgm7","date":"Fri May 07 18:08:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"May God continue to bless the United States of America! 🇺🇸 🙏 https://t.co/sXDieIQvhK","date":"Thu May 06 16:30:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Need help with a federal agency? \n\nMy Mobile Office Hours are coming to Hobbs, Carlsbad, Artesia, Portales, Ft. Sumner, and Santa Rosa next week. \n\nDetails here: https://t.co/RvVMStJvyo https://t.co/EgRfbUpe1a","date":"Wed May 05 19:59:31 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The White House needs to explain what, if any, steps they have taken to review the allegations against Mr. Kerry and ensure our nation's security.","date":"Tue May 04 23:32:54 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Brandon just finished Mobile Office Hours in Lordsburg. He’ll be in Silver City later then in Rudioso &amp; Alamogordo on Thursday to help you w/ any problems you’re having w/ federal agencies. \n\nFind out when Mobile Office Hours are coming to your community: https://t.co/07Nb5rHyEX https://t.co/YKyDeztQIh","date":"Tue May 04 17:25:48 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'm proud to cosponsor the Veterans Health Care Freedom Act.\n\nhttps://t.co/Qy9ePT0GQu","date":"Tue May 04 14:35:34 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Interested in attending one of the U.S. Service Academies? You won't want to miss Wednesday's webinar with representatives the academies, ROTC, and New Mexico's Congressional Delegation. \n\nhttps://t.co/cob5G1TxdM https://t.co/sE8heGItYs","date":"Mon May 03 16:47:38 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A lot of people are feeling helpless these days, but we have the power to change our communities — one big way is to spend locally and support your local merchants. https://t.co/qDfLlLavHh","date":"Sat May 01 18:08:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Great visit to Dexter Middle School today! https://t.co/JUtxpWt88y","date":"Fri Apr 30 21:01:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Learning more at the #ThreeRiversFire Incident Command Post in Ruidoso. https://t.co/I2lPiMjutc","date":"Thu Apr 29 17:08:43 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Getting an update on the #ThreeRiversFire from Lincoln County Emergency Management officials this morning. https://t.co/Ca5rpIdaSM","date":"Thu Apr 29 15:22:23 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I will continue to oppose the radical left-wing agenda and unlimited spending spree being pushed by the Biden administration and congressional Democrats.","date":"Thu Apr 29 02:14:34 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"For someone who calls for unity and bipartisanship, President Biden has completely caved to the radicals and socialists in the Democrat party. \n\nFor example ⤵️","date":"Wed Apr 28 22:55:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In just 100 days, President Biden and his allies in Congress have pushed to infringe on our Second Amendment rights, raise our taxes, defund the police, pack the court, and promote abortion at home and abroad.","date":"Wed Apr 28 21:15:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Need help with a federal agency? \n\nMy Mobile Office Hours are coming to Belen and Los Lunas this week. \n\nNext week my staff will be in Deming, Lordsburg, Silver City, Ruidoso, and Alamogordo. \n\nhttps://t.co/cRzdv77kM4","date":"Tue Apr 27 16:10:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"⚠️FIRE UPDATES ➝ Full updates will be posted to Three Rivers Fire 2021 twice a day in the mid-morning and in the evening. Smaller emergency notifications will be posted to the page periodically throughout the day as need.\n\nhttps://t.co/3A4l1DUdgc","date":"Tue Apr 27 15:02:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Please also beware of unconfirmed information about the situation, and follow official sources like @LincolnUSForest and @NMFireInfo for the latest reliable and factual updates.","date":"Mon Apr 26 22:43:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Stay safe, heed the warnings and orders from authorities, and be prepared to relocate quickly if necessary.","date":"Mon Apr 26 22:41:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My staff and I are closely monitoring the #ThreeRiversFire and staying in regular contact with the USDA, USFS, state, and local officials. Our prayers are with those fighting the fire as well as those in its path.","date":"Mon Apr 26 22:40:58 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"https://t.co/Fq8lbWOIQb","date":"Mon Apr 26 22:13:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"⚠️ from the Lincoln County Sheriffs Office: \n\nForest Service has issued an EVACUATION ORDER for Bonito and Nogal Canyons in Lincoln County. The Three Rivers Fire has expanded and expected to crest the summit shortly.","date":"Mon Apr 26 20:22:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Unbelievable.\n\nhttps://t.co/Ah4H2n0tvO","date":"Mon Apr 26 14:12:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Instead of following the Democrat approach of regulating, banning or prohibiting energy development, we should be using creative, unique solutions that give us a strong economy and a healthy environment at the same time.\n\nhttps://t.co/3sxFPcU2gN","date":"Fri Apr 23 13:29:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"79 House Republicans have signed @RepChipRoy’s discharge petition to force a vote on the PAUSE Act I introduced. \n\nCongress must act to ensure Border Patrol keeps their authority to quickly expel migrants who have or may have been exposed to COVID-19.","date":"Fri Apr 23 00:52:17 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The least Congress can do is make these commonsense fixes to give Border Patrol agents the flexibility they deserve.","date":"Thu Apr 22 22:04:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"President Biden’s nominee to lead ATF has consistently worked to advance a radical gun control agenda. I joined my colleagues in urging senators to oppose confirmation.","date":"Thu Apr 22 17:42:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Biochar may be one of the best environmental solutions you’ve never heard of.","date":"Wed Apr 21 18:43:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@GovMLG We need the @NMNationalGuard at the border. https://t.co/2V7D7vgk7l","date":"Wed Apr 21 16:33:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Your move, @GovMLG... \n\nhttps://t.co/KjVuTFBaFv","date":"Wed Apr 21 16:32:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Title 42 border health protections may be the only thing keeping the #BidenBorderCrisis from becoming a full blown catastrophe. I’m working with @RepChipRoy to make Congress act. \n\nhttps://t.co/rZcNNBgzPE","date":"Tue Apr 20 13:16:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration has a double standard for certain communities with regard to pandemic protections.","date":"Sat Apr 17 01:26:48 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"RT if you agree:\n\nWe need a Constitutional Amendment to require the Supreme Court of the United States be composed of nine justices. \n\n#WeNeedNine","date":"Thu Apr 15 22:24:02 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I’ve been to the border 3 times this year. \n\n@VP has been in charge of the #BidenBorderCrisis for 3 weeks and hasn’t gone to the border once. https://t.co/uANeIIhfFo","date":"Thu Apr 15 18:25:58 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Democrats want you to believe the #BidenBorderCrisis is nothing more than families &amp; children, but that’s far from the whole story.\n\nIn the first half of FY21, CBP detained 265 sex offenders, 576 people convicted of violent crimes and 982 drug offenders. \n\nhttps://t.co/Kycp1HmicK","date":"Wed Apr 14 17:24:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Criminals and the cartels are exploiting the overworked and undermanned Border Patrol to illegally enter the country.","date":"Wed Apr 14 15:07:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The governor does not need to wait for the federal government to do her job.","date":"Tue Apr 13 16:33:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Officer Evans was killed in the line of duty on April 2. My prayers are with his family, friends, and colleagues.","date":"Tue Apr 13 14:21:47 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"President Biden’s border crisis is getting worse by the day. \n\nI wanted my colleagues in Congress to see the situation here firsthand and hear directly from my constituents about the harm this administration’s rhetoric and policies are causing in our border communities. https://t.co/oDpVlHVse6","date":"Tue Apr 13 13:11:18 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"You won’t see this on TV. Border wall materials ready for construction in New Mexico. https://t.co/uhUDUwBw7Q","date":"Mon Apr 12 23:33:47 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Some of my other stops included a Rural Issues Roundtable in Socorro County, a Business Roundtable in Grant County, and a Pastors Roundtable in Valencia County.","date":"Mon Apr 12 15:09:40 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Last week I traveled more than 660 miles around southern New Mexico for meetings and events in nine communities, including a meeting with local elected officials (below) in Sierra County. https://t.co/UIo5hiwU5U","date":"Mon Apr 12 15:08:57 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico is on the front lines of the #BidenBorderCrisis. \n\nhttps://t.co/4A3EWoATEx","date":"Fri Apr 09 19:41:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@GovMLG @NMNationalGuard The number of people attempting to cross our southern border is unprecedented and something must change in order to deter migrants from making that life-threatening journey. \n\nI believe that change is deploying National Guard troops to the border. https://t.co/Zr0eVPhWzu","date":"Fri Apr 09 15:56:17 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The #BidenBorderCrisis has left the Border Patrol overworked, undermanned, and under-supplied. \n\nI'm calling on @GovMLG to send the @NMNationalGuard to help. https://t.co/qMaOdTqxzW","date":"Fri Apr 09 15:53:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The White House fact sheet on Democrats’ “infrastructure bill” mentions “climate” 20 times more than “Highway Trust Fund.” https://t.co/rQ3dlW1FUn","date":"Thu Apr 08 19:48:43 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congratulations to America‘s newest Border Patrol Agents! https://t.co/KCGRYTaBQl","date":"Wed Apr 07 22:33:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"President Biden's energy policy replaces a lot of good-paying jobs with a lot fewer lower-paying jobs.\n\nhttps://t.co/4svKk45mna","date":"Wed Apr 07 15:04:18 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration has made the federal government the last link in the chain of human smuggling. https://t.co/ISOSydjkJx","date":"Tue Apr 06 16:54:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If Washington Democrats get their way, Congress will have enacted almost $10 trillion in spending in a single year – more than the total combined wages paid to all American workers each year.","date":"Tue Apr 06 14:06:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My Mobile Office Hours are coming to Deming, Lordsburg, Silver City, and Truth or Consequences this week. \n\nhttps://t.co/cRzdv6PJnu","date":"Mon Apr 05 13:28:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Wishing you a happy and peaceful Easter. https://t.co/GhihnUB8bo","date":"Sun Apr 04 12:27:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Praying for the injured officers.","date":"Fri Apr 02 17:42:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is a national security issue.  https://t.co/0908lFgZjB","date":"Fri Apr 02 14:49:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Halting border wall construction is costing taxpayers $1 million a month.\n\nhttps://t.co/JVNN7XA3Tm","date":"Thu Apr 01 15:50:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Finish. The. Wall. https://t.co/GjZptHyKVn","date":"Tue Mar 30 23:35:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is outrageous! https://t.co/eSiD7ZlB8B","date":"Tue Mar 30 14:24:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you for your service. 🇺🇸 https://t.co/G9O2k9WHDd","date":"Mon Mar 29 23:37:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Until all COVID-19 lockdowns, orders, and mandates end, Title 42 health protections at the border must remain in place.","date":"Mon Mar 29 22:55:40 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@pamgraf @RepRonnyJackson @RepPeteStauber Even optimistic estimates for land-lease payments and taxes on proposed wind and solar projects fail to fill the hole the loss of oil and gas revenue will leave in our state budget if the #BidenBan remains in place. https://t.co/ZfqfxvNW7v","date":"Mon Mar 29 19:51:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is yet another reason why we need to pass the PAUSE Act and keep Title 42 in place... Mexico doesn't seem to have flattened the curve. https://t.co/pDMURtbMzC?","date":"Mon Mar 29 17:23:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"On a recent visit to the border with @GOPLeader, we heard migrants are coming because they know they will be released. And they are. \n\nhttps://t.co/qNQE2lJMI6","date":"Mon Mar 29 14:57:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The oil and gas industry matters not only to our state, but to our nation and our energy independence. https://t.co/zEV2TwMKBP","date":"Sun Mar 28 22:28:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I took this photo on Monday of materials on the ground, ready to go for border wall construction. \n\nIt’s a shame some lawmakers and President Biden oppose the wall merely because President Trump supported it. https://t.co/B916Ul8FM5","date":"Fri Mar 26 16:56:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you @RepPeteStauber, @RepTenney, and @RepRonnyJackson for joining me in Artesia this week to learn more about New Mexico's energy industry. \nhttps://t.co/M8kpnmC951","date":"Thu Mar 25 23:55:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@pamgraf The PAUSE Act keeps Title 42 authority in place. Title 42 allows CBP to quickly expel illegal immigrants at the border who may have (or have been exposed to) COVID instead of placing them into a congregate setting like this.","date":"Thu Mar 25 23:49:45 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is why we need the PAUSE Act.\n\nhttps://t.co/jE9NSjhDsU","date":"Thu Mar 25 14:35:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Defending Our Defenders Act I introduced would put the death penalty on the table for suspect in Colorado. https://t.co/m0RxM1zcAj","date":"Wed Mar 24 17:32:47 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My prayers are with the families and communities affected by the recent gun violence. This violence must end, and the murderers must pay for their crimes.","date":"Wed Mar 24 17:32:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Part of our “border barrier” is a mere 4 strand barbed wire fence! https://t.co/EQxgG4jmA2","date":"Wed Mar 24 12:58:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@pamgraf Work on the border wall was stopped on Jan. 20, 2021.","date":"Wed Mar 24 12:56:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is a national security issue. These gaps in the barrier funnel illegal immigrants around ports of entry and into our communities. This is on the Johnson ranch I visited yesterday. https://t.co/CTaaKHDQuv","date":"Wed Mar 24 01:42:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Speaker Pelosi is trying to steal an election. My friend @RepMMM won fair and square.","date":"Tue Mar 23 22:05:40 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you to our farmers and ranchers! We appreciate you. https://t.co/1OYPJVsI59","date":"Tue Mar 23 20:56:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The DOJ must do more to confront the threat of Iranian influence in the U.S. https://t.co/7oSV29ZWjK","date":"Mon Mar 22 20:45:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"As the #BidenBorderCrisis grows, we need to keep Title 42 in place. That’s why I introduced the PAUSE Act: https://t.co/ysD8P7Qxr8 https://t.co/q7ISgk10uX","date":"Mon Mar 22 16:59:54 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Congress must hold hearings on the #BidenBorderCrisis immediately!","date":"Sat Mar 20 20:52:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Are you a wounded warrior or medically retired veteran? \n\nLearn more about a two-year paid fellowship in my Roswell or Las Cruces office: https://t.co/fjIesCLJZU","date":"Fri Mar 19 18:03:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Trump administration held Iran accountable for their actions and took their threats seriously. Any softening of our stance on Iran threatens our national security.\n\nhttps://t.co/BC38R0ILCk","date":"Fri Mar 19 01:07:21 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Energy revenue from the oil and gas industry is a reliable, proven way to get New Mexican schools critical funding to reopen safely and effectively.\n\nRead more in my recent op-ed with @RepWesterman \n\nhttps://t.co/1Drl5YS9Ge","date":"Thu Mar 18 21:44:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden administration has made the federal government the last link in the chain of human smuggling. https://t.co/Sh2uERnDZo","date":"Wed Mar 17 21:14:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"NO EARMARKS! 🙅‍♀️","date":"Wed Mar 17 19:23:04 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico's Second District is the largest congressional district in the country that isn't an entire state. To better serve constituents in every part of the district, my staff will hold regular availability in at least 17 different communities each month.","date":"Wed Mar 17 16:07:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My staff have already helped hundreds of constituents before even setting foot in these offices. We haven't missed a beat in being accessible to those needing assistance and in communicating with local leaders across the district.","date":"Wed Mar 17 16:07:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My offices in Roswell and Las Cruces are open! https://t.co/WdgCqpccLN https://t.co/kLZuAS49hd","date":"Wed Mar 17 16:07:31 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We have a crisis at the border, but it really didn't have to be this way. \n\nAs my colleague, @RepCloudTX, said yesterday: \"This administration could have done nothing and it would have been better than it is right now.\" https://t.co/lEPwCIScrj","date":"Tue Mar 16 21:26:48 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Title 42 is helping, but if this president takes that away, then it opens the floodgates even more so. \n\nMy PAUSE Act would keep Title 42 in place. \n\nhttps://t.co/MOAqMTbrVf","date":"Tue Mar 16 18:37:54 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Opening the border to those coming in who are infected with, or exposed to, COVID makes no sense at all.\n\nThis is a humanitarian crisis, but it’s also a public health crisis, and Americans are just as much at risk as those making the trek over. https://t.co/8BBY61CGY1","date":"Tue Mar 16 16:59:48 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Guess she got my letters 😏","date":"Tue Mar 16 15:37:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico’s K-12 public education system received more than $1 billion in funding from the oil and gas industry last year – $60,062 per teacher and $3,788 per student.","date":"Mon Mar 15 15:51:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Obama admin said 1,000 migrants a day was a crisis.\n\nWe're now at 3,500 a day... during a pandemic. https://t.co/QG2mYaHQM0","date":"Sun Mar 14 17:52:45 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Brought a taste from home to the New Mexico National Guard troops on duty at the U.S. Capitol this week. Green Chile of course! https://t.co/7fomT5oV1S","date":"Sat Mar 13 18:57:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I've been against the #BidenBan since Day 1. Glad to see @GovMLG, @MartinHeinrich and @SenatorLujan begin to admit how devastating this could be for our state. https://t.co/Ru1yPeRKkS","date":"Fri Mar 12 21:36:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The administration has no plan to respond to the #BidenBorderCrisis they created. https://t.co/SlnDelmarD","date":"Fri Mar 12 00:57:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The #BidenBorderCrisis is one of his own making. Stopping wall construction, suspending deportations, returning to ‘catch &amp; release,’ and offering stimulus checks invited this crisis. https://t.co/sXNAI9wPGU","date":"Thu Mar 11 20:58:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Looking for a senator to introduce a companion to my bill to exempt New Mexico from the #BidenBan. \n\nWhat do you say @SenatorLujan @MartinHeinrich?\n\nhttps://t.co/b9jjMoASvf","date":"Thu Mar 11 18:36:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you, @RepHarshbarger. There are more hoops to jump through to get on Capitol Hill than to come across our borders.","date":"Thu Mar 11 16:29:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@KOB4 We should be focused on reopening our communities and getting our children back in school as soon as possible. Unfortunately, this bill does nothing to make either happen any faster. \n\nYou can find my FULL statement on the COVID bill here: https://t.co/7vMxzThWvB","date":"Thu Mar 11 03:00:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"We should be focused on reopening our communities and getting our children back in school as soon as possible. Unfortunately, this bill does nothing to make either happen any faster. \n\nMy full statement on the COVID bill: https://t.co/caZL1b0VEd","date":"Thu Mar 11 01:17:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'll be there.","date":"Wed Mar 10 18:56:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"An attack on those who protect and serve us is an attack on our communities and the rule of law.\n\nhttps://t.co/KkQo2B9nUn","date":"Wed Mar 10 18:44:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In the first two months of 2021, 45 law enforcement officers were shot, 11 of whom were killed, the National Fraternal Order of Police announced March 1.\n\nhttps://t.co/PSXcpE7fsJ","date":"Tue Mar 09 19:24:34 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The National Guard is needed at the border, not here on Capitol Hill.\n\nRetweet if you agree ⤵️\n\n@GovMLG should redeploy @NMNationalGuard to help @DHSgov handle Biden’s border crisis. \n\nhttps://t.co/Dh7eoCzebx","date":"Tue Mar 09 14:13:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@Interior These delays increase the possibility for multiple types of environmental hazards, such as producers needing to flare associated gas production and increased truck hauling of produced oil and water.","date":"Mon Mar 08 17:42:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"On Friday I led a bipartisan letter to @Interior warning if permitting delays continue, existing oil &amp; gas operations could be forced to shut down. https://t.co/KIUBrjRmxm","date":"Mon Mar 08 17:29:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Met with Brigadier General Miguel Aguilar and his @NMNationalGuard on Wednesday. I appreciate their service in DC and hope they’re able to go home to their families soon. https://t.co/QqRb4IQThT","date":"Sat Mar 06 18:17:18 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Wide open spaces in CD 2. https://t.co/NDTTJ1NEsA","date":"Fri Mar 05 16:44:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A double standard — \n\n108 illegal immigrants with positive COVID tests were released by Border Patrol and allowed to freely travel from South TX this week. \n\nMeanwhile, farmers with negative COVID tests are barred from entering the U.S. to conduct essential business.","date":"Fri Mar 05 14:39:13 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It’s time to stop the falsehoods and fear-mongering. The public deserves the truth on policing.\n\nhttps://t.co/DewbBhA6Nw","date":"Thu Mar 04 16:57:33 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I sent a letter to Department of Homeland Security Secretary Alejandro Mayorkas questioning his department’s policy of releasing illegal aliens into the United States without first performing COVID tests or adequate background checks. https://t.co/tfB0sbZ07q","date":"Wed Mar 03 20:39:03 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Why we need the PAUSE Act ⤵️\n\n.@NBCNews: After Border Patrol release, asylum-seekers test positive for Covid in Brownsville, Texas https://t.co/sTDCDjlxHU","date":"Wed Mar 03 17:01:00 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"H.R. 1 provides hard-earned taxpayer dollars to power-hungry politicians for their campaign ads. https://t.co/Xs48SLUhYo","date":"Wed Mar 03 16:02:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The reforms included in the Save Democracy Act – from citizenship and voter verification requirements to ballot integrity measures – are essential to restoring Americans’ faith in the fairness of our elections.","date":"Tue Mar 02 21:21:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In total, our state's K-12 public education system received more than $1 billion in funding from the oil and gas industry last year — $60,062 per teacher and $3,788 per student.","date":"Tue Mar 02 17:40:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I agree with @RepArrington. The fencing around the Capitol needs to come down and, with our sincere thanks, the National Guard troops need to go home to their families.\n\nhttps://t.co/qOQaNbY8xg","date":"Tue Mar 02 16:36:25 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"H.R. 1 is for the politicians, not the people https://t.co/OiPz5NsCni","date":"Tue Mar 02 14:29:34 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"“We have a saying in the House: Show me your budget, show me your values.” – Speaker Pelosi","date":"Tue Mar 02 01:03:59 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"America needs open schools, not open borders.","date":"Mon Mar 01 19:31:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thanks for stopping by 1305 Longworth @SteveScalise! You’re always welcome in my office. https://t.co/QigJe1AfX5","date":"Mon Mar 01 17:24:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Learn more about REAL election reform @ https://t.co/8hTjIH85H5 https://t.co/MNFKWmdKbf","date":"Mon Mar 01 15:37:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Democrats wouldn’t cut their earmarks for a Silicon Valley subway and a bridge to Canada, but their COVID bill triggers cuts to your Medicare.\nhttps://t.co/fFrHy8H7Za","date":"Sat Feb 27 17:17:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Washington Democrats’ attacks on biological realities are radically and dangerously outside the mainstream. \n\nThank you @RepMaryMiller for leading this bill to protect women and girls.","date":"Fri Feb 26 23:11:17 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Overreaching policies like Biden's Title IX E.O. and the \"Equality Act\" don’t empower women, they threaten women’s safety, education, and opportunity.","date":"Fri Feb 26 22:14:13 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I was shocked and saddened to hear about Karen Trujillo’s sudden death this morning. My heart goes out to her family, friends, and all the faculty and staff of Las Cruces Public Schools.\n\nhttps://t.co/fRQZkiezey","date":"Fri Feb 26 17:22:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"25¢ of every $1 Congress already approved for COVID relief remains unspent.\n\nStill, Democrats are demanding more. https://t.co/RQn06EDAoJ","date":"Fri Feb 26 15:34:31 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The #BidenBailout rewards the states that voted for Biden… except New Mexico. https://t.co/jBPRMQ9gff","date":"Wed Feb 24 22:28:31 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Tune-in tomorrow @ 7AM New Mexico time!","date":"Wed Feb 24 19:57:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Here’s a whopper… $12 BILLION in foreign aid?! CUT.","date":"Wed Feb 24 19:28:18 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"How about the $135M for the National Endowment for the Arts? $135M for the National Endowment for the Humanities? $200M for the Institute of Museum and Library Services? CUT. CUT. CUT.","date":"Wed Feb 24 17:10:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Let’s start with the EARMARKS. $112 million for a subway in Silicon Valley? CUT. $1.5 million for bridge to Canada? CUT.","date":"Wed Feb 24 17:10:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The president asked yesterday “what would you have me cut?” from Democrats’ bloated COVID bill. \n\nWell, #BidenChallengeAccepted!","date":"Wed Feb 24 17:09:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@RepDLamborn, @RepJimBanks and I introduced a resolution yesterday to condemn BIG TECH for censoring conservative voices.\n\nWe demand an end to their discriminatory practices. https://t.co/8KbGshpm3b","date":"Wed Feb 24 14:27:51 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"RT if you agree: No taxpayer $$ for campaign ads","date":"Tue Feb 23 19:51:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If $129 billion is urgently needed to get our schools open, why is only 5% of the money in the COVID bill for this year? 🤔","date":"Tue Feb 23 15:28:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"FACT: $1 trillion of COVID relief — 25¢ of every $1 already approved by Congress — so far remains unspent.","date":"Mon Feb 22 21:44:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"If your child’s school refuses to open, CARES Act money should help you send them to one that will.","date":"Mon Feb 22 18:58:48 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"H.R. 1 is for the politicians, not the people. https://t.co/IjyAxZyBVa","date":"Mon Feb 22 16:13:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Bill aims to exempt New Mexico from President Biden's ban on new oil and gas leases https://t.co/qutL7MgTyV","date":"Mon Feb 22 13:36:10 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Until the lockdowns and emergency declarations have ended, border health protections must remain in place to prevent the introduction of new cases and new strains of COVID at our borders.\n\nMore: https://t.co/TTa5o3aFQX https://t.co/tbJNz27K1k","date":"Sun Feb 21 20:39:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"H.R. 1 makes reforms for the politicians, not for the people.\n\nWe need real election reform. That’s  why I’m an original cosponsor of the Save Democracy Act introduced by @RepublicanStudy Chairman @RepJimBanks \n\nhttps://t.co/0Sv5wcJgFX","date":"Sat Feb 20 15:38:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The Biden admin's actions could soon lead to a health crisis at the border, and surrounding communities, causing widespread COVID-19 infections and fatalities.\n\nhttps://t.co/QM3xsAXrHI","date":"Fri Feb 19 22:03:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"🧑‍🔬 Follow the Science\n\n👩‍🏫 Open the Schools","date":"Fri Feb 19 18:28:39 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"As more than 50 of my colleagues and I wrote to @POTUS last week, Title 42 may now be the only policy ensuring the southern border is not immediately rushed. \n\nMore: https://t.co/TTa5o3aFQX https://t.co/MTr2mpU1wL","date":"Fri Feb 19 15:14:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Drill more here: 🇺🇸 Pay less here:⛽️","date":"Thu Feb 18 21:40:44 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Five county sheriffs in NM-02 wrote in support of my bill to prohibit the Biden admin from rescinding a critical border health protection commonly known as Title 42.\n\nMore: https://t.co/FNTIo6fxtz https://t.co/VSlmKieIXl","date":"Thu Feb 18 20:03:08 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"A federal wage mandate beyond the increases New Mexico has already enacted will be the final blow to family-owned restaurants, hardware stores and other small shops across our state. https://t.co/Z2mdcEYn1k","date":"Thu Feb 18 17:55:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"After a journey of nearly 300 million miles, @NASAPersevere lands on Mars today. Live coverage begins this afternoon, with landing scheduled for 1:55 PM New Mexico time.\n\n📺: https://t.co/2ibr2fHAAH","date":"Thu Feb 18 16:15:19 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The opportunity to serve in a leadership role on the Energy and Mineral Resources Subcommittee is both an honor and a reminder of how important these issues are to New Mexico.","date":"Wed Feb 17 20:46:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Rush Limbaugh’s contribution to the conservative movement was extraordinary. His domination of the airwaves sparked important debate and inspired so many Americans to engage in politics. His voice will be sorely missed.  https://t.co/UTtou8wSzY","date":"Wed Feb 17 18:52:58 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Any pandemic relief bill should be:\n\n☑️ Targeted\n\n☑️ Temporary \n\n☑️ Tied to COVID","date":"Wed Feb 17 18:28:02 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"RT if you agree: American citizens and legal immigrants should be able to get the COVID vaccine before illegal aliens.","date":"Wed Feb 17 00:51:32 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"This is money in the classroom. It has an effect on our children’s education, teachers’ salaries, infrastructure projects, and services people depend on the government for. \n\nThe #BidenBan is bad for New Mexico. https://t.co/pm97E8jfyv","date":"Mon Feb 15 18:12:54 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Acquitted. Again. 👍🏻","date":"Sat Feb 13 22:44:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I supported @ByronDonalds amendment today @GOPoversight markup of the Democrats’ COVID bill. \n\nWe should NOT prioritize illegal aliens for vaccines ahead of American citizens and legal immigrants. https://t.co/96hLKBXuat","date":"Sat Feb 13 01:55:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Other energy jobs aren’t going to backfill the oil &amp; gas jobs lost under the #BidenBan, and they certainly won’t be able to compete with the salaries our oil field workers are able to provide for their families. https://t.co/6ZLTKhqwAM","date":"Fri Feb 12 19:03:27 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Hi @GovMLG, I hear you’re meeting with @POTUS tomorrow. What a great opportunity to tell him how his leasing ban will harm New Mexico! I’ll be in DC tomorrow as well. Why not come by my office and we can talk about it? https://t.co/BFeNWPcnsT","date":"Thu Feb 11 21:59:02 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"President Biden, with just the stroke of his pen, seems hell bent on plunging America into another immigration crisis.\n\nhttps://t.co/ITqEAYbuoF","date":"Thu Feb 11 15:55:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I’m proud to lead the POWER Act to protect our jobs and our children’s future. https://t.co/z9jAlPtDw4","date":"Wed Feb 10 23:20:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Biden's immigration policies send a message that our borders are open.\n\nhttps://t.co/PHrqp1mT6j","date":"Wed Feb 10 20:56:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Title 42 — which my first bill aims to keep in place — is perhaps the only policy ensuring the southern border is not immediately rushed. \n\nMore than 50 of my colleagues agree: If Title 42 is rescinded, the daily illegal flow will become catastrophic overnight. https://t.co/l1uyvy5BZE","date":"Wed Feb 10 18:49:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In my district, which includes 180 miles of the border, we’ve seen the efforts of the Trump admin work. Now there’s grave concern about the effect of Biden’s policies.\n\nI joined @RepChipRoy and my @RepublicanStudy colleagues on this letter to @POTUS \n\nhttps://t.co/T1iKqQl2dN","date":"Tue Feb 09 23:54:40 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@mrrfletcher I have introduced one bill to exempt New Mexico from the moratorium and another bill to block the president’s ability to ban new energy leases in any state without the approval of Congress. \n\nhttps://t.co/cePqTDzd0z","date":"Tue Feb 09 19:27:24 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Other energy jobs are not going to backfill the oil and natural gas jobs the #BidenBan could cost New Mexico. https://t.co/sB7zJGEqt5","date":"Tue Feb 09 15:24:53 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Saddened to hear of the passing of Congressman Wright. Ron loved the Lord, our country, and his family. He will be missed.","date":"Mon Feb 08 18:40:28 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"To report suspected human trafficking to federal law enforcement, call:\n\n1-866-347-2423","date":"Mon Feb 08 00:07:09 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thankful for the firefighters for their quick response in getting this fire contained.","date":"Sun Feb 07 21:14:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"President Biden has decided to use executive action to disregard the law passed by Congress and signed by President Trump.\n\n@GOPoversight letter to Secretary Mayorkas ⤵️ https://t.co/kLkgm7Xb8H","date":"Sun Feb 07 18:03:46 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"President Biden’s swift measures are putting thousands of Americans out of work in the middle of a pandemic, the exact opposite of what he promised on the campaign trail.","date":"Sat Feb 06 18:03:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"In New Mexico alone, the #BidenBan could cost more than 60,000 jobs by 2022.","date":"Fri Feb 05 21:39:22 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you @GOPLeader for the opportunity to share a unique perspective from New Mexico on The Starting Line blog today. \n\nhttps://t.co/TeAgKUundt","date":"Fri Feb 05 18:56:30 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The death of any law enforcement officer in the line of duty is a reminder of the debt we owe the brave men and women who stand in the gap to protect us from evil. My prayers go out to Officer Jarrott's family and fellow officers.\n\nhttps://t.co/LqUgPWrU6C","date":"Fri Feb 05 16:17:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The #BidenBan replaces a lot of good-paying jobs with a lot fewer lower-paying jobs. \n\nhttps://t.co/1Aveud3dUs","date":"Thu Feb 04 23:34:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Revenue from oil &amp; gas accounts for more than a third of our state's annual budget — including more than $1 billion for state school systems.\n\nThe #BidenBan is bad for New Mexico.","date":"Thu Feb 04 21:23:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you, Ranking Member @RepJamesComer. \n\nThe border wall slows the flow of drugs and people. It gives the Border Patrol another tool in its tool kit to confront immigration crises and national security threats.","date":"Thu Feb 04 15:52:36 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My PAUSE Act would keep border health protections in place until all COVID-19 restrictions on American citizens are lifted. It is unfair to open our borders while our schools and businesses remain locked down.","date":"Thu Feb 04 01:21:02 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"President Biden's actions invite more illegal immigration and risk introducing new cases and new strains of COVID-19 into our communities. \n\nhttps://t.co/d0achB9BVG","date":"Thu Feb 04 01:20:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Paid my respects to USCP Officer Brian Sicknick this morning in the Capitol Rotunda. My prayers are with his family and colleagues. https://t.co/IuoQDEsBbC","date":"Wed Feb 03 18:26:15 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Spotted this today during a visit to the Port of Houston with my colleagues. \n\n@GOPLeader is right: Energy should be made in America, by American workers, for American families. https://t.co/6WsfEufiBP","date":"Tue Feb 02 22:24:11 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Terrible news out of Florida this morning. My prayers are with the families and fellow officers of the agents killed and injured in the line of duty today. \n\nhttps://t.co/Iea8Ff2pWA","date":"Tue Feb 02 16:26:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"For the left-wing activists: \n\n❌rejoining Paris won’t be enough,\n❌cancelling KXL won’t be enough,\n❌banning drilling on federal lands won’t be enough. \n\nThese leftist radicals won’t stop until we’re fully dependent on foreign nations for our energy.","date":"Tue Feb 02 13:53:05 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"As @SteveScalise and I said last week:\n\nWhen Washington radicals ban drilling on federal lands, Americans lose their jobs. \n\nIn New Mexico, the #BidenBan could destroy over 60,000 jobs by 2022. https://t.co/ksZMGV8ypi","date":"Tue Feb 02 00:26:07 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"According to @BLS_gov, in 2019 a worker installing solar panels made an average of a little more than $21/hr. \n\nWorkers in oil and gas extraction made more than twice as much, at an average of over $42/hr.\n\nhttps://t.co/dkXQSnEVOR","date":"Mon Feb 01 18:43:29 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The border wall protects ranchers, farmers, and families in our communities. Halting construction puts everybody at risk. https://t.co/V54gmlqopD","date":"Mon Feb 01 14:49:58 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My PAUSE Act ensures we have open signs on our businesses not our border. \n\nhttps://t.co/oIqTpahXmL","date":"Sun Jan 31 23:44:55 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I’m proud to lead the POWER Act to protect our state’s jobs and our children’s future.\n\nhttps://t.co/7D4i4KIWYf","date":"Sun Jan 31 22:06:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Until all the lockdowns are lifted, border health protections must remain in place to prevent the introduction of new cases and new strains of COVID at our borders.\n\nhttps://t.co/kfDweTi0IL","date":"Sat Jan 30 19:11:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"I'll be on @FoxNews just after 10AM New Mexico time this morning to talk about my bills to protect our jobs and communities from President Biden's executive actions.","date":"Sat Jan 30 16:50:56 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Proud to represent New Mexico on @NatResources!","date":"Fri Jan 29 20:55:52 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Weird how some think physical barriers work in DC but not at the border. 🤔","date":"Fri Jan 29 18:09:34 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It is my honor to have brought my #ProLife values and my Christian values to Washington, DC.","date":"Fri Jan 29 15:52:12 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The majority of Americans agree: \n\nNO taxpayer $$$ for abortions at home or abroad.","date":"Fri Jan 29 14:31:42 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Under Biden’s plan to restrict oil and gas development, New Mexico is projected to lose 60,000 jobs — 7% of the entire employed state workforce.\n\nRead more in my op-ed with Republican Whip @SteveScalise: \nhttps://t.co/wnSuhFhjQr","date":"Thu Jan 28 17:34:47 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico’s economy and budget depend on how federal lands are managed. We’ve already seen how Pres. Biden’s executive overreach threatens our state. I’m proud to serve on @NatResources &amp; @GOPoversight to protect New Mexico’s future.","date":"Wed Jan 27 01:00:38 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Most Americans oppose taxpayer funding for abortions. I will oppose any spending bill that weakens or eliminates the Hyde Amendment. #SaveHyde","date":"Tue Jan 26 22:26:14 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"What was the purpose of closing our businesses, conforming to masks, not educating our children?\n\nWe’ve been in lockdown for nine months for naught if we’re going to allow people with coronavirus into our nation. \n\nhttps://t.co/kfDweTi0IL","date":"Tue Jan 26 20:40:27 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"It would be fundamentally unfair to keep American citizens on lockdown while allowing unfettered entry at the border.","date":"Tue Jan 26 17:29:37 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"The PAUSE Act already has 30 cosponsors and is supported by @NumbersUSA, @FAIRImmigration, @Heritage_Action.","date":"Tue Jan 26 17:28:26 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"My first bill - the PAUSE Act - ensures border health protections remain in place until: \n\n- All COVID-19 lockdowns end;\n\n- All public health emergencies for COVID-19 end; and\n\n- CDC's traveler health risk level for Canada &amp; Mexico is reduced to Level 1.\n\nhttps://t.co/aAZUwcFDZG","date":"Tue Jan 26 17:23:41 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"@Martha_Barcena @lopezobrador_ It was also an honor to speak today with Ambassador Quiñónez (@EmbaGuateUSA) and Ambassador @LuisFSuazo (@EmbHondurasUSA). It is important to engage our regional partners to address migration issues.","date":"Tue Jan 26 00:50:21 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Thank you for the time today Ambassador @Martha_Barcena. I look forward to working with you. Please send my best wishes to your President @lopezobrador_ for his recovery.","date":"Tue Jan 26 00:43:20 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":".@POTUS has banned new oil and gas leases on federal land for 60 days. \n\n@GovMLG, what are your plans to make up for the loss in jobs and revenue our state will experience if an additional leasing ban is put in place? \n\nhttps://t.co/yETD7bKYdb","date":"Mon Jan 25 21:07:45 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"Oil &amp; gas revenue accounts for 20% of our state's budget. President Biden's ban on new leases would be devastating for New Mexico. \n\nhttps://t.co/i503BBNyo5","date":"Sun Jan 24 20:11:50 +0000 2021","user_id":"1344416719260016641"},{"handle":"RepHerrell","text":"New Mexico stands to lose more than 60,000 jobs and billions of dollars in state revenue if Biden's ban becomes permanent. \n\nI will be taking further action in the coming weeks to protect our jobs and our state.","date":"Sat Jan 23 23:06:55 +0000 2021","user_id":"1344416719260016641"}]