[{"handle":"RepHuizenga","text":"Prayers and well wishes to @1450whtc's @gstevensholland. I hope you have a full and speedy recovery from your upcoming surgery.","date":"Thu Jun 16 14:54:04 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"If only my Democrat colleagues on the @FinancialCmte felt the same way.","date":"Wed Jun 15 20:42:56 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"The decision to raid a home in Allendale, Michigan and arrest a Michigan Gubernatorial Candidate the same day Democrats are holding a primetime nationally televised hearing is not only suspicious it is disturbing. (2/2)","date":"Thu Jun 09 22:19:54 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"I have consistently warned about political theatrics taking place in Washington, DC. Rarely are there coincidences in politics. (1/2)","date":"Thu Jun 09 22:19:54 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"@lexie_petrovic has the graphic detailing soaring gas prices across #WestMichigan. https://t.co/euXbanDDai","date":"Wed Jun 08 13:44:58 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Memo to Senator Stabenow: \"As gas prices continue to climb, Michiganders turn to budgeting strategies\" reports @wwmtnews. https://t.co/zo5oJkObZ2","date":"Wed Jun 08 13:44:57 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":". @GaryGensler, read these tweets: stop proposing rules that are harmful to our capital markets; protect investors; have the full @SECGov commission testify before Congress; allow comment periods longer than 30 days; stop using regulation by enforcement for digital assets.","date":"Tue Jun 07 19:57:59 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"78 years ago today, brave men from across America stormed the beaches of Normandy on #DDay and changed the course of history. May God continue to watch over the heroes that made this perilous journey and may we #NeverForget those who made the ultimate sacrifice so we can be free. https://t.co/6OqYXef2Rr","date":"Mon Jun 06 17:28:22 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Jennifer Granholm and Joe Biden have brought California fuel prices to Michigan. Both gas &amp; diesel prices have hit all-time highs according to AAA. The Dems’ war on American energy is making it more difficult for families, farmers, and #SmallBiz to make ends meet across Michigan. https://t.co/rdkr6C2FfD","date":"Sat Jun 04 15:13:32 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Leaving the Detroit Regional Chamber’s Mackinac Policy Conference and there is a stark reminder of how Joe Biden’s failed energy policies are impacting families, tourism, and small businesses across Michigan. https://t.co/GgY11mas99","date":"Thu Jun 02 18:34:54 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today we remember and honor those who made the ultimate sacrifice while serving our nation. May God continue to watch over the families of these heroes, our veterans, and members of the Armed Forces currently defending our freedom. https://t.co/F7owAD46AM","date":"Mon May 30 18:55:15 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":". @garygensler continues to push forward with his radical, liberal agenda, yet @fscdems won’t conduct basic oversight. I have called for a full @secgov commission hearing to discuss these (and other) issues impacting our capital markets. https://t.co/iYWFbGGJzV","date":"Thu May 26 14:00:49 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Agreed @CandylovesPete but what happens when a federal court and the ACLU steps in and says “that isn’t fair” therefore the ballots must be counted??","date":"Sat May 21 13:00:30 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"By overturning PA st law &amp; court precedent this ruling fuels speculation of a broken voting system: Federal appeals court says undated Pa. mail ballots should be counted, a decision that breaks with state courts and could have immediate impact https://t.co/vgXJ6eqIpl","date":"Sat May 21 12:35:50 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Just as bad @elonmusk is when publicly traded companies are forced by new @SECGov rules to disclose information that isn’t relevant or material to their operations… if they can even track it. Oil company? Material info. Car company? Maybe. Social media company?Not material.","date":"Wed May 18 17:45:41 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is the reality of the #BidenBorderCrisis","date":"Tue May 17 13:45:28 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"My colleagues and I are calling on the Biden Administration to properly and seriously address the baby food shortage. As for Democrats in Congress waiting until May 25th to hold a hearing that is too long for families to wait. Families deserve answers now https://t.co/CJdYZCQLR1","date":"Thu May 12 16:11:46 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"This was the scene yesterday morning at a local store in Grandville, Michigan. It’s unacceptable that the Biden Administration is sending pallets of hard to find baby formula to the border but families in Michigan are facing shortages. https://t.co/KhOOjQJhEy","date":"Thu May 12 16:11:45 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"As gas prices continue to push record highs in #WestMichigan and across the nation, the Biden Administration continues to make it more difficult to unleash American energy. It's another missed opportunity to provide relief to families, farmers, &amp; #Smallbiz https://t.co/ad4StJkqjw","date":"Thu May 12 14:42:39 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great news! Tonight the House unanimously passed my #SmallBiz legislation 419-0! Approximately 98% of businesses in Michigan are small businesses. We need to work to ensure small biz has a level playing field against the “big guys” &amp; my legislation, HR 935, will help do that!","date":"Wed May 11 22:25:11 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"I'll be speaking on the House floor shortly about my legislation to help #SmallBusinesses! Tune into @cspan now! #SmallBiz","date":"Tue May 10 19:49:30 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"We should not applaud @GaryGensler for this decision. Instead of playing games, @SECGov should focus on its core mission to protect investors, maintain fair markets, &amp; facilitate capital formation. I look forward to restoring congressional oversight soon. https://t.co/hqslSarZd6","date":"Mon May 09 16:35:54 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Why are Democrats protecting @GaryGensler and the @SECGov? American investors deserve answers from the people tasked with overseeing our capital markets. Congress should fulfill its constitutional role to conduct oversight. Read my letter with @PatrickMcHenry below. https://t.co/N3szqMOJ9F","date":"Fri May 06 16:08:57 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"#WestMichigan families are definitely feeling the crunch. I hope @federalreserve Chair Powell is right …","date":"Wed May 04 20:16:57 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":". @WOODTV reports: \"We are paying the most expensive price at the pump on record here in #WestMichigan.\" @cathymcmorris, @HouseCommerce any update from Secretary Granholm on the Biden Administration's plan to unleash American energy production to lower prices? https://t.co/svqVmkdh4P","date":"Wed May 04 18:13:02 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Again, Congress should not cede its authority to @GaryGensler. The @SECGov’s desire to use regulation by enforcement to provide \"clarity\" for digital asset market participants is a power grab. We need responsible solutions, not edicts from bureaucrats https://t.co/G6XFf07thL","date":"Tue May 03 22:17:40 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"This unprecedented leak of a draft ruling is an effort to overtly inject politics into the court itself. This individual should not be celebrated. They should be held accountable for their egregious breach. (2/3)","date":"Tue May 03 01:46:17 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"I am praying for the safety of all the Justices during these extraordinarily challenging and unprecedented times.    (3/3)","date":"Tue May 03 01:46:17 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"If reports are true and a majority on the Supreme Court have ruled to rectify Roe, it is the correct decision, and I hope they release the majority opinion as soon as it is finalized. (1/3)","date":"Tue May 03 01:46:16 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Original story via @FoxNews  https://t.co/naw3GkUGBB","date":"Mon May 02 19:59:02 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"🚨 As part of its Ukraine funding request, @USTreasury is asking Congress to approve lending up to $21 billion to an IMF climate change slush fund that is backed by China – only a tiny fraction could be used to help Ukraine, and Russia itself could use the fund in the future.🚨","date":"Mon May 02 19:55:37 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great pick! #GoBlue #GoLions","date":"Fri Apr 29 00:45:02 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":". @cathymcmorris: Remember when Secretary Granholm was asked about her plan to increase oil production in America? She laughed. Since then, prices have soared and left families, farmers, and small businesses in Michigan and across the nation struggling to make ends meet. https://t.co/K25jK9B8fH","date":"Thu Apr 28 17:42:13 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Secretary Granholm has been the key figure implementing Joe Biden's failed energy policies that have caused home heating prices and prices at the pump to soar in Michigan and across the nation. I too am interested in seeing her plan @cathymcmorris!","date":"Thu Apr 28 17:21:09 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"GDP shrinking by 1.4% is the latest example of how the Biden/Pelosi/Schumer agenda has hurt our economy.  Now, Dems are doubling down w/ tax hikes on #smallbiz &amp; families as they face record inflation. This will make our problems worse by weakening economic security for Americans","date":"Thu Apr 28 14:46:33 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Definitely. Especially since there seems to be much more to the story well over a year later …","date":"Wed Apr 27 01:49:34 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Let the mass hysteria in Lib-land commence… @elonmusk has preserved free speech.","date":"Mon Apr 25 19:02:56 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"If someone chooses to wear a mask while traveling that’s their decision, but enough with the coercive mandates from Washington that don’t match the rest of daily life. (2/2)","date":"Mon Apr 18 20:35:12 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Finally. This common sense ruling is long overdue. I have called for and supported legislation ending this overreaching mandate. (1/2) https://t.co/ThPhxSxh8u","date":"Mon Apr 18 20:35:11 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":". @GaryGensler is trying to rewrite existing laws in order to expand his jurisdiction over #digitalasset market participants. Recent, rushed rule-making will expand @SECGov authority, leaving Congress on the sidelines. See @PatrickMcHenry and my response below https://t.co/qtBaDYUn6e","date":"Mon Apr 18 17:15:07 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":".@USTreasury is sitting on $102 million it can immediately deploy for this Ukraine fund, but @IMFNews wants it for a China-led, Russia-backed Resilience and Sustainability Trust. @SecYellen should tell the IMF that rebuilding Ukraine is the priority.","date":"Thu Apr 07 15:59:31 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Hello, Biden administration? This is Oceania calling… we would like our Memory Hole back. \n#doublethink","date":"Wed Apr 06 14:27:43 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congress should be working to create an atmosphere that promotes the free-flow of capital, strengthens job creation, and increases economic growth. Read my full statement on the 10th Anniversary of the #JOBSAct here: https://t.co/1YK7xjDPlD","date":"Tue Apr 05 20:40:24 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congress must build on the work started under the #JOBSAct, so small business startups can continue to grow, expand, and create jobs. Last week, my @FinancialCmte colleagues and I highlighted several rules by the SEC that hinder growth and stifle innovation in our capital markets","date":"Tue Apr 05 20:40:24 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #JOBSAct gave renewed hope for America’s #SmallBiz, startups, &amp; entrepreneurs by removing red tape and fostering new opportunities. Sadly, the Biden Admin &amp; @SECGov don't have a vision for economic growth. They only understand growing the regulatory state, no matter the cost.","date":"Tue Apr 05 20:40:23 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"When I was at the border in Del Rio TX earlier this month our group of 14 members of Congress saw the stress and strain on the men and women of @CBP who are doing their best in an impossible situation. This Admin must give them more support, not make their jobs harder.","date":"Fri Apr 01 02:56:18 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"In yesterday's @FinancialCmte hearing, I pressed Democrats on their unwillingness to hold @GaryGensler's SEC accountable. It is extremely troubling to me that the SEC seems more intent on pursuing highly politicized regulatory undertakings than focusing on its core mission. https://t.co/2czhIRKEhp","date":"Thu Mar 31 20:11:50 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Dean will be missed… Blessings and Peace to his family and friends. #RegularOrder","date":"Wed Mar 30 11:24:17 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"One of my favorites!! We need to show this in Washington again…\n“I’m just an Executive Order, yes, I’m only an Executive Order. And I’m sit’n here at 1600.” Just doesn’t have the same ring to it, does it. #SchoolhouseRock","date":"Sun Mar 27 20:09:30 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Common sense has to return to these transportation situations…","date":"Sat Mar 26 21:36:19 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"That’s why last year @FinancialCmte Ranking Member @PatrickMcHenry and I asked for a Full SEC Commission in person hearing to discuss issues important to American retail investors.","date":"Tue Mar 22 11:54:59 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Chairman of the SEC can appear in person w/ celebrities, but can’t show up in person for meetings. The SEC should not expand its authority to enact Joe Biden’s radical agenda w/o congressional approval. Congress must conduct oversight of the SEC and rein in this overreach. https://t.co/iPRj5VeAt4","date":"Tue Mar 22 11:54:59 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"My East bracket is busted up already so, why not St Peters?!? Congrats and Go Peacocks!! Until you meet Arkansas…@MarchMadnessMBB #MarchMadness","date":"Sun Mar 20 02:54:09 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Incredible! Saint Peter’s is going to the #SweetSixteen! #MarchMadness","date":"Sun Mar 20 02:49:00 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"March Madness continues! Illinois battles back to get the W and avoid the upset! #GoBigTen","date":"Sat Mar 19 01:09:19 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to @RepAnnWagner, @RepFrenchHill, @RepTomEmmer, Rep @WarrenDavidson, @RepAlexMooney, and @RepBryanSteil for joining me in this effort!","date":"Fri Mar 18 19:08:41 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Under Gary Gensler, the SEC continues to promote the Biden Administration’s radical environmental agenda. Congress has not granted the SEC this authority.  The SEC should remain focused on protecting investors not pleasing the far left. Read my letter to the SEC below. https://t.co/bkHFrKYPoC","date":"Fri Mar 18 19:08:40 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"I had KY going into the Elite 8 and getting beaten by UCLA… so this hurt my bracket too! And sorry @RepAndyBarr","date":"Fri Mar 18 01:58:17 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"March Madness living up to its name! Wow! Congratulations Saint Peter’s!","date":"Fri Mar 18 01:45:19 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks for joining on Debbie!","date":"Fri Mar 18 00:21:53 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Vice President of Supervision at the Fed has now been vacant for six months. Now is the time for President Biden to stop playing games and put forth a nominee that will not stray from the Fed's mission of stable prices and full employment. https://t.co/E9qOGisvOt","date":"Wed Mar 16 15:15:51 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Just take a glance… this is the tip of the (financial) iceberg. And now we have the official return of “earmarks” not related to federal projects or federal agencies. I chose to not submit any requests bc I was afraid it would become a spending spree. Sadly, I was proven right.","date":"Thu Mar 10 19:27:36 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Yeah, they should have killed all the horses and destroyed all of the carriages once a “self propelled vehicle” hit the highways. Oh wait, there weren’t any highways. Nor could enough “horseless carriages” be produced to replace all of those horses, not to mention affordability.","date":"Thu Mar 10 17:56:15 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Now @SteveRattner you might want to now explain how the US has ramped up inflation pressures thanks to our massive (over)stimulus programs… once again we are first on a list we don’t want to be on. #BidenInflation @FinancialCmte","date":"Thu Mar 10 17:51:05 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Please tell me that someone @WhiteHouse knows that 4.5% of all vehicles sold in the US are electric and 9% world wide. Everyone involved in the “car biz” from suppliers, OAMs, dealers and technicians know this is a pipe dream. Everyone but the policy makers I guess. #Energycrisis","date":"Thu Mar 10 17:37:52 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"We need to unleash American energy to combat the pain at the pump. It’s becoming clearer by the day that President Biden prefers to cater to the radical left than deliver meaningful relief to families across Michigan and throughout the Midwest.","date":"Thu Mar 10 16:07:36 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"In order to lower prices here at home, we must unleash American energy and innovation. This will strengthen our economy and support our allies. Unleashing American energy would not only save us money at the gas pump, it would make the world a safer and more stable place. (2/2)","date":"Thu Mar 10 04:50:22 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"While I am glad to see Congress come together to ban Russian oil that is only one part of the equation. I call on President Biden to join Republicans in Congress to create an Operation Warp Speed for American energy.  (1/2)","date":"Thu Mar 10 04:48:42 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Americans are facing historic inflation, record prices at the pump, and soaring costs at the grocery store. Unfortunately, this spending package will fan the flames of inflation and send costs surging even higher. (4/5)","date":"Thu Mar 10 04:20:49 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sadly, I have found this bill to be yet another big government monstrosity that is loaded with liberal priorities, contains billions in pork riddled earmarks, and funds Joe Biden’s federal vaccine mandates. (3/5)","date":"Thu Mar 10 04:20:49 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congress must address our nation’s debt crisis, not continue to add to it.  Unfortunately this is yet another missed opportunity for Joe Biden, Nancy Pelosi, and liberals in the House. (5/5)","date":"Thu Mar 10 04:20:49 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"While I support funding for humanitarian and military assistance to Ukraine, that critical funding should have been handled through an emergency supplemental, not lumped in a massive spending package totaling well over a trillion dollars. (2/5)","date":"Thu Mar 10 04:20:49 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Here is my statement 🧵 on tonight’s omnibus. This 2,700+ page bill was released in the dead of the night leaving Congress and the American people little time to read what is actually in the bill. (1/5)","date":"Thu Mar 10 04:20:48 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Whaaa…??? Still wonder if the Biden Admin “gets it” or not?!?\n#BidenInflation #gasprices","date":"Wed Mar 09 22:00:11 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congress must lead, not follow when developing a transparent regulatory framework on #digitalassets. By doing so, we should not stifle innovation or ignore those in our communities who might benefit from these technological innovations, especially the unbanked or underbanked.","date":"Wed Mar 09 18:18:44 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is how out of touch Democrats in Washington truly are. Americans are paying record prices at the pump and Democrats aren’t even discussing a plan to tackle soaring prices.  We need to unleash American energy to lower prices here at home and support our allies abroad.","date":"Tue Mar 08 17:12:56 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"I will be discussing the effects of inflation spurred on by massive spending in the past year &amp; how it has hurt low to middle income families. The citizens of the 2nd Dist have been feeling those effects first hand.","date":"Tue Mar 08 15:17:24 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"👀👀👀 Wondering about WH/Congressional dysfunction?? Must read 🧵","date":"Tue Mar 08 14:13:25 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"It’s encouraging to see @finra and @lseplc step up to halt trading in Russia-based companies. We must continue to use every tool at our disposal to combat Vladimir Putin’s unjust war in Ukraine. These are the actions I have &amp; will continue to call for! https://t.co/azoWJKWJJc","date":"Fri Mar 04 15:40:07 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"The “Green Agenda” reigns supreme for Dems… damn the death, destruction and consequences of funding Putin’s war machine. @HouseGOP has a simple plan: green light the Keystone pipeline and re-open public lands for energy exploration/production. Up to you @SecGranholm","date":"Thu Mar 03 20:58:40 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Changing one word in the name does not make the programs any less damaging or expensive. Just say’n… #BidenInflation","date":"Thu Mar 03 20:51:03 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Amen!!!\nHouse @FinancialCmte Republicans have been asking for the same thing to no avail… this is just foolish.","date":"Thu Mar 03 20:47:51 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Yesterday, I introduced the Russian Sovereign Debt Prohibition Act of 2022. This legislation cuts off another avenue for Vladimir Putin to finance his invasion of Ukraine by preventing U.S. financial institutions from buying and servicing Russian debt. https://t.co/D7tXXp3zBa","date":"Thu Mar 03 12:08:27 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today I stood with my Republican &amp; Democrat colleagues in support of Ukraine. The US must lead in sanctioning Russia’s energy sector and stop buying Russian oil. We must restore American energy leadership to strengthen our economy, lower prices here at home, and help our allies. https://t.co/TqVMP02eIm","date":"Wed Mar 02 01:08:03 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"☑️","date":"Tue Mar 01 17:04:11 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"The move by the @NYSE &amp; @Nasdaq to halt trading of Russia-based companies is a good start. I call on all US-based exchanges to permanently suspend trading of Russian companies until Vladimir Putin ends his unlawful and unprovoked war on Ukraine. More here: https://t.co/I1FcdQKx7c","date":"Tue Mar 01 13:32:00 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sadly, it took the all out invasion of Ukraine for the Germans to meet their NATO obligation today instead of 2024. Will other NATO nations finally fulfill their treaty obligations too?? We need a strong NATO with everyone meeting their obligations.","date":"Sun Feb 27 12:55:53 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"My money is on @Vitaliy_Klychko vs 10 of Putin’s best…\nPraying for my friends and colleagues in Ukrainian Parliment. 🙏🙏🙏#StandWithUkriane","date":"Sat Feb 26 23:07:04 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Putin must be held accountable. We must restore American energy independence to counter Russia, support our allies, &amp; lower costs here at home. President Biden needs to embrace American energy! Watch my full interview on @FoxFriendsFirst: https://t.co/ddsTJyPZXJ #PrayForUkraine","date":"Thu Feb 24 18:20:45 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"See you bright and early @FoxFriendsFirst… OK, maybe just early, and not so bright outside.","date":"Thu Feb 24 02:27:53 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks David! Glad to have you as a partner as we reign in this Administration and the IRS!","date":"Thu Feb 17 18:29:14 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Given the IRS’ history of targeting conservatives &amp; leaking private tax information, the IRS shouldn’t be able to collect biometric data. To stop this overreach, I have introduced a bill w/ @SenRickScott to ban the IRS from collecting any biometrics. https://t.co/lnohhXRKiP","date":"Wed Feb 16 16:41:51 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Matt Stafford! All of us in Michigan just wish this happened while you were still wearing a Lions jersey! #WellDeserved https://t.co/4QgsZrt6NZ","date":"Mon Feb 14 03:09:21 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Inflation is already estimated to cost families an extra $250 a month. Sadly, today’s increase will raise costs even higher. We need the Inflation Prevention Act and sound monetary policy to make sure Washington isn’t making it harder on families. https://t.co/PxKZL60AIB","date":"Thu Feb 10 14:47:43 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":".. and although I am still concerned with the pace of the @SECGov agenda, I appreciate @garygensler listening to my concerns about the short comment periods on previously released rules.","date":"Wed Feb 09 21:35:41 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Shortening the settlement cycle between buying and selling securities is absolutely the right call.  I look forward to hearing from market participants on ways to potentially further strengthen this rule.","date":"Wed Feb 09 21:34:48 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Proud to stand up for our veterans in support of @RepFitzgerald's Vaccine Discharge Parity Act.","date":"Wed Feb 09 17:25:37 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"I am going to continue to push for the #FACEAct to be enacted so the IRS cannot change its mind down the road and create a database that stores the faces of American taxpayers. https://t.co/NNrOtXbkyf","date":"Mon Feb 07 19:41:18 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"THE IRS abandoning its pursuit of facial recognition technology is good news for Americans who are concerned about their privacy and big government overreach. I am proud to have introduced the #FACEAct to ban the IRS from requiring taxpayers to use facial recognition. (1/2)","date":"Mon Feb 07 19:41:17 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"An independent and effective Federal Reserve is one that operates free from political pressure. I look forward to hearing from the nominees that they will not wade into issues that stray from the Fed’s dual mandate. https://t.co/HZ7lIpceix","date":"Wed Feb 02 21:56:09 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"I am completely disgusted to see Amnesty International call Israel an “apartheid” state. Perhaps they should focus on real human rights abusers like China and not fuel the disturbing rise in anti-Semitism. I stand firmly with Israel against this libelous claim.  #standwithisrael","date":"Wed Feb 02 20:23:02 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks Candy! It was a good day. And on to a great year!!","date":"Tue Feb 01 04:51:56 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks Justin, I appreciate the shout out!\n(But I would like to forget the number…🤣)","date":"Tue Feb 01 01:15:32 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to Matt Stafford and the Rams! So many said Stafford couldn’t win the big ones. Now he’s going to be playing in the Super Bowl! #WellDeserved","date":"Mon Jan 31 02:41:52 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"For too long, the Federal Reserve has chosen artificially low interest rates, as opposed to free-market principles. This foreshadowing by the Fed is an overdue, but necessary first step in returning to a market-based approach to monetary policy. #FORMAct\nhttps://t.co/ubTRqC0qpC","date":"Thu Jan 27 12:29:49 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a grab!!! Touchdown Chiefs!!! Unbelievable! A game for the history books!","date":"Mon Jan 24 02:57:01 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Incredible!!!! Overtime!","date":"Mon Jan 24 02:45:59 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks Fellas for having great convo with very serious issues… good policy and smart politics can be fun! And if we weren’t laughing at this administration, we would be crying…","date":"Thu Jan 20 22:19:39 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sitting in on the latest recording of ⁦@RuthlessPodcast⁩ with ⁦@EliseStefanik⁩ ⁦@SteveScaliseGOP⁩ and Leader McCarthy as they look back on the first year of the Biden Admin and forward to a new Republican majority! #FriendoftheProgrum https://t.co/akyNzx3zaE","date":"Thu Jan 20 19:20:37 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tone deaf again…\n#BidenInflation","date":"Thu Jan 20 13:32:21 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Supreme Court made the right decision to strike down the Biden OSHA Mandate on employers across the nation. However, I’m disappointed SCOTUS did not do the same for the CMS Mandate. I continue to support using the Congressional Review Act to repeal the mandate for all workers","date":"Thu Jan 13 21:51:40 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"The latest U of M survey sadly points out that only 15% of consumers believe their income will rise faster than inflation while 27% of households stated that inflation is already negatively impacting their standard of living. This is not transitory. https://t.co/mJ8vyRaDcH","date":"Wed Jan 12 15:58:48 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Inflation is soaring on Joe Biden’s watch to levels not seen in 40 years! Inflation acts as a tax that makes everything from groceries to gas more expensive. Families across Michigan are paying more and getting less because of Joe Biden and Nancy Pelosi’s out of control spending.","date":"Wed Jan 12 14:56:35 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"If Chair Gensler continues down this path it will become increasingly clear he is pursuing a personal agenda rather than what is best for consumers and market participants.","date":"Mon Jan 10 15:49:54 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"👏👏👏#GoLions!","date":"Sun Jan 09 18:45:18 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"@DKool23 Congratulations!","date":"Tue Jan 04 00:02:20 +0000 2022","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Central Michigan University on your first bowl game victory in nearly a decade! what a great way to end the season! #FireUpChips","date":"Fri Dec 31 21:05:22 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to #MSU on showing grit and making big plays late in the game to earn that bowl win. #GoGreen #BigTen","date":"Fri Dec 31 03:44:15 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Pick 6 pick 6! Touchdown MSU!!!! #GoGreen!","date":"Fri Dec 31 03:35:34 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a catch!!!! Touchdown MSU!!!!!","date":"Fri Dec 31 03:25:34 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Merry Christmas!","date":"Sat Dec 25 17:01:10 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"I’m sorry to see this happen to a colleague, but we should be sorry to see this happen to anyone… there are real world consequences to policies that pull cops off the streets.","date":"Thu Dec 23 15:00:07 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"I join @HesterPeirce  and many others in thanking Commissioner Roisman for his service to our country as well as his dedication to a common sense approach for the SEC.","date":"Mon Dec 20 23:40:42 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The real problem is that added regulations (many of which you have pushed) have forced those small, often rural community banks to consolidate and merge before they go out of business. Dodd/Frank cause the big banks to get bigger.","date":"Fri Dec 17 19:51:31 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is a great day for families in Michigan and across the nation who have been worried about the safety of their loved ones. (2/2) #Haiti","date":"Thu Dec 16 16:22:55 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today is the day we have been hoping for, praying for, and working so hard to achieve. I want to thank members of the hostage negotiation team for their diligence in securing the safe release of all the hostages. (1/2) #Haiti","date":"Thu Dec 16 16:22:54 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Looking forward to joining @FoxBusiness this evening with @SeanDuffyWI and @PatrickMcHenry at 5:45 ET. Tune in!","date":"Wed Dec 15 22:36:40 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Birthday @WOODradioSteve! As @MrJustinBarclay says, make it a great one!","date":"Sat Dec 11 13:38:23 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Prior to today's record rise in inflation, a @GallupNews survey from last week found that 45% of US households are experiencing hardship from inflation including 71% of low income families. Sadly this # will rise further due to POTUS' out of touch agenda. https://t.co/fwnpMTeiGx","date":"Fri Dec 10 14:48:16 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Inflation acts as a tax on every American. This \"tax\" hits low income families &amp; fixed income seniors the hardest.  With inflation reaching its highest level since 1982, President Biden &amp; Speaker Pelosi should not make the problem worse by spending trillions more.","date":"Fri Dec 10 14:48:16 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"“Bank regulator erupts in partisan split as Democrats go rogue” via @SylvanLane in the @thehill https://t.co/ntelKD9qb4","date":"Fri Dec 10 01:51:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Chair Waters should immediately call a hearing investigating this unprecedented action by rogue commissioners at the FDIC. With 88 years of independence, there must be accountability for this brazenly political action.","date":"Fri Dec 10 01:45:18 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"I’m honored to have known Carol and to call her a friend. She is fondly remembered and deeply missed! Today, I’m so pleased to support the CAROL Act, which will help ensure other families will not have to face the tragedy of valvular heart disease effecting their loved ones.","date":"Wed Dec 08 19:12:07 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy to join you, Andy, on voting yes! This is a positive step towards rebuilding our military.","date":"Wed Dec 08 03:30:40 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Protecting personal liberties &amp; stopping an overbearing government are two of the main reasons I ran for Congress. I will continue to stand up for West Michigan workers, families, small business owners, and healthcare providers by fighting against these coercive mandates. (8/8)","date":"Sat Dec 04 20:47:59 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"However that bill lacked explicit legal definitions for what “modernization” meant. The Immunization Infrastructure Modernization Act actually limits what the Biden Administration can do using American Rescue Plan funding. (6/8)","date":"Sat Dec 04 20:47:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"I have consistently opposed federal vaccine mandates and vaccine passports. In fact, I am an original cosponsor of H.J. Res 65, which would overturn OSHA’s vaccine mandate. (3/8)","date":"Sat Dec 04 20:47:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The state-level IIS databases have been in use for decades. This legislation actually bolsters their cyber defense, enhances the privacy of Americans, and prevents the Biden Administration from repurposing the IIS and using it to enforce vaccine mandates. (7/8)","date":"Sat Dec 04 20:47:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"I have also help lead efforts to overturn the CMS vaccine mandate as well as support legislation blocking mandates for federal employees and contractors. (4/8)","date":"Sat Dec 04 20:47:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This legislation is necessary because when President Biden’s first multi-trillion dollar proposal called the American Rescue Plan, which I voted against, was enacted it included funding to modernize IIS databases. (5/8)","date":"Sat Dec 04 20:47:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Immunization Infrastructure Modernization Act HR 550 is in no way, shape, or form related to a federal vaccine database or vaccine passport. In fact, the data contained in these state run systems has had all personally identifiable information removed from it. (2/8)","date":"Sat Dec 04 20:47:57 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"There has been a lot of misinformation about a vote on HR 550 that I took earlier this week and I wanted to clarify what the bill does and does not do. (1/8)","date":"Sat Dec 04 20:47:57 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"@WhitneyOnAir One of the best days of the year! #ForeverHomes #StrongerFamilies","date":"Thu Dec 02 16:50:29 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"When Joe Biden can't even secure chicken tenders how is he going to secure the southern border?","date":"Thu Dec 02 16:38:34 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was great to join you today. Thank you for your work to promote cooperation and build even stronger ties between the United States and the Kingdom of the Netherlands!","date":"Wed Dec 01 22:43:14 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This has been a constant theme for many of us in committee hearings, media interviews and basically anywhere we can get someone to listen… I’m glad @federalreserve officials finally have gotten the message that hard working Americans have been sending!","date":"Wed Dec 01 14:38:07 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Badger is a national historic landmark that creates jobs and generates millions in economic activity. The UIA’s failure is historic for wasting billions in taxpayer dollars.","date":"Tue Nov 30 23:00:46 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is one among a number of examples where “Bad Actors” reaped BILLIONS in IMF money, all backed by House and Senate Dems, and questioned by many of us on the other side of the aisle. Time to clean this up!","date":"Tue Nov 30 16:41:17 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"I have long argued against the use of proxy voting. I believe it raises serious questions. R's and D's are both abusing this system. Members of Congress should show up in person to vote. Proxy voting should be abolished.","date":"Mon Nov 22 14:26:39 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Amen @AriFleischer We need to understand that even when we retake the House majority, unfortunately the Biden/Harris/NewPerson Administration will have two more years of blocking our House efforts. We will need to be unified and selective on our “must do” initiatives.","date":"Fri Nov 19 13:53:16 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The white books are the BBB text. The tan books are the Comm Reports on the bill, explaining what is in the bill. And your standard iPhone 13 for scale. We are voting on the rule now and the bill around 10pm. Plenty of time to digest the details… pass the Tums. #BuildBackBroke https://t.co/5m0T9f5bWu","date":"Fri Nov 19 00:36:18 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great to see you again @ChristaMarkwald and catch up on our countries mutual economic goals among other issues! #AmSwissFoundation","date":"Fri Nov 19 00:21:03 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"👀🚨 while claiming to be fighting for hardworking taxpayers, dems appear to be all in on tax breaks for coastal elite millionaires.","date":"Thu Nov 18 16:16:34 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Watching interview with Mark Zandi on @MorningsMaria and am dumbfounded how he has any credibility left… a pure apologist for #BBB who is in denial about the debt it will create. “If people like these expiring programs, THEN we will pay for them!” Yeah, that’s how DC works.","date":"Wed Nov 17 13:20:29 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"👀","date":"Mon Nov 15 22:34:16 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"I agree Senator Manchin. This tweet lays out why you should vote against President Biden and Nancy Pelosi's reckless multi-trillion dollar spending proposal which will make the situation even worse. #buildbackbroke","date":"Fri Nov 12 17:03:29 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"A great evening in Muskegon honoring and celebrating #WestMichigan veterans. Thank you to all who have served our nation! https://t.co/aa5vApajLP","date":"Fri Nov 12 01:20:27 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to the @montwildcats students, teachers, and staff for putting together a wonderful program to honor, remember, and celebrate our veterans! #WestMichigan https://t.co/NbfNX1b70W","date":"Thu Nov 11 20:21:07 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 246th Birthday to the @USMC! Thank you to all of the incredible men and women who have put on the uniform in service to our nation and been a force for good! #ThankYou #GodBless #WestMichigan https://t.co/oZMUxdNCR1","date":"Wed Nov 10 15:54:39 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"There was a more targeted and cost effective way to do infrastructure that was rejected by the WH and Speaker Pelosi. I will not support legislation that spends more than necessary and opens the door for trillions upon trillions of spending on liberal and socialist priorities.","date":"Sat Nov 06 03:44:20 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tonight's vote is a bridge to the \"land of reckless spending.\" By tying infrastructure together with their estimated $4 trillion spending spree, President Biden, Speaker Pelosi, and Democrats have created a $5.2 trillion monstrosity.","date":"Sat Nov 06 03:44:20 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Neither do her former constituents in Michigan… now you all know what we had to suffer through for her 8 years as Governor.","date":"Fri Nov 05 22:37:48 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Biden Administration believes there are still up to 14,000 legal permeant residents trapped in #Afghanistan. This is in addition to US citizens left behind enemy lines as well as the Afghan interpreters who helped save American lives. Just shameful. https://t.co/0Ymrn3CprH","date":"Fri Nov 05 13:43:32 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Biden Administration is looking to give $450,000 checks funded by American taxpayers to illegal immigrants while families, restaurants, and small businesses across Michigan continue to struggle. This is how out of touch President Biden’s agenda truly is.","date":"Fri Oct 29 17:04:34 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Watching @POTUS right now who claims this “framework” is a consensus. Let’s be clear, it is (potentially) a consensus among the majority Democrats, not a consensus among both parties. #BuildBackBetter = #BuyBackVotes","date":"Thu Oct 28 15:48:06 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Rescind the memo! Even the National School Board Association has admitted they cannot justify some of the language used in their own letter. #WestMichigan parents are not domestic terrorists. AG Garland should rescind his memo today. \n\nhttps://t.co/FbdpjLJMe5","date":"Wed Oct 27 17:07:12 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is why we won’t have a vote on a Infrastructure bill this week, as “promised” to Dem “moderates” by the Speaker, and why it most likely won’t happen next week either. Must read thread. #BuildBackBetter = #BuyBackVotes","date":"Wed Oct 27 14:51:23 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"While Congress must do so much more to hold the Biden Administration accountable for what happened in Afghanistan, passing this bipartisan bill to honor those who made the ultimate sacrifice while serving our nation was the right thing to do https://t.co/ALGB6oPlA5","date":"Tue Oct 26 21:37:29 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Last night, the House passed a gold medal bill to bestow the highest congressional honor on the 13 soldiers who were killed in Afghanistan on August 26th. I proudly cosponsored this legislation.","date":"Tue Oct 26 21:37:29 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Inflation isn't a \"high class\" problem as the Biden Administration has said. Inflation and rising costs are something every family in #WestMichigan has to contend with. Washington shouldn't make the problem worse but that is precisely what the Democrat spending spree will do.","date":"Wed Oct 20 14:55:34 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Knowing Dr. Dan, he would have rather stopped and joined you than continue on with the parade! A good man who will be missed…","date":"Mon Oct 18 14:46:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Dan Benishek was a man who cared about his community, state and country. He was a cheerful advocate who fought with passion for common sense UP values. I am proud to call Dr. Dan a friend &amp; he will be deeply missed. My heart goes out to his wife Judy, his family, &amp; Team Benishek.","date":"Sun Oct 17 01:54:41 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Welcome to Dr. Roberts! Keep up the great work and legacy of The Heritage Foundation!⁩ The Heritage Foundation Names Dr. Kevin Roberts Next President | The Heritage Foundation https://t.co/nhR7PxI2dT","date":"Thu Oct 14 16:34:16 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Please, oh please, oh PLEASE keep talking like this @RonaldKlain bc you continually emphasize how wildly out of touch you are with real America. Only in your world does inflation hit just “the high class” and trillions in spending “costs ZERO”… smh.","date":"Thu Oct 14 14:00:14 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 246th Birthday to the @USNavy! Thank you to the incredible men and women from #WestMichigan who have served as well as those who continue to serve!","date":"Wed Oct 13 22:45:50 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sooo… lots of Billionaires hiding their money in “on shore” $600 gift cards and checking accounts…???","date":"Wed Oct 13 16:30:57 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"And again, all for a “rule vote”, not an actual piece of legislation, that gives a blank check for the debt ceiling. Much harder to miss an actual vote… unless you can use COVID as an excuse to not do your Constitutional duty. \nSee ya on the floor! Or at least some of you…","date":"Tue Oct 12 18:38:14 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"More to this clip on #crypto than the Dimon quote so worth a quick watch.","date":"Tue Oct 12 11:07:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Unbelievable… I’m flying into DC tmrw so I can vote, NOT on an ACTUAL bill that allows unfettered new spending, but on a “rule vote” dealing with education, nursing mothers (another sad political game TBH) &amp; that “deems passed” the debt ceiling increase. What a bunch of cowards.","date":"Tue Oct 12 00:19:20 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Was just on a local Chamber of Commerce legislative update Zoom this morning discussing that exact point… plenty of jobs available, just need people ready and willing to work! Time for my “Patriot Bonus” tax credit bill to help incentivize getting America back to work!","date":"Mon Oct 11 12:51:36 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"👏👏👏","date":"Sat Oct 09 03:58:09 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today we received word that the Department of Education has approved Michigan’s proposal regarding ESSER III Funding. This is great news for #WestMichigan because it will help bring greater balance to how schools receive federal covid relief dollars.","date":"Fri Oct 08 17:22:16 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Michigan proposal is something I have fought for and I am happy to help deliver this for Michigan students, families, and schools. On September 24th, I wrote the US Department of Education Secretary about this specific issue. https://t.co/MR0SpwfSbG","date":"Fri Oct 08 17:22:16 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Biden Administration's failure to properly secure the border is a signifcant threat to America. It's time to stop the muddled messaging, restore order at the border, and keep Americans safe. \nhttps://t.co/yZk1dKh1Od","date":"Wed Oct 06 14:24:30 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Did he yet claim it is all “transitory inflation” we are seeing??? I had that convo a couple of months ago… I hope those views of @federalreserve have changed since we all know increased wages and input costs are not going “drift downward”.","date":"Tue Oct 05 19:57:51 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Chair Gensler, I have a different analogy for you. To me, the SEC requiring disclosure on ESG metrics is like if we required the gymnastics judges to judge the diving events. Similar, but they are not qualified. https://t.co/3ff7BXeaoU","date":"Tue Oct 05 17:28:50 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Or note the fact that the Speaker and POTUS didn’t wear masks last evening at the Congressional baseball game…","date":"Thu Sep 30 16:41:53 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Dead on ⁦@RepAndyBarr! We won’t allow Western capital to fuel rise of China: Rep. Barr | Fox Business https://t.co/WVp6oUAxHR","date":"Wed Sep 29 17:42:17 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Lots of fun… but I refuse to disclose wether I got beaten on that route or not.","date":"Tue Sep 28 20:22:50 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great way of putting it @SenatorTimScott! Having the same battle in the House… #recklessspending","date":"Tue Sep 28 18:43:49 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Worth a read…\nHouse Democrats should be careful they don’t get BTU’d - Roll Call https://t.co/eqOEqCR9TB","date":"Mon Sep 20 22:23:08 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The continuation of this fact-free, ad-hoc policy-making punishes Michigan families, small businesses, and communities for no reason.","date":"Mon Sep 20 18:35:53 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"To treat the Canadian land border different than air travel is nonsensical, especially when thousands of individuals are  crossing the southern border illegally.","date":"Mon Sep 20 18:35:52 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Biden continues to fail the communities across Michigan and the northern border states that rely on tourism dollars from Canadians to support small businesses and the livelihood of the families that run them.","date":"Mon Sep 20 18:35:52 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"That is just over an hour per TRILLION in new spending…","date":"Wed Sep 15 16:28:11 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"A sad state of affairs, but to add insult to the injury, these social media kingpins then have the audacity to lecture others about civility. Just before they censor them…","date":"Wed Sep 15 14:09:18 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Secretary Blinken should remain in the hot seat until he resigns or is fired. The Biden Administration left Americans, our Afghan allies, and people with ties to #WestMichigan behind.","date":"Tue Sep 14 22:38:38 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Optics, @BillHemmer… optics. #theatre","date":"Tue Sep 14 01:52:29 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"On 9/11 I met with a constituent who served in Afgh and is fighting to get his interpreter into the US as promised. Currently, Rahim is in Canada. Why? b/c it took days, not years, to get him and his immediate family approved there. Time for the US Govt to honor its promises!","date":"Mon Sep 13 17:09:02 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"@CaseyJ_WOODTV @SpartaHS @WOODTV Awesome! Keep up the great work #WestMichigan!","date":"Fri Sep 10 21:41:07 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"As we have this debate about the Biden Admin federal vacation “mandate”, it is good to see some common sense has emerged. @SpectrumHealth ⁦@BeaumontHealth⁩ Spectrum Health workers can use natural immunity as vaccine mandate exemption https://t.co/QDJnsbGprr via @detroitnews","date":"Fri Sep 10 20:15:28 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good news for the Constitution and my fellow #2A supporters. The White House is withdrawing the nomination of David Chipman. It’s abundantly clear he is not fit to lead the men and women of the ATF. https://t.co/AUXrzCAwA6","date":"Thu Sep 09 13:09:04 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Amen! @RepKevinBrady","date":"Tue Sep 07 12:19:38 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The irony is that while serving as VP w Pres Obama Joe Biden (rightly) argued that the US corporate tax rate was too high and made us uncompetitive on the world stage… now he, and the hard left, want to return to those days. No thanks! We already have enough economic struggles!!","date":"Tue Sep 07 12:15:20 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Many of us are not going to fall for that trick… #AfghanistanDisaster","date":"Thu Sep 02 12:15:14 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"How does this math add up? Last week we were told there were somewhere between 11-15K citizens in Afghanistan. Today Biden says that 5,500 were air lifted out. And “only” 200-250 citizens remain… the truth is thousands are stranded. #AfghanistanDisaster","date":"Tue Aug 31 20:01:39 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Joe Biden was supposed to be a master chess player of the foreign policy game… our enemies and our allies are confused and unsure whether we will fulfill our commitments. Neither of those things are good.","date":"Tue Aug 31 19:48:25 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The “vital national interest” @POTUS asks? Stopping another 9/11 attack is my answer.","date":"Tue Aug 31 19:42:47 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"And there we go… if I didn’t abandon American citizens and allies on August 30 (not even the 31st) then this would be a continuation of a “forever war”. Gimme a break. Hold Bagram, expand the perimeter with additional troops and send out rescue teams, that’s how you lead.","date":"Tue Aug 31 19:41:18 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Note to @POTUS, volume and firmness in addressing the nation does not equal correct decision making…\n#AfghanistanDisaster","date":"Tue Aug 31 19:36:53 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Are you kidding me?!?! @POTUS says his administration “was ready” when the Afghan Govt collapsed! Once again they are asking us all to “not believe our lying eyes”…\nBTW, there are 2nd Dist constituents trapped outside the airport who still want to come home.","date":"Tue Aug 31 19:34:52 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Biden Administration left Americans behind. Afghan allies that supported our troops and our mission got left behind. That is the reality of today. May God watch over those who have not been evacuated … I pray there is hope they still can be.","date":"Mon Aug 30 22:25:50 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"A positive story within a tragic situation. I hope this well deserving Afghan interpreter is able to come to #WestMichigan soon, we owe it to him and his family!  https://t.co/e8jiLEI9kD","date":"Sat Aug 28 19:27:12 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"I don’t believe this question was answered… and BTW, the Biden Admin extended the troop withdrawal to August 31, not the Trump Admin. The central issue is that the withdrawal, regardless of the date, was massively bungled by this administration.","date":"Thu Aug 26 21:58:42 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is incomprehensible… meanwhile, I have constituents, their family and other visa holders who have tried but have NOT been able to get into the airport. I guess handing over that list to the bad guys didn’t work so well…","date":"Thu Aug 26 19:56:46 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"If we do not safely get Americans and the Afghans who have stood with us out of Afghanistan, the atrocities will only grow and more innocent lives will be lost.","date":"Thu Aug 26 18:09:03 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"America must show resolve in the face of these terror attacks. Our men and women on the ground are performing under unbelievable circumstances. President Biden must have the courage to lead.","date":"Thu Aug 26 18:09:03 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Join me in praying for our armed forces, civilians and all seeking protection from this horrible situation in Afghanistan.","date":"Thu Aug 26 14:29:55 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Talk to you around 8:15, Gary! I’m sure we will be discussing Afghanistan as the President’s departure looms.","date":"Thu Aug 26 11:23:25 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"We all know achieving the stated objectives by the August 31st date is impossible, militarily and logistically. @POTUS is making the decision to either not tell our allies (&amp; enemies) the truth or he really intends to leave people behind.","date":"Thu Aug 26 02:40:42 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sadly, we’ve grown to expect nothing less… #AfghanEvac #Afghanistan","date":"Tue Aug 24 23:13:45 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Taliban cannot be allowed to dictate to the President of the United States when we can safely evacuate  Americans out of Afghanistan, especially when it is the Taliban obstructing the evacuation of our citizens and our Afghan allies.","date":"Tue Aug 24 14:34:30 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy birthday my friend, @TGowdySC !!!","date":"Mon Aug 23 04:07:36 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"My office continues to receive communications from Americans in country, as well as constituents who served with Afghan allies that supported our mission and remain trapped. We are doing our best to advocate and assist through the State Department for their safe evacuation.","date":"Sat Aug 21 00:35:39 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The President’s mismanagement of the withdrawal has endangered Americans on the ground, under cut our nation’s standing among our allies, and has no doubt emboldened our enemies.","date":"Sat Aug 21 00:35:38 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Videos show Afghans taking desperate measures, with one clip showing a baby being passed over the airport wall to American troops. The situation is much more dire than the President presented.","date":"Sat Aug 21 00:35:38 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Reports detail how even the Prime Minister of the UK was unable to reach President Biden for a full day and a half.","date":"Sat Aug 21 00:35:38 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The President also seemingly misrepresented our current standing with our allies. This debacle of a withdrawal caught our allies off guard and has placed an incredible strain on the NATO relationship.","date":"Sat Aug 21 00:35:38 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Earlier today, President Biden gave a speech that simply doesn’t square with the situation on the ground in Afghanistan. Independent reports depict the Taliban cracking down and making it more difficult for Americans and our allies to reach the airport.","date":"Sat Aug 21 00:35:37 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Reports indicate that President Biden left our closest allies in the dark and then didn’t even bother to take their phone calls. This isn’t leadership, it’s an abdication of responsibility. Congress must hold the Biden Administration accountable for this colossal debacle.","date":"Thu Aug 19 18:25:27 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Unbelievable.","date":"Thu Aug 19 15:58:27 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The follow up should have been why give Bagram up at all …","date":"Thu Aug 19 02:01:33 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is a basic step for the @IMFNews and @USTreasury to take that should not be controversial, but…","date":"Wed Aug 18 21:16:22 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is another stunning example of President Biden failing to lead. Unbelievable. Why isn’t the President making calls from Camp David?","date":"Tue Aug 17 18:30:51 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This speech by @POTUS is disconnected from the realities on the ground of Afghanistan. “The Buck stops with me” is what he said after he blamed the Afghan troops, the history of the region and every previous president, incl the one he served as VP.","date":"Mon Aug 16 20:23:04 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"‘What’s happening now is worse’: Midway skipper who pushed choppers off deck in fall of Saigon https://t.co/pBPyULMlVc","date":"Mon Aug 16 20:12:17 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"POTUS is finally speaking and his first point is this collapse of Kabul was planned for?!?! And for the record, he opposed taking out Osama Bin Laden in the final operation.","date":"Mon Aug 16 20:04:27 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"When I visited Kabul as a MOC I was out into a up-armored Suburban, not a helicopter for my trip back and forth to the Embassy. What is is happening in #Afghanistan is a disaster and shameful.","date":"Mon Aug 16 11:58:40 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"How is the President not addressing the nation? This is a massive failure of leadership and completely unacceptable.","date":"Mon Aug 16 02:12:11 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"“Orderly” is a stretch… More like dangerously close to Tehran, circa 1979. This should never have happened this way.","date":"Sun Aug 15 17:29:11 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's stunning that in a mere 5 weeks President Biden was proven horribly wrong. As Afghanistan falls and the Taliban enters Kabul, the President owes the American people an explanation. There's no reason he can't appear on TV from Camp David.","date":"Sun Aug 15 14:08:27 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"#PureMichigan","date":"Sat Aug 14 00:39:08 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today I spoke to @wzzm13 about Americans being able to travel by land into Canada, but the Biden Administration failing to reopen the border to Canadians. This failure hurts  #SmallBiz, communities, and our economy.  Watch the discussion here: https://t.co/bOc2OHAJHW","date":"Tue Aug 10 00:40:39 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"A brazen and unacceptable response from the President of the United States. I wonder if the media will hold him to the same standards as they did previous Presidents… this is an assault on our system of government.","date":"Fri Aug 06 13:28:34 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 231st Birthday to the @USCG! Thank you to the incredible men and women who serve, patrol, and protect our shores and the #GreatLakes! https://t.co/kCn2o241yK","date":"Wed Aug 04 22:57:36 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Carl Levin was a strong voice not only for Michigan but for the standing of Congress as an institution. My thoughts are with the entire Levin family during this time of loss.","date":"Fri Jul 30 02:00:24 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Equally as important this bipartisan bill provides critical  resources for the Capitol Police while making investments in security throughout the Capitol Grounds. 3/3","date":"Thu Jul 29 20:55:31 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Additionally, this bill funds Operation Allies Refuge. These Afghan translators provided critical assistance to our troops and saved lives. We need to make sure the resources are there to help our Afghan allies and their families leave Afghanistan and live in peace. 2/3","date":"Thu Jul 29 20:55:22 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today I voted in favor of bipartisan legislation to fund the National Guard. Our men and women in uniform answered the call and this bill restores their funding so they can resume proper training. 1/3","date":"Thu Jul 29 20:54:46 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"#CubaLibre!","date":"Thu Jul 29 19:12:14 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Biden hurts Michigan families and our economy by failing to lead on reopening the border with Canada.  Read more about his lack of leadership on this critical issue in today’s @detroitnews. https://t.co/Rdz1olvdUd","date":"Thu Jul 29 16:16:15 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"@RepAndyBarr @RepFrenchHill cc: @GaryGensler","date":"Wed Jul 28 21:13:10 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Welcome to Twitter @GaryGensler! As chair of the SEC, I hope you remember to also focus your efforts on capital formation since it’s a vital part of the SEC’s tripartite mission!","date":"Wed Jul 28 01:06:33 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @ellenbacca on being named chief meteorologist! Bill Steffen has guided generations of West Michigan families through beautiful weather, dangerous storms, and tumultuous times. Thank you for all you have done as Chief, Bill!  West Michigan is in good hands!","date":"Tue Jul 27 02:17:27 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"@ellenbacca Excellent!","date":"Fri Jul 23 12:04:32 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Biden's decision to continue the border closure between the United States and Canada is an abdication of leadership. Read my full statement here: https://t.co/SZIe0dWSVc https://t.co/zhssoxoJxH","date":"Wed Jul 21 17:51:59 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Birthday @MrJustinBarclay! As you say, make it a great one!","date":"Sat Jul 17 15:30:57 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"@AhtraElnashar Ope! Hey! I guess this is one of those things where you can leave the Midwest but the Midwest never leaves you right?","date":"Fri Jul 16 15:55:08 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Biden and Nancy Pelosi’s agenda is costing #WestMichigan more.","date":"Wed Jul 14 12:47:48 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to my 72 colleagues who joined us in this effort!","date":"Wed Jul 07 15:01:02 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today I led a bipartisan letter with @RepBrianHiggins and @USRepKCastor calling on President Biden to safely reopen the US-Canadian Border and reestablish travel between the US and UK. https://t.co/Bf7daep3FY","date":"Wed Jul 07 15:00:50 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Both governments should follow the science and drop all travel restrictions for travelers between the United States and Canada who are fully vaccinated travelers or provide proof of a negative PCR test.","date":"Wed Jul 07 15:00:50 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Birthday to Gary Stevens! Thank you for all you do for the greater Holland community on @1450whtc!","date":"Fri Jul 02 12:16:33 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Coast Guard has notified me that it intends to close its seasonal station in Holland after Labor Day. I want to make sure #WestMichigan is aware of this impending closure. I encourage you to make your voice heard by submitting a comment here. https://t.co/81xeWsEDly","date":"Wed Jun 30 20:07:57 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Looking forward to talking about properly funding the national guard and reopening the US-Canadian border tomorrow morning! #TuneIn to @FoxFriendsFirst on @FoxNews. I’ll be joining the conversation at 5:55 AM eastern!","date":"Thu Jun 24 02:47:33 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Another example of a family unnecessarily divided because of ineffective US-Canada border policy. It’s time to safely re-open the border. #USOpen","date":"Sun Jun 20 01:00:45 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"My heart goes out to Senator Peters over the passing of his mother. Please join me in keeping Gary and his family  in your prayers during this time of loss.","date":"Wed Jun 16 19:10:21 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today I joined my colleagues in writing to President Biden asking him to confront Vladimir Putin about the detention of Michigan native Paul Whelan. President Biden should demand Paul be released and safely returned to the United States. https://t.co/RqibKOnFCx","date":"Tue Jun 15 21:11:42 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Not true. One would think the senior correspondent for ABC News would have done his research on this topic. https://t.co/jeKzmNle8A","date":"Mon Jun 14 18:40:25 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #BidenBorderCrisis is real. This should be front page news in every major newspaper. The rhetoric and flawed policies coming from President Biden, VP Harris, and the current administration have only made the situation worse.","date":"Thu Jun 10 02:49:42 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Biden put VP Harris in charge of the border 77 days ago. It is stunning that she doesn't understand the importance of visiting the southern border as the person in charge.  Then again, she would have to acknowledge the crisis was created by the Biden Administration. https://t.co/4s9PmpywYw","date":"Tue Jun 08 20:42:13 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"By seeming to cave to political pressure, Chair Gensler took the unprecedented step of removing the chair of the #PCAOB. These actions clearly bring into question if the PCAOB is truly an independent agency. Mr. Gensler should come before the committee to explain his actions.","date":"Fri Jun 04 20:51:42 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"On the same day Phil Mickelson bests Father Time, South Christian Alum and Wayland native Ben Cook made #WestMichigan proud with low club professional honors at the 2021 PGA Professional Championship.  Congratulations Ben!","date":"Mon May 24 02:05:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @tenbrinktweets for your commitment, dedication and leadership over your 34 years of service to Jenison Public Schools. I hope you enjoy retirement knowing that Jenison Schools and Georgetown Township would not be the place they are today without your leadership. https://t.co/Kd7FeC21Ba","date":"Fri May 21 17:54:57 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Biden has made it clear that pipelines are bad in America but will waive sanctions for a Russian pipeline. There have been growing concerns about this issue and what it means for European reliance on Russian energy as well as how it will impact Ukraine. #PutinPipeline","date":"Tue May 18 19:07:59 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @MicheleDeSelms! Good luck tonight on \"The Seven.\" https://t.co/3eaLsbFX7R","date":"Mon May 17 16:53:32 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you for opening your home and garden as we celebrate our important and strategic relationship!","date":"Fri May 14 20:44:12 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Democrats should abandon their effort to raise taxes and reevaluate their out-of-control spending. Failing to do so will only slow the economic recovery even further and prevent families in West Michigan from reaching their full potential. https://t.co/wThI6oMAAT","date":"Sat May 08 15:08:49 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Biden and Speaker Pelosi have continued to push policies that disincentivize work and the latest job numbers show that. The far-left Biden/Pelosi agenda is not how we get Americans back to work or grow our economy.","date":"Sat May 08 15:07:47 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today is #NationalDayofPrayer. Please  join me in praying for #WestMichigan, our nation, and one another. https://t.co/Cjn841fURf","date":"Thu May 06 15:39:02 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"👀 A new study finds that President Biden’s latest proposal will cost $700 billion more than the White House estimate bringing the projected cost to a whopping $2.5 trillion.  https://t.co/mj3JYWgajH","date":"Wed May 05 19:33:28 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The weather looks good for a strong start to #TulipTime in Holland this weekend! If you are looking for something to do, come visit this great #WestMichigan tradition and be sure to #ShopSmall and check out our local small businesses! https://t.co/YBVcaP1c8i","date":"Sat May 01 12:42:34 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The best part about Joe Biden’s speech tonight?\nTim Scott’s response...\n#JointAddress @SenatorTimScott","date":"Thu Apr 29 02:56:09 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"HR 1 would enact a federal takeover of Michigan’s elections. Michigan should be in charge of its own elections not Washington. #JointSession","date":"Thu Apr 29 02:11:33 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Biden would find strong support in Congress for holding China accountable to the same tough standards he says he wants to apply to Russia. Mr. President let’s do this!","date":"Thu Apr 29 02:00:50 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Under President Biden’s proposal Michigan manufacturers will pay a higher rate than manufacturers in China. That doesn’t benefit American workers or our economy. In fact it puts us at a competitive disadvantage.","date":"Thu Apr 29 01:44:55 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"For those keeping track. President Biden just admitted the “Affordable Care Act” still isn’t affordable.","date":"Thu Apr 29 01:41:55 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Marge! Thank you for being an incredible #SmallBusiness and community leader here in #WestMichigan. It's wonderful to see your commitment, passion, and #ServantLeadership create positive outcomes in our community and across the globe https://t.co/ENdxA7voPM","date":"Tue Apr 27 23:30:01 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Committee Democrats just struck down an amendment that opposes these taxes... so do they approve of these financial transaction taxes that will hurt their constituents as they try to save their hard earned money???","date":"Wed Apr 21 19:29:18 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Next week Monday and Tuesday! Job fair aims to fill 130 positions in downtown Muskegon https://t.co/BI29RIz0CB","date":"Wed Apr 21 17:35:33 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Amazing!","date":"Mon Apr 19 11:00:59 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Joe Biden has been staunchly against court-packing for more than 35 years. Why is he now looking at ways to undermine the credibility and independence of the Supreme Court? Court-packing should continue to be rejected! https://t.co/IeulOpxeVj","date":"Sat Apr 17 12:46:55 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"@lynseymukomel I wish you all the best as you move  forward with your next adventure Lynsey!","date":"Sat Apr 17 01:46:50 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Efforts to pack the Court were wrong in the past. Joe Biden, #RBG, and Justice Breyer have recognized the dangers of court packing. Watch my latest update on why the Democrats “new” effort to undermine the independence of the Supreme Court is wrong today. https://t.co/16myhR5Pdz","date":"Fri Apr 16 17:06:23 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":".@CandylovesPete I proudly signed it yesterday! https://t.co/husWSCq1Le","date":"Thu Apr 15 23:37:02 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Please join me in praying for my colleague @RepDanCrenshaw, his family, and the best outcome possible during this crucial time.","date":"Sat Apr 10 17:42:27 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Still no announced visit to the border from Vice President Harris despite being put in charge of the Administration’s “border effort” more than two weeks ago by President Biden. #BidenBorderCrisis https://t.co/o6MSvVev8l","date":"Sat Apr 10 01:31:56 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Biden exploring options to expand the Supreme Court is nothing more than a political power grab. Justices from across the ideological spectrum have argued against packing the court including former Justice RBG and most recently Justice Stephen Breyer.","date":"Fri Apr 09 16:46:18 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"In case you missed it, the Michigan Congressional Delegation Republicans released a joint statement on today’s news regarding the redistricting commission. https://t.co/z1lE9Y4drs","date":"Fri Apr 09 00:06:13 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to @RepMoolenaar and Republicans on the Appropriations Committee for working to defend the Hyde Amendment. Taxpayer $$ should not be used to end the lives of innocent children. There has been over 40 years of bipartisan agreement on Hyde &amp; it should continue. #ProLife","date":"Thu Apr 08 00:34:34 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"A truly tragic loss. Rest in Peace Officer Evans. Thank you for your service. May the Lord watch over the Evans family as well as the @CapitolPolice.","date":"Wed Apr 07 17:12:09 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Easter! I hope your day is blessed with faith, family, and fellowship! https://t.co/xc1MpTNbR2","date":"Sun Apr 04 14:35:40 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Our hearts and prayers go out to the friends, family, and colleagues of Capitol Police Officer William “Billy”Evans. Today is a tragic reminder that the men and women protecting the US Capitol put their lives on the line every day. https://t.co/V7yfU8GBpx","date":"Fri Apr 02 22:42:25 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":".@RepFrenchHill, @RepAndyBarr, and I have a bill to stop this unilateral action and restore accountability so the Biden Administration and future Administrations cannot side step Congress to give billions to adversarial nations. https://t.co/Yzwlv6fnmc","date":"Thu Apr 01 17:12:43 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Secretary Raimondo is right about the US being in competition with China. Why does President Biden's proposal raise taxes to a level higher than Communist China's? Why does the Biden Admin support going around Congress to send China $41.7 billion via the IMF using SDR allocation?","date":"Thu Apr 01 17:12:43 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"While President Biden marketed himself as a bipartisan bridge builder who would unify the country, in reality only 5% of his massive $2.3 trillion partisan infrastructure proposal goes to actually building bridges, roads, and highways. https://t.co/dwhie7oOy4","date":"Thu Apr 01 16:27:11 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"If the overarching goal is to bring manufacturing back to the US from China in key areas, why is President Biden proposing tax increases that would raise taxes in the US to a higher rate than Communist China’s?","date":"Thu Apr 01 00:17:08 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Looks like @IMFNews is limbering up to toss $23B in SDRs to Putin, Assad, and the ayatollahs. It wouldn’t want to pull a muscle handing out $41B to a genocidal China, right? @USTreasury should use its veto and stop the IMF’s games.","date":"Fri Mar 26 13:19:14 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to all the farmers, growers, and producers across #WestMichigan who help feed our community and people around the world. #NationalAgDay","date":"Tue Mar 23 15:41:16 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is why I introduced the bipartisan #GRUBAct to reimburse our members of the National Guard who had to pay out of pocket for their own food.","date":"Thu Mar 18 15:10:52 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @RepMalliotakis, @RepBrianFitz, @RepLisaMcClain, @RepMoolenaar, @RepCawthorn, @replouiegohmert, &amp; @RepGregSteube for supporting our men &amp; women in the National Guard who have been deployed to the US Capitol by cosponsoring the bipartisan #GRUBAct https://t.co/iY1QeTV2Ys","date":"Fri Mar 12 20:08:38 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @RepWalorski, @RepBarbaraLee, @RepHerrell, @RepDanKildee, @TXRandy14, @RepSlotkin, and @RepMeijer for supporting our men and women in the National Guard who have been deployed to the US Capitol by cosponsoring the bipartisan #GRUBAct. https://t.co/iY1QeTV2Ys","date":"Fri Mar 12 20:06:12 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today I introduced the #GRUBAct to provide members of the National Guard who have been deployed to the U.S. Capitol w/ a per diem. These men &amp; women who answered the call deserve to have safe food and shouldn't have to pay for it out of their own pocket. https://t.co/iY1QeTV2Ys","date":"Thu Mar 11 20:46:41 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to @RepDebDingell, @RepLisaMcClain, @RepAndyLevin, @SenGaryPeters, @RepWalberg, and @RepRashida for participating in the lunch time “food drop” to support our men and women from the Michigan National Guard who are deployed to the US Capitol! https://t.co/JooeUhnaFu","date":"Wed Mar 10 18:51:18 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to @RepJackBergman, @RepMeijer, and @RepWalberg for supporting our Michigan National Guard this morning! We will have more shifts around noon and in the evening with additional members of the Michigan Congressional Delegation. https://t.co/PV6VskqwSl","date":"Wed Mar 10 13:59:46 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This needs to be investigated. I believe a per diem should be provided to members of the Michigan National Guard and I will soon introduce bipartisan legislation to do so. (2/2)","date":"Wed Mar 10 02:12:49 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Despite tonight’s announcement from the Pentagon, Governor Whitmer should still bring Michigan’s Guard home on March 12th. Serious concerns remain about the consistent quality of food being provided to our troops. (1/2)","date":"Wed Mar 10 02:12:49 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"A financial transaction tax will hurt middle class families in #WestMichigan and across America. Whether it is an individual saving for retirement, a union retiree, or a family saving for their children’s education, a FTT will make it more difficult to save for a better future.","date":"Tue Mar 09 14:41:31 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Proud to lead this bipartisan effort. Our  men and women serving in the National Guard at the Capitol deserve safe food and should be provided a per diem.","date":"Fri Mar 05 14:23:21 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This comment about our men and women in uniform deployed to the Capitol is appalling. There are photos that highlight the concerns coming from service members. This response is absolutely shameful. Story here: https://t.co/UI5zBAXSXE https://t.co/kR2iT4Q9Vi","date":"Fri Mar 05 03:31:11 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"NEW: Tonight, I led a letter w/ 38 of my colleagues, R's &amp; D's, calling for the National Guard serving at the Capitol to be paid a per diem moving forward as well as retroactively. It is completely unacceptable that our troops can't be provided safe food.  https://t.co/f10B4xcS3F","date":"Fri Mar 05 03:16:40 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Looking forward to joining you tomorrow @CarleyShimkus &amp; @ToddPiro! #WestMichigan","date":"Thu Mar 04 02:50:32 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Why is this statement different than what we were briefed on yesterday morning?","date":"Thu Feb 25 21:24:14 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"I want to thank @RepAlGreen and @RepAGonzalez for working with me on this important small business lifeline. While Washington and our nation are no doubt divided, #WestMichigan and communities across America expect us to find a way to work together like we did today.","date":"Thu Feb 11 22:56:45 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This amendment will provide increased flexibility and opportunity for people that earn income through Etsy, Shipt, DoorDash, or Lyft to name a few.","date":"Thu Feb 11 22:56:44 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"The pandemic has demonstrated the increased role of the gig economy. Today, over 1/4 of the US workforce participates in the gig economy or non traditional work in some capacity.","date":"Thu Feb 11 22:56:44 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"This bipartisan amendment sets aside $500 million (of the $10 Billion SSDCI) in direct support and credit options to help small businesses with less than 10 employees including independent contractors and sole proprietors.","date":"Thu Feb 11 22:56:43 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good news! My amendment to help small businesses passed the Financial Services Committee today by voice vote. At this point this is only the 2nd Republican-led Amendment to pass the House during the reconciliation process.","date":"Thu Feb 11 22:56:43 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Praying for the Wright family at this difficult time. Blessings and Peace to you all. GOP Rep. Ron Wright dies after Covid battle - POLITICO https://t.co/NBSpEEXdXF","date":"Mon Feb 08 16:31:23 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"@MrJustinBarclay Great news! What a beautiful gift!","date":"Thu Feb 04 01:38:03 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"So glad to see the continued positive impact on our community thanks to the Secchia family. Pete would be proud of these students! GVSU announces The Peter Secchia Military and Veterans Program - GVNext  https://t.co/g7Evl42pQu","date":"Tue Feb 02 14:46:04 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @JanetYellen on being confirmed as our nation’s first female @USTreasury Secretary. I look forward to continuing our debate on the most effective policies to help hardworking American families get back on their feet, grow our economy, and move our nation forward!","date":"Tue Jan 26 02:07:14 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Birthday to Michigan State Senator @aricnesbitt! Thank you for all you do to represent @KentwoodMich and communities across #WestMichigan!","date":"Mon Jan 25 20:55:09 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @GRCC_CougarsFB on bringing home the state title! #WestMichigan","date":"Sun Jan 24 01:39:07 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to @montwildcats football on winning the state title! #Montague #WestMichigan","date":"Sat Jan 23 01:15:52 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @MSSailorFball on winning back to back state championships! #GoSailors #WestMichigan","date":"Fri Jan 22 21:09:58 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was an honor to address the 700 men and women of the @MINationalGuard who came to protect and secure the Capitol for inauguration. #ThankYou for your service and dedication to our community and our country! #WestMichigan https://t.co/D0avxXThan","date":"Thu Jan 21 22:48:44 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"More #goodnews for the #GreatLakes! The @USACEHQ has included $3.8M in its FY21 work plan for early phase work on the Brandon Road Project to protect the Great Lakes from Asian carp. This is the # requested by the  Great Lakes Task Force. https://t.co/mk91pWiEqZ #WestMichigan","date":"Wed Jan 20 00:55:24 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sadly, even a wordless beautiful melody is political these days... keep up the great work of offering the peace of Christ to this broken world through your music @KarlKohlhase!","date":"Fri Jan 15 17:20:26 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks @KarlKohlhase for adding some calm and beautiful music to this chaotic world... take two minutes and enjoy this peaceful melody.","date":"Fri Jan 15 04:06:57 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Last night I voted against impeachment. Here’s a more in-depth explanation of why I did via Facebook Live #WestMichigan https://t.co/cONqgGZHLb","date":"Fri Jan 15 01:00:17 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"#ThankYou to the brave men and women in uniform serving our communities. We appreciate your commitment and dedication to making #WestMichigan a safer and an even better place to call home. https://t.co/KUwyzxjDT5","date":"Sat Jan 09 22:42:22 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"An earlier tweet with this picture referenced the passing of a Capitol Hill Police Officer according to reports by CNN and others. Those reports have proven to be incorrect. Please join me in praying for that officer and the entire force during this difficult time.","date":"Fri Jan 08 02:25:26 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to the men and women serving in the Capitol Police. Yesterday was a day none of us will soon forget and we are grateful for your service. https://t.co/l6rCyl9BeQ","date":"Fri Jan 08 02:24:00 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Apparently there is a report that I am or was stuck outside of the Capitol building. I am in the Capitol and in the House Chamber. Debate regarding Arizona’s electors has been suspended due to a breach of the Capitol building itself.","date":"Wed Jan 06 19:23:46 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Big News! Tonight the President signed the bipartisan Great Lakes Restoration Initiative Act of 2019 into law. This will protect, restore, &amp; strengthen the #GreatLakes  for another 5 years by extending the #GLRI! Read my full statement here: https://t.co/dCNCUHMb04  #WestMichigan","date":"Wed Jan 06 00:49:05 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"Just cast my vote for @GOPLeader Kevin McCarthy to serve as Speaker of the House. #WestMichigan https://t.co/S7A8jBL0IM","date":"Sun Jan 03 20:03:29 +0000 2021","user_id":"233949261"},{"handle":"RepHuizenga","text":"@ChadPergram Worth noting Chad: how many small businesses closed because Speaker Pelosi delayed relief for political purposes? How many American families were negatively impacted by her decision? Does she openly acknowledge her decision directly led to suffering? #DoubleStandard","date":"Wed Dec 30 16:15:20 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Read this thread...","date":"Wed Dec 23 04:38:27 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sadly, the biggest losers in this whole story are not Dem political leaders, it is the hard working men and women employed at (or who own) small businesses throughout America who lost any chance for help the past 5 months thanks to Spkr Pelosi’s election games.","date":"Tue Dec 22 17:52:43 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Speaker Pelosi's decision to let the livelihood of struggling Americans be ruined should not only be a part of her legacy, it should cost her the speakership in the next Congress. #SmallBiz #COVID19","date":"Tue Dec 22 03:34:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"While this relief package will provide a lifeline to struggling small businesses, how many small businesses were forced to shut their doors for good while waiting for Washington to act? #SmallBiz","date":"Tue Dec 22 03:29:36 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Speaker Pelosi’s decision to play politics with pandemic relief - only to agree to an aid package that is roughly half of what was offered earlier this year - should not be glossed over. #COVID19 #SmallBiz","date":"Tue Dec 22 03:29:36 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great news for the #GreatLakes! Tonight the senate passed bipartisan legislation to protect, restore, and strengthen the Great Lakes! This important bill passed the House in February and now heads to the President’s desk! #GLRI #WestMichigan  https://t.co/xB2JMqGtll","date":"Mon Dec 21 02:55:58 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"As negotiations continue on a #COVID19 relief package, small businesses, especially restaurants, small concert venues, and places like wedding venues should be a priority. If government is going to forcibly shut these small businesses down, it has an obligation to help them.","date":"Thu Dec 17 15:58:34 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"@NickLaFave So sorry for your loss Nick. Blessings and prayers for you and your family during this difficult time.","date":"Thu Dec 17 15:50:13 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @USArmy! Thank you ALL for your desire to serve and become future leaders!  #ArmyNavyGame","date":"Sat Dec 12 23:36:59 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is great news!  This life-saving vaccine has come online in record time and highlights America’s incredible innovation and scientific research capabilities as well as the success of Operation Warp Speed! https://t.co/SIXM6Xf7oa","date":"Sat Dec 12 03:05:49 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I going live on FB momentarily to talk about why I signed on to this brief to the USSC.","date":"Thu Dec 10 21:07:31 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Watch now!","date":"Thu Dec 10 16:50:35 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Honored to be a part of this bi-partisan group that has true Lt made a significant positive impact on our Great Lakes waterway system!","date":"Wed Dec 09 15:28:01 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Anne @brithume amen...","date":"Tue Dec 08 03:00:51 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Anyone care to try and dispute the wasted time and damaged economy that came from this WASN’T flat out cynical politics on the Speakers part??? Workers and small businesses were crippled and we are in worse shape now because of it. Shame on House Dems for allowing it to happen.","date":"Fri Dec 04 18:02:08 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tom and I served, and sat next to each other, in the Mich St House. As his “seat mate”, I discussed &amp; debated then watched and learned how this dedicated public servant sought what was best for his constituents and Mich as a whole. A great man and a true friend. RIP, Tommy.","date":"Tue Dec 01 13:55:43 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Seriously... no help for workers or small biz, but we are voting on a bill to help the pot industry? $138 Billion in unspent PPP funds waiting for the House Dems to act and this is what Speaker Pelosi prioritizes?!?! 🙄🤦‍♂️","date":"Mon Nov 30 22:58:42 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"It’s #SmallBusinessSaturday! Small businesses are the backbone of our economy. Make sure to #shopsmall by visiting, calling, or ordering online from your favorite restaurant, store, or local shop to support jobs and opportunity across #WestMichigan! https://t.co/zyOS7Q7K0g","date":"Sat Nov 28 14:35:41 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you for having me! It’s great to see what is being #MadeInMichigan to support, protect, and expand the capabilities of our men and women in uniform! #WestMichigan","date":"Wed Nov 25 00:48:19 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"🇺🇸🇺🇸🇺🇸🇺🇸🇺🇸","date":"Mon Nov 16 00:18:28 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Yesterday, after her long battle with cancer we said an earthly goodbye to my younger sister, Nancy Kapteyn as she entered Heavenly Glory. She was an incredible wife &amp; amazing Mom to 3 girls. We are happy her pain has stopped but we already deeply miss her smile and laugh. Love U https://t.co/xY2YPee9vx","date":"Fri Nov 13 21:17:03 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to the men and women who put on the uniform in defense of freedom and our nation. We honor  your courage, dedication, and service! #VeteransDay https://t.co/dUeZMLMt8L","date":"Wed Nov 11 21:42:41 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 245th Birthday to the @USMC!  Thank you to the incredible men and women from #WestMichigan who have served, protected, and defended our nation as a member of the Marine Corps! https://t.co/ke0IltvsIL","date":"Tue Nov 10 13:15:25 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is why @PatrickMcHenry and I introduced a bill to prevent this from happening!","date":"Thu Oct 29 17:04:15 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":".@PatrickMcHenry &amp; I introduced the Protecting Retirement Savers and Everyday Investors Act to stop a state from imposing a financial transaction tax on out of state seniors, pensioners, college savers, first-time homebuyers, &amp; everyday investors. Details: https://t.co/6Qe8LiaH90","date":"Wed Oct 28 10:56:30 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you for your work and dedication to #WestMichigan and the City of Walker Dan!","date":"Tue Oct 27 17:16:20 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I deeply appreciate all those who have reached out and will continue to keep West Michigan updated on the status of my recovery.","date":"Thu Oct 15 13:50:53 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Quick update: I have received my results from the PCR test confirming that I am positive for COVID-19.  I will continue to self-isolate through the duration and serve the people of West Michigan. Thank you to the medical professionals who deal with these cases on a daily basis.","date":"Thu Oct 15 13:50:53 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Earlier today, I was expected to appear with the Vice President. While taking part in offsite testing protocols, I took a rapid test that came back positive for COVID-19. I am awaiting the results of a PCR test and I am self isolating until I have confirmed results.","date":"Wed Oct 14 17:31:30 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to the men and women of the FBI who thwarted the alleged plot to kidnap Governor Whitmer. This is an absolutely disgusting plan that is beneath all that we stand for as Michiganders &amp; Americans. These individuals should be prosecuted to the fullest extent of the law.","date":"Thu Oct 08 17:34:23 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Birthday to my friend @SteveScalise! Thank you for being such a strong voice for the unborn and for working to enact policies that increase opportunity for Americans across all walks of life!","date":"Tue Oct 06 17:07:31 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Natalie and I join the millions of Americans and people across the globe praying for a speedy recovery for the President, the First Lady, and all of those impacted by the Coronavirus.","date":"Fri Oct 02 13:06:58 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Yesterday I signed the discharge petition to require Speaker Pelosi to vote on extending the Paycheck Protect Program for #WestMichigan. Congress has already allocated this funding to help small businesses in our community impacted by the coronavirus. This should be unanimous.","date":"Wed Sep 30 13:57:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"President Trump has made an excellent decision in nominating Amy Coney Barrett for the Supreme Court. Judge Barrett is a skilled jurist with an exceptional record. I hope the Senate acts in a timely manner to confirm this highly qualified nominee. #SCOTUS","date":"Sat Sep 26 22:02:39 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"My heart goes out to the family of Associate Justice Ruth Bader Ginsburg as well as her fellow Justices on the Supreme Court. Justice Ginsburg fought cancer with a toughness that inspired all while serving our nation with dignity until she was called home.","date":"Sat Sep 19 00:00:08 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations! Thank you both for your service!","date":"Wed Sep 16 18:33:32 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"🏈 is back for the Big Ten!","date":"Wed Sep 16 13:34:45 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The signing of the #AbrahamAccords is a historic step forward for peace and prosperity across the Middle East. Congratulations to Israel, the United Arab Emirates, and Bahrain on this defining moment. https://t.co/bNwjZcd50O","date":"Tue Sep 15 17:51:36 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today we remember the nearly 3,000 lives lost in the horrific attacks that took place on September 11th, 2001. While 19 years have passed, let us also remember the heroism and courage displayed by our first responders and complete strangers to save lives and help one another. https://t.co/lYb5CqqB32","date":"Fri Sep 11 19:17:49 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @terrideboer on 25 years at @WOODTV! Thank you for all you do for #WestMichigan. Keep up the great work! https://t.co/C8ctqf1DUl","date":"Tue Sep 01 23:04:13 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! S&amp;P 500, Nasdaq close at record highs amid encouraging economic data reports @businessinsider  https://t.co/I6pT4O8pum","date":"Wed Aug 26 20:45:34 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tomorrow night I will be joining a discussion on ways to raise awareness and combat human trafficking. We all need to stand together as a community to fight this atrocity. https://t.co/dm0PD88bhw","date":"Mon Aug 24 02:36:29 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Well, @_HeatherWalker I never mentioned your name, much less @WOODTV but here we go... I watched all of the dramatics, the seeming confirmation, the assumption that your scoop was accurate and true. Is it “name calling” describing that as breathless?We all simply need the truth!","date":"Sun Aug 23 18:25:29 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I am glad to see the Administration respond quickly to help those out of work here in Michigan. Congress needs to work in a bipartisan manner to prioritize relief to Americans, incentivize job creators and employees to return to work, and improve testing.","date":"Sat Aug 22 15:59:42 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This afternoon, I toured the Grand Rapids letter distribution center. With all the reports regarding the Post Office, I wanted to see first hand what was happening. Here’s what I found out.  \nhttps://t.co/tbTMUfINZ5","date":"Fri Aug 21 21:48:52 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you Raul for letting us join you on the blueberry harvester today at Crossroads Blueberry Farms and even letting @SecretarySonny try his hand at running it! #WestMichigan #FamilyFarm #agriculture https://t.co/Z8lvVyWeU3","date":"Fri Aug 21 13:51:52 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Agriculture is a major source of economic activity and job creation here in #WestMichigan. It’s great to have Secretary of Agriculture Sonny Perdue experience first hand what It is like to harvest bluecrop blueberries at Crossroads Blueberry Farm in West Olive!  #PureMichigan https://t.co/fTUCgRuAw9","date":"Fri Aug 21 13:09:55 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Already this selection process being implemented by Secretary of State Jocelyn Benson has silenced millions of West Michigan voters. The fact that Kent County and the entire lakeshore from Mason County to the Indiana border doesnt have a voice in this process is stunning.","date":"Mon Aug 17 19:58:35 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Blessings and Peace to you \n@real Donald Trump and your entire family as you mourn the loss of your brother, Robert. https://t.co/PjvKQPXKyE","date":"Sun Aug 16 02:51:32 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Eagle vs EGLE  ... 🦅 wins! https://t.co/IQCPhaLUKD","date":"Thu Aug 13 14:52:15 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great News! New research from @GVSU shows the #GLRI has had a major impact on Muskegon County. The restoration of Muskegon Lake has increased recreational activity by $27.9 million annually and raised home values by $7.9 million. #GreatLakes #WestMichigan https://t.co/H5pHhZEVJa","date":"Tue Aug 11 13:32:46 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 230th Birthday to the @USCG ! Thank you to the incredible men and women who serve in the #USCG and work tirelessly to keep the #GreatLakes and our nation safe! https://t.co/64Jc4C0SO0","date":"Tue Aug 04 12:38:25 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Last week on my flight to Washington, it was clear @Delta has put in place enhanced measures to protect passengers during this challenging time. From increased availability of sanitizing stations to how beverages are passed out, I am glad to see health &amp; safety are the priority. https://t.co/Ts8xVWCAbK","date":"Mon Aug 03 15:23:24 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Welcome home @Astro_Doug &amp; @AstroBehnken! #USA #LaunchAmerica","date":"Sun Aug 02 19:27:17 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"#GoTigers!","date":"Fri Jul 24 22:14:20 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great question @RepAlexMooney! I hope you would consider my bill, The Patriot Bonus (HR6629) as a good starting place. It encourages employers to reward both current employees to stay on the job and returning workers to get back into the workforce! #BackToWork","date":"Fri Jul 24 21:51:46 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"As a matter of fact, yes @RepPaulMitchell there is one for you! More will be coming...","date":"Thu Jul 23 00:47:42 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Covid-19 doesn’t recognize political parties and neither does our delegation when it comes to saving lives. I am proud to join my Michigan colleagues and wear a face shield made in #WestMichigan by Primera Plastics. https://t.co/2BBL7lyHkm","date":"Wed Jul 22 22:33:50 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"It’s hard to participate in something you weren’t originally invited to @ChadLivengood","date":"Tue Jul 21 22:20:34 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is good news. I have been working w/ the WH on this very issue. I encourage @realDonaldTrump to include something like my Patriot Bonus legislation (HR6629 introduced in May) which is a cost sharing idea to encourage people to return to the workforce w higher wages!","date":"Mon Jul 20 19:45:19 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The United States must continue to hold the CCP accountable for their actions against the Uighurs.  Adding more Chinese “companies” to an economic blacklist is a start. https://t.co/bbacgddqno","date":"Mon Jul 20 18:21:10 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Birthday @MrJustinBarclay! Make it a great one!","date":"Fri Jul 17 12:05:04 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 4th of July everyone! The  eagles are flying high just outside of Ludington! 🇺🇸 🦅🇺🇸🦅 #PureMichigan #GodBlessAmerica https://t.co/H0hkM706B4","date":"Sat Jul 04 19:26:01 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Birthday to @1450whtc’s @gstevensholland! Thank you for all you do to share the news impacting Holland, Ottawa County, and #WestMichigan!","date":"Thu Jul 02 19:07:44 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today the Supreme Court finally declared the structure of the CFPB unconstitutional. My Republican colleagues and I have argued this since the inception of the CFPB. This is about accountability to taxpayers. A bipartisan commission should helm the #CFPB.  #SCOTUS","date":"Mon Jun 29 17:31:50 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Meaningful police reform legislation requires input and support from both Republicans and Democrats. When Speaker Pelosi makes statements like she did w/ @CBSNewsRadio, which are clearly designed to sow further unrest, it really calls into question her ability to lead the House.","date":"Tue Jun 23 22:49:35 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"@ellenbacca @WOODTV That’s fantastic news! Well deserved! Congratulations!!!","date":"Sun Jun 21 23:50:28 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today we celebrate Juneteenth with African Americans across the nation. Let’s strive to learn from the tragic mistakes of the past and work together to build a brighter future that lives up to the principles and ideals that make our nation great. #WestMichigan","date":"Fri Jun 19 19:10:52 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Carol was a fun, smart and amazing woman paired up with an equally amazing guy. Know that many, many people are praying for you @RepAndyBarr and your beautiful girls. Blessings and Peace to the whole family.","date":"Thu Jun 18 03:09:59 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"🇺🇸🇺🇸🇺🇸","date":"Tue Jun 16 12:37:34 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"It’s hard to believe it has been a year since I had the honor of representing the United States and #WestMichigan at the 75th anniversary of #DDay. I am still in awe of the courage exhibited by American soldiers and our allies on this history changing day 76 years ago. #WWII https://t.co/FSn4uTpQmn","date":"Sat Jun 06 22:17:32 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"By rejecting audits and transparency standards applied to other publicly traded companies listed on American financial markets, these Chinese companies pose a significant risk to individual investors as well as larger investors such as pension funds. https://t.co/b51fNONoxy","date":"Fri Jun 05 13:56:08 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The President’s decision to hold China accountable for their lack of transparency in US markets is the right call. Chinese companies must play by the same rules as American companies.  https://t.co/b51fNONoxy","date":"Fri Jun 05 13:56:07 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"We can safely and responsibly take steps to mitigate risk and reopen our economy. Today’s report is very good news as we begin to walk down the road of economic recovery.","date":"Fri Jun 05 13:15:05 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"What happened to Mr. Floyd was an atrocity. Peaceful demonstrations and protesting are one thing. Breaking windows, starting fires, and looting is something completely different. That behavior doesn’t lead to positive outcomes and only serves to hurt more families. #WestMichigan","date":"Sun May 31 02:34:20 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a great moment! Congratulations to @NASA and @SpaceX on this partnership! Today’s successful launch marks the next era of American space travel! All the best to astronauts Bob Behnken and Doug Hurley on their mission! 🇺🇸🇺🇸🇺🇸","date":"Sat May 30 19:44:56 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"What happened to George Floyd is tragic &amp; appalling. It is imperative to have oversight not only at the local level but at the federal level as well. I am glad to see the Department of Justice open an investigation. The next course of action must be accountability.","date":"Thu May 28 19:34:15 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"By utilizing public-private partnerships, the Trump Administration continues to make helping Michigan a priority. The federal government has also deployed a Battelle Critical Care Decontamination System that can decontaminate up to 80,000 N-95 masks daily. #PPE #WestMichigan https://t.co/oAEO4OvCFt","date":"Thu May 21 19:56:58 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"#SmallBiz is critical to our economy here in #WestMichigan. @SBAgov has issued over $16.2 billion in loans to more than 110,000 small businesses across Michigan. https://t.co/GUo94UPLyX","date":"Thu May 21 14:39:07 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"It is unbelievable what is happening to Midland and the surrounding area. Our  prayers go out to all those impacted. #StaySafe","date":"Wed May 20 19:34:32 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This money was designed to save jobs and small businesses across the nation. As a member of the @FinancialCmte, I believe we should call these financial institutions before Congress to explain how these loans were approved. https://t.co/K7G4EFuwyc","date":"Wed May 20 02:16:26 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you both for answering the call to serve your communities. I look forward to working with you!","date":"Tue May 19 15:58:05 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Wow! 1,000,000 views on my video discussing Speaker Pelosi’s $3 trillion partisan wish list and the Democrats’ unprecedented proxy vote power grab! #ThankYou for all the shares, views, and support! https://t.co/odWF5xhfKi","date":"Tue May 19 02:29:52 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Last night after voting NO on Speaker Pelosi’s $3 trillion liberal wish list, I updated #WestMichigan on the multitude of concerns I had with this partisan bill.  Watch the video and get the details here: https://t.co/odWF5xhfKi","date":"Sat May 16 14:44:39 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"BREAKING: Republicans moved to stop undocumented individuals from receiving stimulus checks but Dems blocked it. For Michigan this means those w/o legal status can receive a stimulus check but unemployed citizens still can’t get a timely unemployment check from the Whitmer Admin.","date":"Sat May 16 00:26:20 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tune In! I am on the floor waiting to speak against Speaker Pelosi’s partisan wish list. #WestMichigan expects bipartisan results to move our nation forward. This bill is not the answer and will not become law.","date":"Fri May 15 20:12:06 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #HEROESAct is a bipartisan way to say thank you and support our first responders, medical professionals, and senior care providers during this unprecedented time. Learn more about H.R. 6433 here: https://t.co/WBlsHRss2g","date":"Tue May 12 17:35:40 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I introduced the #HEROESAct as a targeted approach for Congress to take to recognize medical professionals and first responders more than a month ago. The legislation released today by @SpeakerPelosi is merely a partisan wish list that will not become law.","date":"Tue May 12 17:30:48 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Birthday Magnolia Earl! Congratulations on being named this year’s #GerberBaby! It’s wonderful to see @TODAYshow and Gerber highlight the gift of adoption! https://t.co/kJ58EcR6YY #WestMichigan","date":"Sat May 09 13:04:59 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is big news for asparagus and tart cherry growers as well as dairy, pork, and turkey producers across #WestMichigan!","date":"Wed May 06 02:19:56 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"\"All furloughed workers have been recalled and two of four operating rooms are back on track as North Ottawa Community Hospital continues to ramp up operations reduced because of the COVID-19 pandemic.\" reports @ghtribune https://t.co/vx460Tx3Nv","date":"Mon May 04 14:10:45 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @RepSteveStivers for cosponsoring the #HEROESAct! The federal government can recognize and say thank you to the incredible work health care professionals and first responders are doing across America! https://t.co/1GGZKDp3CO","date":"Fri May 01 01:51:55 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"We can reward essential workers in a responsible way. The #PatriotBonus supports and encourages wage increases for employees at grocery stores, gas stations, and childcare providers just to name a few. Learn more about H.R. 6629 aka the #PatriotBonus here: https://t.co/7tNm5yFDaV","date":"Thu Apr 30 15:46:36 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"\"Local health systems say they are ready to reopen some services, while still taking every available precaution to keep patients safe during the COVID-19 pandemic\" reports @ghtribune. #WestMichigan https://t.co/7zUNYHctj6","date":"Tue Apr 28 17:34:45 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"#WestMichigan is home to an incredible array of horticulture. It’s great to see these greenhouses safely and responsibly reopen and bring back their employees!","date":"Mon Apr 27 23:48:43 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Small businesses owners, be sure to check with your financial institution to see where you are in the process and if any additional information is needed for your application. (2/2)","date":"Mon Apr 27 12:36:32 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #PaycheckProtectionProgram resumes today at 10:30 AM. The #PPP is a critical lifeline that has helped small businesses and thousands of their employees across #WestMichigan.  (1/2)","date":"Mon Apr 27 12:36:31 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is a great idea!  By teaming up with #SpartanNash, local #SmallBiz restaurants like @AnnasHouseUS have been able to bring back their employees to make some of their favorite dishes to be sold at Family Fare and additional grocery store locations.","date":"Sat Apr 25 19:30:46 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @RepTomEmmer for supporting the #HEROESAct and recognizing our first responders and medical professionals!","date":"Fri Apr 24 19:27:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":".@POTUS has signed legislation restoring critical funding for the #PaycheckProtectionProgram. The #PPP has been a lifeline for #WestMichigan small businesses and the thousands upon thousands of individuals they employ! Now it’s time for Congress to focus on the #HEROESAct!","date":"Fri Apr 24 16:48:34 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is an interesting chart on many fronts. Despite the COVID cases in NY, look where they are on overall unemployment. As for Michigan, I believe this shows how important it is to open those parts of our economy that can be done safely as soon as possible! #worksafe","date":"Fri Apr 24 14:00:41 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I am just starting my telephone town hall with residents across #WestMichigan. If you would like to join the conversation you can listen and participate at https://t.co/6kqnaSu3yq","date":"Thu Apr 23 20:03:32 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @GVSU for doing so much to support #WestMichigan in this time of need!","date":"Thu Apr 23 17:02:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I am preparing to speak on the floor about the #PaycheckProtectionProgram, #SmallBiz, and the #HEROESAct. Tune into @cspan now to watch the debate. #WestMichigan","date":"Thu Apr 23 16:34:28 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #PaycheckProtectionProgram is having a significant impact here in #WestMichigan. Over $300 million in guaranteed loans were extended to more than 1,200 #SmallBiz by @MacBank. This is helping over 27,000 employees maintain a paycheck! #PPP https://t.co/LJb8ibDoBL","date":"Thu Apr 23 01:04:30 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"It’s great to see life-saving innovation in the form of more accurate testing being developed by @michiganstateu here in #WestMichigan. There’s no reason research laboratories at universities should be prevented from doing testing. CMS &amp; the FDA should approve this immediately.","date":"Wed Apr 22 23:05:45 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #PaycheckProtectionProgram is a lifeline for #SmallBiz and their employees across #WestMichigan. I am glad to see the Senate take action on this important legislation as well as provide additional funding for testing &amp; hospitals. The House will consider the #PPP on Thursday.","date":"Tue Apr 21 22:58:13 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @DavenportU for making housing available for @MetroHealthGR   Employees and @KentCountyMI first responders serving on the front lines against the #Coronavirus!","date":"Tue Apr 21 00:22:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":".@wwmtnews: #WestMichigan businesses stuck after Paycheck Protection Program funding runs out. \n\nThis shouldn't be the case. Please remember Senate Democrats blocked a clean increase in #SmallBizRelief via the #PPP over a week ago. \nhttps://t.co/VcGdfHYuVg","date":"Fri Apr 17 21:06:48 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Couldn’t think of a better person to take this project on than my friend @RepFrenchHill!","date":"Fri Apr 17 18:17:13 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"#ThankYou to everyone who joined tonight’s telephone town hall. We had an engaging conversation on the Governor’s executive order, the importance of the #PPP for #SmallBiz in #WestMichigan, and the process of opening our economy. https://t.co/YSgCBNNqmk will have more tomorrow!","date":"Fri Apr 17 02:05:57 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is exactly how it should have been handled last week to avoid the fund running out of money. With the announcement of an additional 5.2 million people filing for unemployment this is a critical step that needs to be taken to help #SmallBiz &amp; the individuals who work there.","date":"Thu Apr 16 18:38:29 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"With the #HEROESAct, Congress can show meaningful support for those saving lives on the front lines of the Coronavirus outbreak. Thank you to the incredible medical professionals and first responders answering the call here in #WestMichigan and in communities across the nation!","date":"Thu Apr 16 02:43:25 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @PerrigoCompany for supporting those serving on the front lines against the Coronavirus in #WestMichigan!","date":"Thu Apr 16 02:09:48 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is an excellent idea. Thank you for supporting our first responders and medical professionals @Calvin_Uni! #ProudAlum","date":"Tue Apr 14 20:12:44 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Let's show our support for the life-saving efforts of our first responders &amp; medical professionals serving on the front lines against the coronavirus by passing the #HEROESAct! Read my op-ed on this important bipartisan legislation in the @dcexaminer! https://t.co/nzyXQo6Bax","date":"Mon Apr 13 15:47:30 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great news! A shipment of 500,000 surgical masks arrived at @FlyGRFord today aboard a @Delta flight! #PPE #WestMichigan https://t.co/Jd2S9BJvIe","date":"Sat Apr 11 03:26:38 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank You @WOODRADIO for the opportunity to discuss my recent telephone town hall and how I am working to help #WestMichigan residents and small businesses navigate these challenging times! #WeAreAllInThisTogether #SmallBiz #CARESAct\n\nhttps://t.co/kPEMHtTIiZ","date":"Fri Apr 10 13:54:52 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I’m glad to have my colleague @RepMoolenaar sign on to the #HEROESAct! Thank you John for supporting our first responders and medical professionals! https://t.co/xxJ0ShCeX5","date":"Thu Apr 09 01:33:21 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Innovation is a critical part of our economy even during these challenging times. It’s great to see #smallbiz manufacturers innovate and work together to make a difference here in #WestMichigan https://t.co/7aSF9yY425","date":"Thu Apr 09 01:13:48 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I'm glad to have you aboard @RepWalberg! Thank you for continuing to make our first responders and health care workers a priority!","date":"Wed Apr 08 01:30:14 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":".@wwmtnews: Michigan congressman calls for federal tax holiday for health care staff, first responders #HEROESAct https://t.co/dIl4YUeRMX","date":"Tue Apr 07 13:34:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great things can be accomplished when we embrace the notion that we are all in this together. Thank you to @Ford and the @UAW! Keep up the incredible work! https://t.co/JruzVo5Cje","date":"Tue Apr 07 01:42:46 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #HEROESAct is designed to support our first responders and medical professionals battling the coronavirus. As Congress continues to evaluate a phase 4 relief package, I am working to build bipartisan support for this important measure. Read more here: https://t.co/WBlsHRss2g","date":"Tue Apr 07 01:33:23 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sad to see Mr. Tiger, Al Kaline, has passed away at age 85. For generations of fans, Al Kaline embodied what it meant to be a Detroit Tiger.  My heart goes out to his family and the @tigers organization during this difficult time.","date":"Mon Apr 06 22:07:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I’m working on another idea to move towards that... stay tuned!","date":"Fri Apr 03 14:35:11 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Big News! Later today I will be introducing the #HEROESAct to support first responders and medical professionals. This legislation will provide a federal income tax holiday for those serving on the front lines against the #coronavirus https://t.co/8dNQBQpdSf","date":"Fri Apr 03 11:36:13 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The men and women serving in the Army Corps of Engineers are highly-skilled.  Here in #WestMichigan, the Corps has consistently performed with excellence. Under the leadership of Lt. Gen. Semonite I have no doubt @USACEHQ will rise to this challenge! https://t.co/BxgkkpR7OJ","date":"Wed Apr 01 01:19:32 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Incredible! It’s great to see #WestMichigan manufacturers play a leading role in producing PPE equipment to help keep people safe as they treat and combat #COVID19! Thank you @JRAutomation! #AllInThisTogether","date":"Tue Mar 31 22:38:42 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Having gotten to meet and spend time w Representative Coburn when he served with our former 2nd Rep, Pete Hoekstra I can say 1. He made our country a better place and 2. His leadership and dedication will be missed. God speed good Sir... blessings and peace to your family.","date":"Sat Mar 28 17:19:11 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"@Nickin616 @jlow10 My focus continues to be serving West Michigan and working to get the best results for our community.","date":"Fri Mar 27 23:54:01 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The CARES Act will deliver critical relief to #WestMichigan residents, small businesses, and our medical professionals. Today this bipartisan measure passed the House and now heads to @realDonaldTrump’s desk. Prior to House passage, I spoke in support of this important measure. https://t.co/IDgbVtKn7j","date":"Fri Mar 27 20:19:54 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @WOODRADIO for the opportunity to talk about the CARES Act and what it means for #WestMichigan families and small businesses. If you missed this morning's interview you can listen to it here: https://t.co/dpiicFR0Kb","date":"Fri Mar 27 11:12:52 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Glad to see the Senate pass the Phase lll of our #COVID19 response, albeit three days after it could and should have passed. Now on to the House. While I expect an overwhelming vote, I don’t believe “Unanimous Consent” is the right way to pass a $2TRILLION spending bill!","date":"Thu Mar 26 03:51:35 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"We are all in this together. The goal of this conversation is to help provide tools for #WestMichigan job creators during the current challenges created by #COVID19. The call is getting underway at 1:30 #SmallBiz","date":"Tue Mar 24 17:23:18 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Ford working with 3M and GE to make respirators and ventilators - CNN https://t.co/ozwcPsWhlX","date":"Tue Mar 24 14:13:59 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Glad to see corporate leaders like ⁦Jim Hackett (former Steelcase CEO) working together and w Fed Govt to meet our urgent medical needs! ⁦@Ford⁩ CBS This Morning - Ford to produce \"hundred of thousands\" of ventilators by \"early June\" | Facebook https://t.co/WQNUYUZ7xX","date":"Tue Mar 24 14:10:34 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Read this solid account of what is really going on in the Senate bill regarding what Treasury and the Fed can and can’t act upon. BIG difference between ‘08 crisis built on bad decisions and illegal activities to ‘20 crisis where a solid economy has been “voluntold” to shut down.","date":"Mon Mar 23 19:26:46 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"And now we have a 1,200 page “Pelosi only” bill being hawked in the House! They have truly managed to turn this health crisis into a economic fiasco.","date":"Mon Mar 23 16:42:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is why the Senate needs to pass a COVID19 response, not a Christmas tree bill with everyone’s pet projects, ASAP! Keeping people on a payroll is far less expensive than putting people on unemployment and then trying to get them back into the workforce. Support small biz!","date":"Mon Mar 23 14:36:31 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Praying for you, Rachel and of course, Valentina. Blessings and peace to you all!","date":"Mon Mar 23 14:27:26 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Wow... how about taking care of the COVID19 crisis?","date":"Mon Mar 23 14:25:12 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Let’s be clear, Fed actions overnight by expanding their purchases of public and private debt have saved us from a disastrous market open after Senate Dems walked back an agreed upon deal. Time to get serious about a solution and the Fed Govt needs to bring help immediately.","date":"Mon Mar 23 13:07:14 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to the @GVSU Science Programs for donating 90,000 gloves  to help keep medical professionals here in #WestMichigan safe! https://t.co/UBAXgY4Abk","date":"Mon Mar 23 02:16:29 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Just wrapped up a meeting with  @briancalley to discuss the impact of #COVID19 on Michigan #SmallBiz and potential legislative action at the federal level. Thank you for being such a strong voice for small businesses and their employees! https://t.co/GKjbPi27f8","date":"Sat Mar 21 19:47:07 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a great story about one of my @FinancialCmte colleagues! But I can’t wait until this all passes so he can get back to making his other great product... the Honey Rye is exceptional!","date":"Sat Mar 21 19:26:50 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"So thankful for 2nd Dist food producers, processors and distributors who’s employees have continued to work so the rest of American can stay home during this crisis!","date":"Sat Mar 21 01:57:29 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks to our local businesses who are helping our community as we weather this #COVID19  #coronavirus storm together!    Amway makes free hand sanitizer for Spectrum Health, Kids’ Food Basket - https://t.co/eQyKurCIjj https://t.co/PIx7KldDqK","date":"Thu Mar 19 17:57:15 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks to great local companies who are pitching in as we confront our collective challenge! Way to go!!!\nCoppercraft Distillery to donate alcohol-based hand sanitizer | 2020-03-19 | Grand Rapids Business Journal #COVID19 #coronavirus  https://t.co/xUA5IgmvWk","date":"Thu Mar 19 17:49:16 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is a very positive action that will have a meaningful impact. I am glad to the Administration take this common sense and pro-active step to modernize Medicare and utilize telemedicine to provide quality care and keep seniors safe.  \nhttps://t.co/wVa4x5R4WL","date":"Tue Mar 17 19:17:20 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"As Chinese officials continue to promote conspiracy theories regarding #COVID19 it is utterly ridiculous for China to try and draw parity on this issue. It is crystal clear what the communist regime is doing.  (3/3)","date":"Tue Mar 17 17:56:46 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This isn't reciprocity, it's about control. American journalists work for independent organizations. The Chinese outlets here in America typically act as an extension of China's Communist Government.  (2/3)","date":"Tue Mar 17 17:56:17 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Banning American journalists from the @nytimes, @WSJ, and @washingtonpost from reporting in China is not only wrong, it is dangerous. This is how the communist regime in China controls the news during a pandemic.  (1/3)","date":"Tue Mar 17 17:55:46 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Kentwood Public Schools will begin food distribution for students tomorrow. Times, locations, and additional details are available here: https://t.co/wNshZBn57r","date":"Mon Mar 16 19:53:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"White Cloud Public Schools are also striving to meet the needs of their students. Times and details for food services are available below. https://t.co/aFhTrDvud6","date":"Mon Mar 16 14:43:13 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Ludington Area Schools is beginning food services for students today. Times and locations are available at the link below.  https://t.co/mHYsYR9ncv","date":"Mon Mar 16 14:39:22 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Baldwin Community Schools will begin providing meals for students tomorrow. Times, details, and locations are provided below. https://t.co/xkqMFFt2WD","date":"Mon Mar 16 14:26:26 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Here are the details for how and where families with students attending Muskegon Heights schools can pick up meals that were previously provided at school.  https://t.co/HDdg7hn7sA","date":"Mon Mar 16 14:09:32 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Here are the details for how Mona Shores Public Schools is enhancing food security for students in the district https://t.co/Pb6dXiTunh","date":"Mon Mar 16 13:59:15 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Here are the details for food services for students in Holland Public Schools  https://t.co/ImQRuC9MEx","date":"Mon Mar 16 13:56:42 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Schools across #WestMichigan are working to provide meals to students throughout their community. Here are the details for Muskegon Public.  https://t.co/Apu5MsDOID","date":"Mon Mar 16 13:55:15 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Very positive news out of @realDonaldTrump’s address this afternoon detailing how testing capacity will significantly increase. It’s great to see public-private partnerships play a critical role in keeping Americans safe. We must work together &amp; unify to confront the Coronavirus!","date":"Fri Mar 13 21:50:09 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tonight it was announced that there are multiple confirmed cases of #COVID19 in #WestMichigan. I am closely monitoring the situation and in contact with local health officials. Please remember to use commonsense measures like washing your hands to protect you &amp; your family. https://t.co/lyHgilDvMG","date":"Fri Mar 13 01:44:59 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":".@SpeakerPelosi the response from the House must be done in a cooperative and bipartisan manner. Please sit down with @GOPLeader and hammer out a substantive response that effectively addresses this pandemic as well as the health and economic effects stemming from it. (2/2)","date":"Thu Mar 12 01:46:06 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I was glad to hear @realDonaldTrump address the nation tonight with an urgent, pragmatic, and unifying message. I look forward to seeing his proposals in greater detail. (1/2)","date":"Thu Mar 12 01:43:36 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks for coming in! It’s always great to sit down and talk with growers from #WestMichigan!","date":"Wed Mar 11 19:40:24 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Getting ready to talk about the news of the day and how it impacts Michigan on @Varneyco! Tune in!!! https://t.co/CiRQKH71Ki","date":"Wed Mar 11 14:11:50 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Pro-growth policies that put hardworking Americans first just delivered another incredibly strong jobs report! More jobs, greater opportunity, and continued wage growth is all very positive news! https://t.co/yiN70KhBiz","date":"Fri Mar 06 14:15:10 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Can you imagine the MSM outrage if a Republican Leader had done the same??? As I tell my kids, if it wasn’t for a double standard some people would have no standards at all...","date":"Thu Mar 05 01:13:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"All the best to a great family with an eye for what’s truly important! Go get ‘em guys!!! How Michigan's best high school player landed in spring training in 2020 https://t.co/Mv5WfDLsgN","date":"Wed Feb 26 01:55:02 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"@muskegonctc You’re most welcome! Keep up the great work!","date":"Tue Feb 25 17:16:10 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"@LeonHendrix @MrsLeonHendrix @WOODTV Congratulations @LeonHendrix &amp; @MrsLeonHendrix!","date":"Sat Feb 22 12:11:30 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @GVSU for continuing to be a leader in supporting student veterans! #WestMichigan","date":"Thu Feb 20 18:21:10 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good #ProGrowth news! Consumer sentiment nears 15-year high! \"Consumers mentioned improved incomes and wealth more than any time since 1960, most likely reflecting a stock market that’s surged to record highs as well as rising wages.\" reports @MarketWatch https://t.co/ryqVVzo0gT","date":"Fri Feb 14 21:04:47 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! The President's FY21 Budget fully funds the #GLRI! This bipartisan program is critical to preserving &amp; protecting the Great Lakes. Last year, @RepJackBergman, @RepMoolenaar, &amp; I discussed the importance of the GLRI w/ POTUS. This budget delivers on his promise to #MI!","date":"Mon Feb 10 19:56:15 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This week the House passed legislation authorizing funding to preserve, protect, and strengthen the #GreatLakes.  The #GLRI has consistently delivered positive results in #WestMichigan. I hope the Senate acts quickly to pass this important legislation.\nhttps://t.co/YEJ23UlEOk","date":"Fri Feb 07 19:37:46 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The event is for #WestMichigan veterans and will be held from 10 AM -2 PM today in Holland! If you know a veteran in our community, please share the word!","date":"Thu Feb 06 11:19:58 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"About to join @Varneyco live to talk about the President’s State of the Union, our economy, and impeachment. Tune in to @FoxBusiness! #WestMichigan https://t.co/fm47y0C3NA","date":"Wed Feb 05 16:30:10 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see new construction, investment, and opportunity continue to grow in Muskegon! #WatchUsGo https://t.co/3iIfG7SLoU","date":"Tue Feb 04 16:14:46 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was great to join @realDonaldTrump aboard Air Force One today to discuss a host of issues important to #WestMichigan including the impact of the #USMCA,  protecting the Great Lakes, the Soo Locks, erosion mitigation, and fair trade for speciality crops growers! https://t.co/d9DQyZuYv3","date":"Thu Jan 30 23:36:14 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"#TBT to the oldest known picture of Mackinac Island. Thanks @MLive and @Mshp for showcasing some of Michigan's unique history! https://t.co/oNpLBEvjfF","date":"Thu Jan 30 15:28:18 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Modernizing our trade relationship with Mexico and Canada is vital to Michigan’s economy. Estimates show that 65% of Michigan’s exports head to either Mexico or Canada. The #USMCA will create new opportunities for Michigan while supporting economic growth here in #WestMichigan. https://t.co/7KFswUBcGv","date":"Wed Jan 29 23:26:37 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Many people doubted President Trump's ability to renegotiate NAFTA in a manner that would benefit hardworking Americans. With the signing of the #USMCA, the President delivered a bipartisan win for American families, workers, manufacturers, and small business job creators. https://t.co/SmTktZ6DDY","date":"Wed Jan 29 21:14:43 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"While our nation's southern border often garners the most attention, integrity along the border is important everywhere! Thank you to the men and women at @CBP here in Michigan that work tirelessly to keep our communities and our nation safe!\nhttps://t.co/PKPTKscPIG","date":"Wed Jan 29 19:15:06 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great to see you this morning Roger! A great day for #WestMichigan! Enjoy the #USMCA ceremony!","date":"Wed Jan 29 15:56:23 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to the Wyoming-Kentwood Chamber on marking 40 years of supporting opportunity, job creation, and small businesses in #WestMichigan!","date":"Wed Jan 29 15:32:36 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"#GoodNews! Consumer confidence beats expectations, jumps as job-market outlook improves per @CNBC.  https://t.co/Pkmp28w2xT","date":"Tue Jan 28 15:34:06 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"More #MadeInMichigan good news! Grand Rapids ranks No. 3 among large cities for ‘thriving’ manufacturing! @GRBJ has the details here https://t.co/J4WXJver4p","date":"Mon Jan 27 20:18:34 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is some of the impact #erosion is having in Muskegon County that I was able to observe yesterday thanks to the @USCG. #WestMichigan #GreatLakes https://t.co/cjUVB9CCgK","date":"Sat Jan 25 13:04:09 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Erosion has been severe up and down the lakeshore. Here is what I was able to observe just south of Ludington aboard a helicopter with the @USCG.  #GreatLakes #WestMichigan https://t.co/p3E55KTcxr","date":"Fri Jan 24 20:09:00 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Here’s a view from above of the erosion that has taken place between Grand Haven and Holland in Ottawa County. https://t.co/yEXmWjZHX3","date":"Fri Jan 24 18:43:23 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"The damage along the shore is very severe in some areas. Here is a sample of the impact erosion is having in Ottawa, Muskegon, and Oceana counties. https://t.co/BtiMGBFEwu","date":"Fri Jan 24 17:00:44 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"I am heading out with the @USCG to survey high water and erosion damage  to #WestMichigan communities along the shores of Lake Michigan. Thank you to the incredible men and women serving in the Coast Guard for this unique opportunity. https://t.co/WmkY0D1sTC","date":"Fri Jan 24 15:40:40 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @FlyGRFord on another record breaking year! This demonstrates the economic opportunity present in #WestMichigan as well as desire for people from across the globe to visit our community! https://t.co/BQPsiqqxyO","date":"Thu Jan 23 21:10:27 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today's call follows the letter I sent to Ambassador Lighthizer on Friday calling for the @USDA, @CommerceGov, and @USTradeRep to hold a field hearing in #WestMichigan.  (3/3) https://t.co/EPTtRhrVEG","date":"Wed Jan 22 16:36:51 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Michigan growers continue to experience the negative impact of questionable foreign trade practices. With significant progress and momentum being made on trade regarding the #USMCA and the phase one agreement with China, specialty crop growers should be made a priority. (2/3)","date":"Wed Jan 22 16:36:51 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"This morning I had a call w/ the chief agriculture negotiator from @USTR, @RepJackBergman, &amp; @RepMoolenaar about trade opportunities for Michigan cherries. On the call, I requested the USTR come to #WestMichigan, and hear directly from local farmers. (1/3)","date":"Wed Jan 22 16:36:51 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! FloraCraft in Ludington is making a $2.5 million investment to expand its operations! It's great to see manufacturers continue to invest and expand here in #WestMichigan.  #MadeInMichigan\nhttps://t.co/2dDV2Rub0q","date":"Wed Jan 22 15:03:51 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"MI asparagus, blueberry, and cherry growers are competing on a playing field that is tilted against them. I am calling on the @USDA, @CommerceGov, &amp; @USTradeRep to come to #WestMichigan and hear directly from MI farmers about foreign trade practices.\nhttps://t.co/WWTx11DL2d","date":"Tue Jan 21 21:44:18 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was great to join students, community leaders, and residents of the Greater Muskegon area this morning at @MuskegonCC’s MLK Unity Breakfast. Thank you for continuing to have an open dialogue on the issues impacting Muskegon, #WestMichigan, and our nation.","date":"Fri Jan 17 17:51:09 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Way to go Team Black River! When we had a chance to meet at school I could tell you would go far... I hope we can see each other in DC!\nBlack River We the People team wins first state championship - News - Holland Sentinel - Holland, MI.  https://t.co/J0Xakcqy9D","date":"Thu Jan 16 20:03:07 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Big News! The #USMCA just passed the Senate and is heading to President Trump's desk. This modernization of our trade partnership with Canada and Mexico will benefit Michigan agriculture, manufacturing, and most importantly hardworking Michiganders! #WestMichigan #Opportunity","date":"Thu Jan 16 17:15:30 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Just saw you @realMikeLindell along with @JackBrewerBSI on w @MariaBartiromo and you are an inspiration! I can’t wait to read your new book! @MorningsMaria","date":"Thu Jan 16 12:57:43 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you for making this incredibly powerful point @RepBrianMast.","date":"Wed Jan 15 03:34:48 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see another innovative #tech business choose to expand and create jobs in #WestMichigan! Welcome to Holland @ngcgroup! https://t.co/dOT2kTY9sB","date":"Tue Jan 14 18:17:48 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"@LukeStier @NickLaFave @JamalWZZM13 The lost art of the mid-range jumper.","date":"Tue Jan 14 18:09:53 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"@CortesSteve @MikeBloomberg This is a must watch...","date":"Mon Jan 13 16:22:56 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"Based on the information I received from General Milley, the Chairman of the Joint Chiefs Staff, the President moved on actionable intelligence to protect America, our diplomats, and our troops by eliminating the chief architect of terrorism across the Middle East.","date":"Thu Jan 09 23:31:15 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"While a potential escalation with Iran should be taken very seriously, the non-binding show vote put forward by Speaker Pelosi and Congresswoman Elissa Slotkin has no enforcement and looks more like a political statement than any sort of legislative response.","date":"Thu Jan 09 23:31:15 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"While there is lots of talk surrounding an #AUMF &amp; Iran that's not what is happening. Democrats have drafted an unserious resolution that by design cannot become law. This is a show vote that changes nothing and does not place limits on the President.","date":"Thu Jan 09 15:31:51 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"By attacking our men and women in uniform, Iran has made a major mistake. While I am thankful initial reports indicate no American casualties, I continue to pray for the safety of our troops on the ground as well as our decision makers.","date":"Wed Jan 08 03:52:49 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"A new FBO is under construction at GRR. It's great to see continued job creation, investment, and growth involving @FlyGRFord! https://t.co/83PhfzNtlj","date":"Mon Jan 06 15:52:12 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"For years Iran has killed American troops and conducted terror operations throughout the Middle East and beyond. The actions taken by the Administration demonstrate that the United States will hold Iran, the world’s leading state sponsor of terror, accountable.","date":"Fri Jan 03 04:47:35 +0000 2020","user_id":"233949261"},{"handle":"RepHuizenga","text":"As a community and as a country we must stand against attacks intended to instill fear in people of faith. Those seeking to do harm because of another person’s religious beliefs must be unequivocally rejected. We cannot allow anti-Semitic behavior to go unchallenged.","date":"Mon Dec 30 02:06:17 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #USMCA will strengthen our economy, create jobs, and provide new opportunities for communities around Michigan and across the nation. House passage of the USMCA is a win for Michigan workers, farmers, and job creators! https://t.co/0bVv2Lf1Ev","date":"Fri Dec 20 01:19:07 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Heading to the House floor to talk about the importance of the #USMCA and the positive impact it will have on #WestMichigan, #Michiganders, and our nation.  You can turn on @cspan to follow the debate.","date":"Thu Dec 19 17:18:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A great #WestMichigan story. Thanks for sharing this one @ghtribune!","date":"Thu Dec 19 14:08:02 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@NickLaFave unnecessary and inappropriate.","date":"Thu Dec 19 02:35:55 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@KarenJoseph20 @tysonwevers11 Actually he’s sitting right next to me Karen. Have a good evening.","date":"Thu Dec 19 02:12:53 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tonight, I voted against both highly partisan articles of impeachment. The actions taken by Speaker Pelosi and Adam Schiff during this process set a dangerous precedent for the future of our nation. You can read my full statement on impeachment here: https://t.co/lvSuv5LMvQ https://t.co/IEo5pmuTEl","date":"Thu Dec 19 02:12:05 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sen Mike Lee just walked onto the House floor to watch the proceedings.","date":"Thu Dec 19 00:52:58 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Hey Norm, if you were so close maybe you would know he went by “Jerry”, not “Gerry”... a common mistake for those who aren’t friends of the family.","date":"Thu Dec 19 00:39:31 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"2/2 Is it no longer necessary to break the law to be impeached as in all past impeachments? How would Pres Obama’s self-labeled “extra Constitutional” actions such as DACA, etc NOT be an impeachable offense? Will Impeachment become a regular political weapon? Yes, to the last Q..","date":"Wed Dec 18 17:48:37 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sitting on the House Floor I can’t help but reflect on my time as a staffer during the Clinton impeachment and my experience as a Member during the Obama era. Today’s 2nd Article dramatically changes the threshold of an impeachable offense. One must ask questions such as: 1/2","date":"Wed Dec 18 17:42:59 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"If this were true, why did so many Democrats vote for impeachment before the Ukraine call even took place?","date":"Wed Dec 18 17:18:51 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Developing: #FISA Court accuses FBI agents of giving misleading basis for warrant via @thehill https://t.co/ZDo5btwjNa","date":"Tue Dec 17 20:57:17 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@AndyTJohnston @USChamber Thanks Andy!","date":"Tue Dec 17 17:07:49 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"#GoodNews ! @Ford has announced plans to invest $1.45B in Michigan and will create 3,000 new jobs! https://t.co/xpi6qEClc9","date":"Tue Dec 17 17:07:09 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congrats @NavyFB!","date":"Sat Dec 14 23:57:33 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 383rd Birthday to the @USNationalGuard! Thank you to the incredible men and women who have served our communities and our nation as members of the Guard! #Guard383","date":"Fri Dec 13 21:01:08 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Climate change: Methane pulse detected from South Sudan wetlands - BBC News... Hey! I thought it was just US power plants and cars that are to blame for global warming... oops.  https://t.co/FS27WMlaPW","date":"Wed Dec 11 15:32:05 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great news! The House just unanimously adopted my amendment to H.R. 729, the Coastal and Great Lakes Communities Enhancement Act, to help protect the shorelines along the #GreatLakes from erosion! #WestMichigan","date":"Tue Dec 10 21:10:23 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Michigan hunters are giving back to the community in a major way by providing 232,000 meals to help feed those in need over the holidays! Thank you for your generosity! #WestMichigan #2A #Sportsmen https://t.co/k6bwJcOGdz","date":"Tue Dec 10 02:25:33 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sawyer’s commitment and dedication to our men and women in uniform serves as an example for all of us! #ThankYou @NBCNews for highlighting Sawyer’s support for our troops! #WestMichigan  #SundayMotivation","date":"Sun Dec 08 19:25:14 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to all of the students who became a #GVGrad today! I wish you all the best as you take your next steps in life! #GVSU #WestMichigan https://t.co/9emBrVcuee","date":"Sat Dec 07 19:35:27 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"#Adoption is such a gift! Thank you @TODAYshow for highlighting what a special place #WestMichigan truly is! \n\nhttps://t.co/NsSNzb2AZV","date":"Fri Dec 06 15:28:53 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! @WSJ reports long U.S. Jobs Boom gets longer as #smallbiz accelerates hiring https://t.co/7dNCoDl70g","date":"Thu Dec 05 17:53:47 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"What an incredible view of #PureMichigan!","date":"Thu Dec 05 17:01:49 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was great to hear from @VP this morning at the @HouseGOP conference meeting. Instead of partisan politics, we need to focus on issues that move our nation forward like #NDAA to support our troops and the #USMCA to support Michigan manufacturing, jobs, and agriculture! https://t.co/zmThMfZEmP","date":"Wed Dec 04 15:02:06 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to Grand Rapids Catholic Central on a dominating and shutout performance (44-0) to bring home the state title! #WestMichigan https://t.co/UntGAgGxbk","date":"Sat Nov 30 15:50:51 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to the Mona Shores Football Team on winning the first state championship in program history! #MHSAA #WestMichigan #GoSailors https://t.co/2hdasEOwvT","date":"Fri Nov 29 21:54:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to the @USPS staff in Ludington for helping Sawyer deliver holiday cheer to our men and women in uniform serving around the nation and the world! #Thankful #WestMichigan https://t.co/dd32VfFgRN","date":"Wed Nov 27 01:10:40 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@larryfigurski Heal up quick Larry!","date":"Mon Nov 25 16:01:15 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It’s great to see investment continue at GRR! @FlyGRFord continues to expand economic opportunities and provide a better experience for travelers who call #WestMichigan home as well as those visiting! https://t.co/hpriFUmDc0","date":"Fri Nov 22 16:38:34 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I am glad to see the House pass this important bipartisan measure! I hope the Senate will act in a similar manner.","date":"Tue Nov 19 00:18:36 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"H.R. 4344 strikes a delicate balance by ensuring that the SEC has the necessary tools to go after bad actors and prevent these sophisticated fraudsters from keeping the money they have stolen from our teachers, military service personnel, seniors, and religious-affiliated groups.","date":"Tue Nov 19 00:18:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The latest report from the SEC found that over 1.1 billion dollars that has been swindled from investors through fraudulent activity is unable to be recovered because of a 2017 Supreme Court decision.","date":"Tue Nov 19 00:18:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tonight, the House passed my bipartisan bill with @RepBenMcAdams to hold criminals accountable and help Main Street investors recover their losses by a vote of 314-95.","date":"Tue Nov 19 00:18:34 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations on your promotion Chief Roberts! Thank you for continuing your service in Kentwood! #WestMichigan https://t.co/qIPO9dHxXY","date":"Thu Nov 14 20:09:20 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a truly inspiring visit with these students today! Thanks to @bdavisHPS and the rest of the staff for  having me join you at HVRT and HEC #right to see your work in action!","date":"Wed Nov 06 22:25:44 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to the Jenison and Muskegon Reeths Puffer Marching Bands for winning your respective flights this weekend at the state competition. It's great to see so many #WestMichigan students performing at such a high level!\n\nhttps://t.co/9PMrdKGwmS","date":"Wed Nov 06 16:30:01 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Huizenga, Michigan colleagues request streamlined federal, state permitting process via the @RiponAdvance https://t.co/e92fQTuqFA #WestMichigan #GreatLakes","date":"Tue Nov 05 21:29:23 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! The October Jobs Report beat expectations with 128,000 jobs created. Wages showed good growth, and the number of jobs created in August and September was revised to include the creation of an additional 95,000 jobs! #Economy #WestMichigan","date":"Fri Nov 01 13:41:34 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Actually, @PolarBarrett I sent my request into the Intel Comm exactly  one week ago. I’m still waiting for a reply from the Committee, Rep Schiff or Speaker Pelosi...","date":"Tue Oct 29 15:03:00 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Officer Glass! Thank you for your willingness to protect and serve #WestMichigan! Walker is blessed to have you! https://t.co/4DWNHhzRVV","date":"Tue Oct 29 01:44:24 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Removing al Baghdadi from the battlefield is a victory for the United States and freedom loving people across the globe. By eliminating the leader of ISIS, it shows that terrorists can run, but justice will find them. (1/2)","date":"Sun Oct 27 17:41:54 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to our elite special forces who risked their lives to make the world a safer place. (2/2)","date":"Sun Oct 27 17:41:54 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"And I join @SpeakerBoehner who who tweeted “correct” when he confirmed this from @brithume   As I discussed on @1450whtc this morning, @SpeakerPelosi and Dems are violating House Rule XI by denying me &amp; @HouseGOP access to all non-classified information.","date":"Fri Oct 25 00:53:11 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Unacceptable behavior does not excuse unacceptable behavior, in either direction... but protecting the institution of the House by pointing out unprecedented actions by Dem leadership is not “unproductive rhetoric”.","date":"Fri Oct 18 20:15:08 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Supreme Court will hear challenge to Consumer Financial Protection Bureau. And it is about time... we need clarity whether CFPB can continue to operate outside of legal precedents. Next we need to put its budget under Cong review like every other agency! https://t.co/hDH5kodBTl","date":"Fri Oct 18 20:06:23 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's amazing to have #WestMichigan native @Astro_Christina make history today as part of the first #AllWomanSpaceWalk! Congratulations to Christina and @Astro_Jessica!","date":"Fri Oct 18 12:47:28 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to Patty Vandenberg over at @1450whtc on marking 40 years at the station! Thank you for always being a friendly voice and smiling face for the Holland Community!","date":"Thu Oct 17 20:07:36 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I believe the decision to withdraw from Syria is the wrong decision. Today I voted with a strong bipartisan majority in support of the Kurds and against the withdrawal.","date":"Wed Oct 16 21:06:02 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great news for #Muskegon County! It was just announced the #GLRI will play a leading role in cleaning up the area of concern next to Muskegon Lake. This is another great example how the GLRI has a direct impact on #WestMichigan and the #GreatLakes region! https://t.co/23aNyav6gH","date":"Wed Oct 16 19:03:15 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I am glad to see the #WestMichigan community rally and show strong support for Temple Emanuel in Grand Rapids. The disgusting anti-Semitic behavior displayed over the weekend has no place in our community.  https://t.co/gnxYjIVZ04","date":"Tue Oct 15 20:36:18 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"This was an incredible day! It was awesome to see the community come together to help Melvin. Thanks for highlighting this @NickLaFave and @wzzm13!","date":"Tue Oct 15 00:35:36 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 244th Birthday to the @USNavy! Thank you to the brave men and women from #WestMichigan and around the country who are currently serving or have served to keep our nation safe!","date":"Sun Oct 13 22:51:07 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! Three more companies are investing and expanding in Holland Charter Township. This means more new opportunities and new jobs are being created right here in #WestMichigan! https://t.co/1e9tnEUVrs","date":"Wed Oct 09 13:15:53 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@MrJustinBarclay don’t forget to wish @RickAlbinWoodTV a happy birthday!!!","date":"Wed Oct 09 12:51:08 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was great to join @Varneyco today to discuss the ongoing negotiations between GM and the UAW, how #WestMichigan is being impacted, and the #USMCA! https://t.co/XXXeGeaAjw","date":"Tue Oct 08 17:43:13 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tune in! I’m getting ready to talk GM/UAW negotiations and more on @FoxBusiness’ @Varneyco!","date":"Tue Oct 08 14:42:21 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@chicagotribune ed board on the impact of pro-growth policies: \"federal initiatives to reduce inequality produced slow economic growth for many years after the Great Recession, federal tax reform and deregulation have, by contrast, driven robust hiring.\" https://t.co/mSeRzBW8wS","date":"Tue Oct 08 13:24:55 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"America cannot lead from behind on #Syria. A withdrawal here abandons our Kurdish allies and emboldens those who seek a much different outcome than the United States.","date":"Mon Oct 07 22:58:24 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to the @CityofHolland on winning the #AmericaInBloom award! #TulipTime #PureMichigan\n\nhttps://t.co/tf5GQ2MP8K","date":"Mon Oct 07 13:46:47 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy Birthday to my friend @SteveScalise! Thank you for being an inspiration, a thoughtful conservative leader, and for standing up to protect those who cannot speak for themselves! https://t.co/weivV1rfB6","date":"Sun Oct 06 21:44:49 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"We cannot allow this abhorrent act to repeat itself.  I am proud to stand with my colleagues in support of the dignity and value of life.","date":"Tue Oct 01 21:00:20 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Awesome news #WestMichigan! Congratulations Donavan!","date":"Tue Oct 01 19:30:59 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to my friend @RepDaveJoyce on being named Co-Chair of the Great Lakes Task Force! I look forward to working with Dave even more in this new role to  preserve, protect, and strengthen the #GreatLakes!","date":"Fri Sep 27 20:31:27 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Unbelievable - Democrats in the House are putting health care for illegal immigrants ahead of the care of our veterans. Totally misguided.","date":"Thu Sep 26 21:34:29 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@detnews ed board on #USMCA:  \"This shouldn't be about granting or denying Trump a key economic victory ... It should be about doing what's right for America's manufacturers, farmers and workers.\" @SpeakerPelosi it's time to have a vote on the USMCA! https://t.co/XPUEexcGBy","date":"Wed Sep 25 19:15:54 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Calling for an impeachment inquiry before fully grasping what was discussed isn’t in defense of the Constitution, it’s merely a craven political move to try to invalidate millions of Americans who voted to elect President Trump. Full statement here: https://t.co/HBVKJ5dWHy","date":"Tue Sep 24 22:37:58 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good working with you on this Ben. I am glad to see a strong showing (49-5) in the Financial Services Committee in support of our bipartisan effort!","date":"Sat Sep 21 15:19:52 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Interesting news tonight out of SE Michigan. @Local4News reports that Amazon is considering the old Pontiac Silverdome site as a location to create 1,500 full time jobs! Read more here: https://t.co/tFTmtoQNuu","date":"Thu Sep 19 00:57:00 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @plascoreinc! It's great to see investment, expansion, and new job creation continue to take place here in #WestMichigan","date":"Tue Sep 17 18:08:44 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@MarleeGinter Congratulations Marlee! Blessings to you and your family!","date":"Tue Sep 17 13:37:14 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I’ll be joining @foxnews just after 1 PM today to talk about how attacks in Saudi Arabia and a potential UAW strike would impact the economy. Tune In!","date":"Sun Sep 15 16:49:00 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's hard to believe that 18 years have passed since terrorists attacked our nation on #September11th. We must #neverforget the lives lost that day or the courage and selflessness displayed by first responders. https://t.co/zYeupx4TSF","date":"Wed Sep 11 14:22:39 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #USMCA is critical for Michigan's economy. Both agriculture &amp; manufacturing will benefit from modernizing our trade relationship with Canada &amp; Mexico. @SenStabenow &amp; @SenGaryPeters let's strengthen our economy, create new jobs, and support new opportunities for Michiganders! https://t.co/NPRtKfEt16","date":"Tue Sep 10 14:50:36 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today, House Republicans are holding a hearing on the #BornAlive Survivors Protection Act. Babies that survive an attempted abortion deserve protection. This shouldn't be a partisan issue. @SpeakerPelosi #LetUsVote! WATCH LIVE HERE at 1PM: https://t.co/dpZIVdIhBi #EndInfanticide","date":"Tue Sep 10 13:51:43 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see the #GLRI continue to have a positive impact on #WestMichigan and the #GreatLakes as a whole. Congratulations to the Macatawa Area Coordinating Council on receiving this grant to protect, preserve, and improve the Macatawa Watershed! https://t.co/Xqzm3v17nt","date":"Mon Sep 09 19:55:11 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to everyone who joined in today’s #DayOfCaring in Muskegon Heights! It was awesome to see students and community members from across #WestMichigan come together to help Melvin, a @USArmy veteran, with home repairs, painting, clearing old fencing, and cleaning up brush! https://t.co/aGq4IzbI69","date":"Fri Sep 06 15:10:28 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"#SmallBiz is the engine of our economy and according to the latest @NFIB study \"A great U.S. job market for workers at small firms got a little better in August\" per @FreemanWSJ #GoodNews  https://t.co/MyUt1ZI468","date":"Thu Sep 05 19:42:23 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Dutch resistance hero Diet Eman dies at 99 - https://t.co/eQyKurUjHT I had the privilege of meeting this amazing woman a couple of years ago when my daughter danced a part in Turning Pointe School of Dance’s original ballet about Diet’s incredible life.  https://t.co/12wR9WPKuz","date":"Thu Sep 05 02:38:37 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to the incredible first responders, volunteers, and power company employees from #WestMichigan who are prepared to help communities when Dorian makes landfall along the coast. #StaySafe  https://t.co/oXkPy9UVuD","date":"Tue Sep 03 10:50:07 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"#ProjectElevateGR will have a big impact not only on @FlyGRFord but #WestMichigan as a community as well! #GreatNews!","date":"Fri Aug 30 11:53:59 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Project Elevate will take @FlyGRFord  and #WestMichigan into the future. This expansion will make West Michigan an even better place to live, work, and visit. Congratulations to Dan, Floyd, and the entire team at GRR!  https://t.co/Apa33F8o6B","date":"Thu Aug 29 20:45:47 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Nearly 300 positions are available as @Cheesecake prepares to open here in #WestMichigan later this year. https://t.co/h9DavRlKea","date":"Thu Aug 29 20:33:43 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Please read, share, and keep this in mind! @Freep reports: IRS impostors are using fake emails to trick you: How to spot a scam https://t.co/gxKk70rv1Y","date":"Thu Aug 29 15:02:54 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"When @RepSeanDuffy resigns next month the US House &amp; @FinancialCmte will lose a great legislator, phenomenal colleague &amp; good friend. However, @RCamposDuffy and the Duffy Clan (esp new baby girl Duffy!) will be blessed in this decision. Praying for you in this next life journey!","date":"Mon Aug 26 18:00:58 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Awesome!","date":"Fri Aug 23 00:50:10 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"#WestMichigan! If you are looking for something fun to do this week, check out the @HudsonvilleFair! They have 4-H events, games, and entertainment for children of all ages! https://t.co/hgGSudVh44","date":"Wed Aug 21 12:02:11 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Beware of dangerous conditions today on Lake Michigan. It is likely a 🚩day. Forecasts indicate more favorable conditions later this week. Please use caution, enjoy the beach, and stay safe! https://t.co/vBin331v6M","date":"Wed Aug 21 11:14:40 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Russ’ on celebrating 85 years of serving up good food and great memories in #WestMichigan! https://t.co/A87zvWFzja","date":"Tue Aug 20 10:33:32 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @WOODTV on celebrating 70 years! Thank you for all you do to report on and share the stories impacting #WestMichigan!","date":"Thu Aug 15 13:52:20 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"BTW - Who wants to see some #TBT photos of @RickAlbinWoodTV? @WOODTV you've got to have some classics cc: @terrideboer @lynseymukomel","date":"Thu Aug 15 13:52:20 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Exciting job news in downtown GR!","date":"Wed Aug 14 16:27:49 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A Tribute to Ann Huizenga https://t.co/MWeDlbcAyF","date":"Tue Aug 13 20:12:31 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Our family is saddened at the loss of our mother and grandmother, Ann who went to be w our Lord on Monday. \nMom was a strong &amp; determined woman who fought through difficulties growing up in Depression-era Flint MI. She loved music, dance, art, &amp; travel but most of all her family.","date":"Tue Aug 13 20:04:49 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congress needs to put partisanship aside and act to preserve the Great Lakes.","date":"Mon Aug 12 16:23:27 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"This new study raises the stakes even further for protecting the Great Lakes. If Asian carp enter Lake Michigan it will permanently damage both the ecosystem as well as the economy created by the Great Lakes. https://t.co/bDOj6RB93H","date":"Mon Aug 12 16:23:26 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@TeamBizStream's expansion is another sign of growing economic opportunity and strength. It's great to see #smallbiz continue to create good-paying jobs in #WestMichigan!","date":"Fri Aug 09 18:59:24 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Did you know Michigan ranks 3rd in the nation for farm markets? If you pass by one, stop and take a look. This is a great way to support #WestMichigan farmers and #SmallBiz! #FarmersMarketWeek","date":"Thu Aug 08 15:24:34 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"We are so fortunate to have the beautiful beaches along the shores of Lake Michigan, but please remember to check conditions, watch for the flags, and follow resources like @NWSGrandRapids. \nhttps://t.co/vPXYseqYYV","date":"Thu Aug 08 14:36:27 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@ReutersUS reports - U.S. weekly jobless claims fall; labor market strong.  https://t.co/nQ7BkaJVoH","date":"Thu Aug 08 13:57:33 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I believe no one should be denied coverage because of a pre-existing condition. If SCOTUS strikes down ObamaCare @RepRiggleman, @RepAnnWagner, @RepNewhouse, Rep @HerreraBeutler &amp; I have introduced a bill to protect individuals w/ pre-existing conditions. https://t.co/Uqt1Pa9T3J","date":"Tue Aug 06 15:55:29 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 229th Birthday to the @USCG! Thank you to the incredible men and women serving in #WestMichigan, across the #GreatLakes, and around the nation! https://t.co/IpCrAZLSR8","date":"Sun Aug 04 17:33:12 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to the hardworking men and women at  @DHSgov, @ICEgov, and @USMarshalsHQ for making #Michigan safer by capturing this fugitive.  #HumanTrafficking is a scourge that must be fought at every level.  https://t.co/l6aqg4hehE","date":"Thu Aug 01 19:45:52 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Big News in Newaygo County! A $9 Million investment was announced just south of White Cloud! It’s great to see manufacturers continue to expand across #WestMichigan! @MiBiz has more below  https://t.co/rP8cqf37yP","date":"Wed Jul 31 13:29:08 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Don’t forget to stop in, shop, and support Grand Haven’s small businesses during Coast Guard Festival! #WestMichigan #PureMichigan #ShopSmall https://t.co/bCBwYOWbF6","date":"Tue Jul 30 12:57:03 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Lt Col Bancroft-James!  Thank you for your service! 🇺🇸🇺🇸🇺🇸","date":"Tue Jul 30 12:46:13 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Be sure to watch the flags at the beach and adhere to these advisories. These waves and conditions need to be taken seriously. Enjoy the #WestMichigan beaches, but please use caution and stay safe!","date":"Mon Jul 29 12:03:18 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to all the hardworking farmers across West Michigan who help feed families in our community, country, and around the globe.","date":"Thu Jul 25 19:17:08 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"More opportunity, more jobs, more investment - it's great to see another manufacturer expand in #WestMichigan!   https://t.co/GwAAUwLK3F","date":"Thu Jul 25 14:21:47 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today we honor and remember Officer Chestnut and Detective Gibson who bravely made the ultimate sacrifice while protecting the @uscapitol on this day in 1998. #ThinBlueLine https://t.co/1CAxm6Y6zK","date":"Wed Jul 24 23:26:17 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"In case you missed it: Today, I joined an overwhelming bipartisan majority in voting to crack down on abusive robocalls.  https://t.co/h6YvyyorkV","date":"Wed Jul 24 21:25:17 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Family-owned Roskam Baking Company is expanding and creating 238 jobs and investing $85.2 million in Kentwood! #GoodNews #WestMichigan https://t.co/efcPEernXH","date":"Wed Jul 24 20:03:37 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"BIG NEWS: @meadjohnson is investing $67.7 million in Zeeland! This significant investment will include building a new facility, purchasing new equipment, and creating 39 new jobs according to @grbj. This is great news for #WestMichigan! https://t.co/uuR2ekm1QW","date":"Thu Jul 18 20:00:37 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Another sign that the economy is working for Americans across all walks of life!","date":"Thu Jul 18 15:45:01 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"America needs less politics and more solutions. In my view, the past six months in the House have been more about scoring political points and performing political theatre than solving problems.","date":"Tue Jul 16 23:17:13 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I view this resolution as a continuation of that flawed behavior which is why I voted against it.  Everyone needs to come to the table and get to work on the issues West Michigan and the nation expect Congress to address.","date":"Tue Jul 16 23:17:13 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"More good #WestMichigan economic news. American Chemical Solutions is investing over $15 million in Muskegon to open a manufacturing plant that will create approximately 40 new full time jobs! https://t.co/j2CoBQyDsM","date":"Tue Jul 16 13:15:41 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"We are better than this, let’s start showing it.","date":"Mon Jul 15 17:20:32 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I strongly disagree with what the President said in a series of tweets over the weekend. Every duly elected official needs to lead by example, end the personal character assassination attacks, and focus on finding ways to work together to make America the very best it can be.","date":"Mon Jul 15 17:20:32 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Honored to join my friend &amp; colleague ⁦@CarolynBMaloney⁩ today in fully funding the 9/11 1st Responders compensation fund. She has been a champion of this cause for many years (w the ever present NYFD coat!) Blessings to the 1st Responders. ⁦@RepMaloney⁩ #NeverForget https://t.co/4WmflZExsO","date":"Fri Jul 12 17:49:05 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"\"#USMCA will boost Michigan economy and jobs.\" A very informative read in the @detroitnews on the important and significant trade relationship Michigan has with Canada and Mexico.  #MadeInMichigan #MustRead https://t.co/lLD2b6a1Ry","date":"Thu Jul 11 15:18:01 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"625 new jobs - that's great news!  It's fantastic to see significant manufacturing investments, expansions, and new builds continue to take shape across Michigan. #MadeInMichigan  https://t.co/tlenbfTs8P","date":"Wed Jul 10 18:10:23 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today the House passed 3 bipartisan Financial Services Committee measures that I played a leading role in. HR 2919, H Res 456 and HR 2515 all serve as examples of how bipartisan #results can be achieved even in today’s deeply divided Washington. #WestMichigan","date":"Wed Jul 10 00:23:22 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Back to Back World Cup Champions! 🇺🇸🇺🇸🇺🇸🇺🇸 Congratulations @USWNT!","date":"Sun Jul 07 23:20:56 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"🇺🇸🇺🇸🇺🇸🇺🇸","date":"Sun Jul 07 14:55:59 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"This flag proudly flew on one of the 1st landing craft to hit Normandy, commanded by Lt. Vander Beek who kept it until his death. Two Dutch businessmen hope to give it back to the US as a token of thanks for liberating the Netherlands and Europe. ⁦@usembthehague⁩ https://t.co/8EEOLGcE9o","date":"Thu Jul 04 22:04:12 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great day at the US Embassy in the Netherlands w Amb ⁦@petehoekstra⁩ and over 1,200 guests! Daughter Alexandra sang both the US and Dutch Natl anthems to kick the day off and lots of great displays, including the “D-Day Flag”, a prized Dutch possession destined for the US! https://t.co/IcpKDSEN8Q","date":"Thu Jul 04 21:55:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @USWNT! 🇺🇸🇺🇸🇺🇸 what a game! #OneWinAway","date":"Tue Jul 02 21:07:06 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"What an amazing act of generosity and kindness. https://t.co/DXbCdcbbmF","date":"Mon Jul 01 15:14:39 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A historic moment. Not many people can say they expected this event to take place.","date":"Sun Jun 30 13:00:24 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Rest In Peace Lou. Thank you for your unforgettable actions as a 9/11 first responder as well as your advocacy.","date":"Sat Jun 29 15:22:55 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you for your incredible 41 years of service Chief Walker. West Michigan and the City of Walker are an even better place to call home because of you commitment to safety and excellence. https://t.co/MepnRSRGJY","date":"Fri Jun 28 14:48:56 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great job @RobSKaplan on @MorningsMaria describing what economic indicators you are looking for as you make decisions @DallasFed. You are right, business folks tell me credit availability is not a problem.","date":"Fri Jun 28 13:01:29 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A short while ago the Senate passed a bipartisan aid package to address the humanitarian crisis on the southern border by a vote of 84 to 8. @SpeakerPelosi the House should vote on this overwhelmingly bipartisan measure before adjourning for the 4th of July.","date":"Wed Jun 26 20:20:26 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Senate just rejected last night's partisan bill crafted by House Democrats. I am hopeful there will be a bipartisan path forward for the Senate crafted legislation. Here is my full statement on H.R. 3401: https://t.co/mJEXlSPY5T","date":"Wed Jun 26 18:51:46 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"1-2-3 WIN!!!\n#GoGOP","date":"Wed Jun 26 17:36:33 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see continued investment, expansion, and job creation in #WestMichigan. Congratulations to @WolverineGlass on completing your expansion in Wyoming. #MadeInMichigan #MadeInUSA https://t.co/QfOTu2M6V3","date":"Fri Jun 21 20:26:59 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Supreme Court's 7-2 ruling today in favor of the #PeaceCross is a win for religious liberty and the families who constructed it to honor those lost serving in #WWI. I am proud to have been a part of the amicus brief led by @SteveScalise &amp; @tedcruz. https://t.co/WByAfb96iW","date":"Thu Jun 20 20:42:19 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"This number demonstrates the size &amp; scope of the challenge we face on our southern border. House Republicans attempted to address this issue last Congress but Dems routinely rejected our efforts. It's time for the House to act. Where is the Majority's plan to secure the border?","date":"Thu Jun 20 20:03:29 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Airman Ferrell! Thank you for representing #WestMichigan and serving in the @usairforce!  https://t.co/5GnBjp9XMu","date":"Thu Jun 20 18:17:36 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@aubreypTVnews @WOODTV Last night's call included residents in the communities of Walker, Wyoming, Kentwood, and Grandville in Kent County as well as residents in Ottawa, Muskegon, Newaygo, Lake, Oceana, and portions of Mason and Allegan counties.","date":"Wed Jun 19 16:34:57 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A new report from @wallethub ranks Holland among the best lake beach towns in America! This is another great example of how #WestMichigan is a wonderful place to visit, start a business, play, work, live, and raise a family! https://t.co/2hGmmfA4E4","date":"Wed Jun 19 15:41:14 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Wonderful news! This surgery will save lives!","date":"Wed Jun 19 15:20:57 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@aubreypTVnews I believe it was for last night's live telephone town hall. Sorry you couldn't join the conversation. I hope things are going well at @WOODTV","date":"Wed Jun 19 12:49:08 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Getting ready to join @varneyco on @foxbusiness in a few minutes. Tune in! https://t.co/Nk2Z3UNc09","date":"Tue Jun 18 13:45:27 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The @SSBadgerFerry plays an enormous role in the #GreatLakes economy. I was honored to join today’s ribbon cutting ceremony celebrating the completion of the Ludington terminal infrastructure improvement project! I wish the Badger and its crew a very successful season! https://t.co/SVYR2XS0rL","date":"Fri Jun 14 18:23:52 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"More #greatnews for #WestMichigan’s economy. @dewysmfg announced it is expanding, investing in Ottawa County,  and creating new jobs in Wright Township!  @MiBiz has more here: https://t.co/XZ1M3QzQEs","date":"Thu Jun 13 18:54:07 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@SteveRattner good to see you with @Varneyco this morning. .. per your request, I’m tweeting at you! Come back more often! @FoxBusiness","date":"Thu Jun 13 15:11:19 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Late votes in the House tonight. Proud to represent #WestMichigan! https://t.co/k9K30gNOdd","date":"Thu Jun 13 02:56:15 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is good news for our economy here in #WestMichigan! #NowHiring #NewOpportunities","date":"Thu Jun 13 01:19:14 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a great group of kids! Thank you for visiting the Capitol. Enjoy the rest of your trip!","date":"Thu Jun 13 01:04:30 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good news! This measure was long overdue.","date":"Thu Jun 13 00:59:43 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is a great way for kids to stay active and engaged over the summer. The new opportunities start June 24th!","date":"Wed Jun 12 11:13:04 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"WOW! @USWNT with a dominant performance. That's how you make a statement in the opener! #WorldCup2019","date":"Tue Jun 11 21:01:17 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"#WestMichigan ranks 2nd in the nation for hiring in a new survey from @ManpowerGroup. It's wonderful to see all these new opportunities take shape! As a whole, the Midwest is anticipated to have its best hiring in 18 years!  #NowHiring!\nhttps://t.co/hu2KVCaCAP","date":"Tue Jun 11 17:58:30 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! U.S. #smallbusiness optimism climbed to its highest level in 7 months according to the latest report by the @NFIB! https://t.co/eGI1wmzRly #SmallBiz #Growth","date":"Tue Jun 11 16:41:19 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Just back from a special opportunity to celebrate D-Day with WWII veterans and their families in France. These men are amazing, the Greatest Generation indeed! D-Day anniversary: Veterans in their mid-90s parachute over Normandy - The Washington Post https://t.co/Kl6irL0h5G","date":"Mon Jun 10 00:21:05 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A bird’s-eye view along the coast of Normandy at low tide. #DDay75Anniversary https://t.co/kGdsD5iyA6","date":"Thu Jun 06 23:03:10 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"So many American heroes gave their lives to protect our freedom and restore democracy for our European Allies. Standing on the hallowed ground of Omaha Beach gave me an entirely new perspective of the bravery our soldiers exhibited to change the course of history. https://t.co/XKBWAcNwNE","date":"Thu Jun 06 20:28:40 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was incredibly powerful and moving to be at the Normandy American Cemetery at Omaha Beach for the 75th Anniversary of #DDay and meet with D-Day Veterans as well as the families of the fallen who attended today’s ceremony. https://t.co/ukg1WslOOx","date":"Thu Jun 06 20:26:54 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thrilled to run into WM native and family friend, ⁦@USCG⁩ Chaplain, Tom Walcott at the ⁦@CoastGuardFound⁩ annual dinner. Thanks for your service to our nation and the guidance you give the women and men who dedicate their lives to protecting us all!#WestMichigan https://t.co/EcYwxFv6Ue","date":"Wed Jun 05 00:59:05 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A very thought-provoking piece. \"China’s quest to own pieces of the world’s digital infrastructure as well as social media platforms threatens to make the free world’s internet as stifling as the one China imposes on its own citizens. ...\"  https://t.co/JcWGScygp4","date":"Tue Jun 04 15:13:45 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"\"... If China had learned the lessons of Tienanmen and met the demands of its people for more personal freedom, these developments would not be ominous.\" #MorningReads #MustRead","date":"Tue Jun 04 15:13:45 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@TODAYshow thank you for raising awareness and sharing how important financial literacy is for students! It is something I often discuss when I visit schools in #WestMichigan. cc: @FinancialCmte https://t.co/SOb967RWTc","date":"Mon Jun 03 20:18:01 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy to have joined @TheRapid, @gvsu Pres Haas, as well as other local, state and federal officials as they celebrate the #LakerLine. This is a great 3P project that will serve not only the students but all of #WM!","date":"Mon Jun 03 18:33:51 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great to be here to thank “T-Haas” for his years of great leadership of @GVSU and his dedication to West Michigan!  @GRChamber","date":"Mon Jun 03 12:15:57 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Janna! I look forward to getting updates on your progress at the Academy. I know you will represent #WestMichigan with distinction at @WestPoint_USMA !  https://t.co/6wBde8tYvv","date":"Fri May 31 13:58:32 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The crisis along the southern border continues to grow. We need legislative solutions that secure our borders and fix our broken immigration system. House Republicans put multiple proposals forward last Congress. @SpeakerPelosi, where is your plan?  https://t.co/Fhhlgpq7SZ","date":"Thu May 30 20:01:56 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see another #WestMichigan manufacturer announce their plans to grow and expand! https://t.co/9evkXPeXTx","date":"Thu May 30 17:55:30 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Michigan deserves a better trade deal than #NAFTA. Read my piece w/ @RepPaulMitchell, @RepMoolenaar, @RepWalberg, and @RepJackBergman on how the #USMCA will improve trade relations, create more jobs, and open new opportunities for hardworking Michiganders. https://t.co/4QhEAY6dnp","date":"Thu May 30 14:08:26 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Wonderful news! What an incredible day for baby “Saybie” and her family. https://t.co/LpkB3iHX1K","date":"Wed May 29 23:49:24 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today @MLive featured a good article highlighting the research being done by Cory Rusinek and his team at the #MSU-Fraunhofer USA lab to destroy these \"forever chemicals.\" This cutting edge research continues to show promise and is something I support. https://t.co/jSrfNV0mVD","date":"Wed May 29 16:51:53 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"While PFAS contamination is a serious topic of discussion here in  #WestMichigan, many communities are unaware of the threat these chemicals pose. As a member of the bipartisan PFAS Congressional Task Force I am working on raising PFAS awareness at the federal level.","date":"Wed May 29 16:51:53 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a great idea and story. @wzzm13 reports: Wall of Honor: Photo collection pays tribute to Muskegon #WWII veterans\nhttps://t.co/EuWwrc6Ktn #WestMichigan","date":"Fri May 24 20:51:21 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations on earning this well-deserved recognition Sheriff Mast. Thank you for all you do to serve the residents of Oceana County. https://t.co/alsks4jlsG","date":"Fri May 24 15:13:08 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's hard to believe that Democrats in the House have rejected 50 requests for a vote on the Born Alive Abortion Survivors Protection Act. This shouldn't be a partisan battle. #LetUsVote so we can save these innocent lives!","date":"Thu May 23 20:12:38 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Last evening saw the high-school graduation of our only daughter, Alexandra. I’m so proud of this smart, beautiful and talented young lady that words escape me... I know God has great things ahead for her and that the world is a better place because of her! Love you!!! https://t.co/FIyVcCl9Dl","date":"Wed May 22 18:12:49 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to Megan, Kim, Jonathan and all of the tremendous student artists for participating in this year’s Congressional Art Competition! It is incredible to see the highly talented works created right here in #WestMichigan! #OneGoodThing indeed @NickLaFave!","date":"Mon May 20 23:47:34 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"This agreement now sets the stage for a much broader conversation to improve our trading relationship with both Canada and Mexico so more hardworking Michiganders and job creators can benefit from trade between our nations. #WestMichigan","date":"Fri May 17 20:11:09 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The lifting of steel and aluminum tariffs between the U.S., Canada, and Mexico is welcome news and a very positive step that will have a significant impact on Michigan.","date":"Fri May 17 20:11:09 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @GVSUSoftball!!!!!","date":"Fri May 17 18:14:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to @Tulip_Time and the @CityofHolland on a record breaking year. #TulipTime 2019 was a celebration to remember! https://t.co/fd0lE9H59n","date":"Thu May 16 13:47:09 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The all clear has been given by the Capitol Police and my office has resumed normal operations. Thank you for your patience.","date":"Tue May 14 19:52:12 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The all clear has been given and my office in Washington has resumed normal operations. Thank you for your patience!","date":"Tue May 14 19:51:18 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"If you need assistance please call my office in Grandville at (616) 570-0917.","date":"Tue May 14 19:10:32 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Due to an evacuation of the Rayburn Office Building by the Capitol Police my office has been unable to answer the phones in Washington D.C. My staff is safe and in their designated area waiting for the all clear.","date":"Tue May 14 19:10:31 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Principal Woodward! Thank you for your dedication to your students, staff, and community at Grand River Preparatory High School! Keep up the amazing work! #WestMichigan https://t.co/3pWU6DjMBi","date":"Tue May 14 16:50:46 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great crowd today in Holland but many people ask: How does one survive a couple mile parade in wooden shoes??? 7 pairs of socks! And ibuprofen... Happy #tuliptime2019 #PureMichigan #klompen https://t.co/2yZfVYfmeu","date":"Sat May 11 20:03:30 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy \"Opening Day\" to the @SSBadgerFerry! I hope you have a wonderful start to the season!  #GreatLakes #WestMichigan","date":"Fri May 10 13:02:10 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Nearly 70% of Economists Expect Faster Wage Growth Over Next Year, @WSJ Survey Says. This is another sign of positive news for #WestMichigan and communities around the nation! #ProGrowth #opportunity https://t.co/ia5KK5jL48","date":"Thu May 09 18:44:47 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Getting ready to join a great panel discussion with @POLITICOLive  for #nationalSmallBusinessWeek   Tune in around 9:35! #POLITICOBusiness #SmallBiz","date":"Thu May 09 13:14:32 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I will be a part of the panel discussion at 9:35 AM. You can join/watch the conversation here tomorrow morning: https://t.co/9GpuTMdxIL #SmallBusinessWeek","date":"Wed May 08 21:35:00 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I'm looking forward to being part of @PoliticoLive's discussion tomorrow AM on the United States of Entrepreneurs. We will be exploring policy solutions to the barriers that #smallbiz owners &amp; #entrepreneurs are facing.","date":"Wed May 08 21:35:00 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was an insightful and fun event! Thank you to the students from Wyoming High School and across #WestMichigan for attending!","date":"Wed May 08 16:10:53 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see manufacturers continue to invest and expand in #WestMichigan! https://t.co/1jzvQ455N8","date":"Wed May 08 15:44:51 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Welcome back to #WestMichigan @Ginger_Zee! I hope you enjoy #TulipTime2019!","date":"Wed May 08 13:17:20 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to the Ludington High School Quiz Bowl Team on finishing 17th in the nation! What an incredible opportunity for these students to represent Ludington in its first-ever trip to the national competition! https://t.co/KuLR9vAY3O","date":"Tue May 07 17:21:27 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A new study details how the #GreatLakes support thousands of jobs in #WestMichigan. As Co-Chair of the Great Lakes Task Force I am committed to continuing the bipartisan efforts to protect these incredible resources while increasing economic opportunity! https://t.co/MuV6pOZNBX","date":"Mon May 06 19:02:27 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"\"Small businesses booming, 84% see another good year\" This is very positive news for our economy and hardworking families in #WestMichigan.  #TaxReform &amp; reg reform continue to help #smallbiz grow, expand, and create new opportunities! https://t.co/AEIdACAAPk","date":"Mon May 06 14:53:52 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Reminder: Tuesday is Election Day for many and the local clerk offices are open today for you to get an absentee ballot just like I did! Double check on line what hours your local clerk is open and remember to thank them for their work!","date":"Sat May 04 16:39:09 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"263,000 new jobs created and the  unemployment rate reaches its lowest point since 1969 ... that’s a very very strong jobs report! Cutting taxes &amp; reducing red tape continues to help deliver new economic opportunities in #WestMichigan and across the US! https://t.co/af0bnj8CdI","date":"Fri May 03 21:54:22 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a blast! We had a great day at @GVSU for the second annual Youth Leadership Summit with nearly 200 high school juniors from 33 schools across #WestMichigan. Thank you to the students and speakers for engaging and having a wonderful discussion on leadership and success. https://t.co/UZq9ve1QdK","date":"Fri May 03 18:07:20 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Eager to hear from Muskegon Boys and Girls Club ED Dakota Crow, MetalFlow Inc Chairwoman Leslie Brown and @MuskegonCC President Dr. Dale Nesbary today at our 2nd annual Youth Leadership Summit. 200 HS Juniors from 33 schools will gather @GVSU this morning. @FOX17","date":"Fri May 03 11:55:26 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great to be in studio this morning with Deanna Falzone and Mike @AveryFOX17 discussing our 2nd annual Youth Leadership Summit which is bringing together 200 HS Juniors from 33 schools to discuss qualities of leadership. @FOX17","date":"Fri May 03 11:45:30 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Love that song! Great to see you this morning in studio...","date":"Fri May 03 11:38:52 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was great to meet with members of Parliament from the Kingdom of the Netherlands yesterday. This is a great way to share a dialogue to further strengthen the ties between our nations. #WestMichigan","date":"Thu May 02 15:11:16 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@NLintheUSA another great example of the United States and the Kingdom of the Netherlands sharing a cultural bond. @McDonalds is making an excellent call bringing this to the US. We will have to get together and do a taste test!  @RepDerekKilmer, join us! https://t.co/My1LJTBKni","date":"Wed May 01 16:11:38 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@bobbyjoeybilly @CNBC agreed!","date":"Wed May 01 13:34:37 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@CNBC reports: \"Private payrolls surge by 275,000 in April, blowing past estimates and biggest gain since July\" This is another great example of how our economy is growing, increasing opportunities, and creating new jobs because of #ProGrowth policies! https://t.co/eDYmYdsyFK","date":"Wed May 01 13:07:13 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It’s time for the House to go on record and hold a vote. It’s hard to believe that in 2019, Democrats are openly denying an innocent child the ability to make their mark on the world. I would have never imagined that this would be a partisan fight.","date":"Tue Apr 30 17:53:51 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I believe we should create a culture that respects and values life. The Born-Alive Survivors Protection Act requires children who survive an attempted abortion to receive the same care as a child born at the same stage of life. This isn't controversial, this is common sense.","date":"Tue Apr 30 17:53:51 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Last night, I requested a vote on the Born-Alive Survivors Protection Act to save the lives of babies who survive an attempted abortion. My request was denied. Democrats have now blocked this vote 33 times. Americans deserve to know where their representatives stand. #LetUsVote","date":"Tue Apr 30 17:53:50 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Getting ready to join @LelandVittert and Kristen Fisher on @FoxNews at the top of the hour.","date":"Sat Apr 27 16:01:59 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to all of the students who are graduating from @GVSU this weekend! I wish all of you the best as you take your next steps in life!","date":"Sat Apr 27 15:31:58 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great news on the economic front today - @CNBC reports the \"US economy grows by 3.2% in the first quarter, topping expectations\" This means more opportunity for West Michigan and communities across the nation! https://t.co/WKvqw33pYg","date":"Fri Apr 26 17:14:31 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"#TaxReform continues to help job creators grow and expand across #WestMichigan. Yesterday, Marge Wilson of Marge's Donut Den shared w/ @WKTVNews that she has been able to hire more employees, raise wages, and purchase new equipment because of tax cuts!  https://t.co/PVbmFdhRmI","date":"Wed Apr 24 18:57:58 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good luck to all of the students and teams participating in the FIRST Robotics World Championship in Detroit this weekend.  This is a great program that increases interest in #STEM, helps students develop their skill sets, and explore their creativity. https://t.co/4o19zwhNAa","date":"Wed Apr 24 13:55:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see @Wallethub name Holland (#1) Kentwood (#58) and Wyoming (#132) among the top 150 cities in America to start a business! #WestMichigan #PureMichigan https://t.co/peKG6jicJ8","date":"Tue Apr 23 15:17:40 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"‘We are thrilled that you are here’: More than 125 people become U.S. citizens in Holland 🇺🇸🇺🇸🇺🇸 What a great day for #WestMichigan and our nation! https://t.co/uivOOtcKuj","date":"Sat Apr 20 15:21:07 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"And as our Ottawa County Clerk, @JustinRoebuck knows how to properly run elections! @WOODradioSteve @WOODRADIO @RickAlbinWoodTV","date":"Fri Apr 19 11:25:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"US weekly jobless claims lowest since 1969; unemployment rolls shrink. Per @Reuters \"the data pointed to sustained strength in the economy.\" https://t.co/hcZEqACtTy","date":"Thu Apr 18 14:29:19 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A well deserved honor. Thank you for all that you and @1037thebeat do for students and the Muskegon Community Paul! https://t.co/feJhOB8FT9","date":"Wed Apr 17 19:14:56 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great News! Two companies in Jamestown Township are expanding, investing millions, and creating more than 140 new jobs in Ottawa County!  https://t.co/sasIRJzPxF","date":"Wed Apr 17 12:57:16 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations on adopting another baby girl @hodakotb! Adoption is such a wonderful opportunity. Blessings to you and your growing family!","date":"Tue Apr 16 20:12:23 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@MarketWatch reports: \"Torrent of job offers, bigger salaries offer more proof U.S. labor market is still red-hot\" \nhttps://t.co/CAGWCbrH52","date":"Tue Apr 16 17:13:10 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to the Ludington Orioles on winning the Quiz Bowl State Championship! https://t.co/7MFkGZ1qSf","date":"Tue Apr 16 14:12:33 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Auto supplier hiring 75 workers in Holland. It's great to see manufacturing opportunities continue to expand in #WestMichigan https://t.co/JthaakDa2R","date":"Tue Apr 16 14:01:26 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It’s hard to find the words to describe the loss at Notre Dame today but this photo of the cross still standing at the altar is a powerful symbol of hope and perseverance. https://t.co/TO3gSZOiDH","date":"Tue Apr 16 02:35:00 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@CNN has a good piece by @stevenmnuchin1 on how #TaxCuts have helped create more jobs, bigger paychecks, greater business investment and lower tax liability. https://t.co/FMACZDygGW #TaxDay #TCJA #TaxReform","date":"Mon Apr 15 17:49:54 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! Feyen Zylstra announced it is investing $5 million in Walker to build a new industrial tech hub and create 100 new jobs! It's great to see job creators continue to grow and expand in #WestMichigan!\nhttps://t.co/fIj4dAMB23","date":"Thu Apr 11 22:31:14 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"My honor to escort soon to be graduate and Congressional office intern, Elizabeth Kebler as she represents Michigan as this year’s Cherry Blossom Princess in Washington DC! ⁦@GVSU⁩ ⁦@CherryBlossFest⁩ https://t.co/gXn74qCHod","date":"Wed Apr 10 23:56:47 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@Meijer is opening a new store in Fremont next month. This will create 300 new jobs in Newaygo County. It's great to see a #WestMichigan job creator continue to grow and expand! https://t.co/3TW7gVW2Pl","date":"Wed Apr 10 18:05:37 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Welcome to Kentwood @buddyspizza! I am looking forward to you opening your new location next week, creating 100 jobs, and bringing a taste of Detroit to #WestMichigan! https://t.co/MgbXoexjYn","date":"Wed Apr 10 17:24:55 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congrats Dr. Calabria, you will do an outstanding job!","date":"Thu Apr 04 21:22:02 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Gerald R. Ford Museum and gravesite are pieces of our nation’s history. This is both disappointing and disgusting. #WestMichigan, if you have information please reach out to the @GrandRapidsPD or contact Silent Observer at 616.774.2345 https://t.co/DTtwA1bQHL","date":"Thu Apr 04 02:20:29 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's exciting for #WestMichigan to be hosting the @usahockey Youth Tier I 16U and 18U National Championships this week. Welcome to the players, coaches, and families. Have a great tournament and I hope you enjoy #PureMichigan! https://t.co/2mvek6BGsU","date":"Wed Apr 03 17:38:16 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Privilege to be in the Chamber right now watching @jensstoltenberg and you can join us!","date":"Wed Apr 03 15:15:36 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I signed the Born Alive Act Discharge Petition today. #LetUsVote to save these innocent lives! #endinfanticide","date":"Wed Apr 03 01:04:51 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"I was the 143rd House Member to sign the Born Alive Act legislation discharge petition a short time ago. If we can get 218 signatures the bill will automatically go to the floor for a vote! Ask YOUR Member to sign on! #EndInfanticide #LetUsVote https://t.co/5x6viwQ91W","date":"Tue Apr 02 20:13:31 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a game! Congratulations Michigan State on punching your ticket to the #FinalFour with an incredibly hard fought victory over Duke! #GoGreen!","date":"Mon Apr 01 00:20:33 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Still Dancing! Congratulations #MSU on tonight’s big win and on reaching the #Elite 8! #GoGreen","date":"Sat Mar 30 01:36:33 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Breaking: President Trump just announced his support for fully funding the #GLRI (Great Lakes Restoration Initiative)! This is fantastic news for the ecology and the economy of the #GreatLakes!","date":"Thu Mar 28 23:56:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Prayers and condolences are being offered for all the victims and those effected by the horrendous attack in New Zealand. Blessings and Peace. #NewZealandMosqueShooting","date":"Fri Mar 15 18:31:51 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to my friend and colleague, @RepDebDingell, on becoming the newest Democrat co-chair of the Great Lakes Task Force. I look forward to continuing to work together to protect and restore the Great Lakes!","date":"Wed Mar 13 17:53:11 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"100 new jobs are coming to Walker! This great news demonstrates the strength of our economy and the opportunities that are being created here in #WestMichigan! https://t.co/Qb7zkMMd7k","date":"Wed Mar 06 22:39:10 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It is extremely disappointing that Michigan’s Senators chose partisan politics today instead of protecting innocent infants who just survived an attempted abortion. Read my op-ed on why the Born Alive Survivors Protection Act should rise above partisanship https://t.co/nuNUdtL146","date":"Tue Feb 26 00:00:20 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @GVSU!","date":"Wed Feb 13 18:19:23 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sorry to see of the passing of my colleague, Walter Jones. I first met him during a District Director’s DC fly-in while serving as Rep Pete Hoekstra’s DD. A Gentleman indeed. Blessings &amp; Peace Jones Family. North Carolina Rep. Walter Jones dies at 76 via @POLITICO for iOS https://t.co/Hs5MAwnOpM","date":"Mon Feb 11 01:56:21 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"John Dingell was a fierce advocate for Michigan and a titan of the House who worked with a servant’s heart. I will remember John as someone who always fought for the constitutional standing of the House. My heart and prayers go out to Debbie and the entire Dingell family.","date":"Fri Feb 08 02:41:37 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today we remember the brave @NASA astronauts who lost their lives leading our nation into the final frontier. We especially hold in our hearts #WestMichigan’s own Roger B. Chaffee who tragically died with the crew of Apollo 1 in 1967.  #DayOfRememberance https://t.co/EBYZpXnEmZ","date":"Thu Feb 07 22:29:14 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to @BakerCollege's @CIMtweet for being one of the only schools in the nation and the first school in Michigan to be recognized by @WACSworldchefs!  https://t.co/LnbqLCNVcw #WestMichigan","date":"Thu Feb 07 20:04:48 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A truly remarkable group of individuals that serve as incredible examples of heroism and overcoming adversity.","date":"Wed Feb 06 20:47:19 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Michigan doesn't just share a strong heritage with the Netherlands, we also maintain strong economic ties as well! https://t.co/yvOPyggZww #WestMichigan #4jobs","date":"Wed Feb 06 18:35:48 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @GOPLeader for asking for unanimous consent to protect born-alive infants. I am a cosponsor of @RepAnnWagner's Born Alive Survivors Protection Act. This shouldn't be remotely partisan. Let's save lives together and promote a culture that defends and respects life!","date":"Wed Feb 06 18:17:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Blessings and Peace to the Dingell family during this difficult journey. Let’s keep them all in our immediate thoughts and prayers.","date":"Wed Feb 06 16:30:13 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"#NowHiring continues: US employers added 304,000 jobs in January, soaring past expectations  Republican-led #ProGrowth policies are continuing to deliver. https://t.co/CieBeyAMDC","date":"Fri Feb 01 14:30:49 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Wages and salaries for American workers have risen more than 3% over the past year. This is the first time this has happened in over 10 years! Republican pro-growth tax and regulatory policies continue to deliver positive results for hardworking Americans! https://t.co/kYLsaGkayD","date":"Thu Jan 31 22:02:03 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"This was truly a heartwarming event. Thank you for your service Orvid! #WWII #Heroes","date":"Mon Jan 28 21:32:01 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see #WestMichigan organizations like @HopeNetworkNews and @GFSDelivers featured in this @WSJ piece! It is wonderful news to see new job opportunities being created for disabled residents across West Michigan!","date":"Mon Jan 28 20:54:37 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"On Holocaust Remembrance Day, #WeRemember the six million Jewish victims and millions of other Nazi targets. We also salute our #WWII veterans who risked their lives to defeat Nazism and liberate concentration camps. https://t.co/VbuJ1nslZL","date":"Sun Jan 27 16:57:17 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@realDonaldTrump ignore @SpeakerPelosi and her unbelievable denial of the House hosting the #sotu and address the willing majority of House &amp; Senate members who want to hear from you. Find a different venue &amp; invite us all. The American people will see she is playing politics!","date":"Wed Jan 23 20:53:05 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"@adenatfriedman  nice job on @SquawkCNBC this morning talking about IPOs and the need for our economy to have private companies go public for the benefit of all investors and health of the overall markets.","date":"Wed Jan 23 12:00:11 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Dr. Philomena V. Mantella (@PhillyHigherEd) on being named the incoming President of @GVSU! I look forward to working with you! https://t.co/GqQkHihaIO","date":"Tue Jan 22 21:26:12 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Keep up the good work Ambassador @RichardGrenell! We need to keep the pressure on Iran. https://t.co/DLApYMuvhr","date":"Mon Jan 21 17:01:57 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you to all of the folks from West Michigan who made the trip to Washington this week in support of creating a culture that supports life! My office in Rayburn is open until 5:30 this evening with refreshments on hand if you would like to stop by!","date":"Fri Jan 18 21:23:37 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It will be interesting to see if major media outlets will cover this and potentially correct past reporting.","date":"Fri Jan 18 16:46:44 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":".@SteveScalise asked to vacate the voice vote and allow us to vote on the funding motion next week bc all of the @HouseDemocrats were running for the airport according to @LeaderHoyer","date":"Thu Jan 17 18:23:35 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"OUTRAGEOUS !!!  The @HouseDemocrats just ignored House rules and railroaded a vote on the floor!","date":"Thu Jan 17 18:21:41 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"A truly incredible story. Thank you for your service Mr. Newman. Rest well. https://t.co/sq54M5EZGk","date":"Wed Jan 16 14:46:59 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to my friend, and fellow West Michigander, Pete MacGregor on his new position! I look forward to continuing to work with you!","date":"Wed Jan 09 17:30:29 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Whoa ...","date":"Mon Jan 07 19:07:27 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Welcome to #WestMichigan. New data from @uhaul shows the Grand Rapids-Wyoming market is a top 5 destination! https://t.co/Vya93No9jZ","date":"Mon Jan 07 14:44:01 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"32,000 manufacturing jobs were created in December. This brings the number of new manufacturing jobs created in 2018 to 284,000! According to @CNBC this is a 37 % increase in new jobs from 2017! #TaxReformWorks #MadeInMichigan #MadeInAmerica https://t.co/XcV11YGE3K","date":"Fri Jan 04 15:30:53 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good news on the economy, wages, and jobs #'s. @AP Reports: US employers added a stellar 312,000 jobs in December. Average hourly pay improved 3.2% from a year ago, up from average wage growth of 2.7 % at the end of 2017. https://t.co/0gXz1QJUsn #ProGrowth #MoreOpportunity","date":"Fri Jan 04 14:46:19 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"It is estimated that globally nearly 41 million lives were lost last year alone to abortion. House Dems have included language in their CR that would cause this horrible number to rise even further. I voted no. Taxpayer $ should not be used to end the lives of innocent children.","date":"Fri Jan 04 03:14:00 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy New Year! Blessings and Peace in 2019!","date":"Tue Jan 01 06:39:52 +0000 2019","user_id":"233949261"},{"handle":"RepHuizenga","text":"Blessings and Peace to you and yours on this special day. Merry Christmas!","date":"Wed Dec 26 02:07:30 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tonight I joined 217 House Republicans to pass common sense legislation that funds govt, disaster relief and improves border integrity. Democrats in the Senate have a decision to make. I voted to prioritize our nation’s border security, I hope they do the same.","date":"Fri Dec 21 01:47:56 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"WOW! What an amazing thank you/bonus for the employees at FloraCraft in Ludington! #ChristmasSpirit  https://t.co/wZaSK8HWtK","date":"Mon Dec 17 21:32:17 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"For 70 years @Houseof_Flavors has been serving up smiles and delicious ice cream in Ludington. It's great to see this family-run #PureMichigan icon highlighted by @crainsdetroit! https://t.co/WrMjRFfc5y","date":"Thu Dec 13 14:48:03 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to all of the students who graduated today from @GVSU! I wish you all the success in your future endeavors! https://t.co/3csvO9yYFH","date":"Sat Dec 08 21:29:08 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Matt! And welcome back Holland!","date":"Sat Dec 08 15:58:00 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Honored to greet the Bush family incl Pres. Geo W Bush, Laura, Barbara and @JennaBushHager  as they viewed the casket. While I showed him the @CVN77_GHWB challenge coin I’m carrying in Pres Bush 41’s honor, he mentioned being in GR for Rich DeVos’ funeral. An amazing family!","date":"Wed Dec 05 00:30:50 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Sad to see another great hero from The Greatest Generation has passed from this world. Geo HW was honorable man who loved our country. I am privileged to have met him a number of times. Rest well Pres Bush, rest well. George H.W. Bush dies at 94 - POLITICO via @POLITICO for iOS","date":"Sat Dec 01 05:18:31 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was an honor to attend this special moment for our friend @RepHensarling  and good to see you @VP, Sec Carson, Mick Mulveney, Phil Gramm and other noteables.  All the best in the future Jeb!","date":"Wed Nov 28 17:31:07 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Modernizing infrastructure on the #GreatLakes should be a national priority. The Soo Locks are of vital importance to not only Michigan's economy but our nation's economy as a whole! I am glad to see progress continue to be made on this important project. https://t.co/u1rsQ3CQ0r","date":"Wed Nov 28 15:58:24 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to @NASA and the @NASAInSight team on a successful #MarsLanding! It will be exciting to see what scientific discoveries are made during this mission! I wish you all the best!","date":"Mon Nov 26 20:07:00 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Champions!!!! Congratulations to Unity Christian on winning the Division 5 State Title! #GoSaders! #WestMichigan","date":"Sun Nov 25 00:09:20 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"#WestMichigan is known around the nation as a community that opens its doors to children in search of #foreverhomes! Thank you @JonMills20 and @wzzm13 for highlighting this great story. #NationalAdoptionMonth #GoodNews https://t.co/PlBuTagCA1","date":"Wed Nov 21 16:38:18 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Mandi on being recognized as @MWCoastChamber's Small Business Person of the Year! It's wonderful to see @QualityCarWash continue to grow, expand, and create jobs under your leadership! https://t.co/JDlOkNdCrs","date":"Tue Nov 20 16:07:51 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"We need to continue to make the preservation and restoration of the Great Lakes a national priority! #GLRI","date":"Mon Nov 19 18:06:04 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Our collective thoughts and prayers go out to officer Davis’ family and friends. We thank you for your service to our community! Blessings and Peace to all.  Grandville Police Department mourning the loss of fellow officer | https://t.co/4sbqXfwSzK https://t.co/rSoxH9uXKX","date":"Fri Nov 16 03:12:23 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"This ain’t NOTHING Steve... I hope to have you up for some real snow in #PureMichigan sometime!","date":"Thu Nov 15 22:35:53 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"On this 100th anniversary of Armistice I’m especially thankful for my namesake Pvt Wm Huizenga who fought with the 339th Infantry in Northern Russia. Arriving in Sept of 1918 the “Polar Bears” didn’t leave until June 1919. Great article in ⁦@WSJ⁩ this weekend. Thnx Grandpa! https://t.co/tkCjWeE72P","date":"Mon Nov 12 00:02:27 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Jobs Report: +250,000 jobs, 3.7% unemployment, wages rising at their fastest level since 2009! #BetterOffNow #ProGrowth https://t.co/rCP8hcVBQA","date":"Fri Nov 02 12:50:21 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great to be with you this morning talking about access to credit and services for credit union members!","date":"Fri Oct 26 18:02:04 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's wonderful to see @grcc team up with schools in Wyoming to improve student success! https://t.co/X9628Nw4Br #WestMichigan","date":"Tue Oct 23 12:58:35 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"\"Low-Income Workers See Long-Awaited Wage Gains\" per the @WSJ. The economy has been supercharged by Republican-led efforts to reduce red tape and cut taxes. The positive results of these policies have more Americans feeling #BetterOffNow.  https://t.co/gSLfu46AC9 #TBT","date":"Thu Oct 18 17:34:52 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see our economy continue to grow and provide new opportunities! @MarketWatch reports: Jobless claims drop 5,000 to 210,000 in mid-October, stick near 50-year low. https://t.co/U1Rh4O3z9e","date":"Thu Oct 18 17:07:29 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"What an amazing evening listening to ⁦⁦@timkellernyc⁩ at the ⁦@ActonInstitute⁩ annual dinner. Amazing insight into the “modern self” vs traditional view of our self worth. #ActonAnnualDinner2018 https://t.co/uozYqnbmis","date":"Thu Oct 18 00:21:40 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's wonderful to see @GVSU continue to be nationally recognized as an affordable, high quality leader in education! #WestMichigan  https://t.co/jFkEF8L7r4","date":"Wed Oct 10 13:53:40 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good Read: Tax and Regulatory Cuts Solve A Long-Running Problem For #SmallBiz https://t.co/KPHYrJVyGV","date":"Tue Oct 09 13:54:53 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see another major investment being made in Muskegon County. TGW Systems is investing $2.5 million with plans for future expansion in Norton Shores. https://t.co/DG3Zbo7v2d","date":"Tue Oct 09 13:42:11 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to newly confirmed #scotus justice , Brett Kavanaugh, a qualified jurist w a long judicial track record of reading and following the Constitution, not twisting it to fit his own world view.","date":"Sat Oct 06 20:38:16 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! 25 new high-tech jobs are going to be created because Arcanum Alloys is moving to Kentwood! https://t.co/lLUkKhpDGt","date":"Thu Oct 04 17:56:33 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Last month was \"a Record Month for Raises\" according to the @NFIB. Their latest #SmallBiz survey found that \"37% of small businesses in September reported raising overall compensation in hopes of hiring and retaining needed employees.\" #ProGrowth  https://t.co/4cPyfUkGh0","date":"Thu Oct 04 17:39:14 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Look. Listen. Learn. @CityofHolland Fire Department launches fire safety campaign via @wzzm13 https://t.co/m2j8ZEdBTG","date":"Tue Oct 02 20:05:27 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @GFSDelivers on launching your latest grocery store in Grand Rapids! Focusing on service, quality, and community is a recipe for success!  https://t.co/VdMrK3p3Jr","date":"Tue Oct 02 19:59:38 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Study: Great Lakes restoration more than pays for itself https://t.co/9gquZ5UnHJ #GLRIWorks #GreatLakes #PureMichigan #GLRI","date":"Tue Oct 02 13:34:53 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"JUST ANNOUNCED: Congratulations to Holmes Elementary, Rosy Mound Elementary, Jeffers Elementary, and Lake Hills Elementary on being recognized as 2018 National #BlueRibbon Schools! #WestMichigan","date":"Mon Oct 01 18:31:17 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"As Co-Chair of the US-Canada IPG and Great Lakes Task Force I am encouraged to see a modernized trade agreement reached between the U.S., Mexico, and Canada. We are stronger trade partners when we work together and I look forward to reviewing the agreement.","date":"Mon Oct 01 12:28:48 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Pleased to do so @AbbyMinnich","date":"Fri Sep 28 18:55:06 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"A lot of prayers were answered when the nation saw you walk through those doors @SteveScalise.  So many of us continue to pray for you, your recovery, and your family Steve, Thank you for your friendship and your leadership.","date":"Fri Sep 28 16:46:11 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@CNBC: Final reading on Q2 GDP confirms 4.2% gain, the fastest rise in nearly four years. #ProGrowth #TaxCutsAndJobsAct https://t.co/8LkeBaeuGp","date":"Fri Sep 28 16:38:54 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to West Michigan's @Trendway on being recognized as the top veteran owned business in America! https://t.co/l6LZR4J9yD","date":"Thu Sep 27 18:35:59 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great to meet with @MICreditUnions today. Thanks for what you do for your members!","date":"Wed Sep 26 23:06:18 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"A new study out today from the @GLCommission demonstrates how protecting and restoring the #GreatLakes is good for the environment and the economy. Read the study here: https://t.co/UUSxXv37sZ  #GLRI #PureMichigan","date":"Tue Sep 25 20:38:49 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"More flavors of deliciousness are on the horizon! It's great to see family-owned @Hudsonville_IC continue to invest, create jobs, and expand right here in #WestMichigan!  https://t.co/FfWuNWVJq1","date":"Tue Sep 25 18:55:43 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see @WesternMichU and @grcc team up for an innovative manufacturing lab downtown that will provide hands on learning to help students become the next generation of engineers and highly skilled manufacturers! https://t.co/DGDhHadyeU","date":"Mon Sep 17 20:10:58 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy #ConstitutionDay! Take a moment to re-read this critical document that protects our rights and limits the power of the federal government! If you are visiting DC, be sure to stop at the @USNatArchives and view the Constitution in person!  https://t.co/SD4HU0p58H","date":"Mon Sep 17 14:14:45 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Growth &amp; opportunity is on Kentwood's horizon w/ a $6.5M development recently breaking ground. \"The market is continuing to experience great growth, and it is clear the West Michigan industrial sector is strong, ” said Chris Veneklasen, president of AJV. https://t.co/6FFFgvoJte","date":"Thu Sep 13 19:05:43 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"More good news for West Michigan economy! Medical manufacturer's $3.5M expansion to add 43 jobs in Kent County.  https://t.co/ofMdF8saOG","date":"Thu Sep 13 18:47:54 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see job creators continue to invest, expand, and create new opportunities in West Michigan! https://t.co/qtpz1LMjh9","date":"Mon Sep 10 18:55:08 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@NYPost Editorial Board weighs in on the economy: Why great economic news for American workers should continue. #ProGrowth #BetterOffNow https://t.co/5D4XWS7mvr","date":"Mon Sep 10 18:29:33 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Economy adds more jobs than expected in August, and wage growth hits post-recession high. #ResultsNotResistance  #BetterOffNow https://t.co/otzi1eLjBv","date":"Mon Sep 10 18:06:15 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"60 New Jobs in Muskegon! \"We are extremely excited about the short and long-term prospects of this unprecedented growth,\" said HDW, CEO Chuck Smith. \"But, we are just as proud of the growth we are seeing in Muskegon and its surrounding areas.\" #HelpWanted https://t.co/A3S1615yaO","date":"Wed Sep 05 13:30:03 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"More good news! The new ISM survey finds that American manufacturing is growing at its fastest pace in 14 years #MadeInMichigan #MadeInAmerica #ProGrowth #TCJA https://t.co/8dYn48ZNPg","date":"Tue Sep 04 18:08:20 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Another innovative manufacturer is expanding in #WestMichigan! Motion Dynamics, who designs components found in medical devices, is investing $3.7 million and creating 80 new jobs in Fruitport! https://t.co/5if8lw2dzt #ProGrowth #NewJobs","date":"Thu Aug 30 18:26:28 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Entrepreneurship and innovation are two of the ingredients that help strengthen and fuel West Michigan's growing economy. It's great to see that effort continue in Grand Haven! https://t.co/1vcaYkk9BT","date":"Thu Aug 30 14:07:18 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see economic expansion and job creation continue to provide new opportunities in #WestMichigan. From @grbj: Manufacturer plans $3.5M expansion in Walker https://t.co/oKooTWfwte","date":"Tue Aug 28 18:13:49 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Per @Marketwatch: Consumer confidence in the United States soared in August to an 18-year high and hit seldom-reached peaks, reflecting surging growth in the economy and the lowest unemployment rate in almost two decades.  https://t.co/IwCf4mVOph  #TCJA #TaxReform #BetterOffNow","date":"Tue Aug 28 17:28:43 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"John McCain was a leader, a statesman, and an exemplary American who always put service before self. His dedication, courage, and commitment set an example for others to follow. My thoughts and prayers go out to Senator McCain’s family during this difficult time.","date":"Sun Aug 26 01:37:02 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great to see you all as we discussed this important issue for our seniors and other vulnerable population. #LIHEAP #neuac @KeepMIWarm","date":"Fri Aug 24 18:35:29 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Hosting a mtg in the Grand Haven office with City officials re: US31 bridge issues and reliability. Ironically, the southbound bridge is not functioning right now. We need to get this fixed ⁦@uscoastguard⁩ and ⁦@MDOT_West⁩ I look forward to addressing the situation. https://t.co/cPPr1xXw6S","date":"Wed Aug 22 15:17:46 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":".@chicagotribune on the stock market, economy, and job creation: \"Certainly, Republican-led tax reform is helping.\" Hardworking Americans are more confident, more secure, &amp; have greater opportunities because of the #TCJA. #BetterOffNow #MorningRead https://t.co/mruWZXo3Gv","date":"Wed Aug 22 14:58:40 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Another positive sign of growth and expansion right here in West Michigan - @FlyGRFord was recently named the second fastest growing airport in the nation by @Airline_Weekly! https://t.co/2Ubbjr8T3W","date":"Tue Aug 21 19:57:20 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Another sign of a booming economy and how more Americans are #BetterOffNow because of Republican #ProGrowth policies. The @WSJ reports \"Youth Unemployment Hits 52-Year Low\" https://t.co/QiOml1gr3A","date":"Fri Aug 17 15:31:42 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"I have worked to build bipartisan support for the Great Lakes Restoration Initiative because it plays a critical role in protecting the #GreatLakes. Here is the latest example of how the #GLRI is working to preserve the Great Lakes for future generations. https://t.co/K33WuchroL","date":"Fri Aug 17 13:37:14 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Aretha Franklin was a pillar of modern American music. The Queen of Soul impacted countless people around the world with her iconic voice and passion. May she Rest In Peace.","date":"Thu Aug 16 16:21:35 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@nature_MI @HelenTaylor_TNC @nature_wonks @pjdgreatlakes Thank you for this incredible recognition as well as your work to preserve the Great Lakes and stop the threat posed by Asian carp.","date":"Tue Aug 14 17:16:56 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"U.S. Small-Business Optimism Climbs to Second Highest on Record reports @NFIB. Following Republican-led efforts to cut taxes and remove unnecessary red tape, #Smallbusinesses are #BetterOffNow. https://t.co/rW6tlcioOA","date":"Tue Aug 14 12:47:08 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was an absolute honor to present Keith Cole and Al Johnson with the Congressional Gold Medal for their service to our nation as members of the Office of Strategic Services. Thank you @osssociety for helping recognize these #WestMichigan heroes! https://t.co/y6cUUQSCjh","date":"Mon Aug 13 18:48:31 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see B2 Outlet Stores continue to grow and expand their footprint! https://t.co/VRQP8pg4c7","date":"Fri Aug 10 18:32:53 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"From the @HollandSentinel: HopCat confident in hiring up to 100 people for new downtown Holland location https://t.co/HlylKU6uDE","date":"Fri Aug 10 18:24:57 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today, let us honor, remember, and thank our servicemen and women who have sacrificed in defense of our nation. Let's also keep in our hearts the families of these brave heroes. #PurpleHeartDay https://t.co/1pCuP0rWhY","date":"Tue Aug 07 15:07:24 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"A great read on how #SmallBiz plays a criticial role in growing the economy, job creation, and higher wages! Pro-Growth tax cuts &amp; regulatory reform have more hardworking Americans #BetterOffNow! https://t.co/2HB0cl6RfA","date":"Mon Aug 06 16:48:37 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Morning Must Read: Pro-growth tax reform helps hardworking families, boosts job creation, and grows the economy. CBO revisions demonstrate how the #TCJA positively impacts revenues/budget whereas raising taxes brings in less revenue and hurts growth https://t.co/Xc5MY8H2vG #tcot","date":"Mon Aug 06 13:50:01 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to Georgetown's Little League 10-U softball team on winning the State Championship! https://t.co/f7iuwlXyHB #WestMichigan #StateChamps","date":"Thu Aug 02 22:53:58 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":".@CNBC reports: Worker pay rate hits highest level since 2008. More Americans are #BetterOffNow because #progrowth policies like tax &amp; regulatory reform are creating more jobs, greater opportunities, bigger paychecks and better benefits. https://t.co/SGbqbhSwH7","date":"Wed Aug 01 01:20:52 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@WSJ on #Progrowth: thank tax reform &amp; deregulation for unleashing animal spirits and giving the expansion renewed life. Had (Democrats) prevailed, we’d still be experiencing secular stagnation instead of arguing if 4.1% growth is too much of a good thing https://t.co/sUjA91XEIb","date":"Sat Jul 28 12:22:05 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"A cautionary tale on the actual result of socialism: a 1,000,000% inflation rate.  Here is the example outlined in the @washingtonpost: “a candy bar that cost $1 today would cost $10,000 at the end of a year.” https://t.co/VhxCv0e1U3","date":"Sat Jul 28 12:13:39 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"A good read from earlier this week in the @detroitnews: The Tax Cuts and Jobs Act helps Michigan build a bright future https://t.co/y7VRR6wMJl #TaxCuts #TaxReform #TCJA","date":"Thu Jul 26 19:29:23 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! Another big investment in Michigan today because of tax reform! 450 good-paying jobs will be created and a $465 million investment will bring a state of the art production facility to Michigan. #TCJA #TaxCuts  https://t.co/5q9w0bZrrT","date":"Tue Jul 24 20:29:16 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It's great to see @JRAutomation continue to invest in Holland and create 100 good-paying, high tech jobs!\nhttps://t.co/hdDEmLX8o9","date":"Fri Jul 20 20:21:35 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 2nd Birthday Lucas!!! #ThatSmile! #GerberBaby https://t.co/St9rzIX08j","date":"Fri Jul 20 19:02:50 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Good News! The House just passed legislation to fully fund the #GLRI (Great Lakes Restoration Initiative). This program plays a critical role in preserving the #GreatLakes environment and strengthening West Michigan’s economy.","date":"Thu Jul 19 15:18:17 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tonight, the House overwhelmingly passed a bipartisan package of 32 bills to strengthen capital formation, improve opportunities for Main Street investors, and boost small business job creation by a vote of 406-4! Next stop the Senate! #ProGrowth","date":"Wed Jul 18 01:23:04 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations Tina Freese-Decker on being named the new President and CEO of @SpectrumHealth! https://t.co/nmXlqibsbv","date":"Wed Jul 18 01:12:43 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was an honor to celebrate the life and legacy of President Ford this morning at the Ford Museum. Thank you President Ford for your service and dedication to our community and our country! https://t.co/swpJ7errma","date":"Sat Jul 14 14:35:24 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Tax and regulatory reform has America open for business! The @washexaminer reports that \"Hires rise to highest level in 17 years\" https://t.co/Jahp3Xmx5H #ProGrowth! #TCJA #TaxCutsandJobsAct","date":"Tue Jul 10 14:51:43 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to Brett Kavanaugh on his nomination to #SCOTUS.","date":"Tue Jul 10 01:08:19 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Our basic freedoms and founding principles were established to protect us from this exact sort of government intimidation. The #NIFLA decision is an important victory for religious liberty and the freedom of speech. --&gt;FULL STATEMENT on #SCOTUS Ruling: https://t.co/7han0UKWzs","date":"Tue Jun 26 19:21:43 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @RepSinema for joining my effort to reunite children separated from their families. https://t.co/OpIcfHX8qk","date":"Fri Jun 22 20:02:26 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"I’m glad to have you join this effort @RepPoliquin! https://t.co/3QnCefrVOw","date":"Fri Jun 22 18:12:58 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"This is unbelievable... and a terrible development for those of us concerned about our debt and deficit. https://t.co/HwcyBlEbqn","date":"Wed Jun 20 22:10:32 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"I have spoken w Bethany Chr Services to get clarification on the status of separated children coming to Mich. We continue to communicate with them to stay up to date as the situation develops. This must change! https://t.co/8zmrzUvh42","date":"Wed Jun 20 14:41:32 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Admin must end the policy of separating children from their families immediately. If it is unwilling to do so, then the House should immediately pass narrowly tailored legislation to end separations. There  is broad bipartisan support to put an end to this inhumane policy.","date":"Wed Jun 20 14:30:34 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"What is happening at the border is heartbreaking. I'm committed to leading a bipartisan, bicameral effort to find a humane solution that ends automatic separations and keeps families together. Tonight’s meeting with Pres. Trump provides an opportunity to work towards a solution.","date":"Tue Jun 19 17:34:45 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy 243rd Birthday to the @USArmy! Thank you to the brave men and women who display leadership, courage, and dedication to defending the Constitution and protecting the freedoms we love! https://t.co/IucZroYE2u","date":"Thu Jun 14 20:46:40 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"My pleasure David! I hope you and your family enjoy your visit to DC! https://t.co/raPC8KJM04","date":"Thu Jun 14 11:37:28 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"More #GoodNews for #WestMichigan's economy and water infrastructure. Dredging funds approved for Pentwater, White Lake, Arcadia harbors via @LudingtonDN https://t.co/GpTYNl6crV","date":"Wed Jun 13 17:39:32 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks again for making their visit to the Capitol even more memorable Mr. Vice President! https://t.co/7cKET1wn5G","date":"Tue Jun 12 22:25:42 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great to see @GM invest, expand, and create jobs in Wyoming! https://t.co/sbf36VgMxU","date":"Tue Jun 12 20:44:17 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@historythoughts @NationalHistory @newsHHS1 Good luck to you and your students Derek!!! Make sure to let me know the results!","date":"Tue Jun 12 20:23:08 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@CNBC: @NFIB's Small business optimism jumps to second-highest ever; tax cut cited https://t.co/kfTv3kTNID  #ProGrowth","date":"Tue Jun 12 15:17:09 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Amazing evening watching @realDonaldTrump shake hands with NK leader, Kim as they start this historic summit. Regardless of the outcome, everyone has to admit this is a positive step towards peace.","date":"Tue Jun 12 02:22:26 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"My heartfelt thought and prayers are with Larry Kudlow and his family right now. The @FinancialCmte met w Larry a few weeks ago and I appreciate his steady hand on the economy. Get well soon, Larry!","date":"Tue Jun 12 01:05:19 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Heartbreaking news. What a brilliant mind and incredible person.  @FoxNews' Charles Krauthammer says goodbye to colleagues, friends and viewers https://t.co/FjA3h0OkdI","date":"Fri Jun 08 17:09:31 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Watch GlennFogel of @BookingHoldings  and @bookingcom on @cnbc right now. I had a great visit to their 2nd Dist Kentwood MI call center last week and met some amazing employees. Booking yeah!","date":"Fri Jun 08 11:38:59 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"On this D-Day anniversary I’m thinking of a vet I recently met who landed on Omaha Beach after lied about his age (17!) to enter the Army. After the war he finished high-school but then fought for 16 mo. in Korea! That truly is the #GreatestGeneration!","date":"Wed Jun 06 14:33:30 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"\"That’s as good a report card as we have seen in manufacturing in more than a decade — maybe two.\" https://t.co/ixHNHYt5ze #GoodNews #TCJA #Michigan","date":"Mon Jun 04 20:29:13 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"#MorningRead: Small distilleries in #WestMichigan get boost from GOP tax law. @wzzm13 has the story https://t.co/Ej5UOH6bku","date":"Mon Jun 04 14:36:07 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Happy National Donut Day! I have to remind myself, “all things in moderation...”\nThanks @margesdonutden for being a community cornerstone! https://t.co/GScGSTj5BP","date":"Fri Jun 01 14:01:07 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Fed taking the first step towards addressing the numerous unintended and negative consequences of the Volcker Rule is much needed and long overdue.  However it is going to take several steps to address the VR or \"Five Headed Hydra\" as Mr. Quarles has referred to it.","date":"Thu May 31 20:38:06 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"#RightToTry is now law! This legislation provides hope to both terminally ill patients and their families by allowing Americans to try experimental treatments that have passed basic FDA safety standards. #RTT is a great example of how the government can promote a culture of life!","date":"Wed May 30 20:15:54 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Today we honor the men and women who made that ultimate sacrifice. Let us hold in our hearts the families of the fallen as we remember the true meaning of #MemorialDay. #NeverForget https://t.co/OdUW7lgMqH","date":"Mon May 28 16:25:24 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"I had the honor of getting to know Amb Whittlesey when I was chosen to participate in the American/Swiss Young Leader program a number of years ago. She was a tireless advocate for the US and a bridge builder in the international community. Faith, you will be missed! https://t.co/GPcaZNo5FQ","date":"Fri May 25 20:03:47 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"I’m happy to be doing work in House @FinancialCmte  Capital Mkts sub-comm on block chain tech and it’s future possibilities. Interesting application being looked at in Sweden w @Nasdaq.  There is huge world wide potential.  https://t.co/EhJefG1Uxn","date":"Fri May 25 15:04:46 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Dodd-Frank left a trail of unintended consequences. Today some of those were resolved with bipartisan legislation to cut red tape on credit unions as well as community and regional banks so they can support small businesses on Main Street! https://t.co/hrA01dvMkD","date":"Thu May 24 20:50:05 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #RightToTry legislation offers patients suffering from a terminal illness a fighting chance by providing them with the opportunity to try experimental treatments. It also serves as a tremendous example of how Congress can act in a bipartisan way to promote a #CultureofLife.","date":"Wed May 23 00:19:46 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Of note from last week: the #OpenSkies agreement creates a more level playing field for all American airlines while promoting job creation here in the U.S. This will strengthen the economy and benefit consumers!","date":"Mon May 21 21:48:25 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"As I board a flight today, I’m reminded how far air travel has come in less than a century thanks to Charles Lindbergh. I recently read Scott Berg’s great biography of CAL and then visited the @airandspace museum. Amazing story and display! https://t.co/brU95lyVEE","date":"Mon May 21 16:31:20 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It was chillax... https://t.co/lYPb7jBAkq","date":"Fri May 18 14:08:39 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a great group of WM students! Lots of fun and full of questions! All the best as you leave high school and enter the next chapter of life. https://t.co/9VD412iY4Q","date":"Fri May 18 00:16:08 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"I'm glad to see the House Appropriations Committee take the positive step of passing legislation to further restore the Harbor Maintenance Trust Fund to its proper level as well as strengthen the efforts to keep Asian carp and other invasive species out of the #GreatLakes","date":"Wed May 16 17:38:32 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you @AustinHatch30 for sharing your story at today’s Youth Leadership Summit at @GVSU and discussing that how we respond to the challenges in our lives, plays a crucial role in determining who we will become. https://t.co/XcgRPgRIxC","date":"Mon May 14 15:29:54 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thank you Dakota Crow from the @BGClubMuskegon for speaking with the students about being leaders in the community and role models for younger students at today’s Youth Leadership Summit at @GVSU! https://t.co/1NA2tlCQHD","date":"Mon May 14 14:10:15 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Great speech by Mark Murray, Vice Chairman of @meijer, to kick off today’s Youth #Leadership Summit for #WestMichigan high school students at @GVSU! https://t.co/QhipJOY3SP","date":"Mon May 14 13:05:43 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"My favorite part of #TulipTime is celebrating this #PureMichigan tradition with the family. It was wonderful to see so many people join in this year’s parade and festivities! https://t.co/6RfWkKlLf4","date":"Sat May 12 22:19:56 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@OrioleSupt Both are incredibly talented young artists! Well done!","date":"Sat May 12 20:10:25 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"More positive news for hardworking small businesses following tax and regulatory reform! The latest @NFIB survey finds small business optimism surging as more #SmallBiz report record success! #YouBuiltThat\nhttps://t.co/qYfLujv9uv","date":"Thu May 10 14:17:06 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"The #IranDeal doesn't keep America or our allies safe &amp; rewards bad behavior. Through sanctions and maximum pressure, we can bring the Iranians back to the table instead of leading them to the very edge of a nuclear breakout. Read my full statement here: https://t.co/nkYL4f5wKZ","date":"Tue May 08 21:30:52 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Another piece of #TulipTime History has been rediscovered as Holland resident Muriel Bolhuis finds an original score for the Tulip Time Dance! Check out @WOODTV's story by @_EvanDean https://t.co/SjYJyaAOje #PureMichigan","date":"Tue May 08 15:00:07 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"#TulipTime is a well-known West Michigan tradition, however the celebration wouldn't be the same without those iconic wooden shoes. Check out @wzzm13's story that tells how these classic shoes are made. https://t.co/XdaLIXB0MW #PureMichigan","date":"Mon May 07 19:50:46 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Just wrapped up speaking to the @SLMIrotaryclub about the #TCJA, reforming Dodd-Frank, and the #GreatLakes. Thank you for the opportunity!  #TaxReform https://t.co/55AMCI1BaD","date":"Fri May 04 17:12:53 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"This morning I led a moment of silence during the @miOttawa Legislative Forum to honor my former colleague State Senator Patty Birkholz who sadly passed away last evening. She was a tireless advocate for the Great Lakes and West Michigan. https://t.co/okIrCGm7c8","date":"Fri May 04 14:01:38 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Having properly dredged ports &amp; harbors is vital to growing the economy in Muskegon, Holland, Grand Haven, and Ludington. This is why I have led the bipartisan effort to make sure the Harbor Maintenance Trust Fund is used for its intended purpose! https://t.co/MiCwHk9AvH","date":"Thu May 03 19:12:17 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@brielleniicole I am glad you enjoyed your time at the Capitol! I will make sure to tell Phil!","date":"Thu May 03 12:02:00 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"I have known and worked with Gord for many years and I agree, he was one of the most upbeat people I have ever met. A true public servant who will be deeply missed as a friend and colleague. Blessings and peace to his family and friends. https://t.co/TjicpBCfKa","date":"Wed May 02 18:36:07 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Gord was a dear friend and former Co-Chair with me of the US/Canada Inter-Parliamentary Group organization. I’m heartbroken for his wife and family and hold them in my prayers. You will be deeply missed as a friend and colleague in Canada and the US.   https://t.co/RgfddQUdT0","date":"Wed May 02 18:29:35 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Thanks to the federal, state and local 1st responders battling the forest fire in Newaygo Co tonight. God speed and blessings. Our prayers are with you and all affected. Thanks for your brave work!","date":"Wed May 02 02:50:08 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"More good #taxreform news to celebrate during #SmallBusinessWeek! Survey: #SmallBiz workers saw their wages grow at the strongest rate in 2 years! https://t.co/H2FeA334pP","date":"Tue May 01 14:35:43 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"You have big cleats to fill, Frank! Looking forward to seeing you develop into a Pro-Bowl lineman! https://t.co/Utj8ssUZBo","date":"Fri Apr 27 02:24:27 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Let’s make it a good one please... https://t.co/ja3hfONPhB","date":"Fri Apr 27 02:19:09 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@GaryLaBranche Thank you for your kind words Gary!","date":"Thu Apr 26 18:52:52 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations to West Michigan native Richard Grenell on being confirmed as Ambassador to Germany! Germany is a strategic ally and important economic partner. I am glad to see the Senate finally confirm him!","date":"Thu Apr 26 18:51:47 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"The House FSC will be watching closely to ensure customers receive justice from these misdeeds! U.S. to fine Wells Fargo $1 billion — the most aggressive bank penalty of the Trump era - The Washington Post https://t.co/eOdTd8b5bY","date":"Thu Apr 19 21:58:21 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Had an insightful and productive hour long conversation  this morning w 2nd Dist high school students Stella and Eli about bullying, gun violence and mental health needs in school and society. Thanks for taking the time to come to DC!","date":"Thu Apr 19 16:56:58 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Out with the old, in with the new. It’s time for West Michigan to say goodbye to an outdated federal tax code and hello to the new pro-growth opportunities ushered in by the Tax Cuts &amp; Jobs Act. Learn more in today’s #TaxDay Edition of the Huizenga Huddle! https://t.co/uEcYb0aa5t","date":"Wed Apr 18 03:45:22 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"I join the nation, praying for the Bush family as they say goodbye to “America’s First Lady”, Barbara Bush. Having met her a number of times I can attest she was a gracious yet determined member of The Greatest Generation. Blessings &amp; Peace as we remember Geo HW’s “Bar”.","date":"Wed Apr 18 00:38:57 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"We continue to pray for your recovery, Steve! Keep fight’n!! https://t.co/wi24b8hTqF","date":"Mon Apr 16 23:05:34 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"The Syrian Regime led by Bashar al-Assad must be held accountable for its continued use of chemical weapons to indiscriminately kill innocent men, women, and children. Read my full statement here: https://t.co/wJAoh6bjNE","date":"Sat Apr 14 11:40:13 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Just voted on a Balanced Budget Amend to the US Constitution which had 233 in favor and 184 votes opposed. 7 Dem “Yea” and 6 Repub “No” votes. Most Dems want take your money and spend it, not have to make tough decisions. I did in the St House and we should in DC too! #BBA","date":"Thu Apr 12 21:43:38 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"While I’m sad to see the announcement from my friend @SpeakerRyan that he is not running again, I know we have some amazing leaders behind him. All the best and blessings  to you and your family on your new adventure!","date":"Wed Apr 11 14:06:42 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"@Bloomberg: Share of U.S. Small Businesses Raising Pay Hits 17-Year High https://t.co/qaljt7aTAp #TCJA #SmallBiz #NFIB","date":"Fri Apr 06 15:41:58 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"1,000 feet of Lake Michigan beach, 17 acres of dunes added to preserve in Muskegon County #PureMichigan https://t.co/Sza04UGOOU","date":"Wed Apr 04 16:06:38 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Congratulations @umichbball on a tremendous season! It was fun to watch you come together as a team and go all the way to the #NationalChampionship game. Well done to both the students and Coach Beilein!","date":"Tue Apr 03 03:39:52 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Blessings and Peace to all on this special day. https://t.co/iMpzw7Xo9z","date":"Sun Apr 01 23:06:56 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"#GoBlue!!! Good adjustments lead to a second half comeback! I’m excited to see @umichbball play for the #nationalchampionship on Monday night!!! #FinalFour","date":"Sun Apr 01 00:22:30 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Almost game time! #GoBlue! #FinalFour","date":"Sat Mar 31 22:06:41 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Another great example of #taxreform increasing opportunity! @McDonalds announced it is significantly expanding educational benefits for employees. It is doubling the number of employees who can receive benefits, and tripling the amount they can receive! https://t.co/kweKWgFb6y","date":"Thu Mar 29 18:38:37 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"The bills that the House @FinancialCmte has proposed discussing w the Senate are WILDLY bi-partisan and a number are UNANIMOUS in their full House support. #FloorNotCeiling https://t.co/F2JquG85K9","date":"Thu Mar 29 02:29:09 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"It is astonishing to see such a ridiculous assertion made by a former Supreme Court Justice. What constitutionally protected right should be deemed a \"relic\" next Justice Stevens? the 1st? the 3rd? the 4th? This isn't the answer.  https://t.co/Xc4iWD3bIT","date":"Tue Mar 27 16:36:41 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":".@Meijer hiring 300 people for its new store in #WestMichigan!  https://t.co/5OA3RAFnJk #Jobs #Hudsonville #Jamestown","date":"Wed Mar 21 19:06:30 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":".@RepMarcyKaptur continues to be a leading voice in promoting, preserving, &amp; defending the #GreatLakes. It is a pleasure to work w/ her on this critical bipartisan issue. Congratulations Marcy on becoming the longest-serving woman in the history of the US House #WomenMakeHistory https://t.co/sJQNASLf8y","date":"Mon Mar 19 18:55:02 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Ugh...  bracket officially in the trash.  #MarchMaddness #MarchSadness","date":"Sun Mar 18 21:21:34 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"What a shot! #GoBlue! Keep Dancing! #Sweet16","date":"Sun Mar 18 04:21:15 +0000 2018","user_id":"233949261"},{"handle":"RepHuizenga","text":"Houston... we have a problem.         #GoBlue  #MarchMaddness","date":"Sun Mar 18 03:52:01 +0000 2018","user_id":"233949261"}]