[{"handle":"RepJayapal","text":"Children have the right to go to school without being worried that they'll be shot.\n\nIt's time for the Senate to step up and enact gun safety reform.\nhttps://t.co/oaUTyKSmaJ","date":"Fri Jun 17 14:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The filibuster is a Jim Crow relic that was created to block civil rights legislation, and today stands in the way of so many meaningful reforms.\n\nIt's time to end the filibuster and pass much-needed gun safety reform. https://t.co/tPgZXn9Wx6","date":"Fri Jun 17 04:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":".@S10Bird A legend that has inspired us all.  The greatest.  Our deepest gratitude! 🙏🏾🏀🙏🏾","date":"Fri Jun 17 01:26:15 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This message could not have been clearer today.\n\nWe must hold them all accountable. Our democracy depends on it.\nhttps://t.co/5gzpgYGVa2","date":"Thu Jun 16 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The House has passed gun reforms to raise the age to buy semiautomatic weapons, ban bump stocks, and create federal red flag laws.\n\nIt's time for the Senate to step up and save lives. https://t.co/WuNukaxcG8","date":"Thu Jun 16 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"🚨🚨🚨 Incredible news 🚨🚨🚨\n\nThe Cup is coming to Seattle!","date":"Thu Jun 16 21:34:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you for taking this step, @POTUS!\n\nAs the proud mom of an incredible trans kid, I know just how beautiful it is when people are allowed to be truly themselves. Now it's time to go a step further and pass the Equality Act through the Senate.\nhttps://t.co/9mmSFmvhEx","date":"Thu Jun 16 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today I stood with colleagues to urgently call for climate action.\n\nAs record-breaking storms, heat waves, and droughts continue to plague every zip code in our country, we cannot wait to make meaningful investments to protect our planet. https://t.co/qiTF9OGkz0","date":"Thu Jun 16 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"These hearings clearly lay out just how close we were to losing our democracy on January 6th.\n\nAs painful as so much of this is to relive, it's critical that we not turn away. We must hold the former president and those who enabled him accountable.","date":"Thu Jun 16 19:27:39 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Bearing witness to the unfolding of facts of Trump’s coercion campaign to get VP Pence to overturn the election. \n\nEvery hearing, I am reminded of how close we came to losing our democracy—all incited and fueled by a then-sitting President. \n\nStunning all over again.","date":"Thu Jun 16 17:44:09 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, we'll continue to hear from the January 6th Committee as they put together the pieces of what happened on that deadly day.\n\nSo far, their case has been clear: Trump planned, promoted, and paid for a conspiracy to overturn an election he lost. It's time for accountability. https://t.co/gIfAgWDCIi","date":"Thu Jun 16 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Without the legal protections under Roe v. Wade, thousands of abortion laws could lead to a new chapter of mass incarceration.\"\n\nThis is absolutely terrifying — and further underscores that efforts to ban abortion are solely about controlling our bodies.\nhttps://t.co/GrC0L9vFOM","date":"Thu Jun 16 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My heart goes out to the Phillips family and all families across this country mourning loved ones lost to gun violence.\n\nIn their memory and honor we must pass gun reform.\nhttps://t.co/lc8lnY4f4U","date":"Thu Jun 16 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tomorrow, we'll continue to hear from the Jan 6th Committee.\n\nI look forward to hearing more of their findings, as they skillfully and clearly lay out exactly what happened with this attempted coup.","date":"Thu Jun 16 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is what climate change looks and feels like.\n\nWe're running out of time to act. It's time to make real, meaningful investments into climate action.\nhttps://t.co/GL9fRdkC4c.","date":"Wed Jun 15 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So wonderful to join @UniteThePoor today for their Congressional briefing!\n\nPoverty is a policy choice and our task is to make different choices. \nhttps://t.co/lKjg5OJSdJ","date":"Wed Jun 15 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Big Lie is still alive and well.\n\nThis is why the Jan 6th hearings are so critical. We must hold everyone involved in spreading this lie accountable. \nhttps://t.co/jYuPiUaRf5","date":"Wed Jun 15 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today marks a decade since we declared that Dreamers are home.\n\nAs a lifelong immigrant rights organizer, I'm proud of the work the movement did to contribute to DACA's creation. As we celebrate this day, we must continue to fight for permanent protections and immigration reform. https://t.co/7VRkwr1E45","date":"Wed Jun 15 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tours of the Capitol don't typically include scoping out stairwells and security checkpoints...\n\nIt's time for answers and accountability.\nhttps://t.co/w246GToRm6","date":"Wed Jun 15 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortions are health care and Roe is still the law of the land.\n\nCongress must step up and protect this right for pregnant people across the country.\nhttps://t.co/rBTB52sPOa","date":"Wed Jun 15 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today on the House floor, I honored the life and legacy of Dr. Preston Phillips, who tragically lost his life to gun violence.\n\nGun reform will not bring him back, but I hope that it will serve as a comfort to his family and others who have lost loved ones to gun violence. https://t.co/1esF6Ec4eY","date":"Wed Jun 15 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Anti-competitive behavior hurts everyone.\n\nPeople shouldn't have to decide between putting food on the table or buying their prescription drugs. We need to end these cruel health care monopolies.","date":"Wed Jun 15 13:54:27 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As a huge Seattle sports fan, it was so exciting to meet today with executives from the @Seahawks! https://t.co/1ZesBBZZCA","date":"Tue Jun 14 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"No way.\n\nI refuse to stand by as children are murdered in schools. As lives are stolen in grocery stores, salons, and places of worship. It's time for gun reform.\nhttps://t.co/vGBQDLHVBk","date":"Tue Jun 14 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So grateful to have @SecMartyWalsh's support for my Domestic Workers Bill of Rights.\n\nIt's time to finally guarantee domestic workers have the same protections and rights as all other workers. https://t.co/lx59FmaoLq","date":"Tue Jun 14 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Big Lie is not over.\n\nTHIS is why the work of the Jan 6th Committee is so vital. Because the insurrection was just their first attempt at a coup.\nhttps://t.co/8M6mZwExmU","date":"Tue Jun 14 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My Republican colleagues want to call the American Rescue Plan, which lowered hunger, lowered poverty, and lowered unemployment, a giveaway.\n\nThe real giveaway was their tax scam, which lined the pockets of the wealthiest 10% and cost taxpayers $1.9 trillion. https://t.co/GW5lIbVucU","date":"Tue Jun 14 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to cancel student debt and deliver relief to millions of borrowers across this country.\n\nLet's get this done.\nhttps://t.co/TxZVHqZj3g","date":"Tue Jun 14 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion bans and restrictions aren't about protecting children and parents, they're solely about controlling our bodies.\nhttps://t.co/461nHXz3MZ","date":"Tue Jun 14 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"WA-07 constituents leading the way! From one mom of a trans kid to you: Congrats to SPU graduates for leading with values. ✊🏾🙏🏾And happy Pride month! 🏳️‍🌈🏳️‍🌈🏳️‍🌈","date":"Tue Jun 14 15:00:40 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If the Supreme Court overturns Roe, abortion won't be the only right at stake.\n\nBirth control, same-sex marriage, and so much more could be under attack — and in some states they already are.\nhttps://t.co/ykjPaVOCTK","date":"Tue Jun 14 14:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"On Friday, 14 US cities set heat records.\n\nClimate change is here and now, and we're running out of time to act. It's time for a major investment into climate action.\nhttps://t.co/j0u5bhb3ZG","date":"Tue Jun 14 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Action on gun reform literally cannot wait another week.\n\nIt's time for the Senate to step up and save lives.\nhttps://t.co/pe3XSUuYxK","date":"Mon Jun 13 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Trump incited an insurrection. People died because of his lies.\n\nIt's time for accountability. https://t.co/IsnswJ0DJm","date":"Mon Jun 13 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"White supremacy is a stain on our nation and the greatest domestic terrorism threat we face.\n\nWe must fight back by standing up to hatred and racism wherever we see it.\nhttps://t.co/PnLn06BKJF","date":"Mon Jun 13 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This was such a wonderful opportunity to discuss the care economy with workers from my home state, as well as @SecRaimondo and @MaryKayHenry!\n\nWe have so much work to do and this was a great conversation about how we can prioritize care workers.\nhttps://t.co/DWCwJjte2J","date":"Mon Jun 13 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So great to be with other @CAPAC colleagues at the White House signing of @RepGraceMeng’s bill to take the first step toward having a national #AAPI museum! We are on our way! https://t.co/y8cFOJXoyQ","date":"Mon Jun 13 20:17:35 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm just going to leave this here.\nhttps://t.co/5G5I8Pej31","date":"Mon Jun 13 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"With the future of Roe v. Wade at stake, millions of Americans could lose their right to have an abortion in the coming weeks.\n\nToday, I'm standing up by telling my story as we continue to fight to protect your reproductive rights. #OurAbortionStories https://t.co/U9nvMWRPzO","date":"Mon Jun 13 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"These hearings are clearly laying out what happened:\n\nTrump lost a free and fair election. Trump started the Big Lie, which built to the violence and horror of Jan 6th.\n\nTrump put our democracy at stake and he and everyone who spread this lie must be held accountable. https://t.co/0HenpZUGn5","date":"Mon Jun 13 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Donald Trump's Big Lie was and still is a threat to our democracy.\n\nBut the evidence is clear: the people around Trump knew he lost a free and fair election.","date":"Mon Jun 13 16:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is great news!\n\nEvery worker who wants to be in a union deserves the opportunity to join one. I'm glad to see @Microsoft respecting this right for Activision Blizzard workers.\nhttps://t.co/uzuVgJ0PQj","date":"Mon Jun 13 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This morning, we will continue to hear findings from the January 6th Committee.\n\nEvery single person involved in perpetuating the Big Lie must be held accountable. And these hearings are how we protect our democracy and ensure this never happens again.","date":"Mon Jun 13 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"55 years ago today, the Supreme Court legalized interracial marriage citing the due process clause of the 14th Amendment.\n\nThat's the same rationale used in Roe v. Wade. If Roe is overturned, not only are abortion rights at stake, dozens of other settled precedents could be too.","date":"Sun Jun 12 22:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time to stand up to white supremacy and hatred in this country.","date":"Sun Jun 12 21:58:26 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Six years ago, 49 lives were lost, and dozens more were forever changed at the Pulse shooting.\n\nFor six years, Republicans in Congress have allowed atrocities like this to continue. It's time for the Senate to step up and pass gun safety reforms.","date":"Sun Jun 12 16:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It was an honor to be in Tulsa to celebrate the life of Dr. Preston Phillips. May he rest in power &amp; peace. May his family be wrapped in love of community through this difficult time. \n\nAs so many people there told me, Senate MUST act to save lives &amp; honor those already lost. https://t.co/CwMSrltTdZ","date":"Sat Jun 11 22:10:46 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This would be such a lovely sentiment if they hadn't already given $11,000 to GOP Senators blocking the Equality Act in the 2022 election cycle.....\nhttps://t.co/MQSXjIAreG","date":"Sat Jun 11 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Everyone involved in the January 6th insurrection must be held accountable — from Trump to the sitting members of Congress who asked for pardons from the Trump administration to those storming the Capitol.\n\nThis is how we protect our democracy from future attacks. https://t.co/Rltl7qH8Jp","date":"Sat Jun 11 16:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Want to know why gas prices keep going up so high? Profiteering by Big Oil. \n\nStop that by instituting an excess profits tax and returning some money to consumers pockets.","date":"Sat Jun 11 00:20:34 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This.👇🏾","date":"Sat Jun 11 00:17:51 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Ginni Thomas actively worked to overturn our election and spread the Big Lie.\n\nJustice Thomas must immediately recuse himself from any and all cases regarding the election. \nhttps://t.co/hHwmcjnngg","date":"Fri Jun 10 22:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Gun violence is the number one cause of death for children in America. \n\nIt's time for the GOP to step up and protect our kids. It's time for gun safety reform.","date":"Fri Jun 10 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I want the American public to remember that despite the fact that we were on the floor, fearing for our lives, that we went back and we certified that election.\nhttps://t.co/AiMA0T1Naz","date":"Fri Jun 10 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Protecting Our Kids Act won’t bring Dr. Phillips back, or any of those slaughtered in Tulsa, Uvalde, or Buffalo. But I hope it brings some comfort to Dr. Phillips’ family and the families of all victims of gun violence that we will not stop until we end this crisis.","date":"Fri Jun 10 19:05:49 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This tragedy has struck close to home. Dr. Phillips was the father of Elise Phillips, a valued member of my staff team in Washington, DC, and I and our whole office grieve with Elise and her family.\n\nMy team and I are doing all we can to support Dr. Phillips’ family.","date":"Fri Jun 10 19:05:49 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This weekend, loved ones will gather to honor the memory of Dr. Preston Phillips. A man who dedicated his life to serve and heal and treat others, Dr. Phillips’ life was cut unfairly short because of this uniquely American epidemic of gun violence.\nhttps://t.co/l20G3yWXHp","date":"Fri Jun 10 19:05:49 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Anyone who would purposely slow down the reunification of parents and children has no place in a position of power in this administration.\nhttps://t.co/H5Akt16dAz","date":"Fri Jun 10 17:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time for action. \n\nThe House passed legislation this week to ban bump stocks, raise the age to purchase semiautomatic weapons, create federal red flag laws, and more. Now it's time for the Senate to finally put people's lives ahead of NRA money.\nhttps://t.co/dY2b7ohfeq","date":"Fri Jun 10 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The President of the United States incited a mob to attack the Capitol and steal the election.\n\nTrump lost the election. People died because of his lies. He must be held accountable.\nhttps://t.co/mQLPy8m5IP","date":"Fri Jun 10 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It was truly painful last night to relive Jan 6th, when I could hear the insurrectionists pounding on the doors. When I didn't know if I would make it out of our Capitol alive.\n\nBut we must bear witness to this violence incited by the Big Lie to ensure this never happens again.","date":"Fri Jun 10 14:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"“After everything he’s done for us, this is the only thing he’s asked of me.”\n\n- Insurrectionists on President Trump","date":"Fri Jun 10 01:54:53 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Horrifying.","date":"Fri Jun 10 01:50:18 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"He knew what he was doing. He was prepared to burn our democracy to the ground to hold on to power.","date":"Fri Jun 10 01:33:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This footage is horrifying.\n\nTrump incited a coup. His MAGA cult attacked our Capitol. He tried to destroy our democracy. Tonight the Jan 6th Committee is showing America the truth.","date":"Fri Jun 10 00:58:11 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Here at Jan 6 Select Committee public hearing with colleagues who were trapped with me in the Capitol gallery during the January 6 attack on our democracy. To have accountability, to bring to justice those involved, and to ensure it never happens again. To preserve democracy. https://t.co/srQsHxFmwh","date":"Fri Jun 10 00:00:59 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tonight, we'll begin to hear findings from the January 6th Committee.\n\nOn Jan 6th, we came incredibly close to losing our democracy. And the threat of the Big Lie still persists to this day. It's time for accountability for all involved.\nhttps://t.co/jcwrwXhhjj","date":"Thu Jun 09 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Big Lie was about stealing an election, plain and simple. January 6th was an attempted coup, that if it had succeeded, could have broken our democracy.\n\nIt's time to hold those involved accountable. https://t.co/2bSUt84EO6","date":"Thu Jun 09 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is disgusting. @RepRaskin is one of the smartest, most effective &amp; most compassionate members of Congress &amp; I’m proud to serve with him.\n\nCriticizing anyone for discussing the tremendous pain of losing a child is cruel. @mattgaetz should be ashamed and apologize immediately.","date":"Thu Jun 09 21:09:25 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tonight, I'm looking forward to hearing the findings from the January 6th Committee.\n\nThose who incited violence on that day and who continue to peddle the Big Lie must be held accountable to protect our democracy. https://t.co/2DDMoysWid","date":"Thu Jun 09 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Children shouldn't have to wear bulletproof backpacks to school, but yet there have been more than 25 school shootings in 2022 in America.\n\nThis week, House Democrats passed multiple gun safety reforms to keep our kids safe. It's time for the Senate and Republicans to step up.","date":"Thu Jun 09 18:30:50 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The thing that is most difficult about Jan. 6 is not just what happened on the day, it’s what happened in the aftermath.\n\n57 insurrectionists are running for elected office in 2022. Our democracy is still at stake — and we must step up and protect it.\nhttps://t.co/eJweZxybcl","date":"Thu Jun 09 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I’m about to go live on @MSNBC, be sure to tune in! https://t.co/QUrGxgX73v","date":"Thu Jun 09 17:00:10 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Out of all of these gun safety reforms, the ONLY ONE Republicans voted for doesn't actually change any gun laws.\n\nThey are not the pro-life party. They are the pro-gun party and their thoughts and prayers will never be followed up with action.","date":"Thu Jun 09 16:31:21 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The 7th provision and the only one the GOP supported:\n\nThis provision requires an annual report from DOJ that contains demographic data (race, age, etc.) of those determined to be ineligible to purchase a firearm based on a background check.\n\n✅ 160 Republicans voted for this ✅","date":"Thu Jun 09 16:31:21 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The 4th provision: Safe Storage.\n\nThis provision included multiple bills that create federal standards for safe gun storage and establish real consequences for gun owners whose improper storage leads to death or injury.\n\n❌ 203 Republicans voted against this ❌","date":"Thu Jun 09 16:31:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The 5th provision: The Closing the Bump Stock Loophole Act.\n\nThis provision regulates bump stocks, like the one used in Las Vegas that fired 1,000 shots into a crowd in the most deadly shooting in US history.\n\n❌ 194 Republicans voted against this ❌","date":"Thu Jun 09 16:31:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The 6th provision: The Keep Americans Safe Act.\n\nThis provision prohibits the importation, sale, manufacture, transfer, or possession of a magazine that holds more than 15 rounds of ammo.\n\n❌ 203 Republicans voted against this ❌","date":"Thu Jun 09 16:31:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The 2nd provision: The Prevent Gun Trafficking Act.\n\nThis bill is designed to combat illegal gun purchases and transfers — making a new federal offense for those who purchase guns for someone who is legally unable to do so.\n\n❌ 196 Republicans voted against this ❌","date":"Thu Jun 09 16:31:19 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The 3rd provision: The Untraceable Firearms Act.\n\nThis bill closes loopholes on ghost guns, ensuring that ghost guns, including 3D printed guns, are subject to existing federal firearm regulations.\n\n❌ 193 Republicans voted against this ❌","date":"Thu Jun 09 16:31:19 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The 1st provision: The Raise the Age Act.\n\nThis bill raises the age to purchase semiautomatic guns to 21.\n\n❌ 197 Republicans voted against this ❌","date":"Thu Jun 09 16:31:19 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI last night, the House voted to pass seven gun reforms in one larger package, the Protecting Our Kids Act.\n\nOn all but one provision, nearly every single Republican voted no. So what were they voting against? 🧵","date":"Thu Jun 09 16:31:19 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Last night, the House voted to raise the purchase age of semiautomatic weapons, ban ghost guns and bump stocks, and require safe storage.\n\nToday, we'll vote to enhance red flag laws that remove firearms from people who are a threat to themselves and others. Enough is enough.","date":"Thu Jun 09 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"On Jan 6th, I was trapped in the gallery and was prepared to fight back using a cane and a gas mask.\n\nWe cannot forget the horror of that day, fueled by the Big Lie. Tonight, the Jan 6th Committee will take a major step towards accountability.\nhttps://t.co/WYsuJkUCWJ","date":"Thu Jun 09 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tonight the House said NO MORE to mass shootings, to the murdering of our children, our family members, our friends.\n\nNow it's the Senate's turn to act.","date":"Thu Jun 09 01:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is incredibly upsetting and is the exact outcome many of us warned these draconian anti-trans laws would cause. \n\nAs the proud mom of a beautiful trans kid, my heart is with this family.","date":"Thu Jun 09 00:53:30 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"How anyone can listen to this and still vote against gun reform is beyond me.\n\nDemocrats are taking action. It's time for the GOP to stand up and decide that children's lives are more important than guns.\nhttps://t.co/JU69WKVEa8","date":"Wed Jun 08 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm proud to co-lead @RepBowman's resolution to condemn the \"great replacement theory.\"\n\nWe must all emphatically stand up and fight back against white supremacy, racism and hatred in this country. https://t.co/tHjKBGEkcm","date":"Wed Jun 08 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If members of law enforcement break the law or violate a person's constitutional rights they should be held accountable. \n\nThis ruling sets a dangerous precedent.\nhttps://t.co/QAGuQLzhKe","date":"Wed Jun 08 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today the House will vote on the Protecting Our Kids Act — common sense gun safety reforms that will save lives.\n\nToday we can choose to mean it when we say never again. It's time to pass this critical legislation. https://t.co/ftKmNWkinG","date":"Wed Jun 08 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Here's a thought for them: maybe it's time to stop defending a twice-impeached president who attempted a coup.\nhttps://t.co/iElWxRqXt2","date":"Wed Jun 08 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This child's friend was shot right next to her. She survived by covering herself in her friend's blood and playing dead.\n\nIt is disgusting that our country constantly puts gun rights over the safety of our children. We can never let this happen again. https://t.co/iaH5GjFdDk","date":"Wed Jun 08 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Gun violence is the leading cause of death for children in America.\n\nToday, I will vote for the Protecting Our Kids Act — to enact major gun safety reforms. Enough is enough.","date":"Wed Jun 08 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"No parent or child should ever be forced to suffer like this.\n\nThoughts and prayers aren't enough. We can never let this happen again.\nhttps://t.co/I7Ibu9cx0C","date":"Wed Jun 08 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If Roe is overturned, 20 states with 25.5 million women of reproductive age would face restrictions and outright abortion bans.\n\nThis is unacceptable. Congress must act to guarantee the right to legal abortion in this country.","date":"Wed Jun 08 14:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is an important step from @POTUS, but his leadership cannot be a substitute for Congressional action.\n\nIt's time to pass legislation to invest in renewable energy and move us away from fossil fuel reliance.\nhttps://t.co/7qRiaBPdS5","date":"Wed Jun 08 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just a friendly reminder, that if you're paying an arm and a leg at the pump, Democrats voted recently to stop Big Oil from price-gouging.\n\nEvery single Republican voted against this measure. https://t.co/cDyrm5Oihi","date":"Tue Jun 07 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Shooting prairie dogs is more important than saving lives. Noted.\nhttps://t.co/Ds8X0oT9cH","date":"Tue Jun 07 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to cancel student loan debt and lift this crushing weight off of millions of borrowers.\nhttps://t.co/dG1oEHgSWT","date":"Tue Jun 07 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is what happens when a President tries to sabotage free and fair elections.\n\nThe Big Lie still poses a major threat. This is why we must hold everyone involved accountable. https://t.co/BjYHrFLOzO","date":"Tue Jun 07 20:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We cannot and we will not.\n\nEnough is enough.\nhttps://t.co/eSQ81oK40e","date":"Tue Jun 07 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"🏳️‍🌈🏳️‍⚧️ This #Pride month would be a great time for the Senate to end the filibuster and pass the Equality Act. 🏳️‍⚧️🏳️‍🌈","date":"Tue Jun 07 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"January 6th was a deadly attack fueled by a coordinated campaign of lies about the election.\n\nEveryone involved must be held accountable.\nhttps://t.co/TrXtBK2Dq5","date":"Tue Jun 07 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This step from @POTUS is a critical move towards energy independence, lowering energy costs, and reducing our carbon footprint.\n\nNow it's time for Congress to follow his lead and pass legislation to invest in climate action.\nhttps://t.co/qeAAjT5v5l","date":"Tue Jun 07 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"The average CEO made $10.6 million a year. The average low-wage worker took home just under $24,000.\"\n\nTax the rich.\nhttps://t.co/WkL3J3duma","date":"Tue Jun 07 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"57 years ago today, the Supreme Court ensured access to birth control citing the due process clause of the 14th Amendment.\n\nThat's the same rationale used in Roe v. Wade. If Roe is overturned, not only are abortion rights at stake, dozens of other settled precedents could be too.","date":"Tue Jun 07 14:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Important guide from @NormEisen as the Jan. 6 committee hearings begin this week to show the horrific truths of the Jan. 6 insurrection and attempted coup by Trump and allies to steal the election.","date":"Tue Jun 07 13:16:11 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Medicare Advantage plans regularly deny needed care to seniors and frequently create fake illnesses to defraud the government.\n\nThis is a clear cut example of why we must end Medicare privatization programs. Our seniors deserve better.\nhttps://t.co/ObObuyT5wO","date":"Tue Jun 07 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a great step from @POTUS  that will not only lower our carbon footprint, but will lower energy prices for families across the country!\n\nThis is what climate action and energy independence looks like. Let's keep it up.\nhttps://t.co/Q0kvJESL1i","date":"Mon Jun 06 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student loan debt will lift a crushing weight off of millions of borrowers. \n\nIt's time to get this done!","date":"Mon Jun 06 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We have the power to stop this.\n\nThe House has passed multiple common sense gun safety reforms. It's time for the Senate to step up, do it's job, and save lives.\nhttps://t.co/s7dAJf227A","date":"Mon Jun 06 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"44% of Republicans say that we just “have to accept” mass shootings as a reality.\n\nI don't think they get to call themselves \"pro-life\" anymore.","date":"Mon Jun 06 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is an interesting strategy considering that every single House Republican voted against a measure to stop price-gouging and lower gas prices.\nhttps://t.co/muqwE8BwPU","date":"Mon Jun 06 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"In 1970, before the Roe decision, only 11% of women had college degrees.\n\nThe right to abortion has enabled millions to pursue education and careers. We cannot go back. All people deserve to choose the path that is right for them.","date":"Mon Jun 06 18:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Lives lost and lives forever changed.\n\nGun violence is an epidemic unique to our country. It's time for the Senate to step up and protect our kids, our friends, and our neighbors from gun violence. \nhttps://t.co/ZoaJqBRkw4","date":"Mon Jun 06 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm sorry, I cannot accept children being gunned down in classrooms and mass shootings in grocery stores, salons, and places of worship.\n\nThis is a radical and disgusting stance. \nhttps://t.co/lcHndprlvV","date":"Mon Jun 06 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The states that are most likely to ban abortion are also some of the least equipped to provide maternal care.\n\nIf this were actually about protecting mothers and children they would invest in support systems. This is solely about controlling our bodies.\nhttps://t.co/ETsp7E9wHF https://t.co/G5TNBlkqP0","date":"Mon Jun 06 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 124 people across this country lost their lives to gun violence. Another 325 were injured.\n\nNo more thoughts and prayers. Enough is enough. It's time for the Senate to step up and save lives.","date":"Mon Jun 06 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wishing a happy and meaningful Shavuot to all those who celebrate!","date":"Sun Jun 05 20:14:35 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We cannot keep waking up to news of more gun violence, more communities traumatized, more lives tragically lost. It’s time to act.","date":"Sun Jun 05 16:05:07 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Overturning Roe means being out of step with the will of the people","date":"Sat Jun 04 17:18:10 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Under @POTUS, wages are higher, unemployment is lowest in over half a century, and we’ve increased the balance in our Social Security fund. That is what investing in our people does. Strengthening the common good. ✊🏾✊🏾","date":"Sat Jun 04 11:59:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Ummm…well, yeah. The point is not to lie.","date":"Sat Jun 04 11:27:21 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Excellent trip w/⁦@FES_DC⁩ ⁦@JaredHuffman⁩ to Berlin to build global progressive alliances. Productive mtgs w/⁦@W_Schmidt_⁩ , members of parliament on climate &amp; energy, health, 🇺🇦, antitrust, migration, economy. Great progress also passing 12 Euro min wage!✊🏾 https://t.co/n5GvzROhRz","date":"Sat Jun 04 09:16:48 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just a reminder this Pride month that we still have not enshrined protections for our LGBTQ+ family into law. The House did its job. Now it's time for the Senate to pass the Equality Act.","date":"Fri Jun 03 21:37:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion bans only hurt our most vulnerable communities, including low-income people and people of color. We cannot afford to go back. We must protect the right to choose at all costs. \nhttps://t.co/oS71kscKh6","date":"Fri Jun 03 20:17:41 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"To protect our right to choose, our right to vote, and our right to exist safely and peacefully in public without the threat of gun violence, we must end the filibuster. It's that simple.","date":"Fri Jun 03 17:28:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Too many communities left devastated. Too many lives needlessly lost. Thoughts and prayers are not enough. Republicans must fall into step with the will of the people and #EndGunViolence. https://t.co/WzYILXFWz6","date":"Fri Jun 03 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can and we must. Today, I #WearOrange to stand with the families across our country - from Buffalo to Uvalde to Sandy Hook to Tulsa - who have lost loved ones to gun violence.\n\nEnough is enough. No more thoughts and prayers. It’s time for legislation. https://t.co/2yaW85mL9n","date":"Fri Jun 03 14:03:14 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Families in Uvalde, Texas were still burying their children when another shooting happened, this time in Tulsa, Oklahoma. Four people were murdered, and another community was left heartbroken and torn apart by the epidemic of gun violence. We need to stop this now. https://t.co/Cue25uHrrg","date":"Thu Jun 02 21:01:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Black college graduates have almost twice as much student loan debt than their white peers. Student debt cancellation is a racial justice issue.","date":"Wed Jun 01 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, I'm proud to join my colleagues in leading a resolution to end our country's unauthorized involvement in the war in Yemen. We cannot stand by and allow the U.S. to be complicit in the suffering and starvation of a people.","date":"Wed Jun 01 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"A broken system is when people have to decide between putting food on the table or getting life-saving prescription drugs. \n\nEveryone deserves access to quality, affordable healthcare. We need Medicare for All now.","date":"Wed Jun 01 16:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's only been a week since the horrific shooting in Uvalde. Parents are still burying their children. And yet, we've seen more than a dozen shootings since. We can't keep living like this. Enough of putting guns over people's lives. https://t.co/eL8dH4XP2T","date":"Wed Jun 01 15:09:45 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the mom of an incredible trans kid, I know just how beautiful it is when people are able to truly and unapologetically live as themselves.\n\nHappy #Pride Month to all LGBTQ+ people across this country and the world \n❤🧡💛💚💙💜 https://t.co/PcLykIATcy","date":"Wed Jun 01 13:28:55 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The climate crisis is here and it is wreaking havoc on our communities. Our most vulnerable will pay the steepest price. It is on us to act now. https://t.co/Algb19vAK6","date":"Tue May 31 20:21:23 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Inaction is a policy choice. We can and must choose different. Lives are at stake.","date":"Tue May 31 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's the filibuster or gun reform. It's the filibuster or abortion. It's the filibuster or voting rights. This shouldn't be a hard decision.","date":"Tue May 31 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's been one week since 19 children and two teachers were murdered in Uvalde, Texas. Lives cut unfairly short, and another community forever changed because of the epidemic of gun violence in our country. When we say never again, we have to mean it. It's time to act.","date":"Tue May 31 13:11:21 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, we honor all those who have made the ultimate sacrifice for our country. \n\nThank you to all those who choose to serve our nation.","date":"Mon May 30 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am a proud sponsor of HR 1808, the Assault Weapons Ban of 2021.\n\nLegislation like this cannot wait. There is no reason why the average person should be able to walk into a store and buy an AR-15. Period.","date":"Mon May 30 16:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Children shouldn't have to ask Congress to act.\n\nIt's time for the Senate GOP to step up and protect these kids.\nhttps://t.co/efo1NQpazh","date":"Sun May 29 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Guns are the leading cause of death for children in this country.\n\nI don't know what more the GOP needs to hear before they act on gun reform.","date":"Sun May 29 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to end the filibuster and pass gun safety reform.\n\nThis cannot wait any longer.","date":"Sat May 28 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can never forget these beautiful faces.\n\nIn their honor and memory, the Senate must act on gun reform. This cannot wait.\nhttps://t.co/UVOs9FGyUU","date":"Sat May 28 16:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is disgusting. 19 children are dead.\n\nThe NRA and the members of the GOP they've bought clearly have no shame.\nhttps://t.co/nVqKoi4HGn","date":"Fri May 27 23:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion care IS health care.","date":"Fri May 27 21:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a uniquely American problem.\n\nIt's time to enact gun reforms. There's no reason we should have to live in constant fear of gun violence.\nhttps://t.co/dctVp7pAGf","date":"Fri May 27 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"CEOs are taking home record paychecks while working families pay more for everything from gas to groceries.\n\nThey're using inflation as a smokescreen to line their own pockets, and we can't let them get away with it.\nhttps://t.co/qjZ4z8wiNn","date":"Fri May 27 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"A majority of Americans support gun reform.\n\nPoliticians shouldn't be standing in the way of action. Lives are at stake.\nhttps://t.co/se79GfAIxF","date":"Fri May 27 15:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The so called \"pro-life\" party that calls our gun violence epidemic a mental health crisis, but also defunds mental health care.\n\nThere's no words for this hypocrisy.\nhttps://t.co/g8rRehE9ex","date":"Fri May 27 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"19 children are dead. Two teachers are dead. I have no words for this.\n\nWe don't need the Senate GOP's thoughts and prayers. We need action.\nhttps://t.co/52jYpE5KzM","date":"Thu May 26 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you @POTUS for taking steps that Senate Republicans continue to block.\n\nThere is still so much work to be done, but these actions are an important step forward.\nhttps://t.co/00EUA25vSH","date":"Thu May 26 20:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"40% of Uvalde's budget goes to police. The school district even has its own police force.\n\nBut it took police an hour to enter the classroom where children were being killed. The only answer here to save lives is gun reform.","date":"Thu May 26 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Maybe if the GOP spent half as much time as they do finding ways to strip away our reproductive rights on gun safety reform and improving access to mental health care, lives would actually be saved.\nhttps://t.co/H4BINK6E1V","date":"Thu May 26 17:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There is no reason for weapons of war to be on our streets, in our grocery stores, our schools, our places of worship.\n\nOur communities would be safer with an assault weapons ban.","date":"Thu May 26 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student debt will help millions of women — who are already disadvantaged by the gender pay gap.\n\nThis is a matter of social justice and we must deliver.\nhttps://t.co/cLaUmUJiM3","date":"Thu May 26 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This cannot wait any longer. It's time for the Senate to do something.\nhttps://t.co/EnqS4nUexs","date":"Thu May 26 14:00:04 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion rights are critical — but there is no doubt in my mind that if the radical Supreme Court overturns Roe — so many more rights will be on the line.\nhttps://t.co/vT1FoNZ9MU","date":"Thu May 26 00:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There have been 213 mass shootings in 2022. \n\nThat is more than one mass shooting per day. The solution is clear: it's time for gun reform. How many more must die before the GOP works with us to protect our kids?","date":"Wed May 25 22:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just a reminder, @POTUS is tackling this issue head-on, while House Republicans tried to block funding to end this crisis.\nhttps://t.co/wQT167QDn6","date":"Wed May 25 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Two years ago, George Floyd was murdered. Today, my heart is with his family and community.\n\nAnd today, the George Floyd Justice in Policing Act is being blocked in the Senate by the filibuster. It is time to honor his memory by acting on this critical legislation.","date":"Wed May 25 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am speechless. 311,000 children.\n\nEnough is enough. Gun reforms will save lives.\nhttps://t.co/IuOlVxuxR7","date":"Wed May 25 17:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Parents shouldn't have to be shopping for bulletproof backpacks.\n\nChildren and teachers shouldn't have to be scared to go to school.\n\nThis doesn't have to be the country we live in. It's time for the Senate to act. https://t.co/tMOr5RszBa","date":"Wed May 25 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Gun violence is the number one killer of children in this country.\n\nWe must do better.\nhttps://t.co/AAbyv1y71v","date":"Wed May 25 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Parents across the country are dropping their children off at school today with fear in their hearts.\n\nWhen will the GOP step up and finally help us protect our children? Enough is enough.","date":"Wed May 25 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My full statement on horrific Uvalde massacre.  How many more school shootings will happen before Republicans decide to act? \n\nYear after year, House passes sensible gun reforms that would save lives. Every time, Senate GOP blocks those bills. We must stop these massacres. Now.","date":"Wed May 25 02:44:46 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My heart breaks for families across Uvalde, Texas who are in shock and mourning.\n\nNo child should have to experience such a horrific attack. No teacher should have to be afraid of going to work. Enough is enough.\nhttps://t.co/rSreLbjE4n","date":"Tue May 24 20:50:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion care is health care. \n\nIt's time for the Senate to end the filibuster and codify Roe. Health care decisions cannot and should not be made by politicians.","date":"Tue May 24 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thanks to the American Rescue Plan, \"almost eight in 10 adults said last fall that they were either 'doing okay or living comfortably.'\"\n\nLet's keep up this momentum and fight inflation by lowering the cost of housing, health care, child care, and more!\nhttps://t.co/4bIJyCQXVe","date":"Tue May 24 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am so thrilled to see this announcement!\n\nBy supporting climate innovation in typically underserved communities — we can bring together diverse voices and ideas to create the climate solutions of tomorrow.\nhttps://t.co/nMnHF9Lk8I","date":"Tue May 24 17:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Last year saw the highest number of deaths as a result of active shootings...a whopping 171% increase from 2020.\"\n\nHow many people have to lose their lives before the Senate acts on gun safety reform? Enough is enough.\nhttps://t.co/zuhGimyeTZ","date":"Tue May 24 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am sick and tired of politicians using immigrants as a political football.\n\nTitle 42 is cruel, racist, and xenophobic. It's time for it to end.","date":"Tue May 24 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Meanwhile, millions across this country and the world were pushed into extreme poverty.\n\nIt's time to tax the rich.\nhttps://t.co/VPeLbUwck3","date":"Tue May 24 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such great news and it's on top of over $29 billion in funding opportunities have already incorporated Justice40 considerations!\nhttps://t.co/V4H5zueNwx","date":"Tue May 24 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time for insurance with no co-pays, no deductibles, and no premiums. \n\nEveryone in, nobody out. It's time for Medicare for All.","date":"Tue May 24 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Domestic workers deserve the same workplace protections that other professions have.\n\nThat's why I'm proud to lead the Domestic Workers Bill of Rights. Let's get this done.\nhttps://t.co/HKbilAriiv","date":"Mon May 23 23:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student loan debt would provide relief to nearly 45 million who owe an average $37,014 per borrower.\n\nIt's time to cancel student loan debt.","date":"Mon May 23 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Five of the largest energy companies are together making $2,600 profit every second, and there are now 62 new food billionaires.\"\n\nThis is disgusting. Those profiting off the pandemic and war by price-gouging must be held accountable.\nhttps://t.co/vDbqZ3zNaB","date":"Mon May 23 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"🌊 Flooding is getting worse.\n\n⛈ Storms are getting worse.\n\n🔥 Wildfires are getting worse.\n\nJust this weekend, cities throughout the country broke daily heat records. Climate change is here and now, and we're running out of time to act to keep our planet livable.","date":"Mon May 23 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is great news. Thank you @POTUS!\n\nThis will help hundreds of thousands of families get the formula they need — despite the best efforts of the 192 House Republicans who voted to try and block funding to alleviate this crisis.\nhttps://t.co/m1SYTS38Tc","date":"Mon May 23 17:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 134 people across this country lost their lives to gun violence. Another 264 were injured.\n\nWe shouldn't have to live under the constant threat of gun violence. It's time for the Senate to act and pass common sense gun safety reforms.","date":"Mon May 23 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, Title 42, the racist and xenophobic public health law that's blocked millions of refugees and asylum seekers from entering the country, was supposed to end.\n\nWe must fight this ruling and restore our country as a beacon of hope.\nhttps://t.co/87Y3TCzEY8","date":"Mon May 23 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion is health care. \n\nAnd if the GOP actually cared about parents and children they would support programs like the Child Tax Credit.\nhttps://t.co/tX3tNtWdDL","date":"Mon May 23 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Senate must step up and codify Roe.\n\nAbortion rights are human rights and this is unacceptable.\nhttps://t.co/7lgBHCB4eh","date":"Sun May 22 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel student loan debt and lift this crushing weigh off of millions of borrowers.\n\nIt's time.","date":"Sun May 22 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"That’s right: cancel it.  Excellent article about collective responsibility and the tragedy of student debt. https://t.co/sIDRTOGzG9","date":"Sun May 22 15:23:19 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's the filibuster or gun reform.\n\nIt's the filibuster or abortion rights.\n\nIt's the filibuster or LGBTQ+ rights.\n\nThe choice is clear. The Senate must end the filibuster.","date":"Sat May 21 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: The \"pro-life\" GOP voted AGAINST getting baby formula to families in need.\nhttps://t.co/t4EdvQzG2c","date":"Sat May 21 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"People shouldn't have to be afraid to go into a grocery store, a hair salon, or a place of worship.\n\nThis doesn't have to be the country we live in. It's time to pass gun safety reform. It can't wait any longer.\nhttps://t.co/U0isSY9t0R","date":"Sat May 21 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This headline literally says it all.\nhttps://t.co/dl4KESTNQl","date":"Fri May 20 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Throughout the pandemic, millions have been expelled under Title 42. People fleeing famine, violence and war. Our nation has failed them, plain and simple.\n\nWe cannot allow Title 42, a public health policy, to continue to circumvent immigration law.\nhttps://t.co/fmW5OjHVew","date":"Fri May 20 22:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Ginni Thomas actively tried to overturn the election.\n\nJustice Thomas MUST recuse himself from any and all cases regarding the 2020 election or insurrection. https://t.co/HklfphSdg2","date":"Fri May 20 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Oklahoma already has one of the highest maternal mortality rates in the country.\n\nThis isn't about protecting mothers and children — it's about controlling our bodies. This is why we must codify Roe.\nhttps://t.co/gr7ERGWE4H","date":"Fri May 20 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today should be Michael Brown's 26th birthday.\n\nInstead, he was taken from this world in an act of racism. Today, in the wake of another brutal attack on Black Americans, may his memory be a reminder to stand up to hatred wherever we see it.","date":"Fri May 20 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"People shouldn't be expected to pay hundreds of thousands of dollars for necessary medical treatment. \n\nIt's time for a system with no co-pays, no deductibles, and no premiums. It's time for Medicare for All.\nhttps://t.co/OFPZgzXtlS","date":"Fri May 20 17:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"A friendly reminder that this week nearly every single House Republican voted against:\n\n❌ lowering gas prices\n❌ addressing the baby formula shortage\n❌ fighting domestic terrorism","date":"Fri May 20 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Families are struggling to keep food on the table while Big Oil is raking in record profits.\n\nThis price-gouging is totally unacceptable.\nhttps://t.co/cN4Ptx26CQ","date":"Fri May 20 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yesterday, Denton, TX became the *100th* local government to endorse a Medicare for All health system!\n\nThis is huge news, and there's no question the momentum is building. It's time to pass Medicare for All and finally guarantee health care as a human right in this country.","date":"Thu May 19 23:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The GOP doesn't care about saving working families money.\n\nThey just want a crisis to blame on Democrats.\nhttps://t.co/qP8n21BI0b","date":"Thu May 19 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is why we must codify Roe.\n\nPregnant people in Oklahoma, and across the country, deserve to make their own health care decisions. Abortion is health care.\nhttps://t.co/XVtlZ5c22Y","date":"Thu May 19 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Immigrants are a bedrock of our country.\n\nTitle 42 is a xenophobic, Trump-era public health law. It cannot and should not be continued to keep immigrants and refugees from seeking asylum in our country.\nhttps://t.co/gyCIA7orUy","date":"Thu May 19 20:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big Oil companies have been raking in record profits and paying off shareholders while pushing costs onto working families.\n\nToday, the House is taking steps to fight back against this profiteering.\nhttps://t.co/bFElONaBaU","date":"Thu May 19 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student loan debt will provide a lifeline to millions. \n\nAnd the President can do it with the stroke of a pen. Let's get this done!","date":"Thu May 19 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Nearly two-thirds of Americans support keeping Roe in place.\n\nIt's time for the Senate to step up and codify Roe. \nhttps://t.co/bhW247e8dE","date":"Thu May 19 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Why did 192 Republicans vote against funding to stop the formula shortage?\n\nBecause they aren't actually the \"pro-life\" party — and being able to blame this crisis on the President and Democrats is more important to them than babies getting the formula they need. https://t.co/86ilpdRkJc","date":"Thu May 19 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The infant formula shortages we're seeing across the country are terrifying for new parents who rely on these products to keep their babies healthy.\n\nToday, I'm proud to vote to pass emergency funding that will help fix this shortage quickly.","date":"Wed May 18 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"When will enough finally be enough for the Senate to act?\n\nGun violence and hatred are on the rise in our country — but sadly are nothing new. It's time to enact gun reform. There's no reason to have weapons of war on our streets.\nhttps://t.co/AMLjeAjFAF","date":"Wed May 18 22:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Exciting news! Today @EnergyCommerce is marking up my South Asian Heart Health Awareness and Research Act — a critical step before it can receive a full vote on the House floor.\nhttps://t.co/79wjON946I","date":"Wed May 18 20:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Codifying Roe isn't radical — what is radical is the Supreme Court taking health care decisions out of the hands of pregnant people.\n\nRoe is the law of the land and must be preserved. https://t.co/iHui8TyD7I","date":"Wed May 18 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question, Medicare for All isn't just good policy — it's incredibly popular.\n\nAnd this comes just days after the Senate held a historic hearing on this legislation. Let's keep up this momentum!\nhttps://t.co/e6rV3t4CHD","date":"Wed May 18 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"That deadly toll — 9 million people each year — has continued unabated through 2019, killing more people than war, terrorism, road injuries, malaria, drugs and alcohol.\"\n\nInvesting in renewable and green energy will literally save lives. It's time.\nhttps://t.co/4M1aBMdh9x","date":"Wed May 18 17:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel student loan debt and deliver relief to millions of borrowers.\nhttps://t.co/QuEym2xscI","date":"Wed May 18 15:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such a powerful piece highlighting the fear that communities of color live with every day in this country.\n\nEvery single person must stand up to racism and white supremacy wherever we see them.\nhttps://t.co/MYT4THdYsJ","date":"Wed May 18 14:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Equal pay for equal work! This is a big deal and it wouldn’t have happened without the incredible fighting advocacy of ⁦@mPinoe⁩ and all the women soccer players  who stood up! ✊🏾✊🏾⚽️⚽️ https://t.co/jYLjo8RXnW","date":"Wed May 18 12:51:37 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you @POTUS for clearly saying this. \n\nWe must all stand up to hatred wherever we see it — especially as hatred is on the rise.\nhttps://t.co/mlDiQD5H43","date":"Wed May 18 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: You can now order a THIRD batch of free COVID tests 👇🏾\nhttps://t.co/wtEPrRaSAh","date":"Tue May 17 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"No more thoughts and prayers. Enough is enough.\n\nThe Senate must end the filibuster and pass gun safety reforms.","date":"Tue May 17 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American people support abortion rights.\n\nCongress must act and protect this right for all pregnant people.\nhttps://t.co/D33MlizWMB","date":"Tue May 17 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student loan debt is a matter of social and racial justice.\n\nIt's time to lift this crushing weight off of millions of borrowers.","date":"Tue May 17 18:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"For me, the decision to have an abortion was one of the most difficult I've ever made, but it was MY decision. \n\nThat is the right we must preserve for people across this country. It's time for the Senate to step up and codify Roe.","date":"Tue May 17 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is what happens when white supremacy and racism are allowed to fester. \n\nPolitical leaders at all levels must call out this hatred. Our country is better than this.\nhttps://t.co/UiroV9q2j8","date":"Tue May 17 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of an incredible trans kid, I know how beautiful it is when people are able to be truly themselves.\n\nToday, on International Day Against Homophobia, Transphobia, and Biphobia, and every single day, I'm standing with LGBTQ+ communities across the country. https://t.co/fA8zhP9dwC","date":"Tue May 17 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big Oil is using inflation and war as a smokescreen to raise prices for people across this country.\n\nWe must hold them accountable.\nhttps://t.co/izA1EgmEeo","date":"Tue May 17 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Addressing climate change will literally save lives.\n\nIt's time to act.\nhttps://t.co/LK2TRt6xc8","date":"Mon May 16 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So many are mourning today.\n\nThoughts and prayers are not enough. It's time for the Senate to end the filibuster and pass gun safety reforms. We cannot continue to allow tragedies like this to happen.","date":"Mon May 16 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion care is health care. \n\nThis is a decision that can only be made by the pregnant person. Not politicians.","date":"Mon May 16 18:35:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Nearly two-thirds of student loan debt is held by women and it's causing them to put their lives on hold.\n\nIt's time for this administration to cancel student debt.\nhttps://t.co/Muo2rJHh3I","date":"Mon May 16 16:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The words used by people in positions of power matter.\n\nWhite Supremacy and hatred are on the rise in this country. We must stand up and call out racism wherever we see it — whether it's in our communities or the halls of Congress.\nhttps://t.co/UBUDtK2kPS","date":"Mon May 16 15:16:36 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 127 people across this country lost their lives to gun violence.\n\nEnough is enough. The Senate must end the filibuster and pass common sense gun safety reforms.","date":"Mon May 16 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's been an incredibly busy week in Congress, so here's my quick wrap-up to keep you in the loop 👇🏾 https://t.co/coNChjnR2k","date":"Sun May 15 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate change is here and now, and we're running out of time to act.\n\nWe must urgently make meaningful investments to protect our planet for the next generation.","date":"Sun May 15 16:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I encourage everyone who is eligible for their second booster to get one if they haven’t already.","date":"Sun May 15 02:12:33 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, I tested positive for COVID-19. I’m experiencing flu-like symptoms at the moment, and in accordance with CDC guidelines, I will be isolating and working remotely for the people of Washington’s Seventh District. I’m grateful to be vaccinated and double-boosted.","date":"Sun May 15 02:12:21 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I’m horrified and heartbroken to hear this news from Buffalo today. Gun violence has devastated yet another one of our communities. When will enough be enough? Mass shootings are an epidemic in this country we must end now.","date":"Sat May 14 22:47:10 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion care is health care.","date":"Sat May 14 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Shell made $9.1bn in profit, almost three times what it made in the same period last year.\"\n\nCorporate greed is what's causing rising gas prices. We must hold Big Oil accountable.\nhttps://t.co/MiKPPqRQUa","date":"Sat May 14 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The average federal student loan debt balance is $37,014.\n\nCanceling student loan debt will provide a lifeline to millions of Americans, lifting this crushing weight. It's time to cancel federal student loan debt.","date":"Sat May 14 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The baby formula shortage is the convergence of multiple problems coming together.\n\nNext week the House will be voting on an emergency bill to ease red tape and hopefully get parents the formula they need for their babies. https://t.co/rHb7D38IqY","date":"Sat May 14 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is great news!\n\nYou cannot study or work without the internet in today's world. This is an important step to get people across our country connected.\nhttps://t.co/GpHsPNtgWN","date":"Fri May 13 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Fox News and the GOP have proven time and again that they are anything but \"pro-life.\" \n\nThis is a supply chain issue — there's no excuse to use it as an opportunity to sow hate and demonize immigrant babies. https://t.co/JmQgVOKAaY","date":"Fri May 13 21:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big Oil is using inflation and war as a smokescreen to raise prices.\n\nMake no mistake — while you're paying more at the pump they're bringing in record profits.\nhttps://t.co/xChiDBcDO7","date":"Fri May 13 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of an incredible trans kid, I am disgusted by this.\n\nCongress must step in and pass legislation to guarantee our kids have the right to be truly and unapologetically themselves.\nhttps://t.co/EP8xYhpiDi","date":"Fri May 13 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Overturning Roe shows this Court has no respect for precedent.\n\nMany of our other rights could be at stake — this is why we cannot give up this fight.\nhttps://t.co/ImA3kPbP4f","date":"Fri May 13 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Inflation is rising and taking a toll on wallets at the grocery store.\n\nWe can combat these price hikes by investing to lower the cost of expenses like child care, health care, housing, and so much more. Let's get this done and deliver for millions of families.","date":"Fri May 13 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The least we can do to say 🙏🏾🙏🏾for your incredible work as you advocate for domestic workers, for the child tax credit and against violence against women. Your story has inspired millions through your book and through the show, Maid. ✊🏾✊🏾","date":"Fri May 13 16:16:56 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If the Senate was willing and able to use a filibuster carve out to raise the debt-ceiling — they can and should do the same to protect a pregnant person's ability to make their own health care decisions.\nhttps://t.co/CNOlT5toWK","date":"Fri May 13 14:00:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As one of the one in four women in this country who have had an abortion — I will not give up this fight.\n\nI'm so proud to be the Chair of @USProgressives Caucus today as our members stand up and speak out for this right. https://t.co/Lfrk2HZjwn","date":"Thu May 12 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"All of us can and must stand up for our rights.\nhttps://t.co/sgvzJWkWV1","date":"Thu May 12 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The stakes have never been higher in Congress — with so many of our longstanding rights on the line.\n\nToday, I'm proud to be running the show while Democrats stand up for abortion rights. https://t.co/nY0ajFWVTB","date":"Thu May 12 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Medicare for all means: \n\n❌ No co-pays\n❌ No deductibles\n❌ No premiums\n❌ No hidden fees\n\nJust quality, universal health care as a human right. Let's get this done.","date":"Thu May 12 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Almost half the United States is ready to outlaw abortion...But many of those states are not willing to give new babies and their families the educational, medical, or financial support they need to lead a healthy life.\"\nhttps://t.co/0SEfvjnUdy","date":"Thu May 12 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yesterday, members of the House marched to the Senate to stand up for Roe.\n\nAs a lifelong organizer, I will not give up this fight. We will not let the Supreme Court or a Senate filibuster roll back the clock 50 years on abortion rights. https://t.co/FCisGoFuLp","date":"Thu May 12 18:30:21 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student debt is an issue of racial and social justice.\n\nLet's get this done.\nhttps://t.co/ooeEjiY6SH","date":"Thu May 12 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm so thrilled to see the Senate holding a historic hearing on Medicare for All in the Budget Committee!\n\nThis is a major step forward — and I applaud my friend and partner in this fight @SenSanders on this step to guarantee health care as a human right.\nhttps://t.co/0HVMOO52Lu","date":"Thu May 12 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Every single Senator who voted to filibuster the Women's Health Protection Act yesterday is going to have to answer to pregnant people across this country.\n\nThe choice to have an abortion belongs ONLY to the pregnant person. https://t.co/aazbeeEOCd","date":"Thu May 12 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel student debt and deliver relief to millions of borrowers across this country.\nhttps://t.co/BsjQtxtpkO","date":"Thu May 12 14:00:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"While people are rightfully scared by the news over the past week, I want to take a moment to remind everyone that Roe is still the law of the land.\n\nAbortion is still legal across the country — and we will fight tooth and nail to keep it that way.","date":"Thu May 12 01:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you @RepMarieNewman for sharing your abortion story. These are deeply personal decisions and your story reflects the experiences of so many pregnant people across the country. 🙏🏾✊🏾","date":"Thu May 12 00:11:19 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If the GOP were actually pro-life they would also be:\n\npro-paid leave\npro-universal health care\npro-universal pre-k\npro-gun control\n\nThis is about controlling our bodies and nothing else.","date":"Wed May 11 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Student loan cancellation is a racial justice issue.\nhttps://t.co/EBgjG0h8rB","date":"Wed May 11 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Senate is minutes away from filibustering abortion rights.\n\nWe will not give up this fight. We must codify Roe. https://t.co/6jUnvqhmxl","date":"Wed May 11 20:12:11 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Senate can do the right thing today.\n\nIn the House, we're here during this critical vote to hold them accountable.\nhttps://t.co/TVJ1GwpBni","date":"Wed May 11 19:50:53 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's wild that there is currently no ethical code of conduct for the Supreme Court. \n\nJustice Thomas's refusal to recuse himself from 2020 election cases while his wife worked with Jan 6th organizers in unacceptable. We must do better. https://t.co/Q7qldd4LYh","date":"Wed May 11 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Great to join @NoLieWithBTC to discuss how we can protect abortion rights. \n\nListen to our full conversation 👇🏾\nhttps://t.co/80qecvoFHX","date":"Wed May 11 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If Roe is struck down, millions of people will have to drive or fly hours to access legal abortion care.\n\nThis is unacceptable. The Senate must codify abortion rights today.\nhttps://t.co/og35EGBpxr","date":"Wed May 11 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So grateful to join @domesticworkers today to push for my #DomesticWorkerBillofRights — which would guarantee domestic workers the protections, dignity, and respect they deserve! https://t.co/MPoN7gVTnd","date":"Wed May 11 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Workers rights are human rights.\n\nThat's why I voted last night to give Congressional staff the ability to unionize — because Congress must lead by example. https://t.co/26tIPPDwb8","date":"Wed May 11 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today the Senate will vote on the Women's Health Protection Act.\n\nToday would be a great day to end the filibuster and protect abortion rights.","date":"Wed May 11 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm just going to leave this here.\nhttps://t.co/z21VKTREru","date":"Wed May 11 01:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Members of Congress should lead by example.\n\nAs a lifelong organizer, I'm proud to advocate for workers' rights to unionize across this country — and it's time Congressional staff had that opportunity too.","date":"Wed May 11 00:52:31 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"What a coincidence — Shell, Exxon Mobil, and Chevron profits are also at just about an all time high 🤔\nhttps://t.co/x4YnUcSfU2","date":"Tue May 10 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is terrifying.\n\nIt's clear: we cannot wait any longer to make major investments into climate action.\nhttps://t.co/2I3inyGdxa","date":"Tue May 10 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The growth rate of student loan debt outpaces the rise in tuition costs by 353.8%.\n\nThere's no question we need to rein in rising tuition costs — but in the meantime we must cancel student loan debt.","date":"Tue May 10 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We deserve impartial judges who aren’t beholden to special interests or their personal agenda. Nobody is above the law. Not even a Supreme Court Justice. \n\nMy bill with @SenWarren will ensure that our judicial system delivers equal justice under the law.\nhttps://t.co/UiDgnQFgdK","date":"Tue May 10 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Senate has the opportunity this week to codify abortion rights by ending the filibuster and passing the Women's Health Protection Act.\n\nIt's time for them to step up and get this done.","date":"Tue May 10 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student debt means lifting a crushing weight off of millions of Americans.\n\nIt's time to deliver this relief for borrowers across the country.","date":"Tue May 10 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Between 10-20% of pregnancies end in miscarriage.\n\nAbortion bans and restrictions don't take into account the health of the pregnant person — this is solely about controlling our bodies.\nhttps://t.co/9OxsHhKEqa","date":"Tue May 10 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can't stand by while judges and justices take advantage of our system to build wealth and power. A system without basic ethics is a corrupt system.\n\nMy bill with @SenWarren will reinstate checks and balances to ensure a fair judicial system.\nhttps://t.co/bRg84ib48i","date":"Tue May 10 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If Roe is overturned, pregnant people in dozens of states will lose the right to legal and safe abortion. Pregnant people and their doctors could literally be jailed for a medical procedure.\n\nThis is unacceptable — the Senate must do the right thing and codify Roe this week. https://t.co/wNTEOj0uat","date":"Tue May 10 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This will lift a crushing weight off of so many Americans.\n\nIt's time.\nhttps://t.co/emME6xZcC1","date":"Mon May 09 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The choice to have an abortion is incredibly nuanced, and can only be made by the person who is pregnant.\n\nThe Senate must pass the Women's Health Protection Act this week to codify this right.\nhttps://t.co/vbEv46SZPO","date":"Mon May 09 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It is critical that we protect the right to have a legal and safe abortion in this country.\n\nWe cannot let the Supreme Court turn the clock back 50 years.","date":"Mon May 09 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question, inflation and rising corporate greed are hurting working people.\n\nThis is why we must act to lower the cost of child care, health care, housing and so much more. It's time to deliver.\nhttps://t.co/aNAIZaWFPK","date":"Mon May 09 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The choice to have an abortion is a choice that only the pregnant person must live with — no one else will have to carry the fetus and raise that child.\n\nThis is a decision that every pregnant person deserves to make for themselves. https://t.co/8pvymeMwen","date":"Mon May 09 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of a beautiful trans kid, this is incredibly upsetting.\n\nTrans kids deserve to live fully and unapologetically as themselves. \nhttps://t.co/vG6m16Xwar","date":"Mon May 09 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel student loan debt and deliver relief for millions of borrowers.\n\nLet's get this done.","date":"Mon May 09 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My choice to have an abortion was one of the most difficult decisions I've ever made — but it was just that, MY choice.\n\nThat's what we must preserve for all pregnant people across this country. https://t.co/uv91zUVEkr","date":"Mon May 09 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 119 people across this country lost their lives to gun violence. Another 311 were injured.\n\nIt's time for the Senate to end the filibuster and pass common sense gun safety reforms.","date":"Mon May 09 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm proud to join my colleagues in sharing our personal abortion stories. \n\nOne in four women in this country have had an abortion. Likely someone you know, someone you love. We must protect this right.\nhttps://t.co/lOqQHDn4rQ","date":"Sun May 08 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Roe isn't just about abortion, it's about our basic bodily rights.\n\nBetween 10-15 out of 100 pregnancies end in miscarriage. This is a reality that pregnant people will have to deal with if Roe is overturned.\nhttps://t.co/HJN66UFJGd","date":"Sat May 07 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So wonderful to meet with brave workers at Seattle's Starbucks Roastery who voted last month to unionize.\n\nEvery worker deserves a union! https://t.co/T2DPyskuY4","date":"Sat May 07 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The average cost of giving birth in Mississippi is $12,413. The state also has the highest child poverty rate in the country.\n\nAbortion bans don't only strip  bodily autonomy — they do nothing to assist with the massive cost of giving birth and raising a child.","date":"Sat May 07 16:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"RT if you agree: it's time to cancel student debt and deliver for student borrowers across this country.","date":"Fri May 06 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion rights are human rights.","date":"Fri May 06 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Great to join @SecBecerra today for a roundtable on student mental health.\nhttps://t.co/Dy4eePy9Xh","date":"Fri May 06 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This extremist court has shown us that our rights aren't safe.\n\nIf they turn over Roe, who's to say they won't come after marriage equality, interracial marriage, contraception access, and so much more.\nhttps://t.co/KA0aTriIRU","date":"Fri May 06 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, I stand with child care providers and workers.\n\nWe must make real, meaningful investments into child care to both lower costs for families and improve working conditions for providers.\nhttps://t.co/Y32od9mPdy","date":"Fri May 06 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"8.3 MILLION jobs created since @POTUS took office.\n\nThere's no question that we have a lot of work to do to tackle inflation and lower costs for families — but this is a remarkable number.","date":"Fri May 06 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Proud to join local elected leaders at Planned Parenthood to stand up for abortion rights in our state and across our country.\n\nWe will not give up this fight. https://t.co/FpZNPhhYNH","date":"Fri May 06 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Of the states that WILL ban abortion if Roe is overturned:\n\n❌ None offer paid leave for new mothers\n❌ 8 have opted out of expanding Medicaid coverage, which covers pregnancy\n❌ 14 rank in the lower half of states for infant mortality rate\nhttps://t.co/1jYe3lUY3c","date":"Fri May 06 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, as we celebrate #ProviderAppreciationDay, it’s time to pass meaningful investments to create a more equitable and accessible child care system that respects our #ChildCare workforce. #ThankYouChildCare","date":"Fri May 06 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is WORKING. \n\nIt's clear that even as people are getting back to work, inflation is hurting working families. That's why we must keep up this momentum and invest to lower costs and raise wages!\nhttps://t.co/FhOH57WCCM","date":"Fri May 06 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm just going to leave this here...\n\nhttps://t.co/Ay4SJ5zOzR","date":"Fri May 06 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If the Supreme Court strikes down Roe, who's to say they won't come after other fundamental rights, like gay marriage or interracial marriage next? https://t.co/q6qfUmGqg4","date":"Thu May 05 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today on National Day of Awareness for Missing and Murdered Indigenous Women and Girls, we honor and remember the women stolen from their families, friends, and communities.\n\nThe federal government must step up to protect Indigenous women. #MMIWG","date":"Thu May 05 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Shell reported a record quarterly profit of $9 billion on Thursday, aided by a surge in oil and gas prices\"\n\nYes inflation is on the rise, but Big Oil is profiteering and raking in record profits while you pay more. Totally unacceptable.\nhttps://t.co/lrqbiT3IcB","date":"Thu May 05 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So exciting!!!\n\nCongrats to @SoundersFC for becoming the first MLS team to EVER win the CCL title! \nhttps://t.co/B93s3DXXn5","date":"Thu May 05 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Overturning Roe is government mandated pregnancy.\n\nAbortion is a health care decision that belongs only to the pregnant person. We must fight back.\nhttps://t.co/QL7FNCLjt3","date":"Thu May 05 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tuesday marked AAPI Women’s Equal Pay Day — the day that symbolizes how far into the year AAPI women must work in order to have earned what the average white man had earned the entire previous year. \n\nWe're more than four months into the year. It's time to close the wage gap.","date":"Thu May 05 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Short answer: yes.\n\nGay marriage, access to contraception, and a slew of other rights could be next. \nhttps://t.co/XPoMaEK6KO","date":"Thu May 05 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The decision to have an abortion was extremely difficult for me, but it was MY decision.\n\nI'm not telling anyone to have an abortion and no one should be able to tell me that I can't. https://t.co/JG8DKFY2XH","date":"Thu May 05 16:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel student debt and deliver relief to millions of borrowers.\nhttps://t.co/RIfJDNr4nK","date":"Thu May 05 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American people ARE NOT in favor of banning abortion. \n\nCongress must act to codify this right. The House has already passed the Women's Health Protection Act. It's time for the Senate to step up.\nhttps://t.co/Qh271q7nYt","date":"Thu May 05 14:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Someone you know has had an abortion. Someone you love has had an abortion.\n\nThank you @RepGwenMoore for standing up to protect this right by sharing your story!\nhttps://t.co/5k0BIS4WXo","date":"Wed May 04 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yes, they did.\nhttps://t.co/9ansXEGAkg","date":"Wed May 04 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Roe v. Wade has been the law of the land for 50 years. If this extremist court is willing to overturn it, who's to say gay marriage, interracial marriage, access to contraception, and so many other rights guaranteed by Supreme Court precedent won't be next?","date":"Wed May 04 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"If more pregnant people can't get the abortions they seek, they'd shoulder the risk of the U.S.'s relatively high — and rising — rate of death from pregnancy-related causes, which is particularly elevated among people of color.\"\nhttps://t.co/CRY5TIE4JE","date":"Wed May 04 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm so proud to be from a state that recognizes abortion as a right.\n\nBut no person should have to travel across states for necessary health care. We must protect abortion access at the federal level by passing legislation through the Senate.\nhttps://t.co/RgLTGGDRna","date":"Wed May 04 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If Roe is overturned, the largest burden will be on Black, Brown, and low-income people who won't be able to access the care that they need.\n\nAbortion is a social justice issue. Abortion is a racial justice issue. Abortion is a human right. https://t.co/9NF6RSO8ZY","date":"Wed May 04 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you to every person brave enough to share their abortion stories in the wake of this disastrous and disgusting news. \n\nAbortion rights are human rights. \nhttps://t.co/silCTbkYEd","date":"Wed May 04 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There is still time to act to protect abortion rights, but we must act fast. \n\nThe Senate must step up and codify Roe v. Wade now. https://t.co/D4en74uB10","date":"Wed May 04 15:16:22 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion rights are human rights.\n\nI’m proud to join my brave colleagues in Congress to stand up for this right by sharing our personal stories.\nhttps://t.co/eByoICsLrY","date":"Wed May 04 13:52:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The decision to have an abortion was extremely difficult, but it was MY decision.\n\nThat is a constitutional right we must preserve for all people in this country.","date":"Wed May 04 12:49:44 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Roe v. Wade has been the law of the land for 50 years.\n\nThis is a stunning reversal by this extremist Supreme Court — and we must fight it tooth and nail. https://t.co/9e5lZHDA6m","date":"Wed May 04 01:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"For me, terminating my pregnancy was an incredibly difficult choice, but it was MY choice.\n\nAnd that choice is a right that we must preserve for all pregnant people across this country. \nhttps://t.co/XeY5MRdl7E","date":"Wed May 04 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American people DO NOT support overturning Roe v. Wade.\n\nCongress must act to codify Roe. It's clear we cannot trust Donald Trump's conservative Supreme Court to uphold decades of precedent and the will of the people.\nhttps://t.co/GQODNIXhfw","date":"Tue May 03 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a stunning rebuke of precedent. \n\nCongress must act to protect Roe v. Wade. https://t.co/BYaS4gS7ZC","date":"Tue May 03 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion rights are human rights. \n\nAbortion is health care. \n\n#ProtectRoe","date":"Tue May 03 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The leading cause of death for children in this country is gun violence.\n\nIf the GOP cared about saving lives they'd pass gun safety reforms. Not criminalize and ban medical procedures.","date":"Tue May 03 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"13 states have automatic \"trigger laws\" that would ban abortion the second Roe is overturned. 9 more have unenforced abortion bans that are currently blocked by Roe. \n\nThese states also have some of the highest child poverty rates. https://t.co/rLMCT70RaO","date":"Tue May 03 18:31:12 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The U.S. has the highest maternal mortality rate among developed countries.\n\nIf the GOP cared about parents and children, they'd be working to improve our broken health care system. Abortion bans are solely about controlling our bodies.","date":"Tue May 03 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to deliver for millions of student borrowers.\n\nIt's time to cancel student debt. https://t.co/ERlHeBC342","date":"Tue May 03 15:15:45 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"While I'm sure many of us are still in shock from the news out of the Supreme Court last night, I want to reiterate:\n\nThis is still a draft opinion, not a ruling. Roe is still the law of the land and abortion is legal.","date":"Tue May 03 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I will continue to fight tooth and nail for every single person’s right to have a legal and safe abortion in this country. We will not accept this sitting down and we WILL take this to the streets and the voting booth.","date":"Tue May 03 02:40:21 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"People are right to be scared by this news, but please remember: this is still a draft opinion, not a ruling. Roe is still the law of the land and abortion is legal here in Washington State.","date":"Tue May 03 02:40:21 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The purpose of our Supreme Court is to uphold freedom and respect precedent. Not to take away a fundamental freedom for women to make choices about our own bodies and futures.","date":"Tue May 03 02:40:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"People should take to the streets across the country. Right now, the Senate can pass an exception to the filibuster and codify Roe v. Wade. This is the most dramatic setback for women’s rights in decades.","date":"Tue May 03 02:40:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Let’s not forget that Roe v. Wade was a 7-2 decision.  The SCOTUS majority who voted to overturn it has no respect for precedent. No respect for women. No respect for voting rights. No respect for our democratic institutions.","date":"Tue May 03 02:40:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As one of the 1 in 4 women in this country who have chosen to have an abortion, I am outraged &amp; disgusted by the reported draft SCOTUS opinion.\nhttps://t.co/fsmJLRI7iJ","date":"Tue May 03 02:40:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Title 42 public health law that has been manipulated to block immigrants seeking asylum.\n\nIt's time to end this cruel and xenophobic policy once and for all. https://t.co/YY0FEal6EU","date":"Mon May 02 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big Oil is posting record profits while you pay more at the pump.\n\nThey're using inflation and war as a smokescreen to raise prices and pad their wallets. We must hold them accountable.","date":"Mon May 02 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is terrifying.\n\nClimate action can't wait.\nhttps://t.co/Ykyul7Wkh1","date":"Mon May 02 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student debt will provide immediate relief to millions of borrowers across this country.\n\nIt's time!","date":"Mon May 02 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is WORKING. \n\nWe must keep up this momentum by investing to lower costs and raise wages for millions of people across this country. \nhttps://t.co/Tb6YPlyhm3","date":"Mon May 02 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am sick and tired of politicians, frankly on both sides of the aisle, using immigrants as political scapegoats.\n\nTitle 42 is a xenophobic policy that does nothing to keep our country safe. It's time to end it. https://t.co/PXANnQEQd4","date":"Mon May 02 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wishing all who celebrate a blessed Eid full of love, peace, and happiness. \n\nEid Mubarak!","date":"Mon May 02 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"While we continue negotiating legislation, there is a lot of good the White House can do through Executive Actions.\n\nLet's get this done and deliver higher wages and lower costs for people across this country! https://t.co/6Q4Qflxyem","date":"Mon May 02 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 126 people across this country lost their lives to gun violence, and another 270 were injured.\n\nIt's time for the Senate to step up and save lives by passing critical gun safety reform.","date":"Mon May 02 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"3 points: \n📍Title 42 is public health law; shouldn't be used to circumvent immigration law. \n📍Title 42 made things worse; took away existing process for asylum seekers.  \n📍We need legal pathways (which Trump destroyed) for humane immigration system. https://t.co/hS2xWqj8gW","date":"Mon May 02 13:11:19 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This May Day, I’m proud to stand with working people across this country. \n\nWe can and must move towards a future with higher wages and better protections for all workers.","date":"Mon May 02 00:29:48 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We're running out of time to act. \n\nIt's time to transition to renewable energy. This can't wait any longer.\nhttps://t.co/LsVVWAdgfH","date":"Sun May 01 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"RT if you think Fortune 100 companies should pay AT LEAST the same tax rate as working families. https://t.co/lQnEYER7GJ","date":"Sun May 01 16:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: Gas prices are going up because Big Oil is price-gouging.\n\nIf inflation, not corporate greed, were causing these sky-high prices, they wouldn't be posting record profits.\nhttps://t.co/7U6cHu3mwa","date":"Sun May 01 01:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student debt will be a huge relief for MILLIONS of borrowers.\n\nThis isn't just good policy, it's incredibly popular. Let's get this done. https://t.co/maBTPTSw8I","date":"Sat Apr 30 22:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to cancel student debt. \n\nThe President has said it won't be $50,000 of relief per borrower, so I'll now be calling for $49,999 per borrower! https://t.co/cXTj3KZGfn","date":"Sat Apr 30 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This week, I was honored to stand with students, organizers, and activists in calling on this administration to cancel student debt.\n\nLet's get this done and deliver for millions of borrowers across this country! https://t.co/IbpdTXvFXQ","date":"Sat Apr 30 16:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Title 42 is a cruel and xenophobic Trump-era policy.\n\nEnding it is the right decision.\nhttps://t.co/lZXB69cNAS","date":"Fri Apr 29 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is so awful.\n\nThe House passed a bill that would ban this kind of discrimination. It's time for the Senate to act.\nhttps://t.co/kFfL4FtxXv","date":"Fri Apr 29 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to deliver for millions of borrowers across this country by canceling student debt!\n\nWe can and must deliver this critical relief.","date":"Fri Apr 29 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Title 42 is a public health title meant to stop the spread of disease. \n\nRepublicans can't have it both ways: they can't hold pandemic relief hostage by saying the pandemic is over AND call for Title 42 to remain in place. https://t.co/kBN1Jetn8B","date":"Fri Apr 29 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"These bills aren't about protecting life.\n\nIf Oklahoma, the state with the 8th highest child poverty rate in the country, actually cared about children they'd be working to lift them out of poverty.\nhttps://t.co/hbOspmMerz","date":"Fri Apr 29 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Don't forget Exxon Mobil paid a 2.8% income tax rate in 2021, while Chevron only paid 1.8%.\n\nThere's no excuse for them to be posting record profits and paying a lower tax rate than average families while passing on the costs to you.\nhttps://t.co/UGiu1MtlkT https://t.co/CNvVxxbG3F","date":"Fri Apr 29 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My Roadmap to Freedom Resolution is a north star for immigration reform that is fair, equitable, centers family unity and humanitarian protections, combats systemic injustices and works for everyone.\n\nLet's get this done. https://t.co/mrdUYz06Mz","date":"Fri Apr 29 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Past time to tax the profiteering of oil companies who are taking in record profits by hiking prices at the pump for regular folks.\n\nThen take that money &amp; give it back to people so they’ve got money in their pocket to pay their bills.\n\nThis is a scam. Stop the profiteering.","date":"Fri Apr 29 16:49:08 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"THIS is why you're paying more at the pump.\n\nIt's so these companies can post record profits and deliver for their shareholders.\nhttps://t.co/JIHyAyxJJ7","date":"Fri Apr 29 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"YES! Cancel it!\nhttps://t.co/UO7kiMWPhK","date":"Fri Apr 29 15:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am a proud immigrant.\n\nWe cannot let Republicans use immigrants as political footballs — we must live up to the promise of America and protect refugees and asylum seekers at our border.\nhttps://t.co/4pUWGSMBpc","date":"Fri Apr 29 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yes, it is!  Now, @USProgressives are branded and with swag!!! I'm hearing lots of praise for our new CPC jackets....","date":"Fri Apr 29 10:11:32 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion rights are human rights — and we must protect them.","date":"Fri Apr 29 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Title 42 is a public health policy that has been manipulated and exploited to keep immigrants from seeking asylum. \n\nIt's a cruel, xenophobic policy — and it's time for it to go. https://t.co/TYfp28uVZB","date":"Thu Apr 28 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Let's get this done!\n\nCancel student debt.\nhttps://t.co/ucEUt51uvJ","date":"Thu Apr 28 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Private, for-profit immigration detention facilities pad their bottom lines at the expense of immigrants' civil and human rights.\n\nIt's time to hold these facilities accountable and end the use of private, for-profit prisons altogether. https://t.co/XtgsnNzrpi","date":"Thu Apr 28 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Medicare Advantage plans have widespread and systemic issues ranging from denying necessary care to defrauding the government.\n\nOur seniors deserve better.\nhttps://t.co/w1GHTgGckQ","date":"Thu Apr 28 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The next pandemic could result from climate change.\n\nWe can and must invest in climate action to save our planet and save lives.\nhttps://t.co/2yRIH3qv9X","date":"Thu Apr 28 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Trump administration used policies like Title 42 to eliminate all pathways to legal entry, decimating our already broken immigration system.\n\nAs an immigrant, I'm glad to see this White House working to end these cruel policies, but we still have a long way to go. https://t.co/czVKS8zT8Y","date":"Thu Apr 28 17:16:05 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It couldn't be more clear that these problems are systemic and widespread in Medicare Advantage — that's why this week I led a letter calling for dedicated funding to investigate inappropriate care denials and fraud by private insurers.","date":"Thu Apr 28 15:15:05 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is also a clear-cut argument for why we must immediately end Medicare privatization programs like ACO Reach. \n\nThere's no excuse for allowing the same Medicare Advantage organizations to now administer \"care\" for traditional Medicare beneficiaries.","date":"Thu Apr 28 15:15:05 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This report is staggering, in one year:\n\n➡ Medicare Advantage plans denied 85,000 prior authorization requests for medical care improperly.\n\n➡ Medicare Advantage plans refused to pay 1.5 MILLION claims despite those claims meeting coverage rules.\nhttps://t.co/Kv2aqDdR0N","date":"Thu Apr 28 15:15:04 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel student debt and provide relief for millions of borrowers.\nhttps://t.co/T3p42bBYNa","date":"Thu Apr 28 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"On #YomHaShoah, we remember the six million Jews murdered during the Holocaust.\n\nToday, we must recommit to standing up to antisemitism, racism, and hatred in any form as we say #NeverAgain.","date":"Thu Apr 28 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of an incredible trans kid, this was such an upsetting story to read.\n\nIt's time to pass the Equality Act and ensure that our kids can live unapologetically as themselves.\nhttps://t.co/Qd08A7t2s4","date":"Wed Apr 27 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Alternate headline: Ford raises prices for consumers and takes in record profits while paying a 1% federal tax rate.\n\nTax the corporations. \nhttps://t.co/CDfcsXnUOT","date":"Wed Apr 27 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question that our immigration system is broken. \n\nIt's time to deliver for immigrants — by promoting dignity and human rights. It's time to restore America as a beacon of hope.\nhttps://t.co/jJ4dmbfBnt","date":"Wed Apr 27 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is what climate change looks like. It's effects will cost billions of dollars in damages, not to mention countless lives.\n\nWe must act quickly to make major investments into climate action before it's too late.\nhttps://t.co/bDzU5wu8xt","date":"Wed Apr 27 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We must cut down on waste, fraud and abuse in military spending.\n\nThe Pentagon has a budget larger than any other agency, and yet still asks for billions on top of that each year in \"unfunded priorities.\" It's time to fund our communities, not wish lists for the military. https://t.co/w26VqpW9dB","date":"Wed Apr 27 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is absolutely terrifying.\n\nThese bans aren't about saving lives, they're about controlling our bodies. It's time to end the filibuster, pass the Women's Health Protection Act, and codify the right to have an abortion in federal law.\nhttps://t.co/ZVg8KmxoFX","date":"Wed Apr 27 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Title 42 is a public health title that is being exploited to block people seeking asylum in our country. \n\nI wholly support the Biden Administration's efforts to end the use of this cruel and xenophobic rule. https://t.co/pwyHBdwYJY","date":"Wed Apr 27 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This would be a sign of a broken system in a normal year — but for corporations 2021 wasn't a normal year. U.S. corporations had their most profitable year since 1950. \n\nIt's time to tax corporations. \nhttps://t.co/7YFQA1s33Z","date":"Wed Apr 27 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question that our health care system is broken. \n\nIn one of the wealthiest nations in the world, no one should have to cross the border to get affordable care. It's time for Medicare for All.\nhttps://t.co/KZLyNVQewz","date":"Wed Apr 27 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Neither members of Congress nor their spouses should be able to own or trade stock.\n\nIt's time for Congress to act — to show the American people we work for them, not our own stock portfolios.","date":"Tue Apr 26 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There is still so much work to be done in this country to tackle mass incarceration, but today @POTUS took an important step in the right direction!\n\nRead my full statement with @USProgressives 👇🏾👇🏾\nhttps://t.co/ScGivjbNj6","date":"Tue Apr 26 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If one man can buy Twitter for $44 billion, we can certainly tax the wealthiest to pay their fair share so we can invest $52 billion to protect every child. \nhttps://t.co/OhMfIpE9fj","date":"Tue Apr 26 21:15:29 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It was an honor to meet with Nobel laureate Kailash Satyarthi today.\n\nWe discussed how we don't suffer from scarcity in this world, but from greed. There are plenty of resources to ensure that no person is without food, no pregnant person without care, no child without education. https://t.co/5qEm2gyKV9","date":"Tue Apr 26 21:15:27 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is great news. Let's get it done!\nhttps://t.co/A2anHXGlRD","date":"Tue Apr 26 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today we celebrate #LesbianVisibilityDay!\n\nEvery single person deserves to live as who they are and love who they love 🏳️‍🌈🏳️‍🌈","date":"Tue Apr 26 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Corporate profits hit record highs last year.\n\nThere's no excuse for some of the largest corporations in this country to be paying less than 0% in federal income tax while their CEOs make tens of millions of dollars.\nhttps://t.co/DUiRRaF8Ie https://t.co/d3CPhRRYw7","date":"Tue Apr 26 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The west is facing the worst drought 1,200 years and hundreds of thousands of acres have already burned this year.\n\nCongress must act NOW to fight climate change. We're running out of time. \nhttps://t.co/bdqtCv4NSp","date":"Tue Apr 26 17:15:32 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today the Supreme Court will hear oral arguments on whether or not the Biden Administration can end Trump's cruel and xenophobic #RemainInMexico policy.\n\nI hope to see the Court step up and restore our country as a beacon of hope to those seeking refuge.","date":"Tue Apr 26 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Women are too often taken advantage of in the workplace — whether that's making less than male coworkers in an office or making unlivable wages as frontline workers. \n\nIt's time to close the pay gap. \nhttps://t.co/i8D9j3PZ5w","date":"Tue Apr 26 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Good morning ☀ Today would be a great day to end the filibuster and guarantee the right to have a legal and safe abortion in this country.","date":"Tue Apr 26 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is incredibly heartbreaking. \n\nOur kids shouldn't have to grow up concerned about gun violence. It's time to end the filibuster and pass gun safety reforms. We can and must save lives.\nhttps://t.co/iXBMQu4TYp","date":"Tue Apr 26 01:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Thirty-five glaciers and 16 perennial snowfields have melted since 1980.\"\n\nWe're running out of time to act on climate change. It's time to make real, meaningful investments to protect our planet for generations to come.\nhttps://t.co/eEf0DdTga6","date":"Mon Apr 25 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Exactly right. This would be a truly significant move to raise wages for 30 million people.","date":"Mon Apr 25 21:39:36 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question that inflation is a huge issue. But that's not the only thing that's making costs skyrocket.\n\nCorporations and CEOs are taking advantage of inflation to make you pay more while they pad their wallets. It's time to hold them accountable.\nhttps://t.co/4tKn1MGg2K","date":"Mon Apr 25 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just a reminder that from 2014-2018, Elon Musk paid an effective tax rate of 3.27%.\n\nThe average working family pays an average tax rate of 13%.\n\nIt's time for a wealth tax in this country.","date":"Mon Apr 25 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"150,000 acres — and wildfire season has just barely begun.\n\nDroughts will continue to get worse. Wildfires will continue to get worse. The only way we can fight back to protect lives and our planet is by making major investments into climate action NOW.\nhttps://t.co/l4mItnOO9q","date":"Mon Apr 25 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Our $782 billion Pentagon budget DOES NOT need to be increased by another $30 billion.\n\nWe should be investing that money into our communities — into child care, health care, housing, climate action, and so much more. It's time to cut the bloated Pentagon budget.","date":"Mon Apr 25 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tax the rich.\n\nIt's absurd that one person can afford to buy Twitter for more than $40 billion while working families across this country have to choose every day between buying groceries or their prescription drugs.","date":"Mon Apr 25 15:16:26 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 118 people across our country died as a result of gun violence. And another 285 were injured.\n\nIt's time for the Senate to step up and pass gun safety reforms. It's time to save lives.","date":"Mon Apr 25 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The rising cost of everything from gas to groceries is hurting working people across this country.\n\nThat's why we must invest to lower the cost of child care, health care, housing, and so much more.\nhttps://t.co/3lV7aMN9YG","date":"Mon Apr 25 01:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Black women have the highest average total of student debt.\n\nThere's no question, canceling student loan debt is a matter of racial and social justice.","date":"Sun Apr 24 22:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wildfire season is getting longer and more disastrous. \n\nWe can and must invest in climate action before it's too late.\nhttps://t.co/ZqwhFroJSz","date":"Sun Apr 24 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Every person involved in the deadly January 6th insurrection must be held fully accountable.\nhttps://t.co/viCu4opjXO","date":"Sun Apr 24 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to make major investments and get this done.\nhttps://t.co/nXH8OL9dvi","date":"Sat Apr 23 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Billionaires pay an average tax rate of 8%.\nWorking families pay an average tax rate of 13%.\n\nIt's time to tax the rich.","date":"Sat Apr 23 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Trans rights are human rights.","date":"Sat Apr 23 16:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time for health care with no deductibles, no co-pays, and no hidden fees. \n\nIt's time for Medicare for All.","date":"Fri Apr 22 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So excited to be rooting for Seattle's own #TeamBosco tonight!\nhttps://t.co/s21ycdEa7l","date":"Fri Apr 22 17:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, I am thrilled to welcome @POTUS to the great state of Washington.\n\nIt is critical that we deliver direct and immediate relief to working families across the country. I look forward to continuing to partner with him to raise wages and lower costs.","date":"Fri Apr 22 15:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I’m incredibly grateful for the opportunity to represent a district and state with so much natural beauty. This Earth Day, we must commit to protecting our planet for generations to come. https://t.co/WnuweWZ6ZL","date":"Fri Apr 22 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Every worker deserves a union!","date":"Fri Apr 22 00:44:43 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is great news. \n\nThank you @POTUS for taking major steps to protect our environment.\nhttps://t.co/uekdE72g2i","date":"Thu Apr 21 23:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"End the filibuster.\n\nPass the Equality Act.\n\nEnd the GOP assault on LGBTQ+ communities across this country.","date":"Thu Apr 21 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yes. Yes. Yes.\n\nBillionaires raked in profits throughout this pandemic. It's time to invest in our communities.\nhttps://t.co/jXb41e40Hh","date":"Thu Apr 21 20:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Happy 60th birthday to our lovely Space Needle! \n\nSo cool to see it going back to it's original galaxy gold!\nhttps://t.co/XvhDwMitM3","date":"Thu Apr 21 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is WORKING!\n\nLet's keep up this momentum by investing to lower costs and raise wages for working people across this country!\nhttps://t.co/bd6gfgrnOB","date":"Thu Apr 21 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The hotter, drier conditions of climate change are poisoning our air.\n\nWe must act on climate change NOW before it's too late.\nhttps://t.co/1oEWOIW2bd","date":"Thu Apr 21 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel student loan debt for millions of borrowers.\nhttps://t.co/zd5zGnrMs8","date":"Thu Apr 21 14:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Legislating remains critical — but in the meantime, there are dozens of executive actions the administration can take to raise wages and lower costs.\n\nAnd I'm thrilled to say the administration has already started taking these urgent steps! Let's get this done and deliver. https://t.co/KBQB9O0vyi","date":"Wed Apr 20 23:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a great step from the Administration!\n\nNext step: cancel all of it.\nhttps://t.co/MVVZOQhVM8","date":"Wed Apr 20 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Billionaires and corporations are taking in record profits while you pay more for everything from gas to groceries.\n\nIt's time to tax the rich.","date":"Wed Apr 20 20:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wildfires are getting worse and they're threatening lives, homes, and our air.\n\nIt's time to make meaningful investments into climate action before it's too late.\nhttps://t.co/EeSjqdcphA","date":"Wed Apr 20 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"BP's #DeepwaterHorizon catastrophe devastated marine habitats and cost taxpayers billions to clean up.\n\n12 years later, it's time we take major steps to transition to clean and renewable energy.","date":"Wed Apr 20 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Getting married, having children, buying homes — Americans are putting off their lives to pay student loan debt.\n\nIt's time to cancel student loan debt — period.\nhttps://t.co/NYgF7OEWt5","date":"Wed Apr 20 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day for the Senate to end the filibuster and pass the MORE Act — which would legalize marijuana and expunge records.","date":"Wed Apr 20 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a great step from @POTUS.\n\nClimate change and it's devastating effects must be taken seriously and be front of mind in policy decisions. \nhttps://t.co/dPVpkbjGSJ","date":"Tue Apr 19 23:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can fight inflation by lowering the cost of child care, health care, housing, and so much more. \n\nWe must use every tool in our toolbox to raise wages and lower costs. Let's get this done.","date":"Tue Apr 19 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Social Security is the most important anti-poverty program in America's history.\n\nIt's critical that we protect and expand this lifeline for our seniors. \nhttps://t.co/3SI3SfYi6Q","date":"Tue Apr 19 20:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As one of 18 members of Congress who are naturalized citizens, I know just how important naturalization is for immigrants and our country's economy.\n\nLet's invest in citizenship and naturalize #2MillionBy2022","date":"Tue Apr 19 16:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Violence in any form is wholly unacceptable. Palestinians deserve to worship in peace.\n \nActions like this perpetrated by the Israeli government are unacceptable and push us further away from peace. We must all stand together and condemn this attack. \nhttps://t.co/Kr4va82iP9","date":"Tue Apr 19 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel student loan debt.","date":"Tue Apr 19 14:00:58 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just a reminder on #TaxDay that Republicans balked at the cost of investing in universal pre-k, child care, health care, and housing — but their 2017 tax scam cost American taxpayers $1.9 trillion and benefited primarily the wealthy and corporations.","date":"Tue Apr 19 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Ten mass shootings in one weekend.\n\nAmerica has a gun violence problem. It's time to pass common sense gun safety reforms and save lives. \nhttps://t.co/fre7opudjK","date":"Mon Apr 18 23:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It makes no sense that billionaires often pay a lower tax rate than working families. \n\nIt's time to tax the rich and invest in our communities. https://t.co/bpMvQNG1HU","date":"Mon Apr 18 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is terrifying.\n\nMedical students should be trained to do abortions. A lack of trained professionals doesn't mean abortions will stop — it means they'll become deadly.\nhttps://t.co/agAg38x6Bt","date":"Mon Apr 18 20:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Working families are struggling to afford gas, groceries, health care and rent as inflation and corporate greed rise.\n\nMeanwhile, billionaires typically pay a lower tax rate than hardworking people like teachers, nurses, janitors or firefighters. It's time to #TaxBillionaires.","date":"Mon Apr 18 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 126 people across this country lost their lives to gun violence. Another 294 were injured.\n\nIt doesn't have to be this way week after week. It's time for the Senate to act on common sense gun safety legislation. It's time to save lives.","date":"Mon Apr 18 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Because no one should be rich enough to waste billions on space tourism while hard working, average people have to choose between rent and medication. #TaxBillionaires\nhttps://t.co/8Zi5kjOsMG","date":"Mon Apr 18 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Happy 💸 Tax Day 💸\n\nJust a friendly reminder that as you pay your taxes, you'll likely be paying more than DOZENS of major corporations. It's time to tax corporations and invest in our communities.","date":"Mon Apr 18 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Inflation is on the rise, but corporations are using it as a smokescreen to raise prices and rake in record profits.\n\nWe can't let them take advantage of consumers across this country.","date":"Sun Apr 17 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to cancel student debt for millions of borrowers across this country.","date":"Sun Apr 17 19:00:13 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wishing all who celebrate a joyous and bright Easter!","date":"Sun Apr 17 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion rights are human rights.\n\nIt's time to end the filibuster and pass the Women's Health Protection Act.\nhttps://t.co/XT4ermidLs","date":"Sat Apr 16 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wishing a happy and meaningful Passover to all who celebrate.\n\nChag Sameach!","date":"Sat Apr 16 16:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Medicare for All means no copays, no deductibles, no hidden fees, no medical debt. It’s time.","date":"Fri Apr 15 23:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This makes me so happy every time I see it!\nhttps://t.co/1CMDLg9agX","date":"Fri Apr 15 20:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion bans aren't pro-life. \n\nWhat is pro-life is investing in child care, health care, affordable housing, and so much more.","date":"Fri Apr 15 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Governor Abbott is using immigrants seeking asylum and refuge in the United States for political stunts.\n\nThis is a wildly unacceptable way to treat human beings. \nhttps://t.co/eqfl1pvR0W","date":"Fri Apr 15 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"At least 55 of the largest corporations in America paid no federal corporate income taxes on their 2020 profits.\"\n\nTax the rich. Tax corporations.\nhttps://t.co/bTyLKwHD1v","date":"Fri Apr 15 15:35:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Good morning ☀ Today would be a great day to cancel student debt.","date":"Fri Apr 15 14:00:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Mortgage and rent rates are skyrocketing. \n\nIt's time to invest to lower the cost of housing.\nhttps://t.co/t5RMPXPW4k","date":"Thu Apr 14 23:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time for Medicare for All. \nhttps://t.co/P3g5IuppKU","date":"Thu Apr 14 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is horrifying. \n\nState legislatures are trampling on the constitutional right to have an abortion. It's time to end the filibuster and protect every pregnant person's right to choose.\nhttps://t.co/w5yTzeHZgh","date":"Thu Apr 14 20:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel at least $50,000 of student debt per borrower.\nhttps://t.co/1bZakCL8so","date":"Thu Apr 14 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, I'm extending warm #Vaisakhi greetings to all who are celebrating this joyous day!","date":"Thu Apr 14 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Medicare Advantage programs regularly code patients as sicker than they are to bring in higher profits. \n\nThis is unacceptable. @RepKatiePorter and I are working to expose this profiteering and hold these providers accountable. https://t.co/5BGbH7EcSL","date":"Thu Apr 14 14:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is WORKING. \n\nLet's keep up this remarkable recovery by investing to lower the cost of child care, health care, housing, and so much more!\nhttps://t.co/TOWNNcpb8X","date":"Wed Apr 13 23:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The filibuster is blocking dozens of critical pieces of legislation from becoming law.\n\nIt’s time for the Senate to end the filibuster and protect the right to vote, protect LGBTQ+ rights, and so much more.","date":"Wed Apr 13 21:02:10 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We're running out of time to act on climate change.\n\nWe can and must make meaningful investments into climate action to protect our planet for future generations. It's time to get this done. https://t.co/agp3bwiHv9","date":"Wed Apr 13 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Let me get this straight:\nWorking families have to budget an extra $5,200 this year... but corporate profits surged by 35% last year.\n\nWe can't let corporations continue to hide behind inflation to raise prices to pad their wallets at your expense.\nhttps://t.co/Sgz1ecD4xQ","date":"Wed Apr 13 17:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Good morning ☀ Today would be a great day to tax the rich and invest in our communities.","date":"Wed Apr 13 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The GOP is counting on Donald Trump's Supreme Court to overturn Roe.\n\nThis is exactly why the Senate must end the filibuster and pass the Women's Health Protection Act.\nhttps://t.co/Fd92sETfb6","date":"Wed Apr 13 14:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Storms are getting worse.\n\nWe cannot ignore the dangerous and deadly effects of climate change. It's time to make meaningful investments into climate action and save our planet.\nhttps://t.co/HL3duNkwFs","date":"Tue Apr 12 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is unacceptable.\n\nThe right to an abortion is guaranteed by Roe. And the choice to have an abortion only concerns the pregnant person. THIS is why the Senate must end the filibuster and pass the Women's Health Protection Act.\nhttps://t.co/4vrTYIJh68","date":"Tue Apr 12 20:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Student loan payments are $393/month on average.\n\nCanceling student debt will end these crushing payments and create opportunity for millions of Americans.","date":"Tue Apr 12 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Inflation is rising, yes. \n\nBut corporations are using it as a smokescreen to hike prices even higher and pad their wallets. \nhttps://t.co/pvOln296DA","date":"Tue Apr 12 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If it wasn't obvious already, the pandemic has made it clear that our country relies on immigrant workers.\n\nIt's time to pass real immigration reform. \nhttps://t.co/xgKKGDC1hf","date":"Tue Apr 12 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Members of Congress should serve our constituents, not our own financial interests. \n\nIt's time to ban Members of Congress and their spouses from owning or trading stocks. That's just what my Bipartisan Ban on Congressional Stock Ownership Act will do.","date":"Tue Apr 12 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"End the filibuster.\n\nPass the Equality Act.\n\nProtect our LGBTQ+ family and friends. It's that simple.","date":"Mon Apr 11 23:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's clear: it's time to transition to renewable energy.\nhttps://t.co/URp8YLSvLT","date":"Mon Apr 11 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student loan debt would provide a lifeline for millions and boost our economy. \n\nIt's time to get this done.","date":"Mon Apr 11 20:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question, inflation is hurting families across the country.\n\nThat's why we must act to lower the cost of child care, health care, housing, and so much more. It's time to deliver.\nhttps://t.co/lX0bL8w2nX","date":"Mon Apr 11 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate action cannot wait.\n\nOur planet is on track to becoming unlivable. It's time for action. \nhttps://t.co/U93Pbx2PQx","date":"Mon Apr 11 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 116 people across this country lost their lives to gun violence, and another 263 were injured.\n\nIt's time for the Senate to FINALLY end the filibuster and pass common sense gun reforms that we've already passed in the House. It's time to save lives.","date":"Mon Apr 11 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wishing a joyous and meaningful Palm Sunday to all who celebrate.","date":"Sun Apr 10 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's been a busy week in Congress! Watch my quick weekly recap to see what I've been working on to deliver for you 👇🏾 https://t.co/Wsf6CFHZDq","date":"Sun Apr 10 04:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion restrictions aren't about protecting children or mothers. They're about controlling our bodies.\nhttps://t.co/c8BUVaZvRS","date":"Sun Apr 10 01:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"🖌 Calling all high school artists 🖌\n\nWe're currently accepting submissions for the Congressional Art Competition! I am always so incredibly impressed by the art we receive — get information and enter today 👇🏾\nhttps://t.co/aHBqtJf07i","date":"Sat Apr 09 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This week, I was thrilled to join colleagues from the House and Senate to stand together and clearly say that Members of Congress should NOT be allowed to own or trade stocks.\n\nIt's time to raise the ethical standards of Congress. https://t.co/UcNOo2r2ym","date":"Sat Apr 09 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of an incredible trans kid, I am disgusted by these draconian efforts from state legislatures.\n\nThe Senate must end the filibuster and pass the Equality Act to protect our kids.\nhttps://t.co/l6G6aBtqn0","date":"Fri Apr 08 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The pandemic has highlighted just how broken our health care system is.\n\nIt's time to move towards a truly universal health care system that saves Americans thousands of dollars a year. It's time for Medicare for All.","date":"Fri Apr 08 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"What a wonderful, historic sight!","date":"Fri Apr 08 19:04:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Members of Congress are elected to work for the people, not for our own stock portfolios. \n\nIt's time to ban ownership for Members of Congress and their spouses.\nhttps://t.co/4o9foJxVJ6","date":"Fri Apr 08 17:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The last time jobless claims were this low: \n\n🚀 Apollo 8 was orbiting the moon\n🎤 The Beatles were topping the charts with \"Hey Jude\"\n🍔 The first Big Mac was served for 49 cents\n\nThank you @POTUS for this incredible economic recovery — let's keep up this momentum!","date":"Fri Apr 08 16:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling student debt will be a lifeline for millions of Americans and boost our economy. \n\nLet's get this done and deliver for millions of borrowers. https://t.co/pzWv6bkRqf","date":"Fri Apr 08 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We're standing together to emphatically say that Members of Congress shouldn't be allowed to own or trade stocks — full stop. \n\nLet's get this done.","date":"Fri Apr 08 13:09:04 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Year after year, storms are getting worse.\n\nIt's time to make meaningful investments into climate action before it's too late.\nhttps://t.co/ec4HFXpNAg","date":"Thu Apr 07 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Exactly right. Your votes matter in real ways that literally give you the most wonderful chills up your spine! \n\nIf you voted for @potus, you helped to get Justice Ketanji Brown Jackson exactly where she belongs: on the US Supreme Court! Never doubt the power of your vote!","date":"Thu Apr 07 21:40:45 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"While we continue to negotiate legislation, there are dozens of Executive Actions the Administration can take to lower costs and raise wages.\n\nI'm thrilled to say @POTUS has already acted on multiple actions that @USProgressives are advocating for. Let's keep up this momentum! https://t.co/zVWMcgeUG6","date":"Thu Apr 07 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"What an incredible day for our country.\n\nI couldn't be more thrilled to finally say JUSTICE Ketanji Brown Jackson.\nhttps://t.co/IoPV271nbx","date":"Thu Apr 07 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's simple: Members of Congress work for the people, not our own stock portfolios.\n\nNeither members nor their spouses should be able to own or trade stocks.\nhttps://t.co/rOng5RMeLJ","date":"Thu Apr 07 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"✅CONFIRMED:\n\n✨JUSTICE✨Ketanji Brown Jackson https://t.co/DdDcnbUJnq","date":"Thu Apr 07 18:17:49 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Extending the moratorium was a great step.\n\nNow it’s time to cancel student debt and remove this crushing burden for millions of Americans.","date":"Thu Apr 07 17:35:04 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Monopolies mean higher prices for consumers and lower wages for workers. \n\nIt's time to rein in the monopoly power of corporations in this country and promote fairness and competition. That's exactly what I'm working to do on @FairGrowthCmte. https://t.co/oCsGrIN5aJ","date":"Thu Apr 07 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Jobless claims haven't been this low since 1968.\n\nThe American Rescue Plan is WORKING. Let's keep up this momentum to deliver lower costs and higher wages for people across this country.\nhttps://t.co/JUEG7fRR2J","date":"Thu Apr 07 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Biden Administration is providing important relief by extending the moratorium on student loan payments. \n\nNext step: cancel student loan debt.\nhttps://t.co/69Ov8eny0J","date":"Thu Apr 07 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":".@POTUS gets it. We have to do all we can to stop union-busting tactics and ensure workers have workplace democracy.  Here we come. https://t.co/53JVWYiIoN via @seattletimes","date":"Thu Apr 07 12:35:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Profiteering costs American taxpayers BILLIONS of dollars a year. \n\nToday in the @EdLaborCmte, I had the opportunity to discuss how we can cut down on fraud and abuse with @SecBecerra. I'm looking forward to working with the administration to get this done. https://t.co/zBIL2Btxz2","date":"Thu Apr 07 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no clearer way to say it: we are running out of time.\n\nCongress can and must make meaningful investments into climate action — before it's too late.\nhttps://t.co/p8NSBuUUvj","date":"Wed Apr 06 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"LGBTQ+ rights are under attack. \n\nRT if you think it's time for the Senate to pass the Equality Act.","date":"Wed Apr 06 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Exciting news today!\n\n@SecBecerra expressed support for removing barriers to health care for immigrants across this country. That's exactly what my LIFT the BAR Act would do! Let's get this done and deliver health coverage to so many who are currently locked out of the system. https://t.co/lRFUws6Ztk","date":"Wed Apr 06 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"When only a few corporations dominate the market, they're able to drive out small businesses and mom-and-pops, allowing them to raise prices and in some cases leaving consumers in food deserts.\n\nWe must promote competition and fairness in our economy.\nhttps://t.co/AYxfirPcPt","date":"Wed Apr 06 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It was so wonderful to join @POTUS yesterday as he signed an Executive Action expanding ACA coverage.\n\nThis is an important step that @USProgressives have been advocating for. I look forward to continuing to work with this administration to ensure coverage for all Americans!","date":"Wed Apr 06 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Title 42 was a cruel and xenophobic policy that disproportionately impacted Black and Brown migrants.\n\nI am so grateful to see the Biden Administration following the science and finally ending this Trump-era rule. This is an incredible victory for immigrants and refugees. https://t.co/bo1Wg4OfQR","date":"Wed Apr 06 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big Oil is charging you more at the pump, then turning around and paying out shareholders.\n\nThis is totally unacceptable and it's time to hold them accountable.\nhttps://t.co/V0CsO0JWaY","date":"Wed Apr 06 16:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you, @POTUS!\n\nThis decision will provide continued relief for millions of student borrowers. Next step: cancel it.\nhttps://t.co/7amg1GnXUq","date":"Wed Apr 06 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We cannot let this happen in state after state. \n\nIt's time to end the filibuster and show LGBTQ+ people that we stand with them by passing the Equality Act 🏳️‍🌈🏳️‍⚧️\nhttps://t.co/UAktnBwXiH","date":"Wed Apr 06 14:05:23 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you to President Biden for standing up and guaranteeing more Americans can access the health coverage they need!","date":"Wed Apr 06 13:19:07 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is horrifying. \n\nLaws like this will not stop abortions. They will stop safe and legal abortions carried out by health care professionals. \nhttps://t.co/rLRUWLk3Fe","date":"Wed Apr 06 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yes. It's never been about punishing billionaires — it's about making them pay their fair share.\n\nIt's time to tax the rich.\nhttps://t.co/gtUw9LZ3Ax","date":"Tue Apr 05 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It was such an honor to be at the White House today as @POTUS expanded Affordable Care Act coverage to more than a million people who weren't previously eligible.\n\nAs we continue the fight for Medicare for All, this is an important step to ensure many more get the care they need. https://t.co/hO1rK70vHc","date":"Tue Apr 05 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Your income and zip code shouldn't determine the medical care you receive. \n\nThis is totally unacceptable for the richest nation in the world.\nhttps://t.co/Zg9B0yxWhe","date":"Tue Apr 05 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big Oil is paying off shareholders while you pay more at the pump.\n\nIt's time to hold them accountable AND transition to renewable energy. \nhttps://t.co/l5ZcgSxREE","date":"Tue Apr 05 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Exciting news: @POTUS is acting on @USProgressives' Executive Action Agenda! \n\nToday's action will expand health care coverage to millions of people across this country. Let's keep up this work to lower costs and raise wages.","date":"Tue Apr 05 20:14:16 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"YES! This is an important step to ensure that working families' expenses aren't going up as we work to fight inflation and corporate greed.\n\nNow, let's cancel at least $50,000 per borrower.","date":"Tue Apr 05 18:03:10 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Poverty exists because we allow it to exist — and during this pandemic it cost thousands of lives.\n\nThere's no excuse in the richest country in the world. It's time to make real investments into our communities and to finally eradicate poverty. \nhttps://t.co/WQN70YSO82","date":"Tue Apr 05 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Transitioning to renewable energy isn't just good for our planet, it means that domestic oil prices can’t be held hostage by dictators like Vladimir Putin.","date":"Tue Apr 05 16:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is working!\n\nLet's keep this momentum up and deliver lower costs and higher wages for working families across this country. \nhttps://t.co/q7CfsUalXq","date":"Tue Apr 05 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As inflation and gas prices are on the rise, now is NOT the time to make people resume paying hundreds of dollars a month in student loan payments. \n\nThe administration must extend the moratorium and take steps towards canceling student loan debt.","date":"Tue Apr 05 14:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you @GretchenCarlson and @julieroginsky for your incredible bravery and activism that made this legislation possible!\n\nSo proud to stand with you to ensure survivors of sexual assault and harassment can seek justice.\nhttps://t.co/y2AFLSwNpd","date":"Tue Apr 05 13:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"1 in 4 Black women has student loan debt. \n\nCanceling at least $50,000 of student debt per borrower is a matter of social and economic justice. Let's get this done.\nhttps://t.co/NCx3z6TSyt","date":"Tue Apr 05 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is terrifying.\n\nIt's time to make major investments into climate action — before it's too late.\nhttps://t.co/y657Vn7Wd6","date":"Mon Apr 04 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I have said this for months &amp; will say it again. Without global vaccination funding, we are simply not tackling the problem of COVID. A deal without global aid funding &amp; a real plan to invest the money we need will run into problems in the House.","date":"Mon Apr 04 20:50:33 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We've got to use every tool in our toolbox to help people deal with rising costs — from the grocery store to the gas pump.\n\nBy lowering the cost of childcare, housing, health care, and so much more, we can help ease the burden on working families. Let's get this done. https://t.co/hh65TWo6VI","date":"Mon Apr 04 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question that Big Tech is using monopolistic and anti-competitive practices to ensure their dominance. \n\nToday on #AntitrustDay, Congress must stand up and pass legislation, like my Ending Platform Monopolies Act, to level the playing field and restore fairness.","date":"Mon Apr 04 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's been over a decade since the federal minimum wage was raised.\n\n$7.25/hour is NOT a living wage. It's time to raise the wage for millions of workers across this country.\nhttps://t.co/A580t3c0jw","date":"Mon Apr 04 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"54 years ago today, the world lost a fierce advocate for justice, equality, and peace. \n\nToday we remember the contributions of Martin Luther King, Jr., and fully recommit ourselves to using our hands to bend the moral arc of the universe more quickly towards justice.","date":"Mon Apr 04 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question that our economy is rigged to favor the richest of the rich and corporate interests. \n\nToday, I'll be joining @PatrioticMills for an important conversation on taxing the rich. Be sure to tune in! https://t.co/QofFJ7B205","date":"Mon Apr 04 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My Climate Resilience Workforce Act responds to the climate crisis by investing in a skilled workforce that is capable of responding to AND preparing for the destructive impacts of climate change.\n\nThis is how we build back better, greener, and stronger!\nhttps://t.co/AxuQXrc03I","date":"Mon Apr 04 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 90 people across this country lost their lives to gun violence, and another 249 were injured.\n\nIt's time for the Senate to end the filibuster, pass the gun safety reforms we've ALREADY passed in the House, and save lives.","date":"Mon Apr 04 14:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Between passing legislation to decriminalize marijuana and holding the Supreme Court accountable — it's been a busy week — and that's just scratching the surface.\n\nWatch my two-minute recap of what I've been working on to deliver for you 👇🏾 https://t.co/LgOA5AOnJa","date":"Mon Apr 04 01:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate change is here and now. \n\nWe're running out of time to make meaningful investments to save our planet. It's time to take real action before it's too late\nhttps://t.co/an4evnigjf","date":"Sun Apr 03 21:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time for the Senate to end the filibuster and pass the Women’s Health Protection Act.\n\nAbortion care is health care.","date":"Sun Apr 03 16:30:35 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time to cancel at least $50,000 of student debt per borrower.","date":"Sun Apr 03 00:42:40 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: This week the House voted to cap the cost of insulin at $35.\n\nI urge the Senate to quickly pass this legislation and deliver lower costs for millions of Americans. \nhttps://t.co/kXIXkHgJWZ","date":"Sat Apr 02 16:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today as we mark the beginning of Ramadan, let us remember what the holy month means for millions of Muslims around the world. It is the most sacred and joyous time of the year — a time of fasting, prayer, reflection, compassion, and gratitude.  \n\nRamadan Mubarak! https://t.co/F6sVmFHuJx","date":"Sat Apr 02 00:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The pandemic isn't over until it's over everywhere. \n\nWithout this funding people across the world will die and new variants will continue to emerge. Let's end this once and for all.\nhttps://t.co/bV3RvK4OOp","date":"Fri Apr 01 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The House passage of this bill is a victory for racial, economic, and criminal justice.\n\nI urge the Senate to quickly take up this critical legislation.\nhttps://t.co/BMv2HatTpM","date":"Fri Apr 01 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I stand with every single trans child and the parents who support them.\n\nIt's time to end the filibuster, pass the Equality Act, and protect trans kids' rights at the federal level.\nhttps://t.co/uUbHNUZAFp","date":"Fri Apr 01 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such great news! Every worker deserves a union. \n \nCongratulations to all the workers who organized and earned this victory.\nhttps://t.co/tmGAu3ESkJ","date":"Fri Apr 01 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It is hard to overstate the widespread and negative impact Title 42 has had. Since the start of the pandemic, more than 1.7 million people have been expelled under Title 42 - desperate people fleeing famine, violence, and war. Our nation has failed these people. But no more.","date":"Fri Apr 01 17:48:44 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As a lifelong activist for immigrants' rights, I could not be more pleased to see the White House do away with Title 42. We can now begin the work of rebuilding our asylum and refugee systems and fulfill our obligation to welcome people into our country with open arms and hearts.","date":"Fri Apr 01 17:48:44 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today is the product of years of advocacy from both inside and outside Congress. I’m thrilled to see the Biden Admin do the right and moral thing by ending this extremely harmful, xenophobic, and shortsighted policy that disproportionately impacted Black and Brown migrants.","date":"Fri Apr 01 17:48:43 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"🧵My reaction to the Administration's Title 42 announcement:\n\nThis is a momentous day for immigrant rights activists, immigrants, and refugees everywhere. Title 42 was a cruel and discriminatory policy that circumvented U.S. law, preventing people from accessing protections.","date":"Fri Apr 01 17:48:43 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Black people are arrested for marijuana possession at nearly 4x the rate of white people. \n\nDecriminalizing marijuana at the federal level and expunging the records of those with convictions is a matter of social justice. That's why today I was proud to vote to pass the MORE Act. https://t.co/lsB1ckyEpA","date":"Fri Apr 01 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Since @POTUS took office, we've created 7.9 million new jobs and gotten unemployment down to an incredible low of 3.6%. \n\nThe American Rescue Plan is WORKING. It's time for us to keep up this momentum and invest in raising wages and lowering costs for working families!","date":"Fri Apr 01 16:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"One month from today, crushing student loan payments are set to resume.\n\nWe cannot make people pay an extra $393/month while inflation is on the rise and gas prices are soaring. It's time to cancel at least $50,000 of student debt per borrower.","date":"Fri Apr 01 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such a great step from @POTUS to lower costs for working families across this country!\n\nI'm also glad to see him holding Big Oil companies accountable. \nhttps://t.co/ny8cGd5Jdn","date":"Fri Apr 01 14:00:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"RT if you agree: The Pentagon doesn't need another $31 billion added to it's already bloated budget.","date":"Fri Apr 01 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Corporations have had their best year since 1950.\n\nBut they're still using inflation as a smokescreen to continue to raise prices and pad their wallets. It's time for accountability.\nhttps://t.co/o4sE7Wo1C6","date":"Thu Mar 31 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As state legislatures across the country continue to introduce and enact transphobic legislation, protecting our trans kids cannot wait any longer.\nhttps://t.co/R3y87IMK8D","date":"Thu Mar 31 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We cannot ask working people — who are already struggling from inflation and the pandemic — to restart crushing student loan payments.\n\nThe administration should extend the moratorium and use that time to build a plan on canceling student debt. \nhttps://t.co/UBiFLStXkq","date":"Thu Mar 31 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of a transgender child, I thank you @POTUS for these actions and for your recognition of the bravery of our transgender community. \n\nFor my daughter &amp; thousands more, this WILL make a big difference.  https://t.co/x437emGhGz","date":"Thu Mar 31 19:31:32 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, I'll be voting to cap the out-of-pocket cost of insulin at $35/month.\n\nNo one should be paying thousands of dollars a month for lifesaving medications.","date":"Thu Mar 31 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We cannot allow these crushing payments to restart. \n\n@POTUS can and must extend the freeze on student loan repayment and work towards canceling student debt for millions of borrowers across this country. \nhttps://t.co/zT3AFcfqZc","date":"Thu Mar 31 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"🏳️‍⚧️ Trans rights are human rights 🏳️‍⚧️","date":"Thu Mar 31 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: @SenWarren and I are calling on Justice Thomas to recuse himself from any cases related to the insurrection or 2020 election. \n\nThis is a major ethical breach — and is totally unacceptable for our country's highest court.\nhttps://t.co/jlRFRwZD4t","date":"Thu Mar 31 16:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This pandemic isn't over until it's over everywhere. Failing to secure this funding means people around the world will die — and as more people get infected, more variants will emerge and surges will be more likely in the U.S. (2/2)","date":"Thu Mar 31 16:24:30 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, amid reports that the Senate is planning on cutting global Coronavirus funding aimed at boosting vaccinations abroad, I'm joining my fellow co-chairs of the Global Vaccine Caucus to urge the Senate not to play politics with this important funding. (1/2)","date":"Thu Mar 31 16:24:29 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to cancel at least $50,000 of student debt per borrower. \n\nWorking families across this country cannot afford for these crushing payments to restart in May.\nhttps://t.co/LjInGOvMY6","date":"Thu Mar 31 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am so lucky to be the proud mom of an incredible trans child.\n\nTo trans kids everywhere, I want you to know that we see you, we will stand with you, and we will fight for you. Never give up on your beautiful self and know that you are not alone.\nhttps://t.co/lBf6nVg3RY","date":"Thu Mar 31 14:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Having worked in int’l public health for years before coming to Congress, I have been pushing  for more global vaccination funding with my colleagues. It’s the right thing to do, but it’s also critical to controlling COVID here at home. I’m in the same place as @CongressmanRaja.","date":"Thu Mar 31 13:51:31 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Lying about the election being stolen, supporting insurrectionists, speaking at white nationalist conferences, calling other members terrorists—those are fine w/GOP Leader McCarthy. But apparently lying about orgies &amp; cocaine are a step too far. \n\nHuh. 🙄 https://t.co/DWTa1ylOpC","date":"Thu Mar 31 12:43:16 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's the filibuster or the Equality Act.\n\nIt's the filibuster or the Women's Health Protection Act. \n\nIt's the filibuster or the John Lewis Voting Rights Act.\n\nThe answer is simple: end the filibuster.","date":"Wed Mar 30 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As prices go up for you at the pump, Big Oil is raking in record profits. \n\nIt's time to hold them accountable and lower costs for millions of working families. https://t.co/Vs6hzej8BD","date":"Wed Mar 30 22:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Justice Thomas's wife worked hand in hand with Trump's Chief of Staff to try and overturn the election.\n\nJustice Thomas must recuse himself from any and all cases related to January 6th or the 2020 election. \nhttps://t.co/M0yCQMWuX4","date":"Wed Mar 30 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today I'm standing with @SEIU and @GoodAirports, calling out the major pay discrepancies between airport workers and CEOs. \n\nAirport workers can be paid as little as $8/hour, while CEOs are paid on average $5,000/hour. It's time to raise the wage for workers across this country.","date":"Wed Mar 30 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yesterday, the @OversightDems Committee held a hearing on universal health coverage and my Medicare for All bill!\n\nMedicare for All would save 68,000 lives per year. It's time to get this done. https://t.co/NpgXKDsB8T","date":"Wed Mar 30 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It is criminal that Americans are paying thousands of dollars a year for life-saving medicines like insulin.\n\nIt's time to lower prescription drug costs and ensure no one has to choose between their rent and their medication.","date":"Wed Mar 30 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Justice Thomas must recuse himself from any and all cases related to the insurrection and 2020 election.\n\nIt is unethical to rule on any case that his wife has a direct stake in. It's time to raise the ethical standards of our Supreme Court.\nhttps://t.co/7gzZ0e0OEu","date":"Wed Mar 30 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Under cruel, Trump-era policies, the immigration case backlog has grown to more than 1.5 million – and compromised due process in our immigration system. \n\nToday I'm leading dozens of members in calling on the DOJ to restore due process and transparency.\nhttps://t.co/IS45iEMYaQ","date":"Wed Mar 30 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm proud to be leading this effort with @SenWarren to ensure Justice Thomas and Ginni Thomas are held fully accountable.\nhttps://t.co/Lcr8nSMtYX","date":"Tue Mar 29 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"In 1955, the lynching of 14-year-old Emmett Till ignited the civil rights movement. \n\nI was proud to support @RepBobbyRush's Emmett Till Antilynching Act and am incredibly glad to see @POTUS sign it into law today. Finally we're calling lynching what it is: a hate crime.","date":"Tue Mar 29 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Budgets are moral documents that reflect our values.\n\nIt is indefensible that the proposed 2023 budget directs an unprecedented amount of funding to the already bloated Pentagon budget. https://t.co/QJj190MlCh","date":"Tue Mar 29 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"From 11:17 a.m. to 6:54 p.m. on January 6th — while our Capitol was under attack by his supporters — there is no record of the calls made by Trump.\n\nThis is absolutely unacceptable and we need to get to the bottom of what happened during those seven hours.\nhttps://t.co/GaMJMABrqw","date":"Tue Mar 29 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's simple: Title 42 is cruel, xenophobic, and puts asylum seekers' lives at risk.\n\nIt's time to end the use of this Trump-era policy and restore our country as a beacon of hope.","date":"Tue Mar 29 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Justice Thomas must be held fully accountable for failing to recuse himself from a case in which his wife had a personal stake. https://t.co/hOxmMHQvIy","date":"Tue Mar 29 18:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Medicare for All is necessary, popular, and most importantly, will save lives.\n\nIt's time to get this done.","date":"Tue Mar 29 17:37:25 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I don't know how many record breaking climate events need to happen before we make meaningful investments into climate action.\n\nWe're running out of time to save our planet.\nhttps://t.co/nAA1pN3IBD","date":"Tue Mar 29 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's clear that Ginni Thomas was deeply involved in efforts to overturn the election while Justice Thomas was ruling on cases related to Jan 6th and the election.\n\n@SenWarren and I are calling for answers and accountability on this apparent ethics breach.\nhttps://t.co/CuWTxLAWpV","date":"Tue Mar 29 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, @OversightDems are holding a hearing on universal health coverage — a huge step for my Medicare for All bill!\n\nThe pandemic has made it clear that we must guarantee health care as a human right. Let's get this done.","date":"Tue Mar 29 14:00:31 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"During the pandemic, the ten richest men in the world doubled their already massive fortunes — reaching a total worth of $1.5 trillion.\n\nRT if you agree — it's time to tax the rich.","date":"Tue Mar 29 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Good. The American people deserve answers and accountability for her role in the insurrection and Big Lie.\nhttps://t.co/VYI2X2EwdO","date":"Mon Mar 28 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, I’m proud to be included among the growing list of Green New Deal Champions who are fighting everyday to win a #GreenNewDeal. \n\nI let's pass this transformative legislation needed to stop the climate crisis and create a better future for all.","date":"Mon Mar 28 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm just going to leave this here.\nhttps://t.co/NELcv1E6jM","date":"Mon Mar 28 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I guarantee you every single member of Congress who balked at how Build Back Better was too expensive will vote for this without a thought.\n\nThe Pentagon doesn't need this money — working people who can't afford child care, housing, and health care do.\nhttps://t.co/Z5EA2bz3uD","date":"Mon Mar 28 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"TAX 👏🏾 THE 👏🏾 RICH 👏🏾\n\nhttps://t.co/qEx1Vf0s8Q","date":"Mon Mar 28 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am horrified. We must all stand up and call this what it is: homophobic and transphobic. \n\nTo all the LGBTQ+ people who feel silenced by this draconian legislation, I see you, I hear you, and I will never stop working to protect your right to be unapologetically yourself.","date":"Mon Mar 28 17:43:12 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We do not need to raise the defense budget by another $31 billion. \n\nIt's time to make investments into our communities — not into a defense budget that is already larger than the next 11 countries combined. https://t.co/2nUpMpNt6E","date":"Mon Mar 28 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Price-gouging and corporate greed are why costs are going up.\n\nMajor corporations are using inflation as a smokescreen to collect record profits while you pay more. We can and must hold them accountable and lower costs for working families.\nhttps://t.co/5wAlPvXiqR","date":"Mon Mar 28 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 107 people across our country lost their lives to gun violence. Another 211 were injured.\n\nThe House has passed multiple common sense gun safety reforms. It's time for the Senate to act and save lives.","date":"Mon Mar 28 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Let me be absolutely clear: Justice Thomas ruling on Jan 6th cases while his wife was involved with the organizers is unacceptable.\n\nThis is stunning. Everyone involved in the most deadly attack on our Capitol since 1812 must be held accountable—no matter who they're married to.","date":"Mon Mar 28 14:00:39 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time to end the filibuster, pass voting rights legislation, and protect your voice at the ballot box.","date":"Sun Mar 27 22:15:55 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is an absurd question — and it perfectly illustrates why we must invest to lower the cost of child care. \nhttps://t.co/quqgsSQkuR","date":"Sun Mar 27 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Corporate greed is costing you more at the pump and the grocery store. \n\nIt's time to hold them accountable for raising prices for working families while giving bonuses to CEOs and payouts to shareholders. It's time to tax the ultra-wealthy and corporations.","date":"Sat Mar 26 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Congress cannot stand by as GOP legislators target our children.\n\nAs the proud mom of an incredible trans kid, I will never stop fighting for the right of our LGBTQ+ loved ones to be truly and unapologetically themselves.\nhttps://t.co/M0aCJiWsfp","date":"Sat Mar 26 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's been seven years since our country became involved in the horrific, unjust war in Yemen, triggering one of the worst humanitarian crises we've ever seen.\n\nI'm proud to be leading @USProgressives in a call to end our involvement once and for all.\nhttps://t.co/qyG1S8CSaB","date":"Sat Mar 26 16:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"🌊 Floods are getting worse. \n\n🔥 Wildfires are getting worse.\n\n⛈ Storms are getting worse.\n\nIt's time to make real investments into climate action before it's too late.","date":"Fri Mar 25 23:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Transitioning to renewable energy isn't only a critical step to save our planet — it guarantees we won't have to rely on dictators like Vladimir Putin for oil.\nhttps://t.co/iLOppOJ6z7","date":"Fri Mar 25 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to cap the out-of-pocket cost of insulin at $35/month.\n\nIt's time to deliver.","date":"Fri Mar 25 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So great to be with @SecMartyWalsh, @PattyMurray, and local labor leaders to discuss how critically important it is that we pass the PRO Act. \n\nLet's get this done and put power back into the hands of workers! https://t.co/6ChATUSvAT","date":"Fri Mar 25 20:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to pass my Dignity for Detained Immigrants Act, which would finally end the use of private, for-profit detention facilities, repeal mandatory detention, and promote community-based alternatives.\n\nWe can and must do better by immigrants seeking shelter on our shores.","date":"Fri Mar 25 18:45:13 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Etowah Detention Center is one of the worst facilities in the country and I'm glad to see this step being taken.\n\nHowever, there's still much more to be done to fix our broken immigration system.\nhttps://t.co/gx8Z2ZaCKZ","date":"Fri Mar 25 18:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There is still so much to be done to fix our broken immigration system and restore the US as a beacon of hope. \n\nI look forward to continuing this important work with the Biden administration.\n(2/2)","date":"Fri Mar 25 16:33:09 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yesterday, the DHS and DOJ issued a rule to improve and expedite asylum claim processing to ensure that those who are eligible for asylum are granted relief quickly. \n\nThis is a welcome step to ensure people can access asylum.\n(1/2)","date":"Fri Mar 25 16:33:09 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big Oil has been taking advantage of inflation and the crisis in Ukraine to pad their wallets.\n\nIt's time to hold them accountable.\nhttps://t.co/1uiGpXdPrB","date":"Fri Mar 25 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We're living through the devastation of climate change right now and seeing low-income and communities of color facing the worst of it. \n\nMy bill will create a skilled workforce with millions of good-paying jobs to prepare for and respond to this crisis.\nhttps://t.co/RymWGiYncr","date":"Fri Mar 25 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can fight inflation by investing in child care, health care, housing, and so much more.\n\nProgressives have a plan. Let’s get this done.","date":"Thu Mar 24 23:57:21 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is WORKING. \n\nNow it's time to keep up this momentum by creating more good-paying jobs and raising wages!\nhttps://t.co/tCgUkuTW5A","date":"Thu Mar 24 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Pure joy to be hosting my first in-person town hall since the start of the pandemic. \n\nThanks so much to all who came out last night on Vashon Island! If you weren't able to make it you can watch the full event here: https://t.co/yx9CubtKvj https://t.co/jLqXjIrz3G","date":"Thu Mar 24 20:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"💸 55% of Americans have medical debt. 💸 69% of those who hold debt also have insurance.\n\nBetween high deductibles, massive co-pays, and unaffordable premiums — it's clear this system isn't working. It's time for Medicare for All. https://t.co/42ykMvbcah","date":"Thu Mar 24 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It is so incredible to see Judge Ketanji Brown Jackson making her way towards Justice Ketanji Brown Jackson!!\n\nWhat an inspiration in yesterday's hearing — she will make an amazing Supreme Court Justice and is doing women everywhere proud 💪🏾💪🏾\nhttps://t.co/i46izrhlM4","date":"Thu Mar 24 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm glad to see our country rising to meet the humanitarian crisis of this moment. \nhttps://t.co/yAV6s6AJ5E","date":"Thu Mar 24 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to cancel at least $50,000 of student debt per borrower.\nhttps://t.co/OOGlJqXsf7","date":"Thu Mar 24 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"From lowering the cost of health care to protecting our planet and canceling student debt — there are dozens of actions the administration can take to help working families. \nhttps://t.co/AQVexKWq2R","date":"Thu Mar 24 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'll give you a hint: low-income Americans suffered the most while Big Oil raked in record profits.\nhttps://t.co/5pexBxJsGZ","date":"Wed Mar 23 21:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The US has one of the highest rates of gun violence in the world.\n\nThis doesn't have to be our reality. It's time for the Senate to end the filibuster and pass gun safety reforms. It's time to save lives.\nhttps://t.co/sOKJTXk0Qe","date":"Wed Mar 23 19:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"TONIGHT I'm hosting an in-person town hall on Vashon Island at 7:00 PM PT. \n\nRSVP to join: https://t.co/kE8BQvjpJq","date":"Wed Mar 23 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Including deductibles and premiums, Americans spend on average more than $12,500 on medical expenses every year.\n\nThe ACA guaranteed that millions could access health care. Now it's time for us to cut costs and provide truly affordable care for people across this country.","date":"Wed Mar 23 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The administration has the authority to cancel student debt.\n\nEspecially at a time when inflation is on the rise, we cannot ask people to start making these crushing payments again. It's time to cancel at least $50,000 of student debt per borrower.\nhttps://t.co/P3Y2sdfkq9","date":"Wed Mar 23 15:20:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today marks 12 years since the ACA was signed into law. \n\nIt was a major step forward — however, for too many health care is still unaffordable — it's time to take the next step and ensure health care as a human right. It's time for Medicare for All.","date":"Wed Mar 23 14:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is totally unacceptable.\n\nIt's time to close the pay gap and raise the wage. \nhttps://t.co/xHnaAIUv1M","date":"Wed Mar 23 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such great news.\n\nEvery worker deserves a union. Congratulations to these incredible organizers on this win. \nhttps://t.co/Hur6LNFxZI","date":"Tue Mar 22 21:57:10 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, we remember the Oso landslide, the deadliest in US history.\n\nMy heart is with the community and the friends and families of those who were lost. \nhttps://t.co/cP1B9yUgD5","date":"Tue Mar 22 21:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Progressive Caucus is ready to deliver for the people. \n\nLet's get this done.\nhttps://t.co/EsqXFfordS","date":"Tue Mar 22 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question our climate is changing. \n\nYesterday, I visited Carkeek Park in Seattle to hear directly from scientists how sea level rise will effect our community and how we can take action to protect our environment. https://t.co/lOHqi544e4","date":"Tue Mar 22 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Raise. The. Wage.\nhttps://t.co/5qhvoUGzvK","date":"Tue Mar 22 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Justice can never truly be reached for the family of Manuel Ellis, because nothing can bring him back.\n\nThis is though an important step towards accountability. \nhttps://t.co/ahMl45kMuD","date":"Tue Mar 22 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Transitioning to renewable energy is not only good for our planet, it means we will no longer have to be dependent on dictators, like Vladimir Putin, for oil.","date":"Tue Mar 22 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This determination is critically important. \n\nI'm glad to see our government recognize and call out this incredibly cruel injustice for what it is. \nhttps://t.co/F7VNd1wfoI","date":"Tue Mar 22 14:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can fight inflation by lowering everyday costs for millions of working families.\n\nIt's time to invest to lower the cost of child care, health care, housing, and so much more.","date":"Mon Mar 21 22:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The baseless Russian war in Ukraine is another proof-point of why we must transition to renewable energy.\n\nWe cannot let the need for oil keep us beholden to dictators. https://t.co/BRVsH9hror","date":"Mon Mar 21 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Storms are getting worse. \n\nClimate change will continue to get more destructive until we take real, meaningful steps to stop it. It's time to invest into climate action.\nhttps://t.co/QES7Wx0z1Z","date":"Mon Mar 21 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As Russia continues its devastating, unprovoked war on the Ukrainian people — our focus must be on de-escalation. \n\nThis is an incredibly dangerous situation and I applaud the Biden administration for the work they've done to prioritize diplomacy. https://t.co/kPm0aCVIF3","date":"Mon Mar 21 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 122 people across this country lost their lives to gun violence, and another 326 were injured.\n\nThe Senate must act now. End the filibuster and pass the common-sense gun safety laws the House has already passed. It's time to get this done and save lives.","date":"Mon Mar 21 15:15:38 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There is so much that the administration can do to deliver on the promises made to the American people. \n\nLet's get this done.\nhttps://t.co/jWrfJZYhBc","date":"Mon Mar 21 14:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time to make meaningful investments into climate action.\n\nSaving our planet can’t wait.\nhttps://t.co/zvQsBo1K3Q","date":"Sun Mar 20 22:41:19 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"End the filibuster. \n\nPass the Equality Act.\n\nProtect LGBTQ+ people across this country.\n\nIt's that simple 🏳️‍🌈🏳️‍⚧️","date":"Sun Mar 20 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This has been a jam-packed week in Congress — here's my two-minute recap to keep you in the loop on what I've been working on 👇🏾 https://t.co/OInrXaZFLu","date":"Sat Mar 19 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There are steps the Biden Administration can take to make necessary investments into the care economy, while Congress negotiates legislation.\n\nLet's get this done — and deliver for the people.\nhttps://t.co/LpPyz0PRfm","date":"Sat Mar 19 16:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"3. The original petition, just as real today and why I am committed every day here as a Member of Congress and chair of @USProgressives to do all I can to prevent war &amp; emphasize diplomacy and de-escalation. https://t.co/AIFL3ahnlC","date":"Sat Mar 19 15:34:27 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"2. Let's also remember the courage of women non-violent resistors in places like Sudan &amp; in war-torn places around the world who provided strength &amp; moral courage in refusing to engage in violence &amp; play enormous roles in ending war. https://t.co/QdtG1D8M5o","date":"Sat Mar 19 15:30:16 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"1. In 2002, as an activist, I sent out a petition that got 1000s of signatures to call attention to the consequences of war on women &amp; oppose the Iraq war. Ukrainian women today are experiencing this again w/courage &amp; strength.   https://t.co/5RmX9TgUIM","date":"Sat Mar 19 15:26:49 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can and must protect immigrants. \n\nIt's time to re-establish the US as a beacon of hope for those seeking refuge. \nhttps://t.co/4m9rBpw3FD","date":"Sat Mar 19 00:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Inflation and corporate greed are costing families at the grocery store and the gas pump.\n\nWe can and must take steps to lower costs for working people — on everything from health care to child care and housing to energy bills. Let's get this done.","date":"Fri Mar 18 22:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of an incredible trans kid, my heart is with families across this country who are under attack.\n\nI stand with you — and I will not stop fighting to pass legislation to protect trans people's rights to be unapologetically themselves 🏳️‍⚧️\nhttps://t.co/Sj866ASAc4","date":"Fri Mar 18 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion rights are human rights.","date":"Fri Mar 18 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: Today the House passed legislation to end hair discrimination.\n\nNatural hair is beautiful — and more importantly — has nothing to do someone's ability or work ethic. \nhttps://t.co/Xrm68qzHfF","date":"Fri Mar 18 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Droughts are getting worse. Climate change is here and now.\n\nIt's time to make meaningful investments into climate action — before it's too late.\nhttps://t.co/PiJmboMg0N","date":"Fri Mar 18 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's been a year since the House passed the Dream and Promise Act. \n\nIt's time for the Senate to end the filibuster, pass this critical legislation, and deliver for Dreamers across this country.","date":"Fri Mar 18 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am so thrilled to see this step from @chopracfpb and the @CFPB!\n\nThis is a great example of how the administration can and is using their power to cut costs for consumers. \nhttps://t.co/NN4KpN9QGd","date":"Fri Mar 18 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Happy Holi to all who celebrate!\n\nThis is one of my favorite times of the year – between the festival of colors, celebration of spring and new growth, triumph of good over evil, and communion, love, and gratitude – what’s not to enjoy! https://t.co/VQE96jmU45","date":"Fri Mar 18 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Progressives are ready to meet this moment and deliver.\n\nWhile legislation is negotiated, there are over a dozen actions the administration can take on their own to lower health care costs, cancel student debt, save our planet, and so much more. \nhttps://t.co/JE7ed8yXd0","date":"Fri Mar 18 14:00:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can and must continue to pursue legislation, but in the meantime there are actions the White House can take to immediately lower costs for families.\n\nIt’s time to deliver. \nhttps://t.co/3sU3Wq3ibO","date":"Thu Mar 17 22:06:39 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big Tech is not above the law. They’ve consistently put dollars behind stopping Congress from passing anti-trust legislation. But we in @HouseJudiciary will hold them accountable: https://t.co/sRE8xomr52","date":"Thu Mar 17 20:21:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Corporations are using inflation as a smokescreen to raise costs for you. \n\nIt’s time to lower costs for working people.","date":"Thu Mar 17 18:00:06 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is WORKING. \n\nLet’s keep up this momentum and deliver by lowering the cost of child care, health care, housing, and so much more!","date":"Thu Mar 17 15:04:31 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel at least $50,000 of student debt per borrower.","date":"Thu Mar 17 13:41:39 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wishing a safe and joyous Purim to all who celebrate!","date":"Thu Mar 17 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Admitting it is the first step. Now it's time for Big Oil to lower costs. https://t.co/X01j2Bec4V","date":"Wed Mar 16 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I greatly appreciate President Zelenskyy taking time today to speak to Congress.\n\nWe stand in support of the brave Ukrainian people.\nhttps://t.co/zTTysYAtgj","date":"Wed Mar 16 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to reform our immigration system to center human rights and dignity. \nhttps://t.co/1WLHg1Z6KL","date":"Wed Mar 16 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's been a year since the Atlanta Spa Shooting — a tragic day that woke many up to the horrible reality of racism against AAPI people, which has only grown over the pandemic. \n\nToday, let's all to stand up and recommit to #StopAsianHate.","date":"Wed Mar 16 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm so proud to have led this legislation with @PattyMurray, inspired by an incredible survivor, @voteleahgriffin. \n\nIn the coming days President Biden will sign it into law — a victory for sexual assault survivors across this country.\nhttps://t.co/HmXAh7mLdX","date":"Wed Mar 16 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Once more for the people in the back: rising oil prices are being caused by corporate greed.\nhttps://t.co/s8g3SzgzS5","date":"Wed Mar 16 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such a great step! \n\nTPS protections will ensure Afghan refugees across our country can safely remain in America. I look forward to continuing work with Secretary Mayorkas to restore our country as a beacon of hope for refugees and asylum seekers.\nhttps://t.co/ZyINvEBZAx","date":"Wed Mar 16 14:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If there's one thing we've learned from the pandemic, it's that it makes no sense to tie health care to employment. \n\nIt's time to ensure everyone can access care. It's time for Medicare for All.","date":"Tue Mar 15 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is working!\n\nLet's keep up this momentum and deliver more good-paying jobs to more people!\nhttps://t.co/CcorjqSXGV","date":"Tue Mar 15 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"YES! It's time to invest to ensure that our recovery doesn't leave mothers behind!\nhttps://t.co/0dex3q1ZzY","date":"Tue Mar 15 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"On average, women make 83 cents for every dollar a man makes — and it's worse for women of color.\n\nToday, on Equal Pay Day, the Senate must end the filibuster and pass the Paycheck Fairness Act. It's time to close the wage gap. https://t.co/njCHEjxWRl","date":"Tue Mar 15 17:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The average monthly student loan repayment is $460.\n\nWith the cost of food and gas on the rise, we cannot ask people to restart these crushing payments. It's time to cancel at least $50,000 of student loan debt per borrower.","date":"Tue Mar 15 16:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Equal Pay Day may fall earlier this year than it has before — but it is still three months into the year.\n\nWhile we should celebrate how far we've come, we cannot stop fighting to close the wage gap.\nhttps://t.co/u1O2bkjJZF","date":"Tue Mar 15 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Not only has the pandemic exacerbated pay disparities — it pushed women out of the workforce in droves — and nearly a million still haven't returned.\n\nTHIS is why it's critical that we invest into child care and home care — so women can return to work.\nhttps://t.co/wSMGg4S1FN","date":"Tue Mar 15 14:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you, Maria Ovsiyannikova, and thousands of Russian anti-war protestors for your courage to speak out in this crucial moment.  We stand with you. https://t.co/2jzsfrqIko","date":"Tue Mar 15 10:34:54 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time for corporations to FINALLY pay their fair share of taxes.\nhttps://t.co/cZhQNpvFgF","date":"Tue Mar 15 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If there's one thing we should've learned from this pandemic it's that health coverage should be MORE accessible.\nhttps://t.co/6LyUkQizu8","date":"Mon Mar 14 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"In less than two months, student loan payments are set to restart. \n\nWe cannot ask people to make crushing student debt payments while inflation is so high. It's time to cancel at least $50,000 of student debt per borrower.","date":"Mon Mar 14 22:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We've been through a devastating pandemic, and now Big Oil is using tragedy in Europe to raise prices for people who are already cash strapped.\n\nWe cannot let this stand.\nhttps://t.co/Psc6pR1vNQ","date":"Mon Mar 14 21:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Lyft saw a 36% increase in profit from 2020 to 2021. \n\nYet another corporation passing the buck to you.\nhttps://t.co/0ji3VzBxlN","date":"Mon Mar 14 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: Last week, as part of the government funding package, my legislation to help survivors of sexual assault get the care they need passed!\nhttps://t.co/6xmi2c6sZQ","date":"Mon Mar 14 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can't let massive corporations that have raked in record profits throughout the pandemic use inflation to pad their wallets at your expense.\nhttps://t.co/Psc6pR1vNQ","date":"Mon Mar 14 15:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 111 people across this country lost their lives to gun violence, and another 188 were injured.\n\nIt's time to end the filibuster, pass gun safety reform, and save lives. The Senate can and must act.","date":"Mon Mar 14 14:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As you're paying more for everything from chicken to laundry detergent and gas to clothing, massive corporations are raking in record profits.\n\nWe cannot allow them to use inflation as a smokescreen to charge you more and line their wallets.\nhttps://t.co/wgyf3aeh2j","date":"Sun Mar 13 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Our country pumps more than 8 times more funding into the Pentagon than we do into public education. \n\nThere's no question, it's time to cut the bloated Pentagon budget and invest in our communities.","date":"Sat Mar 12 23:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"RT if you agree: It’s time to end the filibuster and protect voting rights across our country.","date":"Sat Mar 12 21:31:27 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yes, prices are rising. But it's clear that Big Oil is taking advantage of war in Ukraine and inflation to hike prices even higher. \n\nIt's unacceptable for them to make you pay more at the pump while they rake in billions in profits. https://t.co/lXB6RBn7yS","date":"Sat Mar 12 17:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This was such an important step.\n\nNow, let's keep up the momentum and make critical investments to fight back against inflation.\nhttps://t.co/SzXWM53nO9","date":"Sat Mar 12 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can't count on the courts to protect the right to have an abortion.\n\nIt's time to end the filibuster and pass the Women's Health Protection Act.\nhttps://t.co/qemzzUue0P","date":"Fri Mar 11 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Now would be a great time to cancel at least $50,000 of student debt per borrower.\nhttps://t.co/iwy7dFHfHR","date":"Fri Mar 11 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Title 42 is cruel — period. Depriving migrants of their legal and legitimate right to seek asylum puts lives in danger.\n\nIt's time for the administration to end the use of xenophobic, Trump-era policies to expel migrants.\nhttps://t.co/rKqFQ0ZfQD","date":"Fri Mar 11 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This isn't just an outrage, it would be a death sentence for those who experience an ectopic pregnancy.\n\nAn ectopic pregnancy can be deadly for the pregnant person — and not to mention they are fatal for the fetus. This cannot become law — people will die.\nhttps://t.co/LXBvNSXXYG","date":"Fri Mar 11 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Let's be clear: The American Rescue Plan kept our economy afloat. \n\nLet's build on that progress — and fight back against inflation — by quickly investing to lower the cost of housing, child care, health care, and so much more!","date":"Fri Mar 11 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Including deductibles and premiums, Americans spend an average of $12,530 on medical expenses every year.\"\n\nIt's clear — medical care in our country is unaffordable. No one should go broke because they get sick. It's time for Medicare for All.\nhttps://t.co/j85H1C4Q6P","date":"Fri Mar 11 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question — the American Rescue Plan is WORKING. \n\nNow, it's time to continue to deliver on the Democratic agenda by lowering the cost of child care, health care, housing, and so much more! https://t.co/18rvsqImxk","date":"Fri Mar 11 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today marks a year since the American Rescue Plan was signed into law. \n\nSince then we've seen:\n✅ More than 6 million jobs created\n✅ A 32% drop in hunger\n✅ A historically low unemployment rate\n\nLet's keep up this momentum and deliver for the people!","date":"Fri Mar 11 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's clear that Big Tech has become too powerful to care about putting people over profits.\n\nThey've poured money into trying to stop Congress from passing antitrust legislation—but in @HouseJudiciary we'll keep working to promote fairness and competition.\nhttps://t.co/sRE8xomr52","date":"Fri Mar 11 15:00:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is why I voted against the ever-growing Pentagon budget. Eliminate waste, fraud and abuse, cut military spending and end forever wars. Re-Invest in our people.","date":"Fri Mar 11 02:02:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's critical that we make investments ASAP to lower child care, health care, housing costs and so much more. \n\nIt's time to deliver for families.\nhttps://t.co/mubaCgSlFA","date":"Fri Mar 11 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Members of Congress and their spouses shouldn't be allowed to own or trade stocks.\n\nIt's time to raise the ethical standards of our government.","date":"Fri Mar 11 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a great step forward. \n\nNow, do the rest of it. \nhttps://t.co/ceOsESUmR0","date":"Thu Mar 10 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm just going to leave this here....\nhttps://t.co/wGE0G0RYbt","date":"Thu Mar 10 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm proud to be leading this effort with my colleagues, @RepRaulGrijalva and @RepJasonCrow. \n\nIt's time to re-establish our country as a beacon of hope and humanitarian protection for those seeking safety on our shores.","date":"Thu Mar 10 21:31:58 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's clear that for-profit detention centers are a breeding ground for rampant and unchecked mistreatment.\n\nOur immigration system is broken — immigrants deserve compassion and to have their basic human rights and dignity protected.\nhttps://t.co/jfAItxDshv","date":"Thu Mar 10 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tomorrow marks a year since the House passed HR8 — legislation to require universal background checks on gun purchases.\n\nThis is a simple step that would save lives. It's time for the Senate to take up this critical bill.","date":"Thu Mar 10 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The answer is simple, yes inflation is a factor, but major corporations are posting record profits by using inflation as a smokescreen to hike costs and pad their wallets.\nhttps://t.co/0ZOvD0iPN3","date":"Thu Mar 10 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It is simply not okay for any company to come and testify under oath and lie. \n\n@HouseJudiciary has given Amazon numerous opportunities to provide us with corroborating information and they have refused. The only conclusion is that they lied.\nhttps://t.co/9VpyCEtR3s","date":"Thu Mar 10 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel at least $50,000 of student debt per borrower.\nhttps://t.co/kcMBhdCoub","date":"Thu Mar 10 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Last night, the House passed a massive funding bill that will invest in our communities and send aid to Ukraine. \n\nRead my full statement 👇🏾👇🏾👇🏾\nhttps://t.co/z3I0DtQtNR","date":"Thu Mar 10 15:00:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The climate provisions in Build Back Better would FULLY offset energy losses from cutting off Russian oil imports.\n\nIt's time to make real, meaningful investments into climate action and renewable energy.\nhttps://t.co/Mv2xsMw9no","date":"Wed Mar 09 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can offset rising gas prices and grocery store inflation by lowering costs for health care, child care, housing, and so much more.\n\nIt's time to invest in our communities.","date":"Wed Mar 09 20:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"They want to ban abortions in their state AND make it illegal for women to go out of state to receive one.\n\nThis is an unfathomably cruel piece of legislation. It's time to pass the Women's Health Protection Act and protect the right to have an abortion.\nhttps://t.co/RSedCLlHnw","date":"Wed Mar 09 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So wonderful to join colleagues today as we continue the celebration of Women's History Month!\n\nI'm so proud to be the first South Asian American woman to serve in the House of Representatives — and I hope to see many follow. https://t.co/NCOpoOIq2P","date":"Wed Mar 09 18:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"One year ago today, the House passed the PRO Act. \n\nIt's time for the Senate to act — to put power back into the hands of workers, expand their right to organize, and strengthen laws to protect all working people throughout our country.","date":"Wed Mar 09 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As 1 in 4 women who have had an abortion, I'm proud to have joined @RepAndyLevin to lead this resolution.\n\nFor me, terminating my pregnancy wasn’t an easy choice, but it was my choice – in part thanks to the abortion providers working to ensure that care is safe and accessible.","date":"Wed Mar 09 14:38:53 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Especially in the midst of the pandemic, we should be ensuring MORE people can access health care, not less. \n\nWe cannot let this happen.","date":"Wed Mar 09 01:00:12 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, on International Women's Day, I'm thrilled to be celebrating all that we're fighting for in the House — like equal pay, gender equity, and so much more. \n\nWe've come so far, but there's no question — we still have a lot to do to guarantee full equality for women. https://t.co/mQhM6YfjLx","date":"Tue Mar 08 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Holding our Muslim community close today. This is now the fifth Islamic Center in our state to be targeted with violence in the last four months. Islamophobia should have no place in our society. I stand with Muslims and condemn any and all acts of hate.\nhttps://t.co/gXv6160IXo","date":"Tue Mar 08 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"From wildfire smoke and pollution that poisons our air — to the dramatic loss of life from increasingly worse flooding, tornadoes, and hurricanes — there's no question that #ClimateIsHealth.\n\nIt's time to make meaningful investments into climate action to save lives.","date":"Tue Mar 08 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Women hold two-thirds of the student loan debt in the country.\n\nLet's deliver for women on #InternationalWomensDay by cancelling at least $50,000 of student debt per borrower.","date":"Tue Mar 08 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm so proud of these students using their voices standing up to homophobic and transphobic laws — but kids shouldn't have to fight for the right to be who they are.\n\nIt's time for Congress to ensure LGBTQ+ rights by FINALLY passing the Equality Act 🏳️‍🌈🏳️‍⚧️\nhttps://t.co/l3hciK3Oqn","date":"Tue Mar 08 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The battle for civil rights and gender and racial equality is a long and difficult one, but her words of optimism have always inspired me to keep up the fight and remember all the good we have done:","date":"Tue Mar 08 16:15:05 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"“Life is a hard battle anyway. If we laugh and sing a little as we fight the good fight of freedom, it makes it all go easier. I will not allow my life's light to be determined by the darkness around me.”","date":"Tue Mar 08 16:15:05 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, on #InternationalWomensDay, I want to honor the life and legacy of Sojourner Truth. Born into slavery, and a lifelong activist for civil rights and women's rights, she became the first Black woman to go to court against a white man and win. https://t.co/4JJDdQnhEw","date":"Tue Mar 08 16:15:04 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Over the last 72 hours, 118 people across America have lost their lives to gun violence, and another 270 were injured. \n\nIt's time for the Senate to step up and end the filibuster. We can and must pass commonsense gun reforms to save lives.","date":"Tue Mar 08 15:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such an important step towards environmental justice.\n\nTightening truck emissions of carbon dioxide and nitrogen dioxide will save lives — especially in low-income and communities of color, which tend to be more exposed to truck routes.\nhttps://t.co/mM0ILfRYJ2","date":"Tue Mar 08 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So great to visit the White House today for an important discussion on how we can take on environmental justice by investing in clean buses — to keep kids and frontline workers alike from breathing in toxic fumes.\n\nThese investments will cut carbon emissions and save lives. https://t.co/IWGVCscLCU","date":"Mon Mar 07 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a horrifying statistic. \n\n➡ Between 2009 and 2018, the United States lost 12.6 million years of life because of firearms alone.\n\nIt's time to end the filibuster, pass commonsense gun safety reforms, and save lives. This can't wait any longer.\nhttps://t.co/ktW9i4sLJb","date":"Mon Mar 07 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There is so much we can — and must — do through both executive action and legislation to save people money.\n\nAs inflation is on the rise, it's never been more critical that we make investments to lower the cost of child care, health care, housing, and so much more! https://t.co/1xPgExRwWt","date":"Mon Mar 07 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, as we honor the 57th anniversary of Bloody Sunday – let us continue on the path toward justice – for my hero John Lewis and for all who marched that day.\n\nMay we be inspired by his legacy and continue the fight for racial equality. https://t.co/ymOyBLzOvb","date":"Mon Mar 07 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Soaring gas prices are weighing on families in our community and across the country.\n\nThat's why it's never been more important to make investments that will lower costs for millions — in child care, health care, housing, and so much more.\nhttps://t.co/CSPjMR0C0y","date":"Mon Mar 07 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Stopped by a Ukraine solidarity rally yesterday to say #WeStandWithUkraine 🇺🇦\n\nWe in Congress will do everything we can to support the Ukrainian people in achieving a cease fire and stopping Putin’s catastrophic and unprovoked war. ✊🏾✊🏾 https://t.co/eeu7cYozGR","date":"Mon Mar 07 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This would be an important step — and serves to highlight why it's so critical that we invest in renewable energy. \n\nWe cannot allow dictators in Europe or anywhere else in the world to hold us hostage over oil prices.\nhttps://t.co/d8XBb8eKRN","date":"Mon Mar 07 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We have crossed 6 million confirmed global deaths due to COVID; the real number is certainly greater. Less than 7% of people in low-income countries are fully vaccinated. We MUST invest more in global vaccination efforts immediately. https://t.co/7kHMcAmMWx","date":"Mon Mar 07 11:57:25 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is working.\n\nBut even as a record number of jobs have been created, people are struggling with rising costs. That's why we must keep up this momentum and lower the cost of health care, child care, housing, and so much more!\nhttps://t.co/5C3bUlXXJ3","date":"Sun Mar 06 20:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"A threat to democracy anywhere is a threat to democracy everywhere. \n\nThat is why we are proud to stand with Ukraine — while continuing the fight for voting rights at home. https://t.co/kj4OzZ4bMH","date":"Sun Mar 06 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Congrats to @SeattleKraken Captain Mark Giordano on his 1000th NHL game! Proudly wearing his jersey. https://t.co/2wiUMnAyCW","date":"Sun Mar 06 01:02:35 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Even in the midst of everything, finding a little time to cheer on the home team…go ⁦@SeattleKraken⁩! https://t.co/HYoI9hpDb1","date":"Sat Mar 05 23:52:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time to make long overdue investments into child care, health care, housing, and so much more. \n\nIt’s time to deliver.","date":"Sat Mar 05 22:24:48 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICMYI: This week, the President signed our Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act into law.\n\nThis law will take meaningful steps to ensure survivor's voice are heard and that they have the opportunity to seek justice.\nhttps://t.co/KhfVQIgyUh","date":"Sat Mar 05 17:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Let's be clear: Progressives have always been the biggest champions for @POTUS's agenda.  We are committed to cutting costs for Americans and giving people the relief they need.  \nhttps://t.co/isleq7mRJB","date":"Sat Mar 05 15:34:46 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"RT if you agree: Members of Congress and their spouses shouldn't be able to own or trade stocks.","date":"Fri Mar 04 23:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So wonderful to be at the White House last night for the signing of the historic Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act! https://t.co/NjIYYwQlTs","date":"Fri Mar 04 20:23:34 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Progressives are ready to move forward on a big and bold package to invest in health care, child care, housing, and so much more. \n\nLet's get this done.\nhttps://t.co/d26tkwJeBA","date":"Fri Mar 04 20:13:53 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the cost of living is on the rise, we cannot let the student loan moratorium end. \n\nWe can and must extend this relief to borrowers — and finally take steps to cancel student loan debt.\nhttps://t.co/LhmKNyiRjN","date":"Fri Mar 04 17:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is WORKING!\n\nIt's time. Let's keep up this momentum by making historic investments into lowering the cost of child care, health care, housing, and so much more.","date":"Fri Mar 04 15:45:14 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thrilled to see our bill signed into law! https://t.co/zdtjWGTRPL","date":"Fri Mar 04 14:30:04 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thank you, @SpeakerPelosi!  At least 60 million people will no longer be silenced by forced arbitration agreements in cases of sexual assault and sexual harassment. This is a big win for women across the country!","date":"Fri Mar 04 14:22:23 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Absolutely the necessary thing to do.  I stand with Ukraine. 🇺🇦🇺🇦","date":"Fri Mar 04 03:51:12 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So thrilled to have been at the White House for this incredible step forward!","date":"Fri Mar 04 01:22:22 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time he's held fully accountable.\nhttps://t.co/CFVY8jo77w","date":"Thu Mar 03 21:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"More than 60 million people are subject to forced arbitration clauses, preventing them from choosing how to seek justice.\n\nToday, the President will sign legislation into law that I was proud to lead with @RepCheri to protect workers and end systemic abuse.","date":"Thu Mar 03 21:00:09 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As someone who came to this country at 16, I know just how broken our immigration system is.\n\nToo many immigrants face detention. That’s why I introduced my Dignity for Detained Immigrants Act. We must reform the detention system and prioritize human rights. #CommunitiesNotCages","date":"Thu Mar 03 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Good. \n\nWe must work to ensure that trans kids and their families are supported, not criminalized, for creating affirming, loving homes.\nhttps://t.co/YefMU5tWEP","date":"Thu Mar 03 18:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel at least $50,000 of student debt per borrower.","date":"Thu Mar 03 15:15:11 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of a trans kid, I'm grateful to see @POTUS taking steps to stop the transphobic attacks in Texas. \n\nI stand ready to work with the administration — to ensure children, their parents, and their doctors have the freedom to make decisions that are best for them.","date":"Thu Mar 03 02:59:20 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"STARTING NOW: Join my telephone town hall where I'll be giving important updates on what's going on in Congress and answering your questions 👇🏾👇🏾👇🏾\nhttps://t.co/iRivMOzt1P","date":"Thu Mar 03 02:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I was so thrilled to hear @POTUS say this last night — because this is literally what my Healthcare Ownership Transparency Act will do!\n\nOur senior citizens deserve dignity, respect, and quality care. It's time create accountability and protect patients in our nursing homes. https://t.co/q20n6Q6Jl7","date":"Thu Mar 03 01:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"The number of women whose nearest abortion provider would be in Washington could increase from 110,000 to 510,000.\"\n\nWe must protect Roe and protect the right for pregnant people to get an abortion — without having to drive hundreds of miles.\nhttps://t.co/5xeio40ovr","date":"Wed Mar 02 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yesterday, I had the opportunity to testify on the discrimination and civil rights violations that affected Muslims, Arabs, and South Asians in America following 9/11.\n\nI appreciate the opportunity to share my perspective on this critically important issue in @HouseJudiciary. https://t.co/XrWx0AjKv7","date":"Wed Mar 02 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a sight that will never get old!\nhttps://t.co/TsFxf4BpkY","date":"Wed Mar 02 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wishing a meaningful Ash Wednesday to all who observe this day of reflection and gratitude.","date":"Wed Mar 02 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can and must deliver lower health care costs, child care that is no more than 7% of anyone's income, and so much more. \n\nLet's get this done! https://t.co/6z490oso1Z","date":"Wed Mar 02 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, Speaker Pelosi signed our Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act. \n\nThis is the final step before it goes to the President's desk to be signed into law! https://t.co/dr46700wKz","date":"Wed Mar 02 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"@repmarkpocan Sending love and support to my dear friend and colleague, my former co-chair of @USProgressives @repmarkpocan, on the passing of his mom. ❤️❤️","date":"Wed Mar 02 17:01:33 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Last night, it was so great to hear @POTUS outline a bold and progressive vision for our country. \n\nLet's deliver by lowering prescription drug costs, reducing child care costs, creating good-paying jobs, and so much more. https://t.co/vmOt6qpEVP","date":"Wed Mar 02 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan is working!\n\nLet's keep up this momentum and continue to deliver on the President's agenda.","date":"Wed Mar 02 15:01:04 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of a beautiful trans kid, I'm so grateful to hear @POTUS address trans rights tonights 🏳️‍⚧️\n\nWe must end the filibuster and pass the Equality Act.","date":"Wed Mar 02 03:00:40 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I agree. \n\nIt's time to protect the right to vote. It's time to pass the John Lewis Voting Rights Act.","date":"Wed Mar 02 02:56:08 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"As Wall Street firms take over more nursing homes, quality in those homes has gone down and costs have gone up. That ends on my watch.\" — @POTUS\n\nYES! This is exactly what my Healthcare Ownership Transparency Act addresses. Let's get this done and deliver for our seniors!","date":"Wed Mar 02 02:45:30 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is absolutely critical. \n\nNo family should be paying more than 7% of their income for child care.","date":"Wed Mar 02 02:42:05 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"👏🏾 Invest in affordable housing 👏🏾\n\n👏🏾 Cut the cost of child care 👏🏾\n\n👏🏾 Tax the rich 👏🏾","date":"Wed Mar 02 02:39:50 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I agree with @POTUS. We can and must lower the out-of-pocket cost of insulin to $35/month. \n\nThat's how we Build Back Better.","date":"Wed Mar 02 02:35:48 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Our economy created over 6.5 Million new jobs just last year, more jobs created in one year  \nthan ever before in the history of America.\" — @POTUS \n\nDemocrats are delivering for the American people — let's keep up this momentum! #SOTU","date":"Wed Mar 02 02:23:52 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We're ready for @POTUS's first State of the Union Address! https://t.co/GMuq2ulrOa","date":"Wed Mar 02 01:53:37 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm thrilled to introduce my virtual State of the Union guest, Leanne!\n\nShe is a mother, born and raised in our district, whose family benefited from the Child Tax Credit. I'm so proud to have helped pass the American Rescue Plan to deliver for her family and so many others. https://t.co/uM7nhFN2c9","date":"Tue Mar 01 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: This was a long-overdue and important step to call lynching what it is – a hate crime.\nhttps://t.co/pU18OHM1HG","date":"Tue Mar 01 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yes! We have come so far in the last year, and tonight I look forward to hearing President Biden present his plan for how we can continue to deliver for the people.\nhttps://t.co/rUoEwFs7F0","date":"Tue Mar 01 21:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"In the first year of the Biden administration, we've:\n\n✅ Lowered the unemployment rate to a historic low\n\n✅ Reduced hunger by 32%\n\n✅ Created more than 6 million jobs\n\nTonight, I'm looking forward to hearing the President lay out a bold vision for how we'll continue to deliver!","date":"Tue Mar 01 17:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question that the cost of living is on the rise. \n\nThat's why it's never been more important to lower the costs of child care, housing, health care, and so much more to take the burden off our communities.\nhttps://t.co/OuLU3ZTUa6","date":"Tue Mar 01 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Two months from today, student loan payments will resume for millions of Americans. \n\nAt tonight's State of the Union, I hope to hear @POTUS outline a plan to cancel at least $50,000 of debt per borrower.","date":"Tue Mar 01 15:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Senate has officially filibustered the Women’s Health Protection Act.\n\nIt’s time to end the filibuster and protect the right to have an abortion. As 1 in 4 women who have made that choice, I am deeply disappointed today. https://t.co/cOW7qygwZ2","date":"Tue Mar 01 01:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Mark your calendars 🗓\n\nWednesday, March 2nd at 6 PM PT, I'll be holding a Telephone Town Hall to share my reactions to President Biden's first State of the Union Address. Sign up to get a call or listen live at: https://t.co/iRivMOzt1P https://t.co/DA5zVM7HIy","date":"Mon Feb 28 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It was so wonderful to join seniors at University House Wallingford for an in depth conversation on what I've been working on in Congress, and how I'm fighting to deliver for our community and communities across our country. https://t.co/mGikApYQmj","date":"Mon Feb 28 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate change is here and now — and as a result, hundreds of people have already lost their lives to heatwaves, wildfires, floods, and so many other devastating events.\n\nIt's time to make meaningful investments into climate action before it's too late.\nhttps://t.co/OQQAXbnJwa","date":"Mon Feb 28 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My thoughts are with those who have already and will suffer the greatest harm from Putin’s aggression: the people of Ukraine. \n\nIt is critical that as the crisis in Ukraine continues, we also continue diplomatic negotiations to quickly end fighting. https://t.co/KHb9V29l6c","date":"Mon Feb 28 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Good morning ☀ Today would be a great day for the Senate to pass the Women's Health Protection Act and guarantee the right to have an abortion in America. \n\nAbortion care is health care.","date":"Mon Feb 28 16:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I am a proud supporter of @RepBobbyRush anti-lynching bill. This is not complicated. Let’s get it done.","date":"Mon Feb 28 15:57:17 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today the Senate can and must do the right thing — it's time to guarantee the right to legal and safe abortions in this country.\nhttps://t.co/wIvnx1co5t","date":"Mon Feb 28 15:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time to guarantee the right to have an abortion in this country. \n\nThe Senate has the chance this week to do the right thing and pass the Women’s Health Protection Act.","date":"Sun Feb 27 20:13:13 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"To all the trans people out there who see the disgusting steps being taken in Texas, please know I see you and I am proud of you. \n\nWe've come too far to take such a major step backwards — and I will always fight for your right to be truly and unapologetically yourself.","date":"Sun Feb 27 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As the proud mom of an incredible trans kid, I cannot express how horrified and outraged I am by this. \n\nWe should be encouraging our kids to be themselves. I cannot imagine how devastating this must be to trans youth in Texas. Congress must act 🏳️‍⚧️\nhttps://t.co/2zoDbqVWHY","date":"Sat Feb 26 17:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a cool, super helpful tool from the @CDC.  \n\nYou can check out whether a specific county you live in or are traveling to has a low, moderate, or high risk of COVID and know what protective behaviors are recommended. \n\nTry it here: https://t.co/ASMRPIGdk5","date":"Sat Feb 26 05:31:32 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today marks a year since the House passed the Equality Act. \n\nAs we see new, draconian laws moving forward in places like Texas and Florida, there's no question that LGBTQ+ rights are under attack. It's time for the Senate to end the filibuster and pass the Equality Act 🏳️‍🌈🏳️‍⚧️","date":"Fri Feb 25 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, our thoughts are with the Ukrainian people, who are in the direct path of this violence.\n\nHere are resources for those looking for ways to help. \nhttps://t.co/C06me1se6G","date":"Fri Feb 25 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My statement with @RepBarbaraLee on the violent invasion of Ukraine 👇🏾","date":"Thu Feb 24 20:56:27 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to cancel at least $50,000 of student debt per borrower — especially as the cost of living is on the rise.","date":"Thu Feb 24 15:34:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is incredibly upsetting. \n\nWith hate crimes on the rise we all must recommit ourselves to standing up to hatred and racism wherever we see it. \nhttps://t.co/P6Fy6sgQXg","date":"Thu Feb 24 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"🔥 Wildfires are getting worse and more frequent 🔥 \n\nIt's time to make real investments in climate action — to save lives, property, and our planet.","date":"Wed Feb 23 23:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is truly disgusting. \n\nWe should be celebrating our LGBTQ+ friends and family for being themselves. If this legislation passes it will be a failure of government.\nhttps://t.co/hWUwLS74SG","date":"Wed Feb 23 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Working families across this country are already struggling to make ends meet. Missing work to stay home with a sick child shouldn't be a financial burden. \n\nIt's time to invest in our care infrastructure because this pandemic has confirmed what we already knew: #CareCantWait!","date":"Wed Feb 23 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Wildfires are getting worse.\n\nIt's time to act to prevent these deadly fires. It's time to make real, meaningful investments into climate action. It's time to build back better.\nhttps://t.co/o1JGw3ToFV","date":"Wed Feb 23 17:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is why we must invest in child care. \n\nFamilies and single parents can't get back to work without it. It's time to build back better.\nhttps://t.co/CjFxNaHUZs","date":"Wed Feb 23 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion care is health care.","date":"Wed Feb 23 01:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Inflation is giving corporations cover to raise prices and pad their wallets. \n\nCorporate profits have skyrocketed over the pandemic while families have struggled to keep food on the table — but they're still passing the bill to you.\nhttps://t.co/f5WkfoyidB","date":"Wed Feb 23 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Building back better means guaranteeing that no person pays more than $35 out of pocket per month for insulin.\n\nIt's time to get this done and deliver for the people.","date":"Tue Feb 22 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"A revolving door between the Treasury and major accounting firms creates serious ethical concerns. \n\n@SenWarren and I are calling on the Treasury to investigate this practice. \nhttps://t.co/uI5IPyeYmz","date":"Tue Feb 22 21:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is unaffordable for too many families.\n\nIt's time build back better by investing in child care and lowering costs. \nhttps://t.co/luIX1d4mNL","date":"Tue Feb 22 19:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such incredible news and these women are such amazing role models on and off the field. \n\nCongratulations on this major win @USWNT! \nhttps://t.co/Cun3WqEGjn","date":"Tue Feb 22 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Over the long weekend, 117 people lost their lives to gun violence and another 232 were injured. \n\nIt's time to end the filibuster, pass common sense gun reforms, and save lives. This can't wait any longer.","date":"Tue Feb 22 15:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time to guarantee health care as a human right.\n\nIt’s time for Medicare for All.","date":"Mon Feb 21 21:57:41 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This President's Day, let's celebrate everything we've achieved with a year of @POTUS: \n\n✅ The biggest single year drop in unemployment in American history.\n✅ A 32% reduction in hunger.\n✅ More than 6 million jobs created. \n\nLet's keep up this momentum and Build Back Better!","date":"Mon Feb 21 17:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It was fabulous to do a town hall together with my friend &amp; progressive champion @RepJimmyGomez! Such great questions and amazing constituents. \n\nThanks to everyone who came out. Let’s keep building our progressive movement!","date":"Mon Feb 21 00:20:31 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yesterday marked 80 years since the racist Executive Order 9066 was signed into law, interning 120,000 Americans of Japanese ancestry, two-thirds of whom were US citizens. \n\nIt is critically important that we tell this story so we ensure it never happens again.  #DayofRemembrance","date":"Sun Feb 20 18:16:23 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate action IS infrastructure.\n\nOur neighborhoods and communities weren't built to withstand the climate disasters that climate change will continue to fuel. It's time to make real, meaningful investments in climate action.\nhttps://t.co/5veDU55ypS","date":"Sun Feb 20 17:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thinking of our @Surgeon_General —and my good friend—and sending healing powers to you and your family. You always have the nation’s health at the forefront of all you do and now the nation will hold you all in our hearts for a quick recovery. ❤️  https://t.co/GquZxMZvWP","date":"Sun Feb 20 00:34:18 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"If the price of meat that a store pays to its suppliers goes up 6 cents a pound, the store might raise the price it charges for that same meat by 10 cents.\"\n\nInflation isn't the only issue here — corporate greed is fueling rising costs.\nhttps://t.co/qHLvefeOEk","date":"Sat Feb 19 23:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to make long-overdue investments in climate action.\n\nIt's time to Build Back Better.\nhttps://t.co/ibDCROnebu","date":"Sat Feb 19 17:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My colleagues &amp; I look forward to this case progressing so we can hold former President Trump &amp; militia groups accountable for their actions. Today’s decision underscores the importance of our judiciary in this country. No one is above the law, not even the President.","date":"Sat Feb 19 05:54:39 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Court said Trump “plausibly would have known that a call for violence would be carried out by militia groups and other supporters” &amp; that statements made by Trump to supporters on Jan. 6 are “the essence of a civil conspiracy.”","date":"Sat Feb 19 05:53:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As a plaintiff, this decision is historic b/c it affirms that no person is above the law. For first time, court ruled that a president can be held civilly liable for actions taken while in office &amp; rejected Trump’s arguments that he has absolute immunity.  https://t.co/mciIgXW6TT","date":"Sat Feb 19 05:51:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"RT if you agree: It's time to end the filibuster.","date":"Sat Feb 19 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So great to visit @MOHAI today to see the Black and Tan Collection.\n\nWhat a beautiful celebration of the influential history of Seattle’s early Black jazz scene! https://t.co/tnAZksNyfS","date":"Fri Feb 18 23:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a good step from @POTUS. \n\nThis pandemic isn't over until it's over everywhere. \nhttps://t.co/w6Xwv05Tr6","date":"Fri Feb 18 21:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"THIS.\n\nCorporations are using inflation as a smokescreen so they can increase prices — even after profits skyrocketed during the pandemic.","date":"Fri Feb 18 20:13:53 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The GOP attacks on abortion just keep coming. \n\nUnfortunately, we can't count on Donald Trump's conservative Supreme Court to uphold this right. It's time to end the filibuster and pass the Women's Health Protection Act.\nhttps://t.co/Ajau1vUy2j","date":"Fri Feb 18 18:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, on National Caregivers Day, I want to thank all of the caregivers across our country. \n\nWe see you and appreciate you. Now it's time to make real investments into the care economy by passing Build Back Better because #CareCantWait.","date":"Fri Feb 18 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Flooding. Heavy snowfall. Tornadoes. \n\nClimate change is here and now, and storms will only continue to get worse. It's time to make major investments into climate action.\nhttps://t.co/GxZgXGiki1","date":"Fri Feb 18 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Members of Congress and their spouses shouldn't be allowed to own and trade stocks. \n\nWe're elected to serve the people — not our own financial interests. Let's get this done.","date":"Fri Feb 18 15:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's the filibuster or LGBTQ+ rights.\n\nIt's the filibuster or abortion rights.\n\nIt's the filibuster or voting rights.\n\nThe choice is clear. It's time to end the filibuster.","date":"Fri Feb 18 00:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The infrastructure bill is delivering clean energy across the country!\n\nNow it's time to pass the Build Back Better Act to make further investments into protecting our climate. \nhttps://t.co/u8mscSSale","date":"Thu Feb 17 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The debt ceiling is a dangerous relic that serves no purpose in the modern world.\n\nWe've come a long way since WWI, it's time to reform how we handle our country's debt. https://t.co/6gWbNLWYnU","date":"Thu Feb 17 21:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"More than 14 million Millennials also have student loan debt, more than any other generation, averaging $38,877 per borrower.\n\nLet's provide people real relief by canceling at least $50,000 of student debt per borrower.\nhttps://t.co/UJ2tnj8w7S","date":"Thu Feb 17 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"THIS is why it's critical that we make investments to lower the cost of child care, health care, housing, and so much more. \n\nThat's how we fight inflation and build back better. \nhttps://t.co/v2f8YLU50u","date":"Thu Feb 17 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to build back better to protect our planet.\n\nThat means advancing environmental justice and cutting greenhouse gas pollution by investing in a 21st century clean energy economy. Let's get this done. https://t.co/DNGVPpackj","date":"Thu Feb 17 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Under @POTUS, US added 375,000 new US manufacturing jobs in just one year, w/every state in the country benefiting.  In WA, we added 7,900 manufacturing jobs since Feb 2021. Check out table that has state numbers. We're investing in America.✊🏾https://t.co/lZslGXPhiS","date":"Thu Feb 17 16:42:53 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This means it won't just flood when it rains — in many places it'll flood at high tide. \n\nWe can and must build back better by making long-overdue investments into climate action and a green economy — before it's too late.\nhttps://t.co/fQ23BnMMDf","date":"Thu Feb 17 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is exactly why ⁦@CongressmanRaja⁩ ⁦@RepMalinowski⁩ &amp; I are pushing to get at least $17 bb allocated for global vaccines. This is both the right thing to do and the only way we will address the spread of the virus in America. https://t.co/Njeldrdh6I","date":"Thu Feb 17 15:18:36 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel at least $50,000 of student debt per borrower.\nhttps://t.co/q7hEfVrJsm","date":"Thu Feb 17 15:00:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm ready. Let's get it done.\nhttps://t.co/lTBxpou6sH","date":"Thu Feb 17 00:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to make historic investments into affordable housing because every person deserves a place to call home. \n\nThis is how we build back better.","date":"Wed Feb 16 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is absurd. \n\nIt's time to stop pumping billions more each year into the bloated Pentagon budget. We can and must cut defense spending and invest in our communities, families, and climate.\nhttps://t.co/WTudX41enP","date":"Wed Feb 16 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to get money out of politics. \n\nIt's time to end the filibuster and pass critical voting rights legislation.\nhttps://t.co/s8JnxNMWyE","date":"Wed Feb 16 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"America is facing a doctor shortage — and the H-1B backlog only makes it harder to attract qualified medical professionals. \n\nYesterday, in @HouseJudiciary we held a hearing with immigrant doctors to emphasize the need for immigration reform. https://t.co/dOIgO5uQT3","date":"Wed Feb 16 17:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is incredibly upsetting.\n\nAs the proud mom of a beautiful trans kid, I know how wonderful it is when people are allowed to truly be themselves. We must protect our trans kids and the doctors who help care for them. \nhttps://t.co/rvIKmnYHIX","date":"Wed Feb 16 16:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Sea levels are set to rise one foot by 2050. That means frequent flooding on the coasts — not just from rain, but from high tide.\n\nMeanwhile, there's a mega-drought in the West — the worst in 1,200 years.\n\nClimate change is here and now, and we're running out of time to act.","date":"Wed Feb 16 15:30:38 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can lower costs for families by passing Build Back Better. \n\nIt's critical that we get this done to fight back against inflation.","date":"Wed Feb 16 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Have questions about your tax return?\n\nThe IRS has launched a new page to help you track the latest updates and information so you can quickly get your return 👇🏾\nhttps://t.co/3zNTLgeRPW","date":"Wed Feb 16 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to end the filibuster and protect the right to have an abortion. \n\nAbortion care is health care. \nhttps://t.co/zAQ6nje8AW","date":"Tue Feb 15 23:05:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The time for climate action is now. \n\nThis can't wait any longer.\nhttps://t.co/pYl07hxOZa","date":"Tue Feb 15 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"For me, serving in Congress is about paying it forward.\n\nI'm doing that by working to ensure that @USProgressives Caucus is poised to best serve the people and fight for bold and transformational change that benefits everyone across this country.\nhttps://t.co/QFcVLpqNGq","date":"Tue Feb 15 19:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today marks 75 days until federal student loan payments resume. \n\nIt's time for @POTUS to cancel at least $50,000 of student debt per borrower — we can and must continue this relief.","date":"Tue Feb 15 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"With corporate greed on the rise, it's critical that we tax corporations and invest in our communities. \n\nThat's how we Build Back Better.\nhttps://t.co/ItvF67SNS8","date":"Tue Feb 15 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is unacceptable:\n\n\"Kroger’s chief executive earned $22.4 million in 2020, while the median employee earned $24,617 — a ratio of 909 to 1.\"\n\nIt's never been more clear — it's time to raise the wage for millions of workers across this country.\nhttps://t.co/lbARFv8Qj8","date":"Tue Feb 15 15:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Tesla the company will pay $0 in federal tax despite raking in a record profit of $5.5 billion in 2021.\"\n\nTax the rich. Tax the corporations.\nhttps://t.co/EkMyhTw4ST","date":"Tue Feb 15 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Building back better means lowering costs of everything from insulin to child care. \n\nIt's time to get this done.","date":"Mon Feb 14 23:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Understandably so!\n\nThat's why we need to pass Build Back Better — to fight back against inflation by lowering the cost of prescription drugs, child care, housing, and so much more.\nhttps://t.co/R7Oa2huABk","date":"Mon Feb 14 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As someone who came to this country alone at 16, I'm proud to stand with everyone participating in \"a day without immigrants.\"\n\nIt's time for a pathway to citizenship for all the immigrants who have kept our country going throughout the pandemic.","date":"Mon Feb 14 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If you have to wait weeks for an appointment, a six week abortion ban might as well be a full abortion ban. \n\nIt's time to end the filibuster and pass the Women's Health Protection Act.\nhttps://t.co/2meyEmftQZ","date":"Mon Feb 14 18:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate change is here and now.\n\nIf a 1,200 year mega-drought isn't enough to make people realize that, I don't know what is. It's time for Congress to act by making meaningful investments into climate action — before it's too late.\nhttps://t.co/jExzMKUXxr","date":"Mon Feb 14 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Inflation affects everyone, but those on the tightest budgets are hurting the most. That's why we need to cut costs of childcare, healthcare &amp; Rx drugs, &amp; build more housing--all part of Build Back Better that would cut costs &amp; help American families NOW.https://t.co/ugMAzIIH1x","date":"Mon Feb 14 16:12:13 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 111 people across our country lost their lives to gun violence and another 231 were injured.\n\nToday, as we remember the horrific Parkland shooting, it's time for the Senate to end the filibuster, pass common sense gun reform, and save lives.","date":"Mon Feb 14 15:00:03 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time to end the filibuster and protect the right to vote.","date":"Mon Feb 14 02:14:06 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, on Superbowl Sunday, don't forget that for *years* the NFL has systematically villainized Colin Kaepernick beccause he dared to protest racial injustice, police brutality, and anti-Blackness.","date":"Sun Feb 13 20:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Build Back Better isn’t just necessary, it’s popular. \n\nLet’s get this done.","date":"Sun Feb 13 00:40:27 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to cancel at least $50,000 of student debt per borrower. \nhttps://t.co/41XzaW1K3d","date":"Sat Feb 12 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Neither Members of Congress nor their spouses should be able to own or trade stocks.\n\nIt's time to raise the ethical standards of Congress.","date":"Sat Feb 12 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"How do we fight skyrocketing rent prices?\n\nWe pass Build Back Better and make historic investments into affordable housing. Let's get this done.\nhttps://t.co/zWXJ7xc3KQ","date":"Sat Feb 12 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The last seven years have been the seven hottest years on record.\n\nClimate change is here and now, and we're running out of time to act. It's time to Build Back Better by making long-overdue investments into climate action.","date":"Fri Feb 11 23:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"It’s the most important legislation you’ve never heard of.\"\n\nMy Stop Corporate Capture Act reduces corporate influence in our government and increases transparency. Let's get this done. \nhttps://t.co/zNhaQIm8sZ","date":"Fri Feb 11 21:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion care is health care. \n\nWe can and must end the filibuster and pass the Women's Health Protection Act to ensure that every pregnant person can access a safe abortion if it's the right decision for them.","date":"Fri Feb 11 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: Our bill to end forced arbitration passed the House AND the Senate. \n\nNext stop, the President's desk. It's time to deliver justice for survivors of sexual assault and sexual harassment.\nhttps://t.co/lakjUHj4r1","date":"Fri Feb 11 19:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We can and must get this done. \n\nMembers of Congress are elected to serve the people, not line their own wallets.","date":"Fri Feb 11 17:59:57 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Be sure to tune in for this important conversation on Medicare for All! https://t.co/v6lhz0uqRv","date":"Fri Feb 11 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Members of Congress should serve the people, not personal financial interests. \n\nI'm proud to be leading this bipartisan, bicameral effort. \nhttps://t.co/KUxXpTCH6F","date":"Fri Feb 11 15:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Because he is complicit. That's why the House impeached him the second time.\n\nEvery single person involved in Jan 6th must be held fully accountable.\nhttps://t.co/np1Ed3yQj4","date":"Fri Feb 11 01:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"RT if you agree: Members of Congress shouldn't be allowed to own or trade stocks.","date":"Fri Feb 11 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Our economy too often leaves behind communities of color. While we rebuild our economy, equity must be a priority. https://t.co/slFDJ6RmgO","date":"Thu Feb 10 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today the Senate voted to confirm Washington's own Max Vekich to be a Federal Maritime Commissioner!\n\nI'm so proud to have supported his nomination and wish him the best in this new role.","date":"Thu Feb 10 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: If you need a COVID-19 test, you can get one delivered right to your house for free!\n\nOrder yours today:\nhttps://t.co/wdbz2JNDgE","date":"Thu Feb 10 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"In January, as our economy continued booming back, 27x more men than women joined the workforce.\n\nTHIS is why we need Build Back Better — our recovery can't leave women behind.","date":"Thu Feb 10 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big news today — our bill to end forced arbitration has officially passed the Senate!\n\nThis legislation will put power into the hands of survivors of workplace sexual assault and sexual harassment and allow them to seek justice. \nhttps://t.co/PI1HuokDyI","date":"Thu Feb 10 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We fight inflation by lowering costs for families and working people.\n\nWe lower costs by passing Build Back Better. It's time to deliver.","date":"Thu Feb 10 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Democrats delivered us the House, the Senate, and the White House. \n\nNow it's time for us to deliver.\nhttps://t.co/GNQjKdGlWh","date":"Thu Feb 10 15:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As long as members and their spouses are allowed to hold and trade stocks, we keep the door open to corruption.\n\nIt's time to ban members of congress from owning and trading stocks. Period.","date":"Thu Feb 10 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Building back better means making critical investments to lower everyday costs for people across this country. \n\nLet's get this done. https://t.co/9Qdvp0Mt6J","date":"Thu Feb 10 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Members of Congress were elected to serve the people, not their personal financial interests.\n\nProud to be leading this bipartisan, bicameral effort with @SenWarren, @SteveDaines, and @RepRosendale. \nhttps://t.co/I348QNG24a","date":"Wed Feb 09 23:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We don't have the luxury of giving up on building back better.\n\nMillions of families and working people still need relief — and we must do everything possible to deliver for them.\nhttps://t.co/ZEnXLr91g1","date":"Wed Feb 09 21:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"THIS is why we need Build Back Better.\n\nOur economy recovery cannot leave women behind. \nhttps://t.co/Pkr8lRCoEe","date":"Wed Feb 09 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"As Chair of @USProgressives, I was proud to immediately support staffers’ efforts to unionize.\n\nToday, I’m proud to support @RepAndyLevin’s resolution to allow staffers to unionize and raise their voices. Workplace democracy is critical everywhere, including here in Congress.","date":"Wed Feb 09 17:16:04 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today would be a great day to cancel at least $50,000 of student debt per borrower.","date":"Wed Feb 09 16:03:27 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to end the filibuster.\n\nNOW         NOW            NOW \n  👇🏾               👇🏾                  👇🏾","date":"Wed Feb 09 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: Last night the House passed legislation to end forced arbitration in cases of sexual assault and sexual harassment. \n\nSo proud to have co-led this important bill!\nhttps://t.co/ahwEWFDZdZ","date":"Wed Feb 09 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to save lives by ending the filibuster and passing common sense gun reform. \n\nWe can and must get this done.\nhttps://t.co/K08PXNqvv1","date":"Tue Feb 08 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Storms are getting worse.\n\nWildfires are getting worse.\n\nDroughts are getting worse.\n\nClimate action can't wait. It's time to Build Back Better.","date":"Tue Feb 08 22:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is absolutely outrageous. I stand with @repbeatty. This disrespect for safety and dignity is absolutely unacceptable. It is harassment.","date":"Tue Feb 08 21:59:44 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We cannot count on Donald Trump's conservative Supreme Court to block legislation like this — even though it's unconstitutional. \n\nCongress must act. It's time to end the filibuster and pass the Women's Health Protection Act.\nhttps://t.co/riLNPSmeWj","date":"Tue Feb 08 20:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"On #SaferInternetDay, I'm joining @RepSusanWild to demand a lifesaving action from @YouTube: take down \"How To Tie a Noose\" videos.\n \nAdolescent suicide rates are on the rise and taking this simple step could save lives.","date":"Tue Feb 08 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Last night, we held an incredibly moving moment of silence for the 900,000 lives lost to the COVID-19 pandemic. My heart breaks for every single family missing a loved one. \n\nIf you haven't yet — please get vaccinated and boosted. We can get through this together ❤ https://t.co/Kf5x3SlGQn","date":"Tue Feb 08 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We will not sit by as the Constitution is ignored and the Yemeni people suffer seven years into this unauthorized war.\nhttps://t.co/2aLHsQOtll","date":"Tue Feb 08 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such great news!\n\nSo proud to have joined @RepTedLieu, @RepAnnaEshoo, and @RepYvetteClarke to lead this effort to protect your information this tax season.\nhttps://t.co/43QPXGDZbx","date":"Tue Feb 08 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time to tax the rich and invest in people, working families, and our communities. \n\nIt’s time to Build Back Better.","date":"Tue Feb 08 02:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"So thrilled to announce this legislation has officially passed the House!\n\nI'm proud to have co-led this bipartisan bill to protect survivors of workplace sexual assault and harassment with @RepCheri, @RepMGriffith, and @RepKenBuck. https://t.co/wa3cnD6Xq8","date":"Tue Feb 08 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is what voter suppression looks like.\n\nIt's time to end the filibuster and protect YOUR right to vote.\nhttps://t.co/uQ6Ur0WOoH","date":"Tue Feb 08 00:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This horrifying account of workplace sexual harassment is exactly why we need the Ending Forced Arbitration of Sexual Assault &amp; Sexual Harassment Act, which I'm proud to co-lead. \n\nTonight, the House will pass this critical, bipartisan, bicameral legislation to protect survivors. https://t.co/aLqMLu1IfZ","date":"Mon Feb 07 22:03:52 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, the House will vote on this critical legislation to protect survivors of workplace harassment. \n\nI'm incredibly proud to co-lead this bill to put the power back into the hands of survivors and give them the opportunity to seek justice.\nhttps://t.co/rYZT0y7biv","date":"Mon Feb 07 20:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"For too long, the US has indirectly supported war in Yemen. It's time for our complicity to end. \n\nThat's exactly what @RepPeterDeFazio and I are working towards 👇🏾\nhttps://t.co/cLQEhy7vSU","date":"Mon Feb 07 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today is National Black HIV/AIDS Awareness Day — a day to recognize the impact HIV/AIDS has had on Black communities across this country.\n\nWe all have a part to play in ending the stigma of this disease and save lives.","date":"Mon Feb 07 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"In *ONE WEEK* we added three new co-sponsors to my Medicare for All Act — bringing us to a record amount of support.\n\nLet's keep up this momentum and finally guarantee health care as a human right for all. It's time.\nhttps://t.co/yNyKtme2zg","date":"Mon Feb 07 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Build Back Better is the President's agenda — the Democratic agenda.\n\nIt's time to deliver for millions of working people and families across this country. https://t.co/5lyaYeDbHp","date":"Mon Feb 07 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 118 people lost their lives to gun violence across this country, and another 205 had their lives forever changed by a gun violence injury.\n\nIt's time to end the filibuster, pass gun safety reforms, and save lives.","date":"Mon Feb 07 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such an important piece on how legislation, like my Stop Corporate Capture Act, can help to create accountability in our government regulation. \nhttps://t.co/71NUj26rZj","date":"Mon Feb 07 02:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's climate action OR the filibuster.\n\nIt's gun safety reform OR the filibuster.\n\nIt's abortion rights OR the filibuster.\n\nThe choice is clear. The filibuster is standing in the way of dozens of popular and necessary bills. It's time for it to go.","date":"Sun Feb 06 23:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We've officially got a record 120 co-sponsors on my Medicare for All Act!\n\nThrilled to welcome Rep. Sheila Cherfilus-McCormick to our fight to ensure health care as a human right! https://t.co/LkUHxuZEmU","date":"Sun Feb 06 20:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to provide relief to millions of Americans by canceling at least $50,000 of student debt per borrower.","date":"Sun Feb 06 17:27:23 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My heart breaks for the hundreds of thousands of families missing a loved one. \n\nWe can end this pandemic — together. Please get vaccinated, boosted, and stay safe!\nhttps://t.co/ARe3jy8cZv","date":"Sun Feb 06 02:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate action IS infrastructure. \n\nClimate change is here and now. It's time to make meaningful investments into climate action to fight back.\nhttps://t.co/nHsayISyv1","date":"Sat Feb 05 23:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to end the filibuster and pass the Paycheck Fairness Act. \n\nWe can and must end the wage gap. https://t.co/diwu4uvqy1","date":"Sat Feb 05 20:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today, Trayvon Martin should be celebrating his 27th birthday. \n\nInstead, his life was cut short by anti-Black violence and white supremacy. We must remain committed to the fight against hatred and racism.","date":"Sat Feb 05 17:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thanks to Am Rescue Plan, @POTUS  &amp; Congress got urgent help to small businesses &amp; families. Remarkable gains for economy: unemployment⬇️ wages ⬆️. \nTo sustain equitable recovery, pass #BuildBackBetter Act &amp; reduce costs of Rx drugs, childcare, healthcare.https://t.co/mhQtq7Gclx","date":"Sat Feb 05 12:57:28 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This policy is cruel — full stop. By depriving migrants of their legal and legitimate right to seek asylum, our government is putting lives in danger.\n\nThe administration should immediately end the use of Title 42 to expel migrants. \nhttps://t.co/9t6X8d4Es9","date":"Fri Feb 04 23:00:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tax the rich. Tax the corporations. Invest in communities.\nhttps://t.co/TJLZkSHKAW","date":"Fri Feb 04 21:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Building back better means ensuring that the out-of-pocket price of insulin is capped at $35. \n\nNo one should have to pay thousands for lifesaving medicines.","date":"Fri Feb 04 20:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"January 6th was not \"legitimate political discourse\" — it was a violent insurrection on our Capitol.\n\nI didn't know if I'd make it out alive. Some didn't. We cannot let the GOP whitewash what happened.\nhttps://t.co/aXJr7zvqtb","date":"Fri Feb 04 19:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Please — get vaxxed, get boosted, and be safe.\nhttps://t.co/b1Ktt0vhKz","date":"Fri Feb 04 18:35:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"6.6 MILLION jobs created in a year. \n\nDemocrats are delivering. https://t.co/88phR1LwXG","date":"Fri Feb 04 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan and Infrastructure Bill are working!\n\nLet’s quickly pass Build Back Better and keep up this momentum. It’s time to deliver.\nhttps://t.co/R6Mwj4UbXF","date":"Fri Feb 04 15:31:40 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is absolutely unacceptable. It’s why we must pass voting rights legislation that stops voter suppression and ensures that every single vote is counted. I won’t stop fighting till that happens.","date":"Fri Feb 04 04:31:42 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Rents are skyrocketing across the country.\n\nIt's time to Build Back Better by making long-overdue investments into affordable housing. Let's get this done.","date":"Fri Feb 04 01:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Is it the supply chain or is it the more than $12 million they paid their CEO in 2020 🤷🏾‍♀️\nhttps://t.co/34IMLFX545","date":"Fri Feb 04 00:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tonight the House will vote on my amendment to require our government to examine the humanitarian impact of sanctions in Afghanistan. \n\nWe should have a comprehensive picture of what is occurring, including an honest understanding of our own actions and their human impacts. https://t.co/pBsbk6lQeJ","date":"Thu Feb 03 23:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"152 years ago today, the 15th Amendment guaranteed Black men the right to vote.\n\nWhile we've come so far since then, now Republican legislatures across the country are working to make it harder to vote.\n\nIt's time to end the Jim Crow filibuster and protect the right to vote.","date":"Thu Feb 03 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"By blocking Afghans from accessing their own money, we're creating a further humanitarian crisis.\n\nThis amendment is critical to ensure that our government doesn't cause starvation and suffering abroad. \nhttps://t.co/xuuog9v8vc","date":"Thu Feb 03 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thanks to the American Rescue Plan and Infrastructure Bill — jobless claims are at their lowest level since 1973 📉\n\nLet's keep up this momentum and pass Build Back Better! https://t.co/BvQubsN8hM","date":"Thu Feb 03 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate action IS infrastructure.\n\nOur aging power grid can't withstand the stronger and more frequent storms that come with climate change. My thoughts are with everyone in the path of this storm. \nhttps://t.co/lRdwjnAq79","date":"Thu Feb 03 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I’m thrilled to welcome @DonaldNorcross, a champion for workers’ rights, to the fight to guarantee health care as a human right.\n \nHis support brings us to 119 cosponsors of my Medicare for All bill — the most cosponsors EVER! The momentum is building — let’s get this done. https://t.co/9PkZTFXGEA","date":"Thu Feb 03 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Good morning ☀ Today would be a great day to cancel at least $50,000 of student debt!\nhttps://t.co/oXBrXhS2Gp","date":"Thu Feb 03 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"RT if you agree: Child care IS infrastructure.","date":"Thu Feb 03 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to Build Back Better by making historic investments into affordable housing.\nhttps://t.co/EBaCqi9lbd","date":"Thu Feb 03 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"If the 10 richest men in our country lost 99.9% of their wealth — they'd still be in the top 1%.\n\nIt's time to tax the rich and invest that money in our communities.","date":"Wed Feb 02 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Yes! Let's get this done!\nhttps://t.co/iSDD3YCyv9","date":"Wed Feb 02 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Seattle is and remains a bedrock of music. \n\nToday in @HouseJudiciary, we held a hearing on the American Music Fairness Act, which would ensure that artists are compensated and local radio is preserved. https://t.co/JwWHK5xdmO","date":"Wed Feb 02 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"There's no question that those spreading vaccine misinformation throughout our country have played into this. \n\nMy heart breaks for all the families missing a loved one.\nhttps://t.co/vQauQglFB8","date":"Wed Feb 02 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The cost of rent is skyrocketing across the country.\n\nWe can fight back by making transformational investments into housing. That's how we Build Back Better.\nhttps://t.co/iphjRULzPU","date":"Wed Feb 02 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Tax. The. Rich.\nhttps://t.co/C51l8eWIVE","date":"Wed Feb 02 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Medicare for All is now officially cosponsored by 118 members of the House!\n\nSo glad to have @RepShontelBrown on board as we build this movement to finally guarantee health care as a human right. https://t.co/llfQftimYV","date":"Wed Feb 02 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The American Rescue Plan and Infrastructure Bill are working!\n\nLet's keep up this momentum by passing Build Back Better — and get more people back to work in good-paying jobs.\nhttps://t.co/nybwAxRDIn","date":"Wed Feb 02 15:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such wonderful news!\n\nThis step will be such a relief for parents across this country. \nhttps://t.co/VX6dzjKkF4","date":"Wed Feb 02 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such a disgusting development, especially as we begin Black History Month.\n\nWe must call out these hate crimes for what they are. Hate, discrimination, and racism have no place on our campuses or in our country.\nhttps://t.co/57OpxtQTlN","date":"Wed Feb 02 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Build Back Better is full of POPULAR and necessary policies.\n\nVoters delivered us the House, the Senate, and the White House. It's time for Democrats to deliver for them. https://t.co/cYLrZ0RF07","date":"Tue Feb 01 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is totally unacceptable. \n\nWomen deserve equal pay for equal work. It's time to end the filibuster and pass the Paycheck Fairness Act. \nhttps://t.co/p4pEux0Bnv","date":"Tue Feb 01 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to Build Back Better by dramatically lowering the cost of prescription drugs. \n\nNo one should have to choose between buying lifesaving medications and buying groceries — full stop. \nhttps://t.co/OLkGasG2IV","date":"Tue Feb 01 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"More than half of Americans have been impacted by gun violence — whether that's witnessing gun violence, being threatened or wounded, or losing a loved one.\n\nThis #GVSurvivorsWeek I'm calling on the Senate to end the filibuster, pass common-sense gun reforms, and save lives.","date":"Tue Feb 01 20:15:45 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Abortion restrictions most affect low-income people, and too often pregnant people of color. \n\nIt's time to end the filibuster and pass the Women's Health Protection Act — because abortion rights are human rights.\nhttps://t.co/4Distr53Lz","date":"Tue Feb 01 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Companies that want to be seen as responsible partners in addressing the deep gaps in racial, wealth and income inequality need to stop opposing unionization efforts &amp; instead partner with workers who want to form a union.  It works for the benefit of all!","date":"Tue Feb 01 17:47:08 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"We also know that unionization helps on numerous fronts: reduces economic inequality and racial disparity, increases safety on the job and ultimately attracts more workers to the company.  That’s why the PRO Act &amp; other pro-unionization legislation is so important to pass.","date":"Tue Feb 01 17:45:34 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"3. Workers organizing together for better wages, benefits, schedules, rights helps better a company that is truly interested in a community’s well being along with general profitability, not just in increasing profits for CEOs and shareholders at the expense of workers.","date":"Tue Feb 01 17:43:35 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"2. What would happen if corporations took a completely different approach to unions, respecting workplace democracy &amp; seeing the union as a partner to ensuring reality to the values the company espouses?  This workplace democracy is linked to health of our own democracy.","date":"Tue Feb 01 17:41:57 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Thread on unionization: 1. The idea that a union comes between the company and its workers is backwards &amp; “otherizes” the union—which is made up of workers.  In America, anti-union sentiment is prevalent among corporations.  Not true in Europe &amp; elsewhere. https://t.co/xBZfrjHfhU","date":"Tue Feb 01 17:39:11 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's so important to recognize the cultural and historical significance of the Lunar New Year.\n\nThat's why I'm so proud to support @RepGraceMeng's legislation that would make the Lunar New Year a federal holiday. \n\nHappy #LunarNewYear to all who celebrate!","date":"Tue Feb 01 17:30:01 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate change is here and now — and it will only get more deadly and costly.\n\nIt's critical that we quickly make meaningful investments into climate action before it's too late.\nhttps://t.co/UddDTmUrla","date":"Tue Feb 01 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today as we celebrate the start of #BlackHistoryMonth, let us recognize that Black history is American history, and we should honor it every single day as we work towards a more just and equitable country.","date":"Tue Feb 01 15:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I want to take this moment to also thank Jewish Family Service for the incredible work they do in our community.","date":"Tue Feb 01 02:32:54 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a sad reminder that acts of anti-semitism, racism, and xenophobia can happen anywhere.\n\nHate has no place in our community or our country. Seattle stands with @CitizenRabbi.\nhttps://t.co/D4Vkk649eW","date":"Tue Feb 01 02:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is such an important innovation that will help to save lives — sign up today to get earthquake alerts right on your phone!\nhttps://t.co/J3NOMgrjB2","date":"Tue Feb 01 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's been nearly two years since federal student loan payments were due — and somehow the government is still functioning. \n\nIt's time to make this a permanent reality for millions. We can and must cancel at least $50,000 of student debt per borrower.","date":"Tue Feb 01 00:15:53 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"This is a great step by @POTUS.\n\nNow more than ever, as costs are dramatically rising, it's time to raise the wage for millions of minimum wage workers across this country.\nhttps://t.co/mgarJr2hxA","date":"Mon Jan 31 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Love to see this!! Congratulations to all the organizers who are fighting across the country 💪🏾\nhttps://t.co/ep7SOpDiCJ","date":"Mon Jan 31 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Get vaccinated, get boosted, and please stay safe.\nhttps://t.co/DpNQdsxLSr","date":"Mon Jan 31 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate disasters are becoming more deadly, more costly, and more frequent. \n\nMy Climate Resilience Workforce Act will ensure that we're prepared for future disasters — by investing in the workers who rebuild and creating millions of good-paying jobs. https://t.co/8QDl4GKP3g","date":"Mon Jan 31 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate action is a matter of racial justice. As storms continue to get worse, communities of color will bear the brunt of the costs. \n\nIt's time to Build Back Better by making meaningful, long-overdue investments into climate action. \nhttps://t.co/RkLHfGil6K","date":"Mon Jan 31 18:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Just this past weekend, 98 people across our country lost their lives to gun violence, and another 198 were tragically injured.\n\nIt's time to end the filibuster, pass commonsense gun reforms, and save lives.","date":"Mon Jan 31 17:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"\"Average rents rose 14 percent last year, to $1,877 a month, with cities notching increases of as much as 40 percent.\"\n\nEven before this spike, rent was already unaffordable for too many. It's time to make long-overdue investments into affordable housing. https://t.co/Yb4OPYBQWS https://t.co/u4NV0e6RJ3","date":"Mon Jan 31 16:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My Climate Resilience Workforce Act invests in a skilled workforce that is capable of not only responding to but preparing for the destructive impacts of climate change.\n\nThis is how we build back better, greener, and stronger!\nhttps://t.co/bNZfCAwV2s","date":"Mon Jan 31 15:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"ICYMI: The American Rescue Plan and Infrastructure Bill are WORKING. \n\nLet's keep up this momentum and pass the Build Back Better Act to get millions more people back to work in good-paying jobs!\nhttps://t.co/k2w0BsXFsn","date":"Sun Jan 30 23:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It’s time.","date":"Sun Jan 30 20:01:15 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"My Climate Resilience Workforce Act will create millions of good-paying, union jobs and center the very communities who are disproportionately impacted.\n\nLet's finally build back better, greener, and stronger.\nhttps://t.co/Uzp96tO4dX","date":"Sun Jan 30 17:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's time to end the filibuster and pass the Women's Health Protection Act. \n\nWe must protect the right to have a safe and legal abortion.\nhttps://t.co/FMvzhmGgcZ","date":"Sun Jan 30 02:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Canceling $50,000 of student debt would give 36 million Americans permanent relief. \n\nIt just takes the stroke of a pen.\nhttps://t.co/hcPSTgGjDk","date":"Sat Jan 29 23:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Big Tech giants have become too big to care and too powerful to ever put people over profits — so we must.\n\nMy Ending Platform Monopolies Act would take steps towards finally putting an end to Big Tech’s monopolistic practices.\nhttps://t.co/0JwWFGJ39Y","date":"Sat Jan 29 20:00:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Today marks 13 years since President Obama signed the Lilly Ledbetter Fair Pay Act into law. But the wage gap persists, and women — especially women of color — still make cents on the dollar compared to white men.\n\nWe must finally guarantee equal pay for equal work.","date":"Sat Jan 29 17:00:02 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"I'm so incredibly impressed by our Congressional App Challenge winners who created an innovative app that will help combat hunger in our community!\n\nCheck it out 👇🏾\nhttps://t.co/Kcm7d0uHD2","date":"Sat Jan 29 02:45:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate change is here and now — and we're running out of time to fight it. \n\nIt's time to make long-overdue investments into climate action. \nhttps://t.co/gtZgjM48FE","date":"Sat Jan 29 01:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"It's the Equality Act OR the filibuster.\n\nIt's the Dream Act OR the filibuster. \n\nIt's climate action OR the filibuster.\n\nThe choice is clear. The filibuster is standing in the way of dozens of popular and necessary bills. It's time for it to go.","date":"Sat Jan 29 00:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Disaster recovery work is a multi-billion dollar industry. Yet the workers on the frontlines often lack basic protections.\n\nMy Climate Resilience Workforce Act would fix that. \nhttps://t.co/7tONaorDho","date":"Fri Jan 28 23:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Millions of Americans are putting off buying a home, getting married, having kids, and so much more due to crushing student loan debt.\n\nIt's time to cancel at least $50,000 of student debt per borrower.\nhttps://t.co/Dcg5JY2D9r","date":"Fri Jan 28 22:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"Climate disasters are becoming more frequent — it's critical that we invest in the workers who rebuild. \nhttps://t.co/aOOGrjS1lK","date":"Fri Jan 28 21:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The pandemic won't be over until it's over everywhere. \n\nThis is such a great step towards that reality.\nhttps://t.co/3l6xcjzWIg","date":"Fri Jan 28 20:15:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"In the months since negotiations around the Build Back Better Act stalled, passing it has only become more urgent.\n\nLet's get this done.\nhttps://t.co/1QZr7WTEuK","date":"Fri Jan 28 19:30:00 +0000 2022","user_id":"815733290955112448"},{"handle":"RepJayapal","text":"The Senate must pass Build Back Better ASAP. \n\nVoters delivered us the Senate, the House, and the White House. It's time for us to deliver relief for millions of working people and families. https://t.co/RgvwcYhiSL","date":"Fri Jan 28 18:15:00 +0000 2022","user_id":"815733290955112448"}]