[{"handle":"RepJerryCarl","text":"@NatResources Thank you!","date":"Fri Jun 17 13:26:42 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Democrats should be ashamed of themselves for silencing the voices of anyone they disagree with. I’m sick of it, and the American people are too. Watch: https://t.co/ZdMAphtMHH","date":"Wed Jun 15 17:52:43 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"As gas prices continue soaring, my @NatResources colleagues and I are fighting to introduce common sense solutions to lower prices. \n\nDemocrats are abusing the rules to shut us down and instead work on a bill to regulate big cat ownership. Americans deserve better. https://t.co/m33bSajFaX","date":"Wed Jun 15 17:49:00 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Looking good! The @USS_ALABAMA is one of my favorite things in #al01.","date":"Wed Jun 15 16:59:59 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy 247th birthday to the @USArmy! Thank you for your continued sacrifice and service to this great nation. https://t.co/hnbMAkFHP3","date":"Tue Jun 14 17:22:38 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On the campaign trail, Joe Biden promised to shut down the fossil fuel industry. Now, Americans are paying record prices at the pump. That’s why I introduced the Unleashing American Energy Act to bring fuel prices down. We need relief!","date":"Tue Jun 14 11:36:56 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Where are the primetime hearings on soaring inflation, record high fuel prices, increasing crime, or the crisis at our southern border? \n\nThese are the issues Americans care about, but Democrats are doing everything they can to distract from the crises they've created!","date":"Mon Jun 13 16:48:31 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is awesome!","date":"Fri Jun 10 21:11:12 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great meeting @EnesFreedom today and talking with him about holding the #CCP accountable for its horrible human rights violations. https://t.co/0uPPezsxBm","date":"Wed Jun 08 19:44:14 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Gas prices have hit another historic high, so what are the Democrats on the House Natural Resources Committee doing today?\n\nHolding a hearing on a bill dealing with cats....","date":"Wed Jun 08 14:38:57 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Gas prices have DOUBLED since President Biden took office, and today we hit a new record high of $4.92 a gallon!\n\nWhy won't Democrats allow any votes on bills like my Unleashing American Energy Act to bring fuel prices down?","date":"Tue Jun 07 13:41:38 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in at 9:35 am! 📻","date":"Tue Jun 07 13:17:40 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On this day 78 years ago, our brave soldiers stormed the beaches of Normandy to liberate Europe. May we always remember their courage and continue honoring their legacy. #DDay https://t.co/85pwJFYZtt","date":"Mon Jun 06 19:15:07 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The American people deserve greater transparency from the World Health Organization after they failed to hold the Chinese Communist Party accountable for letting COVID-19 spread around the world when it could have been prevented!","date":"Tue May 31 22:48:17 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, we honor the many men and women who paid the ultimate sacrifice to preserve and protect freedom for all Americans. #MemorialDay2022 https://t.co/NvZ67CGBXC","date":"Mon May 30 18:01:46 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Red snapper season is finally here!\n\nhttps://t.co/ZGfvVkWGQO","date":"Sun May 29 15:36:56 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Gas prices continue skyrocketing because of the Biden admin’s war on American energy. \n\nThat’s why I’ve already introduced a bill to unleash American energy and bring these prices down! Why won’t the Democrats even allow a vote on it? https://t.co/Z8qtKdgZWL","date":"Thu May 26 19:41:26 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tina and I just voted! Have you? https://t.co/BEwmg0dgPP","date":"Tue May 24 15:37:38 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is the same border that Secretary Mayorkas said is being “effectively managed.” \n\nHe should be impeached for failing to do his job.","date":"Mon May 23 19:49:17 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"How out of touch can you be? Most Americans can’t afford to put gas in their car and groceries on the table. \n\nInflation isn’t just a “high class problem.”","date":"Sun May 22 18:02:42 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On this #ArmedForcesDay, we pause to honor the many brave men and women who defend our nation at home and abroad. Thank you for your service! 🇺🇸🇺🇸 https://t.co/90QINehizT","date":"Sat May 21 16:44:46 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Good news! The Biden admin has stopped plans to create its ridiculous Disinformation Governance Board. \n\nA major win for freedom of speech!","date":"Wed May 18 19:00:08 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"My @HouseGOP colleagues and I have been sounding the alarm about this for months. We’ve been to the border, we’ve introduced legislation, and we’ve repeatedly asked Democrats to get serious about securing our border. \n\nThey’ve done absolutely nothing.","date":"Mon May 16 20:12:39 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Congratulations! Auburn is in good hands with President Roberts. #WarEagle 🦅","date":"Mon May 16 15:59:01 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Exciting news! I'm proud of the partnership between @SSAB_AB and @Austal_USA to build high-quality @USNavy ships right here in #al01.","date":"Mon May 16 14:37:14 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Gas prices are at an all-time high and Americans are hurting. When the cost of fuel goes up, everything goes up. \n\nHow does the Biden admin respond? By further crippling American energy production. I’m fighting to put an end to this nonsense. https://t.co/HsDvQhtPqb","date":"Fri May 13 14:44:13 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I joined @GOPLeader and dozens of my @HouseGOP colleagues this morning to place a wreath at the #LawEnforcementMemorial to show our appreciation for LEOs who gave the ultimate sacrifice. https://t.co/SVxXCHIrOR","date":"Thu May 12 12:42:46 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Biden administration’s attempt to create a “Disinformation Governance Board” through @DHSgov is an absolute overreach that threatens free speech. \n\nI joined more than 170 of my colleagues on a letter to DHS Secretary Mayorkas demanding answers. https://t.co/Q5FksdFLwd","date":"Wed May 11 13:22:23 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is great news! Alabama is the right choice. \n\nSpace Command belongs in Huntsville!","date":"Tue May 10 22:50:09 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@KericAllen @GOP Yep! I've introduced legislation to unleash American energy, secure our border, shrink the federal government, etc. My GOP colleagues and I have been working to address all these issues, and these will remain our top priorities.","date":"Tue May 10 13:39:53 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Skyrocketing gas prices are costing the average American family an extra $2,000 a year. \n\nThis is unacceptable, and it's a direct result of the Biden administration's war on American energy!","date":"Tue May 10 13:26:55 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"1,000 new jobs! What a huge investment by @AirbusInTheUS, showcasing the strong partnership they have with our local and state leaders and with our top-notch workforce here in #al01. \n\nhttps://t.co/hu0zMqU1wg","date":"Tue May 10 13:13:00 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This week is National Police Week, which is a reminder that our law enforcement officers put themselves in harm's way every day to keep us safe. \n\nPolice officers need our support now more than ever as the radical Left pushes their \"defund the police\" rhetoric and policies!","date":"Mon May 09 17:22:24 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On today's #NationalDayofPrayer, I hope you will join me in praying for our nation, our elected officials, and our men and women in uniform. https://t.co/lqcYVT0ij9","date":"Thu May 05 15:48:41 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Last night’s leak of the Supreme Court draft opinion to potentially overturn Roe v. Wade is a shameful attempt by the radical pro-abortion Left to sway our Supreme Court justices. All life is made in the image of God, and I will never stop fighting to protect life at all stages!","date":"Tue May 03 14:11:11 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Secretary Mayorkas has not “effectively managed” the border crisis.\n\nUnder his watch, 2.4 million illegal immigrants have attempted to cross our border!\n\nHe should be impeached if he doesn’t start doing his job.","date":"Mon May 02 14:59:21 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Why are Democrats doing NOTHING to secure our border?","date":"Thu Apr 28 12:35:45 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"False. This Administration created a crisis, and it has continued getting worse.","date":"Wed Apr 27 20:13:40 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Border security is national security!","date":"Wed Apr 27 11:49:10 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Secretary Mayorkas has failed to secure the border, and he has made America less safe. We will hold him accountable! \n\nhttps://t.co/6vccFLPCGR","date":"Mon Apr 25 12:06:33 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Common sense clearly isn’t common in the Biden administration.","date":"Wed Apr 20 15:27:11 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Unreal. This is what's pouring into our communities every single day because President Biden and his allies in Congress refuse to get TOUGH on border security! \n\nhttps://t.co/hrQYwvReJA","date":"Wed Apr 20 14:43:57 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Awesome news! This graphite processing facility will ensure Alabama continues leading in the electric vehicle space.","date":"Wed Apr 20 13:50:10 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Whether it’s the graphite processing facility in Coosa County, or the Duluth Complex in @RepPeteStauber’s district, the US has the capabilities, the workforce, and the resources to dominate global mineral supply chains instead of allowing China to dominate them!","date":"Wed Apr 20 13:50:10 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I recently wrote about how America’s vast mineral resources are absolutely critical to our national security: https://t.co/Dp6L9R98vw","date":"Wed Apr 20 13:50:10 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Linemen are often first responders after storms and catastrophic events. Today we recognize these brave men and women for their constant hard work to maintain our energy infrastructure and ensure our nation has reliable electricity. #ThankALineman @EnergyofAL","date":"Mon Apr 18 20:24:56 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"How many did we not catch?\n\nI am afraid if the Democrats don’t work with us to control the flow coming across THEIR open border we will pay with American lives! \n\nhttps://t.co/EJ0pwkE32H","date":"Mon Apr 18 18:40:51 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"He is risen! Happy Easter to you and your family. https://t.co/z9oEwXtkB6","date":"Sun Apr 17 14:19:36 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tina and I wish you and your family a blessed Good Friday. \n\n“For God so loved the world that He gave His only begotten Son, that whoever believes in Him should not perish but have everlasting life.” John 3:16 https://t.co/oySQjtnANe","date":"Fri Apr 15 12:50:14 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Unleash American energy!","date":"Thu Apr 14 21:14:47 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"End the mask mandate on planes and in airports.","date":"Thu Apr 14 18:05:02 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Putin sanctioned me - oh well! It’s a list I’m proud to be on. https://t.co/whiPtbv4I9","date":"Thu Apr 14 14:53:43 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This massive $100 million investment by @Austal_USA will ensure we are able to continue providing high-quality ships for the @USNavy while bringing continued economic growth to #al01! \n\nhttps://t.co/DiFZXP6k17","date":"Wed Apr 13 13:49:35 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you @GovernorKayIvey and the Alabama legislature for standing firm against the liberal DC agenda!\n\nhttps://t.co/5ZEgMr28Ce","date":"Sat Apr 09 15:52:53 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The U.S. imports hundreds of millions of dollars in wood products every year from Russia. \n\nMy @NatResources colleagues and I are working to ban these imports so we can cut off a huge source of funding for Putin's war of aggression!\nhttps://t.co/uczL7BQGk1","date":"Fri Apr 08 17:51:00 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great to see folks visiting the Capitol! My office is open for tours, and we are able to do one a week. \n\nIf we could just get all the Democrats to show up to work, things would start looking normal around here!","date":"Thu Apr 07 18:08:38 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just took to the House floor to demand consideration of the Pause Act to protect all Americans from the #BidenBorderCrisis. \n\nWhy are Democrats refusing to consider this bill? https://t.co/Is1BeChA8I","date":"Wed Apr 06 18:18:12 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Americans need relief at the pump, but the gimmicks &amp; bandaid fixes we’re seeing from President Biden just aren’t cutting it. \n\nThat’s why 5 of my @NatResources colleagues &amp; I have introduced bills to end Biden’s assault on American energy. It’s time to unleash American energy! https://t.co/YbjNMnIUCg","date":"Wed Apr 06 17:07:31 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Proud to join @RepTomEmmer and over 90 of my colleagues in urging President Biden to take quick action on high fertilizer prices so our farmers can get much-needed relief.","date":"Tue Apr 05 15:40:51 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Ending this public health provision gives illegal immigrants the green light to pour across our border.\n\nThis decision will make the #BidenBorderCrisis even worse and will put American lives at risk.","date":"Tue Apr 05 13:51:10 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Since the onset of COVID, about 50% of federal employees have worked from home. This has caused a massive backlog for casework and customer service at federal agencies. It's time the federal government works FOR the people!\n\nRead more here: https://t.co/Z4Ynf0A0w3","date":"Mon Apr 04 14:09:06 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Biden admin thinks it's safe for illegal immigrants to pour across our border but not safe for federal government bureaucrats to go back to work!\n\nThat's why I've introduced the Earn Your Keep Act, which ensures federal employees are actually doing their job.","date":"Mon Apr 04 14:09:05 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great work by the Baldwin County Sheriff’s Office! This is enough fentanyl to kill well over a million people. \n\nThis is what we are seeing pour across our southern border every single day. We’ve got to get TOUGHER on border security!","date":"Fri Apr 01 18:28:45 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Biden admin is putting America last.","date":"Fri Apr 01 16:58:49 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is a dangerous move and does not solve the problem! The SPR is for national security emergencies and catastrophic weather events. \n\nDepleting 25% of our strategic reserves (which will have to be refilled under sky high gas prices) is NOT the answer to our problems.","date":"Thu Mar 31 15:16:47 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden should instead end his freeze on oil and gas projects, fast track LNG permits, expedite pipeline approval, and end the war on American energy. \n\nThat’s why my @NatResources colleagues and I just introduced 6 bills to #EndTheBidenBan and unleash American energy.","date":"Thu Mar 31 15:16:47 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#EndTheBidenBan","date":"Wed Mar 30 14:45:40 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you @RepWesterman, @RepStefanik, @RepBalderson, @RepRussFulcher, @RepGarretGraves, @RepHerrell, @RepDLamborn, @RepMcClintock, @RepBlakeMoore, @RepNewhouse, @RepRosendale, @RepPeteStauber, @RepChrisStewart, @RepTiffany, @Congressman_JVD, @RepBethVanDuyne, @RobWittman","date":"Wed Mar 30 14:41:23 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"🚨 🚨 🚨 \n\nI just introduced legislation to unleash American energy production NOW! My @NatResources colleagues and I are fighting back against President Biden’s war on American energy. My bill will help lower energy costs and end our reliance on foreign oil. #EndTheBidenBan","date":"Wed Mar 30 14:41:23 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden's ridiculous budget proposal would make our inflation crisis worse. Americans simply cannot afford Biden's tax hikes!\n\nhttps://t.co/nWICWmt8Zd","date":"Tue Mar 29 16:56:22 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"We can give Capitol tours now, but Democrats still don’t want to show up to work. \n\nThe American people pay us to show up to work - not to phone it in remotely.","date":"Mon Mar 28 21:26:10 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m sick and tired of unelected bureaucrats like Dr. Fauci earning massive salaries in exchange for doing nothing but lying to the American people!\n\nThat’s why I introduced a bill to eliminate Fauci’s entire federal pension if he is found to have lied to the American people.","date":"Mon Mar 28 18:57:45 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Good. Just last week I joined over 128 colleagues in demanding an immediate end to the Biden admin's ridiculous mask mandate on planes and in airports.","date":"Thu Mar 24 17:42:18 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"With increased security threats around the globe, we must ensure our defense programs are fully funded. Read more below:","date":"Wed Mar 23 17:47:05 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#AL01 - make sure you stay weather aware this afternoon and evening as severe storms develop over our region.","date":"Tue Mar 22 20:22:55 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"A true honor to present Corporal Robert Curtis Andry with a Purple Heart medal today. Cpl. Andry served in the U.S. Army during WWII and was a member of the 761st Black Tank Battalion, which helped lead Gen. Patton's push into Berlin. We are forever grateful for his service! https://t.co/7cNSmUuDqE","date":"Tue Mar 22 17:45:27 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Alabama's agriculture community is the backbone of our state, and they work daily to keep us clothed and fed. On today's #NationalAgDay, we are especially grateful for them! https://t.co/QnDREt4xVq","date":"Tue Mar 22 14:53:44 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great news for #AL01! This money will assist with long-term recovery efforts for communities affected by recent natural disasters. \n\nhttps://t.co/qH9zREuv3a","date":"Mon Mar 21 15:14:33 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Don Young had an incredible public service career, and his legacy will live on for years to come. He was a friend to all and will be missed dearly. Please join me in praying for his family and loved ones tonight.","date":"Sat Mar 19 01:38:36 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@RepGarretGraves This poll is rigged! Mobile is THE home of Mardi Gras.","date":"Fri Mar 18 18:30:42 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Let’s be clear - this is not Putin’s price hike. It’s the Democrats’ price hike. It’s time for them to get out of the way of common sense and bring relief to struggling Americans. Unleash American energy NOW!","date":"Fri Mar 18 17:58:58 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"NINE months ago, prices were already skyrocketing, but Biden went ahead and cancelled the Keystone Pipeline. He’s continued his war on American energy since and shows no signs of stopping.","date":"Fri Mar 18 17:58:58 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"When I was 7, my mother came home crying because she couldn’t afford groceries.\n\nToday, mothers across the country are in the same boat because Democrats have waged war on common sense &amp; have crippled American energy production. https://t.co/fuxF5dlzQW","date":"Fri Mar 18 17:58:57 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"My @HouseGOP colleagues and I introduced a bill to unleash American energy and solve our energy crisis, but House Dems flat out rejected it. We need energy independence now!","date":"Thu Mar 17 13:26:55 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy birthday to my friends @RepJuliaLetlow and @RepHerrell! 🎂 https://t.co/rNHKKM1Nkj","date":"Wed Mar 16 22:23:26 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you @RepJimBanks for the opportunity to host lunch for my @RepublicanStudy colleagues today! I enjoyed sharing updates on legislation I’m working on and hearing from @KellyannePolls. https://t.co/OBaBIKkmfZ","date":"Wed Mar 16 18:50:11 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I appreciate @ZelenskyyUa addressing Congress this morning. \n\nWe should help Ukraine by supplying them with the equipment they need to fight back against Russian aggression. They don’t need American boots on the ground, but they do need our support.","date":"Wed Mar 16 14:43:57 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Listening to President Zelenskyy address Congress this morning. https://t.co/oAMyxXuiwH","date":"Wed Mar 16 13:10:57 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great news! A few months ago, I cosponsored a House bill led by Rep. @VernBuchanan to make Daylight Saving Time permanent. It’s time to get this through the House and signed into law!","date":"Tue Mar 15 20:52:43 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"While illegal crossings continue to skyrocket, the Biden administration has dropped deportations to the lowest level in almost 30 years. \n\nBiden has let more than 400,000 illegal immigrants escape into the U.S. We need better leadership!\n\nhttps://t.co/jId8dd9WVt","date":"Tue Mar 15 14:23:22 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thanks to President Biden, a gallon of gas now costs more than it ever has.\n\nAmericans are fed up. It's time for Biden to end his war on American energy and bring fuel prices down!","date":"Mon Mar 14 13:46:38 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Mr. President, we shouldn’t just strive to prevent war. We should show leadership and actually prevent it.","date":"Fri Mar 11 19:16:14 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden should immediately end the moratorium on oil and gas leasing on federal lands and waters, restart the Keystone XL pipeline, and expedite approval for natural gas pipelines and LNG export facilities. We must unleash American energy NOW! (4/4)","date":"Thu Mar 10 16:07:52 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Last night, I voted to ban Russian oil and gas imports into the U.S. We can and should fill the gap in the market w/American energy rather than relying on dictators and terrorist groups to meet our needs. (1/4)","date":"Thu Mar 10 16:07:51 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden's anti-American energy policies are a threat to our nat'l security and are to blame for the rising energy costs months before Russia invaded Ukraine. Biden can get prices under control by getting gov't out of the way so we can produce oil and gas here at home. (3/4)","date":"Thu Mar 10 16:07:51 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The U.S. is the world's energy superpower, and we have enough supply to meet demand at home and abroad. Unfortunately, despite what @POTUS is telling you - he has been at war w/American energy since day 1 in office. As a result, we are importing dirty foreign oil. (2/4)","date":"Thu Mar 10 16:07:51 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"We were energy independent until you cancelled the Keystone XL pipeline, cancelled oil and gas leases on federal lands, and made it cost prohibitive to expand domestic energy production.","date":"Wed Mar 09 02:16:46 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I agree with banning Russian oil and gas only if it’s coupled with Biden reversing his anti-American energy policies. These actions combined would hurt Putin without hurting Americans.","date":"Tue Mar 08 18:40:49 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Americans are now paying an average of $4 a gallon for gas, and President Biden is to blame.\n\nHe chose to cripple American energy production and make us dependent on foreign oil. Unleash American energy NOW!","date":"Mon Mar 07 14:34:05 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, Senator Shelby! This incredible grant will have huge impacts on south Alabamians for years to come by ensuring Mobile continues growing as a major transportation hub and economic powerhouse for all of Alabama.","date":"Thu Mar 03 18:41:04 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today the Keystone pipeline was officially cancelled. When I got gas this afternoon, I paid over $1 more per gallon than I did 6 months ago. \n\nWhat’s President Biden doing about it? Meeting with Putin to help keep his pipeline going. https://t.co/F15e5PRT14","date":"Thu Jun 10 00:26:22 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The People’s House should be open to the public, but Pelosi has kept it locked up for more than 700 days. \n\nI’m proud to cosponsor a resolution to reopen the Capitol to the American people NOW!","date":"Thu Mar 03 13:05:38 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"If @POTUS really wanted to counter Russia, he would end his assault on American energy and end our reliance on Russian oil!","date":"Wed Mar 02 02:20:56 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@GrnATM91 I agree. I actually just cosponsored legislation to unleash American energy and end our dependence on foreign oil. I’ve been fighting Biden’s war on American energy since I took office last year.","date":"Tue Mar 01 20:19:59 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm proud to be a cosponsor of this legislation to cut off Putin's cash flow and end our reliance on foreign oil.\n\nLet's unleash American energy!","date":"Tue Mar 01 17:44:01 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in at 10 this morning! 📻","date":"Mon Feb 28 14:07:50 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I agree! The Biden admin should reverse its ban on domestic oil and gas lease sales so we can end this reliance on Russia. Unleash American energy now!","date":"Fri Feb 25 17:36:27 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"As I told Neil Cavuto on @FoxBusiness - How did we know ahead of time what Putin was planning but decided to react after the fact?\n\nWe need strong leadership, but we’re not getting it from @POTUS.","date":"Fri Feb 25 15:33:50 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The United States stands with the people of Ukraine and our NATO allies, and I strongly urge @POTUS to enact the toughest possible sanctions to cripple Russia and prevent them from continuing unprovoked attacks. (2/2)","date":"Thu Feb 24 16:30:31 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Putin’s invasion of Ukrainian sovereign territory is an act of pure evil, and he should be met with resolve and strength to support #Ukraine and its people. (1/2)","date":"Thu Feb 24 16:30:31 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Please join me in praying for the people of Ukraine.","date":"Thu Feb 24 03:28:20 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"We learned months ago about Russia’s plans to invade Ukraine, but President Biden did nothing. Now, he’s reacting and showing weakness on the world stage, just like he did with Afghanistan. \n\n@FoxBusiness https://t.co/2tzveHRgZo","date":"Wed Feb 23 18:40:11 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"COMING UP: I’ll be joining Coast to Coast on @FoxBusiness this afternoon at 11:40c/12:40e to discuss the latest developments with Russia’s invasion of Ukraine.","date":"Wed Feb 23 16:09:20 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It was an honor to meet with Israeli leaders - including @IsraeliPM and @netanyahu - to discuss our shared committment to a strong and secure Israel. https://t.co/7vcW4pJJ2I","date":"Tue Feb 22 14:46:21 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy President’s Day! https://t.co/P2XlMsqyEe","date":"Mon Feb 21 14:53:34 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Jim was a great friend and colleague, and he will be missed. Please join me in keeping his family and friends in your prayers as they navigate this difficult time.","date":"Fri Feb 18 13:49:20 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm on with @fmtalk1065 now discussing the Canada trucker protest, rising inflation, and much more. Be sure to tune in!","date":"Thu Feb 17 18:13:09 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy birthday, Kat! Proud to serve alongside you in Congress. https://t.co/Qly0dNdEi0","date":"Wed Feb 16 19:43:04 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Trump was right and the national media has been complicit in this massive scandal. \n\nEvery American should be outraged!","date":"Mon Feb 14 16:56:15 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Inflation hasn’t been this high since Tina and I got married more than 40 years ago! https://t.co/2e8whdYS3x","date":"Fri Feb 11 15:36:19 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It’s critical to our national security and economic growth to utilize more of America’s vast mineral resources instead of importing them from other countries such as China. I’m excited to see us moving in the right direction! https://t.co/T2no8w3noN","date":"Fri Feb 11 01:03:32 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The results of failed leadership by President Biden and his liberal allies in Congress:","date":"Thu Feb 10 14:55:49 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Fentanyl is flowing across our open borders and is now the leading cause of death for Americans aged 18-45.\n\nWhy is Speaker Pelosi blocking legislation to stop this from happening? Let's fix this problem NOW!","date":"Tue Feb 08 15:54:43 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Americans deserve answers for why taxpayer dollars continue flowing to help fund research at the Wuhan Institute!","date":"Mon Feb 07 21:55:45 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just voted NO on the Democrats’ bill to strengthen China and weaken America because it gives billions to a UN slush fund and does nothing to hold China accountable for COVID. We need to be tough on China!","date":"Fri Feb 04 16:42:21 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#AL01 - Please be weather aware this afternoon and evening.","date":"Thu Feb 03 22:32:32 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It was great catching up with y’all!","date":"Thu Feb 03 21:25:34 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":".@MainStreetAl is working hard to revitalize communities all across Alabama. Their efforts in #AL01 alone have created 300 jobs and 115 new businesses, bringing more than $17 million of private and public investment to our district! https://t.co/vBeliH3iAH","date":"Wed Feb 02 16:44:58 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Congressman Jo Bonner has devoted his life to serving our state, and I can’t think of anyone more qualified to be @UofSouthAlabama’s new president. I enjoyed catching up with him and hearing about his vision for South! #GoJags https://t.co/qoXrkfRxrb","date":"Tue Feb 01 20:46:29 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On this day in 1865, Abraham Lincoln signed a resolution that later became the 13th Amendment to the U.S. Constitution, ultimately outlawing slavery in the U.S. Today, it serves as a reminder that we are forever a nation committed to freedom for all. #NationalFreedomDay https://t.co/BwwkVBovKv","date":"Tue Feb 01 14:02:00 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Big news for #AL01!  https://t.co/gorhmtDDFF","date":"Mon Jan 31 18:24:26 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Proud to join @SenShelby, @SenTuberville, @GovernorKayIvey, and @MayorStimpson this morning to announce a partnership between @AirbusInTheUS and @LockheedMartin to build the LMXT tanker for the Air Force right here in Mobile, AL! https://t.co/ZXa44CN175","date":"Mon Jan 31 15:36:50 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden is putting the safety and security of Americans last.","date":"Thu Jan 27 18:40:45 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"America is moving in the wrong direction with the Biden Administration in control.","date":"Thu Jan 27 15:20:52 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"We must never forget. #HolocaustRemembranceDay https://t.co/HoLKiuco92","date":"Thu Jan 27 14:52:51 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy birthday, @GOPLeader! https://t.co/Ca6hOa2Nxk","date":"Wed Jan 26 19:05:40 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"We're now considering sending over 8,000 American troops to Eastern Europe because our President has been absent on the world stage.\n\nPresident Biden's foreign policy blunders are putting American lives at risk.","date":"Wed Jan 26 17:10:07 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden has known for MONTHS about the growing threat of Russia in Ukraine, but simply ignored the problem. Now, he's leading from behind with knee-jerk solutions like sending troops into the region.","date":"Tue Jan 25 19:00:02 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@OutsideBoxBob U.S. Customs and Border Patrol:\n\nhttps://t.co/pq4oMzcCqc","date":"Tue Jan 25 17:26:45 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden’s border crisis continues shattering records! Last month was the worst December on record with 178,840 illegal crossings. \n\nSince Biden took office, nearly 2 MILLION illegal immigrants have tried to cross our southern border. Build the wall now!","date":"Tue Jan 25 16:46:27 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"When President Biden said he's the only one who will go \"toe-to-toe\" with Putin, he must have been talking about dancing with him because he certainly wasn't talking about applying military pressure. \n\nBiden is showing no leadership! https://t.co/oYt47xeRT0","date":"Mon Jan 24 16:55:53 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’ll be going on @newsmax in just a few minutes to discuss President Biden’s handling of Russia and Ukraine. Tune in!","date":"Mon Jan 24 14:47:45 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Federal laws do more to protect 40 types of clams and 64 types of snails in AL than they do to protect the rights of unborn children. \n\nMy @HouseGOP colleagues and I are fighting to change this. We are proudly pro-life! https://t.co/DcrldKzio4","date":"Fri Jan 21 15:55:08 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It’s great to see so many pro-life young people in DC today, even though the wind chill is 6 degrees!\n\nAll life is made in God’s image, and we have a duty to protect it. This is #WhyWeMarch https://t.co/HfxqBQX8Vo","date":"Fri Jan 21 15:49:08 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Joining my @HouseGOP colleagues to discuss President Biden’s leadership failures in the last year and offer some simple, common-sense solutions to put America back on track. https://t.co/gjpRb14Xuf","date":"Thu Jan 20 16:43:47 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I enjoyed the visit! #al01","date":"Thu Jan 20 15:26:32 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Senate did its job instead of caving to your radical, partisan agenda.","date":"Thu Jan 20 03:55:59 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Joe Biden says he's \"outperformed what anyone thought would happen,\" but 67% of Americans strongly disagree!","date":"Wed Jan 19 21:27:09 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm now on GETTR and Rumble @RepJerryCarl, so make sure you are following me on both!","date":"Wed Jan 19 20:11:04 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm proud to have earned an A+ on @SBAList's pro-life scorecard. I'll ALWAYS protect the rights of the unborn. #WhyWeMarch https://t.co/bw4auypcnM","date":"Wed Jan 19 17:06:50 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, President Biden is holding his first press conference in MONTHS. What issue would you most like for him to discuss?","date":"Wed Jan 19 14:36:10 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden's first year in office has been marked by failure and broken promises. One of his biggest failures is his refusal to secure our southern border and stop the flow of illegal drugs into our communities. Build the wall now!\n\n@RepublicanStudy https://t.co/7EYzO7DqOc","date":"Wed Jan 19 01:21:59 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, we honor the life of Dr. Martin Luther King Jr. He was a true visionary and a steadfast leader who dedicated his life to making our country a better place. #MLKDay https://t.co/8IRaksC2IT","date":"Mon Jan 17 16:31:15 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tonight at 7 CT, #AL01’s Master Boat Builders will be featured on Dirty Jobs with @mikeroweworks! \n\nTune in on @Discovery or @disneyplus as Mike Row showcases how important Gulf Coast shipbuilding is for our domestic and national security. https://t.co/MpxXhXlYSb","date":"Sun Jan 16 19:06:56 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Bidenflation Stole Christmas: December Retail Sales Crash as High Prices and Shortages Weigh on Consumers. \n\nhttps://t.co/yv3TevosKJ","date":"Fri Jan 14 16:46:52 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Space Command belongs in the Rocket City! \n\nhttps://t.co/4kBv7Dc0bw","date":"Thu Jan 13 21:42:52 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"What does NASA have to do with election laws? NOTHING! Democrats are doing all they can to maintain their grip on power, but the American people are smart enough to see through this shell game.","date":"Thu Jan 13 15:23:50 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, Democrats are sneaking an amendment into a NASA bill so they can take control of state election laws and strip states of their Constitutional right to run their own elections.","date":"Thu Jan 13 15:23:50 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’ll always be a #RollTide fan, but a bet is a bet. You win, @RepBuddyCarter! https://t.co/75tnKOamts","date":"Tue Jan 11 19:07:01 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Read this week’s column to find out what Congress is working on this year!","date":"Tue Jan 11 16:00:41 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I agree!","date":"Mon Jan 10 21:53:44 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#RollTide","date":"Sun Jan 09 21:35:08 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"THANK YOU to our men and women in law enforcement! https://t.co/ZcOHi7FDxe","date":"Sun Jan 09 16:55:35 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"You’re on, @RepBuddyCarter! I even bought you your own @AlabamaFTBL shirt to wear. #RollTide https://t.co/GN1n4KjKqa","date":"Sat Jan 08 19:29:44 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"One year ago today, I was sworn in to represent #AL01 in Congress. \n\nIt’s been the honor of a lifetime serving the people of south Alabama, and I can’t wait to continue the work we’ve started as we begin 2022! https://t.co/2xVnuVKCp4","date":"Mon Jan 03 14:52:17 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy New Year!","date":"Sat Jan 01 06:01:14 +0000 2022","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The #VIPAct has been signed into law! I am proud to support this bill which ensures our veterans and Gold Star Families get free access to our national parks. https://t.co/YlCYNrL3jc","date":"Tue Dec 28 19:07:41 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Since President Biden believes “there’s no federal solution” to COVID, he should pull back his unconstitutional vaccine mandates.","date":"Mon Dec 27 22:50:31 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@kaikahele Get well soon, Kai! Glad to hear your symptoms are mild.","date":"Sun Dec 26 21:39:15 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Merry Christmas from my family to yours! 🎄 https://t.co/F2V762CdZM","date":"Sat Dec 25 13:10:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Merry Christmas Eve, everyone! 🎄","date":"Fri Dec 24 18:07:36 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I had a wonderful meeting today with several board members of the Associated General Contractors of Alabama. Labor shortages were our main topic of conversation. https://t.co/QfjQ4cMn74","date":"Tue Dec 21 21:55:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy 2nd birthday to @SpaceForceDoD! Thank you for all you do to keep our country safe.","date":"Mon Dec 20 16:15:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Maybe it’s from your party’s constant push to defund the police?","date":"Thu Dec 16 16:50:01 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just introduced legislation to protect and preserve an ancient underwater forest off the coast of Alabama.\n\nEnabling folks to fish, dive, and explore this site for generations to come will create tourism opportunities and be a huge boost to our local economy!","date":"Thu Dec 09 16:05:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m excited the NDAA passed yesterday!\n\nThis bill includes ships to be built @Austal_USA, plus it’s a huge win for our service members &amp; national security. \n\nIt does NOT include any “red flag” laws or any requirements for women to register for the draft. \n\nhttps://t.co/NXJNFGE7U0","date":"Wed Dec 08 16:57:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Congratulations to @AlfaFarmers for 100 years of leading the way to advance Alabama’s agriculture industry! I couldn’t be prouder of the work our farmers and the Federation do to feed, fuel and clothe our country.","date":"Tue Dec 07 22:04:36 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today we pause to honor the 2,403 Americans who lost their lives at Pearl Harbor on this day 80 years ago. We will always remember the courageous sacrifices they made to defend our freedom for generations to come. #PearlHarbor80 https://t.co/2k1xb73rqe","date":"Tue Dec 07 17:38:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great explanation of HR 550. \n\nIt DOES NOT create a new vaccine database. \n\nIt DOES restrict the federal government from tracking your personal data. \n\nIt DOES improve data security and privacy protection. \n\n https://t.co/cZl0OIJiCS","date":"Mon Dec 06 18:38:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, Governor Ivey! I'm proud to stand with you in opposition to ANY federal vaccine mandate.","date":"Fri Dec 03 16:31:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The November jobs report is another \"huge miss.\" \n\nMake no mistake - families across America are being hurt by President Biden and Democrats' failed economic policies.","date":"Fri Dec 03 16:14:29 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just joined @LibertyU President Jerry Revo, hundreds of his students, and countless others to show my support for the pro-life movement today as @Scotus hears a major pro-life case. I’m proud to stand for life! https://t.co/mCjbJgLIJT","date":"Wed Dec 01 16:02:46 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Guess what the Democrats hid in their big government spending bill?\n\nMass amnesty for 6.5 million illegal immigrants!","date":"Tue Nov 30 18:21:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you @SaralandSchools for allowing me to start my Monday morning off by speaking to some of your students. What an impressive group of young folks! I’m convinced our future is bright. https://t.co/fl4WtxMPJd","date":"Mon Nov 29 15:21:58 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Shutting down American pipelines and waging war on domestic energy production is unacceptable.","date":"Wed Nov 24 22:02:13 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"First the far left started calling for defunding the police, but now they've taken it a step further with wanting to get rid of bail and prisons. We are a country of law and order!\nhttps://t.co/l2BUXctOE3","date":"Tue Nov 23 23:20:34 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Petroleum Reserve is designed for national emergencies and is NOT a legitimate, long-term fix.\n\nIf @POTUS really wanted to lower gas prices, he would end his assault on American energy production and open our pipelines now!","date":"Tue Nov 23 16:30:15 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m on with Jeff Poor discussing the Democrats’ terrible “Build Back Better Act.” Tune in now!","date":"Tue Nov 23 15:38:31 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"https://t.co/8PaQ1l5P1T","date":"Mon Nov 22 19:31:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"My heart is heavy tonight seeing the news out of Waukesha. Please join me in praying for the victims of this tragedy, as well as the their family and friends.","date":"Mon Nov 22 01:31:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@kaikahele Happy Thanksgiving to you and your family!","date":"Sun Nov 21 03:24:40 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Kai and I don’t always agree on policy, but he’s a good family man and a good friend.  It’s members like him across the isle that remind me we are all Americans.","date":"Sun Nov 21 02:56:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, @GOPLeader McCarthy, for fighting the Democrats’ efforts to bankrupt America and saddle hardworking families with higher taxes. \n\n#BuildBackBetter is a BAD deal! \n\nhttps://t.co/ryBqLluvLt","date":"Fri Nov 19 12:57:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"That’s a lie. Even CNN knows better… https://t.co/7Qf21AbIEp","date":"Fri Nov 19 02:15:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy birthday to my friend, @NatResources Ranking Member Bruce Westerman! Thank you for your leadership on the committee, plus your efforts to help me protect Alabama’s red snapper season. https://t.co/pbR4mhTxVs","date":"Fri Nov 19 00:05:24 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"There's a TON of junk in the Democrats' so-called Build Back Better agenda. \n\nWhat's not in it, though? The Bipartisan Hyde Amendment, which has prevented taxpayer dollars from funding abortion for 40 years.\n\nThis is flat out WRONG!","date":"Thu Nov 18 20:24:13 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"If you’re a student or if you’re looking for a new career, I strongly encourage you to check out one of the many incredible apprenticeship programs we have in Alabama! #NationalApprenticeshipWeek https://t.co/cnSoC3Kb9C","date":"Thu Nov 18 20:12:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is great news for #al01! It's a direct result of pressure my colleagues and I began putting on the Biden Admin back in June. The fight against Biden's war on American energy is not over, but I'll continue my work to protect future lease sales for years to come. https://t.co/OEYxeB8J84","date":"Wed Nov 17 17:10:49 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"If you chose 8 million, you are correct! \n\n\"Build Back Better\" would also give these illegal immigrants billions of dollars in government handouts. We must stop this from passing!","date":"Wed Nov 17 16:35:34 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Do you know how many illegal immigrants would be granted mass amnesty under the Dems’ “Build Back Better” plan? Take a guess below 👇🏼","date":"Tue Nov 16 21:34:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Democrats get creative with names like “Build Back Better,” but let’s be realistic. \n\nThis is a big government takeover that will expand the IRS, raise taxes, create 150 new government programs, and grant amnesty to MILLIONS of illegal immigrants. This is BAD for America!","date":"Tue Nov 16 18:18:13 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#Bidenflation has knocked the price of an All Star Special out of the park! https://t.co/a4x9gs71rW","date":"Fri Nov 12 17:51:04 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":".@POTUS has already shattered records during his first 10 months in office:\n\n🚨 Highest ever number of illegal border crossings \n🚨 Highest inflation in 31 years \n🚨 Highest gas prices in over a decade \n\nPresident Biden has turned his back on the American people!","date":"Wed Nov 10 16:34:16 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#Bidenflation","date":"Wed Nov 10 16:13:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy 246th birthday to the @usmc! We are so thankful for the men and women who have heard the call to defend our country and the freedoms we have enjoyed for so many years. Thank you for your service to our great nation! #SemperFi https://t.co/Qg7f304c7m","date":"Wed Nov 10 15:13:49 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#Bidenomics is driving prices through the roof and it’s hurting working families all across the nation!\n\nhttps://t.co/AdYI5UxcAi","date":"Tue Nov 09 18:25:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great news! President Biden’s mandates are unconstitutional.","date":"Sat Nov 06 21:27:14 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Late last night, I voted NO on the Pelosi/Biden “infrastructure” bill because less than 10% of this massive bill will go toward actual infrastructure projects like roads, bridges, ports, and waterways. It’s time to get serious about real investments in our infrastructure!","date":"Sat Nov 06 14:46:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"You're right, @michaelcburgess! The American people really are wondering what in the heck Congress is doing today. Trying to ram through a bill without even determining its total cost to the taxpayer is absurd. https://t.co/ZPts4w5Yz6","date":"Fri Nov 05 16:12:22 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m fighting to stop the IRS from hiring more desk poppers, but Democrats plan to give them BILLIONS to hire MORE armed agents. https://t.co/T6ne9aJuee","date":"Fri Nov 05 15:40:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The IRS’s army of 2,000 armed agents fire their weapons on accident more often than they do on purpose, which endangers the lives and property of Americans. Read more about my efforts here ➡️ https://t.co/CGUyNIafGj","date":"Fri Nov 05 15:40:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you for having me! I enjoyed our conversation.","date":"Thu Nov 04 18:53:36 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The #BidenBorderCrisis is getting worse by the day, and Democrats are about to make it even worse with some of the awful proposals in their so-called \"Build Back Better\" plan. @RepKatCammack has been to the border many times, so I sat down with her to discuss this crisis. https://t.co/QmgY3CsYMv","date":"Thu Nov 04 17:41:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m a proud supporter of our farmers, ranchers, and foresters! Thank you for taking the time to meet with me today.","date":"Wed Nov 03 20:18:40 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Democrats' multi-trillion dollar big government spending bill would increase the cost of health care and prescription drugs! I sat down with @RepBuddyCarter to discuss why this is BAD for Americans. https://t.co/E7sOyVXqP1","date":"Wed Nov 03 17:09:30 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"What exactly is in the Democrats’ multi-trillion-dollar big government spending bill? Stay tuned as I sit down with some of my colleagues this week to discuss why this bill is BAD for America! https://t.co/vOJOE2YBF5","date":"Tue Nov 02 20:11:38 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The LAST thing we need is thousands more IRS agents invading our privacy!","date":"Wed Oct 27 19:25:58 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"You can read more about this bill here: https://t.co/jL6kJfVzJw","date":"Wed Oct 27 14:58:28 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This bill passed the Senate unanimously last week and has HUGE bipartisan support in the House, but Nancy Pelosi is completely focused on raising your taxes, expanding the federal government, and bankrupting America!","date":"Wed Oct 27 14:58:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Yesterday, I joined a bipartisan group of colleagues to introduce a bill to allow states to spend unused, leftover COVID relief money on critical infrastructure projects but @SpeakerPelosi refuses to let us vote on it!","date":"Wed Oct 27 14:58:26 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in now!","date":"Tue Oct 26 18:34:51 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m right there with you, Will!","date":"Tue Oct 26 14:30:45 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, @GovernorKayIvey, for pushing back on this ridiculous overreach by the Biden Administration! I’ll continue standing with you to fight ANY efforts to infringe on the rights of Alabamians.","date":"Tue Oct 26 00:04:45 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is disgusting! I called on @POTUS to fire Fauci back in June, and this is just one more reason why he needs to be gone TODAY.","date":"Mon Oct 25 19:51:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"ICYMI: I sent a letter to @POTUS yesterday DEMANDING answers and action to fix the immigration crisis he’s created. \n\nBorder security is national security, and we must protect the health and safety of American citizens! https://t.co/3AEKvLJQDC","date":"Thu Oct 21 13:45:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"🚨 🚨 🚨 \n\nThis morning I sent a letter to @POTUS demanding answers and action to address HIS illegal immigration crisis. \n\nOctober is on track to have the largest number of apprehensions in American history. Secure our border NOW, Mr. President! https://t.co/FSK1FrfQsT","date":"Wed Oct 20 14:13:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The IRS has no business spying on your bank account!","date":"Tue Oct 19 13:51:31 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden's anti-American energy policies are costing you WAY MORE to fill up at the pump. My @HouseGOP colleagues and I are fighting back and urging @POTUS to empower American energy producers so we can drive gas prices down!","date":"Tue Oct 19 13:48:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you @RepCarolMiller for your leadership on this! You can view our letter to President Biden here: https://t.co/dornixEV2d","date":"Tue Oct 19 13:48:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Gen. Powell lived a life of extraordinary service to our nation, and we are forever grateful to him. Join me in praying for comfort for his family and friends.","date":"Mon Oct 18 12:50:02 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy birthday, @GovernorKayIvey! Thank you for all you do for Alabama. https://t.co/jywxRgimSl","date":"Fri Oct 15 15:55:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Go Jags!","date":"Fri Oct 15 04:15:48 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@RepYoungKim Congrats!","date":"Wed Oct 13 09:54:42 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Did you know #al01’s roughly 3,000 farms have a $12.8 billion economic impact and support more than 100,000 jobs? On today’s #NationalFarmersDay, be sure to thank a farmer! https://t.co/oAWYiO01q8","date":"Tue Oct 12 14:32:41 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to be a strong supporter of our agriculture community in #al01! Thank you for an educational day.","date":"Mon Oct 11 21:01:33 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy birthday to my good friend and colleague ⁦@SteveScalise⁩! https://t.co/YDYkAafF3A","date":"Wed Oct 06 22:33:56 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Congrats, @Austal_USA! This is great news for #al01.","date":"Wed Oct 06 12:58:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Divider-in-Chief","date":"Tue Oct 05 20:57:23 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m at @Austal_USA with @RepMikeRogersAL getting a look at the world-class ships they are building right here in #al01. https://t.co/mUZONwMpzm","date":"Tue Oct 05 20:33:48 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I enjoyed seeing the new library and am proud to be a continued supporter!","date":"Mon Oct 04 23:17:37 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"BREAKING: Joe Biden brings oil prices back to the highest level since the last time he was in office.","date":"Mon Oct 04 14:00:11 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Chuck Schumer and his liberal Senate allies are working hard today to confirm a dangerous nominee to lead @BLMNational. Tracy Stone-Manning is BAD for rural America. I urge @SenateDems to reject her nomination!","date":"Thu Sep 30 15:34:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great evening with @SenTuberville! We are working hard together to serve Alabama and be conservative voices in Washington. https://t.co/yeuKSDFXQ1","date":"Wed Sep 29 23:10:33 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@LeagueofSECUs @BlakeWestbrook @sydneyyyevans Thank you for stopping by my office!","date":"Wed Sep 29 20:40:13 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Welcome to DC! I’m glad to have the opportunity to join you live on @fmtalk1065 to discuss the House Armed Services hearing today about the fallout in Afghanistan. https://t.co/lCAccME837","date":"Wed Sep 29 17:38:07 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I had a great meeting with @AuburnU President Jay Gogue and members of Auburn’s Board of Trustees to discuss ways we can work together to continue fueling growth all over Alabama. War Eagle! 🦅 #BeatLSU https://t.co/8cbzWDDYIn","date":"Wed Sep 29 15:47:54 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m live on @newsmax with @CortesSteve and @JennPellegrino discussing President Biden’s botched withdrawal from Afghanistan. Tune in now 📺","date":"Wed Sep 29 01:19:36 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just stopped by @ProcterGamble’s Pack a Relief Kit event to help them pack boxes to assist people affected by natural disasters across the globe. https://t.co/jRJwMAeQU3","date":"Tue Sep 28 21:32:54 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Americans are smart enough to see through President Biden’s attempts to smear law enforcement officials and distract from the border crisis he’s created. It’s time to finish the wall, give our Border Patrol agents the resources they need, and secure our border.","date":"Tue Sep 28 16:36:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’ll be going on @fmtalk1065 with Sean Sullivan at 12:30 this afternoon to discuss the current status of the national defense bill (NDAA) Congress is working on.","date":"Mon Sep 27 17:12:34 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Your word is about as worthless as it gets. So far you’ve lied about supporting law enforcement, crushing COVID, strengthening the economy, and mandating vaccines.","date":"Mon Sep 27 15:14:04 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm proud to be 100% pro-life, and I will continue fighting ANY efforts to take away the rights and protections of unborn children.","date":"Fri Sep 24 14:14:11 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Pro-abortion radicals in Congress are working hard this morning to strip unborn children of even the most basic protections. I am STRONGLY opposed to their Abortion on Demand Act.","date":"Fri Sep 24 14:14:10 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It was a pleasure spending some time with y’all today! Thank you for the virtual tour.","date":"Thu Sep 23 19:32:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"When will President Biden show up to work and address this crisis? He hasn't even visited the border! https://t.co/0siTcmsCKO","date":"Thu Sep 23 14:24:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Unbelievable. I’m proud to #StandWithIsrael 🇮🇱","date":"Tue Sep 21 19:54:34 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden’s border crisis continues","date":"Mon Sep 20 20:09:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"He should’ve gone months ago! Ive visited the border with many of my @HouseGOP colleagues. We’ve been fighting to secure the border and get this situation under control, but Democrats are unwilling to make border security a priority. \n\nhttps://t.co/jSyygRD7YF","date":"Mon Sep 20 17:01:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy #ConstitutionDay! On this day 234 years ago, our Founding Fathers signed the greatest governing document in the world.  \n\nI’m proud to fight everyday in Congress to protect and preserve our fundamental rights for generations to come. 🇺🇸 https://t.co/WsDiAvLo7b","date":"Fri Sep 17 15:57:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great news for @Austal_USA!","date":"Thu Sep 16 20:28:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you for putting together such an important event!","date":"Thu Sep 16 17:39:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This morning I’m hosting a roundtable on the role of Gulf energy and its impacts on Coastal Alabama with @GovernorKayIvey’s office, state reps, local mayors and commissioners, and reps from local chambers of commerce. https://t.co/6ysoJZdBpr","date":"Thu Sep 16 14:39:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"An anniversary worth celebrating. Proud of American, Israeli, Bahraini, and Emirati leadership in working towards a peaceful and prosperous Middle East.","date":"Wed Sep 15 21:01:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I stopped by Rodriguez Shipbuilding to see the progress they’re making on a 78-foot tug. They’ve been building world class ships right here in #al01 for more than 40 years! https://t.co/kUM8xMgutr","date":"Mon Sep 13 15:54:07 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, we pause to honor the lives of the 3,000 Americans who lost their lives 20 years ago. Despite these terrorist attacks, the American spirit prevailed. May God continue to bless America, and may we #NeverForget https://t.co/khf6XxcnZU","date":"Sat Sep 11 12:44:06 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Biden Administration’s attacks on private businesses demonstrate just how far they’re willing to go to infringe on your personal liberties. This is simply a distraction from all the crises he has created. \n\nhttps://t.co/CX4FoByoFb","date":"Thu Sep 09 21:51:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is GREAT news for our #2ndAmendment rights!\n\nhttps://t.co/0peQ8qIxWu","date":"Thu Sep 09 14:19:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happening today from 9-2! My office will be there to assist any veterans in need.  \n\nhttps://t.co/8XTtXwpJC9","date":"Wed Sep 08 14:26:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy Labor Day!","date":"Mon Sep 06 15:56:29 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"You’ve been in office 8 months. Time to take some responsibility for your failures and quit blaming everyone else.","date":"Fri Sep 03 16:25:04 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"\"An amendment proposed by Rep. Jerry Carl (R-Ala.), who represents Mobile, authorized an additional $270 million for a second Expeditionary Fast Transport (EPF) ship. Mobile is home to Austal USA, which builds the EPF.\"\n\nhttps://t.co/x21Lra8Oig","date":"Thu Sep 02 19:58:13 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m on @fmtalk1065 right now with Sean Sullivan talking about how @HASCRepublicans successfully pushed back on President Biden’s WEAK defense budget. I’m especially proud to have secured two more ships to be built at @Austal_USA right here in #al01.","date":"Thu Sep 02 17:20:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"While Americans are already paying higher prices for gas, Democrats are pushing Green New Deal climate policies which will drive gas prices even higher. I’m in a @NatResources meeting today fighting back against this nonsense. https://t.co/R76aOh6fKt","date":"Thu Sep 02 15:55:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Unacceptable. President Biden is lying to us again, and we deserve to know the truth.","date":"Thu Sep 02 02:10:54 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Apparently this is what President Biden views as an \"extraordinary success.\"","date":"Wed Sep 01 20:16:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"VP Harris also has her own telltale sign before lying https://t.co/w4BRXpgpLj","date":"Wed Sep 01 16:53:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"If only he was this tough on the Taliban.","date":"Wed Sep 01 16:48:46 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden is a liar. He is taking credit for the raid that killed Bin Laden, but he OPPOSED the raid. Unreal!","date":"Tue Aug 31 19:47:46 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Anything less than 100% is unacceptable.","date":"Tue Aug 31 19:35:54 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Why is President Biden late to every single press conference?","date":"Tue Aug 31 19:06:16 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm a proud cosponsor of this bipartisan legislation. The world is a better, safer place because of our servicemembers who have served in Afghanistan. May we never forget their sacrifices to fight terrorism and protect America.","date":"Tue Aug 31 18:29:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, I cosponsored a resolution calling on President Biden to resign immediately. He has proven himself to be unfit to lead our nation and serve as our Commander in Chief. https://t.co/XVJK4kuR5T","date":"Tue Aug 31 17:33:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"You’ve got to be kidding me. You’re asking the Taliban - the group that harbors al-Qaeda, brutally murders innocent civilians, and doesn’t allow women to go to school or work - to form a more “inclusive” government??","date":"Tue Aug 31 02:54:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"NEVER in my lifetime did I think I’d hear this from our military leadership. This is inexcusable and un-American.\n\nLeadership starts at the top, @POTUS, and you’ve completely failed.","date":"Tue Aug 31 01:06:33 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"We will never forget the thousands of service members and civilians who paid the ultimate sacrifice in Afghanistan to root out terrorism and protect our homeland. Because of them, the world is a better, safer place.","date":"Mon Aug 30 19:42:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Stay safe #al01","date":"Mon Aug 30 17:31:45 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Please keep everyone in the path of #HurricaneIda in your prayers.","date":"Sun Aug 29 13:44:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Folks, please stay weather aware as Ida approaches the Gulf Coast this weekend. \n\nI’ve been in contact with our local mayors and @AlabamaEMA as we monitor the storm’s progress, and I’ll continue to share any relevant updates with everyone.","date":"Fri Aug 27 18:26:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Where is our Commander in Chief? When will we hear from him?","date":"Thu Aug 26 19:19:23 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Please keep our troops and our allies in your prayers.","date":"Thu Aug 26 14:21:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden is a coward for bending the knee to the Taliban and letting them dictate our foreign policy. He has endangered American lives and has destroyed American credibility on the world stage.\n\n@CortesSteve @JennPellegrino https://t.co/8o95MaI1En","date":"Thu Aug 26 13:54:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is great!","date":"Wed Aug 25 20:17:02 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"While the crisis at our southern border continues raging and President Biden refuses to take action to ensure Americans &amp; allies in Afghanistan are brought to safety, House Democrats are hell-bent on raising taxes on hardworking American families and exploding our national debt.","date":"Wed Aug 25 18:58:02 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I've seen the border with my own eyes, and Biden's reversal of Trump's \"Remain in Mexico\" policy created a massive crisis. Great decision by the Supreme Court!\n\nhttps://t.co/pFnXaTfs3q","date":"Wed Aug 25 17:45:40 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"How many of these 70,700 are American citizens and how many Americans are left?","date":"Tue Aug 24 22:27:15 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is absolutely unacceptable. We still have Americans on the ground depending on our troop presence.","date":"Tue Aug 24 19:36:03 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Please join me in praying for @Robert_Aderholt and his family as they deal with the loss of Judge Bobby Aderholt.","date":"Tue Aug 24 19:33:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Unbelievable weakness from President Biden. What a disaster.","date":"Tue Aug 24 17:29:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I joined @SteveScalise and my @HouseGOP colleagues today to discuss the crisis President Biden has created by withdrawing from #Afghanistan and abandoning Americans and American allies in the region.  We cannot leave a single American behind!","date":"Tue Aug 24 15:33:41 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I sure hope she handles this better than she’s handled the crisis at our southern border.","date":"Fri Aug 20 17:59:58 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The news out of Afghanistan has been especially tough on so many Afghanistan veterans and their family members. If you need help, the Veterans Crisis Line is a free, confidential resource. You can call, text, or visit them online: \n\nhttps://t.co/ZUE7h0BVK5","date":"Thu Aug 19 15:29:58 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happening tonight!","date":"Wed Aug 18 21:16:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Not a SINGLE American should be left behind!","date":"Wed Aug 18 18:43:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"When will President Biden return from vacation and brief Congress on his plans to bring Americans and American allies in #Afghanistan to safety? \n\nhttps://t.co/B0q8XjtbEy","date":"Wed Aug 18 16:14:35 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Why has @POTUS not spoken to a SINGLE world leader about the catastrophe in #Afghanistan?","date":"Tue Aug 17 20:04:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Unbelievable. Our first priority should be ensuring the safety and security of every American in Afghanistan, but the Biden Administration refuses to commit to doing so.","date":"Tue Aug 17 18:37:51 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden’s speech on #Aghanistan was a horrible disappointment and demonstrates his inability to lead. The men and women who risked their lives serving our nation in Afghanistan deserve better than this.","date":"Mon Aug 16 20:21:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden’s address to the nation right now is nothing more than him placing the blame for HIS failed withdrawal from #Afghanistan on everyone but himself. Unacceptable.","date":"Mon Aug 16 20:10:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in today at 12:30 CST as Sean and I discuss the situation in #Afghanistan","date":"Mon Aug 16 17:05:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Mr. President, you have allowed the Taliban to seize control of Afghanistan and humiliate the United States on the global stage. \n\nReturn from vacation and get to work. The world is watching.","date":"Sun Aug 15 17:02:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The number of illegal crossings in July equals the population of Huntsville, and the crossings in June equal the population of Mobile. Over 1 MILLION crossings so far this year!\n\nMeanwhile, President Biden is vacationing. https://t.co/86uRpGvS5r","date":"Fri Aug 13 19:01:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm proud to work across the aisle on legislation to put our seniors first by ensuring they have more affordable, accessible health care options!","date":"Thu Aug 12 17:38:33 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Trump brought us American oil independence, but now President Biden is pushing us to foreign oil dependence. \n\nBiden continues to put America last!","date":"Wed Aug 11 20:48:13 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thanks to the continued #bidenflation, Americans are paying more for food, housing, vehicles, and just about everything else. President Biden is crippling the working class.","date":"Wed Aug 11 12:53:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Might want to consider deleting this tweet.","date":"Tue Aug 10 17:04:02 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you for your leadership on this! I’m proud to support our service members, veterans, and Gold Star Families with the #VIPAct.","date":"Fri Aug 06 17:26:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"No COVID precautions if they come across the southern border illegally, though.","date":"Thu Aug 05 14:24:01 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I love this! 🇺🇸 \n\nWe need more folks like #TamyraMensahStock representing the United States at the #Olympics","date":"Wed Aug 04 20:08:49 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The @USCG has kept our waterways safe for 231 years. Today we pause to honor their incredible legacy of service and dedication to American defense interests at home and abroad. Thank you! https://t.co/P9QogD2Qej","date":"Wed Aug 04 18:37:24 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"For months, my @HouseGOP colleagues and I have been calling for an investigation into the CCP’s role in the origins and spread of this virus. The American people deserve answers! \n\nhttps://t.co/8r87cGU3Zf","date":"Mon Aug 02 15:42:45 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, @RepMMM for your leadership on this!","date":"Mon Aug 02 15:12:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"ICYMI: The #VIPAct passed the House with bipartisan support! Active-duty service members, veterans, and Gold Star Families are now one step closer to free access to America's most iconic natural treasures. \n\nhttps://t.co/IGCHBJGrsO","date":"Mon Aug 02 15:12:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"https://t.co/4wXgXtX5t1","date":"Fri Jul 30 23:12:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is awesome! Congratulations, Paige! #TeamUSA \n\nhttps://t.co/jKQUq3faL4","date":"Thu Jul 29 18:38:01 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is a ridiculous abuse of power by Nancy Pelosi. It’s the People’s House, NOT Pelosi’s House!","date":"Thu Jul 29 13:53:36 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is incredible news for the economic growth and connectivity of #al01 and the Gulf Coast as a whole!","date":"Tue Jul 27 20:44:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Don't forget!\n\nTonight, I'll be hosting a live, interactive town hall from 6-7pm CST. I'll be sharing updates from Washington and answering as many of your questions as possible.\n\nYou can dial in at 855-710-6226 or on my website at https://t.co/GpScU7Cp3A.","date":"Tue Jul 27 14:35:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to join @RepMariaSalazar in supporting the people of #Cuba 🇨🇺 as they demand an end to the brutally oppressive Castro regime that has denied them basic freedoms for more than 60 years. https://t.co/NaPM3UBVr1","date":"Mon Jul 26 17:53:22 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in at 11:30 this morning! 🎙","date":"Mon Jul 26 15:17:42 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Biden Administration’s recent comments about censoring certain speech are extremely troubling, so I joined my colleagues in requesting increased transparency from @POTUS   \n\nI am committed to protecting the 1st Amendment rights of everyone in #al01 and across the nation. https://t.co/DvzLaHAp0E","date":"Fri Jul 23 16:39:35 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Proud to work with y’all on this important legislation!","date":"Thu Jul 22 16:25:35 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is the exact reason why I voted against creating the Select Committee on January 6. Pelosi’s decision to deny input from members who have served in the military and law enforcement is a complete abuse of power. This is a shameful partisan witch hunt.","date":"Wed Jul 21 17:56:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@fjreed13 https://t.co/iangsOvcnG","date":"Wed Jul 21 14:53:11 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I got my vaccine, and I encourage everyone to talk to their doctor about getting vaccinated as well.","date":"Wed Jul 21 14:49:56 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"You’re invited! Next Tuesday, I will be hosting another live, interactive telephone town hall from 6:00-7:00pm CST. You can dial in at the number below or join on Facebook. I hope you can make it! https://t.co/WCecfWzqfk","date":"Wed Jul 21 13:52:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"More great news for #al01! Master Boat Builders will be constructing the first all-electric tugboat in the United States at its Coden, AL, yard. \n\nhttps://t.co/e8GkANVct1","date":"Tue Jul 20 20:30:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden’s accomplishments during his first 6 months in office:\n\n✅ 450% increase in illegal immigration\n\n✅ 45% increase in gas prices \n\n✅ Huge surge in murders &amp; violent crimes \n\n✅ 13 million Americans on unemployment \n\n#BidensAmerica","date":"Tue Jul 20 15:26:48 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Taxpayers are footing the bill for this ridiculous publicity stunt.  https://t.co/8qzTRD9Tbq","date":"Mon Jul 19 14:19:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to have worked on this bipartisan effort to protect Baldwin County’s federal grant money! #al01","date":"Fri Jul 16 14:37:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in tonight at 5:00/6:00 EST!","date":"Thu Jul 15 21:29:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"For the past 40 years, the Hyde Amendment has ensured our tax dollars aren’t used to perform abortions, but now President Biden wants to eliminate this critical policy. That’s wrong, and we can’t allow it to happen. #HydeSavesLives https://t.co/ehu7ilwPPA","date":"Thu Jul 15 13:55:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thanks for having me!","date":"Thu Jul 15 13:41:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great visits today in Monroe County! I toured the Monroe County Hospital and held a public town hall in Monroeville. #al01 https://t.co/kjk5Xa4nDe","date":"Mon Jul 12 19:24:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Huge swing and a miss by the Biden State Department here. Cubans aren’t protesting “shortages.” They are protesting 6 decades of a brutal, corrupt, socialist regime. \n\nAmerica stands with the Cuban people as they demand freedom.","date":"Mon Jul 12 12:39:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The wall around Fort Pelosi is FINALLY coming down, but we still need to fully reopen the Capitol to the public. It’s way past time!","date":"Sat Jul 10 19:22:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Taxes ⬆️ \n\nGas prices ⬆️ \n\nInflation ⬆️ \n\nThis is Biden’s America.","date":"Sat Jul 10 16:46:08 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great meetings yesterday in McIntosh, Grove Hill, and Wagarville. I sure love being back home and traveling all over #al01. https://t.co/vMzxDcMdMa","date":"Thu Jul 08 15:03:38 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"My prayers are with you, Jim, as you fight this battle! May God bless you and your family.","date":"Wed Jul 07 19:34:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great opportunity for young Alabamians this fall!","date":"Wed Jul 07 19:27:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"House Democrats care more about making Donald Trump look bad than investigating the origins of a virus that’s killed 600,000+ Americans. Despicable. \n\nhttps://t.co/hEge0gx1Gp","date":"Wed Jul 07 14:07:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy Independence Day! Today, we celebrate the freedoms enjoyed for the last 245 years and renew our commitment to protecting these freedoms for future generations. I’m sure proud to be an American! 🇺🇸 https://t.co/xsgGR96U6t","date":"Sun Jul 04 13:50:56 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Broadband internet access, especially in rural areas, can be a game-changer for consumers and businesses in our state. This will connect more Alabamians while increasing job opportunities and boosting our state’s economy! https://t.co/w9vViFh09y","date":"Fri Jul 02 16:27:13 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Good news: you can save 16 cents on the groceries for your cookout this year. \n\nBad news: the gas to get to the store will cost you 42% more than last year.","date":"Thu Jul 01 22:44:29 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is great news! Thank you, @SenShelby, for steering some of this funding to #al01.","date":"Thu Jul 01 18:54:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden has driven gas prices back as high as they were when he was VP in 2014, and it’s killing the working class.","date":"Wed Jun 30 21:47:04 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, @Robert_Aderholt, @RepMoBrooks, @RepBarryMoore, @USRepGaryPalmer, and @RepMikeRogersAL for joining me on this!","date":"Wed Jun 30 17:47:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to have led a letter to @GovernorKayIvey thanking her for sending 347 AL National Guardsmen to the border to deal with the #BidenBorderCrisis. A strong and secure border is absolutely critical to our national security. https://t.co/Jbco1t8Kok","date":"Wed Jun 30 17:47:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Ilhan Omar’s antisemitism is unacceptable and she has no place on the House Foreign Affairs Committee.","date":"Wed Jun 30 02:40:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Since the Biden Admin has failed to do its job, it's up to the states to secure the border and keep Americans safe.\n\nI'm especially thankful for @GovernorKayIvey's leadership in sending Alabama National Guardsmen to help bring law and order to the southern border.","date":"Tue Jun 29 21:41:49 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"China lied about the origins of COVID, and millions have died as a result. We must act now to keep anything like this from happening again.","date":"Mon Jun 28 22:47:41 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"We MUST investigate the origins of COVID-19 and hold China accountable for its role in the spread of this deadly virus. Let's make sure this never happens again. https://t.co/LG83iDRYOP","date":"Sat Jun 26 14:52:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"My heart is heavy this morning as I learn of the passing of Congressman Sonny Callahan. Sonny was a mentor to me for years, and he leaves behind an incredible legacy of statesmanship and service to our country. My prayers are with his family and friends during this time.","date":"Fri Jun 25 14:28:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in this morning at 9:30! 📻","date":"Fri Jun 25 13:54:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"China lied and Americans died. It's time to get answers about the origins of COVID-19 and hold the Chinese Communist Party accountable for its role in the spread of this virus. https://t.co/D7VkNE13S6","date":"Thu Jun 24 15:52:21 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’ll be speaking on the House floor in just a few minutes about holding China accountable for their role in the COVID cover-up.","date":"Wed Jun 23 22:22:41 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'll be joining @RepArrington and several colleagues today at 4PM ET to address the #BidenBorderCrisis. Watch at the link below:","date":"Wed Jun 23 19:00:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It’s about time.","date":"Wed Jun 23 16:34:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"For months, Democrats have encouraged violent riots while pushing the Defund the Police Movement. \n\nAs a result, we have a historic crime surge. Enough is enough! https://t.co/RG82TXbF17","date":"Tue Jun 22 15:41:42 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"156 years ago, the last slaves in America were finally freed. As we recognize #Juneteenth as a national holiday for the first time this year, we remember the past and celebrate the future. https://t.co/dTahUusWKU","date":"Sat Jun 19 19:35:46 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"If you live in Mobile or Baldwin County, please stay weather aware this weekend. #al01","date":"Fri Jun 18 15:45:03 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@Truth_Gazette @CarlForAlabama Thank you!","date":"Thu Jun 17 23:39:56 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@JonathanAHester Thank you, Jonathan!","date":"Thu Jun 17 21:38:03 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@gopclassics Thank you!","date":"Thu Jun 17 21:37:45 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@ChairmanLathan @ALGOP Thank you! I appreciate your friendship!","date":"Thu Jun 17 20:28:36 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, Barry! Proud to serve with you.","date":"Thu Jun 17 20:19:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, Kat! It’s an honor to serve with you.","date":"Thu Jun 17 18:58:11 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@NatResources Thank you!","date":"Thu Jun 17 18:51:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@RepBlakeMoore Congratulations, Blake!","date":"Thu Jun 17 16:11:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Taxpayer money should NEVER be used to perform an abortion.\n\nI'm proud to join over 130 of my colleagues on a letter reminding the @DeptVetAffairs that protecting life should be a top priority.","date":"Wed Jun 16 13:50:28 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The ATF is proposing guidance to strip #2A rights from millions of law-abiding citizens overnight. \n\nI joined 140 colleagues in urging the ATF to withdraw this proposal immediately.","date":"Tue Jun 15 14:43:51 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#FlagDay 🇺🇸 🇺🇸 🇺🇸 https://t.co/WmR4yEqGdB","date":"Mon Jun 14 14:38:28 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’ll be live on Newsmax with Sean Spicer in just a few minutes!","date":"Fri Jun 11 21:53:16 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you @RepHarshbarger, @RepRickCrawford, @RepRonnyJackson, @RepGregSteube, and @CongressmanHice for joining me in this effort to ensure executive branch officials are held accountable for their actions.","date":"Fri Jun 11 17:11:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"🚨🚨 I just sent a letter to Speaker Pelosi urging her to open a bipartisan investigation to examine the contradictions between Dr. Fauci’s emails and his public statements. \n\nThe American people deserve transparency. https://t.co/uyOQnL6qYO","date":"Fri Jun 11 17:10:10 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Border crossings rose AGAIN last month. \n\nI’m not sure why VP Harris thinks the #BidenBorderCrisis is a laughing matter. Unlike her, I’ve actually visited the southern border, and it ain’t funny.","date":"Fri Jun 11 15:37:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tina and I are heartbroken to hear @RepTerriSewell’s mother, Nancy Sewell, has passed away. Ms. Sewell was the first African American city councilor for Selma and was respected by all. Our prayers are with the entire Sewell family tonight. https://t.co/fm6XIO9FGL","date":"Thu Jun 10 22:18:06 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Americans are now paying significantly more for everything thanks to President Biden’s reckless, runaway spending.\n\nWe haven’t seen inflation this bad since right before the 2008 economic crisis.","date":"Thu Jun 10 17:47:01 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@repdonyoung Happy birthday AND happy anniversary to you and Anne!","date":"Thu Jun 10 00:48:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today the Keystone pipeline was officially cancelled. When I got gas this afternoon, I paid over $1 more per gallon than I did 6 months ago. \n\nWhat’s President Biden doing about it? Meeting with Putin to help keep his pipeline going. https://t.co/F15e5PRT14","date":"Thu Jun 10 00:26:22 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It’s time to hold Dr. Fauci accountable.\n\nHis actions have impacted virtually every American, and we deserve answers.","date":"Wed Jun 09 19:53:26 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Did you know this week is #NationalFishingAndBoatingWeek?\n\nRecreational fishing is a HUGE part of our local economy, so I hope you can find some time this week to reel a few in! 🎣 https://t.co/SsmahCgNIE","date":"Tue Jun 08 18:28:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Which part of the #BidenBorderCrisis is so funny to the VP - the massive increase in human trafficking across the border or the drugs pouring into our communities?","date":"Tue Jun 08 15:51:03 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in at 9:30 this morning! #al01","date":"Tue Jun 08 13:49:11 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"These words mean nothing when your actions are the total opposite. \n\nUnlike you, I’ve been to the border and have watched illegal immigrants walk straight across because of the administration’s failure to enforce our laws and secure our border.","date":"Mon Jun 07 18:27:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is tragic news. Please join me in praying for Baldwin County tonight.","date":"Mon Jun 07 02:25:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"77 years ago today, thousands of brave men landed on the beaches of Normandy. This invasion was a major turning point in WWII and eventually led to an Allied victory in Europe. \n\nWe we will never forget the 4,000 Allied soldiers who gave the ultimate sacrifice for freedom. #DDay https://t.co/EEpK9mDOvn","date":"Sun Jun 06 14:10:08 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in tonight at 7:30!","date":"Fri Jun 04 20:24:23 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in tonight!","date":"Fri Jun 04 18:17:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Has VP Harris visited the southern border yet?","date":"Thu Jun 03 14:43:14 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great turnout in Atmore and Chatom today for our first in person town halls. Thank you to everyone who showed up and asked questions! #al01 https://t.co/na2pZ2IiUr","date":"Wed Jun 02 21:09:21 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I will be hosting two town halls today, and I hope to see you there! \n\n➡️ Atmore City Hall at 11 am\n\n➡️ Chatom Community Center at 2 pm","date":"Wed Jun 02 11:34:08 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today we honor the men and women in uniform who made the ultimate sacrifice for our freedom. We are forever grateful to them, and we will never forget them. https://t.co/0KKK4SWH0C","date":"Mon May 31 12:38:31 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Memorial Day isn’t about you enjoying a long weekend. It’s about taking time to honor the sacrifice of over one million brave men and women who paid the ultimate price to protect America and keep us free.","date":"Sat May 29 20:40:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden’s budget would overturn decades of precedent by using your taxpayer dollars to fund abortions. Unbelievable. \n\nThe #BidenBudget is bad for families, bad for the economy, and bad for America.","date":"Fri May 28 17:59:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Americans deserve answers to questions about the origins of COVID-19 and China’s role in the spread of this deadly virus. \n\nIt’s time to investigate the Wuhan lab and hold the CCP accountable for its actions. https://t.co/wFegUuWN50","date":"Fri May 28 15:22:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in today at 11 am! #al01","date":"Fri May 28 14:09:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I visited @SSAB_AB’s Axis, AL, plant today to learn more about the incredible work they do right here in our district. SSAB’s steel manufacturing is critical to #al01’s economy and to our national competitiveness. https://t.co/wNM12BgWWr","date":"Thu May 27 19:36:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, Governor Ivey and Rep. Shaver, for your leadership on this important #prolife legislation!","date":"Wed May 26 15:13:02 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"When President Biden pledged to “Build Back Better,” I assumed he meant America, not Russia. \n\nhttps://t.co/WGbC6gAtij","date":"Mon May 24 20:05:15 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"What a great day for Mobile, @Austal_USA, and the United States as we celebrate the commissioning of the USS Mobile, which is now the fifth ship named in honor of Mobile, Alabama. I couldn’t be prouder of Mobile’s contributions to the defense interests of the United States! #al01 https://t.co/snwy8p71Dq","date":"Sat May 22 15:43:24 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in at 1:00 today! 🎙","date":"Fri May 21 16:53:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I enjoyed meeting with the Alabama Home Builders to discuss some of their legislative priorities. Thanks for stopping by! https://t.co/agwpRd4dsi","date":"Fri May 21 13:34:41 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great meeting with y’all today!","date":"Tue May 18 16:26:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Capitol belongs to the people - not the politicians, but @SpeakerPelosi and @SenSchumer continue keeping it closed to the public. It is past time to open up the Capitol and allow visitors inside!\n\nhttps://t.co/nDZx0Mqjtl","date":"Mon May 17 19:01:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"“Americans have never looked forward to Tax Day – but if President Biden and congressional Democrats get their way, the economic struggles of a punitive tax system are sure to make it worse.”","date":"Mon May 17 14:09:29 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On today’s #ArmedForcesDay, we recognize the men and women who have answered the call to protect and defend our nation. We are eternally grateful to you! https://t.co/Vw1vu4H1Uu","date":"Sat May 15 21:24:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On this year's #NationalPoliceWeek, I'm proud to cosponsor two bills to protect police officers and better equip them to do their jobs to keep our communities safe. I will always support law enforcement in our community and all across America. \n\nhttps://t.co/H3aYrX6yA6","date":"Fri May 14 15:43:31 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just spent several days at the border learning directly from law enforcement about what needs to be done to fix the #BidenBorderCrisis. Read my thoughts here:","date":"Thu May 13 13:57:23 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Proud to join @GOPLeader McCarthy and several of my colleagues at the National Law Enforcement Officers Memorial this morning to honor law enforcement officers who have paid the ultimate sacrifice to keep our communities safe. We are grateful for them today and everyday. https://t.co/Em4Z88bGQV","date":"Thu May 13 12:46:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you to my friend @RepMikeJohnson for organizing this special order hour for #NationalPoliceWeek.","date":"Wed May 12 23:31:56 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just spoke on the House floor to show my support for police officers all across this country. I will always be a strong supporter of law enforcement, and I encourage my colleagues to fully fund and support our brave men and women in uniform. #NationalPoliceWeek https://t.co/uhFns2KoA4","date":"Wed May 12 23:30:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Then why did President Biden cancel the Keystone XL Pipeline and kill thousands of American jobs immediately after taking office?","date":"Wed May 12 17:54:21 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, Governor Ivey, for your leadership on this! This crisis is directly affecting our state, and it's time for immediate action to secure and defend our border.","date":"Wed May 12 14:37:33 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to be a strong defender of our brave men and women in law enforcement. Thank you for keeping our communities safe! #NationalPoliceWeek https://t.co/ne2tGeyI7n","date":"Tue May 11 19:27:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today is the start of #NationalPoliceWeek. I just stopped by one of our local precincts to thank some of the brave law enforcement officers who work incredibly hard to keep our communities safe. Thank you! https://t.co/EXOTH15cOD","date":"Mon May 10 18:04:03 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Israel is our most important ally in the Middle East, and we stand with them against the violence and attacks from Hamas.","date":"Mon May 10 17:14:49 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy Mother’s Day to all the mothers out there! I’m especially grateful for my late mother Virginia and my wife Tina. https://t.co/2KZipUlYa9","date":"Sun May 09 14:06:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I talked to countless border patrol agents this past week and saw firsthand what they are dealing with on a daily basis. We've got a real crisis on our southern border, and we absolutely have to do more to protect the health, safety, and security of American citizens. https://t.co/KK12tpE2XD","date":"Sat May 08 14:57:40 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in tonight at 10 pm EST! I’ll be sharing with @NatalieJHarp about the crisis at our southern border.","date":"Fri May 07 23:49:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@FTWes @mynbc15 I support it! I cosponsored the Sunshine Protection Act of 2021 back in March: https://t.co/pWcNGBClkl","date":"Fri May 07 20:58:35 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you to all our military spouses for your sacrifice and courage! Our nation is grateful to each of you. https://t.co/XhoZHJMEAp","date":"Fri May 07 15:42:23 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Even though Alabama does not share a border with Mexico, the #BidenBorderCrisis affects us directly because drug cartels are bringing massive amounts of drugs across the border and are transporting them right through #al01. This needs to stop now. Watch: https://t.co/7kUemWfuCn","date":"Fri May 07 02:31:38 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The wall works, but President Biden has stopped construction of it. We already have materials on the ground to build more of it, but they are just sitting in piles not being used. Finish the wall! https://t.co/JCcIzP8eDv","date":"Thu May 06 18:14:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Although Alabama isn’t a border state, drugs coming across the border are being trafficked through #al01. This crisis affects all of us.","date":"Thu May 06 18:12:31 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Border patrol agents told me they seized 140 pounds of meth this morning ALONE. It’s time to get this crisis under control. https://t.co/2pDdOtWEam","date":"Thu May 06 18:11:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm on @fmtalk1065 right now with Sean Sullivan discussing what I've seen at the southern border so far today. #BidenBorderCrisis","date":"Thu May 06 18:06:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm at the southern border today learning more about the #BidenBorderCrisis. I'll be posting photos and videos so you can see firsthand what exactly is going on down here. Stay tuned!","date":"Thu May 06 17:38:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On today's #NationalDayofPrayer, I hope you will join me in praying for each other, our nation, and all our leaders. It's vital for us to come together to pray for God's guidance and thank Him for our countless blessings. https://t.co/IXNudfpY0N","date":"Thu May 06 17:19:35 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Fentanyl seizures are soaring to record highs at the southern border. \n\nCompared to a year ago, narcotics task forces are seeing a 2,682% increase in fentanyl pills intercepted as drug cartels take advantage of the border crisis. Unacceptable.\n\nhttps://t.co/w6JXhJfCN7","date":"Wed May 05 18:44:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@Jerry5Wiley The CARES Act was passed last Congress before I was in office. I’m thankful this money is coming to our state and #al01.","date":"Tue May 04 18:39:34 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@fjreed13 Hey Frances, this money is from the CARES Act that was passed in the last Congress and signed into law by former President Trump. I wasn’t in office then, but I’m glad Alabama and #al01 are receiving this money.","date":"Tue May 04 18:38:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great news for #al01 ⬇️⬇️","date":"Tue May 04 16:06:23 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It couldn't possibly be caused by the Biden admin stopping construction of the border wall or offering asylum to millions of illegal immigrants.","date":"Tue May 04 15:04:01 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Looking forward to it! Be sure to tune in at 10:00 this morning 🎙","date":"Tue May 04 14:12:29 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"When will the Administration get serious about the #BidenBorderCrisis?","date":"Mon May 03 16:48:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is great news for #al01! A few weeks ago, I cosponsored the CRUISE Act, which would require the CDC to move forward with guidance to get cruises going by July. I’m thankful the CDC has been listening to us and is making progress to get the cruise industry going again.","date":"Fri Apr 30 13:54:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I think @SenatorTimScott laid out an incredible response to President Biden’s radical vision for America last night.\n\n“Our best future will not come from Washington dreams or socialist schemes. It will come from you - the American people.” https://t.co/OwtEW7x7An","date":"Thu Apr 29 13:53:46 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden promised to work in a bipartisan manner for the betterment of all Americans, but his promises have fallen flat in his first 100 days. It’s time for him to deliver on his promise instead of catering to the far left and governing with a pen &amp; paper. #JointSession https://t.co/p6WuGzwWgL","date":"Thu Apr 29 01:17:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden promised unity &amp; bipartisanship, but instead he has:\n\n➡️ Failed to address the border crisis he created \n\n➡️ Borrowed trillions of dollars from you to pay for his radical agenda \n\n➡️ Created a commission to pack SCOTUS\n\n➡️ Killed thousands of American jobs https://t.co/M8Lgaz5d0l","date":"Wed Apr 28 16:24:37 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Last week I had the opportunity to meet with General Brown, General Raymond, and Acting Secretary Roth at the Pentagon for an immersion into @usairforce and @SpaceForceDoD priorities. I’m proud to be a strong supporter of theirs on @HASCRepublicans. https://t.co/svGid3RGvn","date":"Tue Apr 27 19:24:28 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"John Kerry should be terminated from the Biden administration immediately. Unacceptable. \n\nhttps://t.co/ZTbxAKyea7","date":"Mon Apr 26 20:12:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is great news for Alabama as our state continues growing! @GovernorKayIvey, our local leaders, and our business community did an incredible job encouraging Alabamians to take the census.","date":"Mon Apr 26 19:23:42 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Defunding the police is a ridiculous idea, and we won't let it happen here in #al01. \n\nI sat down with local sheriffs and police chiefs to discuss how we can partner together to recruit the best officers and secure the best equipment to keep our communities safe. \n\nCheck it out:","date":"Mon Apr 26 16:26:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Definitely! #al01","date":"Sun Apr 25 14:30:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m in Brewton today w/Sheriff Heath Jackson discussing how I can best support law enforcement from the federal level. \n\nWhile some folks want to defund the police, we’re working together to ensure we have the best officers with the best equipment to keep our communities safe. https://t.co/enHsMYl2zq","date":"Fri Apr 23 21:16:14 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Fantastic visit this morning to the @AirbusInTheUS Defense &amp; Space Military Aircraft MRO facility in Mobile! This facility employs a high percentage of veterans who are experts in overhauling Airbus parts, and I’m proud to be a strong supporter of theirs on @HASCRepublicans. https://t.co/LU9r03mf0h","date":"Fri Apr 23 17:10:22 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This #EarthDay, I'm proud to support the Trillion Trees Act, which is a practical way to address CO2 emissions by promoting healthy, sustainable forests. \n\nWe can protect our economy and our environment without radical Green New Deal policies which harm our economy and kill jobs. https://t.co/rax8qC8CqC","date":"Thu Apr 22 19:26:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Just spoke on the House floor about the need for leadership from the Biden Administration. We have a crisis on our southern border, but the President and VP have failed to address it at all. It's time to end this crisis and protect the safety and security of American citizens. https://t.co/mriRgfi8Yx","date":"Thu Apr 22 01:18:24 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Is President Biden going to ship them pallets of cash again too?","date":"Wed Apr 21 17:21:24 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Proud to join my @RepublicanStudy colleagues and Former Sec. @mikepompeo on the Maximum Pressure Act. This important legislation gives Congress the power to prevent the Biden admin from re-joining the terrible Iran Nuclear Deal &amp; enhances the max pressure campaign against Iran.","date":"Wed Apr 21 17:08:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Don't forget! Tonight, I'll be hosting a live, interactive telephone town hall at 5:30 pm CST. You can register to join at https://t.co/GpScU7Cp3A","date":"Wed Apr 21 15:06:02 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Make sure you use the link below to register for my live, interactive telephone town hall this Wednesday at 5:30 pm CST. \n\nI’ll be giving updates from Washington and taking as many of your questions as time allows!\n\nhttps://t.co/9J5lbV5Cb5","date":"Mon Apr 19 22:26:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@QuillRobinson @ACC_Alabama Thank you, Quill! I enjoyed talking with y’all.","date":"Tue Apr 20 23:42:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Protecting our environment and our economy go hand-in-hand with one another. I enjoyed talking with @ACC_Alabama today about how we can achieve both of these goals without radical policies like the Green New Deal.","date":"Tue Apr 20 23:42:17 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just voted to move forward with censuring Maxine Waters for her reckless, irresponsible rhetoric. \n\nInciting violence and and encouraging lawlessness is unacceptable for a sitting member of Congress.","date":"Tue Apr 20 20:07:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Proud to join Rep. Mann and 20 of our colleagues on a letter to @SecVilsack about the abrupt cancellation of the Farmers to Families Food Box Program. This bipartisan program provides critical relief to our agriculture supply chain and vulnerable populations.","date":"Tue Apr 20 18:25:16 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Starting May 28, private anglers will be able to enjoy four-day weekends to fish state and federal waters for #RedSnapper. I’m sure looking forward to it! \n\nhttps://t.co/f3jl55mxve","date":"Tue Apr 20 13:46:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Make sure you use the link below to register for my live, interactive telephone town hall this Wednesday at 5:30 pm CST. \n\nI’ll be giving updates from Washington and taking as many of your questions as time allows!\n\nhttps://t.co/9J5lbV5Cb5","date":"Mon Apr 19 22:26:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Biden admin is more worried about politically correct terms to describe the border crisis than working to SOLVE the crisis. When will Biden get serious about the crisis he’s created?","date":"Mon Apr 19 18:17:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Maxine Waters telling violent rioters to “get more confrontational” is unacceptable for a sitting member of Congress. \n\nSpeaker Pelosi needs to call out this dangerous rhetoric and hold her accountable for inciting violence.","date":"Mon Apr 19 14:59:02 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Recap of this week in Washington:\n\n✅ Cosponsored legislation to help veterans\n✅ Cosponsored legislation to get cruise ships sailing again\n✅ Voted to protect folks from targeted scams\n✅ Voted to help our small businesses \n✅ Fought attempts to radically transform #SCOTUS https://t.co/cnwdYuYJTM","date":"Fri Apr 16 19:32:38 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Proud to join @RepMariaSalazar &amp; @repdonyoung on the #CRUISE Act. It's time for the CDC to remove orders/regulations preventing cruise ships from operating in the U.S. by July 4th.\n\nThe cruise industry is critically important to our local and state economy! #al01","date":"Fri Apr 16 16:04:26 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"\"In January of 2021, Berg Pipe employed 666 full-time employees. Today, Berg Pipe has just 147 employees. This is a 78% decrease in our skilled workforce as a direct result of Biden's energy policy.\" -Berg Pipe CEO. #AL01 #WhereAreTheJobs","date":"Fri Apr 16 14:10:31 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"In just a few minutes, Ingo Riemer, President and CEO of Berg Pipe in Mobile, will testify to @NatResources about how employees at his pipe mill have been negatively impacted by the Biden administration's cancellation of the Keystone XL pipeline permit. Watch it live here:","date":"Fri Apr 16 13:56:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tina and I are praying for a quick and smooth recovery for @Mike_Pence as he overcomes this challenge!","date":"Thu Apr 15 20:33:24 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":".@RepSteveStivers and I agree - we have to support veterans facing mental health challenges. It’s time to #PassPAWS and get our veterans the care they deserve. https://t.co/BkEcTkRLA3","date":"Thu Apr 15 17:21:42 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"During her tenure, Booth Elementary was recognized as one of just a few 52 Title I Distinguished Schools.  Thank you, Lisa, for the incredible impact you have made on our community! 2/2","date":"Thu Apr 15 14:23:28 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today's #HometownHero is Lisa Williams. Lisa is the principal at Booth Elementary in Irvington, and she has successfully guided her students and staff through a tumultuous year dealing with COVID. Lisa has been recognized as a National Distinguished Principal. 1/2 https://t.co/OxrjBP5X67","date":"Thu Apr 15 14:23:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Democrats are struggling to force their radical agenda through Congress, so now they're trying to pack the Supreme Court.\n\nWe can't allow our courts to be politicized. That's why I'm proud to support @RepDustyJohnson's H.J.11 to require the #SCOTUS to stay at 9 justices.","date":"Thu Apr 15 14:11:23 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in at 10 am! Looking forward to it 📻","date":"Thu Apr 15 13:33:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I'm proud to fight for life by signing @RepKatCammack's discharge petition to demand a vote on the Born-Alive Abortion Survivors Protection Act. https://t.co/jLX86xvQZS","date":"Wed Apr 14 20:55:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@SBAList @SteveScalise @Kat_Cammack @RepAnnWagner I'm proud to add my name and fight for life!","date":"Wed Apr 14 20:33:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Trump Admin ➡️ sent illegal immigrants back home. \n\nBiden Admin ➡️ flies illegal immigrants into our communities.","date":"Wed Apr 14 17:42:56 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden appointed VP Harris to oversee the border more than 3 weeks ago. The crisis continues to get worse, but the VP has not traveled to the border or shared any plans to address this crisis. \n\nIt’s time to put an end to the #BidenBorderCrisis https://t.co/GBqmjZu56n","date":"Wed Apr 14 16:05:07 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m back in D.C. after spending the last few weeks traveling #AL01 and meeting with many folks about their needs and concerns. Stay tuned in the coming days as we have some important issues coming up here in Washington. I’ll be sure to keep everyone updated! https://t.co/yXgo7IFgye","date":"Tue Apr 13 21:18:26 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, @CapitolPolice Officer Billy Evans will lie in honor in the Capitol Rotunda. We are all forever grateful for his service to our country, and our prayers are with his family and loved ones. https://t.co/Sce9hRbykN","date":"Tue Apr 13 13:40:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’ve been hard at work in the first #100DaysOf117th. Here’s a snapshot of some issues I’ve been fighting for:\n\n➡️ 18 pro-life initiatives\n➡️ Improved border security\n➡️ Protecting 2A\n➡️ Veterans’ health and benefits\n➡️ Holding Biden Admin accountable for cancelling our oil leases https://t.co/ogkZJEWrY5","date":"Mon Apr 12 19:35:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"She is also the Founder of Ring of Hope, which is a nonprofit with a mission of meeting the needs of children, senior adults, and vulnerable veterans.\n\nThank you, Margaret, for the outstanding differences you have made in #al01! (2/2)","date":"Mon Apr 12 17:48:33 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Margaret Coley of Semmes is another #HometownHero. She was an educator for 28 years and now runs a child development center. Margaret served as 1 of 5 Directors of Honor Flight South AL, which provides trips for WWII vets to visit the WWII Memorial in D.C. (1/2) https://t.co/YEswMU9ncX","date":"Mon Apr 12 17:48:33 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"A few weeks ago, I asked folks to submit names of Hometown Heroes who have made a difference in their community this past year. I received many nominations, so I will be recognizing a few more of our #al01 Hometown Heroes in the coming days. Stay tuned! https://t.co/KE3lKUCehz","date":"Mon Apr 12 17:43:03 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":".@RepDanCrenshaw is as tough as they come. I'm praying for a quick recovery for him. Get well soon!","date":"Sat Apr 10 15:43:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden has called for a drastic increase in domestic spending, but is putting our defense budget in danger. This administration is all talk and no action when it comes to putting America first and strengthening our defenses. 1/2","date":"Fri Apr 09 19:16:11 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Now is the time to make critical investments in our military and ensure we have the best trained and best equipped fighting forces, rather than cutting defense spending and falling behind other global powers. 2/2","date":"Fri Apr 09 19:16:11 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"What part of “shall not be infringed” is so confusing to liberals? The 2nd Amendment is crystal clear, and I’ll continue fighting any attempts to trample our Constitution and erode our most fundamental rights.","date":"Fri Apr 09 18:14:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@HenryThornton95 Congrats, Henry!","date":"Thu Apr 08 23:42:13 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Whether it’s fighting for local needs like increased rural broadband access and continued growth at the Port of Mobile, or national issues like securing our borders and protecting our 2nd Amendment rights, I’m honored to continue fighting for south Alabama in Congress. 2/2","date":"Thu Apr 08 23:31:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to have visited every county in #al01 within my first 100 days in office! I’ve met with countless folks in every part of the district to discuss their needs and the issues they care about. 1/2 https://t.co/mDQFE8droO","date":"Thu Apr 08 23:31:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"https://t.co/KgsrEjdIIU","date":"Thu Apr 08 15:26:36 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Meanwhile, President Biden is focused on Green New Deal mandates and chipping away at law-abiding citizens' right to bear arms.","date":"Thu Apr 08 15:12:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden refuses to work in a bipartisan manner to address America’s infrastructure needs.\n\nHis “infrastructure” plan is nothing more than tax hikes and Green New Deal Mandates. https://t.co/Rf2lrffc8V","date":"Wed Apr 07 15:29:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Whether it’s fighting from the federal level to ensure @Austal_USA continues growing &amp; building world-class ships right here in #al01, or supporting our men &amp; women in uniform, I am committed to improving on our state’s immense contributions to the defense of the United States.","date":"Mon Apr 05 20:03:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thursday ➡️ Daphne from 10:30-11:30am and Fairhope from 2:30-3:30pm","date":"Mon Apr 05 13:26:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"🚨 🚨 🚨 \n\nMy office will be holding office hours in Baldwin and Escambia County this week. Meetings will be held at the respective town or city hall, and no appointment is necessary. \n\nToday ➡️ East Brewton from 9-10am and Atmore from 1-2pm","date":"Mon Apr 05 13:26:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tomorrow ➡️ Orange Beach from 9-10am, Gulf Shores from 11am-noon, Elberta from 1:30-2:30pm, and Foley from 3:15-4:15pm\n\nWednesday ➡️ Magnolia Springs from 9-10am, Silverhill from 11am-noon, Robertsdale from 1-2pm, and Loxley from 3-4pm","date":"Mon Apr 05 13:26:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"He is risen! Happy Easter from my family to yours. https://t.co/ApJusuba31","date":"Sun Apr 04 13:26:14 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tina and I are praying for the family and friends of the @CapitolPolice officer who succumbed to his injuries today. We are forever thankful for the courage of these brave men and women.","date":"Fri Apr 02 18:46:24 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m praying for the safety of @CapitolPolice and all others dealing with what’s unfolding at the Capitol. I’m thankful to be back home safe in Alabama.","date":"Fri Apr 02 17:27:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It is finished. \n\nWishing everyone a blessed Good Friday! https://t.co/ToDQ4VuQJp","date":"Fri Apr 02 15:22:36 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Just wrapped up a great day here in #al01! One of the big topics discussed today was the need for improved rural broadband access. The past year of working and learning from home has demonstrated how important this is for all of us, and it’s one of my top priorities in Congress. https://t.co/Kf9N2Jzmwf","date":"Thu Apr 01 23:09:07 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m in Washington and Clarke counties today meeting with local officials and business leaders to discuss various economic and infrastructure projects in their communities. Big things are happening all over #al01! https://t.co/SGH1ir0NV1","date":"Thu Apr 01 18:32:34 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Alabama is in great shape and our economic future is bright!","date":"Thu Apr 01 15:36:03 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I appreciate @SECNAV taking the time to learn more about Austal USA's immense contributions to our national defense footprint! Proud to have them here in #al01.","date":"Thu Apr 01 15:21:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden’s $2.3 trillion “infrastructure” plan is simply a repackaged Green New Deal, &amp; less than 6% even goes to roads &amp; bridges. \n\nHis plan would:\n\n- Raise taxes &amp; increase debt\n- Destroy right to work laws\n- Kill American jobs\n- Subsidize the Green New Deal at our expense","date":"Thu Apr 01 14:52:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great news for #IA02 voters and @RepMMM! \n\nI was proud to join my colleagues @RepBarryMoore, @RepMoBrooks, @USRepGaryPalmer, and @alasecofstate in sending a letter to Speaker Pelosi calling out this partisan power grab.","date":"Wed Mar 31 20:52:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Secretary of the Navy is in Mobile today learning more about the incredible shipbuilding being done at @Austal_USA. #al01 https://t.co/sJSda3qgmP","date":"Wed Mar 31 15:49:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"🚨 🚨 🚨 \n\nTomorrow and Thursday, @PoarchCreek will be hosting drive through #CovidVaccine clinics on the reservation, which can be accessed at 5811 Jack Springs Road, Atmore, AL. No appointment is required! \n\nTo check eligibility, visit: https://t.co/RrvzxvHIQV","date":"Tue Mar 30 19:48:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@toddcstacy Congrats!","date":"Tue Mar 30 19:45:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden wants to raise taxes on hardworking Americans to pay for another massive multi-trillion dollar spending bill chock full of liberal Green New Deal policies. \n\nWe shouldn’t be footing the bill for his outrageous agenda. Unacceptable. \n\nhttps://t.co/2nJsi9qOrh","date":"Tue Mar 30 14:38:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@FambroMedia The work they do is incredible! Proud to have them here.","date":"Tue Mar 30 01:55:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great tour of @USACWHospital and the USA Mitchell Cancer Institute today! C&amp;W is one of only 5 hospitals in the entire country devoted to both children and women, and MCI has cutting-edge technology hard to find anywhere else. https://t.co/PUvCQxQBD0","date":"Mon Mar 29 22:49:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This morning I had the pleasure of attending a ceremony to honor Vietnam Veterans and later the decommissioning ceremony of US Coast Guard Cutter GANNET. https://t.co/GgMnkz3fhs","date":"Mon Mar 29 20:30:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Be sure to tune in, #al01! 🎙","date":"Mon Mar 29 14:50:48 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Wishing everyone a blessed Palm Sunday!\n\n“Blessed is He who comes in the name of the Lord! Hosanna in the Highest!” -Matthew 21:9 https://t.co/ZKEWYMUsbn","date":"Sun Mar 28 16:55:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"There’s nothing more American than baseball! I appreciated the opportunity to attend the grand opening of the Grand Bay Ballpark this morning. The children who will play here are one of many reasons why I’m in Washington fighting for family values. #al01 https://t.co/OhpTnlJ7yL","date":"Sat Mar 27 15:14:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@fjreed13 @Austal_USA Hey Frances, I have done some Facebook Live Town Halls and will be doing both telephone town halls and in-person town halls in the future. I’d love for you to join as many as possible. In the meantime, you can also call my office at 202-225-4931 for any questions you have.","date":"Fri Mar 26 20:13:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great day for #al01 as @Austal_USA broke ground on their new steel manufacturing line! Austal USA is the most modern major shipbuilder in the U.S., and no other major defense shipbuilder provides BOTH aluminum and steel ship solutions. https://t.co/e2JZPZPBje","date":"Fri Mar 26 19:55:23 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The PPP Extension Act of 2021 extends the deadline for PPP applications through May 31 and gives the SBA an additional 30 days to process these loans. This is great news for our small business community!","date":"Fri Mar 26 15:24:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Yesterday, I visited Hamm Enterprises, Furniture City, &amp; Cafe Acadiana in Baldwin Co. to discuss how the Paycheck Protection Program has helped them keep workers employed during the COVID crisis. Earlier this month, I voted to extend this program. https://t.co/PTaS0YLoIP","date":"Fri Mar 26 15:24:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Heartbreaking news. My prayers are with our neighbors in central Alabama who have been affected by these storms.","date":"Fri Mar 26 14:50:49 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#AL01 - make sure you stay up to date on the severe weather impacting parts of our district today.","date":"Thu Mar 25 18:59:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today we honor the countless heroes who have shown exceptional bravery in their service to our nation. Thank you!#NationalMedalofHonorDay 🇺🇸 https://t.co/uTdfgSSiNg","date":"Thu Mar 25 13:57:39 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is great news. This study revealed there are 110 million red snapper, which is about 3 times more than prior estimates. Thank you @SenShelby for your leadership on this!","date":"Wed Mar 24 20:53:03 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"As I told Yaffee on WVNN, the Biden Administration's purposeful dismantling of our border security and immigration system has created a crisis on our southern border. This doesn't just impact border states - it impacts all Americans. #BidenBorderCrisis https://t.co/cXkssXEKiU","date":"Wed Mar 24 20:15:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy birthday to my young bride! I love you, Tina. https://t.co/6Cjzc2ZBsN","date":"Wed Mar 24 16:06:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It was great to be in Chatom this morning for a ribbon cutting on their new Career Readiness/Small Business Development Center and Veterans Affairs Office! #al01 https://t.co/KDxIRvstr3","date":"Tue Mar 23 21:10:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"POTUS’ moratorium on new oil and gas leases in federal waters is devastating to #al01 and the entire Gulf Coast. \n\nI introduced the Gulf Conservation and Recreation Funding Act, which would make the federal government compensate Alabama for the revenues we are being denied.","date":"Tue Mar 23 19:35:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you @SteveScalise, @RepGarretGraves, @RepMichaelGuest, @RepTrentKelly, @RepTroyNehls, @CongPalazzo, and @TXRandy14 for joining me in the fight to protect American jobs and ensure our communities have access to a critical funding source.","date":"Tue Mar 23 19:35:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Agriculture is the backbone of #AL01 and our nation as a whole. Today, we recognize farmers and ranchers who work hard everyday to feed, fuel, and clothe us. Thank you! #NationalAgDay https://t.co/4G6g3cCjov","date":"Tue Mar 23 14:49:08 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It’s time for President Biden to get serious about the crisis at the border. This is a problem for all of America, and we need to secure our border NOW. https://t.co/7FfwH1Vv5H","date":"Mon Mar 22 22:58:37 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@HaydenR65087665 @seanspicer Thanks, Hayden!","date":"Mon Mar 22 21:10:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’ll be on Newsmax with @seanspicer at 5:00 CST/6:00 EST tonight! Be sure to tune in.","date":"Mon Mar 22 20:37:28 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It’s sure good to be back in #AL01 this morning updating folks on the last few weeks in Washington. https://t.co/OgisPwP4IV","date":"Sat Mar 20 15:27:51 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, Democrats rejected my efforts to prevent criminal aliens from gaining a pathway to citizenship through the H-2A ag guest worker program. \n\nInstead, they passed a bill granting mass amnesty &amp; a pathway to citizenship to more than a million illegal aliens &amp; their families.","date":"Fri Mar 19 00:15:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Taking a quick break between meetings to fill out my bracket for our office’s #MarchMadness challenge. I’ve got @AlabamaMBB making a deep run and coming out on top! Who are you picking? https://t.co/r9YDF9BZwW","date":"Thu Mar 18 18:40:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden’s own administration officials admit he’s wrong not to acknowledge the crisis on our southern border. \n\n⬇️⬇️\n\nhttps://t.co/SHvoDFQpeu","date":"Thu Mar 18 16:13:08 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Yesterday, Democrats rejected @HouseGOP requests to consider a bill from my colleague @RepMMM requiring any individual released into the U.S. from CBP/ICE to test negative for #COVID19. \n\nThere is no reason to unnecessarily put American lives at risk in the middle of a pandemic.","date":"Wed Mar 17 13:47:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Make sure you listen in at 11:00 am, #al01!","date":"Wed Mar 17 13:36:06 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"There is a crisis at the southern border, despite President Biden's refusal to acknowledge it. His immigration policies are making the situation worse each day, and it's time to get serious about this crisis and secure our border.","date":"Tue Mar 16 14:11:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great conversation this morning with the Alabama League of Municipalities! #al01","date":"Mon Mar 15 18:56:17 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, Democrats are attempting to strip away your constitutional right to bear arms. \n\nI will be voting AGAINST these sweeping gun control measures because the 2nd Amendment is crystal clear - the right of the people to keep and bear arms shall not be infringed. https://t.co/mKviHK485B","date":"Thu Mar 11 14:32:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great seeing my colleague @RepDanCrenshaw and Jarred Taylor from @blckriflecoffee at lunch today! https://t.co/h2i7ai3gIj","date":"Wed Mar 10 18:44:21 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@RepKatCammack Thank you for your leadership on this!","date":"Wed Mar 10 17:51:10 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to be an original cosponsor of @RepKatCammack’s Regulations from the Executive in Need of Scrutiny (REINS) Act of 2021, which would prevent excessive executive overreach by unelected bureaucrats. 1/2 https://t.co/tivkhn23GA","date":"Wed Mar 10 17:17:31 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Constitution grants the legislative branch the authority to make laws, but unelected bureaucrats are increasingly bypassing the legislative process to impose burdensome rules and regulations on Americans without approval from Congress. It’s time to hold them accountable.","date":"Wed Mar 10 17:17:31 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@fjreed13 @HouseGOP @RepAshleyHinson @BaldwinSchools Baldwin County Schools have done an excellent job, and I’ve been quick to brag on them. I wish school districts across America would follow the lead of our schools in #al01. Here’s an op-Ed I wrote on the subject 👇🏼\n\nhttps://t.co/U6fk98R1Kw","date":"Tue Mar 09 21:31:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"A few minutes ago, I joined more than 50 of my @HouseGOP colleagues in urging Democrats to consider @RepAshleyHinson’s Reopen Schools Act. Unfortunately, they have chosen once again not to prioritize the well-being of students across America. https://t.co/dRb4O3jKIN","date":"Tue Mar 09 21:23:15 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"We are a nation of law and order, and we MUST have a strong border to protect the health, safety, and security of American citizens. It’s more important now than ever to #SecureTheBorder and end the #BidenBorderCrisis. 3/3","date":"Tue Mar 09 18:50:38 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":".@POTUS has reimplemented “catch and release,” allowed thousands of migrants to enter without any regard for COVID-19 precautions, and has failed to enforce numerous immigration laws. As my friend @GOPLeader McCarthy said, these are “weak policies from a weak administration.” 2/3","date":"Tue Mar 09 18:50:37 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden’s reckless immigration policies are putting our nation on the verge of an unprecedented crisis. Illegal crossings have increased by 500% under his administration and we are seeing a massive increase of unaccompanied children crossing the border. 1/3","date":"Tue Mar 09 18:50:37 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just found out Nancy Pelosi has decided she wants the National Guard to stay here at #FortPelosi for another 60 days, instead of letting them return home to their families. These security measures are costing the taxpayers $2 million per week! This is ridiculous. https://t.co/Z3E311ze2D","date":"Thu Mar 04 17:22:21 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@libbominto I enjoyed meeting with y’all!","date":"Wed Mar 03 20:45:45 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Democrats’ number one priority is radically transforming our elections by taking power away from the people and giving more power to the swamp. #HR1 is a bad deal for election integrity and for the American people.","date":"Wed Mar 03 19:19:00 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The short-term issues contributing to spikes in fuel prices demonstrate how important American energy independence is and highlight the serious problems caused by President Biden cancelling the #KeystonePipeline.  \n\nhttps://t.co/EydSTSBC9P","date":"Wed Mar 03 15:52:02 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Nancy Pelosi’s #ForThePoliticians Act is a terrible deal for voters, and it gives more power to D.C. bureaucrats. Here’s just a snapshot of what it would do:\n\n1️⃣ Utilize taxpayer money to fund campaigns\n \n2️⃣ Legalize ballot harvesting \n\n3️⃣ Weaponize the IRS for partisan gain https://t.co/0wi6Ybp05A","date":"Tue Mar 02 15:07:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I urge my colleagues on both sides of the aisle to join me in this endeavor so we as Americans can engage in honest, accurate, and unifying discussions that enable us to move forward as a nation.","date":"Mon Mar 01 21:50:49 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just introduced my first bill, which is titled The American Heritage Protection Act. My bill is in response to D.C. bureaucrats’ attempts to change the names, remove, relocate, or “contextualize” the Jefferson Memorial and the Washington Monument. https://t.co/IpAJR1wWGX","date":"Mon Mar 01 21:50:48 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"🚨 🚨 🚨 \n\nGreat news for @austal and #al01! Austal’s world-class facility in Mobile has been selected to design and build an additional Expeditionary Fast Transport (EPF).","date":"Mon Mar 01 15:44:25 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It’s a late night in D.C. as Nancy Pelosi pushes through a massive spending bill that has nothing to do with COVID relief. I’m standing firm against this because this is nothing more than a blue state bailout that ignores hardworking Americans. https://t.co/WkkmtxTBGR","date":"Sat Feb 27 03:23:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@AnatSultanDadon @IsraelAtlanta @IsraelinUSA @KarenJonesPR @CarlForAlabama Great meeting with you! I’m proud to be a strong supporter of Israel. 🇮🇱","date":"Fri Feb 26 18:07:11 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@Mai_TWakefie @ZacharyBWhiteII @NIH @theNCI @AACR Thank you! Great talking with y’all today.","date":"Thu Feb 25 21:44:37 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you to the @USArmy liaison office for bringing me your official seal to display in my office. I’m honored to support our men and women in uniform. https://t.co/oKULCMYvv1","date":"Thu Feb 25 20:07:29 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I just spoke on the House floor about the Democrats’ so-called COVID relief bill. Our priorities should be getting folks back to work, getting kids back in school, and defeating the virus. Unfortunately, this plan has almost nothing to do with COVID relief. https://t.co/OFXlGOGK8B","date":"Thu Feb 25 17:32:38 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you @RepKatCammack for your leadership on this!","date":"Thu Feb 25 16:54:51 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"In the coming days, I’ll be honoring some folks in #al01 who’ve made a difference in their community this past year. \n\nIf you would like to nominate someone, send their name, location, description, &amp; photo to honorahero.carl@gmail.com by March 5th so they can be recognized! https://t.co/Wy9wANfM7P","date":"Thu Feb 25 16:54:30 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The $1.9 trillion COVID package being voted on this week has almost nothing to do with COVID relief for American families. Less than 9% actually goes to COVID relief, and more than half the money will not be spent until 2022 or later. This is a bad deal for the American people. https://t.co/PKTXaVYTVK","date":"Wed Feb 24 18:38:08 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Agriculture is the backbone of #al01. I’m proud to be an advocate for our farmers and the ag industry as a whole!","date":"Wed Feb 24 17:47:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@RepLisaMcClain Thank you for your leadership!","date":"Tue Feb 23 20:26:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Proud to support @RepLisaMcClain's legislation preventing the U.S. from rejoining the flawed Iran Nuclear Deal. Iran poses a significant threat to regional and global security, and it would be a grave mistake for the President to rejoin this bad deal.\n\nhttps://t.co/mHrkdSBvEO","date":"Tue Feb 23 18:46:47 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden’s nominee to run HHS is unacceptable. Xavier Becerra is an abortion extremist who\n\n❌ Supports partial-birth abortions\n❌ Supports late-term abortions of viable babies\n❌ Supports infanticide \n\n#StopBecerra https://t.co/OLKDoiiYu7","date":"Tue Feb 23 17:11:26 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"It's been a tough year for students, but Spanish Fort High School has much to be proud of! This year, they have FIVE National Merit Scholarship finalists and three students who got perfect scores on the ACT college entrance exam. #al01\n\nhttps://t.co/WXH4ByQ9Ah","date":"Tue Feb 23 14:39:48 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Most Alabama students have been back in the classroom for several months, and time has proven classrooms are safe and the transmission and infection rates in schools are incredibly low. Our children belong in the classroom, and Alabama serves as a model for how to safely do so.","date":"Mon Feb 22 21:39:13 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Future Farmers of America (FFA), which has 15,280 members in Alabama, plays a critical role in developing the next generation of leaders in ag. Today, I was thrilled to meet with several #al01 FFA leaders to discuss the importance of their work in our district and state! https://t.co/eQgy9bN4nW","date":"Mon Feb 22 21:04:58 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The Democrats' so-called COVID relief bill is nothing more than a liberal wish list of special interest pork, including a job-killing minimum wage mandate, bailouts for states who used lockdowns for political purposes, and money for schools that refuse to open.","date":"Mon Feb 22 19:25:05 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Alabama's contribution to our nation's military strength and defense programs is critical to national security. \n\nIt is undeniable that Huntsville would be the perfect location for Space Command.","date":"Mon Feb 22 17:55:07 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I was pleased to meet with leadership at USA Health, home to the region’s only Level 1 Trauma Center, Burn Center, and Neonatal ICU, which works in close association with USA’s academic programs to provide education and experience for future healthcare professionals. https://t.co/f1weBrNK4E","date":"Fri Feb 19 18:46:14 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"University Hospital Administrator Sam Dean toured me through the region’s only level one trauma center. This new facility just came online last month, tripling the trauma capacity for #al01 and our surrounding region.","date":"Fri Feb 19 18:46:14 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m in Washington today attending my first organizational meeting for the @NatResources Committee. I’m looking forward to working with my colleagues as Vice Ranking Member of Water, Oceans, and Wildlife. https://t.co/3mXBnyQySz","date":"Thu Feb 18 16:54:10 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The U.S. is the only country to successfully land on Mars, and today NASA is aiming to land its rover Perseverance near an ancient river delta at Jezero Crater. The landing can be watched live this afternoon on YouTube, Twitter, and Facebook!\n\nhttps://t.co/DH0cCFhQHH","date":"Thu Feb 18 14:33:40 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Big news for #al01!","date":"Wed Feb 17 21:07:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"South Alabama is abundantly blessed with natural resources, including the incredibly diverse Mobile River ecosystem and our vibrant Red Snapper population, and these resources are critical to our local economy and our way of life. I couldn’t be more excited for this opportunity!","date":"Wed Feb 17 19:39:09 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Rush Limbaugh was a conservative icon who transformed American talk radio, and he will be missed by all. Please join me in surrounding his family and friends with prayer.","date":"Wed Feb 17 17:57:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Wishing a blessed Ash Wednesday to everyone who observes! https://t.co/5EPFgJwxAK","date":"Wed Feb 17 16:07:54 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@RepKatCammack Please do!","date":"Tue Feb 16 23:12:11 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@RepKatCammack Happy birthday! 🎉","date":"Tue Feb 16 22:53:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@TravisJohnson73 Thank you! I’m proud to be pro life.","date":"Tue Feb 16 22:26:30 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to be an original cosponsor of Rep. Chris Smith’s H.R. 1080, the Pain Capable Unborn Child Protection Act. This legislation would amend the U.S. Code to prohibit any person from performing an abortion on an unborn child who is 20 weeks or older. https://t.co/EjbM2E39JZ","date":"Tue Feb 16 22:15:54 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I am proud to represent the original home of Mardi Gras! Even though celebrating looks a little different this year, Mobile will continue to let the good times roll. Happy Mardi Gras! 🎭 https://t.co/LCEzJljHPo","date":"Tue Feb 16 19:43:07 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On today’s #PresidentsDay, we honor our nation’s presidents and the impact they’ve had on making America strong, secure, and prosperous. https://t.co/DFtC0wt4KJ","date":"Mon Feb 15 17:06:17 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Since the Senate is allowing witnesses, Nancy Pelosi should be called to explain how much she knew about the threat to the Capitol before January 6th and why she refused assistance from the National Guard.","date":"Sat Feb 13 17:08:29 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Earlier today, I sat down with Fairhope Mayor Sherry Sullivan, Fairhope City Council President Jack Burrell, and Fairhope City Councilman Corey Martin to discuss COVID recovery, infrastructure needs, and economic development. @CityofFairhope is in great hands! #al01 https://t.co/EuOUcX2B5a","date":"Fri Feb 12 20:01:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@tyjong You can find more information about locations and appointments at https://t.co/7QYficxSuv","date":"Fri Feb 12 18:39:24 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@tyjong Hey Tyler, this is the first week Walmart is administering vaccines, so I'm hopeful they will continue expanding sites. In the meantime, there are a few vaccine locations in Baldwin County, including Infirmary, Baldwin Co Health Dept, and South Baldwin Regional Medical Center.","date":"Fri Feb 12 18:38:48 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy Birthday to our nation’s 16th president! https://t.co/JKGmuaQnCF","date":"Fri Feb 12 15:28:08 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden’s big-government mandates are already eliminating Alabama jobs and harming our economy. This is unacceptable, and I’ll continue fighting back against his radical agenda. \n\nhttps://t.co/mecPYVMhPG","date":"Thu Feb 11 21:05:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Baldwin County is growing and Alabama’s economy is booming, despite the tough year our businesses have had. Today we broke ground on @AldiUSA’s new regional headquarters and distribution center. This investment will create 200 good paying jobs in #al01! https://t.co/JADNZkhZod","date":"Wed Feb 10 17:09:26 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Fun afternoon yesterday exploring Alligator Alley in Summerdale. They started off with just one gator and are now one of the largest gator sanctuaries! It’s a great place to take the kids or grandkids. #al01 https://t.co/Q2oLR8Tbq7","date":"Wed Feb 10 15:21:43 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Make sure you subscribe to my newsletter if you haven’t already! It’s one of the best ways to stay up to date on what I’m doing in Washington. \n\nhttps://t.co/TSdRSf89hl","date":"Tue Feb 09 20:44:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"1.4 MILLION Americans would lose their job as a result of the Democrats’ $15 minimum wage hike. Our priority should be job creation and economic recovery instead of job-killing government mandates.  https://t.co/16pgbyQhKk","date":"Tue Feb 09 16:11:14 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Democrats passed a budget resolution allowing them to rush through President Biden’s $1.9T COVID relief bill that ignores hardworking Americans while giving bailouts to Governors who used lockdowns and economic shutdowns to harm political opponents. This is flat out wrong.","date":"Mon Feb 08 20:47:23 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Without his leadership, the Port of Mobile would not be such a massive economic engine for the state of Alabama. I will continue working with him the next two years to bring more growth and opportunity to our state, and I wish him and his wife Annette all the best!","date":"Mon Feb 08 18:42:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":".@SenShelby’s impact on the state of Alabama is immeasurable, and he will be greatly missed when he retires at the end of this term. During his more than forty years of public service, Senator Shelby has been a consistent fighter for the entire state and especially #al01","date":"Mon Feb 08 18:42:49 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m saddened to learn my college @RepRonWright passed away. He served #TX06 with honor and integrity, and he will be greatly missed by all. His family and friends are in my prayers during this tough time.","date":"Mon Feb 08 16:18:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Important 🚨 \n\nToday is the deadline for homeowners and renters to apply for an SBA loan to help with damage from Hurricane Zeta. \n\nYou can call the FEMA Helpline at 800-621-3362 or visit https://t.co/kIAJxit1A7","date":"Mon Feb 08 14:32:34 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy birthday, President Reagan! https://t.co/Pba3axHiqT","date":"Sat Feb 06 14:28:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I enjoyed exchanging some throws with @SteveScalise this afternoon. Before New Orleans there was Mobile, Alabama - the real home of Mardi Gras!\n\nLaissez les bons temps rouler 🎭 https://t.co/628eDyWu0p","date":"Fri Feb 05 22:33:33 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"#BlackHistoryMonth is a time to celebrate the many contributions Black Americans have made to our state &amp; nation. \n\nHank Aaron is a baseball legend &amp; civil rights icon who helped pave the way for equality in professional sports. I’m proud to call him a fellow Mobilian! https://t.co/6bTPVI4ylJ","date":"Fri Feb 05 14:55:53 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@kolyantexas @SenShelby @SenTuberville I enjoyed popping in and saying “hey” to everyone!","date":"Thu Feb 04 22:45:24 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden should utilize the $1.3T in unspent funds from previous #covid relief packages and inform Congress on the status of these funds before rushing through an additional emergency spending package.  https://t.co/kQ16z92WH8","date":"Thu Feb 04 20:11:06 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you @RepAndyBiggsAZ for your leadership on this.","date":"Thu Feb 04 14:39:28 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Keeping the U.S. embassy in Israel’s “eternal capital” ensures a continued partnership between the U.S. and Israel for decades to come, so my colleagues and I are strongly urging @SecBlinken to honor his commitment to keeping our U.S. embassy in Jerusalem. https://t.co/xJHKzBHPJl","date":"Thu Feb 04 14:38:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today I gave my first speech on the House floor in honor of the millions of innocent babies who lost their chance at life because of Roe v. Wade. Life is a precious gift from God, and every human is made in God’s image. I’m proud to be a #prolife leader in Congress. https://t.co/9crHhCgT3h","date":"Thu Feb 04 01:49:16 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"A well-deserved honor for Officer Brian Sicknick’s remarkable bravery. \n\nhttps://t.co/1p71tE4hdh","date":"Tue Feb 02 14:45:30 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden’s war on American oil and gas continues. Instead of working alongside the private sector to promote free-market innovations and clean energy solutions, Biden imposes top-down big government mandates that stifle innovation and eliminate American jobs. #al01","date":"Mon Feb 01 19:06:44 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in at 10:30 today! #al01","date":"Mon Feb 01 14:30:03 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Exciting news for #al01","date":"Sat Jan 30 23:55:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I visited USA Health’s Covid vaccination site at the Mobile Civic Center to get an update on the efforts they are taking to get folks in #al01 vaccinated quickly. \n\nIf you want the vaccine and are eligible, use this link to schedule your appointment!\n\nhttps://t.co/NQywlk4lDk https://t.co/1YCsaUbqXK","date":"Sat Jan 30 20:23:28 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@willainsworthAL I am praying for Addie. Keep us updated.","date":"Fri Jan 29 16:15:29 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"As a nation, we must remain rooted in the fundamental belief that all life is precious and created in the image of God. I’m proud to be #ProLife","date":"Fri Jan 29 14:33:02 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden’s executive orders yesterday will result in the destruction of 24,000 Alabama jobs over the next 4 years. The President is declaring war on the oil and gas industry, destroying jobs, and threatening America’s energy Independence. This is wrong, and I’m fighting back.","date":"Thu Jan 28 18:36:21 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to join with many of my colleagues co-sponsoring Congressman Dan Crenshaw’s Conservation Funding Protection Act, which will protect America’s oil and gas industry from President Biden’s harmful executive orders on energy policy.","date":"Thu Jan 28 18:36:21 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to be part of this effort to honor @CapitolPolice Officer Brian Sicknick. Thank you @RepBonnie for your leadership on this.","date":"Thu Jan 28 15:58:36 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today marks 76 years since the liberation from Auschwitz-Birkenau. We must never forget the millions of lives lost during the Holocaust. #WeRemember https://t.co/oAQGrxY7d2","date":"Wed Jan 27 15:56:56 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"As we battle the Covid-19 pandemic, our top priority must be protecting the health and safety of the American people. That’s why I’m proud to join Rep. Herrell’s PAUSE Act of 2021, which keeps border protections in place until all lockdowns and emergency declarations are lifted.","date":"Wed Jan 27 14:30:32 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":".@AlfaFarmers turns 100 years old! Thank you for being a consistent voice for Alabama farmers over the past century.","date":"Tue Jan 26 19:20:48 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Looking forward to it!","date":"Tue Jan 26 17:55:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@PoarchCreek Thank you! I’m excited to get to work for our district!","date":"Tue Jan 26 17:38:20 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Congress has upheld a ban on taxpayer-funded abortions for nearly half a century, but radical Democrats want to change that. I’m proud to join 199 of my colleagues in firmly opposing any legislation that weakens or ends the Hyde Amendment. #SaveHyde https://t.co/BX2T8Xcnyf","date":"Tue Jan 26 16:35:01 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Happy birthday, @GOPLeader Kevin McCarthy!","date":"Tue Jan 26 15:25:22 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@ChairmanLathan Thank you!","date":"Tue Jan 26 14:14:34 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Terrible news out of #Fultondale last night and this morning. I’m saddened by the loss of life and the destruction of property, and I’m praying for a quick recovery for our neighbors in Jefferson County.","date":"Tue Jan 26 14:14:16 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Excited to get to work! #al01 #alpolitics","date":"Tue Jan 26 00:31:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"President Biden has chosen to bypass Congress and work through executive orders to accomplish his goals, which are harmful to American workers and families. Read my thoughts ⬇️","date":"Mon Jan 25 19:50:15 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"With today being the 48th anniversary of Roe v. Wade, I hosted a virtual roundtable with several pro-life leaders in #al01 to discuss the pro-life bills I’m working on in Congress. I’m proud to be an advocate for the unborn, and I’ll never stop fighting for the sanctity of life. https://t.co/Ccg5dPkOWL","date":"Fri Jan 22 20:45:50 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m saddened to learn of Hank Aaron’s passing. A Mobile native, “Hammerin’ Hank” is a baseball legend respected for his performance on the field and for being a man of great character. His was a life well lived, and he will be missed by all. My prayers are with his loved ones. https://t.co/9kXj3mkgjT","date":"Fri Jan 22 17:23:56 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m deeply disappointed with many of President Biden’s divisive and harmful executive orders in recent days. By pushing failed Obama-era policies, the President is already attempting to undo the progress we’ve seen in the last 4 years. Let’s take a look: https://t.co/QdbLCtt6pL","date":"Fri Jan 22 16:55:06 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is outrageous - these men and women deserve better. If any @AlabamaNG members need a place to rest, my office is open to you. \n\nhttps://t.co/nc4bZpvJBA","date":"Fri Jan 22 03:19:04 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Thank you, President Trump and Vice President Pence, for four years of accomplishments and keeping America first. Promises made, promises kept! \n\n✔️ Built a roaring economy \n✔️ Cut taxes\n✔️ Secured our borders \n✔️ Fixed our bad trade deals https://t.co/EuKm8xYZBw","date":"Wed Jan 20 17:36:26 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Behind the scenes look at the Inauguration today. I’m thankful for all the men and women keeping the Capitol safe, especially the National Guardsmen from Alabama! https://t.co/uasYs648xi","date":"Wed Jan 20 16:02:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to represent #al01 and fight for our values!","date":"Tue Jan 19 21:27:55 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Biden’s proposed immigration plan to suspend deportations and open our borders will prove disastrous. We have got to be tough on immigration and prevent people from illegally crossing our borders.\n\nhttps://t.co/64r5YOqJs3","date":"Tue Jan 19 21:20:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Ingalls is hiring! Check it out: \n\nThey will host a drive-in hiring event for job seekers from 8 a.m. until 12 p.m. on Wednesday, January 20 at Hank Aaron Stadium. #al01 \n\nhttps://t.co/YEfUqJJvGE","date":"Tue Jan 19 15:46:14 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, we honor the legacy of Reverend Dr. Martin Luther King, Jr. who lived a life dedicated to truth, justice, and service. He inspired not only his generation, but countless generations to come. #MLKDay https://t.co/DgWkxGVbaR","date":"Mon Jan 18 14:08:15 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"On today’s Religious Freedom Day, let’s take time to remember how blessed we are to live in a nation where we are free to worship as we choose. I’ll always be a fighter in Congress for our religious freedoms, which are foundational to our society. https://t.co/CdEgYIMssA","date":"Sat Jan 16 16:16:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Great day today in Baldwin County meeting with Daphne Mayor LeJeune, Loxley Mayor Teal, and Robertsdale Mayor Murphy to discuss ways we can work together to bring more growth and opportunity to #al01! https://t.co/tI7mHuEE8p","date":"Fri Jan 15 21:47:56 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Big news ⬇️⬇️","date":"Thu Jan 14 18:51:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I remain committed to doing the job I was elected to do, rather than wasting time on Nancy Pelosi’s vendetta against President Trump. #al01 #alpolitics (3/3)","date":"Wed Jan 13 22:48:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"a peaceful transition of power, and I trust he will uphold this promise to ensure a smooth transition to the next administration. With only a few days left until January 20th, I believe impeachment further divides the American people at a time when unity is needed. (2/3)","date":"Wed Jan 13 22:48:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"A few minutes ago I voted against the House Democrats’ resolution impeaching President Trump. I voted no because the reasons cited in the article failed to reach the necessary threshold for impeachment. The President has publicly conceded the election and committed to (1/3)","date":"Wed Jan 13 22:48:51 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is great news for Alabama!","date":"Wed Jan 13 18:27:19 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"The 25th Amendment’s purpose is to address an instance when a President is incapacitated, but it was not designed to carry out Nancy Pelosi’s political agenda. #al01 #alpolitics","date":"Wed Jan 13 17:07:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Yesterday evening I voted against the Democrats’ resolution to encourage the Vice President to invoke Section 4 of the 25th Amendment and remove President Trump from office.","date":"Wed Jan 13 17:07:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Yesterday I visited the South Alabama Mega Site, which is a shovel-ready 3,000+ acre site in North Baldwin County. It has the potential to bring unprecedented growth not only to Baldwin County, but to all of #al01! https://t.co/gpvKE1kO9Y","date":"Tue Jan 12 16:34:18 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m profoundly grateful for the @CapitolPolice and all the brave law enforcement who keep our Capitol and our nation safe. Please continue praying for the loved ones of the two USCP officers who have passed away. https://t.co/5rbVHG0POr","date":"Mon Jan 11 19:00:51 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Best of luck to @AlabamaFTBL as they compete tonight in the #CFBPlayoff and hopefully bring home another #NationalChampionship to our state!  #rolltide","date":"Mon Jan 11 18:20:27 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Additional funds may also be available through a low-interest disaster loan from the U.S. Small Business Administration at https://t.co/HNt1jwPcxx or by calling 800-659-2955. \n\nhttps://t.co/PEeQIkoqlj","date":"Fri Jan 08 20:10:22 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Important for #al01: \n\nOne month left for residents of Clarke, Mobile, &amp; Washington counties to seek help with uninsured or underinsured damage from #HurricaneZeta. \n\nThe deadline to apply is Feb 8. You can apply online or by calling FEMA at 800-621-3362.","date":"Fri Jan 08 20:10:22 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"This is terrible news. Please join me in praying for @CapitolPolice officer Brian Sicknick’s family and friends. He put his life on the line to protect our Capitol, and we will be forever grateful for his bravery. \n\nhttps://t.co/jS44bVu3MN","date":"Fri Jan 08 13:50:33 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Due to overwhelming evidence of voter fraud and irregularities in Arizona and Pennsylvania, I voted to challenge fraudulent electors from both states. Read my full statement explaining why: https://t.co/rd4LnkraTo","date":"Thu Jan 07 16:39:12 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I have returned to the House floor to continue the business I was sent here to do.  I’d like to thank the men and women of the Capitol Police and all other law enforcement for their valor today. #al01 #alpolitics","date":"Thu Jan 07 02:31:08 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Americans have a right to protest, but violence is never the answer. I’m praying for the safety of my colleagues on both sides of the aisle and the law enforcement protecting us.","date":"Wed Jan 06 20:13:57 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m proud to serve alongside so many conservative fighters in the #117thCongress! We are committed to our nation, rebuilding our economy, and restoring the American Dream for future generations. #ClassPhoto https://t.co/ETcKPT4QsT","date":"Tue Jan 05 14:23:34 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today, the Democrats are pushing a radical rules package that limits my ability to interact with you on social media and bans the use of gendered words like “mother” and “brother.” This is absurd, and I’ll definitely be voting no. #al01 #alpolitics https://t.co/1mWRPwbtTD","date":"Mon Jan 04 20:38:45 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"“Amen and A-Woman.” Ridiculous. \n\nThe Democrats’ radical push for political correctness is absurd and out of control. \n\nhttps://t.co/5adsIsYsL1","date":"Mon Jan 04 19:39:07 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Tune in at 9:30 am CST as I discuss some of my priorities during my first week in Congress. #al01 #alpolitics","date":"Mon Jan 04 14:35:59 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Just a few minutes ago, I took my oath of office and was sworn into the 117th Congress. South Alabamians have entrusted me with the responsibility of fighting for them and being their voice in our nation’s Capitol. I look forward to serving you in the 117th Congress! #al01 https://t.co/lolHH6qs3M","date":"Mon Jan 04 00:00:54 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"I’m excited to be part of this incredible group of conservative leaders! We are ready to get to work. #al01 #alpolitics","date":"Sun Jan 03 20:39:52 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"@ChairmanLathan Thank you! I look forward to serving.","date":"Sun Jan 03 14:25:54 +0000 2021","user_id":"1341091420439015424"},{"handle":"RepJerryCarl","text":"Today is the day! This afternoon, I will take my oath of office and be sworn into the 117th Congress. I’m ready to get to work and fight for the people of Alabama’s 1st Congressional District. #al01 https://t.co/NivSd7X7jL","date":"Sun Jan 03 13:37:50 +0000 2021","user_id":"1341091420439015424"}]