[{"handle":"RepJuliaLetlow","text":"In Bastrop, Buck Harper is known as the \"Flag Man\" for his commitment to ensuring that American flags are placed and flown throughout Morehouse Parish. This week, our team presented him with a flag from the U.S. Capitol in honor of his amazing work! https://t.co/hDX0nLmwYs","date":"Wed Jun 15 20:27:54 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to the Louisiana Home Builders Association for stopping by our office! Insightful conversation with these job creators about how we address inflation, the supply chain crisis, and the ongoing labor shortage. https://t.co/sCNaIEJDyf","date":"Wed Jun 15 18:08:10 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Staffing shortages have been a persistent problem at both FCC Pollock and FCC Oakdale. That's why our delegation is united to help these facilities secure the employee recruitment and retention tools they desperately need.\n\nhttps://t.co/zUoiGghvde","date":"Wed Jun 15 13:04:43 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, my Republican colleagues and I brought forward H.R. 6858 - a bill to reopen the Keystone Pipeline, restart leasing in the Gulf of Mexico, and replenish the Strategic Petroleum Reserve.\n\nUnfortunately, the majority defeated it. They’re not serious about fixing this crisis.","date":"Tue Jun 14 19:43:26 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"When will this Administration realize that the solution to America's energy crisis is in the Gulf of Mexico, not the Persian Gulf?\n\nhttps://t.co/ARMpIlnZSe","date":"Tue Jun 14 17:47:54 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"On this #FlagDay, we remember the words of President Reagan - \"When we honor our flag we honor what we stand for as a Nation - freedom, equality, justice, and hope.\" https://t.co/dVKAMFzRlN","date":"Tue Jun 14 16:22:02 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We have some of the world’s most amazing rivers, lakes, and bayous in #LA05! https://t.co/6RKk85jKMW","date":"Mon Jun 13 20:08:11 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 STUDENTS: The Congressional App Challenge opens this Wednesday, June 15th! Click ⬇️ for more information on the competition rules and submission guidelines.\n\nhttps://t.co/6b5w7MHVOP","date":"Mon Jun 13 18:44:09 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Expanding educational opportunities is the key to Louisiana’s future. So excited for the opening of @LaDeltaCC’s new campus in Ruston and glad our team could join the community for this amazing day! https://t.co/wgcnhQVfHU","date":"Fri Jun 10 18:47:28 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As Louisianans, this energy crisis is infuriating because our state has both the natural resources and the workforce to make America energy independent again. I joined @al_quartemont and @cenlaishome on KSYL in Alexandria to discuss. https://t.co/4vdVGK4H3W","date":"Fri Jun 10 16:22:09 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"How much more pocketbook pain do American families have to endure before the Administration finally steps up to fix this economic crisis?\n\nhttps://t.co/KZTlUioQSV","date":"Fri Jun 10 14:52:49 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Loved having the @LSUAgCenter's Leadership Class stop by our office. They ensure that the U.S. continues producing the world's safest and most abundant food supply. https://t.co/Z6pXgPsgGK","date":"Thu Jun 09 17:55:24 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was an honor to pay tribute to Sherra Fertitta on the House Floor today.\n\nThe best way to describe Sherra is to use the words of her daughter, Tori. She said, “her happiness was in seeing the happiness and good works of others.” https://t.co/EoYQvV8sXe","date":"Thu Jun 09 16:13:44 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Russia's invasion of Ukraine has exacerbated the global food insecurity crisis. At yesterday's @HouseAppropsGOP subcommittee hearing, I asked @USAmbUN how she plans to advocate for American agriculture so our farmers can help feed the world again. https://t.co/0liY56BsVE","date":"Thu Jun 09 15:08:51 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"America's veterans deserve the best possible medical care we can provide. We're co-sponsoring H.R. 845, the VA Billing Accountability Act, to ensure our heroes won't have to bear the financial costs of bureaucratic billing errors.\n\nhttps://t.co/geMtW6tNDS","date":"Wed Jun 08 23:26:11 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"At today’s @HouseAppropsGOP subcommittee hearing, we questioned @USAmbUN about what the United States is doing to push back against the UN Human Rights Council’s unfair targeting of Israel. https://t.co/dtr7R0uBYp","date":"Wed Jun 08 21:33:07 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congressman John Cooksey was an outstanding American dedicated to serving his country and improving the lives of others. Last night, we went to the House Floor to honor his life and legacy. https://t.co/B24rFn9iu8","date":"Wed Jun 08 20:14:13 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Rural America is hurting as gas prices continue to rise. Until we finally unleash the full power of domestic production, our people will keep paying these outrageous costs.\n\nhttps://t.co/7f60l729Wf","date":"Tue Jun 07 20:35:49 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"When America's disabled veterans come home, they deserve all the help we can provide. That's why we're co-sponsoring H.R. 5819 to increase the funding our heroes receive to make their homes safe and accessible.\n\nhttps://t.co/4zKXKSgnWZ","date":"Tue Jun 07 18:32:29 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team was excited to join our community and business leaders in Monroe last week for the opening of Ochsner-LSU Health’s new Community Health Center! https://t.co/LGwWUTQpY5","date":"Tue Jun 07 16:40:51 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Honored to visit with some of our veterans today at the American Legion in Monroe! https://t.co/sFALv5gpcf","date":"Mon Jun 06 21:25:41 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, our grateful nation pauses and reflects on the service and sacrifice of the men who stormed the beaches at Normandy. Their heroic fight to defeat tyranny and oppression continues to inspire us. #DDay https://t.co/lsUDFfSQ7v","date":"Mon Jun 06 20:19:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The kiddos always love to help in their Papa’s garden — especially when it’s time to harvest! https://t.co/X1JhcQHAsI","date":"Sun Jun 05 23:46:55 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congressman John Cooksey was a selfless and dedicated public servant. He gave my late husband Luke his start in politics, and for me, he was more than a predecessor; he was a trusted mentor, confidant, and friend. We will miss him and pray for his family and friends across #LA05. https://t.co/m3BLAOWdsf","date":"Sun Jun 05 00:19:17 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05: This week is the start of Hurricane Season - it's time to make sure that your family is prepared. Click ⬇️ for helpful information and guidance. \n\nhttps://t.co/zOT7Su7J7o","date":"Sat Jun 04 13:44:36 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every single day, we hear from working families across #LA05 who are struggling to make ends meet in this economy. \n\nInstead of providing a solution, this Administration is just doubling down on the failed policies of the past.\n\nhttps://t.co/NQFyzAlx7I","date":"Fri Jun 03 22:49:00 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Joined the @AmiteChamber and the Rotary yesterday to discuss our work on Capitol Hill and how we’re fighting to bring home results for the Florida Parishes. https://t.co/pEKq3IWvKl","date":"Fri Jun 03 13:32:21 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Treasury Secretary admitted this week that she didn’t fully understand the damage that inflation would do to our economy.\n\nWhen is this Administration going to realize that their failed policies caused this economic crisis?\n\nhttps://t.co/L3JmmPBsVz","date":"Thu Jun 02 20:37:36 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re excited to see this investment in #LA05, which will create new jobs and opportunities for our citizens!\n\nhttps://t.co/nPf8MlPcY5","date":"Wed Jun 01 21:12:02 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Because of inflation, American families will pay an extra $5,000 this year just to meet their basic expenses.\n\nPeople are hurting, with no plan in sight from this Administration and the majority in Congress.\n\nhttps://t.co/qBxzz2fJko","date":"Wed Jun 01 16:30:14 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"So excited for the SPERO program at @LSUAlexandria! Thank you for letting us be a part.","date":"Wed Jun 01 13:53:26 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to @LaTechBSB on winning the C-USA Conference Tournament! Best of luck in the Austin Regional! #EverLoyalBe","date":"Tue May 31 21:20:41 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to @CityofMonroe and @WestMonroeCity on winning the Cleanest City Awards! \n\nhttps://t.co/p1XGheVUpx","date":"Tue May 31 19:02:39 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The President outlined his plan to fight inflation in today's @WSJ. But he doesn't seem to understand that more domestic energy production will lead to lower gas prices, which will in turn bring down the costs of nearly every product we purchase.\n\nhttps://t.co/wpsHoZDNeN","date":"Tue May 31 16:55:24 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"On #MemorialDay, our grateful nation remembers and honors our heroes who never came home, the brave men and women who made the ultimate sacrifice. https://t.co/iUSu92j963","date":"Mon May 30 12:19:27 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to @ULM_Official Police Director Tom Torregrossa on his selection to serve in a senior leadership role for the Louisiana Association of Chiefs of Police! #TheBestIsOnTheBayou\n\nhttps://t.co/q1MNYEPWPr","date":"Fri May 27 19:30:25 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The increased cost of gas and diesel have added yet another financial burden on farmers, who are already coping with high fertilizer prices. Until we fix this energy crisis, they will be forced to keep passing the added expense on to consumers.\n\nhttps://t.co/kWXZu9NMeO","date":"Fri May 27 17:02:20 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Since this Administration won’t prioritize oil and gas production here at home, we’re co-sponsoring H.R. 6858, a bill that requires the President to create an energy security plan that prioritizes domestic energy.\n\nhttps://t.co/5gt6Jzd1Yw","date":"Fri May 27 14:48:31 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is so amazing to see some of our heroes returning home to Fort Polk after a deployment overseas!\n\nhttps://t.co/HKdu0tiBLA","date":"Thu May 26 21:15:48 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re co-sponsoring H.Res. 1020, to stop this Administration's negotiations with the oppressive regimes in Iran and Venezuela and instead unleash the power of America’s domestic oil and gas production.\n\nhttps://t.co/LAi9Y9lZEH","date":"Thu May 26 20:00:10 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Gas prices have nearly doubled in the past two years. It’s time for us to harness the power of our domestic energy and stop the pain at the pump for American families.","date":"Thu May 26 18:35:20 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Click ⬇️ to learn more about some of the events this Memorial Day weekend around #LA05!\n\nhttps://t.co/JdBWWXJBy7","date":"Thu May 26 00:29:06 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The supply chain crisis is one of the top concerns we have in Congress. I appreciated the opportunity to meet with the employees at Willamette Valley’s Pineville location who are working hard to address this problem and keep critical goods flowing throughout #LA05. https://t.co/chgoVLvRpC","date":"Wed May 25 21:04:38 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This Administration shut down the Keystone Pipeline on their first day and crippled our ability to refine oil and gas here in America. That’s why I’m cosponsoring H.R. 684, which authorizes the completion and opening of this critical pipeline.\n\nhttps://t.co/YOtkQxLryg","date":"Wed May 25 16:16:38 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I am heartbroken for those who lost their lives today at Robb Elementary School. Our prayers go out to the families, loved ones, and first responders in Uvalde.","date":"Tue May 24 22:40:03 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The majority’s answer to the formula crisis is writing a massive check to the very agency that ignored every warning sign. \n\n@HouseGOP members are introducing bills that will actually put formula back on shelves instead of just giving a pay raise to government bureaucrats.","date":"Tue May 24 21:02:17 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"\"The little boy from Ferriday, Louisiana, listening to Jimmie Rodgers and Hank Williams never thought he’d be in a Hall amongst them.\" \n\nCongratulations to Jerry Lee Lewis, a true #LA05 legend, on his induction to the @countrymusichof! \n\nhttps://t.co/yx9WcLSqXl","date":"Tue May 24 17:25:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It's always great to be back in Central Louisiana! Thanks to the @CenlaChamber for hosting me today to provide an update on the critical work we have underway in #LA05 and Washington. https://t.co/lNZ8SK6ToW","date":"Tue May 24 00:14:52 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Louisiana has both the natural resources and the skilled workforce that can make America energy independent again. It’s infuriating that our people are now paying record high gas prices because of this Administration's war on domestic production.\n\nhttps://t.co/SzuApw4mRj","date":"Mon May 23 20:09:43 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Parents across the country are having to admit their children to the hospital because they can't find the basic, life-sustaining formula their baby needs.\n \nThey can't wait for it to \"gradually get better.\" https://t.co/UEvCfgW2pP","date":"Fri May 20 19:26:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"America's farmers have been forced to cope with rapidly rising costs of fertilizer and are now feeling the crunch of this fuel crisis. Until Congress is serious about real relief for our farmers, Americans will be paying the price at the grocery store. \n\nhttps://t.co/du3PPsckyz","date":"Fri May 20 18:02:18 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, I questioned @DrCaliff_FDA on when exactly we can expect formula back on the shelves.\n\nHis answer: “It will gradually get better.” https://t.co/kz5NjNFRJR","date":"Thu May 19 16:52:43 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Choudrant High School on winning the @LHSAA’s Class B State Championship in baseball! Back-to-back titles for the Aggies! \n\nhttps://t.co/iIoIiWAw5y","date":"Wed May 18 20:45:01 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The @US_FDA knew that this formula crisis was coming. \n\nWhy did they not plan accordingly? \n\nhttps://t.co/PVCfdxWjMj","date":"Wed May 18 19:55:04 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Rodney Morine, an independent trucker from #LA05’s Opelousas in the @WSJ: “His fuel costs have gone up ‘easily 25% or 30%,’ adding about $150 to the cost of a trip from Louisiana to Georgia.”\n\nThe high price of diesel is hurting our small businesses.\n\nhttps://t.co/rQ1QAK4BYo","date":"Wed May 18 17:49:39 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a mother, I am infuriated that families across the country can’t access baby formula. The American people are suffering because of this Administration’s inability to govern. \n\nhttps://t.co/CVw5LNCe6v","date":"Tue May 17 19:41:33 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The solution to high gas prices is simple — unleash the power of America’s domestic energy. \n\nhttps://t.co/4mKvVZowzP","date":"Tue May 17 16:02:56 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every day, our brave police officers put themselves in harm’s way to keep our communities safe. Honored to join with @RepMichaelGuest and 77 colleagues to pay tribute to the 619 officers, including 10 Louisianans, who have made the ultimate sacrifice.\n\nhttps://t.co/APRA9T9SxT","date":"Tue May 17 13:21:23 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Oak Grove High School on winning the @LHSAA’s Class 1A State Championship in baseball! Back-to-back titles for the Tigers!\n\nhttps://t.co/WlFvMvmX06","date":"Tue May 17 01:07:03 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to West Monroe’s @RebelBaseball1 on winning the @LHSAA’s Class 5A State Championship! It’s incredible to have this team bring the title back to West Monroe after 23 years.\n\nhttps://t.co/gZb9rezIWW","date":"Mon May 16 22:47:52 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"On @HouseAppropsGOP, we're fighting for Louisiana's farmers and educational priorities, working to restrain the growth of government, ensure we are making strategic investments in our future, and are ultimately responsible stewards of your tax dollars.\n\nhttps://t.co/jis4clrJIZ","date":"Mon May 16 20:52:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 FAMILIES: If you are trying to find baby formula, see the resources ⬇️ for assistance and guidance. \n\n— Chat with a Gerber expert: \n🔗 https://t.co/QUe5hKiuVB\n\n— Call Abbott’s consumer hotline: \n📞 1-800-986-8540\n\n— Call Reckitt's customer service: \n📞 1-800-222-9123 https://t.co/pAKGjhTD0r","date":"Mon May 16 18:59:39 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: @HHSGov has launched a new website to help families locate the baby formula they need. Click ⬇️ to learn more about this resource. \n\nhttps://t.co/JXVRxG2WoZ","date":"Mon May 16 15:25:05 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN PARENTS: Click ⬇️ to learn more about @HHSGov’s new website to help families find formula.  \n\nhttps://t.co/JXVRxG2WoZ","date":"Sat May 14 01:05:52 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"\"I can't help but reflect on the amazing experience of carrying my first child and feeling for the first time those incredible flutters of life. I remember being filled with awe and wonder at the miracle growing inside of me.\"\n \nAs a mother, I'll always fight to defend life. https://t.co/1QqNjRbfjH","date":"Fri May 13 17:54:33 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Mayor Clarence Fields of Pineville is an incredible individual who made his hometown better through public service. It was an honor to pay tribute to him on the House Floor as he enters his final weeks in office. https://t.co/Ytn33sYoLz","date":"Fri May 13 15:23:43 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I don’t understand this logic at all. Gas prices are soaring and this Administration keeps doing everything they can to stop domestic production.\n\nhttps://t.co/nwEUroV6g0","date":"Thu May 12 21:05:47 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We're excited to see the @USDOT award a grant of $3.5 million to @EnglandAirpark and the Alexandria International Airport. This funding will be used for improvements to ensure this critical transportation hub continues to be an economic driver for #LA05.\n\nhttps://t.co/RImgxDiOKw","date":"Thu May 12 18:08:04 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re all on Team Louisiana. So grateful for the support of my colleagues in our delegation!","date":"Thu May 12 15:47:47 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks @RepAshleyHinson! I can’t wait to get started and work with you and my colleagues on @HouseAppropsGOP.","date":"Wed May 11 16:59:03 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Being selected to serve on @HouseAppropsGOP is an honor, and I appreciate the trust that @HouseGOP has placed in me. I look forward to working with my colleagues to be responsible stewards of your taxpayer dollars and deliver results for #LA05.\n\nhttps://t.co/fzyKRP6pgs","date":"Wed May 11 15:08:44 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"\"Use your brilliant minds to never stop learning, your hands to serve others, your mouths to speak words of life and of hope, and your eyes to see the good in other people.\" \n\nIt was an honor to join @LC_University as their commencement speaker. Congratulations to the graduates! https://t.co/24DDTKlGM2","date":"Tue May 10 17:41:48 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Last year, Congress debated perhaps the most extreme abortion bill in history. As a mother, I firmly believe that we must stand up for those without a voice. https://t.co/FY0glsARtN","date":"Tue May 10 15:41:20 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a mom, this story is horrifying. The supply chain crisis is leading to families being unable to buy formula for their newborns. It's clear that the American people need a solution, but aren't hearing any from this Administration.\n\nhttps://t.co/6T8rQMm5jG","date":"Mon May 09 19:41:31 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"“Mama”—the sweetest name I’ll ever know 💙💜 Happy Mother’s Day! https://t.co/JrceDiixnO","date":"Sun May 08 19:22:41 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’ve lost a Louisiana legend today. During an incredible life that made him one of country music’s most notable artists, Mickey Gilley always remained true to his roots in rural Concordia Parish. \n\nhttps://t.co/mmcDpnd1qS","date":"Sat May 07 22:43:35 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@RepGarretGraves joined @MayorEllis and I at the @MonroeAirport today to share some insight from @TransportGOP and discuss the exciting projects they have underway. Excited to have two of my predecessors, @DocAbraham and Rodney Alexander, participate in the discussion as well! https://t.co/LR9RjlV5ZF","date":"Fri May 06 22:53:02 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Glad to have my friend and colleague @RepGarretGraves in #LA05 today as we joined @ULM_Official and @CityofMonroe to discuss establishing a water campus in Northeast Louisiana. https://t.co/9EQgqKj3uI","date":"Fri May 06 20:23:31 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our hardworking farmers are the backbone of #LA05. That’s why our team has been out in the field, meeting with farmers and hearing about their concerns and challenges firsthand. https://t.co/jBlfBNjJU0","date":"Fri May 06 17:25:22 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re excited to see @EntergyLA investing in #LA05 and creating nearly 170 new jobs in West Monroe! \n\nhttps://t.co/fs5TcHjB1p","date":"Fri May 06 15:58:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is so inspiring to see Evie Hilburn's optimism and spirit. I know firsthand how the people of this community can lift you up. We're all rooting for you, Evie!\n\nhttps://t.co/m7AoMx6g8W","date":"Fri May 06 00:45:34 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The past year has been filled with so many unexpected and unprecedented challenges for American families. On this National Day of Prayer, my prayer is for the people of #LA05 and our nation. https://t.co/ShaP8wPWMO","date":"Thu May 05 18:16:23 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s amazing to see the work that is being done at the Madison Parish Port to attract investment and create jobs and opportunity in the Delta. #LA05 https://t.co/H4wvq1GgZW","date":"Thu May 05 17:12:42 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Rice is a vital part of agriculture in #LA05. Visited Kennedy Rice Mill in Mer Rouge this week to learn more about the production, processing, and packaging of this important commodity in our region. https://t.co/9P8t52Ewof","date":"Wed May 04 15:17:28 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Lake Providence Port is a critical transportation hub and economic driver for #LA05. During our visit today, our team discussed how to continue bringing federal resources and funding to this important facility. https://t.co/Tu3sMJqhTc","date":"Tue May 03 23:35:33 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Visited @PanolaPepper in Lake Providence today to learn more about how this amazing local company creates their uniquely Louisiana products! https://t.co/CjZoZOfIRp","date":"Tue May 03 22:01:24 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"See my full statement on the Supreme Court’s draft opinion ⬇️ https://t.co/iAao6H6a97","date":"Tue May 03 20:08:29 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was such an honor to join Riverfield Academy in Richland Parish this week to speak to their graduating seniors. A special thanks to Senior Katelyn Branch for inviting me to participate in this momentous occasion. Congratulations to the class of 2022! https://t.co/XJk5fp9Phm","date":"Tue May 03 17:35:50 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With the House out of session, we have our whole team working from #LA05 this week. We had an amazing lunch at the soda fountain at E.W. Thomson Drug in Delhi! https://t.co/jZ0eJrbeag","date":"Mon May 02 17:59:29 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"TOMORROW is Service Academy Day! Join us at @BPCCCavs at 9:00 a.m. to learn more about attending @WestPoint_USMA, @NavalAcademy, @AF_Academy, @USCGAcademy, and @UsmmaO. #LAED https://t.co/GJ5TGXSXWw","date":"Fri Apr 29 20:09:13 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: At our urging, @CommerceGov is investing $2 million in the healthcare workforce development programs at LaSalle General Hospital. This project will help improve care in #LA05 and create more than 250 jobs over the next decade.\n\nhttps://t.co/TzFRuhUvel","date":"Fri Apr 29 18:49:49 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It's simple. Government bureaucrats shouldn't be deciding what is free speech.\n\n.@SecMayorkas should instead be working to secure our border and stop migrants and illegal drugs from pouring into our country every day.\n\nhttps://t.co/IUP4KxT7vh","date":"Fri Apr 29 17:22:39 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Do you know a student from #LA05 who might be interested in serving in the military while also learning at one of the nation’s most prestigious universities? \n\nHave them join us this Saturday, April 30 at @BPCCCavs for Service Academy Day! https://t.co/04U6wpZwcm","date":"Thu Apr 28 20:31:54 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Marilyn Musgrave and @SBAList for stopping by our office today to discuss the Dobbs case and our continued fight to defend the unborn. https://t.co/rogvnzB8Bv","date":"Thu Apr 28 18:29:04 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The crisis at our southern border has led to fentanyl pouring into communities across America. That's why we're co-sponsoring H.R. 6184 - the HALT Fentanyl Act to crack down on this lethal drug and impose harsher penalties on those who distribute it.\n\nhttps://t.co/lWDUWIIPnd","date":"Thu Apr 28 16:53:04 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Had the opportunity to visit with Dr. Ray Morrison and his amazing students from @vcomlouisiana this morning! So glad we have these bright future doctors obtaining their medical education here in #LA05. https://t.co/gV48Oyovxc","date":"Wed Apr 27 20:27:39 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 STUDENTS: If you or someone you know are interested in learning more about attending one of America’s service academies, join us this Saturday, April 30 from 9:00 a.m. to 12:00 p.m. at @BPCCCavs. https://t.co/YbcwE1rK4p","date":"Wed Apr 27 18:36:22 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Last year, detained migrants were released in #LA05 without any notification. That's why we're co-sponsoring H.R. 6592 - the Immigration Transparency and Transit Notification Act, to ensure our state leaders will have this information and can deny entry.\n\nhttps://t.co/y07hWJGDVC","date":"Wed Apr 27 17:01:56 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"At our urging, @CommerceGov is investing $2 million in the healthcare workforce development programs at LaSalle General Hospital. This project will not only improve medical care in #LA05, it will also help create nearly 250 jobs over the next decade.\n\nhttps://t.co/TzFRuhUvel","date":"Tue Apr 26 19:04:44 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Do you know a student from #LA05 who might be interested in serving in the military while also learning at one of the nation’s most prestigious universities? \n\nHave them join us this Saturday, April 30 at @BPCCCavs for Service Academy Day! https://t.co/axATITddWR","date":"Tue Apr 26 18:52:09 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It's clear that America has a crisis at our southern border. That's why my @HouseGOP colleagues and I sent a letter to @SecMayorkas, demanding specific answers on how @DHSgov plans on enforcing our laws and why our nation's border security has been allowed to deteriorate. https://t.co/0boYHTtx3t","date":"Tue Apr 26 17:48:15 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 STUDENTS: Join us this Saturday for Service Academy Day in Bossier City and learn more about attending @WestPoint_USMA, @NavalAcademy, @AF_Academy, @USCGAcademy, and @UsmmaO! #LAED https://t.co/aqwQ9LussM","date":"Mon Apr 25 20:21:42 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"#LA05's rural communities are hit hardest by the rise in gas prices, because our people drive further to work, take their kids to school, and buy groceries at the store. That's why we're fighting to unleash the full power of American energy production.\n\nhttps://t.co/QWFKPsXUpR","date":"Mon Apr 25 18:19:50 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"America is seeing a massive surge of migrants at our southern border. That’s why we're co-sponsoring H.R. 6239 - the Upholding the Law at Our Border Act, a bill to give more resources and information to law enforcement and strengthen border security.\n\nhttps://t.co/kVhcBtu2BW","date":"Mon Apr 25 16:07:17 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 STUDENTS: If you’re interested in attending @WestPoint_USMA, @NavalAcademy, @AF_Academy, @USCGAcademy, or @UsmmaO attend our delegation's upcoming Service Academy Day in Bossier City on April 30! #LAED https://t.co/A9lDA1Wk3R","date":"Fri Apr 22 17:58:59 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This week, our team presented @USArmy veteran James Kroemeke of Franklin Parish with his National Defense Service Medal and military decorations recognizing his service to our nation.\n\nWe love being able to honor our #LA05 heroes! https://t.co/wQsYGJplnM","date":"Fri Apr 22 15:49:07 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Inflation will cost an American family nearly $5,200 this year. Every day, we hear from people across #LA05 who are struggling to make ends meet. Congress needs to be focused on economic recovery, not making this problem worse.\n\nhttps://t.co/xqnqczJMRd","date":"Thu Apr 21 19:56:06 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With the crisis at our southern border, massive amounts of fentanyl are coming into the United States. Until we enforce our laws and strengthen America's border security, this lethal drug will continue to wreak havoc on our communities.\n\nhttps://t.co/KOzPgvYrZT","date":"Thu Apr 21 17:41:51 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team enjoyed joining the @monroe_chamber this morning!","date":"Thu Apr 21 15:28:05 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re excited to see this federal investment of $100 million in #LA05! Our team was proud to support this project, which will bring new jobs and opportunity to Concordia Parish.\n\nhttps://t.co/iMkSZoEHUX","date":"Wed Apr 20 21:12:04 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In 2019, three churches in St. Landry Parish were burned by an arsonist. But now, new houses of worship are rising from the ashes. It is inspiring to see the perseverance of these congregations as they continue working to rebuild!\n\nhttps://t.co/vriXQRKNUJ","date":"Wed Apr 20 19:24:10 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Last week, Vladimir Putin sanctioned my colleagues and I for refusing to ignore the atrocities he and his henchmen have committed in Ukraine. We’re incredibly proud to stand with the people of Ukraine as they continue their fight for freedom.\n\nhttps://t.co/dbGgOZiF5R","date":"Tue Apr 19 19:23:20 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The deep freeze Louisiana experienced in 2021 devastated our crawfish farmers. As our state's only member on @HouseAgGOP, I helped lead our delegation in demanding that the @USDA expedite this critical disaster assistance. https://t.co/hABBQmuDas","date":"Tue Apr 19 18:07:44 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The numbers at our southern border are just staggering. That’s why my @HouseGOP colleagues and I are fighting to give more resources, tools, and information to law enforcement so we can finally secure the border.","date":"Tue Apr 19 16:05:27 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With the costs of fertilizer and other critical production inputs rising at an unprecedented rate, we should be looking at ways to bring relief to our farmers, not saddling them with another financial burden.","date":"Mon Apr 18 21:52:29 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s Tax Day, but this year, Americans will be waiting for their refunds because of the IRS’ massive backlog. That’s why we fought against the other side’s plan to weaponize the IRS, because they need to be focused on carrying out their most basic duty.\n\nhttps://t.co/RNmVPyGj4V","date":"Mon Apr 18 20:09:01 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Had an insightful visit with @DeltaRegional Alternate Federal Co-Chair @leslie_durham last week as we discussed new ways to bring home opportunity and investment to #LA05. https://t.co/yZNwknDEcd","date":"Mon Apr 18 17:54:32 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"“He is not here: for he is risen, as he said.” —Matthew 28:6 \n\nHappy Easter from our family to yours! https://t.co/ac4qFMdU3h","date":"Sun Apr 17 13:18:20 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Vladimir Putin sanctioned me and 397 of my colleagues because we won’t just stand by and ignore the brutal genocide Russia has inflicted on innocent Ukrainians. \n\nThe United States stands with the brave people of Ukraine as they continue the fight to maintain their independence. https://t.co/klvVm6OAg3","date":"Thu Apr 14 17:54:42 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"One year ago, I took the oath of office as your Congresswoman. Every day, I’m inspired by the people of #LA05 and honored to be a voice for our region in Washington. Holding this seat is truly the honor of a lifetime and I’m determined to make every second count. https://t.co/V2g6kdAYYD","date":"Thu Apr 14 13:24:14 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Always great to see my friend, Sheriff Randy “Country” Seal, when we’re in Washington Parish! https://t.co/EOKBTJtT3U","date":"Wed Apr 13 18:48:34 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s awesome to be back in Washington Parish today meeting with community leaders and local officials! https://t.co/fwmc59yRnd","date":"Wed Apr 13 16:12:35 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed stopping by St. Francisville’s Town Hall to visit with Mayor Bobee Leake and his team! https://t.co/SJZHMLSw9Y","date":"Tue Apr 12 20:32:36 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"West Feliciana Hospital is leading the way when it comes rural healthcare. Glad to have the opportunity to tour this amazing facility and meet their healthcare heroes! https://t.co/2TMAYFK7Xa","date":"Tue Apr 12 19:35:45 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"So excited to be at @WestFelHS in St. Francisville today to present Wyles Gilfoil with a certificate in honor of his appointment to @WestPoint_USMA! We know he will make #LA05 so proud! https://t.co/BmkhNq4PXT","date":"Tue Apr 12 17:22:20 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Joined farmers in Tensas and Madison Parishes today to discuss our work on @HouseAgGOP and hear their concerns as my colleagues and I start discussions on the Farm Bill. https://t.co/AzHPCSTsqq","date":"Tue Apr 12 00:08:43 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Look forward to joining the graduates at @LC_University's Commencement on May 7! #ClawsUp\n\nhttps://t.co/pfYdWtGUE8","date":"Mon Apr 11 20:06:54 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The chaotic situation at our southern border means more illegal drugs are coming into the United States. That's why my @HouseGOP colleagues and I are fighting to give law enforcement more tools, resources, and information as they confront this crisis.\n\nhttps://t.co/me9WazeNVu","date":"Mon Apr 11 14:33:55 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to West Monroe’s Matthew Horton, the commander of America’s newest nuclear submarine, the USS Delaware. Thank you for your service — you make #LA05 incredibly proud! \n\nhttps://t.co/Jb4LRF3vG0","date":"Sat Apr 09 23:10:19 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Such an amazing life — Harry Silver will be deeply missed by the many in Alexandria who were touched by his decades of service to the community.","date":"Sat Apr 09 16:18:02 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In the lead up to World War II, the U.S. Army and leaders such as Dwight Eisenhower and George Patton trained for combat in #LA05. Click ⬇️ to learn more about the Louisiana Maneuvers!\n\nhttps://t.co/rnxGg5I2ag","date":"Fri Apr 08 20:21:29 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Vidalia's own Bryce McGlothin on a great run on the opening weeks of @AmericanIdol! You make #LA05 proud and we know this is just the beginning of an incredible musical career.\n\nhttps://t.co/XTWzHsMPi2","date":"Fri Apr 08 18:42:45 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team was so excited to join the Louisiana Women in Agriculture conference to discuss our work on @HouseAgGOP and continued advocacy for our state’s hardworking farmers, ranchers, and loggers. https://t.co/mi27gwdkeC","date":"Fri Apr 08 16:24:08 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"So many great activities on campus this weekend at @ULM_Official! Learn more about Super Warhawk Weekend ⬇️ #TheBestIsOnTheBayou","date":"Thu Apr 07 23:50:16 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Earlier this week, we met with @SecVetAffairs to make the case for why the Alexandria VA Hospital is critical to CenLa and #LA05. \n\nhttps://t.co/6xrK5eETpk","date":"Thu Apr 07 22:10:12 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Louisiana Shared Stewardship will bring together partners to help sustain the health and productivity of our state’s forests. Our team was proud to attend the official signing of this agreement yesterday! https://t.co/vvetaq4E4q","date":"Thu Apr 07 20:24:12 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"On Day One, this Administration banned all new oil and gas leasing in the Gulf of Mexico and canceled the Keystone Pipeline. Because of those disastrous energy policies, Americans have seen an 81% increase in gas prices. It's time to end their war on domestic production.","date":"Wed Apr 06 21:19:02 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Excited to have President @RickGallot on Capitol Hill today! Enjoyed visiting with him and discussing the great things underway at @Grambling1901. https://t.co/BGsgGZZsuC","date":"Wed Apr 06 19:08:42 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our brave firefighters do so much to protect our communities and keep our citizens safe. It was an honor to host our Fire Chiefs from across Louisiana on Capitol Hill today! https://t.co/u9K8z3NhQX","date":"Wed Apr 06 18:14:02 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, I met with @SecVetAffairs to discuss the proposed closure of the Alexandria VA Hospital. I emphasized to him that simply closing this facility is unacceptable – because it will eliminate critical care for our veterans and shutter the fourth largest employer in CenLa. https://t.co/WREginpbvS","date":"Tue Apr 05 22:46:49 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"When you look at this Administration’s education budget, it’s clear they don’t consider parents a priority. That should tell you everything about their education policies.\n\nWhen it comes to our children’s learning, parents must have a seat at the table.\n\nhttps://t.co/CXtqtBB6kc","date":"Tue Apr 05 18:39:19 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a mother, I am horrified by the reports of atrocities in Ukraine. Vladimir Putin and his henchmen have inflicted genocide on innocent civilians. His regime must be held accountable for these awful war crimes.\n\nhttps://t.co/pYKjMe8gPJ","date":"Tue Apr 05 15:00:25 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team loved being able to join community leaders in Grant Parish last week for the Dogwood Festival ribbon cutting! https://t.co/sJDZHtBBgx","date":"Mon Apr 04 21:31:59 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We again have the risk for severe weather across #LA05 tonight. Please make sure you are prepared, closely monitor the forecasts, and follow all warnings from state and local officials. #LAWX","date":"Mon Apr 04 20:01:17 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Inflation will cost working families more than $5,000 this year. This Administration wants to cherry-pick some statistics to prop up their rosy economic narrative, but that’s not the financial reality we're all facing. It’s an economic crisis.\n\nhttps://t.co/21qthzLraj","date":"Mon Apr 04 18:34:23 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Helping citizens find a job and connecting employers with skilled workers is an essential part of building our economy. Proud to work with @RepStefanik, @RepSteel, and @RepRickAllen on this bill so more Americans can utilize their skills and education in the job market.","date":"Mon Apr 04 17:03:57 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Americans deserve full transparency when they’re saving for retirement. Proud to work across the aisle with @RepSusanWild to bring forward this common-sense legislation. \n\nhttps://t.co/rzMzXzXXcP","date":"Fri Apr 01 23:31:56 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re incredibly thankful that no lives were lost in #LA05 with the destructive storms that hit our region this week. But the damage in Tallulah and other communities is extensive. Our team is here to help our constituents recover and rebuild.\n\nhttps://t.co/AZ2FkEGS7g","date":"Fri Apr 01 18:25:16 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Tapping into the Strategic Petroleum Reserve is an irresponsible decision. This Administration's stubborn refusal to ramp up domestic energy production is not only costing Americans more at the pump, it is compromising our emergency preparedness.\n\nhttps://t.co/oZPdG04NaM","date":"Fri Apr 01 15:36:12 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to East Feliciana’s Amelia Kent on such a tremendous honor! We know you will be an outstanding voice for farmers in this role.\n\nhttps://t.co/RGXN4TacVI","date":"Thu Mar 31 19:08:30 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Earlier this week, we passed the COVID-19 American History Project Act in the House with bipartisan support. Our bill will ensure that it is the voices of ordinary Americans who write the history of this pandemic and preserve their stories for future generations. https://t.co/QV1XvYAvwH","date":"Thu Mar 31 17:04:31 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re saddened to see the damage that today’s storms have brought to #LA05. We have been in close contact with state and local leaders to offer assistance. Our team is here to help our region recover.","date":"Wed Mar 30 20:23:58 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Severe weather is crossing #LA05 now. Please follow all warnings and monitor the forecasts! #LAWX","date":"Wed Mar 30 17:58:43 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re expecting severe storms with the possibility of tornadoes across #LA05 today. Please exercise caution if you need to travel, closely monitor the forecasts, and heed all warnings from state and local officials.","date":"Wed Mar 30 13:19:15 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Honored to have bipartisan support for the COVID-19 American History Project Act. This bill is about healing and hope after the tremendous losses our nation experienced. \n\nhttps://t.co/eD7hDoqpZw","date":"Tue Mar 29 23:00:06 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"“I know from my own life experiences that when we tell our stories of tragedy and loss, that is when true healing begins. It is time for the American people to heal.” \n\nMore ⬇️ on our COVID-19 American History Project Act. https://t.co/K4A2n6dgw8","date":"Tue Mar 29 22:31:58 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"My first week in Congress, I had the opportunity to sit by @repdonyoung and the Dean took a few minutes to offer this freshman some words of wisdom. He was truly one of a kind and we’ll miss his booming voice and incredible spirit in the House.","date":"Tue Mar 29 16:35:18 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This Administration's proposed budget includes a massive tax increase on family farms. Our farmers are already facing shrinking margins and rising input costs. Our family farms need assistance and support, not bigger financial burdens.","date":"Tue Mar 29 15:33:23 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"How much mail does our office send to #LA05? Keep an eye out for our latest Letlow letter in your mailbox! https://t.co/rZwLPboDHC","date":"Mon Mar 28 21:14:40 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"So many working families across #LA05 are struggling to make ends meet. Inflation is eating away at Americans’ paychecks, but this Administration’s only solution is to embrace the failed ideas of the past.","date":"Mon Mar 28 17:16:50 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations Chancellor @coreil_paul!","date":"Fri Mar 25 23:50:29 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In Louisiana, we have the oil and gas reserves, the refining capacity, and the skilled workforce that can help make America energy independent again and bring down gas prices. We just need this Administration to stop their war on domestic production.\n\nhttps://t.co/2pRXBkq7pS","date":"Fri Mar 25 19:02:30 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Under no circumstances should Iran's Islamic Revolutionary Guard Corps be removed from the list of foreign terrorist organizations. That's why @RepFranklin, my @HouseGOP colleagues, and I are urging @SecBlinken and the @StateDept to continue holding them accountable.","date":"Fri Mar 25 17:56:45 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Bringing passenger rail service to Northeast Louisiana is an opportunity to connect not only our cities but our rural communities to the rest of the country. That’s why we’re urging @Amtrak to expand into #LA05. \n\nhttps://t.co/01cgOOjUz0","date":"Fri Mar 25 16:44:59 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"So excited to see @LSUAlexandria’s SPERO program open for applications! Our team was incredibly proud to secure federal funding for this amazing program and guide it through the appropriations process in Congress.\n\nhttps://t.co/7jlJsPMF8G","date":"Thu Mar 24 23:24:56 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team loved being able to join @RaefordFarms in Lincoln Parish for the opening of their new feed mill. We’re excited to have this great, family-owned company in #LA05! https://t.co/Ey0vQzQlL0","date":"Thu Mar 24 19:08:18 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In rural areas like #LA05, we have to drive more miles to work and take our kids to school. These high gas prices are killing our communities. That’s why we need President Biden to reverse his misguided energy policies and ramp up domestic production instead.","date":"Thu Mar 24 16:16:22 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Want to keep up with the latest from our office and around #LA05? Sign up for our official newsletter, The Fifth Flyer!\n\nhttps://t.co/hf4PKMOEVt","date":"Wed Mar 23 21:59:21 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"\"I firmly believe that the United States and our allies must continue to use the harshest economic and diplomatic sanctions possible and permanently expel Putin’s Russia from the international community.\"\n\nClick ⬇️ to read our op-ed on Ukraine.\n\nhttps://t.co/gUgApuCh0Z","date":"Wed Mar 23 19:20:40 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The tornado damage in South Louisiana is devastating. We stand ready to work with our colleagues in the congressional delegation and state and local officials to help our neighbors recover and rebuild.\n\nhttps://t.co/9Vq9bl0TGv","date":"Wed Mar 23 17:57:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our prayers are with our neighbors in South Louisiana tonight.","date":"Wed Mar 23 02:08:22 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to former Congressman Jerry Huckaby for stopping by our district office today! Always an insightful conversation when I can visit with one of my predecessors. #LA05 https://t.co/mR57ojAXpf","date":"Tue Mar 22 21:14:50 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Happy #NationalAgDay! Thankful for all of #LA05’s hardworking farmers and ranchers who keep our district, state, and country healthy, secure, and fed. https://t.co/0T2X2fNr8K","date":"Tue Mar 22 17:57:18 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to the @UnitedWayNELA for hosting me this morning! It was such a joy to visit with so many amazing community volunteers and civic leaders from our region. https://t.co/xZgqRaIgJX","date":"Tue Mar 22 16:52:54 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re experiencing severe weather across all 24 parishes of #LA05 today. Please take the necessary precautions and stay safe!","date":"Tue Mar 22 13:58:27 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Farmers in #LA05 are seeing increased production costs across the board. With the prices for inputs such as fertilizer continuing to go up at astronomical rates, we’re continuing to advocate for real relief for farmers because Americans can’t afford to pay higher food prices. https://t.co/QuifZhq1FJ","date":"Mon Mar 21 20:58:00 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Whip @SteveScalise hits the nail on the head. This administration would rather buy oil and gas from brutal regimes in Iran and Venezuela than ramp up our own domestic production.","date":"Mon Mar 21 19:10:08 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With severe weather headed towards #LA05, please keep up with the latest news and updates from @GOHSEP. #LAWX","date":"Mon Mar 21 17:31:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re expecting severe weather across #LA05 in the next 24 hours. Please take all necessary precautions, monitor the forecasts, and follow updates from state and local officials. #LAWX","date":"Mon Mar 21 16:30:21 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Baskin’s own Lainey Wilson on winning such an incredible recognition at the @ACMAwards. It touched our hearts to hear you remember your roots in Franklin Parish during your acceptance speech. You make #LA05 so proud!","date":"Fri Mar 18 20:16:28 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"One of the most incredible parts of serving #LA05 in Congress is nominating amazing students to America’s military academies. Called Andrew Daniel of Pineville this morning to let him know about his acceptance at the @AF_Academy! Thank you for stepping up to serve, Andrew! https://t.co/ItCUihsIpG","date":"Fri Mar 18 18:14:36 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This morning, we joined @al_quartemont and @cenlaishome on KSYL to talk about the recommended closure of the Alexandria VA hospital and how the Louisiana delegation is demanding answers from @DeptVetAffairs. https://t.co/Cf1PzEMSFx","date":"Fri Mar 18 17:08:05 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, @SenJohnKennedy and I sent a letter to @SecVetAffairs strongly urging him to reconsider the recommended closure of the Alexandria VA hospital and demanded more answers about this misguided decision. \n\nhttps://t.co/VmujkUUaqx","date":"Thu Mar 17 21:22:49 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This influx of illegal drugs, particularly fentanyl, has shown how the crisis at our southern border can devastate families. That’s why we’re working with our @HouseGOP colleagues to bring legislation that will give law enforcement more tools.","date":"Thu Mar 17 20:16:40 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s clear that this Administration is so committed to their anti-energy agenda that they will ignore the millions of Americans who are hurting because of high gas prices and prevent us from bringing real relief through increased domestic production.","date":"Thu Mar 17 18:58:46 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Not all visits to our office are about policy. Although Roxy may beg to differ! https://t.co/X5BfU5JrGt","date":"Thu Mar 17 16:19:06 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to the Amite High Lady Warriors Basketball team on winning the state championship! You make Tangipahoa Parish and all of #LA05 proud.\n\nhttps://t.co/Ji8oGUNgjR","date":"Wed Mar 16 23:27:18 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was such an honor to host Major General Keith Waddell and his team from the @LANationalGuard on Capitol Hill today. I was so moved when they presented me with the Guard’s Distinguished Civilian Service Medal. Our brave guardsmen represent the very best of Louisiana! https://t.co/1sIDIkpss9","date":"Wed Mar 16 19:30:51 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Happy Birthday Julia! \n\nNot only is she a tireless public servant, but she is also an inspiring individual, a loving mom and the best boss that anybody could ask for. \n\nThank you for all that you do for us and #LA05! \n\n-Team Letlow https://t.co/wWhBzlILYC","date":"Wed Mar 16 18:02:24 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I was deeply moved by President Zelenskyy’s words and the video he showed to my colleagues and me this morning. Vladimir Putin is a war criminal carrying out a genocide against innocent civilians. We must provide the Ukrainians with resources they can use to defend their freedom.","date":"Wed Mar 16 16:21:00 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Throughout his time in the NFL, Andrew Whitworth showed incredible class and sportsmanship both on and off the football field, representing the best of #LA05. Congratulations on an incredible career!","date":"Tue Mar 15 21:57:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In rural areas like #LA05, we have to drive more miles to work and to take our kids to school. These high gas prices are hurting our working families. If we want to bring them relief, we need to ramp up domestic oil and gas production.\n\nhttps://t.co/QWFKPsXUpR","date":"Tue Mar 15 18:48:53 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We strongly disagree with the @DeptVetAffairs’ recommendation to close their medical facility in Alexandria. See our full response ⬇️ https://t.co/344cl2AYk7","date":"Tue Mar 15 15:44:49 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Lincoln Parish’s Simsboro High on winning the state championship in boys’ basketball! You make all of #LA05 proud!\n\nhttps://t.co/mpm2hS5HwN","date":"Mon Mar 14 22:31:19 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In Louisiana, we're ready to help make America energy independent again!","date":"Mon Mar 14 19:02:02 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: With the @USDA taking action on fertilizer prices, we're continuing to work with our colleagues to ensure that American farmers can plant, and consumers are not paying outrageous prices at the grocery store.\n\nhttps://t.co/I6xbgPQRlx","date":"Mon Mar 14 16:15:19 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"After raising the issue of rising input costs for months, we're glad to see @USDA start to alleviate these concerns. It's critical that we ensure our farmers can plant and consumers are not paying outrageous prices at the grocery store.\n\nhttps://t.co/I6xbgPQRlx","date":"Fri Mar 11 19:47:43 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Across Louisiana, our citizens are now paying record high gas prices. But our state has the answer – it’s our oil and gas reserves and skilled workforce. Let’s ramp up domestic production and unleash the power of American energy.\n\nhttps://t.co/GrB5uWW9JV","date":"Fri Mar 11 18:55:39 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re expecting to see winter weather across parts of #LA05 today. Please monitor the forecasts and exercise caution if you travel. #LWAX","date":"Fri Mar 11 15:03:12 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team loved joining the students, faculty, and staff at @LADeltaCC this week to see some of the incredible learning programs and community partnerships they have underway! https://t.co/vd1EOtm4HX","date":"Fri Mar 11 01:34:01 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every single day, we hear from working families across #LA05 who are seeing their income eaten up by rising inflation. It's clear that when it comes to the economy, we need a plan that helps put dollars back in Americans’ pockets. \n\nhttps://t.co/8JOmgFjiUj","date":"Thu Mar 10 22:04:53 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In #LA05, our constituents aren’t buying expensive electric cars, they’re struggling to put food on the table. This Administration needs an energy policy that uses domestic production to lower gas prices, instead of just simply ignoring the problem.","date":"Thu Mar 10 19:24:55 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a mother, these stories are absolutely heartbreaking to read. It couldn't be any clearer that Vladimir Putin is not only a brutal tyrant, but he and his regime are vicious war criminals.\n\nhttps://t.co/3tdDrYD6F9","date":"Wed Mar 09 23:47:48 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This morning, I joined KSYL in Alexandria to discuss rising gas prices in #LA05 and why this Administration must reverse their misguided energy policies and allow states like Louisiana to fuel the nation again. https://t.co/V0Jw15Fxwa","date":"Wed Mar 09 22:24:11 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"President Zelenskyy is an inspiration not just to the people of Ukraine, but the world. All nations who stand for freedom and democracy are grateful for his leadership.\n\nhttps://t.co/GU3nisE3fy","date":"Tue Mar 08 23:29:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our people don't have to be paying outrageous gas prices at the pump. Louisiana has both the abundant natural resources and a skilled workforce ready to return to work. We just need this Administration to end their unreasonable war on domestic energy production.","date":"Tue Mar 08 22:14:25 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every student has the right to learn in a safe environment. That's why we went to the House Floor today with a bipartisan group of colleagues to support America's HBCUs after recent threats. https://t.co/ILRHhIRaEi","date":"Tue Mar 08 20:55:47 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Are you a college student looking for a unique experience to grow your educational and professional career? Our office has year-round internships available in our Washington and district offices. If you're interested, click ⬇️ to learn more and apply!\n\nhttps://t.co/tiHPlpz54E","date":"Mon Mar 07 22:02:56 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Make no mistake, Vladimir Putin is a war criminal, and his regime must be permanently expelled from the international community. That’s why my colleagues and I are bringing a resolution urging the @UN to remove Russia from the Security Council.\n\nhttps://t.co/6pyZvw9GTi","date":"Mon Mar 07 19:46:48 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is unconscionable that instead of reversing their misguided energy policies and ramping up domestic oil and gas production in states like Louisiana, this Administration wants to cut backroom deals with the brutal regime in Venezuela.\n\nhttps://t.co/wE37CVzlFx","date":"Mon Mar 07 17:34:43 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Poverty Point is an incredible historic site that the whole family can enjoy. If you haven’t been yet, we invite you to come visit soon and learn more about #LA05’s unique past.","date":"Mon Mar 07 16:02:53 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Accessing the Strategic Petroleum Reserve is not a long-term solution. This Administration needs to reverse their misguided policies that destroy domestic production and put us back on the path to energy independence.","date":"Fri Mar 04 20:13:39 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @LAPspeaks for stopping by our office this week to discuss our efforts on @EdLaborGOP and how we can work together for Louisiana’s schools! https://t.co/dgYnbRrJxw","date":"Fri Mar 04 19:11:16 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We were honored to present the students of Rayville Elementary with an American flag from the U.S. Capitol. We know that this flag will proudly fly over the school for years to come! https://t.co/l5lGyy64A3","date":"Fri Mar 04 01:36:55 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every single day, the United States buys nearly 600,000 barrels of oil from Russia. How about we stop lining the pockets of Vladimir Putin and his henchmen and instead put Louisiana's oil and gas workers back on the job?","date":"Thu Mar 03 20:37:30 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Honored to serve on @HouseAgGOP with such an incredible group of women and be an advocate for our nation’s hardworking farmers, ranchers, and loggers!","date":"Thu Mar 03 19:43:06 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This Administration wants to use the Strategic Petroleum Reserve to address rising gas prices. But this idea isn’t a long-term solution. If they want to keep Americans from paying more at the pump, they need to let states like Louisiana fuel the nation.\n\nhttps://t.co/lF1NdRELTL","date":"Thu Mar 03 00:52:53 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Yesterday, I joined my @HouseGOP colleagues to talk with families about The Parents Bill of Rights and how this legislation will bring more transparency to the learning process and help build collaborative partnerships between families and educators. https://t.co/UHNjHUC0TR","date":"Wed Mar 02 21:10:14 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"For our team, fixing the Windfall Elimination Provision and the Government Pension Offset is at the top of the agenda. Thankful to have advocates from #LA05 like @johnson_state on Capitol Hill today to discuss this critically important issue. https://t.co/u7bxWndgyy","date":"Wed Mar 02 19:31:26 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Make no mistake, the policies that the President put forward tonight are the same ideas that have failed our country time and time again. Click ⬇️ to see my full response to President Biden's State of the Union Address.\n\nhttps://t.co/ULbLCK7fY8","date":"Wed Mar 02 03:57:08 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was an honor to join families from across the country today to discuss the Parents Bill of Rights alongside @GOPLeader, @SteveScalise, @RepStefanik and my @HouseGOP colleagues. We’re fighting to ensure that parents always have a voice when it comes to their child’s education. https://t.co/NBb1ss9rBE","date":"Tue Mar 01 22:56:05 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Happy Mardi Gras #LA05!!! https://t.co/iERx2ssjEz","date":"Tue Mar 01 16:12:53 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"There is nothing like fresh Louisiana strawberries! Proud to represent Tangipahoa Parish, where we grow the world’s best. #LA05","date":"Tue Mar 01 00:00:39 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: We announced last week that @DeltaRegional will be investing over $4 million in community projects throughout #LA05. \n\nhttps://t.co/ymWBbgrhqJ","date":"Mon Feb 28 21:40:42 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The solution to rising gas prices is clear - we need to ramp up domestic production. In Louisiana, we have both the natural resources and a skilled workforce ready to return to work. Our state can once again fuel the nation and put us back on the path to energy independence.","date":"Mon Feb 28 19:14:48 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our country buys 600,000 barrels of oil from Russia every single day, but in Louisiana, we can process nearly 3.4 million barrels per day. Our state has not just the natural resources, but a workforce ready to get back on the job. Let’s unleash the full power of domestic energy!","date":"Fri Feb 25 20:16:48 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Louisiana’s oil refineries account for nearly 20% of the nation’s capacity. If we don’t want Americans paying outrageous prices at the pump, we need to ramp up production in our state again.","date":"Thu Feb 24 21:43:40 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"When America relies on foreign oil, events halfway around world send gas prices through the roof. In Louisiana, we have both the resources and the workforce that can make us energy independent again. We just need Washington bureaucrats to get out the way.\n\nhttps://t.co/pUEumZomkL","date":"Thu Feb 24 19:51:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our hearts go out to the people of Ukraine 🇺🇦 and let our prayers be with them as they continue the noble fight to maintain their independence. See my full statement ⬇️ https://t.co/KwXydSPoRr","date":"Thu Feb 24 13:45:15 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Grateful for the opportunity to visit sacred religious sites across Israel this week and speak with both leaders and policy experts about how we continue working together to help bring lasting peace to the Holy Land. https://t.co/v4xF2zNVEK","date":"Wed Feb 23 21:16:11 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team is proud to join with @DeltaRegional and our partners in state and local government to bring this federal investment of more than $4 million to #LA05. We look forward to working with them on more community projects in the future!\n\nhttps://t.co/UuufWiBuu5","date":"Wed Feb 23 20:11:51 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was amazing to meet some of the courageous men and women of the @IDF today. Their service on the front lines ensures that Israel remains a safe, free, and democratic nation. My colleagues and I are incredibly proud to stand with them. https://t.co/xlw0njFxzt","date":"Tue Feb 22 21:31:55 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Israel and the United States are bound together by our common values. Today, my colleagues and I visited the @KnessetENG in Jerusalem to reaffirm our unwavering support for Israel. https://t.co/gMgduRUR0m","date":"Mon Feb 21 22:17:40 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Such an honor to meet @IsraeliPM Naftali Bennett, Knesset Speaker @MKMickeyLevy, and @netanyahu today as we discussed the critical partnerships between the U.S. and Israel. https://t.co/0bcSkHABgC","date":"Mon Feb 21 20:29:18 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Later today, I’ll be traveling to Israel with a delegation of colleagues. I look forward to meeting with Israeli leaders to discuss strategic partnerships, the ongoing peace process, and important political and economic developments in the Middle East.\n\nhttps://t.co/6Pv1M8ZBgp","date":"Fri Feb 18 16:09:31 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Proud to work with @MayorEllis and the @CityofMonroe on this project! Our team is continuing to fight hard to bring home critical funding for #LA05.\n\nhttps://t.co/hCmBQa5yTm","date":"Thu Feb 17 20:38:07 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The United States can never allow Iran to obtain nuclear weapons. That's why we joined with more than 160 @HouseGOP colleagues demanding the Administration not enter into another disastrous diplomatic agreement and hold Iran accountable instead.\n\nhttps://t.co/Ex7YrEmxda","date":"Thu Feb 17 18:06:13 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"There is the possibility of severe weather across #LA05 today. Please monitor the forecasts, stay alert, and exercise caution when traveling.","date":"Thu Feb 17 16:03:32 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every single day, we hear from struggling small business owners across #LA05 who are dealing with the impacts of inflation. Now is not the time for Congress to double down on the misguided policies of the past, but instead focus on putting America back to work.","date":"Wed Feb 16 22:23:54 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The IRS should be focused on clearing their backlogs, not collecting Americans’ biometric data. That's why we're co-sponsoring legislation to ensure that this practice can't be put back in place again.\n\nhttps://t.co/VQgBwlCssX","date":"Wed Feb 16 21:18:14 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team enjoyed meeting farmers from across #LA05 this weekend at the Frogmore Agriculture Appreciation Day Dinner in Concordia Parish! As Louisiana's only member on @HouseAGGOP, we're proud to be an advocate for our state's farmers. https://t.co/sNix06ckYd","date":"Wed Feb 16 19:46:16 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"No doubt this will be the best looking car on the track! As we all know well, when @Grambling1901 is on a national stage, they always give an incredible performance!","date":"Tue Feb 15 23:58:59 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to James and Verna Wilson of Marksville, Clyde and Bertha Moody of Bogalusa, and Kenneth and Jo Ann McBride of Lecompte on being inducted into the @lafamilyforum's Marriage Hall of Fame! #LA05\n\nhttps://t.co/velcpjM8Rt","date":"Tue Feb 15 21:35:12 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Syrah Technologies’ investment in Concordia Parish will help bring new jobs and opportunity to #LA05! Our team was proud to support this project and be an advocate with our federal partners.\n\nhttps://t.co/uF8YJqMN0K","date":"Tue Feb 15 19:25:54 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We know that if Congress doesn’t take action to assist farmers with rapidly rising production costs, every American family will see higher grocery bills.\n\nhttps://t.co/Hv33J1qiTJ","date":"Tue Feb 15 17:57:27 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Hardworking Americans would be paying less at the pump if this Administration reversed their misguided energy policies, encouraged domestic production, and let states like Louisiana get back to fueling the nation.","date":"Mon Feb 14 22:38:09 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Last year, ICE released detainees in Monroe and Alexandria without notifying our office, state, and local officials. That's why we're co-sponsoring legislation to make sure our leaders won’t be left in the dark again.\n\nhttps://t.co/zYVyVXu0g2","date":"Mon Feb 14 21:25:23 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Absolutely love this @lpborg documentary about my hometown of Start, Louisiana! Maybe a bit biased, but the interview with the Fire Chief (he’s my father-in-law) is the best part.\n\nhttps://t.co/g2zKhGD8Ct","date":"Fri Feb 11 22:03:42 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Can’t think of anybody more deserving for the @NFL’s Man of the Year than West Monroe’s Andrew Whitworth. You make all of #LA05 so incredibly proud! #WPMOY","date":"Fri Feb 11 19:49:21 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: We sent a letter to the @USDA this week, asking them to finally appoint the @usdafsa Executive Director for Louisiana. Because this critical role has been vacant for over a year, our farmers have been stuck with frustrating delays and backlogs.\n\nhttps://t.co/HZ6haNJ6SP","date":"Thu Feb 10 22:25:11 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This morning, called Wyles Gilfoil, an outstanding senior at @WestFelHS, to tell him about his acceptance at @WestPoint_USMA! We’re so proud of you Wyles and we know that you’ll make #LA05 proud! https://t.co/2fgIDC1gjK","date":"Thu Feb 10 19:50:22 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@RepPfluger I think we all look a little different from the last time inflation was this high — I know my dad and I do! https://t.co/bl0dggfjCM","date":"Thu Feb 10 16:32:00 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It couldn’t be any clearer – America has a crisis at our Southern Border. It’s past time for this Administration to step up and keep our communities safe. That’s why I’m co-sponsoring legislation that will bring more transparency and give law enforcement more tools.","date":"Wed Feb 09 21:39:52 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"While Louisiana’s hardworking farmers and ranchers experience frustrating backlogs and delays from the @usdafsa, the Administration has dragged their feet on filling a critical appointment for our state. It’s past time for @USDA to take action.\n\nhttps://t.co/O5yEkn41eI","date":"Wed Feb 09 19:00:05 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, I voted to extend President Trump’s last budget, protect healthcare for our veterans, ensure longstanding pro-life protections stay in place, and make sure that we’re funding our military at this time of international unrest.","date":"Tue Feb 08 23:47:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"When it comes to their child’s education, parents should always have a seat at the table. That’s why @virginiafoxx and I have joined with more than 100 of our @HouseGOP colleagues to bring forward the Parents Bill of Rights.","date":"Tue Feb 08 22:24:19 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Instead of doubling down on foreign production, why don't we unleash the full power of American energy and create jobs in Louisiana?","date":"Tue Feb 08 20:45:34 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re not only bringing legislation to fix WEP and the GPO, but we’re also co-sponsoring bills like @RodneyDavis' Social Security Fairness Act. We need Speaker Pelosi to allow these critical measures to come to the floor for a vote.\n\nhttps://t.co/eLK8n4HFk9","date":"Tue Feb 08 18:57:31 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Social Security should quit unfairly penalizing our teachers, firefighters, and police officers just because they chose to work in public service. That's why we introduced a bill to fix the Windfall Elimination Provision. Click ⬇️  to learn more!\n\nhttps://t.co/8T3UGKqU3Y","date":"Tue Feb 08 00:11:58 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We know that inflation will continue to go up if Congress keeps wasting trillions. We need to address our massive national debt and stop the out-of-control spending before we pass an overwhelming burden on to our children.","date":"Mon Feb 07 21:37:17 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team had a great time last week at the Northeast Livestock Show in Delhi! Thanks to all of our amazing farmers and ranchers from #LA05 who participated. https://t.co/LIPd7ivhRz","date":"Mon Feb 07 20:04:05 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Poverty Point has such an incredible history and thanks to this research from @ULM_Official, we now have a whole new perspective on the past events that transpired here. #LA05","date":"Fri Feb 04 19:07:25 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Great to have you back in #LA05 and visiting with our @LouisianaFFA students!","date":"Fri Feb 04 17:26:15 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We will likely see winter weather throughout parts of #LA05 tonight. Please take all necessary precautions and stay safe.","date":"Fri Feb 04 00:03:29 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to John Thompson of St. Francisville on his selection to the @USDA’s Cattlemen's Beef Promotion and Research Board! #LA05\n\nhttps://t.co/aPTqrG4FKS","date":"Wed Feb 02 21:18:46 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As the only democracy in the Middle East, Israel and the United States have many shared values. This report labeling them as an apartheid state is not only biased, it is blatantly false. In Congress, I will always stand with Israel.\n\nhttps://t.co/H2IjyTOHCE","date":"Wed Feb 02 16:57:53 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"While it’s always great to see @lkguice and his team @LATech, @TechXXII has a way of stealing your heart! https://t.co/yKInSc3P77","date":"Wed Feb 02 00:28:14 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @StBGov for a great meeting with our team! Look forward to working together to move Louisiana forward.","date":"Tue Feb 01 21:16:37 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Last month, my staff and I had the @AFPCTAMU undertake an in-depth study of the impacts of rising agricultural production costs. It’s clear that if we don’t assist farmers, they’ll be forced to pass that burden along and food prices will go up.\n\nhttps://t.co/tsPLZ0oY5j","date":"Tue Feb 01 18:44:30 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Honored to join the @March_for_Life earlier this month to discuss what my colleagues and I are doing in Congress to fight for the unborn.\n\nhttps://t.co/d0SrCbwBDW","date":"Mon Jan 31 22:07:00 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Absolutely loved getting to visit with our amazing Student Government Presidents this morning! Louisiana’s future is bright because of these great young minds. https://t.co/qHGJ3fWBk6","date":"Sat Jan 29 16:39:47 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’m always so impressed by how business and education leaders in #CenLa work together towards shared goals. I loved being able to hear about their latest efforts! #LA05 https://t.co/Sl6BgJ8fYW","date":"Thu Jan 27 20:37:49 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed seeing @LSU President @WFTate4 today. I look forward continuing to work with him and leaders from @LSUAlexandria and @LSUAgCenter to move #LA05 forward! https://t.co/NvgyYDiTU8","date":"Thu Jan 27 19:18:24 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Parish President Jessie Bellard and the delegation from St. Landry for stopping by our office to talk about their top priorities for 2022. https://t.co/s0UzOHZ4Kl","date":"Wed Jan 26 18:53:23 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Great discussion today with @MayorEllis and leaders from the @CityofMonroe about how we can work together to move Northeast Louisiana forward! #LA05 https://t.co/OmgMDZ5eM8","date":"Wed Jan 26 16:52:19 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s time for fiscal responsibility. Every day, I hear from working families across #LA05 who are forced to spend more of their hard-earned dollars just to keep up with rising prices while the out-of-control government spending is just making this problem worse.","date":"Wed Jan 26 00:51:33 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a former classroom educator, I believe that #SchoolChoice is essential to student success. I look forward to working with my colleagues on @EdLaborGOP to help advance school choice and ensure students can learn in the environment that works best for them. #SchoolChoiceWeek https://t.co/g6xLycLl6I","date":"Tue Jan 25 21:19:28 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team is here to help #LA05’s veterans! This week, we presented Dennis Love of Rayville with the medals honoring his service. https://t.co/mCoZShIZpw","date":"Tue Jan 25 19:46:55 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This Administration has been in office for a year and they have yet to present a plan that will address the crisis at our southern border. It's past time for them to put more resources towards enhancing our border security and enforcing the law.","date":"Tue Jan 25 00:31:44 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Parents Bill of Rights is common-sense legislation that ensures parents can never be shut out of the learning process because it takes a family, not a bureaucracy, to raise a child.","date":"Mon Jan 24 21:03:18 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed seeing @lisarobAlan and @BeardlessBro at the @March_for_Life in D.C. yesterday! Thanks for sharing your incredibly powerful personal story, Lisa. https://t.co/S6qEQ3iV6N","date":"Sat Jan 22 15:37:47 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a mother, I know first-hand the miracle that happens when a child is formed, and I’ll always fight in Congress to defend life. https://t.co/vtJRvICVr1","date":"Fri Jan 21 22:54:50 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We are at a historic time in the pro-life movement and I was honored to join the March for Life today to talk about how my colleagues and I are fighting in Congress for the unborn. https://t.co/Fdlby80Wyf","date":"Fri Jan 21 22:31:45 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re expecting freezing temperatures across parts of #LA05. Make sure that you’ve prepared your home or business for the winter weather.","date":"Thu Jan 20 22:04:47 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Always great to see a group from #LA05 on Capitol Hill! @RepMikeJohnson and I enjoyed visiting with some outstanding students from St. Landry Parish this afternoon. https://t.co/iT8xqNHGA1","date":"Thu Jan 20 20:15:00 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"America is facing a crisis in education. That’s why my @HouseGOP colleagues and I are fighting to give parents a seat at the table and get our schools back on track.","date":"Thu Jan 20 16:46:50 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, former Councilman Harry Silver of Alexandria celebrates his 100th birthday! Glad that we could take a few minutes on the House Floor to recognize his years of public service. https://t.co/Z51arIY88z","date":"Wed Jan 19 21:40:12 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’m incredibly proud to have earned an A+ rating from @SBAList! I will always fight to defend the rights of the unborn and stand up for life in Congress. https://t.co/7T7jIWAn76","date":"Wed Jan 19 15:09:22 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"One of the best parts of serving as your congresswoman is nominating outstanding students such as Pineville High’s Nell White to our service academies. I know she is going to be an incredible student at the @AF_Academy and make #LA05 so proud! \n\nhttps://t.co/zHE5YlljVa","date":"Tue Jan 18 20:37:10 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was a pleasure joining community and business leaders in Pineville yesterday for the @NorthRapides luncheon! We had a great discussion about the committee work happening in @HouseAgGOP and @EdLaborGOP, as well as how we can work together to move #LA05 forward. https://t.co/GvYz7R3FFm","date":"Tue Jan 18 18:05:18 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"That’s why more than 100 of my @HouseGOP colleagues and I are bringing The Parents Bill of Rights, common-sense legislation that will ensure families have a seat at the table when it comes to their child’s education.","date":"Tue Jan 18 16:00:47 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"During some of America’s darkest days of hatred and violence, Dr. Martin Luther King, Jr. led the fight for equality and justice. Nearly 60 years later, his words still resonate. Today, a grateful nation pauses and reflects on his incredible life and tremendous legacy. https://t.co/EQXYCjwd1X","date":"Mon Jan 17 14:04:05 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Hayden Davis of Ferriday High School, the winner of the @NFL’s Way to Play High School Award! \n\nhttps://t.co/ONMZUJ69oJ","date":"Sat Jan 15 19:41:14 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team enjoyed visiting @PanolaPepper in Lake Providence this week and learning more about this uniquely Louisiana company! https://t.co/7bkAmrkmeY","date":"Sat Jan 15 14:48:05 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every single day, hardworking Americans are seeing less dollars in their pockets because of record inflation. It’s time for us to finally put a stop to this out of control government spending and put our economy back on track.","date":"Sat Jan 15 00:01:31 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We're expecting winter weather across parts of #LA05 this weekend, with the possibility of snow in Morehouse, West Carroll, and East Carroll Parishes. Please make sure to prepare your home or business and heed all warnings from state and local officials. #LAWX","date":"Fri Jan 14 21:36:46 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The key to #LA05’s future is bringing more jobs and opportunity to our region. I’m excited to see this major investment in Lake Providence, which will not only employ our citizens, but help grow our economy. \n\nhttps://t.co/3j0Tpnsot2","date":"Fri Jan 14 20:08:38 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Whip @SteveScalise is 100% correct – Congress sent billions to state governments and local school districts so they could reopen safely, not close their doors again.","date":"Fri Jan 14 02:11:03 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As I’ve traveled across #LA05, I’ve heard from so many farmers who have been impacted by the high prices of fertilizer and other inputs. That's why I asked a group of Ag experts undertake a study to analyze how these increased costs will be a burden on our farmers and consumers. https://t.co/7uX4x9l4rR","date":"Thu Jan 13 21:23:12 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed joining @brianhaldane on @talk1073 in Baton Rouge this morning to talk about The Parents Bill of Rights and the common-sense principles contained in this legislation. https://t.co/yIDMGEIyBk","date":"Thu Jan 13 18:59:08 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I'm incredibly proud of the app that these amazing students from Delhi Charter School created! They saw a glaring need in our communities and put their heads together to find a solution.\n\nhttps://t.co/nuoCzzO3eq","date":"Wed Jan 12 22:42:34 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"To put these numbers in perspective, inflation is now at some of the highest levels in my lifetime. We need to cut government spending and address the massive burden of our national debt to put our economy back on track.","date":"Wed Jan 12 19:51:12 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Best part of my day was calling Nell White, one of our outstanding students from Pineville High School, to tell her that she was accepted at the @AF_Academy. We’re so proud of you Nell! https://t.co/rX4AzKXzLn","date":"Wed Jan 12 16:04:59 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Human trafficking is a horrific crime that occurs every day across our country and the world. By working together, we can finally end these atrocities and help law enforcement bring these criminals to justice. For more information on assistance and resources, click ⬇️.","date":"Tue Jan 11 22:02:12 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Yesterday, our team was honored to present the Bronze Star, as well as several distinguished Vietnam service medals to Thomas Sykes, one of #LA05’s outstanding veterans. https://t.co/ysFJoSOMEo","date":"Tue Jan 11 20:51:38 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a former educator, I know students learn better when they are able to participate in-person and interact with their peers and teachers, and not reduced to just a face on a screen. That's why I went to the House floor today to support @RepAshleyHinson's \"Reopen Schools Act.\" https://t.co/EWRheaSmzt","date":"Tue Jan 11 19:37:19 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"His mom may be a member of @HouseAgGOP, but Jeremiah is the farmer in our family! He loves helping his Papa Letlow in the garden and is excited about growing his first broccoli. https://t.co/CZncF5BAbo","date":"Mon Jan 10 21:37:38 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Matt Dennis of East Carroll Parish on being named one of the Top 10 Young Farmers in America! \n\nhttps://t.co/AZtxk60Cxh","date":"Mon Jan 10 19:07:20 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our thoughts and prayers are with Lieutenant Swallow’s family and the entire @OuachitaSheriff’s office at this time.\n\nhttps://t.co/kY8OUZzFmg","date":"Mon Jan 10 17:26:25 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Happy Birthday Jacqueline!! Our little girl turns two today. https://t.co/fnH6DWvCDI","date":"Sun Jan 09 15:44:49 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: We’ve heard from countless doctors across #LA05 who can’t access life saving monoclonal antibody treatments because the federal government has taken over distribution. That’s why I sent a letter to @HHSGov this week urging them to open up access.\n\nhttps://t.co/qKPaO2GHx8","date":"Sat Jan 08 21:02:30 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our prayers are with the people of Lake Providence as they recover from this devastating fire. As @LAFIREMARSHAL begins their investigation, our office stands ready to help the community in any way possible. \n\nhttps://t.co/PKLU3ZXFue","date":"Sat Jan 08 03:03:56 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations @CollisTemple! I look forward to working with you, @KimHunterReed and your fellow @LA_Regents to advance higher education in #LA05 and across our state.","date":"Fri Jan 07 23:29:36 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"These job numbers are disappointing, but they don’t adequately show the frustration of families across America who are hurting in these tough economic times. It's clear that we need a different path forward than the one we're currently on.\n\nhttps://t.co/gFjn843g2W","date":"Fri Jan 07 21:37:06 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed visiting St. Landry this week and meeting with Parish President Jessie Bellard, Sheriff Bobby Guidroz, and Opelousas Mayor Julius Alsandor to discuss their priorities for the parish. #LA05 https://t.co/z9HxJDi9FA","date":"Fri Jan 07 20:21:29 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Mark your calendars for this awesome #LA05 event!","date":"Wed Jan 05 23:53:02 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Monoclonal antibody treatments can help save lives from #COVID19. I’ve heard from doctors and medical providers across #LA05 who can't obtain them because the federal government has taken over distribution. That's why I'm urging @HHSGov to open up access.\n\nhttps://t.co/qKPaO2GHx8","date":"Wed Jan 05 21:32:16 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"For almost a year, America has faced a major crisis at our southern border, but this Administration has completely turned a blind eye. That's why I've co-sponsored numerous bills that will drastically increase our border security and enforce our laws.\n\nhttps://t.co/SxBgZXzZQm","date":"Wed Jan 05 19:25:02 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s almost Mardi Gras time in Louisiana! Click ⬇️ to find out where we have some of the best king cakes in #LA05. \n\nhttps://t.co/KDgCf10Nwv","date":"Tue Jan 04 23:16:53 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Corn Vending Machine in Richland Parish is an #LA05 landmark!","date":"Tue Jan 04 22:05:27 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Over the holidays, I talked to so many working families and small business owners across #LA05 that are seeing inflation eat up the hard-earned dollars in their pockets. The American people need Congress to focus on fiscally responsible spending policies, not spending sprees.","date":"Tue Jan 04 21:09:09 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Having been out in the field with Louisiana’s farmers and producers over the past year, I’ve seen how essential it is to pass a Farm Bill that works for them. As a member of @HouseAgGOP, I look forward to starting our work on this critically important legislation in 2022. https://t.co/24nwOynNAx","date":"Tue Jan 04 20:02:55 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Incredibly proud to be a co-sponsor of the #VIPAct, which ensures that America’s heroes receive this token of our appreciation for their selfless service to the nation.","date":"Mon Jan 03 21:28:51 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I believe that education can bring a person from poverty to prosperity. That’s why I’m so passionate about improving education across #LA05. If we can educate our children, we’ll give them a brighter future and lift up our communities, our region, and our state. https://t.co/VNFdXTkvQg","date":"Mon Jan 03 19:32:32 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re expecting winter weather across parts of #LA05 today. Please pay close attention to the forecasts and use caution if you are traveling. #LAWX","date":"Sun Jan 02 17:54:38 +0000 2022","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"My team and I are committed to finally ending the unfair penalties in the Windfall Elimination Provision that cost so many hardworking Americans their Social Security benefits. That’s why we introduced legislation to address this issue and will continue calling for a vote. https://t.co/DCRixdD4Kv","date":"Thu Dec 30 20:54:36 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This year, we co-sponsored nearly 100 bills, many of which directly address the critical needs of #LA05. In 2022, my team and I will continue to advocate for common-sense solutions and keep delivering results for our district and our nation.\n\nhttps://t.co/IUD9LYXCkI","date":"Thu Dec 30 15:19:38 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our farmers and agricultural producers in the Florida Parishes were particularly hit hard this year by Hurricane Ida. Because my colleagues and I were able to come together in a bipartisan fashion, our farmers got the disaster relief dollars they needed. https://t.co/stZj5o61Lz","date":"Tue Dec 28 23:16:14 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In 2021, I was proud to work with both Republicans and Democrats to secure billions in disaster relief for Louisiana in the wake of Hurricane Ida. https://t.co/jREJX1148B","date":"Tue Dec 28 19:42:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"From our crazy family to yours, Merry Christmas! https://t.co/qzezZflzLT","date":"Thu Dec 23 23:13:07 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The common sense ideas in the Parents Bill of Rights aren’t partisan or polarizing, they’re just prudent policy. This legislation will ensure that parents can work hand in hand with educators and have input throughout the learning process. https://t.co/DxeG2EzwRK","date":"Wed Dec 22 17:33:08 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a former educator and a mom of two, I believe that parent involvement is the key to student success in the classroom. That’s why I’m bringing forward the Parents Bill of Rights, to ensure that schools and families can build meaningful partnerships. \n\nhttps://t.co/CQ716gP4WN","date":"Tue Dec 21 21:08:12 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Jacqueline and I had the honor of joining Ms. Irene Robinson for one of her last editions of “The Mighty Mess” on KWCL in Oak Grove. This show has a special place in my heart. Luke and I both started our campaigns here, and our family wishes her the very best in retirement! https://t.co/7fAjZDIpaC","date":"Mon Dec 20 22:41:51 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Sheriff Scott Matthews for the warm welcome to West Carroll Parish on a cold morning in #LA05. https://t.co/CguXO4qBsO","date":"Mon Dec 20 19:53:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I loved seeing so many friends, supporters, and community leaders at today’s @monroe_chamber meeting! I was glad to provide an update on my work in Washington and discuss some of the great things happening across #LA05. https://t.co/3TmZtpbuOr","date":"Fri Dec 17 20:27:34 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Absolutely love this story about one of our brave soldiers coming back to my hometown of Start, Louisiana and surprising his sons! \n\nhttps://t.co/QmJhVIm8w5","date":"Thu Dec 16 22:53:35 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a former university instructor and administrator, I’ve seen firsthand why it’s essential that the student loan process works for borrowers. Proud to join with Dr. @virginiafoxx to ask for more transparency and accountability on this important issue.","date":"Thu Dec 16 20:49:03 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"There is nothing like seeing the Start Water Tower to let me know that I’m back home in #LA05! https://t.co/Xu46NC0bBY","date":"Wed Dec 15 23:20:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you’re old enough to serve in uniform, you’re old enough to drive a diesel truck. That’s why I joined with a bipartisan group of my colleagues and asked the @USDOT to implement the Under-21 Commercial Driver Pilot Program.\n \nhttps://t.co/ImTHVeOV2k","date":"Tue Dec 14 19:35:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Incredibly proud to have more than 100 of my @HouseGOP colleagues co-sponsoring the Parents Bill of Rights! We’re fighting to ensure that parents have a seat at the table and working to move this critical legislation forward. \n\nhttps://t.co/TUF7gmxXpH","date":"Tue Dec 14 14:45:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to West Monroe’s own Andrew Whitworth, who will make history tonight on Monday Night Football as the oldest player to start at left tackle in NFL history. All of #LA05 is cheering for you, Andrew!","date":"Mon Dec 13 23:59:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Happy Birthday to the @USNationalGuard! During the response to #HurricaneIda, so many National Guardsmen and Guardswomen from around the country came to Louisiana to aid our recovery. We’re incredibly grateful for all they do in #LA05 and across the country. https://t.co/jXVPLfn2rA","date":"Mon Dec 13 21:54:28 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’m incredibly proud to be a voice for Louisiana’s hardworking farmers, ranchers, and loggers on @HouseAgGOP. I look forward to continuing to partner with the @LaFarmBureau and their members as we work on the upcoming Farm Bill and critical agriculture issues.","date":"Mon Dec 13 18:56:44 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to the Sterlington Panthers on winning the 3A state championship!","date":"Sun Dec 12 02:12:12 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Welcome to #LA05, Coach @huejack10! I look forward to seeing your team play next year.","date":"Sat Dec 11 17:10:05 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The devastation caused by tornadoes across Arkansas, Tennessee, Missouri, Illinois, and Kentucky is heartbreaking. Our prayers are with our neighbors to the north as they work to recover and rebuild.","date":"Sat Dec 11 15:48:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to the Amite High Warriors on winning the 2A state championship!","date":"Sat Dec 11 03:12:04 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Parents Bill of Rights is built on five common-sense principles that will ensure that families have a seat at the table. Learn more about this bill ⬇️ https://t.co/s66dI2XZ52","date":"Fri Dec 10 23:47:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It's official - inflation is now at the highest rate in almost 40 years. Congress needs to be focused on cutting spending and passing fiscally responsible policies, not wasting trillions on partisan priorities and pet projects. \n\nhttps://t.co/tbBhKusmzn","date":"Fri Dec 10 21:50:32 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s state championship weekend in Louisiana. Good luck to the Amite High Warriors, the Sterlington High Panthers, and, the Ouachita Christian Eagles (my alma mater) as they compete for the top titles. These teams make #LA05 so incredibly proud! \n\nhttps://t.co/6nlBzJouDV","date":"Fri Dec 10 16:37:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Proud to support the NDAA, which makes critical investments in our military, and provides additional resources to our Louisiana bases at this time of global uncertainty. \n\nhttps://t.co/vLczqTJmaY","date":"Thu Dec 09 21:57:08 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"#LA05’s cattle farmers and ranchers will benefit from the clarity and transparency that this legislation will bring to the markets. Proud to join my @HouseAgGOP colleagues in co-sponsoring this bill.","date":"Thu Dec 09 20:15:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Bob Dole was an American hero who lived an incredible life and leaves behind an amazing legacy. Today, Congress joins together to pay our respects and honor his decades of service to our nation.","date":"Thu Dec 09 17:41:28 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@RepAndyBarr has been an incredible friend and mentor since I arrived in the House eight months ago. I’m so proud to see this meaningful legislation passed and was honored to join him as a co-sponsor.","date":"Thu Dec 09 01:09:05 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Appreciate your support, @RepBice!","date":"Wed Dec 08 20:42:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s inspiring to have @DrJBHenderson and the @ulsystem team on Capitol Hill today. They have incredible initiatives underway across all nine campuses. Thank you for educating the next generation of Louisiana leaders! https://t.co/dVzjhbOKem","date":"Wed Dec 08 19:40:52 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This is why my @HouseGOP colleagues and I are bringing forward the Parents Bill of Rights and fighting to ensure that families are able to provide meaningful input into the learning process.","date":"Wed Dec 08 18:24:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team enjoyed joining the @monroe_chamber, the  @WMWOChamberofCo, and community leaders yesterday as @theNELP opened their new office in Monroe! #LA05","date":"Tue Dec 07 21:13:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Parents should have a say in their child’s education. I’m bringing forward the Parents Bill of Rights because we need to ensure that families are heard and not pushed out of the learning process. Read more about this important legislation ⬇️ https://t.co/zGVDo58pxx","date":"Tue Dec 07 18:10:01 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"80 years ago, our nation was attacked at #PearlHarbor. We lost 2,403 of our brave men in uniform that day, and America always remembers their selfless sacrifice and service. https://t.co/l6JoTR0VMb","date":"Tue Dec 07 16:02:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Last week, I went to the House Floor to discuss why my @HouseGOP colleagues and I are bringing forward the Parents Bill of Rights. We’re committed to fighting for families and ensuring that they have a seat at the table. https://t.co/CxtxVZFCgm","date":"Mon Dec 06 23:20:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks for your support @RepFeenstra!","date":"Mon Dec 06 21:18:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This Administration’s misguided energy policies are not only costing us more at the pump, they’re eliminating jobs for hardworking Louisianans. Instead of doubling down on the ideas that haven’t worked, it’s time for the federal government to get domestic producers going again.","date":"Mon Dec 06 19:23:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, we lost a truly incredible American. Bob Dole admirably served our nation first as a heroic soldier during World War II, and later as a leader in Congress. Our thoughts and prayers are with his wife Elizabeth, his family, and his countless friends across the country.","date":"Sun Dec 05 17:09:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks for your support @RepMMM! As Republicans, we believe that students can’t succeed unless parents are a part of the learning process. That’s why we’re fighting to make sure they have a seat at the table.","date":"Sat Dec 04 17:57:38 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The foundation of education has to be parent input. I’m proud to stand with my @HouseGOP colleagues like @RepKatCammack and fight to ensure families have a seat at the table.","date":"Sat Dec 04 16:22:40 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every single indicator shows that American families are hurting because of this economy. Congress should be looking at cutting the debt and getting inflation under control, not spending trillions more on the majority’s partisan priorities and pet projects.","date":"Fri Dec 03 21:03:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks for your support @RepBryanSteil! I look forward to continuing to work with you and our @HouseGOP colleagues to give parents the transparency and accountability they deserve.","date":"Fri Dec 03 18:10:03 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The idea that government can exclude parents and have total control of education will never work, because it ignores the simple truth that these are our children, not the government’s. That’s why my @HouseGOP colleagues and I are bringing forward the Parents Bill of Rights. https://t.co/Aw6InzGCG9","date":"Thu Dec 02 19:05:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’m delighted to have 83 @HouseGOP colleagues co-sponsoring The Parents Bill of Rights. We’re working to give parents a greater say in their child’s education and build effective partnerships between families and schools. \n\nhttps://t.co/IoMyz0NQqd","date":"Wed Dec 01 19:53:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This is a great example of how #LA05’s higher ed institutions can work together to help solve our region’s problems.\n\nhttps://t.co/QrD9Xb3DlD","date":"Wed Dec 01 18:06:23 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a mother of two, I can tell you that nothing is more precious than the life of an innocent child. Now, the Supreme Court has the historic opportunity to ensure that America stands for life and will always protect the rights of the unborn. #EmpowerWomenPromoteLife","date":"Wed Dec 01 16:21:33 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Amite’s own @tanyacrowe_ for finishing in the Top 16 last night at the Miss USA pageant! You made Tangipahoa Parish and all of #LA05 proud. \n\nhttps://t.co/70IbdF7jXK","date":"Tue Nov 30 23:34:15 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Rising gas prices disproportionately hurt rural areas like #LA05 where residents drive more miles to work, school, and home. Our people need the federal government to end these misguided energy polices and find ways to encourage new domestic production.\n\nhttps://t.co/9RXvHSHFYX","date":"Tue Nov 30 21:18:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Mayor Fields has been an outstanding public servant and provided incredible leadership for the people of Pineville over the past 21 years. Congratulations on a well-deserved retirement! #LA05 \n\nhttps://t.co/7U6Rzf6tV7","date":"Tue Nov 30 20:04:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to the Home Builders Association of Northeast Louisiana for today’s insightful conversation about the current housing market and its impact throughout #LA05. https://t.co/MmFxjgm10q","date":"Mon Nov 29 22:53:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was great having so many local banking leaders visit our district office in Monroe today to discuss the importance of our local community banks to #LA05’s economy. https://t.co/F6AgikS5sv","date":"Mon Nov 29 21:50:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"🚨🚨 ATTN #LA05 RESIDENTS: If you were impacted by #HurricaneIda, TODAY is the last day to apply for disaster assistance from @fema. Click ⬇️ for application information.","date":"Mon Nov 29 16:17:15 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Nothing more beautiful or peaceful than a sunrise in #LA05! https://t.co/V2i2RyiKXS","date":"Fri Nov 26 14:16:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This Thanksgiving, Jeremiah, Jacqueline, and I are thankful for the incredible people across #LA05 who have loved and supported our family throughout the past year. From the Letlow house to yours, Happy Thanksgiving! https://t.co/5Q79finAJH","date":"Thu Nov 25 19:12:15 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@OuachitaSheriff has some helpful safety tips to keep in mind for this holiday shopping season. Read more ⬇️ \n\nhttps://t.co/DZLaxAeqDb","date":"Tue Nov 23 22:41:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"One of my favorite @ULM_Official traditions! #TheBestIsOnTheBayou \n\nhttps://t.co/sbtIzYcHae","date":"Tue Nov 23 20:33:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Opening America’s emergency reserves in order to lower fuel prices is not the answer. Let’s reverse these misguided policies and encourage domestic energy production again. Louisiana’s oil and gas workers are ready! \n\nhttps://t.co/mmC3RAn4ki","date":"Tue Nov 23 17:49:00 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"These two kiddos love helping their Mom work in the district office! 💙💜 https://t.co/xHRzgpdbHz","date":"Mon Nov 22 22:36:38 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team enjoyed joining Washington Parish Sheriff Randy “Country” Seal last week as he hosted his annual community Thanksgiving luncheons in Bogalusa and Franklinton. #LA05 https://t.co/dLhbGR9G0X","date":"Mon Nov 22 19:25:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Because of inflation, Americans will be paying more for everything this Thanksgiving, including the turkey, green beans, cranberries, and even the gas you need to drive to the grocery store. \n\nhttps://t.co/kH476N6a0r","date":"Mon Nov 22 17:46:35 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Americans deserve better than this. Our children deserve better than this. And while this is a disappointing day for our nation, I vow never to give up fighting for a better tomorrow for our kids and future generations.","date":"Fri Nov 19 14:47:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Make no mistake, this legislation will increase taxes, add billions to the deficit, give mass amnesty to illegal immigrants, enable the IRS to monitor your bank account, allow your taxpayer dollars to fund abortions, and create more than 150 new government programs.","date":"Fri Nov 19 14:47:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"My @HouseGOP colleagues and I did everything possible to stop this bill and tell the public about its many negative consequences. Last night, @GOPLeader spent eight and half hours on the House floor warning the other side about what will happen if this bill becomes law.","date":"Fri Nov 19 14:47:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I know so many like myself have heavy hearts as we think about the massive debt that this legislation will create and how this costly and unprecedented burden will be on the backs of our children and the future generations to come.","date":"Fri Nov 19 14:47:42 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Unfortunately, the other side ignored those concerns and pushed this legislation through the House anyway.","date":"Fri Nov 19 14:47:42 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"For months, countless hardworking families and small businesses have seen inflation take more and more money out of their pockets. The American people understand that this spending bill will only exacerbate the economic problems our country is facing.","date":"Fri Nov 19 14:47:42 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This morning, the Democratic majority in the House pushed through a multi-trillion-dollar spending bill. https://t.co/nN4PNQxmNT","date":"Fri Nov 19 14:47:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We know that excluding parents from the learning process will never work, because these are our children, not the government’s. That’s why I’m proud to bring forward the Parents Bill of Rights to allow for greater partnership and collaboration between families and educators. https://t.co/8qS1JhwH50","date":"Thu Nov 18 19:51:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This bill will ensure families have the accountability and transparency they deserve.\n\nhttps://t.co/Ea6GQYo9xZ","date":"Wed Nov 17 21:01:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Education is not a job that parents or schools can do by themselves, it requires us to work together. I’m proud to join @GOPLeader, @virginiafoxx, @RepJimBanks, @RepBurgessOwens and many of my @HouseGOP colleagues in introducing the Parents Bill of Rights.","date":"Wed Nov 17 21:01:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As inflation keeps driving up the price of gas, groceries, and even diapers, I’m hearing from working families and small businesses across #LA05 who are hurting. It’s clear that the answer to our country’s economic woes isn’t for Congress to keep spending trillions. https://t.co/lLNFzfd3Q8","date":"Wed Nov 17 16:20:32 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you’re old enough to serve in uniform, you’re old enough to drive a diesel truck. In an effort to ease the supply chain crisis, I joined my colleagues in asking @USDOT to implement the Under-21 Commercial Driver Pilot Program. https://t.co/AV2dq9viBY","date":"Tue Nov 16 20:22:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 RESIDENTS: If you were impacted by #HurricaneIda, the final deadline to apply for disaster assistance from both @fema and the @SBAgov is Monday, November 29. Click ⬇️ for more information.","date":"Tue Nov 16 19:12:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Kathleen Blanco was a trailblazer for women in Louisiana. Even in the face of tremendous tragedy and challenging circumstances, she brought both grace and fierce determination to her leadership of our state. She continues to be an inspiration for so many. #LaGov","date":"Mon Nov 15 22:34:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’ve heard from countless working families and small businesses across #LA05 who are hurting because of this economy. They don’t need the federal government spending trillions more and driving inflation up, they need us to put things back on track.\n\nhttps://t.co/A4ZU7lJz49","date":"Mon Nov 15 20:57:44 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was awesome seeing so many friends and former colleagues back on campus at @ULM_Official this weekend! Plus, Jeremiah and Jacqueline enjoyed being on the field in Malone Stadium. #TheBestIsOnTheBayou https://t.co/ub7e6njMji","date":"Mon Nov 15 19:22:11 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@RoyOMartin is a homegrown Louisiana company with a tremendous impact both in #LA05 and throughout our state. Yesterday, I was able to see their facilities up close and learn more about lumber manufacturing. https://t.co/oDn3N6UnJp","date":"Sat Nov 13 16:43:42 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Appreciated spending time with our loggers in Winn Parish this week! Always great visiting with awesome leaders like @TJL011412 and @RepMcFarland to discuss the timber industry’s impact in #LA05. https://t.co/SvTNrymgZ3","date":"Sat Nov 13 13:40:34 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Cotton is one of the most important crops for #LA05 and our state. Enjoyed visiting Lake Providence this week to see the ginning process up close and meet with local farmers about their concerns. https://t.co/DzdbTwagXa","date":"Fri Nov 12 16:39:28 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our family marked this #VeteransDay by visiting the Veterans Cemetery in Rayville and joining the Richland Parish Sheriff’s Office and students from Mangham High School in honoring our heroes. We’re eternally grateful for their service and sacrifice. https://t.co/gUuAjOzUW3","date":"Thu Nov 11 16:24:57 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Look forward to joining the @monroe_chamber on December 17 for a conversation about how we bring more jobs, opportunity, and investment to #LA05!","date":"Wed Nov 10 19:53:03 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Happy Birthday to the @USMC! Our nation is incredibly grateful for the selfless service and sacrifice of countless #Marines who protect freedom both here at home and around the world. #semperfidelis","date":"Wed Nov 10 15:58:51 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed joining so many outstanding women last week who are helping lead the way in agriculture with @farmcredit. I’m so honored to be a voice and advocate for women on @HouseAgGOP.","date":"Tue Nov 09 22:07:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Increased inflation means that American families now have less money in their pockets. Instead of creating new federal programs and wasting trillions, Congress should be working on plans to rein in government spending.","date":"Tue Nov 09 20:01:42 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Incredibly proud to see Tensas Parish native @leslie_durham serve in this critical leadership role with @DeltaRegional! #LA05","date":"Tue Nov 09 16:23:19 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Amazing morning in West Monroe as the community came together to welcome home one of our incredible veterans who moved into a new house from @BuildingHomes4H! https://t.co/NeUrL6nUlk","date":"Mon Nov 08 22:20:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s cotton harvesting time in #LA05! Proud to be an advocate for Louisiana’s cotton farmers on @HouseAgGOP. https://t.co/1zoWybwBvH","date":"Mon Nov 08 19:46:00 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: After the people of Virginia sent Washington a clear message last week, I joined @GOPLeader and my colleagues to discuss our vision for education. https://t.co/KZov9FetJN","date":"Mon Nov 08 18:23:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This is not the way that Congress is supposed to work. The House should stop and allow us to actually read this 2,145 page bill. The American people deserve better.","date":"Fri Nov 05 18:15:23 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Instead of rushing a vote today on legislation that spends trillions, the House should wait for our nonpartisan economists and experts to tell us what this bill really costs and how it will impact our economy. #NoScoreNoVote","date":"Fri Nov 05 15:13:14 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We believe that education works when families and a learning environment truly are partners, not adversaries.\n\nYesterday, I joined @GOPLeader, @RepStefanik and some of my colleagues to talk to parents and stakeholders about our side’s vision for education. https://t.co/YhNrClLiEw","date":"Thu Nov 04 19:01:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Since Speaker Pelosi and the Democrats won’t discuss anything but their socialist spending bill, @RepGarretGraves and I are bringing forward an amendment with a plan to fix the Windfall Elimination Provision so Congress can finally have a conversation about this critical issue.","date":"Thu Nov 04 17:13:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s unbelievable that this White House and the Democrats believe that the best solution for the crisis at our southern border is to give mass amnesty and taxpayer-funded benefits to illegal immigrants.","date":"Tue Nov 02 21:00:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Speaker Pelosi and the Democrats remain solely focused on wasting trillions in their socialist spending package while meaningful Republican legislation keeps being pushed aside. https://t.co/dtIcjQjZVF","date":"Tue Nov 02 20:02:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team enjoyed joining community and campus leaders at @LATech as they opened their new career closet. This new resource is a critical tool helping prepare students for their professional future. https://t.co/WMIDhkstId","date":"Tue Nov 02 00:03:40 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This White House wants to pay illegal immigrants $450,000. That number is nearly 10 times the median household income in Louisiana. If it takes a working family a decade to make that much money, why should the federal government just give it out to the people who broke our laws?","date":"Mon Nov 01 22:01:03 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Democrats' Socialist Spending Spree...\n\n❌ Raises Taxes\n❌ Adds to the Debt\n❌ Gives Mass Amnesty\n❌ Implements the Green New Deal\n❌ Weaponizes the IRS\n❌ Spends Taxpayer $$ on Abortion\n\nMy @HouseGOP colleagues and I are working hard to defeat it.\n \nhttps://t.co/HbOK2sJhuX","date":"Mon Nov 01 21:01:39 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"My firefighter and baby shark are all ready to go. Happy Halloween from the Letlows! https://t.co/Y3lBFuQBm3","date":"Sun Oct 31 21:05:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I know my kids are looking forward to Trick-or-Treating tomorrow! Click ⬇️ to find some safety tips for families to make sure everybody in #LA05 has a safe and happy Halloween. \n\nhttps://t.co/VX68Nv9mwW","date":"Sat Oct 30 21:48:34 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Not only is @ULM_FB on a winning streak, but they’re also helping make a difference in the community. So proud of @CoachTBowden and this team! #TheBestIsOnTheBayou","date":"Sat Oct 30 18:40:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"No better way to start the day than with a beautiful sunrise in #LA05! https://t.co/2dw40uo0QF","date":"Sat Oct 30 12:52:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Hope it’s a great homecoming weekend in Pineville for all of the @LA_College students and alumni. Look forward to joining @rickbrewer and my friends on campus for a Wildcats football game soon! https://t.co/3sLEBP4Mq5","date":"Fri Oct 29 23:01:33 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Since this Administration took office in January, we’ve seen a record 1.4 million crossings at the border. That’s not just a coincidence.","date":"Fri Oct 29 21:20:01 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to the fantastic team at @EnglandAirpark on being named Louisiana’s Airport of the Year! Let’s continue improving and promoting this vital economic development hub for CenLa.","date":"Fri Oct 29 20:11:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"While Speaker Pelosi and the radical Democratic majority are doing everything they can to pass their socialist spending package, meaningful bills like my plan to eliminate the Windfall Elimination Provision (WEP) are being pushed aside.\n\nhttps://t.co/q6jPSWwNZm","date":"Thu Oct 28 20:45:54 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"🚨🚨 ATTN #LA05 STUDENTS: TOMORROW is the deadline to submit an application to our office for a congressional nomination to attend a service academy. #LAED \n\nhttps://t.co/6wcVzAAtAP","date":"Thu Oct 28 19:46:07 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I believe that the best way to lift people out of poverty is through education. This afternoon, I spoke with @LABI_biz about my work on @EdLaborGOP and how we can move Louisiana forward through new partnerships between our educational institutions and industry. https://t.co/HoR0v0Mmsd","date":"Wed Oct 27 20:06:57 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Great conversation this morning with @RichPAGuy and @cenlaishome on KSYL’s “TalkBack” about my recent visit to the Central Louisiana Regional Port and how we can work together to help bring jobs and opportunity to #LA05. https://t.co/wFfxYTcOg5","date":"Wed Oct 27 16:50:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re expecting severe weather across #LA05 today, so please monitor the forecasts, exercise caution as you travel, and always heed warnings from your local officials.","date":"Wed Oct 27 15:06:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Working families across America are seeing less dollars in their pockets because of this Administration’s misguided policies. Instead of another massive government spending spree, we should be talking about legislation that will help create jobs and get our people back to work.","date":"Tue Oct 26 23:03:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I spent some key moments of my career working on @Tulane’s campus, and I’ve seen the university’s impact not just in New Orleans, but across the state. It was great meeting with @TUFitts today to discuss his priorities and how we can work together to move Louisiana forward! https://t.co/6yC2qvKsvp","date":"Tue Oct 26 22:01:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"🚨🚨 #LA05 STUDENTS: The deadline to submit your applications to our office for a nomination to @WestPoint_USMA, @NavalAcademy, @AF_Academy, or @UsmmaO is this Friday, October 29. #LAED\n\nhttps://t.co/6wcVzAAtAP","date":"Tue Oct 26 00:00:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Supply chain backups are not only frustrating Americans, but it’s also hindering our ability to do business and hurting our economy. That’s why I joined my @HouseGOP colleagues in sending a letter to President Biden, asking him to finally address this critical issue. https://t.co/MuFNonTmN4","date":"Mon Oct 25 21:47:07 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you listen to Speaker Pelosi, it’s clear that the plan to hire 85,000 new IRS agents is not about catching tax cheats. It means predatory audits and squeezing small businesses and working families to find the money that will pay for this socialist spending spree. https://t.co/pEAlaI677e","date":"Mon Oct 25 20:59:15 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We have so many fun things to do and interesting places to see in #LA05. I hope you follow the advice of @LouisianaLtGov, @MayorEllis and Mayor @AlbrittonStaci and make us your next #Staycation destination!","date":"Sat Oct 23 18:11:44 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @LaFarmBureau President Jim Harper for hosting us on his farm in Cheneyville! Enjoyed meeting with him and farmers from around the state to discuss their concerns and the importance of Louisiana’s sugar industry.","date":"Sat Oct 23 14:50:10 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Excited for the World Famed Tiger Marching Band’s performance this weekend. It’s great when the rest of the country gets to see the pride of @Grambling1901 and the best of #LA05!","date":"Fri Oct 22 20:02:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We root for both @ULM_FB and @LATechFB in the Letlow house! With both schools celebrating Homecoming, it’s a great weekend for football in #LA05! https://t.co/YKgPTgfw0z","date":"Fri Oct 22 18:57:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"For nearly four decades, both Republicans and Democrats have agreed that taxpayer dollars shouldn’t fund abortions. Now, this radical Democratic majority wants to do away with this longstanding policy. My @HouseGOP colleagues and I are fighting to make sure that doesn’t happen. https://t.co/kQDe21oCEO","date":"Fri Oct 22 17:18:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"One of #LA05’s best events of the year is the Washington Parish Fair in Franklinton! The fair is now open and runs through Sunday. For more information, visit https://t.co/CfJcNeW5Yu. https://t.co/iPKoiCziy0","date":"Thu Oct 21 20:37:52 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Democrats have packed every polarizing partisan priority into their massive, socialist spending bill. Now, they want to use it to give mass amnesty to millions of illegal immigrants. We can’t allow that to happen. https://t.co/er5H9kic7n","date":"Thu Oct 21 18:17:27 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Proud to join with @RepTomEmmer and nearly 200 of my @HouseGOP colleagues to stand against this Administration’s proposal to let the IRS snoop on Americans’ bank accounts.","date":"Thu Oct 21 16:05:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I may be a bit biased, but I’m excited to see a native of #LA05 lead the @LSUAgCenter and the @LSUCollegeofAg! My team and I look forward to working with @LukeLaborde2 to help advance agriculture across our state. \n\nhttps://t.co/ixsk9sAcSk","date":"Wed Oct 20 21:30:01 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 STUDENTS: If you’re interested in attending @WestPoint_USMA, @NavalAcademy, @AF_Academy, or @UsmmaO, the deadline to submit applications to our office for nomination is Friday, October 29. #LAED\n\nhttps://t.co/6wcVzAAtAP","date":"Wed Oct 20 19:00:34 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Nearly 1.7 million illegal immigrants have been detained at the U.S.-Mexico border in the past year. It couldn’t be any clearer that we must confront this crisis. Where is the leadership from the White House? \n\nhttps://t.co/LayrzVW0jY","date":"Wed Oct 20 15:24:13 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Can't beat a hamburger from E.W. Tompson Drug Company in Delhi! Just one of many incredible small businesses we have across #LA05.\n\nhttps://t.co/ZXEmKJlUYu","date":"Tue Oct 19 21:13:22 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We enjoyed joining the community last week for the ribbon cutting at Black Bayou Lake National Wildlife Refuge. These improvements to the complex will help everybody enjoy this incredible scenery! #LA05 https://t.co/rAe2r2vg4E","date":"Tue Oct 19 19:19:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This Administration’s misguided energy policies have forced Americans to not just pay more money at the pump, but sent our jobs overseas. That’s why I joined with my @HouseGOP colleagues in sending a letter to the President, telling him it’s time to reverse course. https://t.co/GSM6q2K8LU","date":"Tue Oct 19 17:14:07 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Applications for service academy nominations are still open! If you’re a high school senior in #LA05, the deadline is Friday, October 29. Click ⬇️ for more information or call our Monroe office at (318) 570-6440.\n\nhttps://t.co/6wcVzAAtAP","date":"Mon Oct 18 22:05:35 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The other side wants to let the IRS snoop on ordinary Americans bank transactions. Not only is this proposal a massive invasion of privacy, but it also puts an incredibly troublesome burden on #LA05’s small community banks and credit unions. \n\nhttps://t.co/L5C6SkkFek","date":"Mon Oct 18 21:06:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, our nation lost an incredibly gifted military leader and a man who was a tireless advocate for freedom and liberty around the world. Our thoughts and prayers are with Secretary Powell’s family at this time. \n\nhttps://t.co/ef8igoVusV","date":"Mon Oct 18 14:28:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Let’s go Warhawks! Look forward to watching the game tonight. #TheBestIsOnTheBayou","date":"Sat Oct 16 21:39:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is so important for us to preserve #LA05’s unique history. Excited to see this museum opening in Bogalusa and look forward to stopping by next time I’m in Washington Parish! \n\nhttps://t.co/RRcBIIkceD","date":"Sat Oct 16 20:14:57 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Democrats want to allow the IRS to snoop on ordinary Americans’ bank accounts. This plan is a massive invasion of privacy. I’m joining my @HouseGOP colleagues in opposition, because we shouldn’t be weaponizing the IRS to prey on small business and working families.","date":"Fri Oct 15 18:35:02 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Great news for #LA05! The nursing program at @LSUAlexandria is producing so many outstanding professionals and I know that they are making a tremendous impact across the #CenLa region.","date":"Fri Oct 15 14:41:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 STUDENTS: If you're a High School senior interested in attending one of our service academies, the deadline to submit your nomination application is Friday, October 29. Click ⬇️ for more information or call our Monroe office at (318) 570-6440. \n\nhttps://t.co/6wcVzAAtAP","date":"Thu Oct 14 20:00:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a member of @EdLaborGOP, I’m committed to working with all stakeholders to help improve K-12 education in Louisiana. Enjoyed visiting schools and meeting with school choice leaders this week to learn more about how they’re helping improve outcomes for students and families. https://t.co/jytXRQYnpQ","date":"Thu Oct 14 17:58:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I believe that improving education and growing a skilled workforce is critical for Louisiana’s future. This week, we had a fantastic listening session with higher ed leaders from across the state, hearing about their priorities. https://t.co/xeTlzl81nk","date":"Thu Oct 14 15:02:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This is what the \"Green New Deal\" means - Democrats in California want to ban gas powered lawnmowers and leaf blowers. Personally, I think government has more important things to do than regulating what Americans use to cut their grass. \n\nhttps://t.co/etf5n5ljxx","date":"Thu Oct 14 13:00:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Happy 246th Birthday to the @USNavy! Our nation is so grateful for the brave men and women who protect the seas here at home and abroad.","date":"Wed Oct 13 18:26:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This week, I visited with some of our regional electric co-ops and telecommunications companies to discuss #LA05’s recovery from the impacts of #HurricaneIda and the challenges they’re seeing across the industry. https://t.co/5msRCXfZbG","date":"Wed Oct 13 15:14:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I can’t think of a better way to spend #NationalFarmersDay than visiting the @LSUAgCenter’s Leadership Class! I enjoyed updating this outstanding group on all that’s happening in Washington and hearing about the impacts of policy on their daily operations. https://t.co/TKrH6E2WDs","date":"Tue Oct 12 21:25:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"On this #NationalFarmersDay, I’m thanking the hardworking men and women that are the backbone of #LA05. I’m honored to serve on the @HouseAgGOP and be an advocate for Louisiana’s farmers in Congress. #ThankAFarmer https://t.co/DiMsJ4inRi","date":"Tue Oct 12 15:55:20 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Straight from the Democrats: A vote for the “infrastructure bill” is a vote for the $4.3 Trillion socialist spending spree. These bills are tied together and there will not be one without the other. To say they are separate is just false. https://t.co/ef5J7suhfA","date":"Mon Oct 11 21:40:39 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Central Louisiana Regional Port connects #LA05’s producers and businesses with customers across the country and around the world. Enjoyed meeting with their team and the Red River Waterway Commission last week to discuss how we can help bring jobs and investment to #CenLa. https://t.co/8Aqtub0kV6","date":"Mon Oct 11 19:48:12 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’m unapologetically pro-life and will always stand with my colleagues in Congress to defend the rights of the unborn.","date":"Mon Oct 11 17:39:20 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Had my two favorite helpers join me today as we thanked some of our incredible local veterans and met one of #LA05’s WWII heroes who celebrated his 100th birthday! It is because of their service that my kids get to grow up in the “Land of the Free and the Home of the Brave.” https://t.co/1Z9SW9qFQs","date":"Sat Oct 09 20:21:20 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Stopped in Ball yesterday to meet with Mayor Gail Wilking and had a great conversation with Mayor Shane Davis in Dry Prong. I look forward to continuing to work with them and all of our local leaders to move #LA05’s rural communities forward. https://t.co/qRnm9IqCsy","date":"Sat Oct 09 14:55:49 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Check out the @LSUAgCenter’s planting guide for the best tips as we start fall gardening! #LA05","date":"Sat Oct 09 14:11:17 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is so awesome to see the outstanding students at Franklinton High School collecting supplies for our neighbors in South Louisiana who have been impacted by Hurricane Ida. Keep up the amazing community service! #LA05 \n\nhttps://t.co/Q0bNJERpIw","date":"Fri Oct 08 20:00:28 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s simple. Increased inflation is a tax on every American family. Now is the time for fiscal responsibility, not massive government spending sprees.","date":"Fri Oct 08 13:16:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our team enjoyed joining #CenLa business and community leaders to celebrate AFCO’s 75th Anniversary! We’re proud to have such a great company here in #LA05.","date":"Thu Oct 07 20:26:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Because of this Administration’s misguided decisions, Louisianans are paying more at the pump and good-paying oil and gas jobs are leaving our state. The solution is to end these anti-production policies, get our people back to work, and unleash the power of American energy.","date":"Thu Oct 07 18:59:24 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Not only does this “infrastructure bill” not give Louisiana its’ fair share, it also sets the stage for a new tax charging Americans for every mile they drive. This will disproportionally hurt rural communities in #LA05 and let big cities off the hook.\n\nhttps://t.co/Q3mXJTFP3R","date":"Wed Oct 06 20:00:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Louisiana 4-H program has helped educate so many students across #LA05 and provided them with an incredible foundation for the future. Thanks for all that you do for our region. Happy National 4-H Week! #4HBuilds","date":"Wed Oct 06 18:20:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Administration declared war on the oil and gas industry by shutting off leasing in the Gulf of Mexico and cancelling the Keystone Pipeline. Now, Louisianans are not just paying more at the pump, they're seeing good-paying jobs disappear.\n\nhttps://t.co/UOTOFRCWVT","date":"Wed Oct 06 14:34:15 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"For more than 40 years, Republicans and Democrats agreed that taxpayer dollars shouldn't fund abortions. Now, this White House and the radical Democratic majority want to destroy the Hyde Amendment. \n\nWe can't let that happen. #HydeSavesLives","date":"Tue Oct 05 23:33:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to all the selfless men and women who have dedicated their careers to educating our children! Happy #WorldTeachersDay!","date":"Tue Oct 05 22:27:07 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I'm standing with my @HouseGOP colleagues in opposition to Democrats' plan that will allow the IRS to snoop on Americans' bank accounts. This is not only a massive security risk, it is an unprecedented government invasion of privacy.\n\nhttps://t.co/J3VLdHKprx","date":"Tue Oct 05 21:45:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If this “infrastructure bill” is a once in a generation investment, is Louisiana really okay with getting crumbs while other states slice up the rest of the pie? Make no mistake, this legislation is a bad deal for both our state and #LA05.\n\nhttps://t.co/cDOJnYgPzK","date":"Mon Oct 04 20:04:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Get out and enjoy the best of #LA05 and our state this weekend!","date":"Sat Oct 02 22:40:10 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: If you’ve been impacted by #HurricaneIda, the deadline to apply for the Blue Roof program is Oct. 15. Find more information ⬇️ on how to apply.","date":"Sat Oct 02 19:31:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Always enjoy visiting with @TWILATV and discussing agriculture. Congratulations to the @LaFarmBureau team on such a milestone anniversary! #LA05 \n\nhttps://t.co/jq6dfnerX8","date":"Fri Oct 01 21:32:03 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Increased inflation is a tax on every hardworking American family. Congress shouldn’t be looking at a massive government spending spree, we should be working to put more dollars back in your pockets.","date":"Fri Oct 01 17:40:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"See my statement ⬇️ on today’s vote on the Continuing Resolution. #LA05 https://t.co/jj09z18mor","date":"Thu Sep 30 20:33:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s clear that the “Infrastructure Bill” is a bad deal for Louisiana and #LA05. All our people would get is less dollars in their pockets and more broken promises. https://t.co/ug3FvBIcgk","date":"Thu Sep 30 13:59:30 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 RESIDENTS: The deadline for the Blue Roof Program has been extended to October 15. For more information on eligibility and how to apply, visit https://t.co/j7o695cQiY or call (888) 766-3258.\n\nhttps://t.co/iM41hV5osR","date":"Wed Sep 29 20:12:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, I visited the memorial on the National Mall to honor the more than 690,000 people we’ve lost to COVID-19. To those who are missing a loved one, please know that I see you, hear you, and most importantly, grieve alongside you. https://t.co/9PcllqDx4Q","date":"Wed Sep 29 16:22:08 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The @USDA is extending the crop insurance deadline for fall crops in parishes impacted by #HurricaneIda to October 29. Click ⬇️ for more information from @LaFarmBureau.\n\nhttps://t.co/mygQahHRUH","date":"Tue Sep 28 23:07:40 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Before I came to Congress, I spent my career in education and was fortunate to graduate with multiple degrees. Because of the disastrous withdrawal from Afghanistan, this brutal regime will ensure women there won’t have those opportunities.\n\nhttps://t.co/tUdYN6rjq6","date":"Tue Sep 28 21:16:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 RESIDENTS: If you were impacted by #HurricaneIda, the deadline to apply for the Blue Roof program is this week! Click ⬇️ for more information on eligibility and how to apply.","date":"Tue Sep 28 20:35:01 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Happy 90th Birthday, @ULM_Official! I’m incredibly proud to call myself a graduate of this outstanding university. ULM is truly a higher ed leader in #LA05, helping transform the lives of of so many students in our region. #TheBestIsOnTheBayou https://t.co/ZkHAZXBbuo","date":"Tue Sep 28 12:12:24 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our office was honored to present a flag from the U.S. Capitol to the outstanding volunteers of the Baskin Fire Department! If you’re a #LA05 resident and want to request a flag for a special individual or organization, visit https://t.co/M5tAeI4YY3. https://t.co/bVD2MZbHCl","date":"Mon Sep 27 23:03:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: The price tag for the Democrats’ spending spree is now estimated to be $4.3 Trillion. That means it’s the largest spending bill in American History. The polarizing priorities and partisan programs in this bill are not worth the massive mortgage on our children’s future.","date":"Mon Sep 27 21:09:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The “Infrastructure Bill” spends $1.2 Trillion, but Louisiana only gets 0.5% of that money for roads and bridges. Instead, it sets aside billions more for electric car charging stations. It’s clear our state needs a more substantial, targeted investment.\n\nhttps://t.co/bXPeQzK1hF","date":"Mon Sep 27 20:04:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s always exciting to see new businesses starting up in #LA05! \n\nhttps://t.co/FE4yU3UMnN","date":"Sat Sep 25 22:10:40 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re blessed to live in the Sportsman’s Paradise, home of the world’s best hunting and fishing. Happy National Hunting and Fishing Day to all who enjoy the bounty of #LA05! https://t.co/uM0y0zayuj","date":"Sat Sep 25 15:32:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"After a few months here, I still feel the same humbling reverence when I walk these halls. It is truly the honor of a lifetime to represent the people of #LA05 in Congress. https://t.co/X7z1wmiRqp","date":"Fri Sep 24 21:11:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"When inflation goes up, it means that hardworking American families pay more for everything they use. Congress shouldn’t be spending trillions and pursuing reckless policies that will increase inflation, we should be putting more money back in your pockets. https://t.co/aRa3R6IHyl","date":"Fri Sep 24 18:17:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, the Democrats brought forward perhaps the most aggressive abortion bill that Congress has ever considered. I went to the floor and helped lead my @HouseGOP colleagues in opposition, because we must stand up to protect the unborn. https://t.co/ZjZegqYgYl","date":"Fri Sep 24 16:10:22 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The other side wants to let the IRS monitor your bank accounts. Last week, I joined my @HouseGOP colleagues in opposition to this absurd plan. This is not only a massive invasion of privacy; it could compromise millions of Americans' personal information. https://t.co/I44zOFhllf","date":"Thu Sep 23 23:45:05 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The numbers don’t lie – there is a crisis at America’s southern border. With this problem so apparent, where is this Administration’s plan to fix it?","date":"Thu Sep 23 18:07:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 STUDENTS: If you're interested in attending our delegation's Virtual Service Academy Day, there is still time to register. Get more details below ⬇️ and join us on Saturday to learn more about the Congressional nomination process. #LAED https://t.co/ScyJE0Rz7p","date":"Thu Sep 23 14:35:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"At the current rate, the Blue Roof program won’t finish getting tarps on homes for another three months. That’s why I’m joining with @SteveScalise, @RepGarretGraves, @RepClayHiggins, and @RepTroyCarter and asking @USACEHQ to speed up this critical work.\n\nhttps://t.co/0qTV4V3eXj","date":"Wed Sep 22 21:00:13 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s past time for Congress to show some fiscal responsibility. Doing away with America’s debt limit is like giving a college kid a credit card with no restrictions. Joined KSYL’s “Talk Back” this morning to talk about my opposition to the Democrats’ irresponsible spending spree. https://t.co/xBnfR2xMln","date":"Wed Sep 22 18:54:11 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As inflation keeps going up, hardworking American families see less money in their pockets because of this Administration's misguided economic policies. https://t.co/bWtPmhGA1d","date":"Wed Sep 22 16:41:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Speaker Pelosi won’t let the House vote on #HurricaneIda relief funding unless it’s part of her plan to do away with the debt limit and take out a massive mortgage on our children’s future. It’s so frustrating that she is playing these political games as our people are suffering. https://t.co/5QpR4ATtoZ","date":"Wed Sep 22 00:51:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 RESIDENTS: The Disaster Supplemental Nutrition Assistance Program (DSNAP) is available for families impacted by #HurricaneIda. Get more information ⬇️ on how to apply.","date":"Mon Sep 20 23:19:08 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Proud to fight for agricultural disaster relief, especially after the devastation we've seen in the past year. Even though this effort was the victim of partisan politics, we will keep fighting until our producers have the resources they need to recover.\n\nhttps://t.co/zRwqELy3Oi","date":"Mon Sep 20 22:06:14 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Louisiana women can do anything! Congratulations to St. Francisville native @ArceneauxHayley on a successful mission in space. #LA05","date":"Mon Sep 20 12:27:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Let’s go Warhawks! #TheBestIsOnTheBayou","date":"Sat Sep 18 23:27:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Happy Birthday to the @usairforce! Our nation is incredibly grateful to the outstanding men and women who have protected our country and defended freedom around the world for the past 74 years. #USAF74","date":"Sat Sep 18 22:17:02 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Are you a high school student interested in attending @WestPoint_USMA, the @NavalAcademy, the @AF_Academy, the @USCGAcademy or @USMMAO? Join the Louisiana delegation on Sept. 25 for our virtual academy day and learn more about the congressional nomination process. #LA05 #LAED https://t.co/DXdQGMOcV6","date":"Fri Sep 17 20:00:32 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"#OnThisDay in 1787, the U.S. Constitution was signed. 234 years later, we are the inheritors of the founders’ great plan, and lucky to live in a nation founded on the values of freedom and liberty https://t.co/Am0NIpITeB","date":"Fri Sep 17 15:00:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Increased inflation means that every American family is paying the price of this Administration’s poor policy decisions. Now is the time for responsible economic choices, not a massive government spending spree.","date":"Fri Sep 17 13:13:39 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Democratic majority wants American farmers to foot the bill for their $3.5 trillion spending spree. Right now, their plan calls for increasing some fines by more than 900%. I stood up for our agricultural producers, because they don’t need to face fatal financial penalties. https://t.co/ESSS6bvx3n","date":"Thu Sep 16 20:00:49 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Have you been impacted by #HurricaneIda and your claim for disaster assistance has been denied by @fema? Learn more about the appeals process ⬇️  and call our office at (202) 225-8490 if you need assistance. #LA05 \n\nhttps://t.co/VYCX1mEm9K","date":"Thu Sep 16 15:59:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@WSJ hits the nail on the head. The radical Democratic majority is determined to use every legislative avenue to pass their sweeping socialist agenda. My @HouseGOP colleagues and I are fighting to make sure that doesn't happen.\n\nhttps://t.co/GVlc0Nt95v","date":"Thu Sep 16 12:32:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The radical Democratic majority is determined to waste $3.5 trillion on their partisan priorities and preferred programs. But when I tried to extend WHIP+ agriculture disaster assistance for farmers impacted by events such as Hurricanes Laura, Delta, and Ida, they voted it down. https://t.co/NzycrqOrtX","date":"Thu Sep 16 00:15:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to St. Francisville’s own @ArceneauxHayley — who will tonight become the youngest American to travel into space. You make all of Louisiana and #LA05 so incredibly proud!","date":"Wed Sep 15 23:05:54 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Tropical Depression Nicholas continues to bring increased rainfall and hazardous conditions across our region. Please continue to exercise caution and follow all directions from state and local officials. #LAWX","date":"Wed Sep 15 21:14:02 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Please follow the generator safety guidelines to protect yourself and your family. #LA05 #LAWX","date":"Tue Sep 14 21:20:24 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As Tropical Storm Nicholas brings increased rainfall to Louisiana, please travel with caution and be mindful of road conditions and flooding. #LA05 #LAWX","date":"Tue Sep 14 19:43:23 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 RESIDENTS: Tropical Storm Nicholas is expected to bring heavy rainfall to the CenLa region, St. Landry, and the Florida Parishes. Please continue to closely monitor the forecasts and follow all directions from state and local officials. #LAWX","date":"Tue Sep 14 13:07:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 STUDENTS: Are you interested in attending one of our nation’s service academies? The Louisiana congressional delegation will be hosting a virtual academy day on Sept. 25 so students can learn more about the nomination process. Get more information ⬇️ and RSVP! https://t.co/ztxIYpDRIG","date":"Mon Sep 13 21:13:27 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Homes across the Florida Parishes are now eligible for the Blue Roof Program. Click ⬇️ for more information on how to apply. #LA05","date":"Mon Sep 13 19:59:32 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As our state still works to recover, Tropical Storm Nicholas is set to bring more rainfall to our region. Please continue to monitor the forecasts and closely follow all updates from state and local officials. #LA05 #LAWX","date":"Mon Sep 13 14:37:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was so great to join @LaTechFB yesterday as the Bulldogs honored Greg Smith, one of our truly outstanding veterans! #EverLoyalBe https://t.co/6FzecqqiE9","date":"Sun Sep 12 13:46:19 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @LaFarmBureau for having me on @TWILATV this week to discuss our tour with @RepGarretGraves and @RepTroyCarter to assess #HurricaneIda’s impact. We’re working together to make sure that the people of Louisiana, including our farmers, have the resources they need.","date":"Sat Sep 11 20:03:42 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"20 years ago, our nation was brutally attacked. But in the midst of that horrific tragedy, we saw countless acts of heroism from our brave first responders and so many courageous individuals. We will never forget those innocent lives lost and always honor our heroes of 9/11. https://t.co/Nl5HKIzkaD","date":"Sat Sep 11 15:50:07 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Since this Administration took office in January, @DeltaRegional has been unable to award nearly $33 million in grants because key posts remain vacant. That’s why I’m leading a group of colleagues and asking @POTUS to fill these positions immediately. \n\nhttps://t.co/ToA87ryBwO","date":"Fri Sep 10 14:13:04 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"So glad to see @USACEHQ approved our request to expand the Blue Roof Program’s eligibility to West Feliciana, East Feliciana, St. Helena and Washington Parishes. To register call (888) 766-3258 or visit https://t.co/j7o695cQiY. #LA05","date":"Thu Sep 09 20:34:52 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"After hearing from countless constituents and local leaders who are having frustrating technical issues when applying for federal disaster assistance, @RepGarretGraves and I sent a letter to @FEMA_Deanne today asking her to make the process more functional for applicants. https://t.co/kDgkqAxD2W","date":"Thu Sep 09 20:08:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Rode with @RepGarretGraves and @RepTroyCarter all the way down to @FourchonPort to see the devastation in Lafourche Parish. Our delegation is united to help the people of South Louisiana as they work to recover from #HurricaneIda. https://t.co/4b4RSnVaNB","date":"Wed Sep 08 22:02:30 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"On the ground in @stcharlesgov with @RepGarretGraves and @RepTroyCarter surveying storm damage and discussing the federal resources that these communities will need to rebuild. https://t.co/IuKWv3PXKX","date":"Wed Sep 08 18:40:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@RepGarretGraves and I joined Parish President Robby Miller and @TeamTangipahoa in Hammond to discuss their pressing needs and how federal assistance can help this area rebuild. #LA05 https://t.co/eLxmnRpFZu","date":"Wed Sep 08 17:21:36 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @LaFarmBureau President Jim Harper for coming out to Hammond to discuss the recovery of our farmers and agricultural producers. https://t.co/06AEMCFpGK","date":"Wed Sep 08 16:35:27 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@RepGarretGraves and I stopped by the supply distribution site in Albany to meet with Livingston Parish President Layton Ricks and speak with the @LANationalGuard helping get residents the critical resources they need. https://t.co/niVMTrZGEJ","date":"Wed Sep 08 14:58:28 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed meeting some of the incredible National Guardsmen from around the country assisting with Louisiana’s response to #HurricaneIda. Thank you for helping our state! https://t.co/Aupr6rdUmO","date":"Wed Sep 08 14:44:10 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Came back to St. Helena Parish this morning with @RepGarretGraves to meet with local leaders and hear more about the pressing needs as they work to recover from #HurricaneIda. https://t.co/l2joVVQru6","date":"Wed Sep 08 13:29:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"There are great things happening at the Port of Columbia! This economic engine is helping bring so many jobs and investments to #LA05. Today, I visited with port and local leaders to talk about the opportunities in Caldwell Parish. https://t.co/MS74jHMIkq","date":"Tue Sep 07 23:17:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Had the opportunity to visit with some fantastic fifth graders and amazing teachers at Columbia Elementary in Caldwell Parish this morning. Thanks for having me join you for an awesome discussion about our government and the importance of participating in our democracy! https://t.co/xGMV9bz6AP","date":"Tue Sep 07 20:43:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 RESIDENTS: If you purchased a generator or chainsaw to assist with your cleanup after #HurricaneIda, you may be eligible for reimbursement from @fema. Click ⬇️ to learn more information and apply.","date":"Tue Sep 07 19:34:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to all of the hardworking men and women both here in #LA05 and across the country that keep the American economy going every single day. Happy #LaborDay!","date":"Mon Sep 06 17:36:11 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"#HurricaneIda brought so much damage to our Florida Parishes, yet not all of our residents are eligible for the Blue Roof program. That’s why my colleagues and I asked @fema to work with the @USACEHQ to reevaluate the eligibility for parishes that need this assistance. #LA05 https://t.co/d91YGPhTWK","date":"Mon Sep 06 14:04:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN #LA05 RESIDENTS: Parts of the Florida Parishes still remain under a boil water advisory. Please check the @LADeptHealth database to see if your local water system has been cleared. Click ⬇️ for LDH’s full list of water advisories. \n\n🔗 https://t.co/UONmsSD69T https://t.co/M7BCaYRJSF","date":"Sun Sep 05 13:33:30 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@fema is at the Tangipahoa Parish Library in Amite (204 NE Central Ave.) today helping individuals without internet access fill out their claims for disaster assistance. https://t.co/hm6Sw0tquf","date":"Sat Sep 04 19:50:17 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN TANGIPAHOA PARISH RESIDENTS: The Amite supply distribution center has been closed and four new locations to get ice, water, and food have been set up in Kentwood, Roseland, Independence, and Tangipahoa. Look ⬇️ to find more information. #LA05","date":"Sat Sep 04 17:34:17 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Checked-in with our local leaders in East Feliciana Parish yesterday, met some of their incredible first responders, and the amazing volunteers helping distribute needed aid in the community. #LA05 https://t.co/uKUsqYDt71","date":"Sat Sep 04 15:23:49 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’m absolutely heartbroken by the nursing home tragedy that we’ve seen unfold in the wake of #HurricaneIda. This morning, I visited the megashelter in Alexandria to talk to the evacuees and make sure they have everything they need. https://t.co/i9x7Z6UhlB","date":"Fri Sep 03 17:17:11 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"See ⬇️ for my full statement on President Biden’s visit to Louisiana. #HurricaneIda https://t.co/RWoca8pscF","date":"Fri Sep 03 16:39:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In parts of #LA05, residents will be waiting for over a month just to get their power turned back on. We need this Administration focused on getting us critical resources immediately so that we can rebuild our communities. https://t.co/4EEnqo72CO","date":"Fri Sep 03 14:30:18 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The damage from #HurricaneIda in the Florida Parishes is absolutely devastating. The rebuilding is a matter of months, not days. We need this Administration to act quickly so our citizens are able to get the federal help they desperately need. #LA05 https://t.co/kDzHFdFpdV","date":"Fri Sep 03 13:30:13 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In the wake of #HurricaneIda, our state desperately needs federal resources to rebuild. That’s why my colleagues and I are asking the President to prioritize the recovery by supporting swift supplemental disaster assistance and also providing long overdue help to SWLA. https://t.co/LpPCpPNJfr","date":"Thu Sep 02 18:59:14 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Three distribution sites are open in Tangipahoa Parish today to give out ice, water, and food to individuals who need those supplies. #LA05 https://t.co/FI3IVSpTMr","date":"Thu Sep 02 14:10:24 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Local officials in Washington Parish have done an amazing job leading their communities’ response to #HurricaneIda. We joined them today to discuss their current challenges and the critical resources our Florida Parishes need to rebuild. #LA05 https://t.co/m3S5u8BCj4","date":"Wed Sep 01 20:50:35 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Louisiana Department of Insurance has information available to help guide you when filing a claim with your insurance company. Read more ⬇️ or call LDI at 1-800-259-5300. #LA05 #LAWX \n\n🔗 https://t.co/iKe1lkkA4g https://t.co/J9DiFctz9J","date":"Wed Sep 01 19:19:22 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The @LADeptHealth has guidance available for how you can cleanup safely after the storm. Read more ⬇️ about how to keep yourself healthy and hazards to avoid. #LA05 #LAWX \n\n🔗 https://t.co/HyRtNflrfZ https://t.co/cwb3KMIweD","date":"Wed Sep 01 17:24:30 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you have been impacted by #HurricaneIda, our office is here to help. Click ⬇️ to find a full list of recovery resources or call our office at (202) 225-8490 for assistance. #LA05 \n\nhttps://t.co/XORhE7CxRH","date":"Wed Sep 01 16:00:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Continuing to assess storm damage and meet with local leaders across our Florida Parishes. Thanks to @TeamTangipahoa and Parish President Robby Miller for an informative visit yesterday. My team and I are here to help #LA05’s impacted communities recover. https://t.co/PcV8FwWhVY","date":"Wed Sep 01 13:49:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN RESIDENTS: Three distribution sites have been set up in Tangipahoa Parish with food, water, ice, and tarps for those who need those supplies. #LA05 #LAWX https://t.co/7Xjh3ZcT59","date":"Tue Aug 31 19:23:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you want to help the #HurricaneIda relief efforts, I would encourage you to support the @UnitedWayNELA’s “Embrace Louisiana” initiative collecting supplies for the evacuees sheltering in our area. #LAWX \n\n🔗 https://t.co/CNsIsgr4I8 https://t.co/sdG1kFsCW6","date":"Tue Aug 31 16:07:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you’re a small business owner and need to file a claim with the @SBAgov, visit https://t.co/CznsBwSEDb or call 1-800-659-2955. #LA05 #LAWX https://t.co/PLZ0ut3CaQ","date":"Tue Aug 31 15:36:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you need to file a claim with @fema, visit https://t.co/CznsBwSEDb or call 1-800-621-3362. #LA05 #LAWX https://t.co/7pFMdUb6cL","date":"Tue Aug 31 15:00:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you are in need of shelter, visit the @RedCross’ webpage for Louisiana shelters. Their site is updated every 20 minutes with the latest information about available space.\n\n🔗 https://t.co/4nKJs4hxiy https://t.co/dLpODmPN9r","date":"Tue Aug 31 14:29:22 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"#HurricaneIda has brought so much devastation to Louisiana. Our team is here to help the impacted communities in #LA05 rebuild. Click ⬇️ to find a list of storm recovery resources, guidance and information. #LAWX \n\nhttps://t.co/XORhE7CxRH","date":"Tue Aug 31 13:59:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As #LA05’s communities work to recover from #HurricaneIda, our offices are here to help. Click ⬇️ to find a list of recourses, information, and guidance to help you rebuild. #LAWX \n\nhttps://t.co/gtfvBdzmrT","date":"Mon Aug 30 20:04:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you’re looking for shelter, see ⬇️ for more information about the state shelters currently open across Louisiana. #LA05 #LAWX","date":"Mon Aug 30 19:18:17 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"🚨🚨911 is down in Washington Parish. Please call 985-335-8516 to reach the Sheriff’s Office if you need Emergency Assistance. https://t.co/mlDXkfM9Ue","date":"Mon Aug 30 17:06:11 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you’re in need of shelter, check the link ⬇️ for the most updated shelter information from the @RedCross. #LAWX #LA05 \n\nhttps://t.co/7ZmVQT6akp","date":"Mon Aug 30 15:56:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"🚨🚨911 is down in Tangipahoa Parish. Please call 985-748-3246 if you need Emergency Assistance.","date":"Mon Aug 30 15:24:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re beginning to assess the damage in our Florida Parishes as #HurricaneIda continues to impact other parts of #LA05. Please continue to follow all instructions from state and local officials and stay safe.","date":"Mon Aug 30 15:06:23 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"#HurricaneIda is bringing devastating impacts to our state. That’s why my colleagues and I are asking the President to approve @LouisianaGov’s request for federal assistance as quickly as possible. It’s critical that our communities have the resources they need to recover. #LAWX https://t.co/9BfaorQqED","date":"Mon Aug 30 01:56:35 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As we await #HurricaneIda, please join me in praying for Louisiana and her people.","date":"Sat Aug 28 23:58:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@LouisianaDCFS has opened a shelter in Bastrop and a special medical needs facility in Alexandria. If you’re in need of shelter as #HurricaneIda approaches, you can call 211 or text “LASHELTER” to 898-211. #LA05 #LAWX \n\nhttps://t.co/GSs8EYTJ61","date":"Sat Aug 28 19:56:55 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The @USDA has guidance and information available for farmers, ranchers and loggers as they make their final preparations for #HurricaneIda. Click ⬇️ to learn more. #LA05 #LAWX \n\nhttps://t.co/XZ8ap7VMlS https://t.co/8xgQlYNL11","date":"Sat Aug 28 19:30:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Do not underestimate the strength of #HurricaneIda. We have potential to see significant rain and winds throughout all of #LA05. Please finish your preparations today and continue to pay close attention to the important information coming from state and local officials. #LAWX","date":"Sat Aug 28 14:56:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you’re choosing to evacuate and seek shelter elsewhere, please travel with caution. For the latest up to date road information from @La_DOTD, visit https://t.co/jzqzoG0NVT. #LA05 #LAWX https://t.co/Set2odzmMe","date":"Sat Aug 28 11:48:51 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@GOHSEP is coordinating the state efforts on the ground in Louisiana. For information on state resources, visit their website at https://t.co/zOnWX4MGPQ. For some individual preparation tips, visit https://t.co/2hRTJIkn0N. #LA05 #LAWX https://t.co/g6ug4u3rRo","date":"Sat Aug 28 11:46:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@fema has preparedness information available on their website, https://t.co/zOT7Su7J7o. From questions about evacuation zones to gathering supplies, their guides can help you and your family prepare for impacts of #HurricaneIda in Louisiana. #LA05 #LAWX https://t.co/RJwcycqxqf","date":"Sat Aug 28 11:44:15 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As #HurricaneIda approaches Louisiana, keep up with the latest forecasts, models, tracks and predictions at the @NHC_Atlantic’s website, https://t.co/g6oa4x6hTI. #LA05 #LAWX https://t.co/z4r6jntpFl","date":"Sat Aug 28 11:41:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Earlier today, the President declared a federal emergency in Louisiana at the urging of our delegation. I want citizens to know that my colleagues and I are doing everything possible to ensure our communities have all the federal resources they need to respond to Hurricane Ida. https://t.co/xwTdPIZ0B7","date":"Fri Aug 27 22:45:22 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Hurricane Ida continues to intensify as it approaches Louisiana. Do not underestimate the strength of this storm. Now is the time to make your final preparations for this severe weather. Visit https://t.co/Ad6Y5evgN9 for guidance and information from @fema.","date":"Fri Aug 27 21:15:17 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ATTN RESIDENTS: Parts of #LA05 as far north as Avoyelles Parish are now under a Hurricane Watch. Please make sure your family, business or farm is prepared and continue to pay attention to the critical information coming from state and local officials. #LAWX","date":"Fri Aug 27 16:30:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Find some great hurricane preparedness resources ⬇️ from the @LSUAgCenter. Now is the time to make sure you and your family have a plan for #Ida’s impact on Louisiana. #LA05 #LAWX","date":"Fri Aug 27 13:45:08 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"My heart goes out to the families of our troops killed in Afghanistan. My prayer is that we do not lose another American life during this ongoing humanitarian crisis. May God bless the brave men and women serving in our armed forces.","date":"Thu Aug 26 18:43:44 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This news out of Afghanistan is devastating. Our prayers are with the brave men and women of our military, all American citizens still on the ground, and our Afghan allies amid this unfolding human tragedy.","date":"Thu Aug 26 15:39:51 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With a storm moving into the Gulf of Mexico and potentially impacting Louisiana next week, now is the time to make sure your family is prepared. #LA05 #LAWX \n\n- Visit https://t.co/YZ1fuNqXfR for resources from @GOHSEP\n- Visit https://t.co/Ad6Y5evgN9 for information from @fema","date":"Thu Aug 26 13:47:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Mayor Staci Mitchell and her team are doing outstanding work trying to bring more jobs, opportunities and investment to @WestMonroeCity. #LA05\n\nhttps://t.co/2zSZwuzs3B","date":"Thu Aug 26 00:28:32 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our veterans in #LA05 and rural areas around the country have been unable to take full advantage of their benefits for far too long. I'm proud to join with @RepRonnyJackson and my @HouseGOP colleagues to ask @SecVetAffairs to prioritize care for our veterans in rural communities. https://t.co/p10JMUbjXc","date":"Wed Aug 25 20:03:00 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Excited to see the @LSUAgCenter create this awesome training program for new farmers! Click ⬇️ to learn more about how to get involved.","date":"Wed Aug 25 18:25:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Today, Speaker Pelosi and the Democratic majority rammed through their irresponsible plan to spend more than $3.5 trillion on partisan priorities, pet projects and new social programs. I voted no, because I won’t co-sign their massive mortgage on our children’s future. https://t.co/zYc83W1ZW8","date":"Tue Aug 24 20:21:57 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every day, we see these heartbreaking images from Afghanistan. As a mother, I can’t even imagine what these families are going through. I’m committed to keep working in Congress to make sure our country brings home every American still there and helps our brave Afghan allies.","date":"Tue Aug 24 18:35:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our hardworking farmers, ranchers and loggers in #LA05 shouldn’t be burdened with undue bureaucratic rules when it comes to water. That’s why I’m working with my @HouseAgGOP colleagues to make sure that this policy is one that makes sense for #RuralAmerica.","date":"Tue Aug 24 17:38:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Now more than ever, the brave men and women who served our country in Afghanistan need our support. Click ⬇️ to find out more about the resources available to them and their families from the @DeptVetAffairs.","date":"Mon Aug 23 23:56:02 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The FDA has given full approval of the Pfizer vaccine. While I firmly believe that vaccination should always be an individual’s choice, please consider getting your shots if you haven’t already. If you still have questions, please consult with your doctor.","date":"Mon Aug 23 22:45:12 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The House is in session this week but it's not to address the crisis in Afghanistan. We’re here because Speaker Pelosi and the Democrats insist on pushing through irresponsible legislation that wastes trillions on their polarizing partisan priorities. \n\nhttps://t.co/7qRwsUsq5e","date":"Mon Aug 23 21:05:55 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Afghanistan is a humanitarian crisis. As a woman, I’m especially heartbroken to think of the oppression this brutal Taliban regime will inflict on women and girls. I’m committed to ensuring that protecting the Americans still there and assisting our Afghan allies is top priority.","date":"Sat Aug 21 23:59:00 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s so wonderful to read about this amazing community effort that Ms. Frances and the team at the Good Food Project have underway in Alexandria! They’re doing great things for the people of #CenLa. #LA05","date":"Sat Aug 21 22:37:27 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Louisiana’s rice mills ensure that our state, our nation and the world is nourished and fed. It was great being able to visit and learn more about the processing of this crucially important commodity. https://t.co/zJk5dHET2t","date":"Fri Aug 20 23:37:01 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @LaFarmBureau President Jim Harper for hosting us at his farm in Cheneyville to talk about the upcoming Farm Bill, sugarcane and some of the challenges facing our Louisiana farmers. https://t.co/Zdsl3hyVLh","date":"Fri Aug 20 22:18:32 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I have to say, a Rice Combine Harvester doesn’t drive as easy as my SUV with two car seats in the back! I appreciate the opportunity to get an up-close look at the incredible machinery our hardworking rice farmers use everyday. https://t.co/tm6GFtEygV","date":"Fri Aug 20 19:03:15 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Incredible visit today with local leaders and the team at @PortLakeCharles. I’m excited about the possibilities and partnerships in our future as we keep working with our Louisiana ports and #LA05’s farmers and producers to open up new markets and keep the world fed. https://t.co/hPwE54JxM8","date":"Fri Aug 20 15:39:04 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to the @LouisianaHBA for hosting me today in Alexandria! We had an awesome discussion about development in #LA05 and attracting more people, more jobs and more opportunities to our great state. https://t.co/9qkgRRqnRf","date":"Thu Aug 19 21:35:36 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The @DeptVetAffairs is offering free, walk-up counseling tomorrow for veterans in #CenLa. If you’re in need of assistance, click below to learn more.","date":"Thu Aug 19 20:00:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"On this #NationalAviationDay, we’re remembering #LA05’s General Claire Chennault – a true aviation pioneer and American hero. If you haven’t visited the @ChennaultMuseum in Monroe yet, it’s definitely worth a stop!","date":"Thu Aug 19 17:50:20 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our district is blessed with amazing people and resources. Thanks to the hardworking folks like those at the Port of Vidalia and Syrah Technologies who continue to bring jobs and opportunities to #LA05. https://t.co/Ds1QLwb79V","date":"Thu Aug 19 00:32:02 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@VidaliaMills in Concordia Parish is a great example of how a homegrown business can prosper here in #LA05! Enjoyed visiting their amazing facilities and meeting some of the incredible people behind this awesome Louisiana company. https://t.co/u4lKxfQYY7","date":"Wed Aug 18 20:55:24 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"#OnThisDay 101 years ago, women finally got the right to vote. Now, we have a record number of women serving in Congress. I’m proud to be a part of this historic group and look forward to many more joining our ranks and helping lead America into the future!","date":"Wed Aug 18 19:07:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to the @LAGOP for supporting The COVID-19 American History Project Act! This bill will ensure that the @librarycongress preserves the stories of survivors, the families who have been left behind, and health care heroes to help inform decisions both today and in the future. https://t.co/fuBiymhnfW","date":"Tue Aug 17 23:37:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Coast Professional for hosting me today for a conversation about growing more great companies here in #LA05! https://t.co/QGYtdB8AAG","date":"Tue Aug 17 20:56:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a mother, I look at this picture and am heartbroken to see parents and their children fleeing for their lives. The situation in Afghanistan is a humanitarian crisis.","date":"Tue Aug 17 17:05:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Anybody who sees what’s going on in Afghanistan knows this isn’t a strategic withdrawal. It’s an abrupt abandonment. This President’s response to this unfolding tragedy wasn’t to accept responsibility or identify any semblance of a plan. He instead played the blame game.","date":"Mon Aug 16 22:03:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The American people deserve answers and accountability in this unfolding tragedy.","date":"Mon Aug 16 20:39:03 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The reports we are receiving out of Afghanistan today are concerning to say the least. The Administration has failed in the planning and execution of this withdrawal. Their blunder will only embolden a brutal Taliban regime and radical terrorist groups.","date":"Sun Aug 15 16:23:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s harvest time in #LA05! Did you know that 49% of Louisiana’s entire agricultural output comes from our 24 parishes? #LAGOV","date":"Sat Aug 14 19:56:23 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"#OnThisDay in 1945, the fighting in the Pacific stopped as World War II ended. We’re grateful for the service of so many, including Luke’s beloved grandfather, “Papa Dick,” who selflessly left their homes and fought to free the world from tyranny. https://t.co/Mn60aquXJo","date":"Sat Aug 14 15:06:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Always proud to be a Warhawk! #TheBestIsOnTheBayou","date":"Fri Aug 13 21:21:54 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Broadband is the most important resource for our rural communities since electrification in the 1930s. Click ⬇️ to learn more about the state and federal resources available to help bring high speed internet access to your area. #LA05 \n\nhttps://t.co/2hUUhXJ7Ng","date":"Fri Aug 13 20:19:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This Administration’s misguided policies on oil and gas are not only driving up your price at the pump, but they’re also costing Louisiana thousands of jobs. The answer is not more foreign oil – it’s getting our hardworking citizens back on the job.\n\nhttps://t.co/MZMK5RCXv1","date":"Fri Aug 13 18:53:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I don’t know how it couldn’t be any more clear — America has a crisis at our southern border. Our citizens have had enough of this Administration’s continued failure to act on border security.","date":"Fri Aug 13 00:00:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With tropical weather headed into the Gulf of Mexico, I want to encourage all residents to monitor the forecasts over the next few days. If your family doesn’t already have a plan, visit https://t.co/YZ1fuNqXfR for storm preparedness information. #LA05 #lawx","date":"Thu Aug 12 23:14:04 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @PortNOLA for hosting our team today for a great visit and discussion about how we can work together to make sure that we connect #LA05’s farmers and producers with customers and markets around the world. https://t.co/CYQITvMVXq","date":"Thu Aug 12 21:58:05 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Productive meeting in East Feliciana Parish today with @RepGarretGraves, community leaders and constituents to discuss the critical need for real broadband investment in Louisiana’s rural communities. #LA05 https://t.co/g27akzDCxE","date":"Wed Aug 11 22:33:51 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s great to see the @CityofMonroe break ground on new improvements to the water system. This project is not only important for our citizens, but it is crucial for future business growth and development. #Oneroe https://t.co/64G6zKok5X","date":"Tue Aug 10 22:07:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to @MayorEllis on being elected as the new President of the Louisiana Conference of Mayors! I know you will be a great advocate for all our cities, just as you are for @CityofMonroe.\n\nhttps://t.co/3Us5XIFZUu","date":"Tue Aug 10 20:08:17 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We can’t keep allowing Communist China to rip off American businesses and consumers. That’s why I’m bringing forward legislation to make sure we hold companies hiding behind the Chinese government and the Chinese Communist Party accountable. https://t.co/UZjcy94RPQ","date":"Tue Aug 10 18:21:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Food security is national security. Thanks to our hardworking farmers in #LA05 for all they do to make sure America continues to have the safest and most secure food supply in the world. \n\nhttps://t.co/PGLGfoMXmo","date":"Mon Aug 09 23:03:27 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"When it comes to border security, this Administration has repeatedly dropped the ball. It’s clear that they have no ideas, no plan, and no clue. The American people can’t afford to keep waiting on them to take action.","date":"Mon Aug 09 20:44:40 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Had such a fantastic visit to the @MSJE_NOLA! Their outstanding team couldn’t have been any more hospitable. I encourage everybody to stop by and learn more about this important part of American history. https://t.co/MH9JxLpxyg","date":"Mon Aug 09 18:53:02 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Mayor Mitchell and @WestMonroeCity on winning the LMA’s Community Achievement Award for their awesome efforts to revitalize downtown!\n\nhttps://t.co/EBqNbClcOl","date":"Mon Aug 09 00:24:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"My prayers are with @CoachTBowden and his family at this time. Not only was Bobby Bowden a great football coach, he was an incredible example of a Christian truly living their faith every day. We need more leaders like him.","date":"Sun Aug 08 22:58:38 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s harvest time in #LA05! Thanks to all of our hardworking corn producers for keeping our nation fed and nourished.","date":"Sat Aug 07 18:19:30 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to President @rickbrewer and @LA_College on bringing a record-breaking freshman class to Pineville! I hope more students throughout #LA05 continue to follow their dreams and pursue higher education.","date":"Sat Aug 07 14:47:15 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s amazing to see our community in Richland Parish coming together to support our first responders and front-line health care heroes. Thanks to the congregation at Greater New Beginning in Rayville for organizing this awesome event!\n\nhttps://t.co/uTXo7noHvV","date":"Sat Aug 07 00:15:03 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s obvious that there is a crisis at our southern border. It’s past time for this Administration to step up and address it. The American people deserve action and answers.","date":"Fri Aug 06 23:15:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Incredibly proud to be a part of the historic number of Republican women serving in the 117th Congress! I look forward to many more joining our ranks in the years to come. \n\nhttps://t.co/pNjF6qaGC4","date":"Fri Aug 06 22:01:52 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"While traveling across #LA05, I’ve heard from countless hardworking teachers, police officers and firefighters who have been unfairly penalized by WEP. That’s why I’m bringing forward legislation to ensure that our public servants receive their full Social Security benefits. https://t.co/cUokVOQaNr","date":"Fri Aug 06 20:15:04 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I firmly believe that internet access is just as important to our rural communities as electrification was nearly a century ago. If Louisiana is going to be competitive in the 21st Century economy, then we must #EndTheDigitalDivide.","date":"Fri Aug 06 00:40:58 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"When it comes to the border, it’s clear that this Administration has no ideas, no plan, and no clue. I joined @MichaelEchols on KMLB this week to discuss the migrant releases we’ve seen in #LA05 and the actions I’m taking to demand answers from @DHSgov. https://t.co/bOvBWcg1YY","date":"Thu Aug 05 23:08:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In the past 24 hours, I’ve heard from countless individuals who have experienced their own tragic loss due to COVID-19. I know that my family’s story is just one of thousands across the country. It’s when we tell our stories that true healing can begin.","date":"Thu Aug 05 20:55:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’m working hard in Congress to pass H.R. 4738 to ensure that we soon have a place in the @librarycongress where we can preserve all of our stories to help inform decisions today and in the years to come. \n\nhttps://t.co/9sUDh2hbWt","date":"Thu Aug 05 20:55:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We have the answer to COVID-19. This vaccine can not only save your life but also the life of those you love. My prayer is that not one more person loses their life to this virus.\n\nThanks to @DavidBegnaud and @CBSThisMorning for coming to Start to tell our family’s story.","date":"Wed Aug 04 13:44:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The face says it all! On this #NationalWatermelonDay, Jeremiah wants to remind everybody that the world’s best watermelon is grown in #LA05! https://t.co/bvqLdkgT3x","date":"Tue Aug 03 23:37:58 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"My colleagues and I are beyond frustrated by the continued silence from @DHSgov on migrant releases in our state. As Louisiana's representatives in Congress, we’re entitled to answers. That’s why I'm co-sponsoring H.R. 4906, to require public disclosures of this information. https://t.co/P3N1FolhHY","date":"Tue Aug 03 21:35:23 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Proud to continue working with both Republicans and Democrats to advance this important legislation that will connect our rural communities in #LA05 and help #EndTheDigitalDivide.","date":"Tue Aug 03 20:13:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s fantastic that the @GSU_TIGERS are taking the first steps to creating a women’s gymnastics program. I look forward to one day being in the stands for a meet! #GramFam\n\nhttps://t.co/ffqGebMAjP","date":"Mon Aug 02 22:45:02 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Looking for a job? You can click below to learn more about @LouisianaWorks’ statewide job fair and sign up today.","date":"Mon Aug 02 21:50:12 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Last week, I introduced H.R. 4788. This critical legislation will make sure that the Windfall Elimination Provision does not apply to our public servants whose monthly pension benefits are less than $5,500. It’s time for us to stop these unfair penalties.","date":"Mon Aug 02 20:44:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our thoughts and prayers are with Mayor Pierce’s family. He was a truly groundbreaking leader in our region and we are so grateful for his decades of service to both the @CityofMonroe and Ouachita Parish. \n\nhttps://t.co/VYKrEtZaca","date":"Sun Aug 01 22:24:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This week, I’m thinking about one of my personal heroes, Lindy Boggs, as we mark the eighth anniversary of her passing. In the face of tragic circumstances, she heroically stepped up to represent Louisiana in Congress. Her strength and grace continues to be an inspiration today. https://t.co/hvM6HGjdHW","date":"Sat Jul 31 20:14:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It means so much to have Mayor Penn and the Bonita leadership advocating for their community on Capitol Hill. I look forward to continuing to be a partner for #LA05’s rural communities in Washington. \n\nhttps://t.co/0xkHUROZnD","date":"Fri Jul 30 22:19:04 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s time for Social Security to stop penalizing Americans who have spent their careers in public service. This week, we introduced H.R. 4788, which would ensure that the Windfall Elimination Provision does not apply to individuals whose monthly benefits are less than $5,500. https://t.co/YlMoHVtm7u","date":"Fri Jul 30 18:29:54 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I can’t think of a more meaningful way to honor Luke and over 610,000 Americans who have lost their lives to this terrible pandemic.\n\nhttps://t.co/QwgR1X1KeO","date":"Fri Jul 30 14:43:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This week we introduced legislation that will collect the stories of COVID-19 survivors, the families and children who have been left behind, and frontline healthcare workers, the real heroes of this pandemic.","date":"Fri Jul 30 14:43:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Stories are powerful. They resonate, touch people’s lives, and often move us to action.","date":"Fri Jul 30 14:43:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"One of the most troubling things I’ve heard is people saying that this virus doesn’t really affect kids. But think about the 1.1 million children across the globe that will be staring at a parent's empty seat tonight during dinner.\n\nhttps://t.co/9x7vVPaKf9","date":"Thu Jul 29 23:01:10 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"On this #NationalInternDay, I want to recognize the outstanding group of bright students from #LA05 working in our office this summer. They’ve done such an awesome job for us and we can’t wait to see what amazing things they do in the future! https://t.co/viv66UxUFO","date":"Thu Jul 29 20:56:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The House Democrats have put forward an irresponsible spending plan packed with partisan priorities. I proposed five amendments to defend our conservative values and protect #LA05’s rural communities. But the majority won’t even allow a vote on them. https://t.co/d274LHnpaj","date":"Thu Jul 29 18:15:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With the sharing of a story, true healing can begin. My first bill - H.R. 4738 - ensures we preserve the stories of COVID-19 survivors, the families who have lost loved ones, and our health care heroes in the @librarycongress to help inform our decisions today and in the future. https://t.co/FkPqG0yCpN","date":"Thu Jul 29 15:17:23 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Proud to join with both Republicans and Democrats on the House Agriculture Committee today to advance legislation that ensures #LA05’s farmers get the assistance they need to recover from Hurricanes Laura and Delta.","date":"Tue Jul 27 23:34:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Mayor Virgil Penn and the community leaders from Bonita who stopped by our Capitol Hill office today to visit. I look forward to working with you to move the village, Morehouse Parish and all of #LA05 forward. https://t.co/bX5kzsYWVP","date":"Tue Jul 27 22:33:27 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"My story is only one of thousands across our state and our country. I encourage you to talk to your friends and neighbors who have been impacted by COVID and listen to their stories. My prayer is that not one more person will have to lose their life to this horrific virus.","date":"Tue Jul 27 16:56:14 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Proud to announce that @LaTech is among the 32 universities nationwide that were selected by @ENERGY to host an Industrial Assessment Center. This project will not only mean jobs, it will also make major long term contributions to #LA05.\n\nhttps://t.co/a9oNMWY0bc","date":"Mon Jul 26 20:58:05 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If your family needs assistance with affording broadband services for school or work, click ⬇️ to learn more about how the @FCC’s Emergency Broadband Benefit can help. #LA05 \n\nhttps://t.co/RUDXyi2zLC","date":"Mon Jul 26 18:07:19 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Mr. Ernest Hill of Richland Parish and all of our outstanding #LA05 teachers who were recognized. Thank you for going above and beyond for our students!\n\nhttps://t.co/PSbPoinu9U","date":"Sun Jul 25 23:34:49 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s fantastic to see this awesome program getting underway at @LSUAlexandria!\n\nhttps://t.co/TQFgM37F63","date":"Sun Jul 25 22:08:23 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Did you know that President Teddy Roosevelt’s love of the bears we have here in #LA05 led to the creation of the iconic toy?","date":"Sun Jul 25 14:44:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Some of Louisiana’s best blackberries are grown in #LA05! Learn more about how they don’t just taste great, but are good for you, too.\n\nhttps://t.co/RNeYuXjPFj","date":"Sat Jul 24 18:00:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: @DeltaRegional is helping collect information about broadband in #LA05. Take the survey ⬇️ and tell us about the digital connection in your community.\n\nhttps://t.co/6nV9PYH9hS","date":"Sat Jul 24 15:00:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @TWILATV for having me on to discuss our bipartisan efforts to bring major broadband investments to #LA05 and rural areas around the country. We’re working hard to #EndTheDigitalDivide.\n\nhttps://t.co/pnMbnDQxB7","date":"Fri Jul 23 20:00:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As I visited our colleges and universities across #LA05, I was impressed to see so much partnership with the business community. Glad to see @LSUAlexandria is helping students get some hands-on experience.","date":"Fri Jul 23 17:10:04 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Every Friday morning, Choudrant Appliances has coffee and doughnuts for anybody who wants to come by. It’s great to see the Wise family keeping this business going after 56 years. I look forward to stopping for a visit next time I’m in Lincoln Parish! #LA05 https://t.co/4uAhkYddIa","date":"Fri Jul 23 12:31:34 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Delta variant poses a dangerous threat to so many in #LA05. I personally encourage you to consult with your doctor about the vaccine. While I firmly believe that it is your choice, this shot can save lives.\n\nhttps://t.co/nkUIv6zkhP","date":"Fri Jul 23 00:26:51 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re excited to have our South Louisiana office in Amite here to serve the people of the Florida Parishes. Click ⬇️ to learn more about how to contact our district staff and how we can assist you.\n\nhttps://t.co/O8TQYPa3HB","date":"Thu Jul 22 23:41:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Women are helping lead the way in agriculture. We had a fantastic conversation yesterday about more opportunities for women with my @HouseAgGOP colleagues and some awesome industry leaders! https://t.co/HshIdc0jpn","date":"Thu Jul 22 22:34:27 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Sgt. Martha Adelaja of the @usairforce for presenting our office with an official seal. We’re proud to support the men and women of our armed forces! https://t.co/LtikG5ROkr","date":"Thu Jul 22 00:01:55 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Had such a delightful discussion today with Ambassador @NancyGBrinker for an upcoming episode of her show, “Conversations” on @newsmax! https://t.co/zoBIjYwcdo","date":"Wed Jul 21 22:54:33 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I am deeply troubled by the stories of immigration detainees being released in #LA05. It is outrageous that nobody notified my office or other officials. I join my colleagues in demanding a complete explanation and an immediate stop to these releases.\n\nhttps://t.co/4sRCBvBjl9","date":"Wed Jul 21 21:16:14 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our Alexandria District Office is here to provide assistance to our constituents in CenLa. Click ⬇️ to learn more about our location, hours, and contact information.  \nhttps://t.co/UbApS5GreG","date":"Wed Jul 21 20:46:01 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With some help from their Papa, Jeremiah and Jacqueline put a new American flag in our yard to honor their dad. https://t.co/PvCoU0fu7B","date":"Tue Jul 20 23:06:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our hardworking loggers are an important part of #LA05. Learn more about how the @USDA is helping the timber industry recover and what assistance is available.","date":"Tue Jul 20 22:04:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Located in Monroe, our Northeast Louisiana District Office is here to serve the people of #LA05. Learn more about how to contact us ⬇ and let us know how we can be of assistance.\n\nhttps://t.co/uVa5tUjKHy","date":"Tue Jul 20 21:24:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations Commander Jackson! Thank you for all you do to protect our nation and keep our Navy safe. You truly represent the best of Monroe and #LA05!\n\nhttps://t.co/Nwt2kWGKVF","date":"Tue Jul 20 20:00:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Excited to see Monroe officially open a new fire station, command center and bring in two new trucks! Thanks to the brave men and women of the Fire Department for all they do for the community. https://t.co/MDzUUXcJFN","date":"Mon Jul 19 22:26:44 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Last week, Republicans and Democrats on the House Agriculture Committee came together to support a substantive broadband bill. If Congress can keep working together in a bipartisan way, we can finally connect our rural communities in #LA05 and #EndTheDigitialDivide. https://t.co/4xPnMyGkRL","date":"Mon Jul 19 20:52:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"So inspired by the strength and resiliency of the faith community at the Vidalia United Methodist Church! #LA05\n\nhttps://t.co/3QIgwuwA3O","date":"Mon Jul 19 19:39:13 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Proud to join my @HouseGOP colleagues and support the hardworking men and women of our law enforcement agencies at the border.","date":"Mon Jul 19 18:31:44 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Jeremiah and Jacqueline agree, #NationalIceCreamDay might be one of their favorite days! https://t.co/4aqvdWXYuS","date":"Sun Jul 18 18:11:13 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is so amazing to see the community in Franklinton come together to show their patriotic pride! #LA05\n\nhttps://t.co/k8besCspuN","date":"Sun Jul 18 14:58:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’ve got delicious food in all corners of #LA05 and some of Louisiana’s best Cajun cooking in St. Landry Parish! Always worth stopping for a meal.","date":"Sat Jul 17 18:33:36 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@DeltaRegional is an important partner helping to bring broadband to #LA05. I encourage everybody do their part by taking this test to tell us about the digital connection in your community.\n\nhttps://t.co/mSbg0a9v6L","date":"Sat Jul 17 15:39:55 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thank you @SUSprez for your years of dedication to Louisiana’s students. I hope you enjoy your very well-deserved retirement!","date":"Fri Jul 16 20:49:28 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As @TheH2OInstitute shows, so many incredible things can be done when you bring together government, business and industry, and education. I look forward to working with @MayorEllis and his team to help bring this kind of investment to #LA05. https://t.co/PmBXwGtAwi","date":"Fri Jul 16 19:14:54 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We are so inspired by our visit to @TheH2OInstitute with @MayorEllis, our #lalege delegation and local leaders from #LA05! Thanks to the amazing scientists and leaders from @LouisianaCPRA and @LSU_CCE for such an informative discussion. Oh the possibilities! https://t.co/p8cIjn6iBq","date":"Fri Jul 16 17:20:14 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed visiting with @TWILATV and the team from the @LaFarmBureau this morning about my work on @HouseAgGOP and advocacy for Louisiana’s farmers. #LA05 https://t.co/HWBwUAVgwU","date":"Fri Jul 16 14:51:42 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With so many small businesses unable to find workers, Congress shouldn’t be creating more burdensome rules for job recruitment platforms. That's why I offered an amendment to the Protect Older Job Applicants Act to prevent the Democrats from putting more regulations in place. https://t.co/zjaGYJDpeH","date":"Thu Jul 15 21:34:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This should be a bipartisan bill that supports domestic violence survivors, not legislation that pushes one side’s agenda.","date":"Thu Jul 15 20:37:10 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"During today’s @EdLaborGOP hearing, I tried to stop the Democrats from using the Family Violence Prevention and Services Act to fund abortions with taxpayer dollars. Unfortunately, they voted down my amendment. https://t.co/YccB156bSR","date":"Thu Jul 15 20:36:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The people of Cuba have suffered under a failed socialist system for far too long. I join those calling on the White House to give the island full internet access. Cubans must have a voice to tell the world about their fight for freedom.\n\nhttps://t.co/scZC6aR3rA","date":"Thu Jul 15 19:28:51 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I would like to personally encourage #LA05 to help us end this horrific pandemic by getting the vaccine. While I believe it should always be your choice, this vaccine can truly save lives.","date":"Wed Jul 14 20:58:17 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to the Washington Parish Republican Women for hosting us today to discuss our office’s work in the Florida Parishes. #LA05 https://t.co/dAR5QVNxYp","date":"Wed Jul 14 19:54:13 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This is great news for Ruston and Lincoln Parish! Glad to see the city, @LATech and @Grambling1901 working to bring some of our best and brightest back to #LA05. \n\nhttps://t.co/Ig5rnogmQO","date":"Wed Jul 14 17:20:15 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The eviction moratorium is hurting our small businesses and disincentivizing employees from returning to work. With almost every public health restriction lifted, it’s time to end this policy. That’s why I sent a letter to the @CDCDirector to voice my concerns. https://t.co/dchA58gZaE","date":"Tue Jul 13 21:10:14 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our hardworking ranchers and dairy farmers are an important part of #LA05, producing the milk and beef that keep our nation nourished and fed. Happy #CowAppreciationDay!","date":"Tue Jul 13 19:45:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: The @USDA will be sending more than $7.7 million to Tallulah to help rehabilitate the city’s water system. #LA05\n\nhttps://t.co/NZGBhtxG59","date":"Mon Jul 12 21:22:38 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Like many, I will remember him as a true Louisiana original for bringing his own unique style to our politics and embodying our state’s joie de vivre.","date":"Mon Jul 12 14:56:10 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I want to express my condolences to the family of Gov. Edwin Edwards and his countless friends across Louisiana. He lived a long and remarkable life that took him from rural Avoyelles Parish to the Governor’s Mansion and left a lasting impact on our state. https://t.co/UczVU9aYJg","date":"Mon Jul 12 14:55:59 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The @IndyBowl is an economic driver for North Louisiana and brings so much pride to our region. Enjoyed joining @radiancetechinc to celebrate their sponsorship of this important event. #LA05 https://t.co/Lh2ki5vXRX","date":"Sun Jul 11 15:16:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"My friend @ScottFranklinJr has been the most incredible champion for Richland Parish. Thanks for all your hard work with our Chamber, Scott!","date":"Sat Jul 10 21:25:12 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Honored to join the @ChennaultMuseum today as we paid tribute to #LA05’s outstanding veterans. Thank you for your service to our nation! https://t.co/RTTao8fIhL","date":"Sat Jul 10 18:40:58 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is ridiculous that nearly 1,100 Louisiana prisoners fraudulently claimed almost $6.2 million in unemployment benefits. That’s why I’m joining my colleagues and asking @USDOL to investigate the full extent of the pandemic's unemployment fraud. https://t.co/U8B6XGgH4e","date":"Fri Jul 09 22:22:22 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Proud to announce that more than $7.7 million in federal funding will soon be heading to Tallulah to help the city rehabilitate their water system. #LA05\n\nhttps://t.co/NZGBhtxG59","date":"Fri Jul 09 20:49:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Had an amazing time meeting so many outstanding administrators, faculty and students from colleges and universities across #LA05 during our education tour. There are truly some special things happening on our campuses!\n\nhttps://t.co/krl27H83e1","date":"Fri Jul 09 19:36:55 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our colleges and universities are the economic engines for our communities in #LA05. Thanks to @NTCCChancellor, his great team and Bogalusa’s local leaders for welcoming us to discuss the critically important role that @NTCCgators plays in Washington Parish. https://t.co/7OK0RQmYHD","date":"Thu Jul 08 22:39:57 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"There are truly some exceptional things happening at @LSUAlexandria! Thanks to Chancellor @coreil_paul and his team for a great conversation about their higher ed priorities in CenLa. https://t.co/2xx13zBJB5","date":"Thu Jul 08 17:28:00 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"At @goCLTCC they are helping build the future workforce of CenLa. Thanks to Chancellor @jimmysawtelle and his team for welcoming us — and letting me drive their big rig simulator! https://t.co/AEKqxfttjX","date":"Thu Jul 08 15:56:01 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was great starting Day 2 of our #LA05 education tour in the faith-filled learning environment at @LA_College! Thanks to President @rickbrewer and his amazing team for welcoming us to Pineville. https://t.co/JUVUfeYCaI","date":"Thu Jul 08 14:12:57 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was great to visit with some of @Grambling1901’s outstanding students, faculty and administrators. Thanks to the #GramFam for such a warm welcome on our #LA05 education tour! https://t.co/GpNRfKAwjy","date":"Wed Jul 07 20:30:42 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to President @lkguice, the awesome team at @LATech and Mayor Ronny Walker for hosting us as part of the #LA05 education tour! There are truly some incredible things happening in Ruston. #EverLoyalBe https://t.co/hTcC0Rf6iS","date":"Wed Jul 07 19:02:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed being back at my alma mater, @ULM_Official for the second stop on our #LA05 education tour! Thanks to President Berry and his staff for hosting us to discuss their priorities and the great things happening on campus. #TheBestIsOnTheBayou https://t.co/uqpWCNpOwu","date":"Wed Jul 07 16:59:42 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Great to kick off our #LA05 education tour with a visit to @LADeltaCC! Thanks to Chancellor Esters and his team for an informative discussion about workforce development in our region. https://t.co/SWND9cNaPI","date":"Wed Jul 07 15:19:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Registration is now open for the Congressional App Challenge! This national competition is a great opportunity for some of #LA05’s best and brightest students to showcase their skills. Click ⬇️ to register.\n\nhttps://t.co/yFr1JGAkyj","date":"Tue Jul 06 21:46:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"APPLY NOW: Schools and libraries across #LA05 are eligible for broadband grants through the @FCC’s Emergency Connectivity Fund. Learn more ⬇️.","date":"Tue Jul 06 20:10:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Nancy Reagan’s strength and dedication continues to be an inspiration. We are incredibly grateful for her service to our country. Happy Birthday, Nancy!","date":"Tue Jul 06 18:42:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Welcome to Louisiana, President @WFTate4! I look forward to working with you and campus leaders at the @LSUAgCenter and @LSUAlexandria to continue moving our state forward. #LA05","date":"Tue Jul 06 16:46:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to the Winnsboro Easter Rock Ensemble on being named as 2021 National Heritage Fellows by @NEAarts! I can’t wait for your performance at the Smithsonian. #LA05\n\nhttps://t.co/n7aFbHL2vf","date":"Mon Jul 05 22:59:58 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":".@LSUAlexandria’s commitment to educating our future Agribusiness leaders will ensure that our farmers, ranchers and loggers in #LA05 will continue to thrive.","date":"Mon Jul 05 21:39:19 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Important work happening across the aisle to provide disaster recovery legislation.","date":"Mon Jul 05 20:40:39 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Two things Jeremiah loves the most: birthdays and dinosaurs! Wishing #LA05 a very Happy Independence Day 🇺🇸🎇🦖 https://t.co/SgT7sg5qww","date":"Sun Jul 04 13:21:51 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Great day at Monroe’s Triangle Park for the Children’s Parade! #IndependenceDay https://t.co/fF03WHHdk5","date":"Sat Jul 03 20:43:52 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We live in the greatest nation in the world, where we can all give thanks for the opportunity for life, liberty and the pursuit of happiness. Happy #IndependenceDay, #LA05! https://t.co/PoCi6Z2V1r","date":"Sat Jul 03 13:14:36 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Plenty of awesome ways to spend this #IndependenceDay weekend in #LA05! Click ⬇️ to learn more about events in our district and the state.\n\nhttps://t.co/UUOhDuw7co","date":"Fri Jul 02 20:23:12 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Such a wonderful time meeting with leaders in Caldwell Parish this week to discuss opportunities for the Port of Columbia. https://t.co/pBtNyeISgJ","date":"Fri Jul 02 18:07:39 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s time for America to go back to work and that begins by ending the eviction moratorium. I signed onto legislation this week that would stop incentivizing people to stay home.\n\nhttps://t.co/BbVWRNMjw7","date":"Fri Jul 02 14:52:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"More than $3 million at Alexandria International Airport is a big win for #LA05. Was thrilled to join Rich and Trish on KSYL this morning to discuss the impact of this grant on CenLa! https://t.co/bWF3YJIGw6","date":"Thu Jul 01 20:39:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s time to STOP playing POLITICAL games with our country’s infrastructure. Instead of a compromise, all the House Democrats put forward is a one-sided bill with the Green New Deal. https://t.co/2fe6F8nFt9","date":"Thu Jul 01 19:26:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I couldn’t agree more. The fact that experts believe this virus came from a Chinese lab we funded is beyond infuriating. That’s why I’m co-sponsoring legislation to make sure we send no American tax dollars to these labs in hostile foreign countries.","date":"Wed Jun 30 23:41:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Students in #LA05 shouldn’t be doing their homework from a McDonald’s just because it’s the only place where they get good internet. I look forward to continuing to work with our communities and providers to increase rural broadband access.\n\nhttps://t.co/mUjuRvo7TN","date":"Wed Jun 30 22:45:05 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"You have the constitutional right to own a gun. With this White House and the Democratic majority intent on passing more anti-gun legislation, I’m helping lead the charge in Congress to protect the Second Amendment. https://t.co/ymEd0fOaBx","date":"Wed Jun 30 21:44:57 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s been great to have our very first intern, Macy Lou Debnam of West Monroe, working in our Washington, D.C. office. Macy is currently a senior at @SMU studying political science and journalism. We know she will continue to do great things in the future! https://t.co/w9enONETG8","date":"Tue Jun 29 22:57:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The federal government shouldn’t be funding state and local gun registries of lawful owners. That’s why I’m co-sponsoring the Gun Owner Registration Information Protection Act, which will ensure NO taxpayer funding is used to pay for invasive gun registries. https://t.co/pJgcMoBQ7F","date":"Tue Jun 29 21:25:49 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Harrison Kircher from the @chickencouncil for coming by our Capitol Hill office today to discuss some of the challenges facing America’s poultry producers. https://t.co/mz2z3ssLiX","date":"Tue Jun 29 19:04:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"More federal bureaucracy and overly burdensome regulations on America’s navigable waters will be harmful to both farmers and small businesses across #LA05. That’s why I joined my colleagues to oppose the administration’s proposed actions.","date":"Mon Jun 28 22:13:16 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to @LaFarmBureau President Jim Harper and all of the organization’s newly elected and re-elected board members. I look forward to continuing to partner with you to advance Louisiana agriculture.\n\nhttps://t.co/QGscmxDtGy","date":"Mon Jun 28 20:42:49 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"American tax dollars shouldn’t be funding the research of “potential pandemic pathogens” in hostile countries like China, Russia, Iran and North Korea. That’s why I’m co-sponsoring legislation to ensure our public funds aren’t spent in the laboratories of our foreign adversaries.","date":"Mon Jun 28 19:20:54 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’m proud to defend our pro-life values in Congress and work with my @HouseGOP colleagues to #SaveHyde.","date":"Sun Jun 27 18:56:18 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was great to present a flag from the U.S. Capitol to Bertha Allbritton of Ruston for her 102 birthday! She is such an inspiration as she continues to live a full and active life. https://t.co/lX3l9PmRSq","date":"Sun Jun 27 16:26:24 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This year, @LATechBSB gave all of North Louisiana a reason to cheer! It was great to see the @CITYofRUSTON honor Coach @LaneBurroughs23 and the team this week. https://t.co/ulFrWIL1WG","date":"Fri Jun 25 20:52:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"There is no doubt that the past few years have been difficult for our dairy farmers. That’s why my @HouseAgGOP colleagues and I are committed to helping America’s dairy producers. #LA05","date":"Fri Jun 25 19:20:14 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Dr. @ofmcmeans from the @suagcenter and @SouthernU_BR for stopping by our office today to discuss agricultural education and outreach. We look forward to continuing to work with you and all of Louisiana’s higher ed leaders to move #LA05 and our state forward. https://t.co/XAzvWwwBfT","date":"Fri Jun 25 17:36:11 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As a former university administrator and professor, I’ve seen so many students take on massive debt without fully understanding the impact on their futures. During today’s @EdLaborGOP hearing, I asked @SecCardona what Congress and @usedgov can do to improve financial literacy. https://t.co/PcmwOQ05h2","date":"Thu Jun 24 21:14:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Glad to join @MATTDUNN_radio this morning on KSYL in Alexandria to discuss our fight to #SaveHyde and prevent taxpayer dollars from being spent on abortions. https://t.co/lL8N1gJcK5","date":"Thu Jun 24 19:35:00 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @SBAList for stopping by our Capitol Hill office for a conversation about our pro-life values. I look forward to continuing to work with you to defend the rights of the unborn.","date":"Thu Jun 24 18:33:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was great joining @AllAgAllDay radio to discuss the need for rural broadband both in #LA05 and around the nation. It’s time for us to #EndTheDigitalDivide and connect our communities with the digital world. https://t.co/iGlSYDUltm","date":"Wed Jun 23 20:30:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"There are so many great ways to enjoy #LA05. Whether you’re honoring our heroes at the Chennault Museum in Monroe, sampling Cajun cuisine in Avoyelles &amp; St. Landry Parishes or spending time outdoors at places like Bouge Chitto State Park, we have something for everybody!","date":"Wed Jun 23 19:30:23 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We can’t allow this administration to disregard nearly 40 years of bipartisan consensus by ignoring the Hyde Amendment and spending taxpayer dollars on abortions. Today, I went to the House floor to advocate for permanently solidifying this measure in law. #SaveHyde https://t.co/7y5bJxVusd","date":"Wed Jun 23 17:40:44 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Registration opens TOMORROW for the Congressional App Challenge! This competition is a great opportunity for some of #LA05’s best and brightest students to showcase their coding and technological skills. Click ⬇️ to learn more and pre-register. \n\nhttps://t.co/OnDTYju58r","date":"Wed Jun 23 16:48:32 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"For almost 40 years, both Republicans and Democrats have agreed that taxpayer dollars shouldn’t fund abortions. But this administration is choosing to ignore that precedent. Today, I joined with my @RepublicanStudy colleagues to stand up for our pro-life values.","date":"Tue Jun 22 22:00:29 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s great to have new investment coming to the @CItyofMonroe and #LA05! We’re excited to see the restoration of downtown’s historic Miller-Roy building get underway. https://t.co/UT5VlsUZvG","date":"Tue Jun 22 20:02:04 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It's simple - our struggling small businesses can't compete against the federal government's enhanced unemployment. That's why I've joined with my @HouseGOP colleagues to co-sponsor legislation to end these extra benefits and get more Americans back to work.","date":"Tue Jun 22 18:18:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @ACUConservative for hosting us at their annual congressional awards event. I look forward to continuing to be a champion for our conservative values in Congress! https://t.co/qXKoN4iS7z","date":"Mon Jun 21 22:00:20 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Investing in rural broadband is key to Louisiana’s future. We’re glad to see the state dedicate this new funding and will continue working in Congress to bring home more resources to connect our communities and #EndTheDigitalDivide. #La05\n\nhttps://t.co/xnQgaVqftz","date":"Mon Jun 21 20:30:05 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to Julia Claire Williams of Monroe on being crowned Miss Louisiana 2021! We know that you will continue to represent the best of Louisiana and #La05.\n\nhttps://t.co/Sc3SlMv1dX","date":"Mon Jun 21 19:00:35 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"People shouldn’t be denied health insurance coverage just because they have a pre-existing condition. That’s why I’m proud to co-sponsor the Pre-existing Conditions Protection Act, which ensures patients with pre-existing conditions have full access to health coverage.","date":"Mon Jun 21 17:43:47 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We’re without a special Dad this #FathersDay, but we continue to feel his love all the time. \n\nI’m so grateful to be blessed with the incredible men in our family. I hope it was a great day for your dad, father-in-law or the special father figure in your life. https://t.co/xsHLJHiKch","date":"Sun Jun 20 21:33:00 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With severe weather approaching Louisiana, now is the time to make those last minute storm preparations for your home, farm or business. Please continue to monitor the forecasts and follow updates from state and local officials. #lawx #La05","date":"Fri Jun 18 20:31:19 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s great to see @ULM_Official officially break ground on a new campus student center. Investments like these at our higher ed institutions are crucial to building Louisiana’s future. #La05 https://t.co/QyFwtQ0zsy","date":"Fri Jun 18 19:20:22 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to @LSUAlexandria and @EnglandAirpark as the launch of their new aviation program gets officially underway. This critical partnership will help bring jobs and opportunity to the CenLa region. #La05 https://t.co/nZA2zjsUIE","date":"Fri Jun 18 18:17:01 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s an exciting day @LSUAlexandria as they officially break ground on key campus infrastructure improvements. We’re proud to see this important state and federal investment in CenLa. #La05 https://t.co/MIIFxPZ2zz","date":"Fri Jun 18 17:17:57 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With the potential for heavy rain and possible flooding this weekend, please continue to monitor the forecasts and make plans to prepare your home or business. Visit https://t.co/YZ1fuNqXfR or https://t.co/Ad6Y5evgN9 for more resources and information. #La05 #lawx","date":"Fri Jun 18 00:05:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Great conversation today with @RepKatCammack and the women of the Pennsylvania General Assembly about serving in elected office. https://t.co/b0miam4plM","date":"Thu Jun 17 23:12:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to the Louisiana Baptist Message for sharing the story of our faith journey over these past few months. It has been the prayers and support of so many that have lifted us up.\n\nhttps://t.co/ZL1kUmZmcE","date":"Thu Jun 17 21:53:45 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The best days are when we have our two favorite little constituents come by the office! https://t.co/DPvxMKfpsb","date":"Wed Jun 16 23:01:21 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Enjoyed joining Tony St. James on @AllAgAllDay radio this afternoon to discuss our work on the @HouseAgGOP committee and how expanding rural broadband access can help #La05’s farmers, ranchers and loggers. https://t.co/CtErRHzj7o","date":"Wed Jun 16 22:13:49 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Katie Everett, Louisiana’s 2021 Cherry Blossom Princess, for stopping by our Capitol Hill office. We know you will continue to serve as a great ambassador for our state! https://t.co/np54mortoO","date":"Wed Jun 16 20:52:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"For decades, Republicans and Democrats have agreed that taxpayer dollars shouldn’t fund abortions. But unfortunately, this administration has ignored that precedent when drafting @HHSGov’s budget. During today’s @EdLaborGOP hearing, we asked @SecBecerra about this reversal. https://t.co/tyFsAtE1rx","date":"Wed Jun 16 17:34:24 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This ruling is a major victory for the Louisiana workers who have seen their livelihoods threatened by the administration’s misguided attacks on oil and gas. Make no mistake, we will continue working in Congress to protect American energy jobs. #La05\n\nhttps://t.co/yeZXd52h8d","date":"Tue Jun 15 22:37:13 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"With a potential storm in the Gulf of Mexico, make sure you and your family have a plan in the event of tropical weather. \n\n- Visit https://t.co/YZ1fuNqXfR for resources from @GOHSEP\n- Visit https://t.co/Ad6Y5evgN9 for preparedness information from @fema\n\n#La05 #lawx","date":"Tue Jun 15 20:52:57 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to East Carroll Parish’s Matt Dennis on being named Louisiana’s top young farmer! We’re proud to have so many outstanding farmers and ranchers in #La05.\n\nhttps://t.co/2YHfqvCiyb","date":"Tue Jun 15 18:31:18 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Businesses are struggling to hire new employees because the federal government keeps incentivizing them to stay home. That's why we're co-sponsoring the Get Americans Back to Work Act, which will end enhanced unemployment benefits and help get more people back on the job.","date":"Tue Jun 15 17:21:40 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was great hosting @HAFAinc leaders from Louisiana and around the country at our Washington, D.C. office today for a conversation about the future of health insurance. https://t.co/GvMFp2WziY","date":"Tue Jun 15 15:35:17 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our prayers are with the people of the Lake Providence area and our neighbors in South Arkansas as they recover from these devastating floods. @RepRickCrawford and I will be working together to ensure that our citizens have the resources they need to rebuild. #La05","date":"Mon Jun 14 22:03:07 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"244 years ago, the Continental Congress officially adopted the design of the American flag. Since that day, it has continuously stood as a proud symbol of freedom, liberty and opportunity both across our nation and around the world. Happy #FlagDay! https://t.co/8v2OlNKZig","date":"Mon Jun 14 18:41:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Louisiana is truly the Sportsman’s Paradise and all across our district, you’ll find incredible places to enjoy the outdoors. In honor of National Fishing and Boating Week, reply with your favorite fishing spot in #La05!","date":"Fri Jun 11 19:30:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It’s great to see entrepreneurs taking on new ventures all across #La05! This week, our team visited with the great folks at Borders Poultry Supply in Choudrant and @TacoBandido in Monroe. https://t.co/YUCYOpTqoZ","date":"Fri Jun 11 18:01:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Did you know that in addition to being healthy and delicious, milk is Louisiana’s official state drink?","date":"Fri Jun 11 17:01:48 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to @LaFarmBureau President Jim Harper for stopping by our Amite office opening this week! We look forward to continuing to work with him and Farm Bureau members across all of #La05’s 24 parishes to advance Louisiana agriculture. https://t.co/vsa9ia4eUh","date":"Fri Jun 11 15:48:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"ICYMI: Earlier this week, we officially opened our district offices in Monroe, Alexandria and Amite! Our staff is ready and fully equipped to serve constituents in all corners of #La05. Click ⬇️  to learn more about connecting with our team in Louisiana.\n\nhttps://t.co/YnoGryq7VR https://t.co/63xlgzboAF","date":"Thu Jun 10 20:00:40 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"In #La05, oil and gas provides both good jobs and investment in our communities. But misguided policies such as ending the Keystone Pipeline are killing domestic energy production. That’s why we're joining with @HouseGOP colleagues and fighting for these critical American jobs.","date":"Thu Jun 10 16:57:58 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to #La05's hardworking dairy farmers for all they do to keep both our state and our nation healthy and nourished. #NationalDairyMonth","date":"Thu Jun 10 14:04:05 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"If you ask Jeremiah and Jacqueline Letlow, they’ll tell you that the world’s best watermelon comes from #La05! https://t.co/GQcd8hwD4n","date":"Wed Jun 09 23:30:09 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Across our district, we've seen so many \"we're hiring\" signs and heard from business owners who can't find workers. But during today's @EdLaborGOP hearing, @SecMartyWalsh said the President’s economic plan is working. Unfortunately, that’s not the case in #La05. https://t.co/daUlQF4XW7","date":"Wed Jun 09 21:45:30 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Abuse of the @USDOL's H2-A and H2-B visas for migrant workers significantly hurts #La05's farmers and seasonal businesses. During today's @EdLaborGOP hearing with @SecMartyWalsh, we brought our ideas to the table and demanded more accountability on visa abuse. WATCH ⬇️ https://t.co/UXe47l3gJk","date":"Wed Jun 09 20:59:17 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our hardworking farmers are the backbone of #La05. Thanks to Anthony Liuzza and his family for hosting us on their produce farm in Tangipahoa Parish this afternoon and discussing some of the challenges they’re seeing in agriculture. https://t.co/YXESOvhHjv","date":"Wed Jun 09 00:07:41 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Thanks to Veneeth Iyengar from Louisiana Broadband Development &amp; Connectivity for stopping by our Amite office today. We look forward to working with him and all of our stakeholders to connect rural communities in #La05 and #EndTheDigitalDivide. https://t.co/sgTNvIwqSr","date":"Tue Jun 08 22:37:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our Amite office is now officially open! Thanks to all of the local elected officials and community leaders who joined us this morning to cut the ribbon. Our team is ready to get to work to move the Florida Parishes and all of #La05 forward. \n\nhttps://t.co/zld1sLBD0M","date":"Tue Jun 08 20:55:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I’m proud to officially open our district office in Alexandria today! My team here is ready and fully equipped to serve our constituents and the communities of #Cenla. #La05 https://t.co/xlqBClCttL","date":"Mon Jun 07 20:47:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Monroe District Office is officially open for business. Thank you to everyone who came out for the opening. I was truly overwhelmed by the large turnout this morning. #la05 #openforbusiness https://t.co/71BGrwYgNX","date":"Mon Jun 07 16:43:05 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"June is #NationalDairyMonth. The 5th Congressional District is #1 in Louisiana when it comes to milk production from cows. Join me this month in thanking our dairy farmers and recognizing the health benefits that dairy products provide millions of Americans! #la05 https://t.co/euGDEUMTBz","date":"Thu Jun 03 21:46:46 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The @DeltaRegional is hosting workshops for potential applicants to the @USDOL Workforce Opportunity for Rural Communities (WORC) Grant Program. Webinar is June 8, with in-person workshop June 11 at ULM.  Prior registration required at https://t.co/20IT15Wcic https://t.co/JaXQuV22LY","date":"Thu Jun 03 18:17:55 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to the City of West Monroe for being named Cleanest City in Louisiana in its category for the first time!  Keep up the great work. #la05 #westmonroe\n\nhttps://t.co/TTy99imvUs https://t.co/vLV13j0Mlh","date":"Wed Jun 02 22:16:11 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to the La. Tech Bulldogs on being named for the first time in program history a regional host sites. Ruston and Tech's resilience from the 2019 tornado will be a story the nation sees first hand this coming weekend. #latech #ruston https://t.co/7eHG2UJWa5","date":"Tue Jun 01 16:03:20 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We are a blessed country because of those who served our country and gave their lives in defending our freedom. Let us remember these heroes every day, along with the Gold Star families whose loved ones died in service to our nation. #MemorialDay2021 #GoldStarFamilies https://t.co/4w2oaGltRB","date":"Mon May 31 17:08:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This long weekend is a time for us to pause and remember the men and women of the Armed Forces who paid the ultimate sacrifice in the pursuit of our freedom and peace. I urge everyone in the coming days to show our respect for their service &amp; sacrifice for our freedom. #HRes450 https://t.co/S8etOkZJlq","date":"Sun May 30 21:48:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Great day spending the day in Alexandria visiting LSU-A and England Airpark to learn more about the Aviation Career and Education Initiative, a joint effort that will further develop the aviation industry workforce. https://t.co/KT2N2lxcCw","date":"Fri May 28 22:25:01 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"(2 0f 2) This commonsense legislation would add safeguards to prevent unemployment fraud before it occurs, provide incentives to states to recover fraudulently paid benefits, and offer relief for victims of unemployment fraud. #la05 #unemployment","date":"Fri May 28 21:17:28 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"During the pandemic, we have seen a rise of fraudulent and improper payments in federal unemployment programs. I am proud to co-sponsor the Combatting COVID Unemployment Fraud Act of 2021 which seeks to address this serious issue. (1 of 2) #la05 #unemployment https://t.co/QttuePkOof","date":"Fri May 28 21:17:27 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to the Class of 2021! I join your high school teachers, community, family members and friends in saying that we are proud of you. Set your future goals high and continue working hard to achieve them. #classof2021 #la05 https://t.co/6PSYtjvZvi","date":"Fri May 28 18:56:25 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Louisiana and 27 other states have established “right-to-work” laws, where employees do not have to join a union or pay dues as a condition of employment. I am a co-sponsor of the National Right to Work Act, which reaffirms these state laws &amp; repeals similar national provisions. https://t.co/YqEztxupGV","date":"Thu May 27 20:12:52 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"During a House Agriculture Subcommittee hearing, I discussed the importance of people returning to work as part of the overall recovery efforts and asked what Congress can do to encourage individuals to get back into the workforce. @HouseAgGOP https://t.co/bQWgf4pDD3","date":"Thu May 27 00:17:13 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The President continues to attack our oil &amp; gas industry, hurting hard-working Americans. That is why I am a co-sponsor of the Keystone XL Pipeline Construction and Jobs Preservation Act, which would reduce our dependence on overseas oil and bring back good-paying jobs. #keystone https://t.co/a8Y6330obN","date":"Wed May 26 22:13:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It was great to start the day by being back on KWCL-FM's 'The Mighty Mess' in Oak Grove with Ms. Irene Robinson to share with listeners how the first few weeks have been in Washington as the 5th District's Congresswoman. #KWCL #La05 https://t.co/CUJFXO42hs","date":"Wed May 26 16:51:07 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Broadband is a crucial resource for our rural communities in #La05. I'm proud to be co-sponsoring The Broadband for Rural America Act and working with my colleagues on @HouseAgGOP to #EndtheDigitalDivide","date":"Tue May 25 20:49:28 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The Save Local Business Act would clarify the definition of a “joint employer,” helping strengthen protections for workers while ensuring franchisees remain small business owners and ending confusing rules on the legal liabilities facing small businesses. (2 of 2) #SmallBusiness","date":"Tue May 25 18:29:10 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our local economy is driven by small, local businesses. It is the investment of the small business owner that creates jobs, putting people to work. As a member of the House Committee on Education and Labor, I am proud to co-sponsor H.R. 3185, the Save Local Business Act. (1 of 2) https://t.co/Anc9Pm8yQ9","date":"Tue May 25 18:29:10 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I am proud to be a co-sponsor of The Broadband for Rural America Act with my fellow House Republican Ag Committee members. This bill will serve as a blueprint to connect communities across the nation and play an important role in bridging the broadband gap. #EndtheDigitalDivide","date":"Fri May 21 17:04:50 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Our prayers are with the people and communities in South Louisiana impacted by the devastating flooding yesterday and this morning.","date":"Tue May 18 14:48:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Congratulations to the graduates of CLTCC on your well-deserved success! Good luck in your future endeavors. #goCLTCC2021 https://t.co/pG5mnI0fGf","date":"Sat May 15 19:06:00 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"May we remember all law enforcement officers who paid the ultimate sacrifice not just this week, but every day. #NationalPoliceWeek2021 (2 of 2)","date":"Fri May 14 23:02:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We conclude National Police Week by remembering Kietrell Michael Pitts, a correctional deputy with the Tangipahoa Sheriff’s Office. Pitts was a supervisor at the parish prison and passed away from COVID-19 on May 31. (1 of 2) https://t.co/LlPuaXIv7f","date":"Fri May 14 23:02:55 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I am proud to be a co-sponsor of HR 82, the Social Security Fairness Act. This is a bill that would repeal the unfair reduction or elimination of Social Security benefits for millions who have devoted much of their careers to public service and receive pension benefits. (1 of 2)","date":"Fri May 14 18:07:39 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I have heard from so many in the district, such as teachers, police officers and firefighters, who are impacted by this unfair reduction or elimination of Social Security benefits.\n(2 of 2)","date":"Fri May 14 18:07:39 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Randy Michael Vallot, a member of the Richland Parish Sheriff’s Office, is one of four officers from the 5th CD that we remember this week during National Police Week. Vallot was exposed to COVID-19 while at work and died due to the virus on September 23. #NationalPoliceWeek2021 https://t.co/cbY4dzQKRZ","date":"Fri May 14 15:04:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"This afternoon I spoke on the House Floor to remember the four law enforcement officers from Louisiana's 5th Congressional District who were lost in the line of duty in 2020. #NationalPoliceWeek2021 #la05\n\nhttps://t.co/yV0cMXWxcX","date":"Thu May 13 22:52:37 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The first officer we remember is Marshall Lee Waters Jr., with the Mangham Police Department, who was shot while making a traffic stop. We remember Officer Waters and his family and ask that God Bless his family and all law enforcement officers. #NationalPoliceWeek2021 #Mangham https://t.co/ONUSXvE83b","date":"Thu May 13 21:53:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"Yesterday I joined Congressman Michael Guest in introducing H Res 386 to recognize the 394 brave law enforcement officers lost in the line of duty and whose names have been permanently engraved on the National Law Enforcement Officers Memorial. #NationalPoliceWeek2021 https://t.co/eBDF7BtzZh","date":"Thu May 13 15:27:06 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I took time out of a busy day to spend some time enjoying the beautiful day and view of the Capitol dome with some of my DC team. https://t.co/LxE35CHMZV","date":"Thu May 13 00:24:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The United States must stand with our partner and ally #Israel and strongly condemn these Hamas terrorist acts.","date":"Tue May 11 00:54:22 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I joined Matt and guest host Dustin this week on Alexandria's KSYL where we discussed National Day of Prayer, the President's visit to Louisiana, and a letter I sent to the U.S. Ambassador to Iraq about Louisiana rice...plus more.\nhttps://t.co/KZbqypw6sf","date":"Fri May 07 22:37:43 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I appreciate Mr. Bush telling his family's personal story about the sacrifices made in the last year and the impact it has had on his son.  How has COVID-19 impacted your child's learning? #COVID19 #schoolsreopening","date":"Thu May 06 22:28:19 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"As the President of the United States visits Louisiana today, I hope he has the opportunity to hear the real needs of our great people -- from disaster assistance for Hurricane Laura to the important impact the oil and gas industry has on Louisiana's jobs and livelihoods.","date":"Thu May 06 18:05:31 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"What a great day of meetings in Baton Rouge and at the State Capitol to speak about the importance of rural broadband in our state, not only for our farmers but also to help provide access to healthcare and educational opportunities. https://t.co/irV2OAaQHO","date":"Tue May 04 22:28:53 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"At a different Capitol building today to meet with state and local officials on federal issues impacting the 5th Congressional District. https://t.co/qVSSUdvYN6","date":"Tue May 04 18:26:27 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"OTD: April 30,1803 - The Louisiana Purchase Treaty was signed with France doubling the size of the United States for $15 million, or just 4 cents an acre. Explore maps of Louisiana at the Library of Congress.  https://t.co/0U2FJt5b2y #LouisianaPurchase #libraryofcongress https://t.co/UtWOf2dpvt","date":"Fri Apr 30 16:07:38 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"I have serious concerns about piling on additional spending and raising taxes on individuals and businesses when many of the already appropriated funds have yet to be allocated and sent out by the Federal government. Federal government spending cannot be the answer to everything.","date":"Thu Apr 29 02:49:26 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"We need to spend more investing in real solutions, like expanding broadband access to rural areas, and efforts to bring our country together.","date":"Thu Apr 29 02:48:56 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"The President unveiled a plan tonight that tries to spend our way to prosperity by proposing $6 trillion in spending in just 100 days. That’s $60 billion a day.","date":"Thu Apr 29 02:48:11 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is a great day for Columbia, Caldwell Parish, the 5th Congressional District and the State of Louisiana with the announcement of a renewable diesel refinery that will utilize federal funds by the state to get the project underway, potentially creating 76 new permanent jobs.","date":"Fri Apr 23 21:00:55 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is such a privilege to serve the people of Louisiana's 5th Congressional District.  My first two weeks have been busy and a lot has been accomplished but there is still much work to be done. #LA05\nhttps://t.co/40rSKmqlDP","date":"Thu Apr 22 23:41:33 +0000 2021","user_id":"1382395679700439041"},{"handle":"RepJuliaLetlow","text":"It is fitting my first hearing on the Agriculture Committee was on rural broadband, an issue so important to the Fifth District and Louisiana.  Having reliable and affordable internet is crucial for our farmers, businesses and schools, especially in rural America. #broadband https://t.co/GxijVn3nQQ","date":"Tue Apr 20 22:12:53 +0000 2021","user_id":"1382395679700439041"}]