[{"handle":"RepJimCooper","text":"Tune in to the third @January6thCmte hearing now:","date":"Thu Jun 16 17:25:24 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today marks 10 years since President @BarackObama announced the DACA program, benefiting Dreamers &amp; the millions of us that work with, study with, and know them personally. I'm always proud to support Dreamers &amp; the Senate should take up legislation to protect them permanently. https://t.co/hxX5q0AGUC","date":"Wed Jun 15 19:40:26 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations to my friend and former #TeamCooper Counsel, @AVCDegrafinreid! \n\n@LeadershipTN is lucky to have you!","date":"Tue Jun 14 18:36:29 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tune in to the @January6thCmte’s second public hearing.","date":"Mon Jun 13 14:48:14 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’ve been notified by the National Nuclear Security Administration that a noose was found at the Y-12 facility in Oak Ridge.","date":"Fri Jun 10 18:58:50 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The FBI is investigating this despicable incident, and I expect the report to be made public and anyone responsible will be prosecuted for any laws that were broken. This hatred cannot be tolerated anywhere, especially in Tennessee.","date":"Fri Jun 10 18:58:50 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"https://t.co/fATrlhlELQ","date":"Fri Jun 10 02:16:04 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Live now: the January 6th Committee holds its first public hearing. https://t.co/VcGc0E5thB","date":"Fri Jun 10 00:37:35 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nothing is more important than protecting kids &amp; families from gun violence.\n\nProud to join @HouseDemocrats in voting for commonsense gun safety laws and a nationwide red flag law.\n\nWe cannot sit by &amp; allow more mass shootings to take innocent lives and devastate our communities. https://t.co/ygSakQ30Av","date":"Thu Jun 09 18:54:11 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"I stand with my colleagues in condemning the “great replacement” theory. House Democrats are committed to combatting white supremacy and hatred in all forms.","date":"Wed Jun 08 17:59:31 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"This subcommittee is proof that Congress can work together in a bipartisan way to put the safety and security of the nation above politics. \n\nWe work together to build a stronger America, as we and our predecessors have done for 61 years.","date":"Wed Jun 08 17:50:11 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, we #WearOrange and recognize the victims of gun violence in Tennessee. \n\nIn 2022 alone, there have already been at least 240 shootings in our state. Every day we do not take action, more Tennesseans’ lives are at risk. https://t.co/mlrVc8PXzQ","date":"Fri Jun 03 16:00:46 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The facts in Tennessee:\n\n- Gun homicides ⬆️ 103% from 2011 to 2020\n- Gun deaths are the #1 cause of death among children &amp; teens\n- Nearly 1300 lives are lost due to gun violence each year\n\nRepublicans need to wake up and join us in supporting commonsense gun safety legislation.","date":"Fri Jun 03 16:00:46 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Happy #Pride Month! \n\nTo my LGBTQ friends and neighbors in Tennessee, we join you in celebrating living authentically and continuing the fight for full equality and dignity. 🏳️‍🌈","date":"Wed Jun 01 18:46:12 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Memorial Day is a time to honor those who gave the ultimate sacrifice for our country.\n\n@operationsong is a program empowering veterans through songwriting. Today, take a listen to “The Last Monday in May.” https://t.co/ju8SbAmppv","date":"Mon May 30 14:23:20 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"No community is safe from gun violence until something changes. Our hearts are with our fellow Tennesseans in Chattanooga. \n\nThe House has already passed a number of gun safety measures, and we’re prepared to do more. It’s time to get a bill to the President’s desk.","date":"Sun May 29 18:16:18 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is just gut-wrenching. Another school targeted in a mass shooting. More innocent children lost. More grieving families who will never hug their children again. \n\nWhat will it take for Republicans to support ANY measure to stop the senseless gun violence in America?","date":"Tue May 24 21:27:56 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Father Breen was one of the finest men and finest priests I’ve ever known. I was proud to have him as my guest for the visit of Pope Francis to Congress.\n\nHe will be sorely missed.","date":"Sun May 22 14:02:32 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Let's all commit to doing more to combat discrimination toward LGBTQ people on this International Day Against Homophobia, Transphobia, and Biphobia. #IDAHOBIT","date":"Tue May 17 20:14:54 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Hate has no place anywhere, especially here in Tennessee. As right-wing politicians and judges are threatening hard-won rights and liberties, we must unite to stand against hate of all forms.","date":"Tue May 17 20:14:53 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Households are now eligible for another round of free at-home #COVID19 tests. \n\nEach order now includes 8 sent to you at no cost via USPS. \n\nOrder here: https://t.co/ycQbT0cqQr","date":"Tue May 17 15:12:44 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"If you’re struggling to find formula, HHS is here to help. https://t.co/1s73UxAewa","date":"Fri May 13 21:32:25 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"We’re all concerned about the baby formula shortage. \n\nThe Biden Administration is working with retailers and cutting red tape to get more formula on the shelves. \n\nAnd next week, the House will vote on legislation providing emergency authorization to address the crisis.","date":"Fri May 13 21:32:25 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Team Not Running for Re-Election went out with a bang. \n\nSecond fastest time in the House! https://t.co/pp1ZZOwx1p","date":"Thu May 12 20:49:55 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"We were surprised by a special visit from @SenBooker, @ChrisisSingin, and friends from @freestylelove in DC! https://t.co/v4gtl7tvnd","date":"Thu May 12 18:47:28 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was awesome to see students from @HardingAcademy and @USN_PDS in Washington today! https://t.co/mcIMqjMGTT","date":"Thu May 12 18:46:47 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper is looking forward to the ACLI #CapChallenge tomorrow!\n\nI enjoyed chatting with @ReporterCioffi about one of my favorite traditions. https://t.co/RIQyWTpdJ8","date":"Wed May 11 21:43:13 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thanks to the Bipartisan Infrastructure Law, nearly 50 million Americans will gain access to the internet.\n\nFind out if you are eligible and apply here: https://t.co/EYlJb7CEJS","date":"Tue May 10 20:02:39 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m live with @MitchellStudies for a discussion on the future of the Space Force, deterrence in space, and how we should think about our future in orbit and beyond.\n\nJoin here: https://t.co/bGqGCXMrCH","date":"Tue May 10 14:23:52 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"If this opinion becomes final, America will see an unprecedented rollback of a constitutional right.\n\nWe cannot let the war against reproductive health prevail.","date":"Tue May 03 02:31:48 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"My office is getting a lot of questions about how to access the free lifesaving treatments for COVID-19. \n\nThere are now dozens of “Test to Treat” locations and pharmacies in Middle TN. To find a location near you, visit https://t.co/uOIALubsBP.","date":"Tue Apr 26 20:01:22 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Take a look at the history of #EarthDay through the @librarycongress here⬇️","date":"Fri Apr 22 13:18:24 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"TODAY⬇️","date":"Wed Apr 13 14:30:39 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"This historic day is long overdue! Judge Jackson will make a fantastic Supreme Court Justice.","date":"Thu Apr 07 18:28:39 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"TUNE IN⬇️","date":"Wed Apr 06 17:36:33 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Because of @POTUS' Executive Order to strengthen the #AffordableCareAct, nearly one million Americans will see lower premiums for their health insurance &amp; hundreds of thousands of uninsured Americans will gain affordable coverage. I was proud to vote for the #ACA. #ProtectOurCare","date":"Tue Apr 05 17:23:46 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Take time today to read this piece on the harm that anti-trans legislation inflicts on the LGBTQ community, especially our youth. \n\nWe should be working to foster communities where every child can thrive. #TDOV https://t.co/GxEBzM6A5i","date":"Thu Mar 31 15:08:37 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"On Transgender Day of Visibility, we should all lift up the trans community, especially in Tennessee where lawmakers have proposed a dozen anti-trans bills this year. \n\nWe must fight back against this discrimination and honor the trans community for their courage and resilience.","date":"Thu Mar 31 15:08:36 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: @RepDLamborn and I correct a false impression about new nuclear fuzes in @DefenseOne.","date":"Wed Mar 30 13:30:28 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"When it comes to our nuclear arsenal, we need to get the facts right.\n\n@DougLambornCD5 and I correct a false impression about new nuclear fuzes in @DefenseOne.\n\nRead more:\nhttps://t.co/l64q2MQD1I","date":"Wed Mar 30 00:11:35 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #BidenBudget reflects three important values: \n\n✅Fiscal responsibility\n✅Safety and security at home and abroad\n✅A commitment to building a better America","date":"Mon Mar 28 17:25:58 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Madeleine Albright was one of America’s greatest diplomats, and her legacy is as important as ever as we confront new challenges abroad.","date":"Wed Mar 23 23:17:23 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"We all owe a great deal of gratitude to Madeleine Albright’s life of service. Whether she was strengthening our alliances, confronting evil regimes, championing human rights, or fighting for women’s equality abroad, she never forgot from where she came.","date":"Wed Mar 23 23:17:23 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today marks 12 years since the Affordable Care Act was signed into law. This was one of the most important votes I have ever taken. I was proud to support this bill and expand health coverage to millions more Americans. #ACAHereToStay","date":"Wed Mar 23 21:21:22 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you for visiting #TeamCooper Biscuit! Happy to cosponsor H.R. 5232, The Working Dog Commemorative Coin Act, and support providing service dogs to veterans in need. @CapsPup @AmericasVetDogs https://t.co/GzjFuecHAM","date":"Tue Mar 22 18:42:50 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Instead of doing everything they can to help, our state legislature consistently chooses politics over people. States that expand Medicaid have fewer rural hospital closures and fewer deaths.","date":"Tue Mar 22 14:14:03 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"For more than a decade, states like Tennessee have been turning down billions of dollars from the federal government to expand Medicaid and save rural hospitals.\nhttps://t.co/zSWqODUF44","date":"Tue Mar 22 14:14:03 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"From this morning, while I listened to President Zelenskyy, a great leader, a modern Churchill, speak to a joint session of Congress. https://t.co/pPgJWyezZD","date":"Wed Mar 16 13:57:13 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"#COVID19 has made it clearer than ever that minimum-wage workers – ⅔ of them women – are always essential.\n\nWe have to recognize the value &amp; dignity in all work by raising the minimum wage &amp; passing #paidleaveforall (a boost for #equalpay)! #EqualPayDay","date":"Tue Mar 15 18:25:42 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Rep. Jim Cooper secures $4.8M in funding for Nashville projects https://t.co/9wyI1tI5EW","date":"Mon Mar 14 20:37:54 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"I'm delighted to announce I got married on Saturday. \n\nI feel like the luckiest man in the world, having been so happily married, and now having found the perfect partner for this stage of my life. https://t.co/oj7aKrkNZj","date":"Mon Mar 14 15:01:46 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Banning imports of Russian oil is a painful step for Americans but necessary to hurt Vladimir Putin’s attack on Ukraine.\n\nWe should be able to lower gas prices at the pump to make up for loss of Russian oil on the world market and still cripple Putin’s evil regime.","date":"Thu Mar 10 16:28:00 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tonight, the House passed the omnibus spending package, which includes funding for local projects. I'm happy funding for these projects was finally approved as they are vital to making Nashville more inclusive and grow our community more equitably.\n\nhttps://t.co/f7YXoMYS0f","date":"Thu Mar 10 03:49:50 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"This Texas-style abortion ban bill backed by Republicans in the TN General Assembly allowing people to collect bounties by turning in people who help women access abortion will threaten the lives and health of countless people across the state. \n\nhttps://t.co/7hI5OK9LSi","date":"Wed Mar 09 19:26:33 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville is home to some of the best HBCUs in the country, and they’ve always been agents of equity, access, and excellence in education.\n\nThat’s why I’m proud to support today’s resolution condemning the despicable, cowardly bomb threats to HBCUs. #HBCUStrong","date":"Tue Mar 08 19:24:24 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"This #InternationalWomensDay, take a look at a list of children’s books about women who continue to break barriers for the next generation: \n\nhttps://t.co/YRqGII5LVO","date":"Tue Mar 08 17:12:38 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you @HumeFoggKnights for dropping off letters in support of the Childhood Nutrition Reauthorization Act! https://t.co/qmtu2bW3mk","date":"Tue Mar 08 16:19:05 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Good news 🇺🇸🇺🇦","date":"Thu Mar 03 22:58:31 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Americans across the country share common needs and concerns. \n\nIn tonight’s #SOTU Address, President Biden showcased America's strengths — our people. \n\nHe laid out a bold vision to cut family costs, keep our democracy strong, and build a better America.","date":"Wed Mar 02 03:28:51 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"America and our allies must have the capability to defend the free world now. That means not just keeping up with commercial industry, but getting the Pentagon to be years ahead of industry. We must have the capability to meet and beat any competitor.","date":"Tue Mar 01 19:45:49 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The war in Ukraine is a tragic reminder of the importance of our work. Putin’s recent announcement that he was placing his nuclear forces on alert made clear to the world the risk of miscalculation.","date":"Tue Mar 01 19:41:50 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tune in for this timely hearing with top Pentagon officials as we discuss nuclear deterrence, missile defense, and the space domain.⬇️","date":"Tue Mar 01 18:39:36 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #IPCC report confirms what we already knew: further ignoring the threat will only cause greater destruction to our environment and loss of life. \n\nWe’ve lost decades on this issue, but we know what needs to be done to slow the impacts of climate change. The clock is ticking.","date":"Mon Feb 28 18:32:44 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville is better because of Marilyn's work and leadership.\n\nShe was a pillar of the community and will be greatly missed.","date":"Mon Feb 28 16:48:14 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"One year ago today, the House passed the #EqualityAct. \n\nAs states like Texas and Florida are ramping up their attacks on LGBTQ+ Americans, the Senate needs to pass the bill, sending the message that the LGBTQ+ community is safe and respected. https://t.co/aX3P5sQdtJ","date":"Fri Feb 25 20:17:58 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The historic appointment of Judge Ketanji Brown Jackson to the Supreme Court will ensure the highest court in the land will better reflect our diverse nation.\n\nThis Senate confirmed her to the D.C. Circuit on a bipartisan basis, and I look forward to her swift confirmation again.","date":"Fri Feb 25 15:13:45 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"NATO and our allies must sanction Putin until he bleeds. President Biden has done a good job of rallying the free world against Putin. Dictators never succeed for long. We must do all we can to hasten Putin’s fall.","date":"Thu Feb 24 16:49:02 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Dictators like Putin have a short-term advantage, particularly in their own back yard. But his naked aggression will not be rewarded because the rest of the world sees Putin as he is – the new Stalin.","date":"Thu Feb 24 16:49:01 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"On the front page of today’s @nytimes. \nhttps://t.co/K6S121zzG0 https://t.co/5DtOin116S","date":"Sat Feb 19 15:26:08 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Any time is a great time to visit your public library, but @NowatNPL is even greater this month.\n\nI encourage everyone to check out the displays and read the curated selections from @NowatNPL honoring #BlackHistoryMonth. https://t.co/jEw9okinOa","date":"Fri Feb 18 18:29:16 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"We’ve created 8,500 new manufacturing jobs in Tennessee in the last year. \n\nPresident Biden and Democrats are totally focused on helping every American find a good-paying job. Our plans to rebuild our economy are working.","date":"Tue Feb 15 19:58:24 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Interested in a summer internship?\n\nApply today: https://t.co/bO0PyiaD8j https://t.co/2NJ9Q9sMZ3","date":"Fri Feb 11 19:41:43 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thanks to the Bipartisan Infrastructure Law, a new manufacturing facility is coming to Tennessee, creating 500 good-paying jobs. It was great to be with @POTUS at the White House for this announcement. https://t.co/bMzBubs3Pw","date":"Wed Feb 09 16:31:39 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Looking forward to joining @POTUS at the @WhiteHouse today for this announcement for Tennessee!","date":"Tue Feb 08 16:42:17 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you, @MargaretRenkl, for highlighting the terrible injustice that the @TNGOP is inflicting on Nashville. https://t.co/JK8GaXzU2T","date":"Mon Jan 31 15:40:25 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Republicans are basically cheating. They haven’t been able to elect someone in Nashville for more than 100 years and are colonizing Nashville. \n\nThank you for having me on @DeadlineWH this afternoon, @NicolleDWallace. @MSNBC \n\nWatch here: https://t.co/K2QimfOBrX","date":"Fri Jan 28 01:29:48 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Last night I spoke with @DonLemon on @CNN about the @TNGOP's shady redistricting process.\n\nWatch here: https://t.co/TrP2t3Jg8l","date":"Thu Jan 27 23:10:41 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yesterday I spoke with @HallieJackson on @MSNBC about the blatant dismembering of Nashville through redistricting.\n\nWatch here: https://t.co/FzjmrLOi8V","date":"Thu Jan 27 22:55:29 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"It is important to teach, reflect, and learn from tragic events like the Holocaust to ensure they are never repeated. #HolocaustRemembranceDay","date":"Thu Jan 27 18:47:59 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"In this country and all over the world, we are witnessing a drastic surge in anti-Jewish hate with acts of harassment, vandalism and violence, as well as a torrent of online abuse.","date":"Thu Jan 27 18:47:58 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thanks for having me on yesterday, @HallieOnMSNBC!  \n\nAnd thank you for highlighting the atrocious dismemberment of Nashville by the @TNGOP.","date":"Thu Jan 27 15:58:02 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"It should not go unnoticed that President Biden’s nominee will be treated with far more respect and grace than President Obama’s last nominee who was never even granted a hearing by a Republican Senate.","date":"Wed Jan 26 20:15:31 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Justice Breyer always upheld the law and ruled with great dignity and will be missed. I hope President Biden swiftly nominates a replacement.","date":"Wed Jan 26 20:15:31 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was great to be with the @HumeFoggKnights today!","date":"Wed Jan 26 18:56:31 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today I am announcing that I will not run for re-election to Congress. After 32 years in office, I will be leaving Congress next year.\n\nI cannot thank the people of Nashville enough. You backed me more than almost anyone in Tennessee history. https://t.co/C6LE31uFQC","date":"Tue Jan 25 19:29:20 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The decision in Roe v Wade was one of the most significant advances in healthcare for women.\n\nUnfortunately, the freedom to choose is in more danger now than any time since 1973. We must continue doing everything we can to protect this basic right. https://t.co/Z8NXzUWkVz","date":"Sat Jan 22 18:44:56 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Middle Tennesseans know that some of our lakes &amp; dams need serious improvements. Tennessee has already received historic funding and thanks to our infrastructure &amp; disaster relief laws, even more is on the way to help us upgrade Tennessee’s water projects.\nhttps://t.co/c3lZfufjr0","date":"Fri Jan 21 15:19:39 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Every single Tennessean—no matter which city or county they live in—needs broadband and I’m glad the American Rescue Plan is providing funding to help Middle Tennessee families succeed.\nhttps://t.co/XtathcImYY","date":"Thu Jan 20 20:37:44 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"It’s hard to do your homework or get a job if you don’t have internet, and the ongoing pandemic has only highlighted how many Tennesseans still don’t have broadband access.","date":"Thu Jan 20 20:37:43 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Republicans in the Senate are again blocking voting rights and redistricting reforms while state legislators dismantle the limited protections voters still have. \n\nDespicable.","date":"Thu Jan 20 17:36:26 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"$400 million in American Rescue Plan funds to support those with disabilities  https://t.co/9PjLdctpyp via @TNLookout","date":"Thu Jan 20 15:44:00 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"“If you see someone without a smile today, give ‘em yours.”\n\nHappy Birthday to the timeless @DollyParton! This is one of my favorite framed photos from when we first met. https://t.co/JLcIkAUMiL","date":"Wed Jan 19 15:43:24 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨ATTN🚨: You can now order free at-home #COVID19 tests by visiting: https://t.co/UKuDlk2k2Q","date":"Tue Jan 18 18:10:12 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"December tornado survivors from Cheatham, Davidson, and Dickson counties can now apply for FEMA assistance online at https://t.co/jTgqFUQHlN or by calling the Helpline at 800-621-3362 (TTY 800-462-7585).\n\nPhone lines are open daily from 7am-10pm local time, 7 days a week. https://t.co/lfIaiiQxJy","date":"Tue Jan 18 15:04:04 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"His liberal vision for a better America was decades ahead of his time, and his wise counsel could always be trusted on the most controversial issues of our day. From the Kennedy Administration to today, Gil gave us a better world.","date":"Mon Jan 17 17:10:50 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Gil was a gentle giant of the law and pillar of our community. One of the youngest U.S. attorneys in America, he then served with distinction on the second highest court in the land.","date":"Mon Jan 17 17:10:50 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"On #MLKDay, we remember the lessons of Dr. Martin Luther King, Jr:\n\n“The time is always right to do what is right.”\n \n“Accept finite disappointment, but never lose infinite hope.” \n \n“The arc of the moral universe is long, but it bends toward justice.”\n\nToday, pay tribute to #MLK","date":"Mon Jan 17 14:51:51 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Read @KeelHunt’s latest:\n\n“Carving up #TN05, shunting many of its brown &amp; black voting precincts off into largely rural, Republican districts, has much larger implications. There is much more at stake here than one political party trying one-up the other.” https://t.co/1g9n4soTgB","date":"Sat Jan 15 21:09:08 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"More than ONE MILLION children in Tennessee received the monthly #ChildTaxCredit.\n\nWhile families overwhelmingly used these payments to meet their basic needs, today, many of them realized that this check is no longer coming.\n\nWe need the Senate to pass the #BuildBackBetter Act. https://t.co/7YkdE0QYmI","date":"Fri Jan 14 20:31:13 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"For the first time in a decade, we got an infrastructure bill done—and with historic levels of investment. This will help us finally get to the needed repairs and make commuting better for all Tennesseans. https://t.co/aVM73uyqoZ","date":"Fri Jan 14 15:39:29 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Any Tennessean who drives knows our bridges are in really bad shape and have been for years. We simply haven’t had the funding to repair them.","date":"Fri Jan 14 15:39:28 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"A record 14M+ people have selected plans for 2022 ACA health coverage since November 1, 2021!\n\nThe Biden administration extended the Open Enrollment Period through Jan. 15, so if you still need of 2022 health insurance, you have 1 MORE DAY to enroll: https://t.co/JJLHCTOhXq","date":"Fri Jan 14 14:48:58 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville owes more of its success to Barbara and the remarkable Haynes family than anyone knows. No public figure in recent Nashville history will be more missed.","date":"Thu Jan 13 22:55:49 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Barbara Haynes was truly brilliant. Her phenomenal memory, razor wit, iron-clad legal reasoning, and endless curiosity were only eclipsed by her passion for Democratic politics.","date":"Thu Jan 13 22:55:48 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee Republicans need to wake up and realize they’re on the wrong side of this fight and on the wrong side of history.","date":"Thu Jan 13 18:23:06 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"If this bill passes the Senate and makes it to President Biden’s desk and is signed into law —and I hope and pray it does — the courts will overturn the partisan, discriminatory gerrymanders that our state legislature is pushing.","date":"Thu Jan 13 18:23:06 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, the House passed Freedom to Vote: John R. Lewis Act while Tennessee Republicans are rushing through redistricting maps that divide communities across the state. \n\nIt’s a split screen of Congress trying to strengthen our democracy while the state seeks to erode it.","date":"Thu Jan 13 18:23:05 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"We ain’t broke here in Nashville, so the legislature has no business “fixing” us. Some folks on the committee are people I’ve known all my life and what they are doing is wrong.","date":"Wed Jan 12 20:34:42 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"There is still time for the General Assembly to come to its senses and stop crippling Nashville. But the Senate Committee will have to refuse to rubber stamp this gerrymander when it meets tomorrow.","date":"Wed Jan 12 20:34:42 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"All Nashvillians should feel insulted and abused by the new map. For 100 years, Nashvillians have freely chosen Democratic representatives in Congress, but that tradition is about to end. What Republicans could not win in local elections, they are stealing through gerrymandering.","date":"Wed Jan 12 20:34:41 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"It is not conservative to break up a city that has remained politically whole for 230 years. In fact, it is gross legislative overreach to interfere with one of the most admired cities in America.","date":"Wed Jan 12 20:34:41 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The map was released for the first time today and the more people learn about it, the more they will hate it. The Tennessee Titans stadium will be in one district, and the team’s practice facility in another – this makes no sense.","date":"Wed Jan 12 20:34:40 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Under the new map announced today, Nashvillians will be reduced from proud citizens of a capital city to captives inside three colonies run from Clarksville, Cookeville, and Columbia.","date":"Wed Jan 12 20:34:40 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The damage this map does to the political influence of minority groups in Nashville is devastating. Our robust, diverse communities in Nashville are represented and affirmed in Washington, DC today when Nashville has its own voice in Congress.","date":"Wed Jan 12 20:34:40 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"As I’ve been warning for almost a year, the General Assembly has formally begun gerrymandering Nashville and Davidson County into political oblivion.","date":"Wed Jan 12 20:34:40 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨ATTN: Some Tennesseans may be eligible for mortgage assistance under the American Rescue Plan.\n\nIf you are behind on your mortgage payment, find out of if you qualify here: https://t.co/hqMlvNbl1W","date":"Mon Jan 10 16:36:36 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Let’s go, #Titans ! #TitanUp #TENvsHOU","date":"Sun Jan 09 18:09:58 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"This morning I tested positive for COVID-19.\n\nThankfully I only have mild symptoms because I have been vaccinated and received my booster.\n\nEveryone should be vaccinated and boosted as soon as they’re able. It’s the best way to protect yourself and your loved ones.","date":"Sat Jan 08 16:00:10 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"While every Republican member of Tennessee’s congressional delegation voted against this relief, I was proud to support Tennessee families. https://t.co/r4zp49ZdLz","date":"Fri Jan 07 17:18:34 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"I have supported LIHEAP funding for many years, and this historic investment will help Tennessee families lower home heating costs, cover utility payments &amp; pay for energy repairs.","date":"Fri Jan 07 17:18:34 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, along with the @WhiteHouse, we announced that Tennessee is receiving $130.4 million – close to double the annual amount – through the Low Income Home Energy Assistance Program (LIHEAP). https://t.co/x1zv7rSjlg","date":"Fri Jan 07 17:18:33 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"My grandson Jay had a fun #NashvilleSnow day. \n\nI hope everyone is staying safe, warm, and healthy! https://t.co/aUABkJTJl7","date":"Thu Jan 06 23:14:17 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"Threats to our elections cannot be tolerated, or repeated.\n\nMy statement marking the one year since the January 6 insurrection⬇️ https://t.co/R4jbVxGoDT","date":"Thu Jan 06 16:37:33 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"The State Legislature should stay true to its claims of conducting a truly transparent and bipartisan process.","date":"Wed Jan 05 20:11:52 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: If your business was impacted by the severe weather in March-April 2021, your last day to apply for an Economic Injury Disaster Loan (EIDL) is coming up on February 8.\n\nMore info here: https://t.co/ROcOZSjopg","date":"Wed Jan 05 19:34:49 +0000 2022","user_id":"22523087"},{"handle":"RepJimCooper","text":"If you still need coverage for 2022, it’s not too late! \n\nAnnual enrollment is open through January 15: https://t.co/JJLHCTOhXq","date":"Thu Dec 23 16:52:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nearly 260,000 Tennesseans have enrolled in Obamacare plans - that's almost 50k more people than last year and there are still 3 weeks left to enroll!\n\nhttps://t.co/9jypDIE3Hn","date":"Thu Dec 23 16:52:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"In the meantime, if you or someone you know is in a mental health crisis or experiencing emotional distress, call 1-800-273-TALK (8255).","date":"Tue Dec 21 19:34:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The 3-digit National Suicide Prevention Lifeline is almost here! I was proud to vote for the #AmericanRescuePlan &amp; funding for @samhsagov to help improve operations and prepare states for the new 9-8-8 hotline.","date":"Tue Dec 21 19:34:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Always good seeing my friend Pat Nolan at @NC5 to catch up on #insidepolitics. https://t.co/EJacvwGIr1","date":"Fri Dec 17 16:15:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I was happy to vote for this monumental bill as a step toward strengthening our state’s essential infrastructure and economy. These improvements will cut down commute times, help small businesses and keep travelers safer on our roads.","date":"Thu Dec 16 21:03:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee is getting more than $1B in new funding to repair our roads and bridges. We’re creating good-paying jobs for Tennesseans to rebuild our roads and bridges in communities across the state, thanks to the Bipartisan Infrastructure Law.\n\nhttps://t.co/AZLCVb6sBZ","date":"Thu Dec 16 21:03:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"TODAY is the last day to get 2022 coverage starting January 1!\n\nShop here: https://t.co/rZC7PyLEMC","date":"Wed Dec 15 21:16:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Our state saw another unprecedented weather event this past weekend.\n\nI urge President Biden to approve Gov. Lee's request for Emergency Declaration so we can continue recovery efforts here in Tennessee.\n\nhttps://t.co/HFxmT0i74y","date":"Mon Dec 13 22:27:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It is sad that nearly every Republican – including the entire TN Republican delegation – voted against the bill and thinks there should be unlimited presidential power in America with no guardrails, no transparency, and no accountability to anyone.","date":"Fri Dec 10 20:03:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I proudly voted for the Protecting Our Democracy Act, which includes new protections for inspectors general that I've been pushing for years. The previous Administration proved we have a lot of work to do to protect our government from abuse &amp; corruption.\nhttps://t.co/KxMzIbtz4E","date":"Fri Dec 10 20:03:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Good decision, now we need the Smithsonian to do the same.\n\nThe Sacklers should release the National Museum of Asian Art from their naming agreement, and the House should pass my GIFTS Act so that the government is never put in this position again. https://t.co/1pd88RY32v","date":"Thu Dec 09 21:27:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Marketplace Open Enrollment is open NOW until Jan 15 and 3M+ Americans have enrolled for 2022 coverage!\n\nEnroll by Dec. 15 &amp; get full-year coverage that starts Jan. 1. Premium subsidies &amp; lower cost plans are available thanks to the #AmericanRescuePlan: https://t.co/JJLHCTOhXq","date":"Tue Dec 07 17:16:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"TODAY is the last day of #Medicare open enrollment!\n\nIf you still haven't selected a plan for 2022 coverage, you have until midnight tonight (Dec 7).\n\nCall 1-800-MEDICARE (1-800-633-4227) or search and compare your coverage options at https://t.co/IT5BlJAEw0","date":"Tue Dec 07 16:29:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Bipartisan Infrastructure Bill makes the largest investment in our water infrastructure in American history. \n\nThis will help us expand safe, clean drinking water access to every Tennessean. \nhttps://t.co/j6fBfZFxMC","date":"Mon Dec 06 19:55:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Read David’s column on the importance and history of redistricting. Then, share your views on the process with your state lawmakers. \n\nHere are my remarks that I submitted to the TN House Redistricting Committee earlier this year. https://t.co/d3kxf77Lg0","date":"Fri Dec 03 20:52:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Dr. @JamesEKHildreth helped lead our city and advised the country during one of our greatest challenges. I always appreciate his counsel. \nWell-deserved! https://t.co/Zco2HgOt60","date":"Fri Dec 03 20:06:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Every member of the Tennessee delegation supports this effort to honor one of our state’s most beloved and groundbreaking public servants, and I look forward to his bill quickly coming to the House floor for a vote.\n\nhttps://t.co/3J4r8ReX7o","date":"Fri Dec 03 16:19:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m thrilled the @OversightDems Committee unanimously passed my bill to rename the post office located on Rosa Parks Blvd after my friend and mentor, Senator Thelma Harper.","date":"Fri Dec 03 16:19:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today is the last day to apply for a Spring 2022 internship in our Nashville and D.C. offices!\n\nApply today: https://t.co/bO0PyiaD8j https://t.co/CVPWJrxCnW","date":"Fri Dec 03 15:48:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I was proud to join my colleagues in support of fixing this gap in our immigration system.\n\nThis is what DACA is for – to keep kids and families from having to make unbearable choices.\n\nNo child who grew up in the United States should suddenly be faced with deportation.","date":"Thu Dec 02 19:10:20 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"At a time when our nation is recovering from the effects of the pandemic &amp; experiencing deep divides, engagement w/ the arts &amp; our history can play a role in helping us heal. I joined my colleagues in asking @POTUS to restore the President’s Committee on the Arts and Humanities.","date":"Thu Dec 02 16:35:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Each of us values our rights differently, but they are all important, and should never be taken away.","date":"Wed Dec 01 20:17:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today’s Supreme Court majority is scary because, perhaps for the first time in U.S. history, they are considering reversing a constitutional right. That has really never happened before.","date":"Wed Dec 01 20:17:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"As a Member of the @BMHCaucus and cosponsor of the #Momnibus, I was proud to see @POTUS sign the first Momnibus bill into law earlier today!\n\nThe bipartisan Protecting Moms Who Served Act makes critical investments to ensure our veterans receive world-class maternal health care. https://t.co/2xEbHec1zf","date":"Tue Nov 30 21:52:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"https://t.co/Q8S6oxjYDK","date":"Mon Nov 29 19:40:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Happy #Hanukkah to all celebrating. \n\nI hope this holiday season brings peace, joy, and light. Chag Sameach!","date":"Sun Nov 28 23:40:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The DOJ &amp; federal government see the importance of organizations like the Tennessee Innocence Project while we continue to reform our criminal justice system. \nI'm confident @ProjectTenn will use these funds to continue their work of collaborative justice. https://t.co/vyw4A01tok","date":"Fri Nov 26 18:03:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"As you gather with friends and family, Jay and I would like to wish you a happy Thanksgiving! 🦃 https://t.co/5E8X1jHds0","date":"Thu Nov 25 17:22:20 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It’s good that Ahmaud Arbery’s murderers will be held accountable, but the fact that the country is collectively breathing a sigh of relief in response to today’s verdict shows how much work is needed to fix the justice system and heal our nation’s soul.","date":"Wed Nov 24 20:47:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Less than 50% of Tennesseans are vaccinated against #COVID19 but most of us will be will be in large gatherings over the holidays.\n\nIf you still haven’t gotten your 💉, I encourage you to get one to keep your loved ones safe as we spend time together: https://t.co/oNEhSSop9m","date":"Mon Nov 22 18:58:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am thrilled years-long efforts like getting more Tennesseans health insurance and bringing more equitable opportunities to North Nashville were in the #BuildBackBetter bill.\n\nhttps://t.co/F2OSmIm3OS","date":"Fri Nov 19 21:29:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"From capping prescription drug costs to expanding access to childcare to providing universal pre-K to extending the CTC &amp; EITC to finishing the job the TN wouldn’t by closing the Medicaid coverage gap, this bill will help TN families pay their bills and care for their loved ones.","date":"Fri Nov 19 15:23:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It also makes record investments in the climate crisis and our affordable housing crisis. I’m proud to support a bill that confronts the urgent challenges our country faces.","date":"Fri Nov 19 15:23:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is a historic piece of legislation that will help Tennesseans.","date":"Fri Nov 19 15:23:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee's huge infrastructure haul https://t.co/9S2WEFf1TU via @tamburintweets w/ @axios Nashville","date":"Thu Nov 18 15:50:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Biden signs $1.2T infrastructure bill: ‘America is moving again’ https://t.co/NFgiXa4Xof via @TNLookout","date":"Thu Nov 18 15:37:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It’s a sad day for Congress and I don’t know what’s worse. The fact that Rep. Gosar has still yet to apologize or see any issue with his actions, or that almost all of his Republican colleagues are refusing to speak out and are looking the other way.","date":"Wed Nov 17 21:55:48 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Rep. Gosar’s actions are despicable and he crossed the line. Congressional censure is entirely appropriate; anywhere else in America he would be fired or worse. https://t.co/xphTJVmi78","date":"Wed Nov 17 21:55:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville's restaurants and music venues are our economic engine, but they’ve been crippled by the pandemic. \n\nWe need to replenish the Restaurant Revitalization Fund to keep this important part of our community alive and strong. #ReplenishRRF https://t.co/qq7M3YzOKC","date":"Wed Nov 17 16:58:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Russia's destructive anti-satellite test was reckless and irresponsible. The thousands of pieces of harmful debris it generated put human lives at risk and will threaten our collective access to space well into the future. https://t.co/wWUACEBL69","date":"Tue Nov 16 16:16:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Presidents have talked for years about making this type of investment in our infrastructure but nobody has been able to get it done. \n\nPresident Biden getting this over the finish line is a huge landmark of success for every American.","date":"Mon Nov 15 23:53:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is a historic day and it was an honor to be with @POTUS, my colleagues, and Tennesseans today. \n\nThis bipartisan bill is the biggest infrastructure investment in history—bigger than the transcontinental railroad, the interstate highway system, or even electrifying America. https://t.co/ru4oeauy8K","date":"Mon Nov 15 23:53:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Signed into law! ✍️ https://t.co/hdkwPkC2mj","date":"Mon Nov 15 21:26:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Excited for @POTUS to sign the historic bipartisan infrastructure bill. This is a great day for our country. https://t.co/2W0t8HiQMv","date":"Mon Nov 15 20:23:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The next round of Child Tax Credit payments hits families’ bank accounts today!\n\nWe must pass the Build Back Better legislation to extend this important tax relief for families across Tennessee. #BuildBackBetterAct #ChildTaxCredit","date":"Mon Nov 15 19:34:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I'm looking forward to attending the bipartisan infrastructure bill signing this afternoon at the @WhiteHouse with @POTUS.\n\nThis bill will create millions of jobs and make long-overdue investments in Tennessee’s infrastructure.","date":"Mon Nov 15 17:14:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Eddie and his late wife Mary were one of Tennessee’s finest couples. When we had our disagreements, he’d sometimes turn my picture to the wall, but I was always proud to be on his wall.\n\nEddie was a good man and will be missed.","date":"Sun Nov 14 20:57:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Proud to co-lead this effort to stand up for what is right. Ignoring such blatant misbehavior would set a precedent that threatening colleagues in the workplace is acceptable.\n\nIt is not.","date":"Thu Nov 11 15:13:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"On #VeteransDay, we celebrate veterans from all walks of life who recognize that the promise of what this country could be is always worth fighting for.\n\nIt is a chance to recommit ourselves to ensuring veterans and their families always have the resources they need. https://t.co/QgTrV8g8Yq","date":"Thu Nov 11 13:58:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Happy 246th birthday to the @USMC! To all of the brave men &amp; women of the Marine Corps, we thank you for your dedicated service to our country.","date":"Wed Nov 10 22:45:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I had a great time visiting the @NashvilleZoo! 🦘 https://t.co/ubN57QolgW","date":"Wed Nov 10 18:34:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"There was no nicer, smarter person in Nashville than Alice.\n\nShe worked in my congressional office years ago and set new standards of excellence.\n\nWhat a loss.","date":"Tue Nov 09 20:50:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Climate change has no borders. I’m grateful to the world leaders and our very own Nashvillians currently meeting at #COP26 in Glasgow to discuss the best path towards protecting our planet through international cooperation. #BuildBackBetter https://t.co/1So85PncnT","date":"Tue Nov 09 20:04:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is a BIG DEAL for Tennessee. \n\nNext, we Build Back Better. https://t.co/u2r19SiE65","date":"Tue Nov 09 16:46:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Big win #TitanUp #TENvsLAR","date":"Mon Nov 08 04:31:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Go #Titans!","date":"Mon Nov 08 02:51:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I was also glad to support advancing President Biden’s Build Back Better Agenda, which will lower healthcare and childcare costs and address the climate crisis. Both bills are a win for all Tennesseans.","date":"Sat Nov 06 20:22:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"BIF is the largest investment in America’s infrastructure. Tennessee will receive billions in funding:\n🛣$5.8 billion for highways\n🚰$697 million for safe water\n🚎$630 million for public transit\n🌉$300 million for bridges\n🛬$300 million for airports\n💻$100 million for broadband","date":"Sat Nov 06 20:22:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The bipartisan infrastructure bill will create millions of jobs and make long-overdue investments in Tennessee’s infrastructure. It will give us better roads and bridges, faster internet, and cleaner drinking water.","date":"Sat Nov 06 20:22:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Last night, President Biden and House Democrats did what they promised and delivered for the American people.","date":"Sat Nov 06 14:38:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"There is no voting rights proposal Republicans will support, and everyone knows it. We must end the filibuster to save our democracy.\nhttps://t.co/TUS5rQHVza","date":"Wed Nov 03 21:17:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Open enrollment for coverage on https://t.co/8pu3CTsKwU is open NOW until December 15! Democrats have made historic investments in affordable healthcare, and millions of Tennesseans will have lower premiums and more choices in 2022. Check out your options now!","date":"Wed Nov 03 15:08:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"https://t.co/m1iCwjglwW","date":"Mon Nov 01 18:00:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"SB 8 takes away women's &amp; family's constitutional rights &amp; could lead to abortion bans in other states – including Tennessee – if allowed to stand. Women’s reproductive rights &amp; abortion access hang in the balance &amp; are at the mercy of the most conservative Court in decades.","date":"Mon Nov 01 18:00:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Happy Halloween!! 👻🎃 https://t.co/vKAV3643pg","date":"Sun Oct 31 21:48:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The bill passed by the Tennessee legislature is reckless and dangerous. \n\nThey are putting lives – including the lives of children – at risk.","date":"Sat Oct 30 22:50:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It is appalling that so many institutions—especially taxpayer-funded ones—continue to bear the name of the Sacklers. The very least government can do is require morals clauses, especially when families like the Sacklers have no moral standards themselves.\n\nhttps://t.co/1pd88RY32v","date":"Fri Oct 29 15:12:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"WATCH: Today I asked American oil executives about the government subsidies their companies are receiving and the response was … 🦗🦗 https://t.co/Hco5ZaowSD","date":"Thu Oct 28 18:20:59 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, I’m proud to #StandWithPublicWorkers in their fight for better work conditions.\n\nThe Public Service Freedom to Negotiate Act will protect the rights of millions of public workers to negotiate higher wages, better healthcare, and a secure retirement. https://t.co/BQDarSOAoS","date":"Tue Oct 26 19:34:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"COVID-19 increased the risk for intimate partner violence &amp; disrupted key services for survivors.\n\nI’m voting to #SupportSurvivors and strengthen the Family Violence Prevention &amp; Services Act, focusing on:\n\n✅Improving services for survivors\n✅Investments in prevention https://t.co/oVZDzqyVna","date":"Tue Oct 26 18:46:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"While this is satire, I appreciate this @petridishes column on the importance of meeting this moment and addressing the climate crisis. https://t.co/iEDZFAFojB","date":"Tue Oct 26 17:44:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Closing the Medicaid coverage gap would extend healthcare benefits to more than 4 million Americans, including 300,000 Tennesseans.","date":"Mon Oct 25 21:27:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I was honored to join American Baptist College's 97th anniversary celebration. Some of America's greatest heroes, including John Lewis and Dr. C. T. Vivian, walked the halls of this storied institution. We march forward on the Road to 100. https://t.co/FwZ9lJZrq0 https://t.co/TzySGY6zpd","date":"Mon Oct 25 17:40:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Proof that Republicans won’t vote for ANY voting rights proposal.\n\nThey are only interested in suppressing the vote.\n\nThis is a sad day for democracy.","date":"Wed Oct 20 22:15:05 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Dreamers, TPS holders, and essential workers in this country deserve a chance at the American Dream. \n\n#TheMomentIsNow to deliver real immigration reform. https://t.co/pw9x36pawu","date":"Wed Oct 20 15:38:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yesterday I testified before the State Senate Ad Hoc Committee on Redistricting, asking them to respect Tennessee voters - all voters - by keeping our state capital whole. \n\nThey came to Nashville to build a better state, not join a wrecking crew. \n\nhttps://t.co/sb7W9ujTvH","date":"Tue Oct 19 16:51:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Colin Powell represented the very best of America; more of us should embody his grace, determination, and unifying leadership. \n\nRead my full statement on the passing of former Secretary of State Colin Powell: https://t.co/ugmye70BMA","date":"Mon Oct 18 16:04:52 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Proud to kick off @tnaflcio's Biennial Convention this morning. \n\nTennessee's labor movement is strong and growing each day.","date":"Mon Oct 18 14:47:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: If you are a high school student interested in attending a U.S. Service Academy, the deadline to apply for a nomination is Friday, Nov. 5, at 5pm CT.\n\nApply here: https://t.co/wy0AbLbyQu https://t.co/40IW5lYlcB","date":"Thu Oct 14 19:43:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was great to be with @NUCAMidTn to discuss infrastructure and the Build Back Better Act!","date":"Fri Oct 08 18:30:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Dr. @gloverpres powerfully conveyed how HBCUs make Nashville, the State of Tennessee, and our country stronger. \n\nSupport for these vital institutions must be included in the Build Back Better Act.","date":"Thu Oct 07 20:14:48 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m so proud that one of Nashville’s four great HBCUs was represented at yesterday’s @EdLaborCmte hearing on the history and contributions of HBCUs.","date":"Thu Oct 07 20:14:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We are in the sad situation of paying federal taxes so that other states could take better care of their citizens than we do. \n\nCongress needs to close the gap on Medicaid expansion.","date":"Wed Oct 06 18:28:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I couldn’t have said it better myself, @SenatorWarnock. \n\nGov. Lee and our state legislature are keeping Tennesseans from getting access to health care.","date":"Wed Oct 06 18:28:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"If you were displaced from the severe storms and flooding on Aug. 21 &amp; live in Dickson, Hickman, Houston, or Humphreys counties, you may be eligible for lodging expense reimbursement. Call the FEMA helpline at 800-621-3362, open daily from 7 a.m. to 10 p.m., for more information.","date":"Wed Oct 06 15:44:04 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Have you already applied and got a letter saying the claim is ineligible? You have 60 days from the date of FEMA’s determination letter to write an appeal explaining why you disagree. Submit the appeal to your https://t.co/axpOGuOtJ5 account or fax to 800-827-8112","date":"Tue Oct 05 15:33:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Spearheaded by House Democrats, pandemic relief aid has saved so many of our local venues and treasures. \n\nI’m proud SBA chose to highlight this success in Nashville.","date":"Tue Oct 05 00:42:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"David Shepard was a pillar of the Dickson community, a true public servant of the State of Tennessee, and a veteran of the Vietnam War. It was a honor to attend his memorial service this afternoon. https://t.co/N0gYToIyAw","date":"Sat Oct 02 20:32:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Always great to talk with @WFSKJazzy88!","date":"Sat Oct 02 19:36:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"https://t.co/nbACQrJqCJ","date":"Fri Oct 01 22:00:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Most Nashvillians will experience even longer delays when sending mail under Postmaster General DeJoy’s plan for the USPS. For what? DeJoy needs to go. https://t.co/udHkHC3GlK","date":"Fri Oct 01 16:31:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN🚨: OCTOBER 25 is the deadline for Dickson Co. residents to apply for FEMA assistance from the August 21 storms &amp; flooding (4609-DR-TN).\n\nSurvivors may apply via https://t.co/jTgqFUQHlN or call the Helpline at 800-621-3362 (TTY 800-462-7585).","date":"Fri Oct 01 14:27:26 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Calling all young musicians! You have 2 weeks left to submit your songs for the @kidizenship #SINGYOURANTHEM contest! Create something inspiring and have your music heard by this all-star panel of judges: @rhiannongiddens, @jasonisbell, @genesisbe, @dariusrucker.","date":"Thu Sep 30 17:59:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"There are a million different reasons why hard work and good values alone don’t get you out of poverty. \n\nThe enhanced Child Tax Credit is a game changer for families across Tennessee and needs to be made permanent. https://t.co/Wfu31NccW5","date":"Thu Sep 30 14:56:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Governor Lee is blocking schools from enforcing mask mandates, and his failure to back the science has driven 400+ schools in TN to close due to the virus. How is this what’s best for our kids?","date":"Wed Sep 29 15:07:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Our state is once again leading the race to the bottom – @CDCgov reports Tennessee is #1 for COVID-related school closures. https://t.co/xRi9hg5aIG","date":"Wed Sep 29 15:07:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Justice Clark was a fair and thoughtful jurist, a dedicated public servant, and an incredible mentor for women in the law. Tennessee’s judiciary has suffered an enormous loss. https://t.co/0eYJhonKxV","date":"Wed Sep 29 13:57:52 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Are you a high school student interested in attending one of our country's military academies? My annual Academy Day is coming up this Saturday, October 2.\n\nRegister here: https://t.co/wy0AbKTXrU https://t.co/oHr3NHlngr","date":"Tue Sep 28 18:47:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today is #NationalVoterRegistrationDay !\n\nRegister to vote or update your info here: https://t.co/D54xR5lfcX https://t.co/Lia9uTAZYL","date":"Tue Sep 28 15:53:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Dickson Co. residents who experienced damage from the severe storms &amp; flooding on Aug. 21 may be eligible for funding for temporary rentals through @femaregion4's Individuals and Households Program. Call FEMA’s Helpline at 800-621-3362 (TTY 800-462-7585) seven days a week.","date":"Mon Sep 27 21:40:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Of Note: Operation Stand Down lands $2.1M grant https://t.co/7Z8PBlukHk via @NashvillePost","date":"Mon Sep 27 20:44:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Looking forward to joining tonight! \n\nCommunity engagement and transparency are vital for a fair and accountable redistricting process.","date":"Mon Sep 27 16:49:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We should welcome the Afghans who helped our troops survive by translating for them and other services. It was great to join the rally today here in Nashville. https://t.co/0l5F9Z7WuJ","date":"Sun Sep 26 22:44:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"No one should fear for their lives while shopping for groceries. We must do everything necessary to reduce gun violence.\n\nI’m praying for the wounded, families of the victims, and all of Collierville.","date":"Thu Sep 23 21:53:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The House overwhelmingly passed this important funding to keep all civilians living in Israel safe. This strong bipartisan vote shows America’s unwavering support for Israel’s security.  https://t.co/GBAeDveVL9","date":"Thu Sep 23 18:57:05 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Agree - Israel has to defend itself, and for many years I have supported Iron Dome, David’s Sling, and even proposed an Iron Basement to defend against Hamas’ tunnel attacks.","date":"Thu Sep 23 01:30:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nearly 75,000 #ChildTaxCredit payments have been distributed in #TN05 to date.\n\nThe #CTC has provided Middle Tennessee families with a lifeline to help families stay afloat and should be made permanent.\n\nhttps://t.co/M5jFXwvIRm","date":"Wed Sep 22 21:52:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"In 2012, the @GoldenGooseAward was created to honor phenomenal scientists and remind us that the vast majority of problems in today’s world (health, climate, energy, etc) require solutions from science. Investing in science will lead to a better future. #GGA21 https://t.co/8o1jcJyZ7p","date":"Wed Sep 22 20:25:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Senator Thelma Harper was a mentor, teacher, and true public servant. It is my honor to introduce this bill to commemorate her life and hard work. https://t.co/f231HhLEPs","date":"Wed Sep 22 16:44:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Proud to join colleagues in protecting the freedom to choose by urging the Supreme Court to uphold Roe v. Wade in the Mississippi case that will be argued In December. https://t.co/7QmdpzzJgl","date":"Tue Sep 21 22:38:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is disappointing news but the fight is not over. \n\nWe have to get immigration reform passed any way we can. Dreamers, TPS holders, and essential workers have waited too long. https://t.co/PwYZFZESlI","date":"Mon Sep 20 15:54:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"⬇️","date":"Thu Sep 16 23:36:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"G’mar chatima tovah. May all who are observing Yom Kippur have a meaningful and easy fast.","date":"Wed Sep 15 19:52:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We must continue to reunite families, extend asylum to those seeking refuge, and open a path to citizenship for the millions of Dreamers and essential workers living in the United States. #HispanicHeritageMonth #LatinxHeritageMonth","date":"Wed Sep 15 17:01:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Hispanic Heritage Month starts today &amp; Nashville has one of the greatest immigrant communities in the nation. From nurses &amp; doctors who care for us, to farmers &amp; food service workers who feed us &amp; our families, to those serving in our military. They represent the best of America.","date":"Wed Sep 15 17:01:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennesseans need to get vaccinated ASAP. We're the worst state in the nation for COVID-19 cases. \n\nIt’s both neighborly and patriotic to get the shot. https://t.co/t9FePxGVdu","date":"Tue Sep 14 19:11:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is not what leadership looks like. No teacher, student or staff member should die from #COVID19. Adults who don't get vaccinated are 11x more likely to die. Hospitals are so overcrowded from COVID they cannot even take stroke victims. We need a governor who stands up for us.","date":"Mon Sep 13 20:25:16 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I agree @JonathanScott, and will continue to support and vote for legislation to #ActOnClimate.","date":"Mon Sep 13 17:06:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I was honored to join the Exchange Club of Bellevue’s 20th Anniversary Event to reflect and remember those who lost their lives and the heroes who responded on 9/11. #NeverForget https://t.co/htE9EPcIp3","date":"Sat Sep 11 17:40:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was great to visit @y12nsc with @NNSAHruby in Oak Ridge. As Chair of @HASCDemocrats Strategic Forces,  I appreciated the opportunity to learn more about the important work at this facility. https://t.co/B9jIk8Ftgc","date":"Fri Sep 10 15:30:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The federal public comment period ends tonight. It’s not too late to submit your own comments and concerns to @CMSGov about this proposal. \n\nComment here: https://t.co/dw4SFb0VOR","date":"Thu Sep 09 21:23:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"TennCare III, the “block grant,”barely mentions the health of Tennesseans because health is such a low priority to our state government. Its mission is almost entirely budget-driven, not people-driven. \n\nRead my submitted comment in full here: https://t.co/Qq8w3IJKCt","date":"Thu Sep 09 21:23:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Read my full written statement that I submitted for the record at yesterday's hearing on redistricting: \n\nhttps://t.co/McJPPzSNEL","date":"Thu Sep 09 16:14:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"My remarks on protecting Nashville from partisan gerrymandering: https://t.co/6pV8dCM4GO","date":"Thu Sep 09 15:13:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yesterday, I called on state lawmakers to allow democracy to keep working in Tennessee by respecting voters, all voters, and by keeping Nashville whole.","date":"Thu Sep 09 15:00:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This has never been allowed in any Medicaid program. Do our most vulnerable Tennesseans really deserve less protection than citizens of other states?\n\nShare your concerns here: https://t.co/dw4SFb0VOR","date":"Tue Sep 07 22:13:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"TWO DAYS LEFT to comment on the TennCare block grant! This dangerous proposal puts an aggregate cap on federal Medicaid funding and I’m worried there are no safeguards to help Tennesseans monitor the effects of provisions like the closed drug formulary.","date":"Tue Sep 07 22:13:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Following Tennessee’s lead, Texas criminalizes providing absentee ballots and enacts new strict voter ID requirements – and now it may be the hardest place to vote in the country. \n\nCongress and the courts have to wake up and stop these blatant assaults on the right to vote.","date":"Tue Sep 07 21:30:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: If you were impacted by the recent storms and flooding events in Tennessee, watch a quick video from @SBAgov about how to apply for disaster loans: https://t.co/Y0DaQ3teru","date":"Tue Sep 07 15:42:11 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Shanah Tovah to everyone observing Rosh Hashanah! I wish all a healthy, safe, and peaceful new year.","date":"Mon Sep 06 19:45:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m grateful for hardworking Middle Tennesseans and the labor movement that continues to grow here. Happy #LaborDay!","date":"Mon Sep 06 18:13:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The best way to spend a Sunday. https://t.co/oYwsW0JYPf","date":"Sun Sep 05 23:00:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"A great day to be with local labor leaders and friends at the @NashvilleCLC Labor Day Celebration! https://t.co/n7iP3PnjLi","date":"Sat Sep 04 16:02:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"And as Chairman of Strategic Forces, I’m especially proud of our portion of the budget, which keeps our nukes safe, secure, and reliable, invests in new technologies for space and missile defense, and protects the men and women who handle these critical nat'l security missions.","date":"Thu Sep 02 22:21:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"After meeting for 16 hours straight, we passed  #FY22NDAA out of cmte at 2am last night. \nIt was never going to be perfect, but I’m proud of @HASCDemocrats for crafting a budget that cares for our troops, promotes diversity, combats extremism &amp; prepares for tomorrow's challenges.","date":"Thu Sep 02 22:21:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was great to talk with @writerickmeyer about how the infrastructure bill is going to help Tennessee.\n\nRead more:","date":"Thu Sep 02 21:58:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m a proud cosponsor and look forward to voting for the Women's Health Protection Act to protect the right of women to make their own health care decisions.","date":"Thu Sep 02 17:19:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We’ve been battling the #COVID19 for about 18 months, and somehow, even with available vaccines, Tennessee is doing worse, not better. \n\nWe know how to stop this: get vaccinated, wear your mask, wash your hands. https://t.co/D3v9RQaUU6","date":"Wed Sep 01 19:22:20 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Inaction by the Supreme Court on SB8 in Texas is a scary sign for what’s to come, particularly in Tennessee. \n\nWe must protect access to abortion, which can often be life-saving care, before that right is lost for good.","date":"Wed Sep 01 12:16:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The @usedgov had to launch a civil rights investigation because GOP Governors banned local school districts from implementing mask mandate. \n\nPlaying politics with the health and safety of our school children is dangerous and unwise. https://t.co/Oisu3BXW96","date":"Mon Aug 30 23:44:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville led the nonviolent Civil Rights Movement, but there may not have even been a movement were it not for the bravery of a young woman from Alabama named Rosa Parks.\nhttps://t.co/wSShJ260Xq","date":"Mon Aug 30 20:17:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"There is no more fitting or deserving person in American history to award the honor of a new national holiday than Rosa Parks. Today, along with @RepBeatty &amp; @RepTerriSewell, I introduced a bill to do just that.","date":"Mon Aug 30 20:17:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Do you live in Nashville and have a large tree in your yard?\n\nEnter your 🌲 in the @Trees4Nashville Big Old Tree Contest here: \n\nhttps://t.co/S2Y8CgWl03","date":"Mon Aug 30 14:59:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"58 years ago today, American heroes led the #MarchonWashington. \n\nIt’s more important than ever to continue this fight for civil rights, equal access to the ballot, and economic opportunity for all.","date":"Sat Aug 28 17:30:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was so awesome to visit with the team at Surreal Spice today while they celebrated their 5th Anniversary as a staple in the Antioch community! https://t.co/NPSmCTdKaB","date":"Fri Aug 27 20:17:54 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee has some of the worst protections for tenants in the country, and thousands of Nashvillians are behind on rent and at risk of eviction. \n\nCongress needs to extend the eviction moratorium. https://t.co/Fdo7O3w41r","date":"Fri Aug 27 18:33:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"My prayers are with the victims of this attack, their families, and our troops on the ground.\n\nSee this thread with resources for those trying to evacuate. https://t.co/slVKFuZHWs","date":"Thu Aug 26 20:44:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m closely monitoring the situation in Kabul. My office has been working tirelessly to assist with the safe evacuation of Americans and our Afghan partners. We will continue to do so until every American and individual eligible for evacuation is out of harm’s way.","date":"Thu Aug 26 20:37:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, on the 101st anniversary of the certification of the 19th Amendment, we honor the trailblazing women who have led the fight for equality, and recognize the work that still lies ahead. #WomensEqualityDay","date":"Thu Aug 26 17:52:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: Tennessee’s Major Disaster Declaration now includes Individual Assistance for Dickson County residents.\n\nIndividuals can apply for FEMA assistance online at https://t.co/eu1GO1NlIg or call 1-800-621-3362 (TTY: 800-462-7585).","date":"Thu Aug 26 15:54:26 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Are you attending the @UrbanLeagueULMT Job Fair at the @NashvilleMCC? Stop by to see #TeamCooper for info on the #ChildTaxCredit and other resources!📑 https://t.co/b6Yow6DWos","date":"Wed Aug 25 19:17:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Freedom Riders risked their futures for our future and their lives for our freedom.\n\nRip’s impact and legacy will be felt for generations to come. https://t.co/jkzAabx5el","date":"Tue Aug 24 23:08:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"For all those who sacrificed so we could cast a ballot freely and fairly, we must pass #HR4 to #RestoretheVote.","date":"Tue Aug 24 19:18:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m glad Gov. Lee quickly sent a formal request for a major disaster declaration for Middle Tennessee following the heavy rainfall and flooding over the weekend. \n\nI will work with the President to deliver the needed funding and start the recovery process as quickly as possible.","date":"Tue Aug 24 13:13:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🧵:For U.S. citizens and green card holders in Afghanistan, fill out this State Department form: https://t.co/zgyfg3wPBd\n\nNeed us to follow up? Email RepCooperEvac@mail.house.gov or call 615-736-5295.","date":"Thu Aug 19 14:49:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Extreme flooding devastating portions of Middle Tennessee Saturday. Here's how to help with recovery efforts. https://t.co/jCFTa9liEK","date":"Sun Aug 22 20:14:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I had a great time at the @fly_nashville #BNA5K this morning! It was good to see so many friends! https://t.co/u5qP6rIpJ0","date":"Sat Aug 21 15:00:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Republicans used to champion local control of school systems but now they are trying to override the health policies of local school officials, doctors, and public health experts. They should stop politicizing this issue and focus on keeping our children healthy.","date":"Thu Aug 19 15:43:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It's sad and probably tragic that state government officials cannot agree on putting the health of our school children first, enabling our schools to remain open.","date":"Thu Aug 19 15:42:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"If you are an SIV holder in Afghanistan or know someone who is, email NVCSIV@state.gov or call 1-603-334-0828 from 6:30am-11pm CT. Have a USCIS receipt #, full name, and DOB.\n\nIf not yet approved for SIV, email us at RepCooperEvac@mail.house.gov or call us at 1-615-736-5295.","date":"Thu Aug 19 14:49:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🧵:For U.S. citizens and green card holders in Afghanistan, fill out this State Department form: https://t.co/zgyfg3wPBd\n\nNeed us to follow up? Email RepCooperEvac@mail.house.gov or call 615-736-5295.","date":"Thu Aug 19 14:49:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"For P-2 applicants, if you/someone you know worked for the U.S. govt, received a U.S. grant, or worked for U.S. media/NGOs, and are in Afghanistan, email RepCooperEvac@mail.house.gov or call us at 1-615-736-5295.\n\nSee if you qualify: https://t.co/dhgDAt6aKd","date":"Thu Aug 19 14:49:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We are lucky to have someone with Christopher’s talent back on our team. He knows Tennessee and Washington and will help me better serve the people of Middle Tennessee. \n\nhttps://t.co/licoIX1k6h","date":"Tue Aug 17 21:44:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am also excited for @__lindseysmith to begin this next chapter!\n\nShe has a passion for public service &amp; will be an awesome advocate for moving Tennessee forward. https://t.co/XOkwQd02PE","date":"Tue Aug 17 21:44:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations! You and @Chasten will be excellent fathers.","date":"Tue Aug 17 20:26:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congress has the power and the duty to act and restore protections against racial discrimination in voting. It’s time to #RestoreTheVote.","date":"Tue Aug 17 17:37:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Before it was gutted by SCOTUS, the Voting Rights Act kept the promise of our democracy alive by preventing states &amp; localities from restricting the right to vote. \n\nThat’s why I’m proud to be an original cosponsor of #HR4, the John R. Lewis Voting Rights Advancement Act. https://t.co/CNKUevyD92","date":"Tue Aug 17 17:37:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I'm proud to introduce a resolution honoring the Clinton 12, who were among the first students to desegregate a high school here in Tennessee: https://t.co/1vuwMztmIB https://t.co/3y4kddSGLJ","date":"Tue Aug 17 16:51:53 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was great to gather with current and former #Jimterns who are truly a part of the family! Many thanks to @RepLucyMcBath for stopping by to say hello! https://t.co/ADyU0qc6GC","date":"Sun Aug 15 19:56:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thanks to the American Rescue Plan, the second Advanced #ChildTaxCredit payment goes out TODAY. \n\nFamilies can receive their monthly payments faster by adding or updating banking and direct deposit information through the Child Tax Credit Update Portal. https://t.co/N3aXVHiRFE","date":"Fri Aug 13 18:34:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Middle Tennesseans know all about the inconveniences and safety concerns of rail crossings that are blocked for unreasonably long times, sometimes even hours. Freight railroads had ample time to respect drivers and I’m glad Congress is stepping up to fix the problem.","date":"Wed Aug 11 19:41:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Bipartisan Infrastructure Deal is an important step to improve our chances of beating the railroads whose lobbyists have railroaded Congress for almost 150 years. https://t.co/IPjzN7WYd9","date":"Wed Aug 11 19:41:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨🚨: @CMSGov announced a comment period for TN’s dangerous Medicaid block grant - TennCare III.\n\nThis reckless experiment was rushed through before Biden’s inauguration even though Tennesseans were clear that they oppose it.\n\nWe must share our concerns: https://t.co/dw4SFb0VOR","date":"Wed Aug 11 17:17:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper member @CherylMayes had a great time at the Crossings Nashville Action partnership meeting yesterday w/ Senator @yarbro, Commander Keith Stephens, CNAP President Andy Bhakta, and CNAP Board Members Carol Joslyn &amp; Santos Gonzalez! https://t.co/mcqskyXLE4","date":"Wed Aug 11 16:54:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The reconciliation package addresses urgent needs, such as health care, child care, housing, climate change, immigration and more. These investments are overdue, and we cannot miss this moment to build a better future for everyone.","date":"Tue Aug 10 15:53:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Infrastructure Investment &amp; Jobs Act is a historic investment in our declining infrastructure systems. I applaud @POTUS for negotiating this bipartisan bill through a difficult Senate. Now I’m eager for the Senate to send the House the $3.5 trillion reconciliation bill.","date":"Tue Aug 10 15:52:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@HouseDemocrats took an important step to #RestoreTheVote with the release of this report about the voter suppression tactics states are employing across America. \n\nIt’s essential that Congress strengthen &amp; restore the #VotingRightsAct to ensure free &amp; fair access to the ballot.","date":"Mon Aug 09 22:14:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Republicans must work with Democrats to save our planet from climate change.","date":"Mon Aug 09 19:16:46 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The latest IPCC report clearly confirms what we already knew: ignoring the science of climate change will lead to apocalyptic consequences. \n\nBut the good news is that there’s still time to prevent the worst case scenarios if we act aggressively now. https://t.co/P1qizPlDEf","date":"Mon Aug 09 19:16:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@RichardTrumka was the backbone of working class in America and will be missed.","date":"Thu Aug 05 20:02:26 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The time is NOW. We cannot miss this opportunity to close the coverage gap.","date":"Wed Aug 04 21:42:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am thankful @CDCgov heard @RepCori and @HouseDemocrats' call to extend the eviction moratorium through Oct. 3. We will keep fighting to protect millions of families at risk of eviction and homelessness.","date":"Wed Aug 04 14:10:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: The Dept. of Commerce’s National Telecommunications and Information Administration is accepting applications to expand broadband access to eligible HBCUs, Tribal Colleges or Universities, and minority-serving institutions. More info: https://t.co/1evBGP5IW4","date":"Tue Aug 03 22:40:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨ATTN: 13M people are still eligible for free health insurance under the #AmericanRescuePlan. Find out if you are eligible &amp; sign up here: https://t.co/JJLHCTOhXq\n\nhttps://t.co/gvNpCgR91f","date":"Tue Aug 03 18:30:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@HouseDemocrats won’t stop fighting &amp; believe everyone deserves safe &amp; affordable housing. The CDC must immediately #ExtendTheMoratorium and protect millions of families at risk of eviction and homelessness.","date":"Tue Aug 03 17:27:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am a cosponsor of @RepMaxineWaters' bill HR 4791 to #ExtendTheMoratorium. When @HouseGOP blocked #HR4791, they put millions of families &amp; children at risk of being put out on the streets.","date":"Tue Aug 03 17:26:59 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Another senseless act of gun violence this morning in Antioch.\n\nWe must do better.\n\nWe still need the Senate to bring up the @HouseDemocrats' background check bills for a vote.","date":"Tue Aug 03 15:32:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Looking for a fall internship? Check out our opportunities in Nashville &amp; DC. Application deadline is 8/20! https://t.co/bO0PyiaD8j https://t.co/pWcUFQaeUR","date":"Mon Aug 02 21:30:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"https://t.co/gXre3uUhx8","date":"Mon Aug 02 21:10:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Violence of any kind - but especially against women - is never a laughing matter.\n\nKevin McCarthy should apologize for his disgusting comment in Nashville last night.","date":"Sun Aug 01 18:13:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We have to extend the eviction moratorium. Period. We are still not out of the #COVID19 pandemic.","date":"Fri Jul 30 22:07:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper member @cherylmayes had a great time visiting with the Boys and Girls Club of Middle TN and Rep. Bo Mitchell last night to learn about all of the things they are working on. The future is bright! https://t.co/R4CW3X2JVr","date":"Fri Jul 30 19:14:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I agree with Assistant AG @KristenClarkeJD and am glad the Justice Department is pushing back against GOP tactics to suppress the vote.\n\nhttps://t.co/LORauynrc3","date":"Fri Jul 30 16:25:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"“Whether through litigation or the issuance of official guidance, we are using every tool in our arsenal to ensure that all eligible citizens can exercise their right to vote free from intimidation, and have their ballots counted.\"","date":"Fri Jul 30 16:25:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"If you applied for assistance with the @MetroActionComm HOPE Program and need to check the status of your application, call 615-862-RENT (7368), team members are available to assist. In person appointments are available 7am -7pm Mon-Fri.","date":"Fri Jul 30 16:15:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I hear from a lot of folks who want to know more about how Congress is working for them, and I’m excited we will start a new way to provide that to Middle Tennesseans.\n\nSign up for my new weekly newsletter, The Wrap Up: https://t.co/K5f372MyG0","date":"Fri Jul 30 15:31:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"@TNLookout And @MeharryMedical!","date":"Thu Jul 29 19:26:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"These projects are vital to make Nashville more inclusive and help us continue to grow.\n\nI hope the Senate will agree to support these projects and send these much-needed funds back here to Middle Tennessee.\n\nhttps://t.co/FYWerlePbP","date":"Thu Jul 29 19:17:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Proud to help @TSUedu secure $700K from @USDA to support research at HBCU’s to help strengthen teaching, research, and extension work in the food and agricultural sciences. \n\nhttps://t.co/qqCOcyI6EK","date":"Thu Jul 29 18:36:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The four police officers who testified before the @January6thCmte yesterday told the truth about the danger they bravely faced, the danger not only to themselves, but to our democracy. They were not attacked by tourists.","date":"Wed Jul 28 22:04:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We did not have a peaceful transfer of power. This was the worst attack on our Capitol since 1814.","date":"Wed Jul 28 22:04:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations to Nashville native, @HarpethHall alumna, and now Olympian Alex Walsh for winning a silver medal in the 200IM! #TokyoOlympics #TokyoHERstory","date":"Wed Jul 28 15:17:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Looking at you @GovBillLee and @tnsenategop @tnhousegop @ltgovmcnally @CSexton25 @TNGOP.\n\nWe need Medicaid expansion NOW and the federal government is offering you BILLIONS of dollars to do it.\n\nRefusing = politics &gt; people.\n\nhttps://t.co/UgtRaPucBQ","date":"Tue Jul 27 18:50:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It’s not too late to get your #COVID19 vaccine.\n\nDoctors and scientists agree - if you are not yet vaccinated, wear a mask and keep your distance.\n\nBook your appt today: https://t.co/preNQrU7Uq","date":"Mon Jul 26 16:50:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It shouldn’t have taken this long, but I am glad the Nathan Bedford Forrest bust was finally removed today. This never should have been so difficult. \n\nhttps://t.co/L3Q3om1mwm","date":"Fri Jul 23 19:54:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We proudly cheer for #TeamUSA \n\nBest of luck to all the athletes as they show their strength and resilience at the #TokyoOlympics!\n\nWe are #StrongerTogether💪 https://t.co/xSkVftHBlp","date":"Fri Jul 23 18:12:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This week marks #200Days of this Congress and 200 days of @HouseDemocrats delivering #ForThePeople! https://t.co/aMRRwS0y7T","date":"Fri Jul 23 17:12:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"A look at the history of the Nathan Bedford Forrest bust at the Capitol: \n\nhttps://t.co/J9VtZq9mal","date":"Fri Jul 23 15:24:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you Chairman @RepJohnYarmuth. We’ve needed comprehensive immigration reform for years, and we can’t pass up any opportunity.","date":"Thu Jul 22 15:18:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: If you have questions or need more info on the #ChildTaxCredit, follow this thread🧵:","date":"Wed Jul 21 16:48:59 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I agree! That’s why I’m supporting @WhipClyburn's  Accessible, Affordable Internet for All Act that would provide $94+ billion to create accessible, affordable broadband in underserved communities - including funding for the Emergency Broadband Connectivity Fund.","date":"Wed Jul 21 14:26:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m glad the Biden administration is appealing this terrible decision, and the Senate should also pass the American Dream and Promise Act immediately.","date":"Mon Jul 19 16:31:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville and Middle Tennessee are home to one of the best immigrant communities in the country. DREAMers came here through no fault of their own. They work hard and represent the best of America.","date":"Mon Jul 19 16:31:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I always say I’d never met a living Saint until I met John Lewis. It was an honor to march alongside Nashville’s Freedom Riders as we unveiled the new Rep. John Lewis Way here in Nashville. #GoodTrouble https://t.co/kTzlqtfjIK","date":"Sat Jul 17 17:35:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@RepBeatty is a staunch defender of the right to vote and our democracy.","date":"Fri Jul 16 21:37:48 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Eligible families will begin receiving Child Tax Credit payments starting this Thursday, July 15.\n\nHave questions or need more information? Save this thread 🧵:","date":"Mon Jul 12 17:15:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"@POTUS @VP https://t.co/HQtImmlgv2","date":"Fri Jul 16 17:21:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Proud to support, with @POTUS &amp; @VP, getting this money to TN. Many low-income &amp; rural students were disproportionately affected by remote learning during the #COVID19 pandemic just because they had no access - or no reliable access - to the internet.\nhttps://t.co/hcxI6LW2m2","date":"Fri Jul 16 17:08:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #ChildTaxCredit is unprecedented. This will cut childhood poverty in HALF and lift nearly 12,000 children in Tennessee out of poverty.\n\nhttps://t.co/pzJJSNNFEe","date":"Thu Jul 15 14:14:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"“We need to let science drive decisions. We need to make sure the people and the children of Tennessee grow up healthy.” Amen, @alexjahangir!","date":"Wed Jul 14 22:15:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Preguntas sobre #ChildTaxCredit pagos mensuales? Lea más aqui: https://t.co/93a5D7HK2r","date":"Wed Jul 14 19:09:46 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Questions about the #ChildTaxCredit monthly payments? Read more: https://t.co/8FAAuHcZ1P","date":"Wed Jul 14 19:08:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #ChildTaxCredit included in the #AmericanRescuePlan will be life-changing.\n\nNearly 90% of children in #TN05 will benefit from the #ChildTaxCredit payments that start arriving TOMORROW, lifting more than 11,500 children out of poverty. https://t.co/yq1dPOgC2L","date":"Wed Jul 14 18:48:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations to #TeamCooper alum, @Atul_Gawande, on this awesome nomination!","date":"Tue Jul 13 21:07:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@drfixus is on the right side of history and the right side of science!","date":"Tue Jul 13 17:10:48 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"House Democrats fought tirelessly to ensure that parents can provide for their families during and after the pandemic.\n\nStarting July 15, parents can receive up to $250-$300 per child in 2021 to help when they need it MOST.\n\nLearn more: https://t.co/HeIG8UTArW","date":"Tue Jul 13 16:05:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"She should not be punished for telling the truth and following her scientific training in order to prevent the needless spread of the pandemic. Her firing is a huge black eye for our state's reputation.","date":"Tue Jul 13 14:42:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"How sad that a dedicated physician and public health advocate gets fired for doing the right thing. @drfixus is a strong advocate for all Tennesseans.","date":"Tue Jul 13 14:42:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"What if I do not want to receive monthly CTC payments? https://t.co/AKs9a7L2KB","date":"Mon Jul 12 17:15:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"How will I receive my monthly CTC payments? https://t.co/0ORVwHrcfC","date":"Mon Jul 12 17:15:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"What is the CTC payment schedule? https://t.co/HMcsUttXUS","date":"Mon Jul 12 17:15:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"What if my family status changes during the year? https://t.co/VgASaYVJfn","date":"Mon Jul 12 17:15:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"How are payments calculated? https://t.co/MPyvKK0a97","date":"Mon Jul 12 17:15:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Who counts as a qualifying child? https://t.co/3MLxfesrD8","date":"Mon Jul 12 17:15:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Why is the IRS issuing advance monthly payments and do I have to pay this money back? https://t.co/br2k7p7sW5","date":"Mon Jul 12 17:15:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"What is the Child Tax Credit (CTC)? https://t.co/UdbBSFs5ON","date":"Mon Jul 12 17:15:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Eligible families will begin receiving Child Tax Credit payments starting this Thursday, July 15.\n\nHave questions or need more information? Save this thread 🧵:","date":"Mon Jul 12 17:15:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The new historical marker honoring Nashville’s suffragists was unveiled yesterday in Church Street Park, just across the street from the #TeamCooper office! https://t.co/GdTzCa0SAX","date":"Fri Jul 09 21:32:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/4): To qualify for Medicaid in Tennessee parents must earn less than less than $20,422 for a family of three annually.\n\nAdults without children aren’t eligible all.","date":"Fri Jul 09 20:55:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(4/4): The Tennessee legislature and @GovBillLee aren’t just harming low income adults - 5,000 children in Tennessee would have gained coverage if TN had expanded Medicaid in 2020.","date":"Fri Jul 09 20:55:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/4): Tennessee needs to expand Medicaid. The state’s continued refusal is costing LIVES and leaving billions of dollars in federal funds on the table. https://t.co/MRakUwNR2O","date":"Fri Jul 09 20:55:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/4): Rejecting Medicaid expansion cost the lives of 964 Tennesseans ages 55-64 from 2014 to 2017.\n\nThese people DIED because our state leadership chose politics over people.\n\nThe risks are even more pronounced for people of color, who make up 33% of the coverage gap in the TN.","date":"Fri Jul 09 20:55:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"YES. This executive order will help everything – from free and open internet access, to protecting workers from noncompete clauses, to allowing hearing aids to be sold over the counter, to making prescription drugs more affordable – for EVERYONE.","date":"Fri Jul 09 20:17:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Affordable Care Act was vital in expanding coverage and access to insurance, especially pregnancy-related services.\n\n@HHSGov must clarify that all maternity care for dependents is covered by insurance. https://t.co/xDavZXYsnr","date":"Fri Jul 09 16:40:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Protecting LGBTQ+ Tennesseans from discrimination at school and in the workplace shouldn’t be a partisan issue in 2021.\n\nThe fact that Tennessee’s Attorney General sent this letter is appalling.\n\nhttps://t.co/fKDReO3nae","date":"Thu Jul 08 21:37:16 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I support @WhipClyburn's Affordable, Accessible Internet for All Act that will provide billions in funding to build our country’s high-speed broadband infrastructure. \nhttps://t.co/3YmZlyP25Z via @tennessean","date":"Thu Jul 08 20:14:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Every single Tennessean should have access to broadband no matter which city or county they live in. FDR’s New Deal electrified all of rural America in 10 years, but we can’t get everybody broadband in 30 years? We need big solutions.","date":"Thu Jul 08 20:14:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was great to visit with the awesome @nashtnregister  team today!","date":"Wed Jul 07 21:28:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"TODAY is the last day to apply for federal assistance if you were impacted by the severe weather in Davidson Co. between Mar 25-Apr 3. Ways to apply: \n\nOnline💻: https://t.co/jTgqFUQHlN.\nDownload FEMA app📱: https://t.co/0LWDHTGMPS\nCall FEMA📞: 800-621-3362 or TTY 800-462-7585","date":"Wed Jul 07 17:49:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/3): If you are not required to file a tax return – or are a “nonfiler” – you may still be eligible for the Child Tax Credit. Sign up here: https://t.co/u4JKYwidkw","date":"Wed Jul 07 16:08:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/3): If you have children you may be eligible to receive $250-$300 per child thanks to the Child Tax Credit. Find out if you are eligible here: https://t.co/84Wo5YXUEA","date":"Wed Jul 07 16:08:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/3): If you are eligible to receive the Child Tax Credit, and either your 2019 or 2020 tax return has been processed, check to see if you’re enrolled and update your address, bank account info, and make other changes here: https://t.co/84Wo5YXUEA","date":"Wed Jul 07 16:08:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨HAPPENING NOW🚨","date":"Tue Jul 06 19:34:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Energy Innovation Act act would pave the way toward net zero emissions. Thank you, ⁦@CCLNashville⁩. https://t.co/7tWoC8b78d","date":"Mon Jul 05 18:21:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out my updates from this week as I continue to work for Nashville and Middle TN ⬇️ https://t.co/H74pYNyRMm","date":"Fri Jul 02 20:09:40 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I support banning the federal death penalty and applaud AG Merrick Garland’s decision to freeze federal executions.","date":"Fri Jul 02 19:22:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Evidence has been accumulating for many years that criminal law enforcement is often marred by racism, death penalty trials can be deeply flawed, justice is not speedy, and the executions themselves are sometimes botched.","date":"Fri Jul 02 19:22:05 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #INVESTAct passed the House this week and includes my proposal to end blocked railroad crossings.\n\nToo many Middle Tennesseans are facing safety concerns and inconveniences due to blocked crossings and they should not be made to suffer any longer.","date":"Fri Jul 02 19:10:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It’s about time that Tennessee starts getting these desperately needed funds out the door!","date":"Fri Jul 02 18:57:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨ATTN: If you don’t normally file a tax return, your family may be eligible for monthly Child Tax Credit payments if you have children 17 years old &amp; younger. Payments can be used for expenses like food &amp; childcare.\n\nSign up to receive payments here: https://t.co/u4JKYwidkw","date":"Thu Jul 01 21:23:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We need the John Lewis Voting Rights Advancement Act and the For the People Act before we lose our democracy for good.","date":"Thu Jul 01 17:52:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Voting Rights Act is supposed to protect every American’s right to vote &amp; the Supreme Court weakened it even more today. This Court is more concerned with protecting dark money donors than the right to vote, and it has to stop.","date":"Thu Jul 01 17:52:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Once again, @JamesEKHildreth is delivering the clear-headed message that all Tennesseans need to hear⬇️⬇️⬇️","date":"Thu Jul 01 16:17:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The reckless permitless carry law signed by @GovBillLee goes into effect today.\n\nTennessee already had some of the loosest gun laws in the country and our local prosecutors opposed the legislation – with good reason.\n\nEducation is a huge part of responsible gun ownership.","date":"Thu Jul 01 15:10:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: Child Tax Credit monthly payments will be sent beginning July 15 to help eligible families with basic expenses like:\n\n🥘 Food\n⛽️ Gas\n👶 Childcare\n\nAre you eligible? Follow this link to find out: https://t.co/84Wo5YXUEA","date":"Wed Jun 30 21:32:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Inspectors General are the independent watchdogs of our democracy and we need strong safeguards in place to protect them.","date":"Wed Jun 30 12:48:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’ve been fighting for more protections for IGs for years, including the requirement in @RepMaloney‘s IG Independence and Empowerment Act that IGs can only be removed for cause.","date":"Wed Jun 30 12:48:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Derek Chauvin was sentenced, but we still need more accountability for George Floyd’s murder. The House passed the George Floyd #JusticeinPolicing Act &amp; now the Senate needs to act. Qualified immunity reform, chokehold bans, outlawing racial profiling, &amp; more, are on the line.","date":"Tue Jun 29 15:57:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Bipartisan Infrastructure Framework presented by @POTUS yesterday is long overdue.","date":"Fri Jun 25 20:35:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Infrastructure does not just include roads and bridges – it's expanding access to the internet, environmental protections, and increasing public and private partnerships. There is no question our infrastructure is falling apart, and I am all for a big infrastructure package.","date":"Fri Jun 25 20:35:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Sixth Circuit took a bad situation &amp; made it even worse. I support a $60B refill of the Restaurant Revitalization Fund, &amp; Congress should immediately pass this legislation.\n\nRestaurants, especially minority-owned, that had their awards ripped away desperately need this money.","date":"Fri Jun 25 20:17:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations, @FionaPrine, on your nomination to the National Council on the Arts!\n\nhttps://t.co/UCrhQ1RibF","date":"Fri Jun 25 16:02:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: If you are a homeowner or renter in Davidson Co. with damage or losses caused by the Mar 25-Apr 2 storms in Middle TN, the deadline to apply for @femaregion4 assistance is coming up on July 7.\n\nMore info: https://t.co/jTgqFUQHlN","date":"Fri Jun 25 14:18:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations @WPLN &amp; @meribah for telling the #StoriesThatMatter and winning a #PeabodyAward!","date":"Thu Jun 24 23:46:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Laws like this are the reason the #ForThePeopleAct is necessary – essential – to saving our democracy.","date":"Thu Jun 24 14:00:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The same day the Senate blocked the #ForThePeopleAct by using the Jim Crow relic, the filibuster, the Sixth Circuit reinstated one of Tennessee’s voter suppression laws disallowing first-time voters from voting absentee.","date":"Thu Jun 24 13:58:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Our roads and bridges are in desperate need of work.\n\nIt is crucial that we pass the #INVESTAct now. https://t.co/X8066iRq0K","date":"Wed Jun 23 18:29:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We can do this. Find a vaccine site near you: https://t.co/preNQrU7Uq","date":"Wed Jun 23 15:13:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We are seeing signs of hope as people continue to get the #COVID19 vaccine.\n\nIt was great to be with @FLOTUS, @BradPaisley, &amp; @Kimwilliamspais as our community showed up – from @DavidsonClerk to @SiloamFHC – to support getting every Tennessean vaccinated. https://t.co/BmaSn4vnaE","date":"Wed Jun 23 15:13:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #ForThePeople Act is too important to let a Jim Crow relic like the Senate filibuster get in the way. \n\nWe need these voting rights protections now, which Tennessee’s two Senators have proven they won’t support.\n\nThe Senate must pass this legislation to save our democracy.","date":"Tue Jun 22 23:05:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Welcome to Nashville, @FLOTUS! https://t.co/DBZINntQzi","date":"Tue Jun 22 22:49:05 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"WATCH: First Lady Dr. Jill Biden lands in Nashville for a #COVID19 vaccine event. Welcome to Nashville, @FLOTUS! https://t.co/y0UqP8P1NQ","date":"Tue Jun 22 22:44:04 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Families are scrambling to find a way to stay in their homes before the eviction moratorium expires on June 30.\n\nMany are still struggling &amp; the rental assistance program is helpful, but aid isn’t getting to people fast enough. \n\n@CDCgov should immediately extend the moratorium.","date":"Tue Jun 22 21:53:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This past weekend I had the honor of kicking off #Juneteenth with @FawnWeaver and the awesome #WhiskeyFamily at the ribbon cutting for @UncleNearest! https://t.co/Z0XmLbqGpY","date":"Tue Jun 22 00:03:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you, @UrbanLeagueULMT, and thank you for all of the awesome services and programs you provide to Middle Tennesseans!","date":"Mon Jun 21 16:31:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"TOMORROW: Still need to get your #COVID19 vaccine?\n\nCome get your vaccine and see @FLOTUS in Nashville from 5-7pm tomorrow night at Ole Smoky Distillery &amp; Yee-Haw Brewing Co. at 6th and Peabody.\n\nRegister for a vaccine appointment here: https://t.co/8TbVPsOKZL https://t.co/ntjrUuPnR3","date":"Mon Jun 21 16:08:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you, @Vanderbilt_GR!","date":"Mon Jun 21 15:15:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you, @LeaderHoyer, and thank you for your leadership of @HouseDemocrats!","date":"Mon Jun 21 14:46:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out my updates from this week as I continue to work for Nashville and Middle TN ⬇️ https://t.co/uPFTS8f9Z8","date":"Thu Jun 17 22:50:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The law authorizing the use of U.S. military force in Iraq is way out of date and should be repealed, so I voted to do that today.","date":"Thu Jun 17 22:34:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We finally have a President who can be trusted not to abuse his authority but Congress still needs to set limits on U.S. military actions around the world.","date":"Thu Jun 17 22:34:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This lawsuit was an indefensible waste of taxpayer money. I’m glad the Supreme Court saw reason where Tennessee couldn’t. Instead of pointless attacks on the ACA, our state leaders should focus on improving access to affordable healthcare – starting with Medicaid expansion.","date":"Thu Jun 17 15:11:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tonight I voted for the Juneteenth National Independence Day Act, which recognizes and commemorates the end of slavery in the U.S.\n\nIts passage is long overdue, and I look forward to @POTUS signing this landmark bill into law.","date":"Wed Jun 16 23:38:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’ve heard from many Nashville venues since the #COVID19 pandemic began, and we have to help them keep the doors open.","date":"Wed Jun 16 21:23:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I have asked @SBAgov again, this time with 200+ of my colleagues, to expedite the release of funds to beneficiaries of the Shuttered Venue Operators Grant (SVOG) program and provide answers to the questions below in a timely manner. https://t.co/fvjDjUIdpo","date":"Wed Jun 16 21:23:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Our data collection on violence against LGBTQ+ Americans is inadequate. It’s past time we give states the resources they need to collect data &amp; track violence against the LGBTQ+ community. I'm proud to cosponsor @RepSeanMaloney's #EssentialDataAct. This bill could save lives.","date":"Tue Jun 15 20:50:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, we honor our national flag and the core values it represents: unity, diversity and integrity. \n \n#FlagDay https://t.co/eJircprGrf","date":"Mon Jun 14 22:06:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Watch my full comments on The SACKLER Act and holding the Sackler family accountable for the opioid epidemic at the @OversightDems hearing: \n\nhttps://t.co/otN2zMWkWk","date":"Mon Jun 14 20:57:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"With the Sackler family, what we had here in America was a drug cartel operating within our own borders protected by U.S. law.","date":"Mon Jun 14 20:57:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Employees can also use leave to get #COVID19 vaccinations and take time off to recover from any temporary side effects from the shot.\n\nMore info: https://t.co/SD5vCjF7kD","date":"Mon Jun 14 17:13:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thanks to the #AmericanRescuePlan, the #IRS continues to provide tax credits to help small businesses cover the costs of sick and family leave for employees.","date":"Mon Jun 14 17:13:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville’s live music venues &amp; theaters are in dire need of help through the Shuttered Venues Operators Grant program. I’ve urged the @SBAgov Administrator to immediately expedite the applications of our cultural centers. Music City can’t lose these treasures. https://t.co/zMoHRZGooc","date":"Wed Jun 09 18:30:46 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: @TennesseeBar, @TALStweet, @fema, the American Bar Association Young Lawyers Division, &amp; other local orgs have joined forces to support people affected by the severe storms, tornadoes, and flooding in Davidson, Williamson, &amp; Wilson Counties between March 25-April 3, 2021.","date":"Tue Jun 08 19:29:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"A legal assistance hotline is now available to support survivors. Low-income individuals facing legal issues as a result of these severe storms and flooding may call 1-844-HELP4TN (1-844-435-7486). https://t.co/zAguaANeRs","date":"Tue Jun 08 19:29:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville and Middle Tennessee are home to one of the most awesome immigrant communities in the country. This #ImmigrantHeritageMonth we honor traditions, cultures, and values the immigrant community brings to our great state. #WeAreHome #CelebrateImmigrants https://t.co/eoJSDgmXPw","date":"Tue Jun 08 19:22:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"DeJoy must go.\n\nNow that we have the attention of members we must pass @RepMaloney's long overdue Postal Service Reform Act.","date":"Mon Jun 07 16:20:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out my updates from this week as I continue to work for Nashville and Middle TN ⬇️ https://t.co/IjoYkWutzM","date":"Fri Jun 04 21:16:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We #WearOrange during the month of June to honor the lives that have been needlessly taken from us due to gun violence. https://t.co/6WtRiZm7rC","date":"Fri Jun 04 20:31:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/4): By attaching my &amp; @gracenapolitano's bill to protect drivers' rights vs. railroads to this must-pass bill, we improve our chances of beating the railroads whose lobbyists have railroaded Congress for almost 150 years.\n\nhttps://t.co/j8t2KwCJJx","date":"Fri Jun 04 19:40:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(4/4): Nashville and Middle Tennessee should not suffer because railroads think they own the world.\n\nTrains, cars and trucks need to respect each other.","date":"Fri Jun 04 19:40:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/4): Freight railroads have had ample time to respect drivers; now it’s up to Congress to step in &amp; fix the problem. I thank @RepPeterDeFazio &amp; @RepDonaldPayne for including my proposal in this new bill, as well as former Chairman Lapinski for working with me on this solution.","date":"Fri Jun 04 19:40:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/4): Middle Tennesseans know all about the inconveniences and safety concerns of rail crossings that are blocked for unreasonably long times, sometimes even hours. It’s frustrating and dangerous.","date":"Fri Jun 04 19:40:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"USPS's Louis DeJoy reportedly faces new FBI investigation https://t.co/rn0vjASZRu via @msnbc","date":"Fri Jun 04 16:51:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"FBI investigating campaign contributions tied to Postmaster General Louis DeJoy's former business https://t.co/NqYnxxty4M via @usatoday","date":"Fri Jun 04 16:50:54 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We know the #COVID19 pandemic has disproportionately affected low-income and minority communities. I’m thankful this funding will go to helping ensure everyone gets vaccinated and has access to the care they need.\n\nhttps://t.co/650axi7zBa","date":"Fri Jun 04 13:59:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I hope the FBI conducts a thorough and swift investigation.\n\nDeJoy should have been removed as Postmaster General months ago.\n\nhttps://t.co/X3Zog8KFKM","date":"Thu Jun 03 18:11:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Sen. Jim Risch is stopping millions in humanitarian aid for Palestinians that Congress passed last year and it was signed by the president.\n\nI joined @RepRaskin and my @HouseDemocrats colleagues to ask Sen. Risch to stop blocking this aid.","date":"Wed Jun 02 19:12:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Members of our military put their lives at risk to protect us every day.\n\nOur service members and their transgender dependents should not be denied access to the health care they need regardless of where they have been stationed.","date":"Wed Jun 02 18:27:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#HappyPrideMonth! https://t.co/hHWBuSiCH7","date":"Tue Jun 01 21:51:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"OTD: June 1, 1796, Tennessee was the 16th state admitted to the Union! Celebrate by exploring maps of the Volunteer State online.\n\nThere are commercial maps, topographical maps, birds eye views and more! #Tennessee #Maps #LibraryofCongress\n\nhttps://t.co/v8JAYMl4mF","date":"Tue Jun 01 17:58:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"There is an urgent need to invest in physical &amp; human infrastructure.\n\nWith the proposed investments in the #BidenBudget we can, and will, do both. https://t.co/ckhRTlL4wZ","date":"Tue Jun 01 16:57:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Memorial Day gives us time to reflect and honor those who gave the ultimate sacrifice for our country. I’m always reminded of the great program empowering veterans through songwriting at @operationsong.\n\nTake a listen to “The Last Monday in May:” https://t.co/ju8SbAmppv","date":"Mon May 31 15:10:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out my updates from this week as I continue to work for Nashville and Middle TN ⬇️ https://t.co/79hVEzv9Pi","date":"Fri May 28 21:38:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am glad that six Republican senators supported an investigation of January 6th, but I wish Tennessee’s senators had joined them. I think our previous Republican senators would have supported it. \n\nIt’s a shame that Trumpism has replaced Republicanism.","date":"Fri May 28 20:39:05 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We must do everything possible to fight the alarming rise of antisemitism. I joined @janshcakowsky @repraskin @repjayapal and others in a letter to @secblinken urging @StateDept to use multiple definitions of antisemitism to stop hatred directed at Jews here and around the world. https://t.co/SnPQqJ60qp","date":"Fri May 28 20:10:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨 CALLING ALL FORMER JIMTERNS: We want to reconnect with you! Join us this fall for a reunion with all former interns. Contact us before June 14 to participate:\n\n📱: (615) 208-4182\n📧: JimternUpdates@gmail.com https://t.co/Ip4jLHkWys","date":"Fri May 28 15:59:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Trump administration’s rollback of rules requiring certain tax-exempt groups from disclosing donations to campaigns needs to be reversed. My colleagues and I are asking @USTreasury and #IRS to reinstate the rule and bring more transparency to our elections. https://t.co/lATVuMjT0I","date":"Thu May 27 16:32:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #IRS needs every tool at its disposal to ensure organizations are complying with the law when donating to political campaigns.","date":"Thu May 27 16:32:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@SBAGov is accepting applications for its Community Navigator Pilot Program included in the #AmericanRescuePlan.\n\nNonprofits, state, local, and tribal governments, and community organizations are encouraged to apply.\n\nMore info: https://t.co/6HjOwKCKdo","date":"Wed May 26 21:47:53 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today I joined my colleagues in asking @ICAO to investigate Belarus’ unprecedented use of military aircraft to intercept and force Ryanair Flight 4978 to land. https://t.co/8FiCgKd5Eh","date":"Wed May 26 20:56:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I support steps to rebuild this relationship in a way that provides Palestinians and Israelis alike with respect, security, and dignity.","date":"Wed May 26 20:25:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yesterday, the Biden administration announced its plans to reopen the U.S. consulate in Jerusalem after its closure by former President Trump. For more than two decades, this consulate was an important diplomatic link between the United States and the Palestinian Authority.","date":"Wed May 26 20:25:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Funeral assistance for #COVID19 related funeral expenses is available from @fema. To date, Tennesseans have received $300K+ in assistance.\n\nMore info on eligibility and how to apply: https://t.co/1uUyk4PV8y","date":"Wed May 26 16:54:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This statement is ignorant and reprehensible. https://t.co/0nhMSgJl1R","date":"Tue May 25 19:22:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am working with @Bradford4D13, @yarbro &amp; @RepMikeStewart on this mass eviction.\n\nThis is terribly wrong and our entire community is doing everything we can to protect these tenants.","date":"Tue May 25 18:10:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out my updates from this week as I continue to work for Nashville and Middle TN ⬇️ https://t.co/XAEGM0yjQc","date":"Fri May 21 21:33:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/2): I urge regional leaders to build on this ceasefire, find ways to ensure a lasting peace, and prevent the next cycle of violence.","date":"Fri May 21 19:15:59 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/2): I welcome the news of a ceasefire between Israel and Hamas. For civilians on both sides of the border who had to bear the brunt of this conflict, it didn’t come a moment too soon.","date":"Fri May 21 19:15:59 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"All faiths embrace the stranger, and separating children from their parents is the opposite of that. \n\nTennessee is the Volunteer State and our state leaders should be helping @POTUS reunite families and repair the broken immigration system, not turning away children.","date":"Fri May 21 18:21:26 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"REMINDER: If you are a renter in Cheatham or Dickson Co. you may qualify for rental assistance under the #AmericanRescuePlan due to the #COVID19 pandemic.\n\nMore info: https://t.co/aY6h97WBFG","date":"Thu May 20 21:52:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"If you are a renter in Davidson Co. you may qualify for rental assistance under the #AmericanRescuePlan due to the #COVID19 pandemic.\n\nMore info: https://t.co/Tex3WouSD5","date":"Thu May 20 21:52:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"On #MentalHealthAction Day, we join together to break through stigma, express compassion for those who struggle with mental health issues and draw attention to the proven methods that can help change their lives for the better. https://t.co/mpXT2m392i","date":"Thu May 20 17:04:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@T_E_M_A and @fema will open a Multi-Agency Recovery Center this weekend in Nashville.\n\nIf you were impacted by the March-April flooding events, visit @plazamariachiMC  this Saturday from 10am-6pm. More info⬇️ https://t.co/kDaC6UOfNk","date":"Wed May 19 21:46:46 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"January 6, 2021, was one of the darkest days in our history. Our Capitol was attacked by insurrectionists, multiple people died, and over 140 members of law enforcement were physically harmed.\n\nWe must pass the emergency security supplemental to protect the Capitol. https://t.co/P6rFk5AQhq","date":"Wed May 19 21:40:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We can’t #StopAsianHate if we don’t understand the problem.\n\nI was proud to join my @CAPAC colleagues in voting for the #COVID19 Hate Crimes Act and look forward to @POTUS signing it into law. https://t.co/4prg7MDWNj","date":"Wed May 19 21:13:54 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: The deadline to apply for the Restaurant Revitalization Fund is coming up on Monday, May 24. \n\nMore info &amp; apply here: https://t.co/OyJT9qKdy4","date":"Wed May 19 21:01:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Davidson Co. residents whose homes are uninhabitable due to the Mar 25-Apr 3 storms &amp; flooding may be eligible for temp rental assistance from @fema. The money can pay monthly rent, a security deposit, or utility bills. To apply call 800-621-3362 or visit https://t.co/HdnuoDKFDF","date":"Wed May 19 19:21:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This bill is unconstitutional, cruel, and takes Tennessee backward.\n\nhttps://t.co/RvO78q02ET","date":"Tue May 18 21:34:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Join us Monday, May 24 at 6:00pm CT for another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies.” \n\nThe eighth in the series: “The Ongoing Fight for Women’s Rights.” \n\nRegister here: https://t.co/T33uWnes65 https://t.co/Syg6TVKbqd","date":"Tue May 18 20:33:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee and nine other states have \"trigger bans\" in place, which would ban abortion immediately if Roe is overturned.\n\nThis SCOTUS case is a direct challenge to Roe and women’s rights to make decisions for their own health.","date":"Tue May 18 20:18:20 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was an honor to attend and speak at Cheatham County Veterans Memorial Park opening last weekend. \n\nThis monument will be seen by every passenger driving by in a car, and they will look, they will learn and they will remember.\n\nhttps://t.co/JHfLbLNaHN","date":"Tue May 18 18:39:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I'm glad @POTUS approved the Major Disaster Declaration for Nashville &amp; Middle Tennesseans. The storms we had in March and April were extreme, and I will continue to sponsor and vote for legislation like the Green New Deal to help us fight climate change.\n\nhttps://t.co/jIHzbgXBT6","date":"Tue May 18 16:21:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out my updates from this week as I continue to work for Nashville and Middle TN ⬇️ https://t.co/4TtKUlRzr6","date":"Fri May 14 23:14:54 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Read my statement on current Israeli-Palestinian relations: https://t.co/AaPgHbsELh","date":"Fri May 14 18:14:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The research, education, and work @MeharryMedical provides to Nashville &amp; beyond saves lives. I’m glad this funding will allow them to continue their work. \n\nhttps://t.co/uQrHPcMbyU","date":"Fri May 14 16:41:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@MeharryMedical is one of our four awesome Historically Black Colleges and Universities here in Nashville, and the only medical school.","date":"Fri May 14 16:41:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Eid Mubarak to all of those celebrating. May peace and love be with you! https://t.co/jVUbFrbkrp","date":"Thu May 13 22:40:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"@POTUS' latest executive order will help stem those attacks but this is going to be a long, hard-fought war against the criminal rings—many state-sponsored—that are trying to turn our own technology against us.","date":"Thu May 13 20:55:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Everyone and everything on the internet are vulnerable to attack like the Colonial Pipeline extortion, and worse.","date":"Thu May 13 20:55:05 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today @OversightDems advanced a bipartisan bill to get @USPS back on solid financial footing. The Postal Service is a vital resource for people to get prescriptions, pay bills, &amp; communicate.\n\nI look forward to supporting this bill when it comes to the House floor for a vote.","date":"Thu May 13 18:46:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #AmericanRescuePlan gives Tennessee $6B to tackle the #COVID19 crisis head-on, save lives, and support those most in need.\n\nThis is part of the $350B in state and local govt relief funds from the @USTreasury. https://t.co/kInx3xVywo","date":"Thu May 13 18:17:46 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville has some of the best public libraries in the country thanks to @NowatNPL.\n\nAs a supporter of the Build America's Libraries Act, I'm proud to celebrate the library workers &amp; facilities that serve our community this United for Infrastructure Week as we #BuildLibraries!","date":"Thu May 13 17:58:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Are you enrolled in Medicaid or SNAP benefits? Have you lost a job, or seen your income reduced in the last year? You may qualify for a discount on your internet bill under the new Emergency Broadband Benefit program. \n\nEnrollment is open now: https://t.co/EEvtCF3olq","date":"Thu May 13 17:31:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Access to the internet = Access to opportunity.\n\nIt’s time to close the #DigitalDivide and ensure every household has access to reliable, affordable internet service. That’s why I support the Emergency Broadband Benefit.\n\nEnrollment is open now: https://t.co/a77p3ZFyFb","date":"Thu May 13 17:05:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@USTreasury released the #AmericanRescuePlan’s $350B to support state &amp; local govts #COVID19 response, help American families &amp; businesses, and address America’s long-term inequities &amp; systemic challenges that have been highlighted by the pandemic: https://t.co/Jv6i0efsXZ","date":"Thu May 13 16:21:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nearly 150K children here in Middle TN could benefit from the expanded #ChildTaxCredit in the American Rescue Plan!\n\nMake sure to file your taxes to get your payments as soon as possible: https://t.co/ZXq2j04fNg https://t.co/ILEqZ3dPjb","date":"Thu May 13 15:53:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Are you a homebound resident in Davidson County?\n\nRequest an in-home appt to receive a #COVID19 vaccine by calling or emailing @NashvilleHealth: \n\nEmail📧: homebound.vaccination@Nashville.gov\nCall weekdays from 8am-5pm📞: 615-862-7777","date":"Thu May 13 14:53:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: Today I announced a leadership transition and new staff roles!\n\nRead more here: https://t.co/5tNNvof3hH https://t.co/QagBHPXmxJ","date":"Wed May 12 20:58:04 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(6/6): Jason is the right person to help me navigate my many responsibilities there, as well as continue the recovery work in our community as we get through the pandemic and grow Middle Tennessee in the best possible way.","date":"Wed May 12 18:32:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(5/6): @JJLumia is respected both in Nashville and in Washington, where I am now serving on a record four committees, more than any other member of Congress.","date":"Wed May 12 18:32:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(4/6): Cheryl will run the Nashville office, and will be my top local advisor. Everyone trusts her judgment and her ability to connect people and solve problems.","date":"Wed May 12 18:32:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/6): @CherylMayes is a wonderful person, totally focused on the needs of the community, and a true leader. I couldn't be happier that she has agreed to take on this key role.","date":"Wed May 12 18:32:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/6): Lisa is energetic, determined, and knows how to get things done. She is a leader in her own right in our community, and I will miss her daily counsel.","date":"Wed May 12 18:32:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/6): @LisaQuigleyTN is my confidant, and the best strategist I’ve ever worked with. She is kind, compassionate, smart, and believes that government can work for everyone.\n\nhttps://t.co/5tNNvof3hH","date":"Wed May 12 18:32:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I voted to give Tennesseans this help during the pandemic, but Gov. Lee is taking it away. Is that how he would want to be treated? Is he obeying the Golden Rule? What would Jesus do?","date":"Wed May 12 00:26:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Why would Gov. Lee take $300 a week from unemployed Tennesseans? To force them to go back to work, even if they are sick, they have no child care, or there are no jobs for them?","date":"Wed May 12 00:26:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"More than 1 million Americans have signed up for health insurance during @POTUS’ ACA Special Enrollment Period!\n\nEnroll or change your current plan now thru August 15: https://t.co/FP8noubqk4","date":"Tue May 11 17:26:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thanks @ZerlinaMaxwell for the opportunity to discuss the #ForThePeopleAct!","date":"Tue May 11 13:39:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am thankful @POTUS approved a Major Disaster Declaration for Tennessee following the severe storms, tornadoes, and flooding we had in March &amp; early April here in Middle TN.\n\nWe’ve been through a lot, but help is on the way and we are #NashvilleStrong.\n\nhttps://t.co/HdnuoDKFDF","date":"Mon May 10 20:39:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Read my op-ed on why we need the #ForThePeopleAct: \n\nEnact 'For the People Act' because Tennessee is disenfranchising its citizens | Opinion https://t.co/ra59RLCvZy via @tennessean","date":"Mon May 10 19:46:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out my updates from this week as I continue to work for Nashville and Middle TN ⬇️ https://t.co/YREpCi8Lan","date":"Fri May 07 20:28:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: Rep. @JoaquinCastrotx and I led the @HASCDemocrats and @HouseForeign joint subcommittee hearing on rules governing space activities earlier this week.\n\n📺 Watch here: https://t.co/PSTg7Qtwtz","date":"Fri May 07 16:41:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I was honored to pay tribute to my friend and mentor, the late Senator Thelma Harper. Thelma was the greatest of public servants and a powerful force. She will be sorely missed. https://t.co/HK6SnqJM2U","date":"Thu May 06 20:06:16 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/2): Once again our legislature is competing for the title of cruelest in America, this time by cutting unemployment benefits to 12 weeks in length. We already had about the lowest dollar unemployment benefit, now we will also have the shortest.","date":"Thu May 06 15:33:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/2): Why does Tennessee, with so many Christians and others of religious faith, choose NOT to live by the Golden Rule of treating others as you would like to be treated? Why do we choose cruelty over compassion?\n\nhttps://t.co/LZyM85jnNB","date":"Thu May 06 15:33:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Using blueprints and a home printer to make fully functional, completely untraceable firearms is a recipe for putting guns into the hands of dangerous individuals, and makes us less safe. https://t.co/RWmkbYMq91","date":"Wed May 05 20:25:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today I joined @SenMarkey, @RepGraceMeng and my colleagues in a letter to @POTUS urging him to continue the strict regulatory controls on blueprint 3-D firearms.","date":"Wed May 05 20:25:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations Dr. @alexjahangir! Thank you for your outstanding leadership in the fight against #COVID19 and for giving Nashvillians hope as we begin a return to normalcy.","date":"Wed May 05 18:52:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Happy #TeacherAppreciationWeek! As challenging as this last year has been, our educators continue to tirelessly work to ensure students’ success. I’m grateful for all the awesome teachers that guide and inspire us every day! https://t.co/qdnVzdy6eL","date":"Wed May 05 15:34:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: Last month I spoke with @UrbanLeagueULMT about the American Rescue Plan.\n\nWatch here: https://t.co/Jvrxar4QP1","date":"Mon May 03 18:29:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today is the last day to register for the next staff-led session of \"Let's Talk: Conversations to Ensure Equitable &amp; Just Policies.\"\n\nThe 7th in the series is tomorrow night, focusing on: \"Redistricting: Will Nashville’s influence disappear?\"\n\nRegister: https://t.co/Pt9Uzz3mZJ https://t.co/AmpQmdbXLP","date":"Mon May 03 16:59:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out my updates from this week as I continue to work for Nashville and Middle TN: https://t.co/fg2dtZksi6","date":"Fri Apr 30 20:53:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was new and different, but a wonderful, unifying night for America. #JointAddress #JointSession","date":"Thu Apr 29 02:17:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@POTUS did great. I’ve never heard a President speak so clearly, comfortingly, or be so challenging. For the first time in our country’s history, two women were seated behind the president and the chamber was nearly empty due to #COVID19.","date":"Thu Apr 29 02:17:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I applaud @POTUS for taking executive action to raise the minimum wage for people working on federal contracts.\n\nWhile a step in the right direction, we have more work to do and need to vote to raise the nationwide minimum wage this Congress.","date":"Wed Apr 28 19:19:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This sounds like a dictatorship to me. We are supposed to have an independent judiciary, not a court under the thumb of the executive or legislative branches.\n\nThis two-legged stool is not only ridiculous but unconstitutional.\n\nvia @TNLookout: \nhttps://t.co/LSTpJAi4GH","date":"Wed Apr 28 18:28:54 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Join us Tuesday, May 4 at 6:00pm CT for another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies.” \n\nThe seventh in the series: “Redistricting: Will Nashville’s influence disappear?” \n\nRegister here: https://t.co/ZGrw0HC4nr https://t.co/Hix7lXoXR7","date":"Mon Apr 26 20:35:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/3): The previous administration pushed the block grant through at the last minute. I am glad that Tennesseans are suing to stop the damage.","date":"Wed Apr 28 16:06:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/3): The block grant is a dangerous experiment, especially in the middle of a pandemic. Tennessee rejects $1B each year from the federal government by not expanding Medicaid.","date":"Wed Apr 28 16:06:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/3): Worse, Tennessee is now rejecting an extra $1.26 billion on top of that; all Tennessee has to do to get the money is to do the right thing: stop harming low-income people who are desperate for health insurance.","date":"Wed Apr 28 16:06:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"While I wish we could all be at the address in-person, I’m honored Juliana accepted the invitation to view virtually and share all of the awesome work they are doing.","date":"Wed Apr 28 15:31:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Juliana and the amazing team at @conexion_tn and @CasaAzafranTN provided life-saving resources to our growing and vibrant Hispanic community while we battled the #COVID19 pandemic.\n\nhttps://t.co/5SzpDeaH8M","date":"Wed Apr 28 15:31:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The executive action yesterday by @POTUS will help ensure we continue to protect and advance rights for workers. The Task Force on Worker Organizing and Empowerment is the next step to empower workers across our country.","date":"Tue Apr 27 16:17:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Join us Tuesday, May 4 at 6:00pm CT for another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies.” \n\nThe seventh in the series: “Redistricting: Will Nashville’s influence disappear?” \n\nRegister here: https://t.co/ZGrw0HC4nr https://t.co/Hix7lXoXR7","date":"Mon Apr 26 20:35:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"HAPPENING NOW: @SBAgov's Shuttered Venue Operators Grant portal is live and eligible businesses can apply here:\n\nhttps://t.co/xzb1HVXiBj","date":"Mon Apr 26 17:57:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out my updates from last week as I continue to work for Nashville and Middle TN: https://t.co/DracqnhHb7","date":"Mon Apr 26 17:22:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Senator Thelma Harper was a trailblazing, strong force for good. She made the State of Tennessee, Nashville, and anyone who met her better. She will be sorely missed.","date":"Thu Apr 22 20:35:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you Rep. @RoKhanna &amp; @OversightDems for holding this important hearing on #EarthDay .\n\nFor years I’ve said that we should repeal fossil fuel subsidies! It is costing our country billions of dollars every year &amp; we shouldn’t be paying these companies to destroy our planet.","date":"Thu Apr 22 20:18:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"HAPPENING NOW: Watch @OversightDems Subcommittee on the Environment #EarthDay hearing on actions we can take on the climate crisis.\n\nI agree with witness and activist @GretaThunberg, we need to \"listen and act on the science.\"\n\nWatch here: https://t.co/JEHitGwaGI https://t.co/yu0WDTJKCR","date":"Thu Apr 22 16:02:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This #EarthDay we celebrate our home, while  recognizing our responsibility to protect it. \n\n@HouseDemocrats are working to #ActOnClimate because we and future generations need a healthy Earth – forever. https://t.co/DEyo3d0ITj","date":"Thu Apr 22 15:40:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We’re facing public health, economic, and climate crises. We’re in the midst of a racial justice reckoning. \n\nWe can't afford to let Republicans in the Senate stall progress. I joined @RepCori in calling on the Senate to #EndTheFilibuster. https://t.co/GyEc7r7IfF","date":"Thu Apr 22 14:05:59 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am thankful @POTUS rescinded the Muslim Ban earlier this year and am proud to vote for the #NoBanAct today.","date":"Wed Apr 21 20:41:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville is home to some of the best music venues in the country and many of them are on the verge of disappearing forever. We will continue working with the Small Business Administration to assist any way we can.\n\nhttps://t.co/zIuCP7tpAa","date":"Wed Apr 21 20:15:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I know @SBAgov is working tirelessly to get the SVOG portal up and running again, and I hope they are able to meet the Biden Administration’s goal of reopening it by the end of next week.","date":"Wed Apr 21 20:15:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: ¡CADA PERSONA MAYOR DE 16 AÑOS ES ELEGIBLE PARA UNA VACUNA!\n\nPara reservar una cita en su departamento de salud local en TN, visite https://t.co/KiYSFTdNAt.\n\nTambién hay cientos de otros sitios en toda la comunidad a través de https://t.co/NBHJ6Je5SK.","date":"Wed Apr 21 18:49:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Last week I joined @RepJayapal and my colleagues in asking @POTUS to take concrete steps prioritizing the health and safety of unaccompanied children who enter our country.","date":"Wed Apr 21 16:23:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The previous Administration took us one giant leap backward in our efforts to find safe solutions and we have to work together to make sure we protect children.","date":"Wed Apr 21 16:23:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Guilty on all counts.\n\n#JusticeForGeorgeFloyd is served.","date":"Tue Apr 20 21:50:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: Every person in the U.S. age 16+ is eligible for a #COVID19 vaccine!\n\nTo book an appt at your local health department in Tennessee, visit https://t.co/KiYSFSWcbT.\n\nThere are also hundreds of other sites throughout the community via https://t.co/NBHJ6JvGKi.","date":"Mon Apr 19 17:25:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee is one of many states where @USDA will test an online purchasing program for SNAP beneficiaries. \n\nMore information on how to participate can be found here: https://t.co/hHLSwS6M6C","date":"Mon Apr 19 16:19:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today is the last day to register for the next staff-led session of \"Let's Talk: Conversations to Ensure Equitable &amp; Just Policies.\" \n\nThe 6th in the series is tomorrow night, focusing on: \"Gun Violence in America: A Raging Epidemic.\" \n\nRegister here: https://t.co/U8PzdMWTrh","date":"Mon Apr 19 16:03:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I expressed my concern about how Gov. Lee was handling the rollout of P-EBT cards on three different occasions last year and have seen only marginal improvements. Our neighbors did it; why can’t we?","date":"Fri Apr 16 14:09:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Unfortunately, our state has a terrible track record of getting federal assistance to Tennesseans in need.","date":"Fri Apr 16 14:09:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Grateful for the approval of our work, together, in Nashville.\n\n#VanderbiltPoll https://t.co/lo0ndS2yuq","date":"Thu Apr 15 21:45:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Along with @HouseDemocrats, I voted for the #PaycheckFairnessAct today.\n\nWe need equal pay for equal work.","date":"Thu Apr 15 21:19:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today I joined @OversightDems in voting for Rep. @EleanorNorton's #DCStatehood bill in committee.\n\nI voted for the bill last year when it passed the House and I look forward to supporting it again when it comes to the floor. https://t.co/xo3zOjEr8R","date":"Wed Apr 14 19:01:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Join #TeamCooper Tuesday, April 20 at 6:00pm CT for another staff-led session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies.”\n\nThe 6th in the series: “Gun Violence in America: A Raging Epidemic.”\n\nRegister here: https://t.co/3vJsbOwfmu https://t.co/3c3iwp4ssB","date":"Wed Apr 14 18:27:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Join @OversightDems as we mark up and vote as a committee on @EleanorNorton’s #DCstatehood bill: https://t.co/9614bBw8r3","date":"Wed Apr 14 16:32:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/3): Tennessee’s gun laws are now some of the loosest in the nation. We are less safe. How many more gun deaths must we suffer before we curb gun violence?\n\nhttps://t.co/3uYnWQmBOR","date":"Tue Apr 13 22:00:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/3): A wonderful, hardworking Middle Tennessee woman and her daughter were murdered. Another murder happened in a Knoxville high school, and the last resulted in the death of a young girl.","date":"Tue Apr 13 22:00:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/3): Less than one week since Governor Lee signed the reckless \"permitless carry\" bill into law, a bill allowing handguns to be carried without any training or permit, we have had three major acts of gun violence in Tennessee.","date":"Tue Apr 13 22:00:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The House passed the George Floyd #JusticeInPolicingAct, which will help us reimagine policing in America. The Senate must pass this bill now so @POTUS can sign it into law.","date":"Tue Apr 13 21:21:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Daunte Wright’s life was cut short at the hands of police just 10 miles from the Derek Chauvin trial. A traffic stop should never be a death sentence for Black people and it has to stop.","date":"Tue Apr 13 21:21:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"My heart is with @TNAFLCIO and the union community as Middle Tennessee mourns the loss of such an incredible person.\n\nAn intentional act of gun violence cut the lives of Debbie and her daughter, Marie, way too short.","date":"Tue Apr 13 00:39:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I had the honor of working with Debbie for more than a decade and she was one of the hardest working, caring souls I’ve ever known.","date":"Tue Apr 13 00:39:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Ramadan Mubarak to all those celebrating. May your month be filled with blessings and peace! https://t.co/LCy9M06VEV","date":"Mon Apr 12 17:14:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Some members of Sackler family under fire over ties to opioids https://t.co/O6jSl6bNYP","date":"Mon Apr 12 15:54:04 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The House passed the Paycheck Fairness Act last year but the Senate never voted on it. Women are paid 82 cents for every $1 paid to men &amp; for Black women, it’s only 62 cents for every $1. I'm glad the PFA is a priority for this Admin &amp; I look forward to a vote in the House soon.","date":"Thu Jan 28 18:35:52 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Judge Todd Campbell was brilliant and humble.\n\nMy prayers are with Margaret, who cared for him so well, right through the end. Seth and Holt have lost a dad; the community has lost a great legal mind and a superb jurist.","date":"Mon Apr 12 14:12:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Judge Todd Campbell was brilliant and humble.\n\nMy prayers are with Margaret, who cared for him so well, right through the end. Seth and Holt have lost a dad; the community has lost a great legal mind and a superb jurist.","date":"Sun Apr 11 20:19:48 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"JUST IN: Due to technical difficulties, @SBAGov has paused the SVOG application portal. My office has been in touch with the SBA about the problem.\n\nApplicants may continue to register for a new account: https://t.co/xzb1HVXiBj","date":"Thu Apr 08 21:05:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The House passed expanded background check bills last month that we still need the Senate to bring up for a vote.\n\nhttps://t.co/6U0Be9pPDC","date":"Thu Apr 08 20:23:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@POTUS' actions today will undoubtedly save lives, especially here in Middle Tennessee where our governor just signed a bill to allow the carrying of firearms without a permit.","date":"Thu Apr 08 20:23:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"On this #HolocaustRemembranceDay, #WeRemember the hate that took the lives of more than 6 million innocent Jews. It must never be allowed to repeat itself.\n\nPause and watch as the @HolocaustMuseum remembers one of the darkest times in our world’s history: \nhttps://t.co/8X5unFMJZW","date":"Thu Apr 08 18:59:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee Republicans can complain all they want but the stimulus bill is hugely popular with 70% of voters.\n\nLet the courts decide the technical issues but keep the economy rolling.","date":"Thu Apr 08 16:43:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Our children still fear drinking lead in our water. For American to be No. 1 we must invest in rebuilding America. That not only creates tons of jobs, but a better future for all.","date":"Thu Apr 08 16:20:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Everybody knows that American roads, bridges, internet, electricity, sewers, airports, etc., are falling behind the developed world. Engineers give us a C or D for our infrastructure. Other countries have trains that go 200 mph and we can’t.","date":"Thu Apr 08 16:20:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨ATTN: First Baptist Church South Inglewood and Mt. Bethel Baptist Church will host a one dose vaccination event this Saturday, April 10. Walk-ins are welcome and available to anyone over the age of 16. More info ⬇️: https://t.co/K40Y5K2yJG","date":"Wed Apr 07 20:25:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Have questions about the #AmericanRescuePlan? Join @RepCohen and I next Wednesday, April 14 with @EquityAlliance1 for a discussion on the latest stimulus package and what it means for Tennessee! https://t.co/o13urWDAzL","date":"Wed Apr 07 17:35:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville’s music venues are the heart and soul of our city. @EXIT_IN is a prime example, and I hope they are able to reach an agreement with the buyer of the property. https://t.co/IKvoIRuHJr","date":"Wed Apr 07 16:22:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today is the last day to register for the next #TeamCooper session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies!\" Join us tomorrow, April 6, at 6pm.\n\nThe 5th in the series: “An Unjust System: The Past, Present and Future.\"\n\nRegister: https://t.co/irNtNI349h https://t.co/Jty6Y3FQfi","date":"Mon Apr 05 20:01:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Metro Public Health Sets Aside Vaccination Appointments for Hospitality Workers https://t.co/Atg1Sx8TTx","date":"Mon Apr 05 14:20:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Officer Evans gave his life defending our democracy.\n\nI pray for him, his family, and his loved ones as they mourn the loss of his life that was tragically cut short today.","date":"Fri Apr 02 22:06:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"My staff and I are not in the Capitol this week as the House is out of session. I'm thankful to Capitol Police for the their swift response to this incident and I'm praying for the injured officers.","date":"Fri Apr 02 18:32:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Puede hacer citas a través de https://t.co/3TEqeYoRDL o 615-862-7777 (Español 615-326-9986). *los menores de 18 años necesitarán la aprobación firmada de un padre.\n\nPara encontrar más sitios de vacunación cerca de usted y buscar por tipo de vacuna, visite https://t.co/nyky2rLnBn","date":"Wed Mar 31 21:29:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@NashvilleHealth ha anunciado que las vacunas en el condado de Davidson ya están abiertas para TODOS los residentes de 16 años o más.","date":"Wed Mar 31 21:29:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@NashvilleHealth announced vaccinations in Davidson Co. are now open for ALL residents 16 years of age &amp; older. Make appointments via https://t.co/3TEqeYoRDL or 615-862-7777 (Spanish 615-326-9986). *those under the age of 18 will need signed approval from a parent or guardian.","date":"Wed Mar 31 21:29:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"To find more vaccination sites near you and search by type of vaccine visit https://t.co/nyky2rLnBn","date":"Wed Mar 31 21:29:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: #TeamCooper is hosting another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” on Tuesday, April 6, at 6pm.\n\nThe fifth in the series: “An Unjust System: The Past, Present and Future.\"\n\nRegister here: https://t.co/irNtNI349h","date":"Tue Mar 30 17:21:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. \n\nAs #WomensHistoryMonth2021 comes to a close, meet @LisaQuigleyTN: https://t.co/WqyGoCqKIf","date":"Wed Mar 31 21:03:26 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"On this #TransDayOfVisibility , we celebrate the many achievements &amp; contributions of the transgender community.\n\nAs Tennessee legislators ramp up their attacks on the transgender community, I will continue fighting for them. https://t.co/MGALFPqX2i","date":"Wed Mar 31 18:59:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"If you or someone you know lost a loved one due to #COVID19, @fema announced it will help with funeral expenses starting in April.\n\nFind more on how to apply here: https://t.co/FBFtGhsZog","date":"Tue Mar 30 20:53:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The reckless bill passed by the TN General Assembly last night is opposed by law enforcement.\n\nLet me say that again, the police have openly opposed this bill and say Gov. Lee signing it will put lives in danger.\n\nhttps://t.co/dg7hCIrBqL","date":"Tue Mar 30 19:05:52 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: #TeamCooper is hosting another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” on Tuesday, April 6, at 6pm.\n\nThe fifth in the series: “An Unjust System: The Past, Present and Future.\"\n\nRegister here: https://t.co/irNtNI349h","date":"Tue Mar 30 17:21:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. \n\n#WomensHistoryMonth2021     \n\nMeet Sylvia: https://t.co/g3Qsw8aU8y","date":"Tue Mar 30 17:01:11 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"👀👀👀","date":"Tue Mar 30 16:20:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨Deadline today!","date":"Mon Mar 29 19:06:40 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"REMINDER: The Special Enrollment Period to sign up for health insurance is extended to August of this year.\n\nChange your current plan or enroll here: https://t.co/FP8noubqk4","date":"Mon Mar 29 18:57:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I've been told by @CSX that there were no injuries, leaks or spills as a result of this incident. They will securely transfer the cars from the scene as safely and swiftly as possible. The cause is under investigation.","date":"Sat Mar 27 15:40:59 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"What happened yesterday in Georgia was appalling.\n\nNot only was an elected official, Rep. Park Cannon, arrested and removed from the capitol building, but one of the most restrictive bills on the right to vote since the Jim Crow era was signed into law.","date":"Fri Mar 26 20:33:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨🚨🚨","date":"Fri Mar 26 19:23:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"NEW DATE: #TeamCooper is hosting another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” on Tuesday, April 6, at 6pm.\n\nThe fifth in the series: “An Unjust System: The Past, Present and Future.\"\n\nRegister here: https://t.co/irNtNIkF0P https://t.co/BWuwZKnt45","date":"Fri Mar 26 18:28:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"More good news from @SBAgov! The Paycheck Protection Program (PPP) application deadline is extended until May 31st.\n\nEligible small businesses can still apply through your local SBA lender. \n\nMore info: \nhttps://t.co/Tzi1MX7u77","date":"Fri Mar 26 18:21:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🧵⬇️","date":"Fri Mar 26 17:46:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: @mbdafpc is currently accepting applications for grants for minority business enterprises.\n\nFind more info &amp; how to apply here: https://t.co/dNKhu7LSyF https://t.co/2GRtSkrtjj","date":"Fri Mar 26 16:54:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. \n\n#WomensHistoryMonth2021    \n\nMeet Lindsey: https://t.co/yfRow6EBHf","date":"Thu Mar 25 20:48:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #IRS is delivering a 3rd round of Economic Impact Payments.\n\nThe new payment will be larger for most eligible people &amp; will be direct deposit or check.\n\nLearn more: https://t.co/RJTUzbstL4","date":"Thu Mar 25 20:27:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"As part of the #AmericanRescuePlan, nearly 30 community health centers in Tennessee will receive a total of $104M+ in grants from @HHSGov.\n\nThese centers continue to serve the underserved and provide lifesaving care. \n\nhttps://t.co/hsgRBi3GXa","date":"Thu Mar 25 20:18:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Good news! @SBAgov increased the lending limit for #COVID19 Economic Injury Disaster Loans.\n\nFind out more here: https://t.co/lLK3NsrkF1","date":"Thu Mar 25 19:32:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m proud to support additional @NIH funding.\n\nNot only does their work lead to lifesaving discoveries, but @NIH research funding to Tennessee supported 11,000 jobs and generated $1.809 billion in new economic activity statewide last year.\n\nhttps://t.co/yfvM7qDNYF","date":"Thu Mar 25 19:22:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: Kids ages 8-18 are invited to give their own speech as @POTUS.\n\nCheck out the contest from @kidizenship and find more info here: https://t.co/2L07kjCVyt","date":"Thu Mar 25 18:14:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"While the gender pay gap is smaller than the nationwide average here in Middle Tennessee, we still have a lot of work to do.\n\nEqual work deserves equal pay.\n\n#EqualPayDay2021 #EqualPay https://t.co/tx1d3NhHrp","date":"Wed Mar 24 19:45:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: The Special Enrollment Period to sign up for health insurance is extended to August of this year. \n\nChange your current plan or enroll here: https://t.co/JJLHCTOhXq","date":"Wed Mar 24 15:38:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The @DeptVetAffairs recently released a suicide prevention tool that puts lifesaving info within REACH:\n\nR - Reach\nE - Engage\nA - Attend\nC - Connect\nH - Help\n\nThe app was developed w/ military and vets orgs. Find out more and download the app: https://t.co/UognLc6SYp","date":"Wed Mar 24 15:31:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Eleven years ago today, @BarackObama led us in changing the course of American health care forever.\n\n@HouseDemocrats continue to work with @POTUS on building upon the progress of the largest expansion of health insurance coverage in the last half century – the #AffordableCareAct. https://t.co/DL28BLafUQ","date":"Tue Mar 23 21:30:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Now that we have his official diagnosis, we have proof that DeJoy is the Dr. Kevorkian of the U.S. Postal Service.\n\nHis prescription is death by a thousand cuts.","date":"Tue Mar 23 20:10:16 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/2): We cannot become a more equitable society if we don’t get internet access to our underserved communities.","date":"Tue Mar 23 19:54:54 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/2): The #COVID19 pandemic has exacerbated the gaps in broadband service in Tennessee. Teachers, students, businesses, and even folks who want to visit family, had to quickly adapt to virtual platforms to teach, learn, grow, and be together. \n\nhttps://t.co/c8eUBdUfEg","date":"Tue Mar 23 19:54:53 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Families no longer have their loved ones who were just running to the grocery store &amp; were senselessly murdered. This includes a police officer, the father of seven children, who rushed to the scene. America is awash in guns. These tragedies are preventable. They have to stop.","date":"Tue Mar 23 19:09:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper is hosting another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” on Monday, March 29, at 6pm.\n\nThe fifth in the series: “An Unjust System: The Past, Present and Future.\"\n\nRegister here: https://t.co/irNtNI349h https://t.co/k0orlehzAM","date":"Mon Mar 22 21:32:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"10,107 people were vaccinated at @NissanStadium over the weekend  – one of the largest single site vaccination events in Tennessee history!\n\nThank you @NashvilleHealth and all of the volunteers!\n\n#nashvillestrong","date":"Mon Mar 22 21:10:46 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@neighborhealth and @mwalkerhealth serve the underserved and provide critical care to Tennesseans.\n\nAs their representative in Congress I am thrilled we have these federal funds coming to Nashville.\n\nhttps://t.co/kpyDQMboQz","date":"Mon Mar 22 19:52:26 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. \n\n#WomensHistoryMonth2021    \n\nMeet Alayna: https://t.co/ZmArXXJsOP","date":"Mon Mar 22 17:27:53 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #COVID19 pandemic has disproportionately affected women by forcing them to leave the labor force at significantly higher rates than men.\n\nBlack and Latina women have left the labor force at nearly 2x the rate of other women. https://t.co/lM2cs3jLYq","date":"Mon Mar 22 16:36:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Good news! The Shuttered Venue Operators Grant (SVOG) application portal will open April 8.\n\n@SBAgov will host an informational webinar to highlight the application process on Tuesday, March 30.\n\nMore info &amp; register here: https://t.co/HZZWxGUCJj","date":"Mon Mar 22 13:53:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨TONIGHT🚨","date":"Mon Mar 22 13:05:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"There are still appointments available for Saturday’s drive-thru vaccine event at Nissan Stadium! \n\n@NashvilleHealth will be administering the Johnson &amp; Johnson vaccine for people in phase 1A1, 1A2, 1B, 1C and anyone 65 years of age and older. To register: https://t.co/Iq3K4kAIIL","date":"Fri Mar 19 23:02:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"¡Todavía hay citas disponibles para el evento de vacunación este sábado en el Estadio Nissan!\n\n@NashvilleHealth administrará la vacuna Johnson &amp;Johnson para personas de fase 1A1, 1A2, 1B, 1C y cualquier persona mayor de 65 años. Para registrarse visite: https://t.co/Iq3K4kAIIL","date":"Fri Mar 19 23:02:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I joined my colleagues in urging House leaders to make restoring the #VRA and passing the John Lewis #VotingRightsAct a priority this Congress.","date":"Fri Mar 19 20:27:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: If you suffered any property damage caused by the explosion in downtown Nashville on Dec. 25, 2020, the last @SBA_Tennessee info session on how to get relief assistance is coming up this Monday, March 22, at 5:30pm.\n\nRegister here: https://t.co/oA2goNriu9","date":"Fri Mar 19 16:53:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Calling all veterans! @DeptVetAffairs &amp; @RedCross  teamed up for Compassionate Contact Corps, a tele-support program for veterans who may be lonely or socially isolated while we fight the #COVID19 pandemic. Volunteers are also needed!\n\nLearn more: https://t.co/CpufsKtlIx","date":"Fri Mar 19 19:37:16 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#HelpIsHere! Americans overwhelmingly support the #AmericanRescuePlan to put:\n\n🩹Shots in arms\n💵Money in pockets\n🏫Children in schools\n🛠People in jobs","date":"Fri Mar 19 19:25:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It will help the reopening of our industries and attractions that make Nashville so awesome. I will continue doing everything I can to get Middle Tennessee back on its feet and help @POTUS deliver to Americans.","date":"Fri Mar 19 18:09:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This funding is critical to restarting Tennessee and with the funding expected from the #AmericanRescuePlan this brings nearly $65B in total federal #COVID19 relief to Tennesseans.","date":"Fri Mar 19 18:09:18 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth2021 every day, but this month we're highlighting the awesome women on #TeamCooper. \n\n#WomensHistoryMonth2021   \n\nMeet Cara: https://t.co/Vuhhc4tnzE","date":"Fri Mar 19 17:24:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: If you suffered any property damage caused by the explosion in downtown Nashville on Dec. 25, 2020, the last @SBA_Tennessee info session on how to get relief assistance is coming up this Monday, March 22, at 5:30pm.\n\nRegister here: https://t.co/oA2goNriu9","date":"Fri Mar 19 16:53:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Middle Tennessee is home to one of the most awesome, diverse, immigrant communities in the nation. The Dream and Promise Act allows our neighbors, essential workers, colleagues and friends to fully contribute to our country and keep America strong and united. #HomeIsHere https://t.co/ruLaSjCIJI","date":"Thu Mar 18 21:20:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #AAPI community is facing verbal assaults, physical attacks, and threats to their lives. Today’s @HouseJudiciary hearing is an important step towards #solidarity, but we must continue condemning racism to #StopAsianHate.","date":"Thu Mar 18 21:07:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Davidson Co. residents may qualify for tax relief assistance.\n\nFind more info &amp; apply by visiting: https://t.co/LyorVRKzaX https://t.co/Y3xuGMenGK","date":"Thu Mar 18 16:46:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. \n\n#WomensHistoryMonth2021  \n\nMeet Jazzy: https://t.co/kbgO1K9TfI","date":"Thu Mar 18 16:35:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m thankful to @RepSpeier for her leadership on the Equal Rights Amendment.\n\nWe need the #ERANow to ensure equality for all. https://t.co/FlohVNFJQd","date":"Wed Mar 17 22:31:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: People age 16+ with high risk conditions may be eligible to get the #COVID19 vaccine from @NashvilleHealth. Sign up here: \n\nhttps://t.co/gXSEwLXth4","date":"Wed Mar 17 22:03:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Violence Against Women Act maintains lifesaving resources and protections for women.\n\nI’m proud to support #VAWA! https://t.co/RQaxluqlR9","date":"Wed Mar 17 21:42:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The increased violence towards the Asian-American community, especially Asian-American women, is heartbreaking. I stand in solidary and mourn with the Asian community after the deaths of the individuals killed in yesterday’s attack. #StopAsianHate\n\nhttps://t.co/Y1LlEHCa9I","date":"Wed Mar 17 20:08:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The bill was taken off the agenda at the last minute, but this is likely not the last we'll see of it.","date":"Wed Mar 17 18:15:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Restricting access to the absentee ballot request form just creates another barrier for people to participate in the electoral process. Watch here: \n\nhttps://t.co/7FwlHGD9Gt","date":"Wed Mar 17 17:28:52 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The TN legislature is considering another bill to make absentee voting even harder. Tennessee is already one of the most restrictive states for people to vote.","date":"Wed Mar 17 17:28:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"REMINDER: If you were impacted by the derecho winds &amp; flooding that hit Davidson and Dickson Counties last May, you may qualify for a disaster loan from @SBAgov. Find more info &amp; see if your business qualifies here: https://t.co/T1hIPgZRv8","date":"Tue Mar 16 13:13:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"New vaccination sites opened in Middle Tennessee last weekend! \n\nFind a site near you: https://t.co/mIiohbCb8P","date":"Mon Mar 15 22:10:59 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Under the #AmericanRescueAct, nearly 1.4 million children in Tennessee will benefit from the expansion of the tax credit. Almost every child will benefit from the expansion. I was proud to vote for this bill to bring much needed relief to Middle Tennesseans. https://t.co/ApgcAGSQv9","date":"Mon Mar 15 22:05:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"🚨ATTN: Cheatham &amp; Dickson Counties🚨","date":"Mon Mar 15 19:22:31 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congress passed a historic #COVID19 relief bill at the end of last year and another, the #AmericanRescuePlan, just last week. The bills give funds to cities to help renters whose income has been impacted by the pandemic. Apply for assistance today: https://t.co/iCOn0psfzQ https://t.co/KWlH5168z4","date":"Mon Mar 15 18:18:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. \n\n#WomensHistoryMonth2021 \n\nMeet Bess: https://t.co/8eMLlWRdmF","date":"Mon Mar 15 17:20:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville is home to the world’s best music venues &amp; it was awesome to see one on the @RecordingAcad. The #AmericanRescuePlan gives another $1B+ in relief &amp; allows venues to apply for PPP w/o being disqualified from SVOG grants to help keep the music playing &amp; stage lights on.","date":"Mon Mar 15 17:12:59 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #AmericanRescuePlan is one of the boldest relief bills in our nation’s history. I’m glad the president signed it yesterday to immediately get help to Middle Tennesseans. https://t.co/vGopgNIJ5c","date":"Fri Mar 12 19:24:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am honored to be appointed to @HouseIntel &amp; I take this very seriously. Nothing is more important than our duty to protect and defend America. I have already been briefed on the intelligence issues related to our defense activities &amp; nuclear, missile, &amp; space arsenal for years.","date":"Fri Mar 12 18:40:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I look forward to using that experience to help Chairman @RepAdamSchiff, @HouseDemocrats, and our great nation address all of the serious threats that America faces.\n\nhttps://t.co/5vQKsDLAFH","date":"Fri Mar 12 18:40:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. #WomensHistoryMonth2021 \n\nMeet Cheryl: https://t.co/8eYqInzcyQ","date":"Fri Mar 12 18:12:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It was an honor to join my colleagues for the #HBCUSTEAM Day of Action. #PowerOfPartnerships #HBCUStrong https://t.co/RYhRZusufI","date":"Fri Mar 12 16:09:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Interested in becoming a #Jimtern this summer? Apply today! https://t.co/bO0PyiaD8j https://t.co/hVUCxxu8P6","date":"Fri Mar 12 15:27:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. #WomensHistoryMonth2021\n\nMeet Ella: https://t.co/UMFOn4ia6a","date":"Thu Mar 11 18:46:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The House just again passed two bills to expand background checks for gun purchases. Most Americans support background checks and it will help keep firearms out of the hands who should not be legally permitted to obtain them. I #WearOrange in support of these bills. https://t.co/bWPkZf28H8","date":"Thu Mar 11 17:43:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Davidson Co. residents currently needing assistance with rent and past due utilities due to #COVID19 can apply for help from Nashville’s HOPE Program. More info on how to apply: https://t.co/Tex3WouSD5","date":"Wed Mar 10 14:41:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We need to protect the rights of workers. America gets stronger and our country moves forward when our workers can organize to get bigger paychecks, better benefits, and safer working conditions. #PROAct https://t.co/FL9kW7NBEk","date":"Tue Mar 09 23:13:01 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee ahora está programando citas para cualquier persona en la fase 1c. Los residentes de Dickson Co. pueden buscar información y programar una cita aquí:\nhttps://t.co/yKkGSzCUrP","date":"Tue Mar 09 19:55:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee is now scheduling appointments for anyone in phase 1c. Dickson Co. residents can look up info and schedule an appointment here:\nhttps://t.co/yKkGSzCUrP","date":"Tue Mar 09 19:55:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee is now scheduling appointments for anyone in phase 1c. Cheatham Co. residents can look up info and schedule an appointment here: https://t.co/IKZ6GGZl4k","date":"Tue Mar 09 15:53:04 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee ahora está programando citas para cualquier persona en la fase 1c. Los residentes de Cheatham Co. pueden buscar información y programar una cita aquí: https://t.co/IKZ6GGZl4k","date":"Tue Mar 09 15:53:04 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#PassItOn","date":"Tue Mar 09 15:25:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #ForThePeopleAct unrigs our redistricting process so voters can choose their reps, not the other way around. It also restores voting rights to nearly half a million Tennesseans who paid their debt to society &amp; gives federal funds to making our elections more secure, not less.","date":"Tue Mar 09 15:00:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennesseans shouldn't be subjected to the most suppressive voting laws in the U.S. We need a federal law to override them, just as the original #VotingRightsAct was necessary to protect everyone, and particularly Black voters, in the era of Jim Crow.","date":"Tue Mar 09 15:00:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The previous administration gutted the Title X program, which provides family planning and health services to low-income women. I’m glad @POTUS plans to rescind the rule change and I urge officials to act as quickly as possible to restore the integrity of the program. https://t.co/JBsWKyZWMP","date":"Mon Mar 08 22:35:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #COVID19 pandemic has further strained programs that provide support for survivors of sexual assault, domestic violence and child abuse, which have been underfunded for years. We need to ensure these critical programs receive the funding they need. https://t.co/r6jfhh7J7N","date":"Mon Mar 08 21:56:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, TN began vaccinating phase 1c – the largest group yet. Please visit https://t.co/C61d1vrSst (615-862-7777) or https://t.co/SiQk6ZxLo9 to find available vaccine and book an appointment. Signups via @NashvilleHealth are already full but will reopen Friday, March 12.","date":"Mon Mar 08 19:55:40 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Las inscripciones a través de @NashvilleHealth ya están llenas, pero reabren el viernes 12 de marzo.","date":"Mon Mar 08 19:55:40 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Hoy, TN comenzó a vacunar la fase 1c , el grupo más grande hasta la fecha. Por favor, visite COVID19. https://t.co/YteQ55V9Xy (615-862-7777) o https://t.co/SiQk6ZxLo9 para encontrar la vacuna disponible y reservar una cita.","date":"Mon Mar 08 19:55:40 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"On this #InternationalWomensDay we continue to highlight the awesome women on #TeamCooper during #WomensHistoryMonth .\n\nMeet MaKayla: https://t.co/zMP0okf05u","date":"Mon Mar 08 17:51:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Voting rights continue to be under attack in America. It’s been 56 years since #BloodySunday in Selma, AL.\n\nTo strengthen our democracy, we must fully #RestoreTheVRA and I look forward to voting for the John Lewis Voting Rights Advancement Act in the House. https://t.co/MlGx2ylA4b","date":"Mon Mar 08 17:42:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"New Climate Maps Show a Transformed United States https://t.co/ydfxDvloT5","date":"Mon Mar 08 16:51:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"TODAY:","date":"Mon Mar 08 16:31:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations to @slimandhuskys for breaking barriers and making history as the first Black-owned restaurant on Nashville’s historic Broadway. Here’s a #FlashbackFriday when we were all together in N. Nashville early last year. https://t.co/jvyXfwPqPI","date":"Fri Mar 05 20:40:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. #WomensHistoryMonth2021 \n\nMeet Maria: https://t.co/rWHjBcsuWx","date":"Fri Mar 05 17:53:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We celebrate #WomensHistoryMonth every day, but this month we're highlighting the awesome women on #TeamCooper. #WomensHistoryMonth2021 \n\nMeet Katie: https://t.co/g1y9PfB5SH","date":"Fri Mar 05 15:26:11 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The former administration's changes to Title IX were a disaster for survivors of sexual harassment and assault. I hope @SecCardona acts swiftly to revise the rule to restore common sense and compassion to the program.","date":"Thu Mar 04 20:49:47 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Find available locations and make an appointment by visiting https://t.co/SiQk6ZxLo9. Appointments for Tennesseans age 65+ and phase 1c are also available through @NashvilleHealth  via https://t.co/3TEqeYGt2l or 615-862-7777.","date":"Thu Mar 04 20:41:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"On Monday, March 8, Tennessee will start vaccinating phase 1c. This means people over the age of 16 with high-risk comorbidities and caregivers of children with high-risk comorbidities are all eligible. This is the largest phase yet. Full list: https://t.co/fZCH54VoIr","date":"Thu Mar 04 20:38:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Dr. Anthony Fauci to deliver 2021 Vanderbilt Graduates Day address https://t.co/zQCcPHZm8S via @VanderbiltU","date":"Thu Mar 04 17:24:52 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/3): I am thankful that the House just passed the George Floyd #JusticeinPolicing Act, again, although now, with a Democratic Senate and President, it has a much better chance of becoming law. This is the boldest police reform bill ever.","date":"Thu Mar 04 02:38:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/3): It improves police conduct by ending qualified immunity, mandating the use of body &amp; dashboard cameras, banning chokeholds &amp; no-knock warrants, limiting the militarization of police depts, and creating a database so bad officers can’t relocate to get another policing job.","date":"Thu Mar 04 02:38:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/3): No person or group should have reason to fear the police, but after George Floyd’s murder and an estimated 100 similar tragedies since, many people do.","date":"Thu Mar 04 02:38:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thanks for the note, @IndivisibleTeam! I’m proud to vote for H.R. 1 - The #ForThePeopleAct - when it comes to House floor tonight. https://t.co/QbZXmgu5qN","date":"Wed Mar 03 22:25:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/2): It would begin to repair #VotingRightsAct, create automatic voter registration, and allow all Tennesseans to vote by mail. It also brings transparency and independence to the redistricting process. https://t.co/jTEURbdNqZ","date":"Wed Mar 03 21:35:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/2): The House is set to pass H.R. 1 tonight #ForThePeople. This is the strongest voting rights bill before Congress in 20 years &amp; will restore the right to vote to 420K+ Tennesseans by automatically restoring voting rights as soon as a person has completed his or her sentence.","date":"Wed Mar 03 21:35:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper está organizando otra sesión de \"Let’s Talk: Conversaciones para Garantizar Directivas Equitativas y Justas\" el lunes 15 de marzo, a las 6 pm. El cuarto en la serie: \"Salvar Nuestro Planeta: Es Ahora o Nunca\". Regístrese aquí: https://t.co/RalevnRVx2","date":"Wed Mar 03 20:34:20 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper is hosting another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” on Tuesday, March 16, at 6pm.\n\nThe fourth in the series: “Saving our Planet: It’s Now or Never.”\n\nRegister here: https://t.co/RalevnRVx2 https://t.co/kg3QoCUbDd","date":"Wed Mar 03 17:52:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The recovery and rebuilding continues even a year later, but we are #NashvilleStrong.","date":"Wed Mar 03 17:04:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"It’s been one year since deadly tornadoes hit Nashville and Middle Tennessee. My staff and I spent the next several days and weeks volunteering in the community – from canvassing with #DontSellOutNorf and helping clear debris, to loading boxes of food in cars in Antioch.","date":"Wed Mar 03 17:04:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/3): I support the automatic restoration of voting rights as soon as a person has completed his or her sentence. H.R. 1 does exactly that.","date":"Tue Mar 02 21:01:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/3): There was a last-minute attempted amendment to allow people currently in prison to vote. That amendment failed because it goes too far. Most Democrats and all Republicans voted against it.","date":"Tue Mar 02 21:01:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/3): I strongly support H.R. 1, the strongest voting rights bill before Congress in 20 years. Every American adult should have the right to vote, including incarcerated people who have paid their debt to society.","date":"Tue Mar 02 21:01:06 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Last month I met with @SOTennessee and came away more inspired than ever. We discussed the importance of exercise, training, and how health and nutrition is vital to the success of the athletes. https://t.co/pcFD0uRup9","date":"Mon Mar 01 14:31:26 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/2): The only naysayers are congressional Republicans, most of whom still deny the results of the last election, except for their own victory.","date":"Sat Feb 27 16:33:25 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/2): Rescuing our lives and our economy from #COVID19 should not be controversial. That’s why @POTUS' American Rescue Plan is overwhelmingly popular with the public and with groups ranging from the Chamber of Commerce on the right to the AFL-CIO on the left.","date":"Sat Feb 27 16:33:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper and I recently reflected on Black History Month and how we honor and celebrate this historical month.\n\nAs #BlackHistoryMonth comes to a close, we want to share our reflections with you: https://t.co/DOMrrGypGP","date":"Fri Feb 26 18:28:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I was proud to vote for the #EqualityAct today and I hope it can finally pass in the Senate. Every American should have equal protection under the law.","date":"Thu Feb 25 22:25:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Más información &amp; cómo aplicar: https://t.co/YjRNDs6IqO","date":"Thu Feb 25 18:01:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"TODAY: @POTUS opened an exclusive 14-day application period for PPP loans for businesses and nonprofits with &lt;20 employees and expanded eligibility to some previously excluded small businesses going forward. More info &amp; how to apply: https://t.co/YjRNDs6IqO","date":"Thu Feb 25 18:01:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"HOY: @POTUS abrió un período de solicitud exclusivo de 14 días para préstamos de PPP para empresas y organizaciones sin fines de lucro con mas de 20 empleados y ampliada elegibilidad para algunas pequeñas empresas previamente excluidas.","date":"Thu Feb 25 18:01:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@CDCgov a lanzado una nueva herramienta para ayudarle encontrar la vacuna disponible cerca de usted. TN es 1 de 4 estados con datos sobre todos los proveedores de vacunas, incluyendo hospitales, clínicas y sitios de vacunación de salud pública.","date":"Thu Feb 25 17:14:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Más información saldrá para más estados en las próximas semanas: https://t.co/SiQk6ZxLo9","date":"Thu Feb 25 17:14:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@CDCgov launched a new tool to help you find vaccine available near you! TN is 1 of 4 states with data on all vaccine providers, including hospitals, clinics, and public health vaccination sites. More information added for more states in the coming weeks: https://t.co/SiQk6ZxLo9","date":"Thu Feb 25 17:14:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: La fecha límite para que los negocios y residentes de Nashville afectados por la explosión en el centro de la ciudad el 25 de diciembre de 2020, soliciten un préstamo para desastres físicos @SBAGov es el 29 de marzo. Apliqué aquí: https://t.co/T1hIPgZRv8","date":"Thu Feb 25 16:52:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: The deadline for Nashville businesses and residents affected by the explosion downtown on Dec. 25, 2020, to apply for a @SBAGov physical Disaster Loan is March 29. Apply here: https://t.co/T1hIPgZRv8","date":"Thu Feb 25 16:52:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper está organizando otra sesión de \"Let’s Talk: Conversaciones para Garantizar Directivas Equitativas y Justas\" el lunes 1 de marzo, a las 6 pm. El tercero de la serie: \"Cómo Una Nación de Inmigrantes Puede Recuperarse Después de 4 años de Exclusión\". https://t.co/5ElgDpOIdx","date":"Wed Feb 24 22:15:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Regístrese aquí: https://t.co/Tacz2C9jRJ","date":"Wed Feb 24 22:15:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"REMINDER: #TeamCooper is hosting another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” on Monday, March 1, at 6pm.\n\nThe third in the series: “How a Nation of Immigrants Can Recover from Four Years of Exclusion.”\n\nRegister here: https://t.co/Tacz2C9jRJ https://t.co/U1QDuxFtAp","date":"Wed Feb 24 22:15:11 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/2): Everyone wants schools to reopen safely and quickly. The #AmericanRescuePlan provides the necessary funding and resources for K-12 schools to reopen safely in accordance with @CDCgov guidelines.","date":"Wed Feb 24 18:16:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/2): Everything from updating HVAC systems to on-site medical care. We need the #AmericanRescuePlan to safely get our kids back in school and make up for lost learning time.","date":"Wed Feb 24 18:16:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Heads up Cheatham &amp; Dickson Counties: @TN_Housing_Dev will open a #COVID19 Rent Relief program for your counties starting Monday, March 1. More info: https://t.co/aY6h97WBFG","date":"Tue Feb 23 23:33:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"One year ago today #AhmaudArbery was senselessly murdered for being a Black man while jogging in Georgia. We must continue fighting injustices in this country to make sure this never happens again.\n\nhttps://t.co/Y3oRYUSwXf","date":"Tue Feb 23 22:22:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"We can minimize further infections if Tennessee improves its vaccination rate instead of lagging the nation.","date":"Tue Feb 23 20:14:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yesterday America passed the grim milestone of 500,000 deaths from #COVID19, a tragedy memorialized by flags at half-staff and by @POTUS in a deeply empathetic talk to the nation. Leadership matters.","date":"Tue Feb 23 20:14:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today @POTUS announced this Wednesday, Feb. 24, @SBAgov will open a 14-day application period for PPP loans for businesses and nonprofits with &lt;20 employees and expanded eligibility to some previously excluded small businesses going forward. More info: https://t.co/YjRNDsojPo","date":"Mon Feb 22 22:08:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Sign up for IssueWatch here: https://t.co/m2s10Jc7kV","date":"Mon Feb 22 21:02:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Check out the latest edition of “IssueWatch,\" my biweekly newsletter highlighting the biggest news items of the week: https://t.co/bwtfjiO1Zh","date":"Mon Feb 22 21:02:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Regístrese aquí: https://t.co/Tacz2C9jRJ","date":"Fri Feb 19 23:32:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper está organizando otra sesión de \"Let’s Talk: Conversaciones para Garantizar Directivas Equitativas y Justas\" el lunes 1 de marzo, a las 6 pm. El tercero de la serie: \"Cómo Una Nación de Inmigrantes Puede Recuperarse Después de 4 años de Exclusión\". https://t.co/w4HqiwiHQM","date":"Fri Feb 19 23:32:16 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper is hosting another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” on Monday, March 1, at 6pm.\n\nThe third in the series: “How a Nation of Immigrants Can Recover from Four Years of Exclusion.”\n\nRegister here: https://t.co/Tacz2C9jRJ https://t.co/zbpRkF0iIo","date":"Fri Feb 19 23:27:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Estoy orgulloso de unirme a mis colegas para apoyar la Ley de Ciudadanía de los Estados Unidos de @POTUS. Proporcionará un camino legal a la ciudadanía para millones de indocumentados de nuestra comunidad y reforzará que #HomeIsHere.","date":"Fri Feb 19 20:03:16 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am proud to join my colleagues in supporting @POTUS' U.S. Citizenship Act. It will provide a legal path to citizenship for millions of undocumented members of our community and reinforce that #HomeIsHere.\n\nhttps://t.co/JUiv30iybV","date":"Fri Feb 19 20:03:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Estoy trabajando con @POTUS para crear una distribución equitativa de la vacuna #COVID19 que garantizará la inclusión de grupos raciales y étnicos minoritarios.","date":"Fri Feb 19 19:48:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#VaccineEquity es importante para aliviar el sufrimiento, contener #COVID19 a nivel nacional, mantener nuevas cepas bajo control y reconstruir nuestra economía. VEA EN VIVO @COVIDOversight: https://t.co/I8VYzhMSxI","date":"Fri Feb 19 19:48:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I'm working with @POTUS to create equitable distribution of the #COVID19 vaccine to ensure racial &amp; ethnic minority groups are included. #VaccineEquity is important for alleviating suffering, containing #COVID19 nationwide, keeping new strains in check, &amp; rebuilding our economy. https://t.co/ljyfKcUdO2","date":"Fri Feb 19 19:44:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Watch @COVIDOversight LIVE: https://t.co/I8VYzhMSxI","date":"Fri Feb 19 19:44:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Our tax system is rigged &amp; needs serious reform. Many corporations and millionaires don’t pay a dime in income tax and that is terribly wrong and totally unfair.","date":"Fri Feb 19 15:54:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am happy to co-sponsor the IRS Enhancement and Tax Gap Reduction Act so we can crack down on tax cheats &amp; those who are getting a free ride. \n\nhttps://t.co/yu5PC5rXZR","date":"Fri Feb 19 15:54:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Uninsured or want to change health plans? There’s an Affordable Care Act special enrollment period open now through May 15. Shop for plans: https://t.co/EzNZiRmnGR.","date":"Thu Feb 18 22:17:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"¿No está asegurado o quiere cambiar su plan de salud? Hay un período especial de inscripción de la Ley de Cuidado de Salud Asequible. Esta abierto desde ahora hasta el 15 de mayo. Busque planes aqui: https://t.co/EzNZiRmnGR.","date":"Thu Feb 18 22:17:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"VEA EN VIVO: @NASA terminará su #CountdownToMars esta tarde cuando @NASAPersevere comience su aterrizaje en Marte: https://t.co/4fAKfFnYYV\n\n#JuntosPerseveramos","date":"Thu Feb 18 19:56:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"WATCH LIVE: @NASA will end its #CountdownToMars this afternoon as @NASAPersevere begins its landing on Mars: https://t.co/lia4kyCApY","date":"Thu Feb 18 19:52:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’ve always enjoyed talking with you, @SergioMarBel. You brought transparency and accountability to all levels of government in Tennessee while at @WPLN. @BridgeMichigan is lucky to have you!","date":"Thu Feb 18 19:18:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today the House re-introduced the #EqualityAct. I’m proud to support it and have said before and will say it again: Every American should be guaranteed equal protection under the law. https://t.co/srupQUtqLR","date":"Thu Feb 18 18:31:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The budget resolution provides another option for enacting the #AmericanRescuePlan. If we don’t act fast, more people will die, more Americans will lose their jobs &amp; our children will miss more school. We can’t let that happen. This is not a red state, blue state issue. https://t.co/hKRQ2gOmA4","date":"Thu Feb 18 18:17:58 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@WhiteHouse #COVID19 Response Task Force anunció una inversión de 1.6 mil millones de dólares en esfuerzos y accesibilidad para proteger al público de las variantes emergentes.","date":"Wed Feb 17 22:53:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@WhiteHouse #COVID19 Response Task Force announced $1.6B investment in testing and accessibility, while protecting the public from emerging variants. This week Nashville’s free community assessment sites are closed due to weather. More options here: https://t.co/We5rog8D0u","date":"Wed Feb 17 22:53:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Esta semana los sitios gratuitos de evaluación de Nashville están cerrados debido al clima. Más opciones: https://t.co/We5rog8D0u","date":"Wed Feb 17 22:53:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"El 22 de febrero @TNDeptofHealth comenzará a registrar personas mayores de 65 años y la Fase 1b (miembros del personal de las escuelas de K-12th y centros de cuidado infantil). Para más información visite https://t.co/bToZpcY1nx","date":"Wed Feb 17 22:22:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"On Feb. 22 @TNDeptofHealth will begin registering age 65+ and Phase 1b (staff members of K-12th grade schools and child care facilities). For more info visit https://t.co/bToZpcY1nx https://t.co/SjYJaR5LZU","date":"Wed Feb 17 22:01:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: An @OversightDems subcommittee report found that certain rice-based baby food products should be avoided until further notice.\n\nRead the full report: https://t.co/1abPIawY0u","date":"Wed Feb 17 20:56:10 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Si tiene preguntas sobre cómo registrarse o desea hablar sobre sus opciones con un profesional capacitado, la ayuda gratuita es solo una llamada o clic en distancia.  Llame al 1-800-318-2596, visite https://t.co/A0yxsut2UV o https://t.co/iax0eg7qqc.","date":"Wed Feb 17 18:07:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"If you have questions about signing up or want to talk through your options with a trained professional, free help is just a call or click away.  Call 1-800-318-2596, visit https://t.co/A0yxsut2UV or https://t.co/iax0eg7qqc.","date":"Wed Feb 17 18:07:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"¡Recordatorio! Hay un período de inscripción especial que comenzó el 15 de febrero y dura hasta el 15 de mayo en https://t.co/EzNZiRmnGR. Si no está asegurado o desea cambiar su plan, ¡lo animo a inscribirse! La cobertura podría ser más asequible de lo que usted cree.","date":"Wed Feb 17 16:51:40 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Reminder! There is a Special Enrollment Period that began on February 15 and lasts until May 15 on https://t.co/EzNZiRmnGR. If you are uninsured or want to change your plan, I encourage you to enroll! Coverage could be more affordable than you think.","date":"Wed Feb 17 16:51:40 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"En TN, personas de más de 70 años pueden hacer citas para recibir la vacuna en los lugares enumerados aquí: https://t.co/CPwfW8iFcT\n\nPara @NashvilleHealth llame al 615-862-7777 o visite https://t.co/mxZN7xed5e","date":"Wed Feb 17 16:02:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Affordable Care Act Marketplace is open for a Special Enrollment Period to help people get coverage during the pandemic. Shop plans, ask questions, and enroll by calling 1-855-889-4325 or visiting https://t.co/8pu3CTsKwU.","date":"Wed Feb 17 16:00:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"El Mercado de la Ley de Cuidado de Salud Asequible está abierto por un período de inscripción especial para ayudar a las personas a obtener cobertura durante la pandemia. Compre planes, haga preguntas e inscríbase llamando al 1-855-889-4325 o visitando https://t.co/8pu3CTsKwU","date":"Wed Feb 17 16:00:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"In TN, people 70+ can make vaccine appts at the locations listed here: https://t.co/CPwfW8iFcT. \n\nFor @NashvilleHealth call 615-862-7777 or visit https://t.co/mxZN7xed5e","date":"Tue Feb 16 21:38:48 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@WhiteHouse announced increasing vaccine supply &gt;20% to 13.5M doses per week. This is a 57% increase in supply since @POTUS took office. Dr. Fauci said vaccines for the general public (&lt;65 w/o health conditions) will be available late May or early June. \nhttps://t.co/70qmpncpZE","date":"Tue Feb 16 19:53:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"⬇️⬇️⬇️","date":"Tue Feb 16 18:43:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am so proud of the House impeachment managers who laid out an eloquent and persuasive case.\n\nThe videos were damning, yet some Senators lacked the courage to convict, including Mitch McConnell who denounced Trump with words but not with his vote.","date":"Sun Feb 14 21:55:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today marks three years since the deadliest high school shooting in our country’s history. We will never forget the lives lost &amp; people impacted that day, and we will not rest until our communities are safe from gun violence. #MSDStrong https://t.co/pBjvwqqdl9","date":"Sun Feb 14 19:57:05 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Affordable Care Act Marketplace is re-opening for a Special Enrollment Period starting this Mon., Feb. 15, to help people get coverage during the pandemic. You can shop plans, ask questions, and enroll by calling 1-855-889-4325 or visiting https://t.co/JJLHCTOhXq","date":"Fri Feb 12 22:35:20 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Davidson Co. will be vaccinating people age 70+ &amp; teachers/childcare workers. All people 70+ in TN can make appts via @TNDeptofHealth: https://t.co/KiYSFTdNAt, @NashvilleHealth: https://t.co/3TEqeYGt2l or 615-862-7777, &amp; @ participating Walmart pharmacies: https://t.co/v9aOYtqqoY","date":"Fri Feb 12 21:37:20 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: #TeamCooper will host another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” on Tues., Feb. 16 @ 6pm. The 2nd in the series: “TN: The 3rd Hardest State to Vote in America.” The deadline to register is Mon., Feb. 15: https://t.co/xmUB9v5bKX","date":"Fri Feb 12 19:33:37 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The nonpartisan @USCBO report confirms what we already knew. Gradually increasing the min. wage will lift nearly 1M people out of poverty &amp; give an overdue pay increase to 140K Tennesseans who are having a hard time putting food on the table &amp; have been hit hardest by #COVID19. https://t.co/Qs9hqqZEhz","date":"Fri Feb 12 17:53:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Alayna, MaKayla, and Lindsey are trusted members of my team and have deep knowledge of the community.\n\nThey are passionate about public service and I’m honored to continue serving with them.\n\nhttps://t.co/SPbfMXlxU1 https://t.co/3qWnVThUSR","date":"Thu Feb 11 22:02:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Los suministros de vacunas de #COVID19 están aumentando en nuestros Centros de Salud Comunitarios. Si tiene más de 70 años y ya es paciente, su clínica se pondrá en contacto con usted directamente.","date":"Thu Feb 11 19:42:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"¡Es una gran noticia! Puede encontrar una lista completa de CHC's aquí:\nhttps://t.co/7ffcS8gfqm","date":"Thu Feb 11 19:42:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The next #COVID19 relief pkg will give states an even bigger incentive to expand Medicaid &amp; cover an additional 5% in Medicaid costs. The fed govt is begging states to care about their most vulnerable citizens and TN has run out of excuses.","date":"Wed Feb 10 23:58:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The fed govt practically pays all the costs for states to expand Medicaid. But TN is one of 12 states that refuses to do so, turning down $1B/yr to give 300k more people health coverage.","date":"Wed Feb 10 23:58:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Historically Black medical schools have been on the frontlines of the #COVID19 pandemic. We need to ensure they have funding in the next relief package. @JamesEKHildreth &amp; his incredible team at @MeharryMedical have stepped up and fulfilled so many needs in Nashville. https://t.co/eWUyJAJWZN","date":"Wed Feb 10 21:34:38 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Great news for @TSUedu!","date":"Wed Feb 10 19:51:09 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations @JamesEKHildreth &amp; @BobbyWatts6! I am confident Hildreth and Watts will do an awesome job for America.","date":"Wed Feb 10 18:36:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#BlackHistoryMonth is a time to reflect on how far we have come as a country, and how far we have left to go to achieve true equity. #BHM https://t.co/lCx0AUzB65","date":"Wed Feb 10 15:47:22 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"If you or your business were impacted by the Dec. 25, 2020 explosion in Nashville, @SBA_Tennessee is hosting an information session on disaster assistance this morning at 9:30am. Register here: https://t.co/U6F6LhbKBO","date":"Wed Feb 10 14:41:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#COVID19 vaccine supplies are increasing at our Community Health Centers. If you are 70+ years-old and already a patient, your clinic will contact you directly. This is great news! You can find a full list of CHC’s here: https://t.co/7ffcS8gfqm","date":"Tue Feb 09 23:21:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"WATCH: Nashvillian and former Jimtern Mason is the son of a healthcare worker and shares how @POTUS &amp; @VP's support for healthcare workers and fight against #COVID19 affect him and his family: https://t.co/xQuWHaOqIV","date":"Mon Feb 08 22:24:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, Rep. Jim Cooper offered a tribute to his wife, Martha, upon her death this morning at home in Nashville. She was surrounded by Jim &amp; her children. The family is grateful for the outpouring of support, but asks for privacy at this time. https://t.co/Sug2o9pQkD https://t.co/N4YSilIIP2","date":"Thu Feb 04 16:03:54 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#TeamCooper is hosting another session of “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” on Tuesday, February 16 @ 6pm. The second in the series: “Tennessee: The 3rd Hardest State to Vote in America.” Register here: https://t.co/pjhBUpcnq5 https://t.co/lVGEPUAdOt","date":"Wed Feb 03 19:58:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee will receive $68 million+ from @FEMA to help with vaccine distribution throughout the state. This is great news to help get every eligible Tennessean vaccinated!","date":"Tue Feb 02 16:44:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I thank @POTUS for taking swift action to repeal the harmful #GlobalGagRule which put health services out of reach for women around the world. I am also proud to support the #GlobalHERAct to permanently repeal the #GlobalGagRule.","date":"Fri Jan 29 21:46:20 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am glad @POTUS &amp; @VP are already addressing the housing crisis &amp; working to keep people in their homes during the #COVID19 pandemic. We also have to rescind the excessive documentation &amp; unnecessary requirements so people get relief as quickly as possible. https://t.co/cGmjtoaVaU","date":"Fri Jan 29 17:54:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’ve joined my colleagues to address ongoing concerns about GA GOP @RepMTG. We’ve requested she be removed from the @EdLaborCmte &amp; be censured. I’ve also co-sponsored a bill to expel her from the House &amp; it will be intro’d next week. She’s a danger to the House &amp; to the country.","date":"Thu Jan 28 21:14:48 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The global gag rule is cruel and harmful, and has denied the most vulnerable women around the world access to life-saving care. I’m glad @POTUS is rescinding the rule and is restoring the ability of women to get the care they need.","date":"Thu Jan 28 19:30:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"GOOD NEWS! @POTUS will open a special enrollment period on https://t.co/EzNZiRmnGR February 15 – May 15 of this year.","date":"Thu Jan 28 18:48:05 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The House passed the Paycheck Fairness Act last year but the Senate never voted on it. Women are paid 82 cents for every $1 paid to men &amp; for Black women, it’s only 62 cents for every $1. I'm glad the PFA is a priority for this Admin &amp; I look forward to a vote in the House soon.","date":"Thu Jan 28 18:35:52 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"On #HolocaustRemembranceDay we must never forget one of the darkest times in our world’s history. #WeRemember the atrocities and hate that led to the deaths of more than 6 million innocent Jews.","date":"Wed Jan 27 21:36:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: You can watch the discussion here: https://t.co/tjr5QdLdYa","date":"Wed Jan 27 20:33:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Rejoining the Paris Climate Agreement was step one, but @POTUS' executive orders today help us tackle the devastating climate crisis that we not only face as Americans but as an entire world. This administration is using facts and science to help preserve our planet. #ClimateDay https://t.co/8ZcwnrYTsG","date":"Wed Jan 27 19:28:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Just wrapped up a great discussion on the future of space policy with @POLITICOLive's @jacqklimas &amp; @BryanDBender, Victoria Samson of @SWFoundation and Peter Garretson @AFPC. #POLITICOSpace https://t.co/WPXZTZmJmg","date":"Wed Jan 27 19:03:52 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"All Americans deserve a fair chance to pursue the American dream. @POTUS' executive orders are a step toward the goal of opportunity for all by strengthening anti-discrimination policies in housing &amp; criminal justice. We have so much work to do &amp; I'm honored to be a part of it.","date":"Wed Jan 27 14:45:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"NEW: #TeamCooper will host “Let’s Talk: Conversations to Ensure Equitable &amp; Just Policies” every Monday starting Feb. 1 @ 6pm. The first in the series: “The Global Pandemic: The New National Response &amp; What it Means for Nashville and Middle TN.” Sign up: https://t.co/fBkO3K3I87 https://t.co/6MuJC62FeP","date":"Tue Jan 26 20:25:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The #transban hurt our military. Anyone who is willing to serve should be able to do so and I'm glad @POTUS rescinded the ban today. #TransBanRepeal","date":"Mon Jan 25 21:19:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Ratification of the Equal Rights Amendment is long overdue - to say the least. Gender equality is still a huge problem in America and Congress should move quickly to pass this resolution to ratify the #ERANow!","date":"Mon Jan 25 20:39:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"One month ago the city of Nashville was ending an already tumultuous year by facing an attack on our downtown core. We are rebuilding, in many ways, in 2021 and our future is bright. #NashvilleStrong https://t.co/6MI6C35SIU","date":"Mon Jan 25 15:53:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville's @Alora_young continues to use her voice to speak truth to power. Check out this @nytimes feature: \n\nhttps://t.co/nq9jZwzwjq","date":"Fri Jan 22 18:23:35 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"General Austin is one of our country’s most respected military leaders. He knows @POTUS and has pledged civilian control of the military will continue. He is well-deserving of a waiver and eminently qualified to serve as America’s next Secretary of the @DeptofDefense.","date":"Thu Jan 21 20:33:42 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Rarely does the House get a chance to weigh in on a President’s cabinet and I take this responsibility very seriously.","date":"Thu Jan 21 20:33:41 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"In December, Congress passed a #COVID19 relief bill that extends the eviction moratorium to the end of January. I am glad @POTUS has already extended the moratorium and is calling for even more relief in his #COVID19 relief plan. Congress needs to pass this plan right away. https://t.co/877lJjaCoA","date":"Thu Jan 21 18:05:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Every American deserves equal protection under the law regardless of sexual orientation, or gender identity or expression. Thankful for @POTUS and the new administration for this. \n\nhttps://t.co/YKpWhRqMBp","date":"Thu Jan 21 17:15:20 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you @POTUS for halting the United States’ withdrawal from the World Health Organization. A global pandemic needs a global response &amp; I’m thankful we had representation at the @WHO meeting today. We will continue working together to combat #COVID19. \n\nhttps://t.co/Eu8fvY6w2v","date":"Thu Jan 21 15:40:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yesterday marked a new beginning for countless American families. After four long years, @POTUS rescinded the Muslim Ban and preserved #DACA . Now Congress should pass the NO BAN Act and the American Dream and Promise Act so that this never happens again. #ByeBan #HomeisHere","date":"Thu Jan 21 14:22:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"✔️✔️✔️","date":"Wed Jan 20 22:51:36 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today is a new day for America as decency and hope are restored in the White House. I look forward to working with @JoeBiden and @KamalaHarris as we move forward as an inclusive, healing, and just country. #InaugurationDay #Inauguration2021 #Inauguration","date":"Wed Jan 20 16:24:19 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: The Senate Committee on Homeland Security and Governmental Affairs held a hearing today on @JoeBiden’s nomination of Alejandro Mayorkas as Secretary of Homeland Security. If confirmed, he would be the first Latino to lead the agency. Watch here: https://t.co/ZV4jWYW1Rt","date":"Tue Jan 19 21:46:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"HAPPENING NOW: The Senate Foreign Relations Committee is holding a hearing on @JoeBiden’s nominee Antony Blinken as Secretary of State: https://t.co/5tSNlOdTiz","date":"Tue Jan 19 21:03:23 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"If it passes, he will be the first African American Secretary of Defense. \nWatch here: https://t.co/mYkobvz109","date":"Tue Jan 19 20:12:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"HAPPENING NOW: Gen. Lloyd Austin will testify before the Senate Armed Service Committee. If confirmed, the House will need to vote on a waiver for him to serve because he hasn’t been out of service for the required seven years.","date":"Tue Jan 19 20:12:51 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"WATCH: The Senate Intelligence Committee held a hearing on @JoeBiden’s nomination of Avril Haines as the Director of National Intelligence. If confirmed by the Senate, she will be the first female to lead the agency: https://t.co/pdFrDrWVhc","date":"Tue Jan 19 18:17:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"WATCH: The Senate is holding a hearing on @JoeBiden's nomination of Janet Yellen as U.S. Treasury Secretary. If confirmed by the Senate, she will be the first woman to serve as Secretary of the @USTreasury⬇️","date":"Tue Jan 19 17:53:44 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am confident President-elect Biden will keep his promise and the U.S. will rejoin the Paris Climate Agreement in 2021. It was reckless and irresponsible to leave the Agreement and we will be spending decades trying to reverse the impact on our climate.\n\nhttps://t.co/qi5d359Dq5 https://t.co/PgdgX6YbgC","date":"Fri Dec 18 20:05:37 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":".@HillsboroBurros student and Nashville’s 2020 Youth Poet Laureate @Alora_young speaks powerful words to commemorate the 100th Anniversary of the ratification of the #19thAmendment of #VotesForWomen. Watch:\nhttps://t.co/RJ3rSBX5YS","date":"Wed Aug 26 15:10:38 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Trump Admin ban on transgender military service members goes against recommendations of several former Surgeons General, military experts, &amp; healthcare orgs. It’s an attack on  service members risking their lives for our country &amp; it should be reversed immediately. #transban https://t.co/CMVx21ZEzi","date":"Thu Jul 09 22:43:40 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Withdrawing the U.S. from the world’s premier health organization in the middle of a global pandemic is a bad idea &amp; a deliberate distraction from the Trump administration’s mismanagement of the crisis.","date":"Fri May 29 20:27:17 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Paycheck Protection Program (PPP) is now open to all eligible lenders and businesses. Find an eligible lender in your area: https://t.co/3mOMMpM4d8","date":"Tue Jan 19 16:47:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Register for today’s Interdenominational Ministers Fellowship #MLKDay  Convocation here: https://t.co/0ZfjoOQU4b","date":"Mon Jan 18 15:53:15 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This past weekend I had the honor of speaking at the Interdenominational Ministers Fellowship’s annual #MLKDay Youth Symposium. Dr. Martin Luther King Jr’s words and legacy can help lead us through dark times as we continue to seek justice for a brighter future. https://t.co/dDvNmy22AH","date":"Mon Jan 18 15:53:12 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"What we need is to get more people covered, not this dangerous experiment that puts our most vulnerable Tennesseans at-risk. #StopTheBlock","date":"Fri Jan 15 22:12:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This overhaul of Tennessee’s Medicaid program was crammed through the TN General Assembly this week. It’s a radical Trump-inspired plan that was only approved at the last minute and I’ve asked @JoeBiden to rescind it when he takes office.","date":"Fri Jan 15 22:12:02 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I’m honored to cosponsor legislation to reward Officer Goodman the Congressional Gold Medal, one of the highest civilian honors, for his bravery. \n\nhttps://t.co/aYGaLOMTlM","date":"Thu Jan 14 21:10:33 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Eugene Goodman, the courageous officer that lured the angry mob away from lawmakers during last week’s insurrection at the Capitol, exemplifies everything that a hero should be. His selfless actions saved countless lives.","date":"Thu Jan 14 21:10:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The immigration process was already breaking down before Trump took office, and then he totally broke it. We need comprehensive immigration reform now, including a humane process for asylees and refugees and a permanent path to citizenship for the Dreamers.","date":"Thu Jan 14 17:33:57 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The President played a direct role in the insurrection at our U.S. Capitol building one week ago today. The majority of the House voted to impeach him again today but he should resign immediately. He is a threat to America &amp; cannot be allowed to continue to assault our democracy. https://t.co/Slwsmmtson","date":"Wed Jan 13 21:29:53 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":".@SBAgov is hosting a webinar for venue operators tomorrow, Jan. 14, at 2pm CT. They will present an overview of the Shuttered Venue Operators Grant program &amp; how to apply. If you're on the waitlist, SBA will send a recording of the webinar. Register here: https://t.co/1AbP9sC8ro","date":"Wed Jan 13 20:25:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The language of the 14th Amendment, which was passed right after the Civil War, may also apply to public officials who incite insurrection or rebellion against our country.","date":"Wed Jan 13 16:34:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This would not only apply to our President, but some of my colleagues. @VP said last night he will not #InvokeThe25th but the President should still be removed for engaging in insurrection. https://t.co/9UhbcIZcfd","date":"Wed Jan 13 16:34:27 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tonight we vote to call on @VP to #InvokeThe25th. Here's a little background on the #25A and why we need it. If he refuses, we will move on to vote for #impeachment tomorrow.\n\nhttps://t.co/aMeuMFivP0","date":"Wed Jan 13 00:42:03 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"💯","date":"Tue Jan 12 23:27:43 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Dickson County COVID vaccinations move to fairgrounds https://t.co/egGIkhqBgd via @tennessean","date":"Tue Jan 12 18:32:00 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Rep. Jim Cooper joins calls for Pres. Trump's impeachment and removal https://t.co/8cWXyrHDCG","date":"Tue Jan 12 14:10:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"#StopTheBlock","date":"Tue Jan 12 00:22:52 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Trump Administration’s last ditch effort to make it look like it actually helped Tennesseans is a failure. The block grant is a dangerous experiment in the middle of a pandemic. Today I sent a letter to President-elect Joe Biden asking him to rescind the approval. https://t.co/A0HVlAR20u","date":"Tue Jan 12 00:16:45 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yes, we need to vote on this ASAP.","date":"Mon Jan 11 18:16:08 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am a co-sponsor and support @davidcicilline, @RepTedLieu and @RepRaskin's resolution.","date":"Mon Jan 11 16:17:34 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee is not getting any favors from the Trump Administration when they delay the waiver for 18 months, then give us leeway in the final week knowing that it will be reversed by the Biden Administration. Everyone in our state needs affordable health care.","date":"Fri Jan 08 21:06:14 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Good news! The deadline for the #BookLoversUnite reading challenge is extended to March 8. This challenge is for elementary, middle and high school students in Cheatham, Davidson &amp; Dickson Counties. Read more about the challenge and how to participate: https://t.co/c7J9X8qoBF https://t.co/9ImxoITRX4","date":"Fri Jan 08 19:23:32 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Officer Sicknick was killed while defending our democracy. I pray for his friends and family, and support a full investigation into his death to hold those responsible accountable.","date":"Fri Jan 08 19:03:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The fastest way to remove the dangerous president would be for @VP to #InvokeThe25th. If he won’t do it, we must immediately take up articles of impeachment. I’ve also joined other colleagues @RepRaskin, @davidcicilline, and @RepTedLieu in co-sponsoring a resolution in the House.","date":"Thu Jan 07 21:37:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"The fastest way for us to remove the dangerous president would be for @VP to #InvokeThe25th. If he won’t do that, we must immediately take up articles of impeachment. I’ve joined my colleague @Ilhan in co-sponsoring this resolution in the House.","date":"Thu Jan 07 20:44:21 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Sometimes when you play with fire you start a bonfire. I joined @RepCori's resolution because peaceful protest is welcome; rioting, sedition, &amp; insurrection are not. Members of Congress who incited the violent attack on our Capitol building yesterday must be held accountable.","date":"Thu Jan 07 20:23:28 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tell @VP to #InvokeThe25th. Pass it on.","date":"Thu Jan 07 18:52:30 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, @NashvilleHealth announced #COVID19 vaccine distribution for Nashville residents 75+ begins Saturday, Jan. 9. You MUST make an appointment here: https://t.co/eqBsfW1XS4 or by calling 615-862-7777. Visit https://t.co/3TEqeYGt2l for more info.","date":"Thu Jan 07 17:42:24 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Rep. Cooper supports impeachment of Trump after day of protests at Capitol https://t.co/ja5mI4DGyf via @wsmv","date":"Thu Jan 07 17:12:29 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"I supported impeachment before and agree we need it now more than ever.","date":"Thu Jan 07 00:10:17 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"My staff and I are currently safe. This is a dark day for America.","date":"Wed Jan 06 20:15:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Never Forget the Names of These Republicans Attempting a Coup https://t.co/dyFEum4zw7","date":"Wed Jan 06 15:28:46 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Clarification: The correct @fema term for what Nashville received is an \"Emergency Declaration.\"","date":"Tue Jan 05 23:20:07 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"@JamesWilsonJr1 @JamesWilsonJr1 Can you send a DM with your contact info? We're happy to try to help! - Cooper Staff","date":"Tue Jan 05 20:30:40 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"A Major Disaster Declaration for Nashville has been approved following the bombing on Christmas Day. This will help local residents and businesses start to rebuild. #nashvillestrong","date":"Tue Jan 05 20:26:56 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"A beautiful tribute to a life lost due to an illness many face every day. My heart breaks for @RepRaskin &amp; his family. If you or someone you know is struggling w/ depression &amp; suicidal thoughts, know you are not alone. Call the National Suicide Prevention Hotline: 800-273-8255.","date":"Tue Jan 05 18:38:39 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/3): Everyone has something valuable to contribute and my constitutional amendment will help us improve elections and society. Voting rights can turn equality-under-the-law into reality.","date":"Mon Jan 04 21:40:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/3): Voters should continue to choose their elected officials—not the other way around. The redistricting process shouldn’t be about protecting the powerful and we need to fix it.\nhttps://t.co/I25Ed1qOrK","date":"Mon Jan 04 21:40:50 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/3): I am honored that Nashvillians and Middle Tennesseans continue to believe in me and I will keep doing the best job I can to represent them in Congress. Sadly we are seeing as the new Congress begins that the right to vote is under attack, maybe more than ever.","date":"Mon Jan 04 21:40:49 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Every living Sec. of Defense (led by no less than Dick Cheney) is now worried that Trump will demand that our military, effectively, stage a coup to keep him in power. Thank goodness we only have 16 more days of this madness but Trump can still do lasting damage in that time.","date":"Mon Jan 04 19:09:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Just like last year, as the @SoFestofBooks kicks off I’m re-introducing the #BookLoversUnite reading challenge for elementary, middle and high school students in Cheatham, Davidson &amp; Dickson Counties. Read more about the challenge and how to participate: https://t.co/c7J9X88Nd5 https://t.co/x78jQ9rjRr","date":"Fri Oct 02 20:21:02 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Everyone should listen to this recording of President Trump’s call to the Georgia Sec. of State. Trump’s attempt to overturn the election in GA, after 3 recounts &amp; many frivolous lawsuits, is worse than Watergate because it strikes at the heart of our democracy &amp; the rule of law.","date":"Mon Jan 04 19:09:13 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is an embarrassment for Tennessee and our country. Voters chose President-elect @JoeBiden and Vice President-elect @KamalaHarris to lead our country for the next four years. To say otherwise is false and contrary to our principles of democracy and everything it stands for.","date":"Sun Jan 03 16:35:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Maybe these elected Members and Senators shouldn’t be sworn-in today if they think they were not fairly elected.","date":"Sun Jan 03 16:35:55 +0000 2021","user_id":"22523087"},{"handle":"RepJimCooper","text":"Trump FINALLY did the right thing and signed the bill for #COVID19 relief, but only after he let unemployment benefits expire for those who need it most. Trump has never acted more irrationally or cruelly. 22 days left.","date":"Mon Dec 28 01:40:05 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashvillians are grateful for the quick action by @GovBillLee to request an emergency declaration to the President. If approved, funding will start flowing to our damaged city. https://t.co/UhExjulS9K","date":"Sun Dec 27 16:58:57 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"They spoke so well and made policing so real. These young officers on the midnight shift represent the best of Nashville and we owe them big time for their bravery and sacrifice.","date":"Sun Dec 27 16:49:57 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Just watched riveting press conference with five of the six @MNPDNashville police men and women who first responded to the eventual bomb blast in Nashville.","date":"Sun Dec 27 16:49:57 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I consider this a serious and intentional attack on American infrastructure. I don't know anybody that would do that except a terrorist.\n\nhttps://t.co/4HiIORcSfe","date":"Sat Dec 26 18:57:14 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Six Nashville police officers saved countless lives Christmas morning here in Nashville. They put the safety and lives of others above themselves and are true heroes.","date":"Sat Dec 26 15:45:34 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Praying for all residents of downtown Nashville on this Christmas Day.","date":"Fri Dec 25 14:44:50 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Merry Christmas &amp; Happy Holidays from #TeamCooper! https://t.co/4zpNdmn0Kc","date":"Thu Dec 24 17:12:27 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Vetoing this defense bill weakens America and hurts our troops. If you needed more proof Trump is acting crazier than ever, his veto of this NDAA is that proof. Only Vladimir Putin's puppet would do this.","date":"Wed Dec 23 21:25:18 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/3): @HouseDemocrats passed the HEROES Act back in May—which provided up to $6,000 in stimulus payments per household. It also continued federal UI payments of AT LEAST $2,400 per month—money that Senate Republicans wanted to let expire. Dems have been trying since May to help.","date":"Wed Dec 23 18:36:33 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/3): President Trump has no interest in the legislative process unless he directly benefits. If he cared at all about helping families, he would know his own party has been blocking larger stimulus checks for MONTHS.","date":"Wed Dec 23 18:36:33 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/3): I am happy to support $2,000 for individual stimulus but this delay and Trump’s threats are really about his ego and his desperate attempts for more publicity as time winds down on his failed presidency.","date":"Wed Dec 23 18:36:33 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I hope we can survive the next 27 days until the inauguration.","date":"Wed Dec 23 14:07:38 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Last night’s presidential pardon spree was one of the most shocking and shameful nights in U.S. history. Trump not only exonerated confessed criminals, murderers and crooks—all his cronies—but tried to trash all Republicans and our democracy in the process.","date":"Wed Dec 23 14:07:37 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yesterday was a historic day. Virginia voted to remove to statue of Gen. Robert E. Lee in the U.S. Capitol and acted within one year. Earlier this year TN finally voted to remove the bust of Nathan Bedford Forrest from the State Capitol but has yet to do so. Why? It’s time.","date":"Tue Dec 22 22:08:46 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Last year I met with Matthew Charles about the importance restoring Pell grant eligibility to incarcerated students. I am proud that this measure was included in the bill we passed yesterday. #PellYes","date":"Tue Dec 22 19:29:18 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"This will allow incarcerated students to leave prison better prepared to support themselves, their families, and their communities. Everyone deserves access to an education. https://t.co/CLeAIZpSfD","date":"Tue Dec 22 17:00:01 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I enjoyed meeting with Matthew Charles and Daniel Landsman this morning.","date":"Thu Oct 17 18:44:35 +0000 2019","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congress just passed the second largest #COVID19 relief bill in history. One important piece of this legislation restores Pell grants for incarcerated individuals.","date":"Tue Dec 22 17:00:01 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We need MORE stimulus and relief until we return to normal and this is not enough help for most families to get through the holidays.","date":"Mon Dec 21 22:03:07 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"It is good there is another round of cash payments and unemployment checks for families—but these have been cut in half in this “stimulus” bill (stimulus checks from $1,200 to $600 and UI benefits from $600 to $300).","date":"Mon Dec 21 22:03:06 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am glad that many parts of the music industry will get targeted help in today’s relief bill. @RepCohen and I were the only two members of the TN delegation to cosponsor #SaveourStages.","date":"Mon Dec 21 21:58:40 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I wish the overall stimulus bill were larger and had been passed months ago but this will help bridge us to the Biden Administration.","date":"Mon Dec 21 21:58:40 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"He also spoke at a team training with my staff and always had time to help educate my interns. I am thankful to have known him and to have learned so much from him.","date":"Mon Dec 21 16:54:00 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Nashville is blessed to have generations of civil rights heroes but many are passing. Kwame Lillard was among the greats that spoke out against injustice and a true leader in our community.","date":"Mon Dec 21 16:54:00 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Phyllis Williams was the kindest, sweetest, most generous person in Nashville. No one embodied the best spirit of our community better than she did. I always looked forward to seeing her at every event. She was sunshine. She was hope. She was grace.","date":"Fri Dec 18 23:18:46 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Trump is failing his fundamental duty to protect and defend America. Why he continues his bromance with Vladimir Putin remains a mystery. Perhaps he still wants to build a Trump Tower in Moscow.","date":"Fri Dec 18 22:05:06 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Russian cyberattack on U.S. businesses and government is deeply disturbing yet President Trump remains silent.","date":"Fri Dec 18 22:05:05 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We saw an incident like this over the summer in Nashville with the violation of Azaria Hines in her own home. The Senate needs to pass the George Floyd Justice in Policing Act which is pivotal to reforming policing in America.\nhttps://t.co/eD4Z98aMer","date":"Fri Dec 18 20:38:55 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Anjanette Young was attacked by the Chicago Police. That is what this was – an attack and gross abuse of power. https://t.co/bKU4PzKBY8","date":"Fri Dec 18 20:38:54 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am confident President-elect Biden will keep his promise and the U.S. will rejoin the Paris Climate Agreement in 2021. It was reckless and irresponsible to leave the Agreement and we will be spending decades trying to reverse the impact on our climate.\n\nhttps://t.co/qi5d359Dq5 https://t.co/PgdgX6YbgC","date":"Fri Dec 18 20:05:37 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Sacklers Face Furious Questions in Rare Testimony on Opioid Epidemic https://t.co/M9d7mvEXly","date":"Fri Dec 18 17:21:08 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"https://t.co/JKbqHsPG6Z","date":"Fri Dec 18 17:20:35 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Family behind OxyContin attests to its role in opioid crisis - ABC News - https://t.co/aFdEfiyH5q via @ABC","date":"Fri Dec 18 17:17:33 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"https://t.co/HiHTQoZgC5","date":"Fri Dec 18 17:13:11 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"'An evil family': Sacklers condemned as they refuse to apologize for role in opioid crisis https://t.co/nrjfEwk0xg","date":"Fri Dec 18 17:10:38 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"2 members of the Sackler family, owners of OxyContin manufacturer Purdue Pharma, refused to take any personal responsibility for the opioid crisis https://t.co/RsUL8sOrKz via @businessinsider","date":"Fri Dec 18 17:09:16 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Sacklers Deny Personal Responsibility for Opioid Epidemic in House Hearing https://t.co/M9d7mvEXly","date":"Thu Dec 17 22:24:12 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"https://t.co/cRYikOs7tB","date":"Thu Dec 17 21:45:39 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Watching the Sackler family’s testimony today made my blood boil. I am not aware of any family in America that is more evil. The victims of Purdue Pharma and the Sackler family’s drugs deserve justice. https://t.co/54ZZWkLI8M","date":"Thu Dec 17 21:21:30 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Volunteers needed to assist with Nashville #COVID19 vaccine rollout https://t.co/xNnj6oS3os","date":"Wed Dec 16 21:00:23 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":".@SenateCommerce held a hearing on the need to support the live events industry during the #COVID19 pandemic. The House has repeatedly passed bills to help #SaveOurStages &amp; the events industry. The Senate should agree to include this in a relief bill. https://t.co/uAlluB4y5s","date":"Wed Dec 16 20:04:19 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Cooper passes Nashville flood prevention bill https://t.co/HdMttsZFAp via @tnlookout","date":"Wed Dec 16 15:16:35 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I can introduce you to a Nashvillian who buried his 49-yr-old friend a few days ago. His friend didn’t believe in masks, and 2 weeks before he died both of his parents died of #COVID19. The head of White House security just left the hospital after 3 months. He lost his right leg.","date":"Tue Dec 15 22:12:32 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We are in the middle of a disaster. We have got to try to save ourselves and those who are most vulnerable in our communities. We should ALL be a part of it.","date":"Tue Dec 15 22:12:32 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee has the most #COVID19 cases per population than any place in the WORLD. I do not know how our Governor can still refuse to issue a mask mandate. We must all step forward to help protect our community. We are ALL the first line of defense against #COVID19.","date":"Tue Dec 15 22:12:32 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"#HappyHanukkah to those observing. May you find love, peace, and light during this time. https://t.co/FAJoCjIFOx","date":"Tue Dec 15 17:21:04 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"TODAY is the last day to shop for 2021 health insurance on https://t.co/JJLHCTOhXq https://t.co/bdiokwIdQU","date":"Tue Dec 15 15:56:46 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"A vaccine is an important step in the fight against #COVID19. As many frontline workers and highest risk populations receive the vaccine over these next few weeks, it will be many months before most people get the vaccine. We have to stay vigilant, social distance, &amp; #WearAMask.","date":"Mon Dec 14 22:23:56 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Tennessee families are struggling to find work and pay their bills. Senate Republicans need to step up and help us pass another #COVID19 relief package. We need the extension of federal unemployment benefits – especially here in Tennessee where the maximum benefit is $275/week. https://t.co/uOPfYjNzJK","date":"Mon Dec 14 20:51:11 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I am embarrassed for our state that so many Tennessee Republicans are refusing to admit who won the presidential election. Every single signatory of that brief should be ashamed of themselves for attempting to destroy our democracy. @JoeBiden is President-Elect.","date":"Fri Dec 11 21:31:07 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/3): Contrary to common sense these dams today may not be used for flood control, even in emergencies, unless they have previously been congressionally authorized to do so.","date":"Fri Dec 11 16:21:52 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/3): A decade ago, all of Nashville - East, West, South, and North Nashville - suffered a devastating flood, costing more than two dozen lives and billions of dollars in damages.\n\nhttps://t.co/2RR0R2mthN","date":"Fri Dec 11 16:21:51 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/3): To mitigate the chance of future flooding we need to allow the two Army Corps of Engineers-operated dams that are directly upstream from Nashville, namely Old Hickory and Cordell Hull, to be used for flood risk management.","date":"Fri Dec 11 16:21:51 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Mis colegas y yo enviamos una carta a @CDCgov pidiéndole a la agencia que eliminara los requisitos de el reportaje de la vacuna #COVID19 que pudieran identificar su situación inmigratoria. Nadie debería tener que temer recibir la vacuna debido a su situación.","date":"Thu Dec 10 22:15:21 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Housing aid MUST be included in the next #COVID19 relief package. The House did its job – twice – and now the Senate needs to step up to the plate. With the eviction moratorium expiring this month, people need help NOW. https://t.co/63GPfCTIFF","date":"Thu Dec 10 20:57:42 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"My colleagues and I sent a letter to @CDCgov earlier this month asking the agency to remove requirements on the #COVID19 vaccine reporting data that could identify immigration status. No one should have to fear getting the vaccine because of their status. https://t.co/SGMtSJnF7D","date":"Thu Dec 10 20:38:35 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Remote learning is challenging for most families, students, &amp; teachers, but kids in low-income households are being left behind. The Institute of Education Sciences (IES) needs more funding to help educators, agencies, &amp; children move forward together and help reverse the loss. https://t.co/1Y7fai1zgs","date":"Thu Dec 10 17:05:31 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is a commonsense bill that both the House &amp; Senate should have agreed to years ago. But hope springs eternal and I’m glad the fifth time is the charm.","date":"Wed Dec 09 17:12:24 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We’ve got to take steps to spend money where it’s needed most. In a pandemic, with record unemployment, we need to know where funds are going – and what should be redirected.\n\nhttps://t.co/Fva6macagp","date":"Wed Dec 09 17:12:24 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We need to pass another #COVID19 relief package as we are on track to have one of the worst, deadliest winters in American history. The package must include another round of stimulus checks to keep Tennessee families afloat. https://t.co/6CvMk4SMyw","date":"Tue Dec 08 22:27:52 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: Un juez federal ordenó @DHSGov que restaurar DACA. Los nuevos aplicantes pueden aplicar y los recipientes pueden renovar su estado AHORA. Anuncio del DHS aquí: https://t.co/K3J1h28Wh0","date":"Tue Dec 08 18:47:50 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"While many small businesses - including restaurants and music venues - affected by #COVID19 can still submit applications, the initial funds ran out &amp; business owners will be stuck waiting to find out if more money will become available. \n\nMore info: https://t.co/8zBPs31rfM","date":"Tue Dec 08 17:18:04 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"The State of TN has nearly $200M left in its Coronavirus Relief Fund and I hope they will consider using some of the remaining to funds to replenish the small business relief program.","date":"Tue Dec 08 17:18:03 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: A federal judge ordered @DHSgov to restore DACA. New applicants can apply and recipients can renew their status NOW. DHS posting here: https://t.co/K3J1h2qx8y","date":"Tue Dec 08 14:56:39 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"ICYMI: @CBSThisMorning &amp; @NancyChenNews highlight why our music venues need critical funding to stay alive. Every member of the TN delegation should support #SaveOurStages.","date":"Mon Dec 07 20:27:04 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"(3/3): We also need hundreds of dollars a week in extra unemployment benefits because Tennessee UI benefits are meager, topping out at about $250 a week. You can't live on that. We must help families who are struggling to find work and keep food on the table.","date":"Mon Dec 07 19:03:16 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"(2/3): During the coldest months, thousands of Tennesseans could be evicted from their homes without government help. No one should be thrown out on the street during this pandemic.","date":"Mon Dec 07 19:03:16 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"(1/3): We desperately need Congress to pass another #COVID19 relief package NOW, before the holidays. We urgently need the help because we are on track to have one of the worst, deadliest winters in American history.","date":"Mon Dec 07 19:03:15 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"On this 79th Pearl Harbor Remembrance Day, please join me in taking a moment to remember those who defended and inspired us on December 7, 1941 and throughout WWII.","date":"Mon Dec 07 17:32:04 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We need equitable access to vaccines, even beyond #COVID19. Racial, ethnic, and geographic disparities in immunization rates persist. We've asked the @USGAO to conduct a review of Medicaid &amp; CHIP program vaccination coverage. We must close the coverage gap in our communities. https://t.co/qE9FEhNHGO","date":"Fri Dec 04 19:45:51 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I was so happy to support and promote my colleagues for leadership positions. They ran competitive races with other talented people, but these individuals are the best leaders for us right now. The diversity of our caucus is our strength. https://t.co/bHv79ogHQw","date":"Fri Dec 04 18:05:16 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"TODAY: Experts from the @TNDeptofHealth join @atul_gawande &amp; other public health leaders around the country to discuss the #COVID19 vaccine &amp; equity. Register here: https://t.co/2GH1Vam8OV","date":"Fri Dec 04 15:21:45 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"REMINDER: You can shop #ACA Marketplace plans until December 15th. Check out your options now: https://t.co/mypBwSD6pP https://t.co/NmZVEiRp3P","date":"Thu Dec 03 23:15:17 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I agree, @NashvilleCVC! The House passed the RESTAURANTS Act that would help great restaurants like @HuskNashville stay afloat this winter. We must call on the Senate to act.","date":"Wed Dec 02 20:13:48 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We can appreciate science now more than ever, and hopefully boost the budgets of government-funded programs so that more scientists can do more great work to help lead our nation, our world, and our universe forward. Watch the #GGA20 @GoldGooseAward Ceremony now:","date":"Tue Dec 01 21:19:29 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Reminder of the Tennesseans who do not support #SaveOurStages: https://t.co/iG4yv3fAxW","date":"Tue Dec 01 21:05:39 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you for helping amplify the need for us to #SaveOurStages, @washingtonpost!\n\nOur local music venues here in Nashville are the soul of our city.\n\n📸: @EXIT_IN's @chriscobbrules https://t.co/he6Zllf1t9","date":"Tue Dec 01 20:10:38 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Today, on World AIDS day, we remember those we’ve lost to the disease, celebrate the advances we’ve made in controlling HIV/AIDS, and honor all those who work tirelessly to end the HIV epidemic. #WorldAIDSDay","date":"Tue Dec 01 17:59:43 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"#COVID19 has a greater impact on communities of color but we don't need the virus to highlight the serious racial disparities across Nashville. Along with my colleagues, I've asked the @CDCGov to improve research &amp; address racial disparities to prevent more deaths.","date":"Mon Nov 30 21:03:42 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Arts and culture nonprofits located in Davidson County are now eligible for operational funding through Metro CARES. \n\nGrants are first come, first served, so apply today! For more information visit: https://t.co/S35pW7ho1f","date":"Mon Nov 30 17:15:30 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"As we distantly &amp; virtually gather with friends and family today, I wish everyone a Happy #Thanksgiving!","date":"Thu Nov 26 19:08:53 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is another predictable but gross abuse of power by Trump. He should spend his last days in office fighting this pandemic and saving American lives, not pardoning a traitor.","date":"Wed Nov 25 22:59:27 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We all make mistakes and I take full responsibility for mine.\n\nI’m grateful that Middle Tennesseans support me when I’m right and scold me when I’m wrong.\n\nI sincerely apologize and hope you’ll read my full statement here:","date":"Wed Nov 25 19:54:34 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Student loan debt was already at a tipping point in America and has been totally exacerbated by the #COVID19  pandemic. I joined my colleagues in urging President Trump to do the right thing and continue the moratorium on payments until next year. Time is running out. https://t.co/yYktzI93wB","date":"Tue Nov 24 19:19:51 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations to former Tennessee Titan @RepColinAllred on your @demcaucus Leadership position! @Titans","date":"Tue Nov 24 17:35:16 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations to @RepPeteAguilar as Vice Chair of @HouseDemocrats! This is the strongest and most diverse leadership in history.","date":"Tue Nov 24 17:35:16 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations to @RepJeffries as he leads @HouseDemocrats as Chair next Congress. I look forward to working with the next presumptive Speaker of the House.","date":"Tue Nov 24 17:35:15 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations to my friend @RepKClark on her role as Assistant Speaker! She is the 2nd highest ranking woman in Congress and our future is in great hands!","date":"Tue Nov 24 17:35:15 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"It's about time the @USGSA finally recognized what most Americans already know - @JoeBiden and @KamalaHarris won the election and will be the next President and Vice President of the United States. Now the transition process can formally start and America can begin to heal.","date":"Tue Nov 24 13:39:48 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"ATTN: If you have not received a #COVID19 stimulus check, and are eligible to receive one, the deadline to register online using the Non-Filers tool is tomorrow. Register here: https://t.co/tPnoBO6y4V https://t.co/ZhAqWfX6ox","date":"Fri Nov 20 21:38:08 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"It's open enrollment season for #ACA Marketplace plans until December 15th and Medicaid/CHIP are open all year-long! \n\nCheck out your options now: https://t.co/JJLHCTOhXq","date":"Fri Nov 20 20:44:22 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":".@CDCGov advises against traveling for the Thanksgiving holiday. My family cancelled Thanksgiving plans &amp; my grandson’s first birthday, which I was very much looking forward to. Due to #COVID19 you just can’t have even small gatherings. Stay safe and #WearAMask.","date":"Fri Nov 20 14:17:40 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Schools are doing their best right now &amp; I worry many will not be able to distribute the cards before the arbitrary 30-day deadline. Tennessee will once again forfeit MILLIONS of federal dollars. Any reasonable observer can easily see that many needy families may not get help.","date":"Thu Nov 19 22:17:04 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":".#NCA5 is crucial. The report by 13 fed agencies &amp; 300+ scientists is our most comprehensive look at the climate crisis. Ignoring scientists will have apocalyptic consequences. The Trump admin is undermining its experts &amp; we must protect the report from political interference. https://t.co/yRqZXSRaYX","date":"Thu Nov 19 19:25:40 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"I couldn't agree more, @nytopinion! The House passed relief for restaurants but the Senate still refuses to act.","date":"Thu Nov 19 17:40:46 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"This was the safest, most secure, election in our nation’s history. Anyone who says otherwise is just playing into conspiracy theories to fit a false narrative. CISA Director @C_C_Krebs' service to this country should be remembered and valued, not go down in flames of tweets.","date":"Wed Nov 18 16:42:15 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"David's passion for service and love for his community was unmatched. This is an immeasurable loss. My condolences to his family, friends, and all who had a chance to meet such a wonderful person.","date":"Tue Nov 17 15:26:53 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thanks for having me, @PureLove1818 &amp; @gaybcnewsradio! I'm happy to come back anytime.","date":"Tue Nov 17 13:38:49 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Unbelievable. Families and children are suffering and the State of Tennessee is still hoarding funds that Tennesseans need now more than ever.","date":"Mon Nov 16 14:57:30 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"The global gag rule is harmful. This expanded rule will be catastrophic. It is another attempt by the Trump Admin to stop the most vulnerable women from accessing life-saving care. The State Dept’s own review revealed serious disruptions to global health. https://t.co/FIb41Ot5z7","date":"Fri Nov 13 19:40:25 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We need to extend the halt on evictions. @HouseDems have already passed a relief bill - twice - that included money for housing needs. Trump &amp; @senatemajldr still refuse to help. #COVID19 is a public health emergency &amp; it will only get worse if homelessness increases. https://t.co/JxQGVsZqp6","date":"Thu Nov 12 17:15:45 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Freight trains should never block roadways for hours. @Sledgefor17 is constantly hearing from folks here in Nashville who are delayed, and even late to work, because of the carelessness of these rail companies.\n\nhttps://t.co/iM2ZLnxfHo","date":"Thu Nov 12 14:09:31 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"My idea to impose fines on stopped trains that block an intersection for 10+ minutes was included in the House’s infrastructure package, which is stalled in the Senate. I encourage @SenAlexander, @MarshaBlackburn &amp; @BillHagertyTN to do the right thing and help Middle Tennesseans.","date":"Thu Nov 12 14:09:31 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Affordable Care Act saves lives. Listen to two #TeamCooper staff members explain what happened yesterday in the Supreme Court, and what’s at stake: https://t.co/nDytgW5Seh","date":"Wed Nov 11 21:41:01 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"The students at Goodlettsville Elementary School always put on the most inspiring #VeteransDay program. Today, as we honor all of those who serve in our military, I’m sharing a few photos of last year’s program. https://t.co/qiwVlvOvn8","date":"Wed Nov 11 15:44:05 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"P.S. I know the GSA administrator’s name is “Emily Murphy,” not “Emily Hughes,” but maybe I can be forgiven for not knowing the name of a Trump bureaucrat who is holding up the Biden transition in service to a defeated president.","date":"Tue Nov 10 17:51:13 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Before I head back out with my chainsaw, I wanted to share the way I see where we are as a country right now. I’ll provide further updates when I’m back in D.C. next week.\n\nhttps://t.co/Tki9rBilc5","date":"Tue Nov 10 17:51:13 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Learn more about available assistance by calling 615-736-6900 of visiting https://t.co/LPXIKFyjai","date":"Tue Nov 10 17:06:33 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"The Supreme Court is hearing arguments about the #ACA. Follow along here: https://t.co/k18pbDp5vv","date":"Tue Nov 10 15:49:33 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"@tnteab @GovBillLee @JohnCooper4Nash @MarshaBlackburn @SenAlexander @VoteBo @DickersonforS20 Hi, @tnteab! Can you send a DM with your contact info? Thanks - Cooper Staff","date":"Mon Nov 09 22:21:04 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Congratulations @JoeBiden &amp; @KamalaHarris. Let’s get to work!🇺🇸","date":"Sat Nov 07 16:39:50 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"This is ridiculous. Stopped freight trains should never block Nashville roadways, especially during rush hour. My plan to impose fines on trains that block crossings for more than 10 minutes was included in our infrastructure package but the Senate has refused to vote on it.","date":"Fri Nov 06 18:42:52 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Security Summit partners warn taxpayers of new #COVID19-related text scam https://t.co/pxTy7dIOMk","date":"Thu Nov 05 18:29:59 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Deporting these witnesses is an abuse of power and against @DHSgov's own policy. What happened to these women is unacceptable and now the administration wants to cover it up.\n\n@VICENews \n@ImmCivilRights","date":"Thu Nov 05 16:20:19 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"#WaitForIt\n#EveryVoteCounts #CountAllTheVotes #CountEveryVote\n#Election2020 \n🇺🇸","date":"Wed Nov 04 17:59:33 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"We knew this wouldn’t be easy. We knew that counting absentee ballots in states that wouldn’t allow that counting to begin until Election Day would delay the outcome. We need to count all the votes. #WaitForIt #EveryVoteCounts #CountAllTheVotes #CountEveryVote","date":"Wed Nov 04 14:18:53 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Voting in Davidson Co. today? You can find your polling location here: https://t.co/iWpKgtHOOt\n\n#StayInLine #VOTE #Vote2020 #Election2020 #ElectionDay","date":"Tue Nov 03 19:15:02 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you, @leslieodomjr for sharing the importance of why we need to #WaitForIt. Every vote counts.\n\n#VOTE","date":"Tue Nov 03 18:07:14 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yes, @johnpavlovitz! \n\nVoting absentee in TN-05? Take your completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St., Ashland City\n\nDavidson Co. - 901 Broadway downtown\n\nDickson Co. - 4 Court Sq., Charlotte\n\n#VOTE #Vote2020 #DropOffYourBallot","date":"Tue Nov 03 19:10:01 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Voting today in Nashville?\n\nFind your polling location here: https://t.co/iWpKgtHOOt\n\nVoting absentee in TN-05? Take your completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St., Ashland City\nDavidson Co. - 901 Broadway downtown\nDickson Co. - 4 Court Sq., Charlotte\n\n#VOTE","date":"Tue Nov 03 18:57:45 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thank you, @leslieodomjr for sharing the importance of why we need to #WaitForIt. Every vote counts.\n\n#VOTE","date":"Tue Nov 03 18:07:14 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Inspiring words from @BerniceKing.\n\nVoting today in Nashville? Find polling location: https://t.co/iWpKgtHOOt\n\nVoting absentee in TN-05? Take completed &amp; signed ballot to:\n\nCheatham - 102 N. Vine St., Ashland City\nDavidson - 901 Broadway\nDickson - 4 Court Sq., Charlotte\n\n#VOTE","date":"Tue Nov 03 17:06:39 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"#livelongandprosper, @GeorgeTakei!🖖\n\nVoting today in Nashville? Find polling location: https://t.co/iWpKgtHOOt\n\nVoting absentee in TN-05? Take completed &amp; signed ballot to:\n\nCheatham - 102 N. Vine St., Ashland City\nDavidson - 901 Broadway\nDickson - 4 Court Sq., Charlotte\n\n#VOTE","date":"Tue Nov 03 16:56:19 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Thanks for reading and sharing, @davidplazas!📃","date":"Tue Nov 03 16:26:26 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"💯Yes, @raulmalo01 &amp; @MavericksMusic!\n\nVoting today in Nashville? Find polling location: https://t.co/iWpKgtHOOt\n\nVoting absentee in TN-05? Take completed &amp; signed ballot to:\nCheatham - 102 N. Vine St., Ashland City\nDavidson - 901 Broadway\nDickson - 4 Court Sq., Charlotte\n\n#VOTE","date":"Tue Nov 03 15:46:20 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"#MAYTHEFORCEBEWITHYOU, @StationCDRKelly!\n\nVoting in Nashville? Find polling location: https://t.co/iWpKgtHOOt\n\nVoting absentee in TN-05? Take completed &amp; signed ballot to:\n\nCheatham - 102 N. Vine St., Ashland City\nDavidson - 901 Broadway\nDickson - 4 Court Sq., Charlotte\n\n#VOTE","date":"Tue Nov 03 15:37:38 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yesterday TN finally joined the rest of the country &amp; will provide Medicaid coverage to children with severe disabilities, regardless of their families’ income. Now TN needs to join 39 other states &amp; expand Medicaid to provide health coverage to 300,000 low-income Tennesseans.","date":"Tue Nov 03 15:16:09 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"\"Today is your day.\" Listen to @JoyAnnReid! Voting in Nashville? Find location: https://t.co/iWpKgtHOOt\n\nVoting absentee in TN05? Take completed &amp; signed ballot to:\n\nCheatham - 102 N. Vine St., Ashland City\nDavidson - 901 Broadway downtown\nDickson - 4 Court Sq., Charlotte\n#VOTE","date":"Tue Nov 03 15:12:21 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":".@oliviawilde is right! Voting today in Nashville? Find your polling location: https://t.co/iWpKgtHOOt\n\nVoting absentee in TN-05? Take your completed &amp; signed ballot to:\n\nCheatham - 102 N. Vine St., Ashland City\nDavidson - 901 Broadway\nDickson - 4 Court Sq., Charlotte\n\n#VOTE","date":"Tue Nov 03 14:28:16 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Yes, @atrupar! Voting today in Nashville? Find your polling location here: https://t.co/iWpKgtHOOt\n\nVoting absentee in TN-05? Take your completed &amp; signed ballot to:\n\nCheatham - 102 N. Vine St., Ashland City\nDavidson - 901 Broadway downtown\nDickson - 4 Court Sq., Charlotte\n#VOTE","date":"Tue Nov 03 13:13:20 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Awesome, @joshuadubois! Voting absentee in TN-05? Take your completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St., Ashland City\n\nDavidson Co. - 901 Broadway downtown\n\nDickson Co. - 4 Court Sq., Charlotte\n\n#VOTE","date":"Mon Nov 02 22:06:46 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"The same is true here in TN, @AriBerman. Voting absentee in TN-05? Take completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St., Ashland City\n\nDavidson Co. - 901 Broadway downtown\n\nDickson Co. - 4 Court Sq., Charlotte\n\n#VOTE","date":"Mon Nov 02 19:02:46 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Agree, @PeteButtigieg! Voting absentee in TN-05? Take completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St., Ashland City\n\nDavidson Co. - 901 Broadway downtown\n\nDickson Co. - 4 Court Sq., Charlotte\n\n#VOTE","date":"Mon Nov 02 18:48:21 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Listen to @MagicJohnson! Voting absentee in TN-05? You can take completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St., Ashland City\n\nDavidson Co. - 901 Broadway downtown\n\nDickson Co. - 4 Court Sq., Charlotte\n\n#VOTE","date":"Mon Nov 02 18:29:19 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"10/10 @jmeacham","date":"Mon Nov 02 16:55:51 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"¡La inscripción abierta de atención médica comenzó ayer! Visite en línea o llame al 1-800-318-2596 para obtener cobertura para 2021: https://t.co/xnzaKAbuZy","date":"Mon Nov 02 16:12:40 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Health care open enrollment started yesterday! Visit online or call 1-800-318-2596 to get coverage for 2021: https://t.co/JJLHCTOhXq &amp; https://t.co/xnzaKAbuZy","date":"Mon Nov 02 14:59:58 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":".@StephenKing is right, but in TN you have to drop it off at a designated @USPS location. Voting absentee in TN-05? Take completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St., Ashland City\n\nDavidson Co. - 901 Broadway downtown\n\nDickson Co. - 4 Court Sq., Charlotte\n\n#VOTE","date":"Sat Oct 31 17:08:56 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":".@ASlavitt is right. If you’re voting absentee in TN-05, you can take your completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St. in Ashland City\nDavidson Co. - 901 Broadway downtown\nDickson Co. - 4 Court Sq. in Charlotte\n\n#VOTE","date":"Sat Oct 31 16:17:50 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"#VOTE","date":"Sat Oct 31 15:22:29 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"While we can no longer @VoteEarlyTN (which I agree is the greatest, @birbigs) if voting absentee in TN-05, take your completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St. in Ashland City\nDavidson Co. - 901 Broadway downtown\nDickson Co. - 4 Court Sq. in Charlotte\n\n#VOTE","date":"Sat Oct 31 15:19:56 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"While we can no longer @VoteEarlyTN like my fellow banjo player @SteveMartinToGo, if voting absentee in TN-05 take completed &amp; signed ballot to:\n\nCheatham Co. - 102 N. Vine St. in Ashland City\nDavidson Co. - 901 Broadway downtown\nDickson Co. - 4 Court Sq. in Charlotte\n\n#VOTE ￼","date":"Sat Oct 31 14:58:45 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"⬇️ #Vote2020 #VOTE⬇️","date":"Fri Oct 30 18:40:45 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"\"Be one of those people\" - @jonfavs is right. If you're voting absentee in TN-05, you can take your completed &amp; signed ballot now to:\n\nCheatham Co. - 102 N. Vine St. in Ashland City\nDavidson Co. - 901 Broadway downtown\nDickson Co. - 4 Court Sq. in Charlotte\n\n#VOTE","date":"Fri Oct 30 17:39:51 +0000 2020","user_id":"22523087"},{"handle":"RepJimCooper","text":"Listen to @ezraklein. If you're voting absentee in TN-05, you can take your completed &amp; signed ballot between now and next Tuesday to: \n\nCheatham Co. - 102 N. Vine St. in Ashland City\nDavidson Co. - 901 Broadway downtown\nDickson Co. - 4 Court Sq. in Charlotte\n\n#VOTE","date":"Fri Oct 30 14:32:47 +0000 2020","user_id":"22523087"}]