[{"handle":"RepJackBergman","text":"House Democrats should have a prime-time televised “hearing” on this —&gt; https://t.co/S2BnPRsF33","date":"Fri Jun 10 14:37:49 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, we remember and honor the life and legacy of our brothers and sisters who selflessly gave their all so that we can live freely in the greatest Nation in history. \n\nMay we never forget the price they paid. \n\nMay we always remember their sacrifice. https://t.co/CMaaaWr0dl","date":"Mon May 30 12:21:58 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The individual and collective efforts made by so many in Otsego County￼ since Friday’s devastating tornado have truly been remarkable. \n\nToday, I sat down with local leadership and visited neighborhoods in Gaylord to hear directly about the needs and challenges still ahead. https://t.co/puCStSSkmk","date":"Wed May 25 20:08:20 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Found out I’ve been “blacklisted by Russia” in the newest round of sanctions.\n\nAs a 2nd Lt. in Vietnam, my career in the Marines, and as a MOC - I’ve dedicated my life to fight against dictators &amp; brutal oppressive tyrants. \n\nI wear this move by the Kremlin as a badge of honor.🇺🇸","date":"Thu Apr 14 20:58:22 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"To all my brothers and sisters who served in the Vietnam War - Thank you. \n\n#NationalVietnamWarVeteransDay https://t.co/1zWHcp1pmt","date":"Tue Mar 29 15:21:48 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great to start the day in Menominee County! \n\nThank you to the team at L.E. Jones for the opportunity to see firsthand the work you do every day and learn more about the quality products made by #Mi01 labor. https://t.co/Cw8BaEhcp7","date":"Sat Mar 26 19:19:59 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Read the full release here ⤵️\n\nhttps://t.co/r9eWPLqN5b","date":"Tue Mar 08 19:51:24 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Taxpayer dollars should not benefit the bottom line of corporations actively working to erode our Second Amendment rights. The Firearm Industry Non-Discrimination (FIND) Act will fight back against “boardroom gun control” and protect our Second Amendment rights./2","date":"Tue Mar 08 19:51:24 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Large financial institutions and corporations have adopted policies designed to hurt the firearm industry. \n\nWe’re fighting back!\n\nToday, I introduced a bill to prevent businesses that discriminate against firearm businesses or associations from contracting with the fed govt. /1","date":"Tue Mar 08 19:51:23 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Don’t let Biden’s #StateOfTheUnion speech fool you - his Administration has done NOTHING to secure our southern border. https://t.co/x3mIQGFtH9","date":"Wed Mar 02 03:02:57 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My statement regarding #RussiaUkraineConflict to @petoskeynews ⤵️ https://t.co/5h5Vgz6pRj","date":"Thu Feb 24 21:32:18 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Energy security is National security.","date":"Thu Feb 24 18:01:16 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"If Biden and Dems were serious about fighting Russian aggression they would be fighting to create energy independence. \n\nLine 5 transports 540,000 barrels a day.\n\nKeystone XL was slated to produce 830,000 barrels a day.\n\nWe currently import over 595,000 barrels a day from Russia.","date":"Thu Feb 24 17:59:58 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"U.P. Gold!!!\n\nProud to join with so many from our community to welcome home U.S. Olympian and GOLD medalist Nick Baumgartner!\n\nGo #TeamUSA 🇺🇸 https://t.co/OC0ZFxFUuy","date":"Tue Feb 15 00:08:55 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"GOLDEN!!! \n\nCongratulations to the UP’s own Nick Baumgartner and Lindsey Jacobellis on bringing home the 🥇","date":"Sat Feb 12 03:29:48 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"When @POTUS hosts Qatar’s emir at the White House, he should demand the regime actually take concrete measures to change repressive laws restricting press freedom, women's rights and immediately end migrant labor abuses.\n\nRead my full op-ed in @Newsweek⤵️\n\nhttps://t.co/t7yFqLnYvy","date":"Sun Jan 30 17:57:11 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Qatar supports the anti-American, pro-Iranian Houthi terrorist group, which recently launched a terror drone attack against the UAE. \n\nIs that how an American ally acts? \n\nhttps://t.co/urIru7TFpm","date":"Sat Jan 29 01:00:39 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"BREAKING: U.S. Supreme Court BLOCKS Biden’s overreaching vaccine requirement for U.S. businesses!","date":"Thu Jan 13 19:43:25 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"President Biden has ceded our southern border to the cartels. \n\nHalting wall construction. \n\nResisting the remain in Mexico policy.\n\nReleasing illegals into the homeland. \n\nThese America Last policies must be defeated.","date":"Thu Jan 13 02:18:12 +0000 2022","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I would like to wish you a very Merry Christmas and a happy and healthy New Year. https://t.co/DACboV7yNE","date":"Sat Dec 25 01:11:03 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"What is one to make of the Biden Pentagon’s proposal to sell $500 million worth of armed drones to the Qatari regime - known for its cyberattacks against American orgs, and ties to terrorist orgs such as Hamas and the Taliban?\n\nMy latest in the @dcexaminer https://t.co/hDJhipo0JS","date":"Sat Dec 18 15:47:14 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Michiganders agree: End the mandates - NOW!","date":"Fri Dec 17 15:33:31 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/AsSYpBhzck","date":"Wed Dec 01 18:31:01 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"President Biden is the President of leaving YOU behind.\n\nHe'll leave you behind in Afghanistan. \n\nHe'll leave your job behind if you don’t follow his mandates.\n\nHe'll leave our border behind. \n\nHe'll leave our economy behind. \n\nIt's time to leave Biden's bad policies behind.","date":"Wed Dec 01 18:30:17 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/YR2qKUDW3A","date":"Tue Nov 30 15:00:33 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We must support peace - not Taliban-supporting regimes. \n\n@POTUS should reject Qatar’s request for armed Reaper Drones.","date":"Tue Nov 30 14:59:49 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you @RepBillJohnson @RepTedBudd @RepBrianBabin @RepGarretGraves @RepRonnyJackson @RepAndyHarrisMD @RepGosar @RepTimmons @RepAndyBiggsAZ @TXRandy14 @RepBobGood @replouiegohmert @RepRickCrawford @RepMoolenaar @RepMoBrooks @RepBenCline @RepRalphNorman @RepMattGaetz","date":"Tue Nov 23 18:32:58 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, my colleagues and I sent a letter to the Biden Administration condemning massive payouts to illegal immigrants and instead - requesting compensation for Angel families. \n\n@POTUS immigration policies are dangerous and destructive. \n\nhttps://t.co/C3dYftABRR","date":"Tue Nov 23 18:32:57 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our hearts are broken for all of the families and loved ones affected by this terrible tragedy in Waukesha, Wisconsin. Our prayers will continue tonight and in the days ahead for all.","date":"Mon Nov 22 02:46:19 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The President needs to show China and the rest of the world that we will stand with Taiwan. We cannot waiver in our defense of democracy.\n\nAggression by China against the U.S. and our allies cannot be tolerated by the administration.","date":"Wed Nov 17 17:13:40 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy 246th Birthday, @USMC!\n#SemperFi https://t.co/tl3zE7Sjdr","date":"Wed Nov 10 15:39:27 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This comes as no surprise to Michiganders.","date":"Fri Nov 05 18:46:55 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s a bad day for Pelosi, but a good day for the U.P. timber industry….\n\nDems are infighting over the 2000+ page bill text finalized last night for Biden’s Build Bureaucracy Bigger plan.\n\nThis entire tax and spend plan is a sham that targets your wallet and our way of life. https://t.co/RqH5v7dXXI","date":"Fri Nov 05 15:39:30 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"But the White House will likely remind us that we supposedly saved about 16 cents on our July 4th barbecues.","date":"Tue Nov 02 20:22:35 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"President Biden wants to offer $450,000 AND amnesty to criminal illegal immigrants - while working families will struggle to pay heating bills this winter because of Biden’s bad energy policies. \n\nI fought in uniform to protect the American Dream - this President is destroying it","date":"Fri Oct 29 12:33:02 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Two months later, and there are still hundreds of Americans reportedly still trapped in Afghanistan.  \n\nSecretary Blinken MUST resign!","date":"Wed Oct 27 17:02:01 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Fixing the supply chain crisis is far more important than pushing the Green New Deal on Americans. \n\nGuess which one House Dems are cramming into their multi-trillion dollar spending spree?","date":"Thu Oct 21 14:33:42 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Last night, joined by my Michigan House colleagues and @SenStabenow, we gathered on the U.S. House floor to honor the life and legacy of Congressman Dan Benishek, who proudly served Michigan’s First District in U.S. Congress for six years.\n\nhttps://t.co/MswMIHsYCH","date":"Wed Oct 20 15:05:27 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We must stand firm against China. The latest hypersonic tests are just another example of dangerous behavior from China. \n\nThis threat is real, and it’s happening now.\n\nThe Biden Admin. needs to show China, and the rest of the world, we will NOT allow this type of aggression.","date":"Wed Oct 20 13:30:35 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"General Colin Powell was a great American leader. His autobiography, My American Journey, remains one of my most inspirational reads.\n\nTo quote General Powell: “Never step on enthusiasm.” He never did. \n\nMay God rest his soul and comfort his family. https://t.co/0FTCsIgSmd","date":"Mon Oct 18 17:56:09 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I are deeply saddened to learn of the untimely passing of Congressman “Dr. Dan” Benishek. https://t.co/geKdRnnvAd","date":"Sat Oct 16 21:12:07 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Biden’s Build Bureaucracy Bigger plan is a nightmare for freedom-loving Americans. \n\nhttps://t.co/MUyJ9AcTNr","date":"Wed Oct 06 12:55:37 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I want to expose the real truth about the so-called infrastructure portion of the Democrats' destructive $5.5 trillion package. You can read for yourself - only a fraction goes to roads, bridges, broadband, and other things people outside the swamp would consider infrastructure. https://t.co/A90ylBii8m","date":"Tue Sep 28 20:00:45 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Sec. Blinken acted too slow on Afghanistan. Troops died. We can’t let that happen to our Vets. \n\nHere’s my response when Democrats blocked my urgent attempt to help Veterans dealing with mental health issues in the face of the Afghanistan debacle. https://t.co/Topd7YjlaV","date":"Mon Sep 13 20:16:15 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As Americans, let us remember the resolve we felt on that day, the commitment we brought to the fight, and the unity we promised we would always remember. \n\nWe will never forget.","date":"Sat Sep 11 14:28:19 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"20 years later, and the images of that fateful day are still burnt into our hearts and minds as we watched radical terrorists take aim at our Nation. Nearly 3000 souls perished that day, and the course of our Nation was forever changed.","date":"Sat Sep 11 14:28:19 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The staff has been working overtime for weeks now on projects like this to help American citizens and our Afghan allies escape Afghanistan following the botched withdrawal of our Armed Forces and the failures of the State Department.\n\nThis is the work we do every day!","date":"Fri Sep 03 02:05:44 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I wanted to bring light to a “good news” story in the middle of a lot of negative. \n\nI’m so proud of the work Team Bergman and State Rep. Damoose did in a successful effort to help an Afghan-American rescue his wife from the hands of the Taliban. https://t.co/DFxUl7LGKL","date":"Fri Sep 03 02:05:44 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The withdrawal in Afghanistan has been an absolute diplomatic failure of historic proportions by this Administration - and it’s costing lives. \n\nThis morning, I joined @FoxFriendsFirst (live from Watersmeet) to talk about the ongoing situation and need for real leadership.","date":"Fri Aug 27 14:51:32 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"God bless our @USMC. Semper Fi. https://t.co/KAosBpOQtc","date":"Thu Aug 26 20:33:01 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Leadership shows when it’s put to the test. We are being put to the test and the world is watching. We must not leave anyone behind. \n\n@POTUS - Step up or step out! https://t.co/qN5Dy7RjFL","date":"Tue Aug 24 16:32:15 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Having seen firsthand the sacrifice our warfighters made in this region, abandoning our allies is a national embarrassment and a disgrace to the men and women who have given their life to defeat terrorism. /Fin","date":"Mon Aug 16 15:53:58 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"What we are seeing unfold this week in Kabul is much like what we witnessed in Saigon in 1975. \n\nThis failure isn’t on our troops. \n/3","date":"Mon Aug 16 15:53:58 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The manner in which our troops were withdrawn under President Biden has led to a total collapse in the government. Countless lives will undoubtedly be lost and the region further destabilized as the Taliban regains footholds across the region. /2","date":"Mon Aug 16 15:53:57 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The Biden Administration is flailing from crisis to crisis with a total lack of leadership and no plan. The situation in Afghanistan is complex - as we’ve seen after two decades of our Nation’s involvement fighting terrorists in the region. /1","date":"Mon Aug 16 15:53:57 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On Friday, I headed to Alanson and Indian River to meet constituents to discuss wastewater infrastructure, view the lock, talk about natural resources, and hold a Q&amp;A with local constituents.\n\nIt’s imperative we protect our waterways - I’m proud to support this important project. https://t.co/KbOHUHTAeW","date":"Tue Aug 10 15:09:18 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On the Indian River this afternoon at Howe Marine speaking about wastewater infrastructure, our inland waterways, and the need for continued investments to keep our District moving forward. https://t.co/a2i0S7figl","date":"Fri Aug 06 20:18:41 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to joining @TraverseConnect this morning!","date":"Fri Aug 06 13:06:38 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I introduced important bipartisan legislation with @RepCindyAxne to improve Medicaid and protect patients nationwide.\n\nRead more ⤵️ https://t.co/eN3rCqSOBh","date":"Tue Jul 27 20:15:30 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I renewed my call for @TheJusticeDept to initiate an investigation into the @StimsonCenter for violations of the Foreign Agent Registration Act, after they saw fit to violate U.S. law by lobbying against the HACT Act without registering as an agent of a foreign government.","date":"Mon Jul 19 18:00:21 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Unregistered lobbying activity is, in itself, enough to warrant investigation. But lobbying efforts on behalf of the @StimsonCenter raises grave concerns of ongoing foreign government influence operations that undermine our Nation's legislative process.\n\nhttps://t.co/Bl8fc3GDjF","date":"Mon Jul 19 18:00:20 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, joined by Ranking Member @RepBost and 40 of my colleagues, we sent a letter to VA Secretary McDonough urging an immediate reversal of his decision. https://t.co/o4Jb1LKSKJ","date":"Thu Jul 15 16:15:35 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s simple — the VA should not be prioritizing and paying for gender transition surgeries while thousands of Veterans with toxic exposures get ignored and pushed to the back of the line, or while other Veterans are still facing wait times for care.","date":"Thu Jul 15 16:15:33 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Socialism and communism have failed everywhere they have been tried. Freedom will always prevail. \n\nAmericans stand united with Cubans as they march for liberty and freedom! #Cuba https://t.co/O96BhS58uZ","date":"Mon Jul 12 17:41:39 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’m proud to be a part of the launch of the Conservative  @climate_caucus and join dedicated Republican Members of Congress in fighting for legislation that boosts both the American environment and economy.","date":"Wed Jun 23 17:56:30 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Protecting the climate for future generations doesn’t have to come at the cost of killing jobs and American innovation.\n\nClimate policies can benefit American workers, national security, the economy AND the environment – radical progressive ideas are not the answer. https://t.co/IzgJUoW2G8","date":"Wed Jun 23 17:56:29 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Visited with Eagle Mine leadership in Marquette to continue our conversation about the future and challenges facing our area and the industry. \n\nI will continue fighting against increasingly bad policies that punish miners and impede mineral and energy production in our country. https://t.co/Ec7nD15oD0","date":"Fri Jun 04 14:42:23 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I visited with local officials in Calumet following the devastating fire that ravaged nearly an entire city block last week. \n\nOur team will continue working with local leaders to leverage any federal resources available to help those displaced and help move forward. https://t.co/YjMhgmhgnF","date":"Tue May 25 19:24:41 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"5/ Read the full letter here —&gt; https://t.co/Ttt5BGF4ci","date":"Thu May 20 21:08:47 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"3/ Israel has an unequivocal right to self-defense. The U.S. would never tolerate the launch of rockets at our civilian population, nor should Israel be expected to.","date":"Thu May 20 21:08:46 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"2/ The letter calls on POTUS to maintain U.S. security assistance to Israel without any added conditions. The letter also urges POTUS to undertake efforts to weaken Hamas, including targeting Iran’s support for Hamas and sanctioning Hamas for its use of civilians as human shields","date":"Thu May 20 21:08:46 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"4/ We must work together to help our ally defend itself from Hamas and other threats, and to cut off the support to Hamas that enables it to kill and injure Israeli and Palestinian civilians.","date":"Thu May 20 21:08:46 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/ I joined House Foreign Affairs Committee Lead Republican @RepMcCaul and over 100 Republican House Members in a letter to President Biden supporting Israel’s right to self-defense.\n\n#StandWithIsrael https://t.co/DK9iY2awUT","date":"Thu May 20 21:08:45 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Back to normal! It was incredible to have our first group of students back in our DC office today. \n\nI appreciated the opportunity to spend the time with all of these incredible teens from Mackinaw City High School to answer their questions and talk about the future. https://t.co/RAW45fiB3j","date":"Wed May 19 16:56:01 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Americans feel we are indefinitely stuck in an uncomfortable and unsustainable new reality with no way out. These feelings are largely because our leading government scientists refuse to chart a clear course back to normalcy.\n\nMy latest in @detroitnews⤵️\n\nhttps://t.co/UT7VypFyym","date":"Mon May 03 15:24:25 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"In case you missed the President’s address tonight, allow me to summarize: “I’m from the government and I’m here to help.” \n\nTonight, the President made it perfectly clear again that no matter the issue, to him - the answer is always more government.","date":"Thu Apr 29 02:19:55 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"New census data released today — unfortunately @uscensusbureau still doesn’t know that the U.P. is part of Michigan and not Wisconsin. \n\nUnreal.","date":"Tue Apr 27 01:03:09 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Progress 💪","date":"Tue Apr 20 20:21:21 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Retweet if you agree ➡️ American workers keeping our economy rolling through the pandemic deserve the $10,200 tax break given to those who had to collect unemployment! \n\nRead more about my legislation here - https://t.co/68GBcJnFgZ https://t.co/k7pFzZZY5J","date":"Mon Apr 19 13:05:07 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I introduced the Essential Worker Tax Parity Act to ensure that our workers who carried the economy on their backs over the past year get the same $10,200 tax break that was given to those who had to collect unemployment. \n\nRead more here —&gt; https://t.co/68GBcJ64pr https://t.co/2jvOKCHbYH","date":"Thu Apr 15 19:46:41 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":".@CDCDirector - our state has already killed thousands of small businesses, and many still haven’t even received their unemployment. \n\nPlease don’t encourage this behavior. \n\nFocus on more vaccines for those who want them.\n\n#FreeMichigan","date":"Tue Apr 13 13:39:38 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"He is risen, indeed! \n\nMay you and your family have a blessed Easter. https://t.co/9lMHE3els0","date":"Sun Apr 04 12:00:51 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I are keeping the family of officer Evans in our prayers, as well as all of the @CapitolPolice. \n\nWe are eternally grateful for the work they do to keep our Nation’s Capital safe.","date":"Fri Apr 02 20:40:22 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"For God so loved the world, that He gave his only Son... Even in our darkest days, hope lives eternally!\n\nWishing all across the First District a blessed Good Friday. https://t.co/eX3rL5BtcX","date":"Fri Apr 02 14:13:57 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today marks 48 years since the last troops left Vietnam. Many didn’t come home. Others came home without any thanks or gratitude for their service, sacrifice, and patriotism. \n\nToday, we honor the men and women - my brothers and sisters - who sacrificed so much in the Vietnam War https://t.co/cL8RXw6q3I","date":"Mon Mar 29 15:15:07 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"You can read our full release here —&gt; https://t.co/zr1NCMeyOL","date":"Tue Mar 23 20:39:41 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As countries around the\nglobe increase nuclear capabilities, it’s imperative the United States modernize our Nation’s nuclear defense - not decrease our capabilities.\n\nToday, I joined with my fellow @HASCRepublicans urging President Biden to make this key investment —&gt; https://t.co/Sl9B08jnK9","date":"Tue Mar 23 20:39:40 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to joining @RepHoulahan this evening for a bipartisan conversation with @HillVets.\n\nBe sure to tune-in!","date":"Wed Mar 10 17:59:12 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Joined my Michigan colleagues this morning thanking our @MINationalGuard for their service and delivering some @ChickfilA breakfast.\n\nLooking forward to having them all back home in Michigan soon! https://t.co/7NNGtRk9FE","date":"Wed Mar 10 14:55:25 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Read our full release here --&gt; https://t.co/i4UiiNKL9i","date":"Tue Mar 09 14:39:28 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: Yesterday, I joined with a bipartisan group of colleagues in reintroducing the Homeland and Cyber Threat (HACT) Act. \n\nAs we continue to address the rise in cyberattacks, the time is now to make this critical update to the Foreign Sovereign Immunities Act.","date":"Tue Mar 09 14:39:27 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"BIG NEWS: The USDA approved a $16.9 million Federal loan to Dickinson County Healthcare System. This has been a project we’ve worked to cut through the red tape on for years! https://t.co/O6TiPQBtEC","date":"Thu Mar 04 20:40:26 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our troops don't demand a 5-star resort or expensive food, but at a minimum, they deserve meals that are safe to consume. \n\nThis is an embarrassment for all those responsible for the care of our troops, and must be met with full accountability.\n\nhttps://t.co/jSTZ6SDKxB","date":"Tue Mar 02 16:49:13 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Back in D.C. after a great weekend of meetings in the TC and Gaylord area. \n\nAfter meetings and an interview with IPR, I joined a great discussion with the team at Munson to discuss telehealth capabilities and policy changes needed to ensure better care for our constituents. https://t.co/L9pfFCslkE","date":"Mon Feb 22 21:57:13 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I just offered this key mental health amendment for Veterans, but Democrats are too busy jamming through their unilateral agenda with ZERO bipartisan input.","date":"Thu Feb 11 20:54:15 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you to @taxreformer, @DigitalLiberty, @GovWaste, @NTU, @AFPhq, @FreedomWorks, @Protectaxpayers, and @BudgetHawks for your support of this critical effort!","date":"Thu Feb 04 20:04:49 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you @RepRichHudson @RepJimBaird @RepRosendale @RepBuddyCarter @RepChrisStewart @RepJerryCarl @RepAlexMooney @RepGrothman @RepBethVanDuyne @RepTomEmmer @RepRonnyJackson @RepDaveJoyce @RepAnnWagner","date":"Thu Feb 04 20:04:48 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you @RepAshleyHinson @RepBarryMoore @RepThompson @CongressmanHice @RepWalberg @RepScottPerry @RepGregSteube @RepRalphNorman @JayObernolte @RepSteveChabot @RepJeffDuncan @TXRandy14 @RepJimBanks @Lancegooden @DougLaMalfa @RepMoBrooks @RepNancyMace @RepBenCline @RepFredKeller","date":"Thu Feb 04 20:04:48 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"A reconvening of the Grace Commission is necessary and in order. It should be non-partisan and create a report that lights a path forward for Congress and the Executive Branch. https://t.co/hSXgXDZOzp","date":"Thu Feb 04 20:04:47 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This isn’t a new idea - in 1982 President Reagan ordered a commission of over 2000 private sector citizens tasked with increasing efficiency, reduce costs, and improve accountability.","date":"Thu Feb 04 20:04:22 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, @RepEdCase and I sent a bipartisan letter with 32 of our colleagues, urging @POTUS to address the growing national debt by establishing a modern-day Grace Commission to root out government waste and inefficiencies.","date":"Thu Feb 04 20:04:21 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’ve said it dozens of times in the past few years - I support every American’s right to peacefully protest, but violence and attacks on our police have no place on our streets, or in our Capitol.","date":"Wed Jan 06 20:15:23 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"What we are seeing is disgraceful. The Capitol Police saved my life on the baseball field just over 3 years ago and they protect our Nation everyday. Attacks on any of them, innocent civilians, or any elected official should be met with the full force of the law.","date":"Wed Jan 06 20:15:23 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our options aren’t binary -Congress has an obligation to the millions of Americans who have lost faith in our election process. @RepWalberg and I join our Senate colleagues calling for an Emergency Electoral Commission to perform an audit of the election.\n\nhttps://t.co/MuwD0Ocshx","date":"Mon Jan 04 20:59:42 +0000 2021","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"One of the biggest failures of last week’s COVID relief bill was providing only $600 per person. President Trump was right to demand Congressional leadership step up and provide much needed relief to the people. /5","date":"Mon Dec 28 23:37:40 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This is a good next step and I was proud to stand up for my constituents and support this bill. /6","date":"Mon Dec 28 23:37:40 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our neighbors are hurting financially as state rules and mandates have shuttered businesses and shattered the livelihoods of so many. /2","date":"Mon Dec 28 23:37:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"While we know the answer to so many of our problems will be resolved if our state gets out of the way and lets our workers safely get back to work, much of the damage already done is irreparable. /3","date":"Mon Dec 28 23:37:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This additional support will help our communities through the winter months, which are already a trying time in the First District. /4","date":"Mon Dec 28 23:37:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I supported a measure requested specifically by President Trump to provide $2000 impact payments directly to constituents of the First District. /1","date":"Mon Dec 28 23:37:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Merry Christmas to all! https://t.co/1kicGkD4li","date":"Fri Dec 25 18:25:00 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This package contains my GI Bill Planning Act, as well as other bills which I’ve co-led including the Transparency for Wounded Warriors Act and the Reducing High Risk to Veterans and Veterans Services Act. Read more here —&gt; https://t.co/kfPw8UXSni","date":"Wed Dec 16 21:33:35 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"BIG NEWS: The House just passed H.R. 7105 - the Johnny Isakson and David P. Roe, M.D. Veterans Health Care and Benefits Improvement Act of 2020. https://t.co/ISdRl2mUhK","date":"Wed Dec 16 21:33:35 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Malicious foreign actors are devoting all of their energies toward conducting an all-out cyber war against the U.S.\n\nCongress can immediately address this crisis by incorporating the HACT Act as an amendment to the new COVID relief bill. \n\nMore here ⤵️\n\nhttps://t.co/LcTCRuGw8p","date":"Tue Dec 08 15:01:44 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’ve seen firsthand his dedication as a legislator, leader, and as a fierce competitor. The U.P. and our entire state is a better place because of his life and legacy. \n\nThe entire Casperson family is in our prayers as they grieve the loss of Tom. 2/ https://t.co/2x2e1S5Zk3","date":"Mon Nov 30 14:25:24 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/pWjQluVz3N","date":"Mon Nov 30 14:25:24 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I are heavy hearted to have learned the news of the passing of Senator Tom Casperson. Tom has spent his life dedicated to his family, God, his community, and to making the U.P. a better place. 1/","date":"Mon Nov 30 14:25:22 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you @SecArmy!","date":"Tue Nov 17 21:22:20 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On this Veterans Day, we honor the selfless service of the many who have worn our nation’s uniform. \nFrom the inception of our great country, brave men and women have answered the call of America to defend against terrorism, destroy naziism, and dismantle the bonds of communism. https://t.co/ntL7RGKRwJ","date":"Wed Nov 11 17:36:42 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"These Soldiers, Sailors, Airmen, Marines, and Coast Guardsman have resisted fear and summoned courage through the most strenuous of circumstances. \n\nGod bless our Veterans. Thank you for your service.","date":"Wed Nov 11 17:36:42 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":".@realDonaldTrump is right - all job creation is local, and the federal government can and should create an atmosphere for businesses to thrive.\n\n@POTUS plan for Michigan will continue to work for Michiganders - and lift all Americans!\n\nCheck it out ⤵️\nhttps://t.co/2ixqNautow","date":"Thu Oct 29 17:40:59 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/CLIUP65ljL","date":"Thu Oct 08 18:02:54 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I announced USDA Rural Development Grants for Houghton, Gogebic, Antrim, Grand Traverse, Manistee, and Benzie Counties.\n\nRead more here -&gt; https://t.co/OtRTXyQlto","date":"Wed Oct 07 20:50:38 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I join with all the constituents of the First District in prayer, and wish @POTUS and @FLOTUS a complete and speedy recovery.","date":"Fri Oct 02 12:31:20 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to be named a @WeArePREVENTS National Ambassador. \n\nWant to learn more about #SuicidePrevention? \n\nFollow @WeArePREVENTS and #REACHnow to see how you can get involved.https://t.co/WwAXOQSrDj","date":"Wed Sep 23 13:18:53 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Nineteen years ago today, we saw the worst of humanity in the cowardly terrorists who attacked our nation, and we saw the best of humanity in the extraordinary heroism of the First Responders. \n\nWe honor the sacrifice. We remember the lives lost. We promise - we will never forget https://t.co/T1XhIElZUA","date":"Fri Sep 11 19:20:44 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"One of the incredible parts of serving in Congress is having the opportunity to meet so many young men and women who are taking a stand, and growing into our next generation of leaders.\n\nGreat way to start the day in Petoskey! https://t.co/xBdYamDvmu","date":"Tue Sep 01 14:02:59 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":".@SpeakerPelosi, bring S.785 to a vote ASAP. Our Veterans can’t wait. \n\nIt passed the Senate unanimously and would easily pass the House. I know, because 250+ U.S. Reps cosponsored the same policy in my legislation, the IMPROVE Act, which lies at the heart of this critical bill.","date":"Thu Aug 27 15:36:21 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Steve is right - this dangerous rhetoric by the Speaker is unacceptable.","date":"Tue Aug 25 02:41:27 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"S. 785, which passed the Senate unanimously, is based on my legislation - the Improve Well-being for Veterans Act. \n\nI strongly urge @SpeakerPelosi to bring this legislation to a vote on the House floor THIS WEEK and immediately send this critical legislation to @POTUS desk. https://t.co/7VoPXSHIwl","date":"Wed Aug 19 14:58:12 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"In the face of adversity, Americans always rise to the occasion. We have a long way to go, but this is certainly another step in the right direction.￼￼\n\n“US hiring tops expectations with 1.8M added as unemployment rate falls to 10.2%” https://t.co/xyamgqxDGb","date":"Fri Aug 07 13:40:19 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Preventing Veteran suicide is one of my highest priorities in Congress, and this is a critical step forward in the legislative process.\n\nI urge @SpeakerPelosi and @RepMarkTakano to do right by our Veterans, pass this bill and get it to @POTUS desk!\n\nhttps://t.co/pCJCq8ifkC","date":"Thu Aug 06 16:43:38 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@SpeakerPelosi and Chairman @RepMarkTakano must not let the incredible opportunity to help end Veteran suicide pass us by. The House must immediately bring this legislation to the floor and send it to President Trump’s desk.","date":"Thu Aug 06 00:39:51 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The provisions included in S.785 are modeled after the IMPROVE Act, which I have been working to pass in the House. This is one of my highest priorities and I applaud the Senate for passing this Veterans mental health package in a bipartisan manner.","date":"Thu Aug 06 00:38:57 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Locating this spaceport in the U.P. will create the opportunity for our residents to use their skills, talents and technological expertise to adapt to the changing needs of the commercial and defense space industries.","date":"Thu Jul 23 19:53:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Read more —&gt; https://t.co/654TLLWK84","date":"Thu Jul 23 19:53:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"BIG #MI01 NEWS: Northern U.P. Identified as Top Location for Vertical Launch Spaceport! \n\nTeam Bergman was proud to be part of this exciting announcement today!","date":"Thu Jul 23 19:53:38 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The House overwhelmingly passed my bipartisan HACT Act amendment to the NDAA (336-71).This is an essential national security measure to protect the U.S. government, our health care system, and American citizens from the ongoing cyber-threat.","date":"Tue Jul 21 20:15:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Read more here⤵️ https://t.co/xBA0kAWwam","date":"Tue Jul 21 20:15:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Accurate.","date":"Mon Jul 13 00:15:21 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"For over a decade, around 20 Veterans have taken their own lives each day. We cannot tolerate this lack of progress because we know that even one suicide is too many.\nI appreciate @JenGriffinFNC highlighting the bill @RepSusieLee and I introduced this week to help end this crisis","date":"Sat Jul 11 15:20:56 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Although I was in DC, our team had the opportunity to welcome @SBAJovita to Traverse City to see firsthand how the #PPP and #EIDL were a lifeline to so many businesses in #Mi01.","date":"Thu Jul 02 14:28:30 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"“Our state public health experts paid a premium to place people infected with a wildly communicable disease in close proximity to the people most likely to be killed if they become infected.” We need answers!\n\nRead more from @RecordEagle Editorial Board⤵️\n\nhttps://t.co/Eq5qaUN75k","date":"Mon Jun 29 16:12:59 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Defunding the police is terrible idea.","date":"Mon Jun 29 03:10:52 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"China is exploiting the coronavirus crisis it created.\n\nWith over 60 bipartisan cosponsors, the HACT Act is building momentum as the most viable means of addressing the epidemic of foreign-sponsored hacking of Americans. \n\nMy latest in the @petoskeynews ⤵️\nhttps://t.co/qaPWuFx6CC","date":"Wed Jun 24 19:28:49 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Last week, @SteveScalise asked our Governor about Michigan’s handling of coronavirus within nursing home facilities.Nearly 2000 Michiganders in these facilities have lost thier lives to the virus. \n\nThese questions asked by Whip Scalise deserve answers!\n\nhttps://t.co/QO0SRtFIsB","date":"Tue Jun 23 13:40:27 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Outstanding work by @USCGGreatLakes!","date":"Fri Jun 19 17:41:25 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s simple - foreign-sponsored hackers must be held accountable! \n\nThe HACT Act is gaining bipartisan momentum in Congress and would give Americans the accountability they deserve! \n\nRead more here⤵️\n\nhttps://t.co/IWhcsGKssf","date":"Thu Jun 18 20:14:04 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I are heartbroken for Andy and his family and ask the First District to join us in praying for the entire Barr family through this time of loss.","date":"Wed Jun 17 02:39:37 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The America I fought for - and continue to fight for - is better than this.\n\nWe are a nation of law and order. We stand against injustice, we value life, we defend our neighbor, and we honor the men and women who protect our communities. 3/","date":"Mon Jun 01 19:25:18 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The arrest and murder charge against this bad cop is a good start. \n\nOver the last week, Cindy and I have been praying for healing for our nation and people. We are better than racism, hatred, destruction, riots, looting, and violence. 2/","date":"Mon Jun 01 19:25:16 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The senseless murder of George Floyd was evil. Americans across the nation are, and should be, upset and outraged that any man - especially someone who has sworn to protect and defend their community - could perpetrate such hate on a￼ fellow American. 1/","date":"Mon Jun 01 19:25:15 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"President @realDonaldTrump is sending another 1.7 MILLION respirators to Michigan. \n\nI appreciate the @WhiteHouse’s coordinated effort to protect our frontline workers and help our state navigate the Coronavirus crisis. 🇺🇸","date":"Wed May 27 18:04:16 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks to: @RepMoolenaar @RepMattGaetz @RepDLesko @RepBillJohnson @RepBalderson @RepRWilliams @RepDavidRouzer @RepAbraham @DrNealDunnFL2 @RepDougCollins @RepScottPerry @RepShimkus @RepTedBudd @RepMcKinley","date":"Tue May 26 20:40:14 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks to: @RepChipRoy @RepHuizenga @RepBobGibbs @RepMarshall @RepRiggleman @RepAlexMooney @RepGregSteube @repkevinhern @RodneyDavis @RepFredKeller @RepLaHood @RepWalberg @RepBenCline @RepAnnWagner @RepMichaelGuest @RepAndyBiggsAZ @RepKenBuck @RepRonWright @RepGrothman","date":"Tue May 26 20:40:14 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Last week, President @realDonaldTrump announced an Executive Order that directs federal agencies to cut regulatory red tape, improve efficiency, and encourage economic growth in the face of the coronavirus. \n\nWe agree Mr. President. It’s time to #TransitionToGreatness. https://t.co/t9UeCbxX80","date":"Tue May 26 20:40:13 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I had the opportunity to speak at our local ceremony and join fellow Veterans here in Watersmeet to honor our nation’s fallen warriors. \n\nWe will never forget. 🇺🇸 https://t.co/9nvIJxmirA","date":"Tue May 26 01:56:21 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Lest we forget.","date":"Mon May 25 22:00:32 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you President @realDonaldTrump for your support for our state throughout this crisis. \n\nWelcome back to Michigan!","date":"Thu May 21 17:54:31 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"While America is correctly fixated on the coronavirus crisis, we need to continue to protect our nat sec interests in the Middle East — including by boosting the capabilities of our regional allies to help secure our interests.\n\nRead my latest with @jinsadc Pres @MichaelMakovsky","date":"Wed May 20 21:08:10 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Praying for our friends in central Michigan this evening as they face historic flooding.","date":"Wed May 20 02:44:09 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: Building on the strongest economy in history, we can recover from this crisis and re-ignite the engine that drives our nation. The choice is not binary — we don’t have to sacrifice lives for the economy or vice versa. \n\nhttps://t.co/niTJ8UK7Vd","date":"Mon May 18 14:42:04 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, @realDonaldTrump announced that 1 million more K90/N95 masks are on their way to Michigan. This is more great news for our health care heroes. \n\nThank you President Trump!","date":"Wed May 13 19:34:09 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Yesterday, Speaker Pelosi introduced a $3 trillion, over 1800 page, socialist wishlist. I’ll be leaving Watersmeet shortly to head to D.C. to oppose this partisan boondoggle. \n\nAmerican workers are hurting - they deserve so much better from their government. https://t.co/3SirHUpCyf","date":"Wed May 13 18:11:26 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy Mother’s Day to the great Moms all across the First District! https://t.co/tJDgt30QqI","date":"Sun May 10 16:22:29 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"In 2018, @realDonaldTrump promised @RepMoolenaar, @RepPaulMitchell, and I that he would prioritize building a new Soo Lock. \n\nToday, the @USACEHQ announced that construction equipment has arrived in Sault Ste. Marie, Michigan to begin phase one. \n\n📸: @detroitdistrict https://t.co/vEUANqZFFP","date":"Thu May 07 17:22:51 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Huge announcement for the U.P. and northern Wisconsin. I’m proud to work alongside @RepGallagher to support the shipyard in its efforts to secure this contract. \n\nhttps://t.co/PnTMcvkjIO","date":"Fri May 01 00:07:29 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"While the partisan rancor has taken the headlines, the reality is - throughout the Coronavirus crisis, President @realDonaldTrump’s Administration has delivered for Michigan. https://t.co/NuAMUGbULp","date":"Thu Apr 30 13:59:41 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"‼️IMPORTANT THREAD‼️","date":"Tue Apr 28 14:20:29 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Important information for #Mi01 Veterans!","date":"Mon Apr 27 17:26:16 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was great catching up with @MattKnoedler recently to talk about the #PaycheckProtectionAct and the need to further support Michigan’s rural hospitals.","date":"Mon Apr 27 01:41:04 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Due to demand, PPP funding will run out today, but Congress has the ability to act to replenish these funds. \n\nYet political games and blind partisanship is blocking this from happening, all at the expense of our small businesses. \n\nCongress must act NOW! https://t.co/CK2ezt51LA","date":"Thu Apr 16 14:57:21 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I received notice today from the Democratic Whip that the House is now not set to convene for business until May 4th. (Continued)","date":"Mon Apr 13 21:28:34 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Businesses are forced to shut down, tens of thousands of Michiganders are filing for unemployment, and the PPP will likely run out of funds in the next week as small businesses across America scramble to stay alive. \n\nD.C. politicians have no grasp of reality. It’s appalling.","date":"Mon Apr 13 21:28:34 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Big news for #Mi01. Thanks @AjitPaiFCC!","date":"Fri Apr 10 19:56:06 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Keeping my friend and colleague @DrNealDunnFL2 in our prayers for a full and fast recovery from #COVIDー19","date":"Fri Apr 10 19:42:12 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our reminder that even on our darkest day - there is hope, love, and healing. \n\nWishing those across the First District who observe this sacred day a blessed Good Friday. https://t.co/s8VF1mDECh","date":"Fri Apr 10 14:01:54 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Although we are socially distancing - today is another day at home in Watersmeet filled with conversations with Mi01 workers, small business owners, industry leaders, as well as colleagues and Admin officials about the effects this crisis is having on all #Mi01 constituents. https://t.co/8SZWscfFlK","date":"Thu Apr 09 15:37:28 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Big news!","date":"Tue Apr 07 23:16:09 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today is National Vietnam War Veterans Day. Team Bergman wanted to thank all who served in the Vietnam War, including our boss. \n\nBelow, General Bergman (then 2nd Lt.) was awarded the Vietnam Cross of Gallantry by the Commandant of the Vietnamese Marine Corps. \n\n- Team Bergman https://t.co/4BwmVJcU1h","date":"Sun Mar 29 16:36:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you @POTUS for rapidly turning around Michigan’s much needed emergency disaster request! \n\n https://t.co/njA7aI0iyr","date":"Sat Mar 28 14:05:28 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I are keeping my friend @RepDeSaulnier and his family in our prayers, and wish him the best in the days ahead. https://t.co/4Ov01lPyCK","date":"Sun Mar 22 00:33:59 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"To all the First District dispatchers, law enforcement officers, paramedics, EMT’s, and firefighters continuing to protect our towns throughout these trying times - Thank you! https://t.co/os4akXOIna","date":"Thu Mar 19 13:08:06 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I joined with 12 Members of Michigan’s Congressional delegation, in support of Governor Gretchen Whitmer’s request for an Econimic Injury Disaster declaration from the U.S. Small Business Administration. \n\nRead our letter below: https://t.co/6YmBRBYnil","date":"Wed Mar 18 19:16:12 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cc: @RepFredUpton @RepHaleyStevens @RepLawrence @RepHuizenga @RepDanKildee @RepAndyLevin @RepPaulMitchell @RepWalberg @RepSlotkin @RepMoolenaar @RepRashida @RepDebDingell","date":"Wed Mar 18 19:16:12 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you to the men and women keeping our supply chain flowing! 🇺🇸 https://t.co/C9C071ziEm","date":"Wed Mar 18 15:29:52 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I was able to spend time in the office today talking with small business owners and other Mi01 constituents about challenges they are facing due to the Coronavirus response. \n\nThese are challenging times, I’m confident we will make it through together. https://t.co/YTJp4jXuki","date":"Mon Mar 16 23:59:04 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Last night I voted in favor of H.R. 6201, the Families First Coronavirus Response Act. This will bring relief to American families in this time of uncertainty.","date":"Sat Mar 14 12:34:43 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This targeted approach ensures that everyone can get a COVID-19 test, that our children will still have access to vital nutrition programs even if schools are closed, and that our small business and families will have economic relief during this difficult time.","date":"Sat Mar 14 12:34:43 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for coming to the office today! Great seeing our First District Reps from @AMVETSHQ in the office today.","date":"Wed Mar 11 21:29:48 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@RepTomGraves Cindy and I are continuing to pray for a swift recovery for John and for strength for the entire family.","date":"Tue Mar 10 02:33:02 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was great to meet with @AIPAC representatives at our Washington office today! The United Stated has a long-lasting relationship with Israel, and we must continue standing firmly with our nation’s closest ally in the Middle East. #AIPAC2020 https://t.co/67SV3oIv1J","date":"Tue Mar 03 21:11:42 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#ThrowbackThursday to the early 2000’s at NAS Joint Reserve Base Fort Worth. #SemperFi https://t.co/dekzdbKKRW","date":"Thu Feb 27 22:28:40 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"About 600,000 Americans die of heart disease annually. This represents almost 25% of all U.S. deaths. To raise awareness of this disease, February has been recognized as “American Heart Month.\"\n\nRead more from the CDC here --&gt; https://t.co/BJmIEHKVPO https://t.co/taUHRngnv4","date":"Thu Feb 20 16:14:55 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Fleet Admiral Chester Nimitz said it best – “Among the men who fought on Iwo Jima, uncommon valor was a common virtue.”\n\nAs we commemorate the 75th Anniversary of Iwo Jima, we remember what it means to be an American and what it means to be a United States Marine. https://t.co/JDlxL6j1Yg","date":"Wed Feb 19 16:36:15 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cpt. Jonathan Turnbull’s courage and determination have been an inspiration to #Mi01, and we are proud and grateful for his service to our nation.\n\nOur office was proud to welcome he and his family to DC - just over one year after sustaining life threatening injuries in Syria. https://t.co/uKEnM1NtjU","date":"Tue Feb 18 18:02:03 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Ready for an evening of racing and festivities at The UP200, Midnight Run, and Jack Pine 30. \n\nEnjoyed the chance to meet Ryan (Redington Mushing) who is here in Marquette with his team - all the way from Skagaway, Alaska! https://t.co/NWLGTZF27E","date":"Fri Feb 14 18:30:44 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"An important piece in today's @freep by Elizabeth Snell, a victim of a Russian cyberattack: \"I learned how vulnerable we are to identity theft — when it happened to me\" https://t.co/juKprdLbQR\n\nWe must pass the bipartisan HACT Act to protect from these attacks! cc @SpeakerPelosi","date":"Thu Feb 13 15:08:40 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"After decades of political inaction, the momentum continues to grow as we make construction of a new Lock in Sault Ste. Marie a reality. \nhttps://t.co/6pCVqRPVjN","date":"Tue Feb 11 17:06:56 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: On the heels of @realDonaldTrump announcing $123.2 million in his FY21 budget proposal for construction of a new Lock, the @USACEHQ announced they had updated the FY20 Work Plan to include an additional $50 million for the Soo Locks project!","date":"Tue Feb 11 17:06:55 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Good news for #Mi01: @POTUS FY 2021 Budget includes $123.2 million for construction of a new Poe-sized Lock in Sault Ste. Marie. \n\nPromises made, promises kept!","date":"Mon Feb 10 20:47:56 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"With today’s report about China’s involvement in the @Equifax breech, we must pass the HACT Act, that I introduced w/@RepAndyKimNJ, to protect Americans from cyberattacks.\n\nEnough is enough! \n\nCc:@JacksonLeeTX18 @RepValDemings\n \nhttps://t.co/vIHrpjwkd1","date":"Mon Feb 10 16:59:39 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Blue collar boom!\n\nhttps://t.co/FRuJYByRKc","date":"Wed Feb 05 15:02:55 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Such a great moment from tonight’s #SOTU","date":"Wed Feb 05 04:22:15 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"How embarrassing.","date":"Wed Feb 05 04:02:45 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"“The only victories that matter in Washington are the victories that deliver for the American people.” \n\nWell said @POTUS!","date":"Wed Feb 05 02:36:28 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"“The United States is indeed where the action is!” - @POTUS  #SOTU","date":"Wed Feb 05 02:24:26 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Glad to have Joel Myler from Traverse City as my guest at tonight’s State of the Union address. Looking forward to an exciting night with @POTUS laying out an optimistic vision for the future of our great Nation. #SOTU #Mi01 https://t.co/4zDDZJ6qp1","date":"Wed Feb 05 01:20:57 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Heading back to Michigan aboard Air Force One with @POTUS! Looking forward to discussing USMCA and other issues that are important to the First District, and the entire state. https://t.co/Na6JKJDuAJ","date":"Thu Jan 30 19:14:12 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I'm thankful that the Senate VA Committee unanimously passed the amended IMPROVE Act today. I introduced this bill in the House to address the suicide crisis faced by our Veteran community. \n\nRead more here —&gt;\n\nhttps://t.co/WrgGtb9HIM","date":"Wed Jan 29 22:39:58 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Enjoyed my visit last week to the @WaupacaFoundry!","date":"Tue Jan 28 14:30:50 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@DrPhilRoe has been a mentor and friend in Congress since the day I took office, and I’m grateful I have had the opportunity to serve alongside him. https://t.co/VA6C0dcajx","date":"Fri Jan 03 20:15:23 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"While I have no desire for our nation to be immersed in endless wars, it is our duty to ensure those who are working to cripple our country are met with unparalleled force. /2","date":"Fri Jan 03 14:31:10 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Enemies of the United States must understand that when lives of Americans and our allies are at risk, we will no longer sit back when a line in the sand is crossed. /Fin","date":"Fri Jan 03 14:31:10 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Qassem Soleimani was responsible for over 600 American deaths and planning further attacks on Americans. Yesterday, this perpetrator of evil was eliminated thanks to our military strength and President Trump’s decisive action. /1","date":"Fri Jan 03 14:31:09 +0000 2020","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The voters of the First District overwhelmingly elected @realDonaldTrump to office. Today, I stood with the constituents of the District and emphatically voted ‘NO’ on the Democrats’ impeachment sham. It's time to get back to the work we were sent to accomplish. https://t.co/dkFeYenN3G","date":"Thu Dec 19 02:37:59 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"If this isn’t partisan politics, I don’t know what is! The impeachment votes today represent the worst of Washington, D.C. - yet another reason my constituents are so disillusioned with the process and disappointed with the 116th Congress.  \n\n#ShamImpeachment https://t.co/gG7pNsIUSV","date":"Wed Dec 18 21:16:53 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"✅ $75 million for a new Lock in the Soo. \n✅ Largest pay raise for our troops in a decade. \n✅ Increase in Great Lakes Restoration funding. \n✅$1.7 billion for a border wall and security. \n✅Protecting life and the Second Amendment. \n\nRead more here ➡️➡️➡️https://t.co/zTeZ34RZrE","date":"Tue Dec 17 20:40:24 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Go Navy 🏈","date":"Sat Dec 14 18:38:32 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Withholding paychecks from Members of Congress who fail to pass appropriations is an important step to prevent government shutdowns, which hurt the economy and millions of everyday Americans. But it’s also an important step to promote fiscal responsibility\nhttps://t.co/OpdkYW8Ln2","date":"Fri Dec 13 17:21:55 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Promises made, promises kept. \n\nWe’re building a new Lock in the Soo and our partners @detroitdistrict are makeing historic progress! \n\n#BuildTheLock","date":"Fri Dec 13 16:32:09 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@VP in the @detroitnews ➡️\n\n“While Democrats have spent most of 2019 on endless investigations, passing the USMCA is a step they can take to finally start working with the president to serve the American people.” \n\nhttps://t.co/f2euL4gxhO","date":"Thu Dec 12 14:50:19 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As if we needed further proof that this impeachment attempt is entirely unhinged - one of today’s key witnesses took an entirely unnecessary shot at @realDonaldTrump’s son Barron. \n\nEnough of the #ShamImpeachment\nhttps://t.co/wbvfSQhvQN","date":"Wed Dec 04 20:39:49 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"What was once described to me as a pipe dream is now becoming a reality. \n\nRead my oped in the @WashTimes!","date":"Wed Nov 27 00:22:03 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/NJfC3nu5Xl","date":"Mon Nov 25 19:21:59 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"...getting the federal government off the backs and out of the business of First District constituents. However, this impeachment farce has spread into nearly every aspect of Congress, stalling much of the actual bipartisan work that we were sent here to do. /2","date":"Mon Nov 25 19:08:30 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"While I do not sit on a committee of jurisdiction over the impeachment proceedings, it’s becoming increasingly apparent that these efforts are nothing short of a politically motivated scam, to bring down the duly-elected President of the United States. 3/","date":"Mon Nov 25 19:08:30 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This entire process has lacked the integrity that the American people deserve from their elected officials. I sincerely hope that the 116th Congress can get back to doing the people’s business soon. 4/","date":"Mon Nov 25 19:08:30 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thread/\n\nMy statement to @MichiganRadio:\n\nI was sent to Washington to work on important issues like Veteran suicide prevention, fixing the guest worker visa program, passing the USMCA, expanding broadband access in rural America and... /1","date":"Mon Nov 25 19:08:29 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s time to put politics aside and pass the USMCA!","date":"Fri Nov 22 20:40:10 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Tune in now!","date":"Wed Nov 20 14:59:32 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"U.S. citizens have no legal recourse against foreign governments that target them online. The Foreign Sovereign Immunities Act shields bad actors from being sued by private citizens. \n\nI’ve introduced legislation to fix that —&gt;\n\nhttps://t.co/ytpziIzAmp","date":"Tue Nov 19 22:32:57 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for the informational tour, discussion, and accurate prediction that my flight out of Traverse City would likely be cancelled due to inclement weather, @NWSGaylord!","date":"Tue Nov 12 15:03:14 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"244 years of excellence! Happy Birthday, Marines. https://t.co/p0WOR3hcOC","date":"Sun Nov 10 15:51:16 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’m proud to have such strong support behind the First District’s number one infrastructure priority! Great Lakes Legislators have rallied around this project, and we won’t take anything for granted until a new Poe-sized Lock is completed. 3/ https://t.co/zgjn4icdwW","date":"Mon Nov 04 16:08:58 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Additional funding will be used to begin upstream channel deepening and continued design work for the new chamber and upstream wall approach. 2/ https://t.co/8hi34055Qv","date":"Mon Nov 04 16:08:55 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I led a bipartisan letter with 30 of my congressional colleagues requesting continued funding for a new Poe-sized Lock in the Soo. Last year was a historic year as $75 million was included in @POTUS budget and appropriated by the House and Senate committees. 1/ https://t.co/AfxJoLncje","date":"Mon Nov 04 16:08:53 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today in @TheAlpenaNews by VA @SecWilkie: Bipartisan proposal could save Veterans’ lives. \n\nRead more about my @HouseVetAffairs legislation, the IMPROVE Well-Being for Veterans Act here —&gt; \n\nhttps://t.co/WUfpobYV8a","date":"Sat Nov 02 18:02:51 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you @SecWilkie for supporting the IMPROVE Act. It’s time to do what is right for our Veterans.","date":"Fri Nov 01 18:22:35 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy Birthday @mackinacbridge! 🎉","date":"Fri Nov 01 14:11:59 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today’s vote in the House on impeachment would’ve been more appropriate on April Fool’s Day than on Halloween. \n\nThe impeachment sham against @realDonaldTrump that Nancy Pelosi and her puppets are pushing in Congress is a joke and a ploy to undermine the 2016 election results.","date":"Thu Oct 31 18:42:08 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"H.Res 660, attempts to bring a veneer of transparency to the proceedings, it falls far short and continues to undermine the bedrock principle of due process.  I’m proud to stand with @RepWalberg, @RepFredUpton, @RepMoolenaar, @RepHuizenga, and @RepPaulMitchell to demand better.","date":"Wed Oct 30 23:45:59 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"“Michigan's six Republican U.S. House Members are urging House Speaker Nancy Pelosi inject more transparency into the impeachment inquiry process against @realDonaldTrump ahead of a scheduled Thursday vote on a bill setting rules for the official probe.”\n\n https://t.co/ysxiKiPXCB","date":"Wed Oct 30 23:31:31 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"5/ https://t.co/GjtbkWnudp","date":"Tue Oct 29 20:16:07 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today’s shocking display of partisanship must not hinder our progress to combat Veteran suicide through the IMPROVE Act, which we’ve agreed to move forward with Democrats through bipartisan discussions and proper legislative processes. 4/","date":"Tue Oct 29 20:14:10 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We will not stop working for Veterans because they did not falter when defending our freedoms. 3/","date":"Tue Oct 29 20:14:06 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"While considering the last bill of today’s @HouseVetAffairs markup, Republicans were prepared to vote on amendments they had properly filed before the deadline, but were bluntly refused this option. 2/","date":"Tue Oct 29 20:14:04 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thread:\n\nFollowing the lead of Speaker Pelosi and House Leadership, Chairman Takano chose to turn a historically bipartisan committee into a sham process, breaking precedent and all norms of this committee. 1/","date":"Tue Oct 29 20:13:59 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"There is no safe place to lay your head as a sworn enemy of our great nation. \n\nThis is a monumental day for the cause of peace and safety around the world. https://t.co/Y2UV4SMdYO","date":"Sun Oct 27 17:28:33 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"What a special day @ArlingtonNatl yesterday.","date":"Thu Oct 24 16:16:20 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Had a great meeting @WhiteHouse with my Congressional colleagues, @SecWilkie, and President Trump’s PREVENTS Task Force which is charged with establishing a roadmap to end Veteran suicide. I appreciate the difficult yet productive discussion we had today. https://t.co/ILNS8okdII","date":"Wed Oct 23 22:42:55 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great to have Quentin stop back by the office today. I enjoy having the opportunity to invest in the next generation of leaders, and appreciate the hard work our interns do as they make their way through college and blaze a trail into new careers. https://t.co/TSXkktQBIa","date":"Mon Oct 21 22:50:40 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"After serving as Commander of @MarForRes / Marine Forces North - ten years ago this week I retired from the @USMC and handed the flag of Command to my friend Lt. Gen. John Kelly. \n\nThankful every day for my 40 years as a Marine, grateful to now serve our great nation in a suit. https://t.co/veU8TKnoJn","date":"Fri Oct 18 15:47:11 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Elijah Cummings was an honorable man, and we should emulate his personal example of dignity, humility, and decency. He was a role model for all of us and his voice will be greatly missed. Cindy and I send our thoughts and prayers to his family and friends during this sad time.","date":"Thu Oct 17 19:03:10 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s reckless to force every Member of Congress to vote on something as significant as HJ Res. 77 prior to even receiving a classified briefing from the SecDef or Chair of the Joint Chiefs. While this is par for the course in D.C. politics, it’s unacceptable for elected leaders. https://t.co/MB1y2Z8Nrm","date":"Thu Oct 17 13:38:50 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s not every day that I have this much fun recording a podcast! \n\nChevy vs Ford, Elephant vs Donkey, Cherries vs Fudge, Ketchup vs Gravy - all the important topics of the day. \n\nThanks @VetsEduProject for a great time! \n\nListen here —&gt; https://t.co/utfsfYPUnD","date":"Wed Oct 16 12:49:40 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Yesterday, I had the opportunity to catch-up with @SecArmy, Ryan McCarthy, at the @AUSAorg Annual Meeting. Exciting to see the industry developments first hand! https://t.co/8afSQjQVJ6","date":"Tue Oct 15 14:50:13 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Hey northern Michigan, I’ll be joining The Ron Jolly Show on @WTCMRadio around 7:30 this morning. Tune-in!","date":"Wed Oct 02 10:46:26 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Over the August work period I had the opportunity to join friends in the First District on the Walk to End Alzheimer’s. \n\nLast week I proudly cosponsored the “Improving Hope for Alzheimer’s Act” and the “Younger Onset Alzheimer’s Act.” \n\nTogether, we will #EndAlzheimers! https://t.co/AzTnhAcN13","date":"Mon Sep 30 18:02:15 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"While Democrats focus entirely on ousting President @realDonaldTrump, I will remain laser-focused on fighting for the needs of the constituents of the First District and working together to accomplish our goals. https://t.co/XSud3fKu0U","date":"Thu Sep 26 22:29:10 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/Northern Michigan cherry growers have been hit hard by cheap imports flooding the market, largely subsidized by the Turkish government. One year ago, we worked with the Trump Administration to end Turkey’s duty-free access. \n\nhttps://t.co/uLeiSRFtTB","date":"Tue Sep 24 16:31:09 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"2/The International Trade Commission’s decision to levy tariffs against Turkish tart cherry exports is a major step in the right direction for our First District cherry growers.","date":"Tue Sep 24 16:31:09 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"When history looks back on the founding and first 232 years of America, the outstanding theme of our existence will undoubtedly be that we were a nation of unprecedented individual liberty.\n\nWe must always fight to preserve our historic legacy of freedom! #ConstitutionDay https://t.co/hODmvJZZtM","date":"Tue Sep 17 16:01:11 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Yet among the heartbreak, the tragedy, and the terror, the United States rose from the ashes. \n\nThe American spirit is resilient and the American heart is strong - the resolve of our nation must never be broken by those who wish to impart evil upon us. #NeverForget","date":"Wed Sep 11 12:59:10 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"18 years ago the course of our nation was forever changed. Terrorists shook us to our very core - killing nearly three thousand of our brothers, sisters, fathers, mothers, and heroes. Our hearts still ache for the lives lost and the First Responders who sacrificed so selflessly. https://t.co/HJFiL9a4nt","date":"Wed Sep 11 12:59:09 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you @DrPhilRoe for supporting this important legislation.","date":"Tue Sep 10 22:17:01 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On this #WorldSuicidePreventionDay I’m grateful that nearly 50 of my colleagues have joined with me in supporting the IMPROVE Well-Being for Veterans Act in our effort to combat Veteran suicide.","date":"Tue Sep 10 22:15:56 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Nearly 40% of Michigan's GDP depends on trade while 65% of Michigan's exports are bound for Canada or Mexico.\n\n@POTUS is putting America First with the new #USMCA - it's time for Congress to do our job, pass the USMCA, and put America's farmers, businesses, and workers first! https://t.co/U3z2d5qkQb","date":"Tue Sep 10 15:15:03 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Read more: https://t.co/cym2VoqLaA","date":"Mon Sep 09 20:52:22 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, @DeptVetAffairs Secretary @SecWilkie urged @SpeakerPelosi to pass my bipartisan legislation to help end Veteran suicide. \n\nThe bipartisan IMPROVE Act would help VA partner with community groups to directly provide Veterans the support they need. 1/","date":"Mon Sep 09 20:52:21 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Ending Veteran suicide must be a top priority of Congress. I appreciate @DrPhilRoe’s support of the IMPROVE Act and hope the Chairman brings up this bipartisan solution.","date":"Thu Sep 05 21:44:30 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@RepPeteStauber and I had a great trip aboard the M/V Roger Blough this week. We disembarked at the Soo Locks where we were given a brief from Lt. Col. Turner and the team at the @detroitdistrict! \n\nWe’re ready to #BuildTheLock! https://t.co/tSCqRV0kA4","date":"Thu Sep 05 20:45:06 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Kicked off the morning with @RepPeteStauber in Duluth highlighting the importance of our shipping industry and the Soo Locks for our nation’s economy and national security.\n\nWe boarded the M/V Roger Blough and are enroute to our next stop: Sault Ste. Marie, MI! https://t.co/QRtJwloMkI","date":"Wed Sep 04 15:50:58 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"BIG NEWS: Today, my legislation to address Veterans suicide received further public support from the United States Secretary of Veterans' Affairs @SecWilkie and House Veterans’ Affairs Committee Ranking Member @DrPhilRoe. \n\nRead more here ---&gt;\n\nhttps://t.co/g38bdlM1Ge","date":"Wed Aug 28 21:04:47 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"✔️ World War II Hero\n\n✔️ Proud Husband and Father\n\n✔️ 3 x Bronze Star Recipient \n\n✔️ Newest Munising Public School Graduate \n\nAfter leaving school 77 years ago to serve in the @USArmy, today John Wapienik received his high school diploma. \n\nhttps://t.co/prxJIppfct","date":"Fri Aug 23 01:14:58 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Busy morning of constituent meetings at our Traverse City office then I headed over to the Rotary Club of Traverse City. I appreciated the opportunity to address the crowd and discuss Veterans’ legislation, Soo Locks update, and the bipartisan work we continue working to achieve! https://t.co/RVHnlb1fyF","date":"Tue Aug 20 17:33:47 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks @BrendanCarrFCC! Telehealth is critical as we move forward to help provide access to quality healthcare for our rural and remote constituents.","date":"Mon Jul 22 13:22:33 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"..and actual legislation that we were sent here to address. Congress is broken and political ploys like this are furthering the divide – the people deserve better.","date":"Tue Jul 16 23:47:08 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The constituents of the First District of Michigan sent me to Washington to be a legislator, not a commentator. Instead of empty House Resolutions and constant attacks on the President, Congress should better serve the American people by getting back to work on the issues...","date":"Tue Jul 16 23:47:08 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"...whether it’s their socialist Green New Deal, job-killing regulations, or their repeated attacks on the sanctity of life. Opposition to their beliefs does not equal racism.","date":"Tue Jul 16 23:47:07 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"To be clear, my opposition to this resolution has nothing to do with my colleagues’ gender, religion, or race, nor does it have anything to do with President Trump’s tweets. I just flat out don’t agree with the content of my liberal colleagues’ policies...","date":"Tue Jul 16 23:47:07 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"With no major political accomplishments to show since the 2018 elections, Democratic leadership has chosen to push meaningless resolutions to score cheap political points, further dividing our nation.","date":"Tue Jul 16 23:47:06 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Read my full statement here —&gt; https://t.co/MLGPNMhRY9","date":"Fri Jul 12 18:32:27 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This week I stood on the House floor to voice my opposition to the House version of the FY 2020 NDAA. What was once a bipartisan bill is now being used as a vehicle for policies that hinder military readiness and defense capabilities https://t.co/HanFPvAmSk","date":"Fri Jul 12 18:32:26 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Dear @MountainDew, \n\nHere’s a quick geography/history lesson from @UPSupplyCo —&gt; \n\nhttps://t.co/GzcBLEI9Bc","date":"Wed Jul 10 15:47:48 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our state needs leadership, not political games. https://t.co/YL1zvuBopt","date":"Fri Jun 28 17:39:22 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Yesterday I asked for unanimous consent for the House to consider the bipartisan Born Alive Abortion Survivors Act, ensuring children who survive an abortion receive healthcare.\n\nFor the 67th time this year, House Leaders denied our request to bring this bill to the House floor! https://t.co/ZJ7WReLxTD","date":"Fri Jun 28 16:39:52 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Democrats in the Senate, including both of Michigan’s Senators, voted in favor of this bill yet House leadership denied my request and is currently refusing to bring this bill to a vote.","date":"Thu Jun 27 18:28:43 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I stood on the House floor and asked Democratic leadership to take up the emergency border bill that passed 84-8 in the U.S. Senate. We’ve got to deal with this crisis on our Southern border. https://t.co/w53EOtTgBL","date":"Thu Jun 27 18:28:27 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today the Senate overwhelmingly passed a bipartisan bill to address the crisis on our southern border. \n\nNow is the time for action, not political games. The House should take up this legislation immediately and send it to President Trump’s desk for his signature.","date":"Wed Jun 26 20:47:07 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"There’s nothing like a surprise visit from family on @thehillbaseball game day. Grateful to have my daughter Molly and granddaughter Maya in town cheering on the team tonight! ⚾️ https://t.co/lwicfhqsAl","date":"Wed Jun 26 18:35:02 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I support @POTUS and his Administration as we keep clear eyes and a steady hand concerning Iranian aggression and provocation of the United States and our Allies. 2/4","date":"Tue Jun 25 17:02:32 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Having served in the United States Marine Corps for 40 years, I understand the costs of armed conflict and know this must always be a last resort. 3/4","date":"Tue Jun 25 17:02:32 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"However, it’s imperative that our men and women in uniform have the ability to protect themselves, our assets, and our allies against increased Iranian aggression. 4/4","date":"Tue Jun 25 17:02:32 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thread regarding Iranian aggression: \n\nIn recent weeks, tensions between the United States and Iran have increased as sanctions placed on Iran have taken effect. 1/4","date":"Tue Jun 25 17:02:31 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@AlJazeera may have more expensive lawyers and teams of lobbyists, but clever accounting and legal tricks don't hide the fact that it’s an appendage of Qatar. It’s time to immediately suspend press credentials for the Al Jazeera news network! @FreeBeacon \n\nhttps://t.co/Bc6yzRTo3n","date":"Fri Jun 21 19:55:31 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/L61jsoWda2","date":"Thu Jun 20 14:33:25 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Since Jan. there have been roughly 440,000 arrests made at our southern border - this number is equivalent to the population of the entire U.P. + GT, Alpena, and Benzie counties. \n\nThere is a crisis on our southern border and Congress must step up and do our job.","date":"Thu Jun 20 14:33:24 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy birthday @USArmy!","date":"Fri Jun 14 19:43:26 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’m optimistic that as the NDAA moves through the legislative process, it will improve to a point where I can vote in favor of the bill.","date":"Thu Jun 13 16:58:49 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This year’s NDAA, however, does not build upon the progress that’s been made over the past several years, and contains provisions that led me to vote no on the bill’s final passage in committee.","date":"Thu Jun 13 16:58:48 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The National Defense Authorization Act has a longstanding history of bipartisanship as it provides for our national defense and supports our men and women in uniform.","date":"Thu Jun 13 16:58:47 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great news for my fellow Vietnam Veterans!","date":"Thu Jun 13 03:48:04 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The constituents of the First District of Michigan sent me to Washington to get things done, not give myself a pay raise. House leadership should focus on making sure more money is in the pockets of hard working Americans, not Members of Congress. https://t.co/VLpSIewyqB","date":"Mon Jun 10 20:00:40 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/D1Gbj4Idk8","date":"Mon Jun 10 20:00:40 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Had the privilege of having my friend @DrPhilRoe, Ranking Member of the @HouseVetAffairs, as my special guest this morning on @mibigshow. \n\nListen Here —&gt;\n\nhttps://t.co/ByCsSWembf","date":"Thu Jun 06 18:50:06 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"75 years ago, the largest amphibious assault in history was made on the beaches of Normandy. Allied troops knew that the eyes of the world were upon them and the fate of freedom was on their shoulders. \n\nWe honor all who fought to defeat fascism and pursue liberty on June 6, 1944 https://t.co/CfSjGE3xiH","date":"Thu Jun 06 14:30:01 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"☑️ Allows for easier scheduling and timely reimbursements to community providers.\n☑️ Increases access to timely quality care for Veterans enrolled in the VA healthcare system, no matter where they live.","date":"Wed Jun 05 20:19:11 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Fellow Veterans: VA Community Care is here!\n\nThe VA MISSION Act:\n\n☑️ Provides a new, streamlined community care program.\n☑️ Gives Veterans more choices and greater control over their healthcare.\n☑️ Expands walk-in and urgent care access for Veterans.","date":"Wed Jun 05 20:19:10 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Fellow Veterans: VA Community Care is here!\n\nhttps://t.co/ItX2uWRXiU","date":"Wed Jun 05 20:17:26 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"One week from tomorrow!","date":"Wed May 29 20:04:38 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to welcome many of my Michigan Congressional colleagues to the First District today. We took a few minutes this morning on Mackinac Island to outline our bipartisan work to improve water quality, stop invasive species like Asian carp, and protect the Great Lakes. https://t.co/C2U2k8IFkx","date":"Wed May 29 17:25:08 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On May 30th, I encourage you to join the #ExploreVA Facebook Live event to learn about the coming changes, what is available to you and what you must do before you can access care in your community.","date":"Tue May 28 19:03:36 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Reminder: Beginning next week the MISSION Act will go into effect and Veterans in Michigan's First District will have more options to receive the care they've earned, closer to where they live. https://t.co/5sjnk0onKM","date":"Tue May 28 19:03:36 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On this day of solemn remembrance, we honor our brothers and sisters who gave their lives in service to our great nation. \n\nMay we never forget! https://t.co/1WlW00kaDx","date":"Mon May 27 13:12:05 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s always an honor to welcome the U.P.  Honor Flight to Washington, and to thank these men and women for their service to our country. \n\nThese flights would not be possible without the dedication and relentless efforts of Scott &amp; Kim Knauf and so many dedicated volunteers. https://t.co/NHjQF0uuqh","date":"Wed May 22 18:21:40 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As we celebrate those who serve and have served, we must acknowledge the immense challenges still ahead to fix a system that has left thousands of our brothers and sisters behind.","date":"Tue May 21 13:28:35 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Recently I wrote a column in the @dcexaminer for National Military Appreciation Month.\n\nRead More Here —&gt;\n\nhttps://t.co/5GBrLIBjWk","date":"Tue May 21 13:28:34 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This Armed Forces Day I want to thank the Soldiers, Sailors, Airmen, Marines, and Coast Guardsmen for their service and sacrifice for our country! https://t.co/72eKODtEJW","date":"Sat May 18 19:21:59 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I appreciate @RepMoolenaar’s leadership on the House Appropriations Committee to ensure this vital project moves forward! \n\nhttps://t.co/3glK43ohJC","date":"Fri May 17 15:41:49 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"BIG NEWS: House Appropriations Committee introduced legislation that includes $75.3 million for construction of a new Lock in Sault Ste. Marie, Michigan.\n\nhttps://t.co/S3KRodERYc","date":"Fri May 17 15:13:36 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This new program, called VET TEC, will assist and encourage Veterans to transition from the world’s greatest military to the world’s most vibrant technology sector. Find out more about VET TEC here: https://t.co/bajWQDW5eC","date":"Fri May 10 20:41:36 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This week I had the chance to speak at the Veteran Jobs Mission about the value added to business by hiring Veterans. The Forever GI Bill, which was signed into law last Congress, creates a pilot program to help pay for Veterans to take certain high technology courses. /1 https://t.co/mckgBghvBJ","date":"Fri May 10 20:41:35 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Check out these First District facts by @MEDC ➡️\n\nDefense jobs ⬆️ 16.9%\n\nPersonal income ⬆️ 14.2%\n\nGDP ⬆️ 17.3% https://t.co/NkTEbRuPGS","date":"Fri May 03 18:11:37 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Back in Traverse City today speaking at the @MEDC Arsenal of Innovation.\n\nThe defense industry is a crucial part of #Mi01 economy. As defense and homeland security needs evolve, it’s imperative that MI businesses work to remain at the forefront of innovation and manufacturing. https://t.co/McYRnkrM0Z","date":"Fri May 03 18:01:39 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today we pray for our nation, our neighbors, and those across the world defending freedom. \n\n#NationalDayOfPrayer2019 #Love1Another https://t.co/0unNzVZSO7","date":"Thu May 02 17:41:05 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"At 7:00 this evening the @HouseVetAffairs will hold a full committee hearing on “Tragic Trends: Suicide Prevention Among Veterans.” \n\nThis evening’s hearing will be broadcast live on @cspan and I encourage you to join me and my colleagues. \n\nhttps://t.co/7WvNb4coil","date":"Mon Apr 29 22:19:02 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I will continue encouraging my colleagues to spend time talking to our Veterans and visiting the VA so that policies they push for reflect the needs of our nation’s heroes.","date":"Wed Apr 24 21:02:34 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/xJTUiuDNZC","date":"Wed Apr 24 21:02:34 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We have Veterans in #MI01 who’ve waited nearly a decade for their appeals to be heard, and others live hours from the closest VA facility.  Congress’ new reforms are bringing more accountability and access than ever to VA. No one in DC should feel satisfied with the status quo.","date":"Wed Apr 24 21:02:33 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This $600 million appropriation from Congress more than doubles federal funding available through USDA’s longstanding broadband programs.","date":"Tue Apr 23 14:58:29 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This will enable the federal government to partner with the private sector and rural communities to build modern broadband infrastructure in areas with insufficient internet service.","date":"Tue Apr 23 14:58:28 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: The U.S. Department of Agriculture (USDA) is now accepting online applications for funding through the new ReConnect Rural Broadband Pilot Program. \n\nhttps://t.co/Tqq4Evb3ci","date":"Tue Apr 23 14:58:28 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Mi01 is home to some of the greatest natural resources in the world. Today serves as a reminder to each of us that we have the responsibility of conserving these treasures so future generations can live, work, and play in the most beautiful area in the country. \n\n#HappyEarthDay https://t.co/XgEPWdvgtz","date":"Mon Apr 22 15:24:44 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As we celebrate the resurrection this Easter Sunday we are reminded of the hope, love, and forgiveness found in Christ, and His promise of new life. \n\nFrom Cindy and I, Happy Easter. https://t.co/GMyNQWkY0n","date":"Sun Apr 21 11:38:04 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@AaronParseghian Congratulations @AaronParseghian! Best of luck.","date":"Sat Apr 20 22:45:52 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#Mi01 is home to nearly 60,000 Veterans. As a retired General Officer and now as your Congressman, keeping our Veterans safe is one of my highest priorities. Join me to help prevent Veteran suicide. \n\nWatch: https://t.co/hv2y2zCcaf","date":"Fri Apr 19 14:38:13 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"After nearly two years of investigations, countless political and media speculation, over $25 million of taxpayer dollars spent, and hundreds of witnesses, Special Counsel Robert Mueller’s report confirms there was no collusion between Russia and President @realDonaldTrump. https://t.co/59NJiRzU2M","date":"Thu Apr 18 18:07:54 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to have signed this —&gt;","date":"Tue Apr 02 18:47:53 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’m proud to stand today with @SteveScalise and @RepAnnWagner to protect the most innocent and defenseless among us.","date":"Tue Apr 02 14:58:29 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On now with Omelette on 98.1 classic rock - the Bear. Talking about the time we spent with @POTUS yesterday.","date":"Fri Mar 29 10:40:31 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Just Now: @realDonaldTrump tells crowd in Grand Rapids he will fully fund the #GLRI (Great Lakes Restoration Initiative)! This is a big win for #Mi01 and the #GreatLakes\n\nThank you for your attention to Michigan Mr. President.","date":"Thu Mar 28 23:59:44 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The experts agree. It’s time to build a new Lock.","date":"Wed Mar 27 21:17:30 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"🍎 There are more than 11.3 million apple trees in commercial production in Michigan. \n\n🥒 Michigan is a top producing state of cucumbers, asparagus, blueberries, carrots, celery, and honey. \n\n🐄 Michigan is the fifth highest state for milk production.","date":"Thu Mar 14 18:55:48 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"🥔 Michigan is the leading producer of potatoes for potato chips. \n\n🍻 Michigan is now the fourth largest hop growing state.","date":"Thu Mar 14 18:55:48 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"To celebrate our incredible Michigan farmers, here are some Michigan #NationalAgricultureDay facts:\n\n🥗 Michigan produces over 300 agriculture commodities on a commercial basis. \n\n🍒 Michigan’s cherry production is about 250,000,000 pounds. https://t.co/qdYfIE4vYy","date":"Thu Mar 14 18:55:47 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Started the morning off at the Annual Congressional Marines breakfast. I had the opportunity to welcome the crowd and introduce my friend @CMC_MarineCorps Robert Neller. \n\nGeneral Neller has served as the 37th Commandant of the U.S. Marine Corps since 2015. Oorah! https://t.co/ipDt6oB1B8","date":"Wed Mar 13 14:44:15 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"A new Poe-sized Lock in the Soo has been a failed endeavor by politicians for decades, that is no longer the case. Recently, I led a letter with @RepMoolenaar and Rep. Paul Mitchell to OMB requesting the inclusion of Locks construction funding in the President's FY2020 budget.","date":"Tue Mar 12 18:02:23 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I'm thankful @realDonaldTrump has followed through on his promise to build a new Lock and included a request of $75.3 million to continue Lock construction in FY20! \n\nhttps://t.co/StAk3dAbru","date":"Tue Mar 12 18:02:22 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great stories of some of the remarkable First District women in history. \n\nHappy #InternationalWomensDay \n\nhttps://t.co/prJQBerLjh","date":"Fri Mar 08 23:27:39 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great start to the day in Marquette with @RepStephMurphy meeting with local leadership to discuss economic development, local business, and federal needs of the city and county. https://t.co/CFpQSaI8h4","date":"Fri Mar 01 15:55:57 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Although this legislation includes the word bipartisan in the title, it's just a far-left attack on those who legally own and utilize firearms. HR8 offers no real solutions to the gun violence facing our country.\n\nMy full statement: \n\nhttps://t.co/Bl6Ai1hYWH","date":"Wed Feb 27 21:02:19 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I just voted in opposition to H.R. 8. This bill is so far out of the mainstream, it would make borrowing a hunting rifle a felony, and subject the lender to the same criminal penalties of those who purchase a firearm for a known dangerous criminal. \n\n#2A #Support2A","date":"Wed Feb 27 20:59:17 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/jqX7776H6I","date":"Wed Feb 27 14:44:57 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I was proud to vote in favor of the Natural Resources Management Act. \n\n☑️ Directing all USFS and BLM lands to be open for hunting, fishing, and shooting. \n☑️ Permanently authorizes the @LWCFCOALITION \n☑️ Protects our rich outdoor and sportsman heritage. \n\nNext step: @POTUS desk!","date":"Wed Feb 27 14:44:56 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great day in the Soo! https://t.co/nWNT0YFPwv","date":"Thu Feb 21 20:59:40 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/Q2gWioEZQh","date":"Tue Feb 12 23:18:53 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our prayers are with Congresswoman Dingell and the entire Dingell family. \n\nCongressman Dingell’s memory and public service will not be forgotten by all the lives he touched.","date":"Fri Feb 08 03:37:43 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Democrat leadership in the House would do well to focus as much energy on opening the government as they are on keeping @realDonaldTrump from delivering his State of the Union address.","date":"Thu Jan 24 13:43:34 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Instead of working towards a compromise to open the government and secure our border, the Speaker is canceling session and barring @POTUS from delivering the State of the Union address at the Capitol. This is nothing short of political theater. Our constituents deserve better!","date":"Thu Jan 24 13:43:34 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"There’s only one thing I could’ve possibly been explaining to @OANN here. #PureMichigan #Mi01 https://t.co/BYBvptDLt4","date":"Wed Jan 23 18:59:22 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to continuing to serve the Veterans of #Mi01 and the nation as a member of @HouseVetAffairs. https://t.co/PGMmRL0aUf","date":"Tue Jan 22 21:33:31 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The life of Martin Luther King, Jr., changed and inspired the world. His dedication to equality, liberty, and justice has left an indelible mark on our nation. \n\nOn this #MLKDay of Service I was proud to join with @AmeriCorps at the Reining Liberty Ranch to help #GetThingsDone. https://t.co/V233Z6kAbm","date":"Mon Jan 21 18:22:40 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This weekend @realDonaldTrump put a very reasonable offer on the table to end this shutdown and secure our southern border. It's time for everyone to come to the table. \n\nRead my op-ed here --&gt; https://t.co/6lH0qyVqii","date":"Mon Jan 21 15:47:02 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Short answer: No","date":"Fri Jan 18 22:12:11 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#Mi01 is home to U.S. Coast Guard Sector Sault Ste Marie and Air Station Traverse City. I’ve recently sponsored the “Pay Our Coast Guard Act” to ensure the men and women of the @USCG receive their pay. \n\nRead more here —&gt; \n\nhttps://t.co/eyf6k6NeOd","date":"Fri Jan 18 21:29:16 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Accountability and oversight are paramount as we work to ensure every dollar spent on defense is maximized to best protect our nation and our allies. \n\nhttps://t.co/tHSdxEJxN9","date":"Thu Jan 17 17:59:17 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I'm honored for the distinct nomination to serve on the House Armed Services Committee. As we face uncertain times, military readiness and proper funding are essential. \n\nAs new threats emerge, our military must remain the strongest and most lethal force in the world.","date":"Thu Jan 17 17:59:16 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to introduce this legislation in the 116th Congress alongside my colleagues @DrNealDunnFL2 and @RepAnnieKuster. See more here —&gt;","date":"Tue Jan 15 21:24:35 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Just getting back to my office after meeting with @POTUS and @VP at the @WhiteHouse. It’s time Democrats come to the table and work together to secure the border and end this shutdown.","date":"Tue Jan 15 19:44:37 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Americans sent us to Washington to solve problems – and if we can't do that, we don’t deserve to get paid. 4/","date":"Thu Jan 10 19:50:12 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"If Congress can’t do its job resulting in a shutdown, we should forfeit our pay as well. \n\nLast week, I cosponsored legislation with @RepRalphNorman to prohibit Congress from receiving compensation during a government shutdown. 3/","date":"Thu Jan 10 19:50:11 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I support @POTUS in this fight for #bordersecurity because there is no greater responsibility than protecting the American people. As negotiations continue, I’ll be donating my salary to local charity organizations in #Mi01. 2/","date":"Thu Jan 10 19:50:11 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"One of the main priorities of Congress is to fund the federal government and prioritize our national security, yet Democrats are refusing to come to the negotiating table to do just that. 1/","date":"Thu Jan 10 19:50:10 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s past time for Democrats to come to the table with a plan","date":"Wed Jan 09 19:32:07 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I support @POTUS call for border security. The President is only asking for support of policies that Democrats have supported and voted for just a few short years ago. We must do whatever it takes to prioritize national security and secure our borders.","date":"Wed Jan 09 19:32:07 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I look forward to working with the new Speaker to ensure the 116th Congress focuses on important issues – Veterans’ care, stronger border security, rising healthcare costs, continuing our momentum on the Soo Locks, and ensuring broadband access for rural Michiganders.","date":"Thu Jan 03 20:36:45 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’m honored the constituents of the First District have entrusted me to serve as their Representative in the 116th Congress. It’s imperative that Congress continues the momentum of the past two years, and we work to pass constituent-centric policies.","date":"Thu Jan 03 20:36:45 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s time to get this bill back through the House, through the Senate, and on to @POTUS desk.","date":"Thu Jan 03 19:53:28 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#Mi01","date":"Thu Jan 03 03:18:04 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Recently I had the opportunity to speak at the christening ceremony of the future USS St. Louis (LCS-19) in Marinette. \n\nWatch here --&gt; https://t.co/qWWXvbu307","date":"Wed Jan 02 22:39:36 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Rebuilding our Naval fleet is paramount to the safety and security of our nation and Allies. I'm proud that much of the workforce building the LCS class ships are from right here in the First District of Michigan.","date":"Wed Jan 02 22:39:36 +0000 2019","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"From our nurses and first responders, to those who serve in our nation’s military, we celebrate in peace and safety because of the sacrifices they continue to make.\n\nMerry Christmas and Happy New Year, Mi01.","date":"Tue Dec 25 15:43:08 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As we gather together to celebrate the holidays, let’s remember those who are unable to celebrate at home as they serve their communities and our country.","date":"Tue Dec 25 15:43:07 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I would like to wish each of you a very Merry Christmas. We are thankful for the many blessings we’ve been given and are so grateful for the impact each of you have had on our lives. https://t.co/7C0h7s1gKs","date":"Tue Dec 25 15:43:05 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Still at work here in Washington, D.C., waiting on the Senate to get us a bill that does two of the very basic responsibilities of Congress - fund the government and secure our borders.","date":"Sat Dec 22 03:36:53 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"...and served alongside him in Quantico. I’ve witnessed firsthand his character, dedication, integrity, and knowledge. His legacy of service to our nation should never be forgotten; our citizens will forever be in his debt.","date":"Fri Dec 21 15:25:28 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"General Mattis has served our nation honorably and with distinction both in uniform and as Secretary of Defense. We are undoubtedly a better and safer nation as a result of his leadership over the past 40 years. I had the pleasure of pinning on my first star with Gen. Mattis...","date":"Fri Dec 21 15:25:27 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Big win for #Mi01 farmers!","date":"Thu Dec 20 21:48:49 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Earlier today I joined my @HouseVetAffairs colleagues at a press conference to discuss the Blue Water Navy Bill, which passed the House unanimously, and has been held up in the Senate. \n\nWe must do better by our Veterans. I will not stop fighting, there’s work left to be done. https://t.co/RuanvZnrGi","date":"Thu Dec 20 20:31:56 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Earlier today I was proud to vote in favor of legislation aimed at ensuring all congressional staff have a safe work environment. Everyone deserves that. Lawmakers, not taxpayers, should be held responsible for any harassment allegations that occur on their watch.","date":"Thu Dec 13 20:13:35 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This Christmas season, let’s make sure we keep in mind the brave men and women who wear our nation’s uniform. If you would like to send notes to our troops, visit https://t.co/e3uFU1jbln","date":"Tue Dec 11 16:32:26 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This morning @RepWalorski and I had the opportunity to join the @RedCross “Holidays for Heroes” event, to write letters thanking our troops for their service and wishing them a happy holiday season. https://t.co/Il9mENhBh6","date":"Tue Dec 11 16:32:25 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We must never forget those who lost their lives on this infamous day 77 years ago, in the attack on Pearl Harbor. In the years following, our country lost over 400,000 men and women fighting in WW II. Today and everyday, let's honor those who've sacrificed so much for our nation. https://t.co/NMkoiy5CdB","date":"Fri Dec 07 18:38:01 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Over $21 million in federal grants and nearly $8 million in loans are headed to Gogebic and Schoolcraft counties to replace miles of water and sewage systems. Many of these systems date back to the early 1900’s. \n\nRead more here ➡️➡️➡️ \nhttps://t.co/Pk1ammB95h","date":"Tue Dec 04 17:06:56 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our prayers are with the entire Bush family through this time. \n\nFair Winds and Following Seas, Sir.","date":"Sat Dec 01 16:05:03 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I are saddened to hear of the passing of President George H.W. Bush. \n\nAs a hero of World War II, a devoted public servant, and as President of the United States, President Bush loved our country, and led his life as a man of dignity, humility, and character. https://t.co/tbK9pDlDuv","date":"Sat Dec 01 16:05:03 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Ran across this picture recently, so I thought we’d do a #ThrowbackThursday from around the holidays in 2005 in Iraq. I’m so thankful to have had the opportunity to serve alongside such outstanding men and women in the @USMC #TBT https://t.co/ZdtzNrzBmA","date":"Thu Nov 29 18:28:16 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Updated Soo Lock News: $32 Million has been allocated by the Army Corps to begin construction of a NEW Lock in Sault Ste. Marie. U.S. Army Corps of Engineers, Detroit District will begin work in Spring of 2019. \n\nRead more here ➡️➡️➡️ \n\nhttps://t.co/s3H7MfLX4G","date":"Mon Nov 26 18:28:54 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"If signed into law, this bill would return power back to the states, allowing us to appropriately manage our wolf population and protect our farms and our wildlife.","date":"Fri Nov 16 21:41:58 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The Manage Our Wolves Act is a major win for sportsmen and farmers and the state wildlife agencies who have worked diligently to bring the wolf population back to adequate levels. \n\nhttps://t.co/RRcWCgLGau","date":"Fri Nov 16 21:41:57 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Attended an important hearing today regarding Veterans receiving the GI Bill payments they are owed. These payments are critical for our Veterans and any delay is unacceptable. https://t.co/dJ7K7ofCGK","date":"Thu Nov 15 22:47:00 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"100 years ago today on the eleventh hour of the eleventh day of the eleventh month, the Armistice was signed between the Allied Forces and Germany, officially ending World War I.","date":"Sun Nov 11 16:21:58 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, we celebrate those who’ve answered the call to serve their country, those who sacrificed so much for the cause of freedom, and those who still proudly wear the uniform and flag of our United States of America throughout the world. \n\nTo all who served - Happy Veterans Day!","date":"Sun Nov 11 16:21:58 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy Birthday, @USMC!","date":"Sat Nov 10 14:12:41 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/zXNgCumRi8","date":"Thu Nov 01 18:25:41 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Yesterday, @realDonaldTrump began the initial process to end Turkey's duty-free access to the U.S. market. I applaud the Administration for positively answering our request to withdraw the Republic of Turkey's duty-free benefits, siding with Michigan cherry farmers.","date":"Thu Nov 01 18:25:40 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This morning in Traverse City I met with Sue Boyko and the great staff  at North Flight EMS and Aero Med to learn more about the great work they do, and the needs they have. \n\nI’m proud of our #Mi01 First Responders and I’m thankful for their service to our community and country. https://t.co/ULm1v3G77q","date":"Mon Oct 29 16:19:19 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Check out @RepMoolenaar and I on @9and10News podcast talking about the Soo Locks!","date":"Sun Oct 28 22:02:33 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our prayers are with those affected and our gratitude is with the law enforcement officers who so bravely put their lives on the line to stop this evil man. \n\nhttps://t.co/HbeMS40n30","date":"Sun Oct 28 14:42:08 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our hearts break for the lives lost in this senseless tragedy in Pittsburgh. There’s no room in our country for hate, and all leaders must unequivocally denounce these hateful actions.","date":"Sun Oct 28 14:42:07 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today @POTUS signed the WRDA bill which the House recently passed, authorizing $922 Million for a new Soo Lock. \n\nThis is major news for #MI01!","date":"Tue Oct 23 23:08:09 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"🚨🚨 —&gt; National unemployment rate hits nearly 40 year low. \n\nManufacturing optimism reaches 92%. \n\nU.P. jobless rate fell to the lowest August rate in nearly 20 years.\n\nAll 32 #MI01 counties jobless rates down over past year.  \n\nMore work to do? Yes. But we are #BetterOffNow","date":"Fri Oct 05 15:59:00 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our manufacturing workers are the most productive, innovative, and creative in the world. \n\nCelebrate Michigan manufacturing this #MFGDay18 by attending an event near you - https://t.co/lKYqo43gip","date":"Fri Oct 05 15:20:16 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"New: Agreement paves way for Enbridge to permanently shut down, replace Line 5 beneath the Straits of Mackinac. https://t.co/wW933oYpIn","date":"Wed Oct 03 16:52:55 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"More great economic news. The U.S. private sector added 230,000 jobs in September alone, nearly 45,000 above predictions. \n\n“At the current pace of job creation, unemployment will fall into the low 3%’s by this time next year.”\n\n#BetterOffNow \n\nhttps://t.co/sFe0KpQbtt","date":"Wed Oct 03 15:07:33 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The announcement of a new trade agreement to replace the outdated and flawed NAFTA is great news for the First District of Michigan. I applaud @realDonaldTrump's commitment to putting America’s workers first. \n\nRead my full statement here —&gt; https://t.co/7I0OTi4p6G","date":"Tue Oct 02 16:47:24 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"That's why I was proud to support The Protecting Family and Small Business Tax Cuts Act which continues the momentum of the Tax Cuts and Jobs Act by permanently cutting taxes on small businesses and hardworking Americans.","date":"Mon Oct 01 15:14:08 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"In the past few days we saw the news that from August 2017 through August 2018, unemployment rates dropped in every single county in the State of Michigan. This is further proof that tax reform is working, companies are hiring, and Michigan's First District is open for business.","date":"Mon Oct 01 15:14:07 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our nation's economy is on the rise, jobless rates are falling, and hardworking men and women in MI01 are keeping more of their paycheck.","date":"Mon Oct 01 15:14:07 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Good news for #Mi01","date":"Sun Sep 30 22:34:14 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I was honored to welcome all of the men and women from today’s Mid-Michigan Honor Flight to Washington, and see so many of our nation’s heroes, including 25 World War II Veterans. \n\nWe will forever be indebted to these men and women who wore our nation’s uniform. https://t.co/8JkcMPoRsn","date":"Thu Sep 27 02:29:16 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Conserving our natural resources is essential for those of us who call Mi01 home, that’s why I proudly support H.R. 502 and H.R. 6510 to reauthorize the Land and Water Conservation Fund and to fund the deferred maintenance backlog at our National Parks. #SaveLWCF #FixOurParks","date":"Sat Sep 22 12:46:06 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s the 25th National Public Lands Day! You can visit our treasured National Parks, like the Sleeping Bear Dunes National Lakeshore, for free today.","date":"Sat Sep 22 12:46:05 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The Marine Corps Reserve had F-18’s stationed at Joint Base Andrews and we had them in the air within minutes as the events of the morning unfolded.","date":"Tue Sep 11 14:12:29 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The days and years ahead would bring much change to the lives of millions of Americans, especially our young Soldiers, Sailors, Airmen, Marines, and Coast Guardsmen, and their families. \n\nAmericans will never be intimidated. We will never back down. We must never forget.","date":"Tue Sep 11 14:12:29 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As Commanding General of 4th Marine Aircraft Wing, I initiated a temporary command center in Watersmeet until travel would allow me to return to Wing Headquarters in New Orleans.","date":"Tue Sep 11 14:12:28 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On the 11th of September, 2001, I was at home in Watersmeet with Cindy when we heard the news. As a commercial airline pilot and Marine, I knew immediately this day would forever have an impact on our nation.","date":"Tue Sep 11 14:12:27 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"{Thread} 17 years ago today, our world forever changed. Terrorists attacked our nation, killing 343 of our nation’s finest first responders, and thousands of innocent civilians.","date":"Tue Sep 11 14:12:27 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Find more great Yooper facts here: https://t.co/pQ7EfWe7qq","date":"Thu Sep 06 21:58:11 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"🚘Copper Harbor is the farthest town from an Interstate Highway (251 miles) in the continental United States.\n🌊 There are 1,700 miles of Great Lakes shoreline.","date":"Thu Sep 06 21:56:11 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"❄️ The least snowfall in the Keweenaw in one year was 81 inches, which fell in the winter of 1930-1931.\n🌨The most snowfall in the Keweenaw in one year was 356 inches, which fell in the winter of 1978-1979.","date":"Thu Sep 06 21:56:10 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Some fun Upper Peninsula facts for you on #906Day:\n\n🌳 There are 8.8 million acres of forest in the Upper Peninsula, out of a total of 10.5 million, making 84% of the Upper Peninsula covered by forest.","date":"Thu Sep 06 21:56:10 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The number of Americans filing for unemployment benefits fell to near a 49-year low last week.\nThe figures add to signs businesses are keeping existing staff and adding new workers to help meet demand being boosted by tax cuts. https://t.co/QMQTt7B791","date":"Thu Sep 06 19:19:48 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"While unemployment continues to decline in Michigan’s First District, there’s more work to accomplish to ensure good paying jobs stay here, and that our workforce is qualified to fill those jobs!","date":"Thu Sep 06 19:19:48 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/pUONix5OuJ","date":"Wed Sep 05 19:12:06 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"With over $50 mil of deferred maintenance at MI parks alone, it’s clear Congress has “kicked the can down the road” far too long. I’m proud to cosponsor the bipartisan “Restore our Parks and Public Lands Act,” which will begin addressing the maintenance backlog at #Mi01 Parks.","date":"Wed Sep 05 19:12:05 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The carpenters, steelworkers, firefighters, factory workers, brewers, teachers, nurses, law enforcement officers, miners, loggers, linemen, and all of our nation’s workforce.\n\nHere’s to celebrating you - Happy Labor Day!","date":"Mon Sep 03 16:05:42 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today we celebrate the men and women who crafted our nation. Those who protect our borders, build our infrastructure, serve our communities, and help build our futures through the labor of their hands. /1 https://t.co/fCVCLZEVY0","date":"Mon Sep 03 16:05:41 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Very few Americans have endured John McCain’s pain. Our country lost a true patriot today. His long and selfless service to the United States of America should inspire us all.  May God rest his soul.","date":"Sun Aug 26 01:40:26 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Got a little stick time in while visiting local businesses in Menominee this weekend! \n\nThanks for the time in the 480B @EnstromHeli!","date":"Sun Aug 19 23:45:15 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today I had the opportunity to spend time and speak with some of our nation’s finest young men and women at Camp Grayling as the @MINationalGuard held their multi-national and multi-service “Operation Northern Strike.” Thanks for the invite General Vadnais! https://t.co/6RZ3Kj2GDS","date":"Tue Aug 14 23:42:36 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy Anniversary Marines! \n\nOoh-Rah!","date":"Mon Aug 13 16:06:34 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We’re continuing to work with the Governor’s office on the appeal process to help get assistance to those whose homes were damaged.","date":"Fri Aug 10 18:02:20 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great to see you today Cory. Excited about the work you guys are doing @PackerlandBB and @CCISystemsInc!","date":"Thu Aug 09 20:36:56 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy Birthday @USCG! https://t.co/vX0bCw4dMU","date":"Sat Aug 04 18:08:36 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"\"With 157,000 jobs created in July, including 37,000 in manufacturing, this report shows tax reform and regulatory relief are continuing to deliver for America's manufacturing workers,\" said Carolyn Lee. \n\n#BetterOffNow \n\nhttps://t.co/SAahbx1fWH","date":"Fri Aug 03 19:16:44 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The bipartisan work done to get this bill on the President's desk and signed into law helps ensure the next generation reaches their full potential. \nhttps://t.co/TkIUnJvPaq","date":"Thu Aug 02 18:59:11 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Easing over-burdensome regulations that previously kept communities from accessing critical CTE resources, to increasing the cap on the amount of money states can set aside for use in rural areas like our district--this is a win for education and for training our future workforce","date":"Thu Aug 02 18:59:10 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’m honored to have the opportunity to speak this Saturday at the Vietnam Moving Wall in Manistique, and I’m looking forward to seeing many of you there, as we honor those who sacrificed their lives for their country. \n\nhttps://t.co/QgvTE9gRFw","date":"Wed Aug 01 15:21:34 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"There’s more work to do, but this is good news for #Mi01 families.","date":"Tue Jul 31 19:22:05 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I was honored to receive the invitation to carry the colors with fellow Veterans in the Grand Entry ceremony of the annual Keweenaw Bay Indian Community Powwow. Enjoyed a beautiful U.P. evening among friends, participating in great traditions and festivities. #Mi01 https://t.co/dohEa6Jtig","date":"Sun Jul 29 01:32:47 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/aCPl7b6luc #MI01","date":"Mon Jul 23 15:22:36 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks to our pro-growth agenda, the economy is booming, small businesses are more optimistic about their future, and First District families will save more than $14,000 in the next ten years. \n\nSee how else everyday Americans are benefiting from this agenda →#betteroffnow https://t.co/oxGUIHldrN","date":"Mon Jul 23 15:22:35 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As I said at the ceremony - the Great Lakes are our nation’s most valuable natural resource, and the work that will be done here and in facilities like this around the First District will help ensure our kids and grandkids can work, play, and stay in the Great Lakes region.","date":"Sat Jul 21 13:35:50 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Enjoyed another great day in the Soo yesterday as we broke ground on the LSSU Center for Great Lakes Research. https://t.co/3cFAHybwHW","date":"Sat Jul 21 13:35:48 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Enjoyed talking with constituents in Newberry about the positive results #TaxReform has brought to Michigan, discuss the progress we’ve made on the Soo Locks, and continue the conversation about the work being done on broadband. #BetterOffNow https://t.co/LE4lWe2XdE","date":"Fri Jul 20 17:20:43 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for having me today at the @CLE_Cliffs Tilden and Empire Mines. I’m proud of our rich mining heritage in the Upper Peninsula. Today’s visit reinforced my strong support of our steel and mining industries in Michigan’s First District. https://t.co/XRk7ux3mn9","date":"Thu Jul 19 20:22:49 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Civil discourse strengthens our nation! July 12th is #NationalDayofCivility! Let's celebrate by treating everyone we meet with respect &amp; dignity, even when we disagree! #ReviveCivility https://t.co/MKtRPCQlJ3","date":"Thu Jul 12 15:13:18 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We’re delivering on the promises we've made to everyday Americans:\n✔ Combat the #opioidcrisis\n✔ Make schools safer\n✔ Booming economy\n✔ Safer communities\n✔ Strengthened military\n#betteroffnow https://t.co/aCPl7b6luc https://t.co/V7Qpnt3HCt","date":"Wed Jul 11 15:35:13 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"You can see my full statement here: https://t.co/HPw9BeR6x8","date":"Wed Jul 11 15:09:09 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My bill, H.R. 6302, the Cormorant Relief Act, just passed @NatResources Committee and we are now one step closer to reinstating proper cormorant management in Michigan. \n\nSpecial thanks to Chairman Rob Bishop and @MichiganDNR for your support on this important legislation.","date":"Wed Jul 11 15:09:08 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, @SenGaryPeters , @SenStabenow, and I, urged @POTUS to approve Lt. Governor @briancalley’s request for a major disaster declaration following severe flash flooding in Houghton, Gogebic and Menominee counties. https://t.co/iryd4kE3E0\n\nYou can read our full statement here---&gt;","date":"Wed Jul 11 14:06:00 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#TaxReform continues to work! https://t.co/NUzzQoNhRZ","date":"Mon Jul 09 16:39:05 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#Mi01 Is home to some of our nation’s most treasured natural resources. Beautiful picture @Interior! https://t.co/8ShzjxDUAW","date":"Tue Jul 03 16:25:48 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Providing for the defense of our nation is the highest Constitutional priority of the U.S. Congress. I’m honored to represent the @housebudgetGOP alongside @rep_SteveWomack on the FY19 NDAA Conference Committee. https://t.co/nqSFy6q6s0","date":"Tue Jul 03 16:16:14 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I'm proud to have worked with the Army Corps to ensure this study was finalized, and applaud Army Corps leadership for recognizing the importance of this task, and for formally recommending the construction of a new Poe-sized lock in the Soo.\n\nhttps://t.co/r0pWH6aDJW","date":"Fri Jun 29 20:55:15 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Strong work @MINationalGuard. #Mi01 is thankful for you, and the work you have done! https://t.co/jCZJDC5PcY","date":"Thu Jun 28 13:35:43 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Yesterday I welcomed 4-H students from Munising, Skandia, Lachine, and Wetmore to my D.C. office. They were here as part of the 4-H Citizenship Washington Focus trip. Our next generation of U.P. leadership is strong! 🍀 https://t.co/5Oa7yI7dQy","date":"Thu Jun 28 12:32:10 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"If you’re interested in a internship position in my Washington or District offices, contact us at https://t.co/mPFRQzKBvA","date":"Wed Jun 27 21:45:33 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’m continually impressed with the amount of young talent in Washington, and this year’s summer interns sure have exceeded expectations. I’m thankful for the opportunity to work with them, and am proud to have First District talent in my Washington office. https://t.co/m1AF5weWIz","date":"Wed Jun 27 21:45:31 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’m so proud to represent the hardworking, compassionate, and resilient residents of the First District, and stand ready to assist any way we can at the federal level. #Mi01 https://t.co/tWWoYS2mzB","date":"Sun Jun 24 18:12:53 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Back on the ground this morning in Ripley in Houghton County as the work to recover continues. FEMA will be conducting a Preliminary Damage Assessment this week in conjunction with the State of Michigan, this is the next step toward ensuring federal assistance for disaster relief https://t.co/RdKQXH8DVN","date":"Sun Jun 24 18:11:58 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The U.P. spirit is resilient, and together we will will rebuild and recover.","date":"Tue Jun 19 01:49:04 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As a Marine Commander, I've been a part of many disaster relief efforts throughout the country, and the coordination, volunteerism, and initial recovery efforts that took place here over the past several days has been exceptional.","date":"Tue Jun 19 01:49:03 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I've spent the day in Houghton visiting with constituents, talking with local officials, and viewing the extent of the damage with the Michigan State Police. https://t.co/yteWHF6trq","date":"Tue Jun 19 01:49:02 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I want to personally thank all of the Fire, EMS, and Law Enforcement agencies who’ve done such an incredible job serving and protecting their communities through this unprecedented flood. Your service and sacrifice does not go unnoticed!","date":"Mon Jun 18 10:58:19 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’m heading up to Copper Country shortly to assess the damage caused by the flash flooding and assist in any way possible. I will keep you updated as more information becomes available throughout the day.","date":"Mon Jun 18 10:58:18 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Update on the flooding situation in the Upper Peninsula. https://t.co/WlDGDwYhj9","date":"Sun Jun 17 20:23:15 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Game on!!! https://t.co/wUyzCKPemV","date":"Thu Jun 14 17:19:07 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Excited for tonight’s Congressional Baseball Game for Charity at Nationals Park! At last year’s game, we raised $1.7 million dollars for 12 different local charities. https://t.co/XoR8whImHA","date":"Thu Jun 14 17:17:29 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to tomorrow’s charity baseball game! https://t.co/k0QxICpvrX","date":"Thu Jun 14 01:44:38 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We had a great day in Alpena yesterday. You can get a nice recap of the day here from @AlyssaMcCannTV with @WBKB11! https://t.co/EgTn8mxXei","date":"Tue Jun 12 19:05:42 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great to have @Interior at today’s @NatResources hearing in Alpena on cormorant management. Thanks @SecretaryZinke! https://t.co/PP5LbmICkx","date":"Mon Jun 11 23:27:55 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for coming “Up North” Team @Interior! https://t.co/R53Xor8NXn","date":"Mon Jun 11 21:50:43 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As we remember and reflect on the sacrifices made 74 years ago today, our nation and the world will forever be grateful for those who sacrificed all to free a continent, and rid the world of Nazi tyranny.","date":"Wed Jun 06 19:44:41 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As a kid we were always taught that service comes before self. My father was a Petty Officer Third Class in the U.S. Navy and served in the South Pacific during World War 2. We owe an immeasurable debt to those who've gone before us to secure our liberties. https://t.co/TQYzmJh8E8","date":"Wed Jun 06 19:44:40 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Big news: @NatResources is coming to #Mi01! https://t.co/F7Lb4hSe9D","date":"Wed Jun 06 18:58:55 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was meant to be. Great to have my friend @SteveScalise back on the field. https://t.co/qs5Xr08VBM","date":"Wed Jun 06 12:23:26 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"One of the highlights of my week was having the opportunity to speak at the United Tribes of Michigan summer meeting in Petoskey to discuss legislation and policy that we are working to accomplish together.","date":"Sun Jun 03 16:04:41 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Northern Michigan and the Upper Peninsula are home to eight federally recognized Indian tribes. This is one of the reasons I’m honored to be the first member of Congress from Michigan’s First District to become a member of the bipartisan Native American Caucus. https://t.co/EJHLpwEh0Y","date":"Sun Jun 03 16:04:40 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today we honor those who gave all to secure the liberties and freedoms we enjoy as Americans. Their sacrifice for the good of our nation must never be taken for granted. https://t.co/Cik6oRHUA7","date":"Mon May 28 17:57:06 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Tune in at 11! https://t.co/IQsFrzmYMN","date":"Sun May 27 14:04:00 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Tune in to WDBC Escanaba at 8:30. I’ll be joining Craig Woerpel live to discuss the VA legislation that we’ve passed over the past several weeks.","date":"Thu May 24 12:12:00 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I applaud Chairman @MacTXPress for including language in the FY19 NDAA highlighting the critical role the Soo Locks play in our national security. \n\nhttps://t.co/siuFtpHhxt","date":"Wed May 23 17:06:46 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was my honor to meet Veterans from all throughout Michigan as they arrived @ArlingtonNatl to visit the Tomb of the Unknown Soldier with the Mid-Michigan Honor Flight. https://t.co/TiW8S8pyLf","date":"Wed May 23 12:35:36 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"May is #MentalHealthMonth. \n\nIf you or a loved one need someone to talk to, visit https://t.co/2kNuErwd47 or call toll free at 1-800-342-9647 https://t.co/RaRx7O9vR2","date":"Mon May 21 15:40:58 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This is great news for the United States, and extremely important progress to have all three Americans back on U.S. soil as negotiations and peace talks continue. Great work by @realDonaldTrump and diplomats within this Administration. https://t.co/GZAvKzz1le","date":"Wed May 09 18:15:57 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My statement on President Trumps announcement today regarding Iran: https://t.co/wuBwDdbOHQ","date":"Wed May 09 00:26:08 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Can’t get enough of this #Mi01 beauty. Thanks for capturing it, @DustinDilworth https://t.co/khVwbrxHgy","date":"Mon May 07 19:35:04 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As businesses throughout the U.P. and northern lower peninsula begin to see the benefits of tax reform and seek to expand operations, workforce development remains one of the biggest challenges facing businesses of all sizes. #TaxCutsandJobsAct https://t.co/xIfPvac3nh","date":"Mon May 07 15:16:14 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Last week while in Iron River I had the chance to tour Lake Shore Systems, Inc. to see the work they are doing for the mining and maritime industries.","date":"Mon May 07 15:16:11 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great to be back on the practice field today! https://t.co/M7WUn8Ed7b","date":"Wed Apr 25 20:54:03 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Yesterday I had the privilege of presenting several medals to area Veterans and their families at my Traverse City Office. My office staff works tirelessly to help Veterans receive the benefits they’ve earned, as well as the commendations that they deserve.","date":"Tue Apr 24 16:20:55 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Watch the video below from UpNorthLive that commemorates this emotional event. 🇺🇸 #Mi01 \n\nhttps://t.co/KxzR5BGjh1","date":"Tue Apr 24 16:20:55 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Keep up the great work. #EarthDay2018 https://t.co/s2ki5B3V8w","date":"Sun Apr 22 20:24:14 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy Earth Day, from #Mi01 🌎 https://t.co/lcaFHv9Yrj","date":"Sun Apr 22 20:22:01 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was great having students from @michigantech at my D.C., office today advocating for science and technology education. #MI01 https://t.co/EzX9IVqRUq","date":"Wed Apr 18 21:28:42 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Goodbye’s aren’t usually happy occasions, but as we say farewell to our outdated tax-code, it’s all smiles for the constituents of the First District. \n👋🏼👋🏼👋🏼\n\n#TaxDay #TaxCutsAndJobsAct https://t.co/M7t2mdYQvK","date":"Tue Apr 17 16:10:10 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Congratulations to @des_linden on finishing first in the Boston Marathon! https://t.co/t8njugC2M1","date":"Mon Apr 16 23:39:09 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Started the day with a visit to the Grand Traverse Distillery.\n\nIt’s exciting to see another firsthand example of how the #TaxCutsAndJobsAct is helping small businesses grow and thrive in Michigan’s First District. https://t.co/UKG9A0cS5k","date":"Mon Apr 09 17:40:15 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our young men and women in uniform continue to stand up and hold the line when our country needs them most. It was an honor to meet so many of our nation’s young leaders and spend time with them on this special night.","date":"Sun Apr 08 22:59:57 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"After meeting with constituents throughout Houghton, Ontonagon, and Calumet, I had the privilege of speaking at the @michigantech Military Ball last night. https://t.co/iOPP298pRU","date":"Sun Apr 08 22:56:41 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The great gift of Easter is the hope we are given through the resurrection. \n\nFrom my family to yours, Happy Easter! https://t.co/QQVYr3Uayq","date":"Sun Apr 01 12:13:20 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"In case you missed it, yesterday I introduced bipartisan legislation with @RepScottPeters @RepJimBanks and @DrNealDunnFL2 to reduce bureaucratic overreach and red-tape within the VA. \n\nRead the full story here:\n\nhttps://t.co/84K4Yj2UCx","date":"Fri Mar 30 14:28:04 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I appreciate Dr. Shulkin's work within VA, and I thank him for his service to our Veterans.\n\n\"I look forward to meeting Adm. Jackson and continuing our work with this Administration as we steer the VA back to its core mission – caring for our nation’s Veterans.\"","date":"Thu Mar 29 17:46:24 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"\"Now more than ever, the @DeptVetAffairs needs stable and reliable leadership. We've begun making positive strides to address the issues plaguing the VA, and there’s a lot of work still ahead.","date":"Thu Mar 29 17:46:23 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"➖ For reference - all three of J.R.R. Tolkiens “Lord of the Rings” books combined equal just over 1200 pages. \n➖ Government spending is out of control.","date":"Fri Mar 23 15:57:41 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"➖ This is what 2230 pages of government spending looks like. \n➖ We had roughly 17 hours to review this bill prior to the vote. \n➖ You would have to read over 130 pages per hour to accomplish this task (That’s over 2 pages a minute, nonstop for 17 hours). https://t.co/D1V7KQfUfR","date":"Fri Mar 23 15:57:11 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our budgeting and appropriating process is broken and can no longer be ignored. Read my full statement here:\n\nhttps://t.co/xJAgvRYWdq","date":"Thu Mar 22 20:42:41 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today I voted against the $1.3 Trillion, 2200 page, Omnibus spending package. I wasn’t sent to Washington to represent the Administration or Party leadership—I was sent to work for the people of the 1st District of Michigan.","date":"Thu Mar 22 20:42:40 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"To those who work in acres, not in hours - thank you. \n\n#NationalAgricultureDay #AgDay2018 #Mi01 https://t.co/ZEiOGCpSAb","date":"Tue Mar 20 20:10:00 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I was honored to receive the @USChamber Spirit of Enterprise Award today. \n\nFrom the Protecting Seniors' Access to Medicare Act of 2017 to the Tax Cuts and Jobs Act, I'm proud to fight for the constituents and small businesses of Michigan's First District. https://t.co/3A3eG3wigc","date":"Tue Mar 20 17:12:56 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We are excited to announce the 2018 Congressional Art Competition for high school students from Michigan’s First District. \n\nTo learn more visit https://t.co/IWAYxGuSHt https://t.co/KtulSLRuG4","date":"Mon Mar 19 16:20:42 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy St. Patrick’s Day! https://t.co/cVRseKlZP9","date":"Sat Mar 17 16:52:02 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As an avid supporter of our Community Health Centers in the 1st District, it was great to meet with you and discussed legislative priorities for 2018 and beyond. https://t.co/YjNqjsFXDJ","date":"Thu Mar 15 22:07:35 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Had the privilege of meeting Pastor Tony Duty of First Baptist Church of Boyne City. Thanks for taking the time to stop by the D.C. office today Pastor. https://t.co/XEP1rEOk5U","date":"Tue Mar 13 20:23:07 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Recently, I had the opportunity to hear from multiple Veteran's Service Organizations on their legislative priorities for 2018. I'm energized to continue the work we've started on the @HouseVetAffairs and I'm thankful for the input and work our VSO's do to support our Veterans. https://t.co/uAAiGC2LrS","date":"Mon Mar 12 19:57:42 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This week I signed on to a bipartisan letter with my colleagues in the House urging full funding for the GLRI for FY2019. Read my full statement here --&gt;\nhttps://t.co/lFVHRphj4t","date":"Fri Mar 09 17:53:46 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The work being done through the GLRI to ensure our Great Lakes remain vibrant is critical to the health of our Great Lakes, our communities, our rich sportsman heritage, and the economy of northern Michigan and the Upper Peninsula.","date":"Fri Mar 09 17:53:45 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"How about a #ThrowbackThursday from 2007? Whether in a suit as your Representative or in uniform as a Marine, it’s always an honor to serve our great nation. #TBT https://t.co/cWsBEtMJd2","date":"Thu Mar 08 15:12:49 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Last night I joined my Michigan colleagues on the House floor to talk about the benefits we're beginning to see, thanks to the #TaxCutsAndJobsAct. \n\nTax reform is working for the people of the 1st District! https://t.co/84Uoq8lIzX","date":"Wed Mar 07 19:42:47 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great to meet with you! Thanks for the opportunity! https://t.co/4e8J6RwPwh","date":"Wed Mar 07 17:08:01 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Enjoyed a great conversation this week with county commissioners from Northern Michigan and the Upper Peninsula. Thanks for stopping by the D.C. office. https://t.co/kw1fdNJNzs","date":"Wed Mar 07 17:06:26 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’ll continue supporting our farmers and working with stakeholders on the ground to resolve these extremely important issues. \n\nMichigan’s ag industry contributes over $100 billion annually to our state’s economy, and accounts for about 22% of the state’s total employment.","date":"Mon Mar 05 16:23:37 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This week I met with agriculture leaders in Manistee County to discuss the many challenges they face. As we talk with farmers throughout the 1st District, trade, H2A visas, taxes, and a reliable workforce are always among the top topics of concern. https://t.co/yvNXnje1EG","date":"Mon Mar 05 16:23:24 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you Commander Coulter and the team at @USCG U.S. Air Station Traverse City for the briefing and tour today. It’s always great to be back in Traverse City! https://t.co/kDnyWF5z4v","date":"Fri Mar 02 18:36:43 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: More great local news out of Traverse City thanks to the #TaxCutsandJobsAct. Tax reform works for the people of the First Congressional District. https://t.co/8NrVumGYM5","date":"Tue Feb 27 15:14:38 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Tune in live at 2:30 for the @NatResources Committee hearing on my legislation - H.R. 4429 the Cormorant Control Act. \n\nhttps://t.co/31gef379zI","date":"Thu Feb 15 19:22:48 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: My statement regarding fully funding the #GLRI to @MickMulvaneyOMB during yesterday’s @housebudgetGOP hearing. https://t.co/tWGaNIGHsi","date":"Thu Feb 15 15:04:38 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This week I had the honor of speaking at the @NCAI1944 #ECWS2018. The 1st District is home to 8 of Michigan’s 12 federally-recognized Indian tribes, and I’m proud to represent each of them in Washington, D.C. https://t.co/5NLqYO16pN","date":"Thu Feb 15 14:50:54 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As a father and grandfather, the tragic news out of Florida is incomprehensible. \n\nOur hearts are with Marjory Stoneman Douglas High School, and all students, victims, families, and first responders in South Florida.","date":"Thu Feb 15 02:01:33 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you for the kind note Thunder Bay Community Health Service. \n\nOur Community Health Centers are vital for the health and well being of #Mi01 residents and I’m proud to have fought for continued funding for #FQHC https://t.co/z3l63HBB3s","date":"Tue Feb 13 22:18:33 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"A witness from the @MichiganDNR will be providing testimony on the importance and need for a comprehensive management plan for the double-crested Cormorant.","date":"Tue Feb 13 19:12:38 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Read my full statement here: https://t.co/5FH568j4v7","date":"Tue Feb 13 19:12:38 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The @NatResources Committee will hold a hearing on my bipartisan legislation H.R. 4429 - The Cormorant Control Act Thursday, February 15th, at 2:30 PM.","date":"Tue Feb 13 19:12:37 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Best of luck to the Upper Peninsula’s own @nickbaumgartner in the #pyeongchang2018 Olympics. \n\n#YooperPride #TeamUSA 🇺🇸 https://t.co/nquKsQHhpr","date":"Tue Feb 13 17:18:00 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Read my full statement here: https://t.co/8fGC0JhbsY","date":"Mon Feb 12 23:47:18 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Congress has the final say on funding for the Great Lakes Restoration Initiative, Essential Air Service, and other important government services, and I will continue to fight to protect these important issues that directly affect the constituents of the First District.","date":"Mon Feb 12 23:47:18 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I look forward to reviewing the Administration's budget suggestions and working with my colleagues on the Budget Committee to pass a balanced budget for 2019.","date":"Mon Feb 12 23:47:18 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Many thanks to the Alpena Rotary Club and Kiwanis Club for the invite to speak with you at lunch and answer questions about the work we are doing in the 115th Congress to craft bipartisan solutions for the problems facing our nation. https://t.co/2TAhhHFFD4","date":"Mon Feb 12 21:20:53 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"More Good News: Dickinson County based company US Special Delivery announced that all 200 employees will be receiving $1000 bonuses, thanks to Congress passing tax reform.\n\nThis is great news for Michigan’s First District and our local economy. \n#TaxCutsandJobsAct #Mi01 https://t.co/jAimnoRiUW","date":"Thu Feb 01 21:27:06 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Did we mention it’s time to build a new Soo Lock? \n\n#BuildTheLock #Infrastructure https://t.co/clsH8RnPws","date":"Thu Feb 01 16:07:30 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Huge news! https://t.co/nUlaIKRBmJ","date":"Thu Feb 01 15:58:47 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Cindy and I were not on the train this morning. \n\nOur thoughts are with all involved. We are thankful for the first responders who are helping those in this incident.","date":"Wed Jan 31 17:20:18 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"In September I wrote an op-ed in the @WashTimes highlighting the urgent need for a new Poe-sized Lock in Sault Ste. Marie —&gt; \n\nhttps://t.co/WDaeCAtujT","date":"Tue Jan 30 20:46:14 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Rural broadband expansion and building a new Soo Lock are two of our District’s most critical infrastructure needs. #SOTU","date":"Tue Jan 30 20:46:13 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As we near tonight’s State of the Union address, I’m optimistic @realDonaldTrump will discuss the need and importance of a 21st century infrastructure plan.","date":"Tue Jan 30 20:46:13 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On live with Ron Jolly @WTCMRadio to discuss many issues in #Mi01. \n\nThe American people deserve truth and transparency. It’s time to #ReleaseTheMemo https://t.co/g0ksFjhohX","date":"Mon Jan 29 12:44:30 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On “The Bear - 98.1” with Omelette and Coates now in Traverse City https://t.co/jLvkTMYRDI","date":"Mon Jan 29 11:39:19 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Heard today: My co-worker thanked my boss this weekend for the pay-raise. He informed her that her pay rate didn’t change, but her taxes were lowered thanks to the #TaxCutsandJobsAct","date":"Mon Jan 29 00:07:31 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I’ve been traveling all over the First District this week. Constituents here don’t think the money they are saving is crumbs... or Armageddon.\n#TaxReform https://t.co/Dvfma839pL","date":"Fri Jan 26 16:53:15 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Spoke to the Blesch Intermediate School in #Mi01 today. \n\nHey @realDonaldTrump, Dominic (4th Grade) told me to “Say hi to President Trump and tell him I love him.” \n\nPromised him I’d pass it on. https://t.co/rEKGItszQj","date":"Thu Jan 25 02:55:08 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/qQDCp3WWhJ","date":"Tue Jan 23 01:19:14 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"After three days of an unnecessary government shutdown, I’m pleased to see the games have stopped. \n\nIt’s time to move forward and work together to find solutions to our country’s problems. That’s why the American people sent us to Washington, D.C.","date":"Tue Jan 23 01:19:13 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As I said before - there was nothing in this bill that Senate Democrats philosophically disagree with and today’s vote to fund the federal government demonstrated just that.","date":"Tue Jan 23 01:19:12 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"There is absolutely nothing in this short-term spending bill that democrats philosophically disagree with. \n\nSenate Democrats are just playing games. #SchumerShutdown","date":"Mon Jan 22 16:39:50 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"For my full statement —&gt; https://t.co/pMWUScE37V","date":"Sun Jan 21 21:59:57 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The failure to fund our government is unacceptable and puts thousands of low income children at risk in Michigan's First District.","date":"Sun Jan 21 21:59:49 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"While negotiations continue as we seek a solution to the Democrats government shutdown, I will be donating all of my pay to a Veteran's organization in Michigan's First District.","date":"Sun Jan 21 21:59:43 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The #SchumerShutdown is disappointing. I join my colleagues @RepMoolenaar @RepPaulMitchell @RepMikeBishop @RepHuizenga and @RepWalberg in calling on the Senate Democrats to stop playing games and fund the government. https://t.co/Zj5RfqCOud","date":"Sat Jan 20 13:53:17 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I join my colleagues in Michigan’s Congressional delegation calling on our Senators to do the right thing and stop the #SchumerShutdown. Enough is enough. https://t.co/pRiq5dLTRy","date":"Sat Jan 20 05:32:22 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Make no mistake - Senate Democrats are the only thing standing in the way of extending CHIP for six years and keeping the government open. \n\nThere are no excuses. It’s time to do what’s right for the American people.","date":"Sat Jan 20 00:04:27 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"“It's imperative that the American people have full access and transparency regarding the facts contained in this memo.”\n\nCongressman Jack Bergman \nLieutenant General, USMC (ret.)\n\n#ReleaseTheMemo","date":"Fri Jan 19 21:05:24 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"“Today, after reviewing a classified memo from the House Intelligence Committee, I join several of my colleagues in calling for its immediate release to the public. /1","date":"Fri Jan 19 21:04:47 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We need 60 votes in the Senate to pass the bill. \n\nSenate Democrats need to stop playing games and do what’s right for their constituents and join House Republicans in passing CHIP extension, funding our military and Veterans, and keeping the government open. https://t.co/iYEheexOTK","date":"Fri Jan 19 17:44:31 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Well said Mr. Speaker. https://t.co/UtijxnA3jm","date":"Fri Jan 19 17:05:33 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"“No one in a responsible position can believe, or even think, that shutting down the government is a wise option.”\n\nhttps://t.co/wD22dvSMgp","date":"Fri Jan 19 02:15:32 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This isn’t a game. I encourage my friends on both sides of the aisle to take the health of our kids, our national security, and our troops, more seriously in the days and years ahead.","date":"Fri Jan 19 01:27:06 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Tonight’s vote also keeps the government funded, pays our troops, and helps ensure our national security.","date":"Fri Jan 19 01:27:05 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Tonight I voted to pass the longest extension of the Children’s Health Insurance Program (CHIP) in history. This bill ensures over 100,000 Michigan children, many in the 1st District, receive adequate heath insurance for the next 6 years.","date":"Fri Jan 19 01:26:07 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was great to see “Chesty” today at my office in Washington, D.C. The @USMC and all of our nations armed forces are always hard at work ensuring the safety and liberty of our country and our allies. https://t.co/tkkBn8T6Sv","date":"Tue Jan 16 22:32:54 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"From Gogebic County to Alcona County and everywhere in-between - Michigan's 1st District Backs the Blue. \n\nTo all of the brave men and women who keep our communities safe - Thank you! https://t.co/zAN5MtqUYk","date":"Tue Jan 09 18:18:11 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Pleased to join @RepStephMurphy  and tour the Orlando VA Medical Center today. https://t.co/BXS3aWhOkb","date":"Sat Jan 06 19:29:44 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Wind chills are dangerously low across #Mi01. Please exercise caution. https://t.co/bqJmcCE4yE","date":"Fri Jan 05 13:36:39 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Joining the @mibigshow  with @MPShiels at 7:30 tomorrow morning to talk 2018 and our legislative priorities. Be sure to tune in!","date":"Thu Jan 04 00:50:34 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was -8 yesterday but the trails in the Western U.P. are in great shape. I’m thankful for time spent at home with family over the holidays and I’m energized to get back to work for the great people of #Mi01 https://t.co/ZIs9oiarXQ","date":"Tue Jan 02 16:01:37 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Wind chills were 26 below zero here in Watersmeet but that couldn’t stop us from continuing our tradition of a New Years Eve bonfire on the lake with family.\n\nFrom “Papa Jack” and the entire Bergman family - Happy New Years! https://t.co/klW4h8VdZV","date":"Mon Jan 01 03:11:42 +0000 2018","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The good news keeps coming in! UPPCO announced they were lowering rates for U.P. residents, now 13 other Michigan utilities are looking to see how savings from the Tax Cuts and Jobs Acts will be passed to consumers through lower electric and gas bills.\n\nhttps://t.co/vKrRDzTAXc","date":"Thu Dec 28 14:41:30 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This audit by DOD is a critical step in changing the federal government’s culture of spending and ensuring the Pentagon’s resources are allocated to warfighters in the most efficient and effective way possible.","date":"Wed Dec 27 19:24:03 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As a fiscal conservative, I’ve said many times that the United States government must be held accountable for every penny of taxpayer money received and spent – especially when committing resources to the defense of our nation.","date":"Wed Dec 27 19:24:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our men and women in uniform work each and every day to safeguard the freedoms we hold dear. It’s our responsibility to ensure they’ve got the training, resources, and support necessary to carry out their mission.","date":"Wed Dec 27 19:24:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This top to bottom audit is the largest ever conducted and continues the process of applying accountability at all levels of government.","date":"Wed Dec 27 19:24:01 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Having served alongside General Mattis, I know he is the right man, at the right time, to lead the Department of Defense. Marines are trained to lead by example—and under General Mattis’ leadership, DOD can lead the way in responsible federal spending.","date":"Wed Dec 27 19:21:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: Bergman Applauds Long Overdue Defense Department Audit. \n\nRead my full statement here —&gt;\nhttps://t.co/8wuImShaSz","date":"Wed Dec 27 19:20:39 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: @detroitnews editorial - “Merry Christmas to Taxpayers.” \n\nhttps://t.co/6hRxgn9y5K","date":"Fri Dec 22 14:18:50 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great news for #Mi01 https://t.co/IN5IV4Tilu","date":"Wed Dec 20 19:42:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The time for #TaxReform is now! https://t.co/utgBsrv4OA","date":"Tue Dec 19 16:50:12 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The men and women of #Mi01 sent me to Washington, D.C., to represent them and today I will deliver on my promise to cut taxes across the board and provide a fairer and simpler tax code for all Americans.\n#TaxReformTuesday \n\nhttps://t.co/XQxnAOq5jb","date":"Tue Dec 19 15:31:12 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Excited to join the @stevegrubershow tomorrow morning at 6:45 to talk #TaxReform. \n\nWe’re ready to put this bill on @POTUS desk and provide pro-growth tax reform for all Americans. \n\nBe sure to tune in!","date":"Tue Dec 19 01:14:21 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Joining Tim Ellis now on Eagle 92.1 in The Soo to discuss the work we are doing for our Veterans on @HouseVetAffairs","date":"Mon Dec 18 13:32:35 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The time for pro-growth tax-reform is now. As negotiations move forward on finalizing the Tax Cuts and Jobs Act, Congress must work together to provide tax relief that ensures wages grow, jobs are created, and business opportunities expand in our country. https://t.co/kIKpm8jhtk","date":"Wed Dec 13 20:10:58 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Passed: Today @POTUS signed into law the #FY18NDAA. \n\n✔️ Largest pay raise for troops in 8 years.\n✔️ Rebuilding our naval fleet.\n✔️ Ensuring three Littoral Combat Ships will be added to our naval fleet.\n✔️ Securing jobs for over 1500 #Mi01 residents. https://t.co/HElQ37N9VV","date":"Tue Dec 12 19:03:31 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Joined @ANHQDC this afternoon to talk about defeating ISIS and @POTUS decision to move the Embassy in Israel to Jerusalem. https://t.co/tocoROzThJ","date":"Sat Dec 09 21:56:15 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you for your hard work helping families in #Mi01. https://t.co/qiTURIhMd7","date":"Thu Dec 07 19:59:01 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Seventy-six years ago today 2,403 men and women lost their lives in the attack on Pearl Harbor. \n\nToday we remember them, and all who paid the ultimate sacrifice, in the years of war following this infamous day. https://t.co/XbHsbuD3O4","date":"Thu Dec 07 18:05:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Passed: H.R. 38 - The Concealed Carry Reciprocity Act of 2017.  \n\nHere’s my full statement: https://t.co/Wv0bY2mOUK","date":"Wed Dec 06 23:22:56 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"71% of Americans in the 18-22 year old range do not qualify to serve in the U.S. Armed Forces. \n\nYesterday I joined @AEI to discuss the benefits early childhood development has on future generations. https://t.co/JWcwR4YNUk","date":"Wed Dec 06 20:11:39 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We are one step closer to delivering tax reform for the hard-working people of #Mi01.\n\nFor my full statement visit: https://t.co/Dr7ityxjkn","date":"Tue Dec 05 01:02:41 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This is a huge victory for manufacturers, retailers, small businesses and hard-working families in Mi01. https://t.co/SsNNrBdrRf","date":"Sat Dec 02 17:58:39 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Keep it up Wildcats! https://t.co/jwyyFJq8l4","date":"Sat Dec 02 17:13:31 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Pleased to see the Senate pass #TaxReform last night. \n\nIt’s time to put money back in the pockets of the hard-working men and women of #Mi01. https://t.co/F1iZsAik5W","date":"Sat Dec 02 16:31:07 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Fact Check: True ✔️ https://t.co/kHBYThcvIb","date":"Fri Dec 01 21:24:21 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was great to see high school students from Alpena in Washington, D.C., this week. I always enjoy engaging with the next generation about the issues that matter most to them. Local jobs, the economy, and education always seem to be at the top of the list. https://t.co/X71KoSZ9LY","date":"Fri Dec 01 20:07:53 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As a Marine, @ToysForTots_USA is one of my favorite charity organizations. To learn more about the history of Toys for Tots or how you can be a part of this great organization visit https://t.co/9JQ9pz0b7T","date":"Tue Nov 28 17:42:00 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The holidays offer many opportunities to support your favorite charity and help those who are in need. On this #GivingTuesday, I encourage each of you to reach out to your favorite local charity to see how you can best help those in need in your community. https://t.co/2ZK1N28Q66","date":"Tue Nov 28 17:39:47 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today we reflect on the many blessings we have as Americans.\n\nFrom my family to yours, I hope you had a very Happy Thanksgiving.","date":"Fri Nov 24 03:47:55 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"What were you doing in 1986?\n\nIt’s been over 30 years since we have reformed our tax code.\n\nIt’s time to unleash our country’s economic potential by providing tax relief for hard-working Americans. \n\n#TaxReformTuesday https://t.co/tKfVneCMyu","date":"Tue Nov 21 19:30:53 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Last week I introduced H.R. 4429, the Cormorant Control Act, to address cormorant depredation in #Mi01 \n\nhttps://t.co/UOwmZJDlu8","date":"Tue Nov 21 10:27:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"For my full statement: https://t.co/1i1mfnz4vO https://t.co/g03Ittwhch","date":"Thu Nov 16 19:38:10 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Breaking: The House just voted to pass major tax reform for the first time in over 30 years. \n\nIn a major victory for the hard-working people of #Mi01, the Tax Cuts and Jobs Act passed the U.S. House!","date":"Thu Nov 16 19:04:33 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I spoke with @onetoughnerd today about the recent information on the damaged coating on pipeline 5. \n\nHere’s a link to my full statement —&gt; \n\nhttps://t.co/8wuImRZA11","date":"Tue Nov 14 18:57:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Gaylord Middle School put on one of the most impressive Veteran’s Day ceremonies I’ve ever attended and I wanted to share one of the very touching parts of the ceremony with you. \n\nGabe (8th grade) was joined by the entire school singing a Veteran’s Day version of “Hallelujah.” https://t.co/qaI4EgBh5v","date":"Sun Nov 12 23:38:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy Veteran's Day to all who have served.\n\nIt was great to see my friends from the Keweenaw Bay Tribe present the Colors at today's @NorthernMichU football game. https://t.co/9blqXKmuZT","date":"Sat Nov 11 22:36:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On the air now with Jerry Coyne in Grayling on Q100. Talking VA, and Veterans Day!","date":"Thu Nov 09 19:22:01 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"How about a @USMC #TBT? \n\nWhen I retired from the Marine Corps I handed the flag to one of the most qualified men in the country, my friend General John Kelly.\n\nOoh-rah and happy birthday @USMC https://t.co/YRsJO9sWvO","date":"Thu Nov 09 19:02:23 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We have to understand, responsible gun ownership, which we do, is the right thing! https://t.co/qfTHeX2nJ0","date":"Thu Nov 09 01:49:19 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Complete transparency is essential for the modernization of the VA’s electronic health records. https://t.co/jOndCb3Q10","date":"Mon Nov 06 12:25:05 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today I voted in favor of H.R. 3922 to provide funding for CHIP and Community Health Clinics. \n\nhttps://t.co/10Dg5HVdXI","date":"Fri Nov 03 18:02:10 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proper management is essential to maintain the health of our forests. Proud to support the Resilient Federal Forests Act. https://t.co/5eQ9k5C8kw","date":"Fri Nov 03 10:55:53 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s time for tax relief for working Americans. https://t.co/SuA0Ixt5qc","date":"Thu Nov 02 20:48:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Reminder: Tomorrow at noon is the deadline to submit your app for the @CongressionalAC.","date":"Tue Oct 31 19:38:00 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I voted to pass the FY2018 budget and unlock the door to tax reform.  \n\nTo learn more visit —&gt;\nhttps://t.co/I1sp9RB6oV","date":"Thu Oct 26 18:09:46 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On with @ProudExDemocrat now - talking tax reform, budget, and our upcoming community engagement event in Traverse City.","date":"Thu Oct 26 11:37:10 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Honored to join @SpeakerRyan to sign the Whistleblower Protection Act. \n\nThis is an vital step in ensuring quality care for all Veterans. https://t.co/trGCaEV7Mn","date":"Wed Oct 25 13:07:49 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was great to be a part of the @USMC Marathon today. \n\nEven better was getting to meet a young Marine from Traverse City. \n\nOoh Rah Marine https://t.co/hGFYeP9lfl","date":"Mon Oct 23 01:16:55 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Coming up on @CNN  to talk about putting politics aside and putting country and our military families first. https://t.co/qctbIjNWYl","date":"Sun Oct 22 20:49:49 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Well said @TuckerCarlson! https://t.co/FebYj9JT3b","date":"Sat Oct 21 19:34:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Gen. Kelly said it best. \n\nExploiting gold star families for political points is never ok. \n\nThere is no excuse for this poor behavior! https://t.co/MKo21XckJJ","date":"Sat Oct 21 04:02:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"If there is any one issue that should bring our nation together, it’s our gold star families.","date":"Sat Oct 21 02:40:20 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great to be with Walt Lindala this morning. https://t.co/vpD82yfWpD","date":"Thu Oct 19 11:46:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for leading the pledge at tonight’s event @J23Marcus https://t.co/hEi8wIWoHk","date":"Thu Oct 19 02:17:47 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for the great event tonight Marquette. https://t.co/ygawFzNqBf","date":"Thu Oct 19 00:27:42 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to tonight’s dialogue. https://t.co/Eb0xf0Nh29","date":"Wed Oct 18 11:08:52 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great to be back in Presque Isle County today to visit the @LampreyControl Biological Station. https://t.co/3fWgx5whys","date":"Tue Oct 17 21:22:06 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Now is the time for tax reform! https://t.co/HfM0G1nY3I","date":"Tue Oct 17 18:42:50 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy Birthday @USNavy!\n\nSeapower to Protect and Promote. https://t.co/3PfYklTN23","date":"Fri Oct 13 13:17:41 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Date: Friday, Oct 20th\nTime: 6:00pm central\nLocation: Gogebic Community College –Lindquist Center\n4946 Jackson Rd. Ironwood MI. 49935","date":"Tue Oct 10 23:41:28 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Date: Wednesday, October 18th, 2017\nTime: 6:00pm to 8:00pm\nLocation: Marquette Township Town Hall\n1000 Commerce Dr. Marquette MI. 49855","date":"Tue Oct 10 23:40:35 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Date: Monday, Oct 16th\nTime: 6:00pm\nLocation: Alpena Community College – Granum Theatre, \n665 Johnson St. Alpena, MI. 49707","date":"Tue Oct 10 23:40:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I announced my next round of fall community engagement events today. Times, dates, and locations are listed here ---&gt;","date":"Tue Oct 10 23:40:01 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Is there a better way to spend #ManufacturingDay than speaking to #Mi01 next great generation?  \n\nGreat to be at Hancock Middle/High today. https://t.co/kPtbefFJyL","date":"Fri Oct 06 23:27:11 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Passed - Building a Better America Budget for Fy2018. \n\nFor my full statement visit ----&gt;\n\nhttps://t.co/zIbDPaj67Z","date":"Thu Oct 05 17:02:09 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Medical evidence has overwhelmingly proven that an unborn child can feel pain by at least this point in the womb.3/","date":"Tue Oct 03 22:47:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I was proud to co-sponsor this bill which prohibits abortions on unborn babies 20 weeks or older. 2/","date":"Tue Oct 03 22:47:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Breaking: The House just passed H.R. 36, the Pain Capable Unborn Child Protection Act. 1/ https://t.co/ncc3oNi2HF","date":"Tue Oct 03 22:46:38 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Congress will have the opportunity to unlock pro-growth tax reform by passing the FY18 budget. https://t.co/cevHcku2vf","date":"Tue Oct 03 16:21:34 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you Pastor Jenkins and congregation for your warm welcome and kind words. It was great to be back in Gaylord today. https://t.co/T9I85f4dag","date":"Sun Oct 01 19:02:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I'm a Federalist. We must return power to the states. That is where government works best.","date":"Sat Sep 30 15:45:46 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The Soo Locks is not only a economic issue, it is a national security issue. We must build the Lock.","date":"Sat Sep 30 15:32:08 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This Congress has already rolled back $3.7 billion of unnecessary regulations. I'm proud of that.","date":"Sat Sep 30 15:28:58 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"One of the biggest tasks the federal government has ahead of it is to quit wasting taxpayer money. This has to stop!","date":"Sat Sep 30 15:09:06 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We need tax reform. It needs to be simple, fair and small business friendly.","date":"Sat Sep 30 14:35:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"One of the next best steps to address our healthcare issues and costs, we must focus on primary and preventative care.","date":"Sat Sep 30 14:34:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Starting off this beautiful morning in Petoskey at our first fall community engagement event. https://t.co/CTW9C0MYWt","date":"Sat Sep 30 14:12:39 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Welcome back to the People's House @SteveScalise. https://t.co/X6cCzeQfvg","date":"Thu Sep 28 15:07:50 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Working families in #Mi01 deserve to keep more of their paycheck. It's time to pass a tax plan that allows you to do just that. #TaxReform","date":"Wed Sep 27 19:44:59 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It's time for a tax code that works for the people of Michigan's First District. https://t.co/1HtXl6JXqs","date":"Wed Sep 27 19:38:11 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This announcement by @SecretaryZinke is great news for all who utilize Michigan's beautiful natural resources. \nhttps://t.co/NNX5vGgG3U","date":"Tue Sep 26 18:46:32 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@RobertDRoseJr1 Where at in the District do you live Robert? We would be happy to set up a meeting with you.","date":"Tue Sep 26 02:15:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for having me @MichiganBiomass. Really enjoyed the visit. https://t.co/YMr54IORZc","date":"Mon Sep 25 21:23:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I will be hosting the first of several fall community engagement events in Petoskey. \n\nFor more information ---&gt;\n\nhttps://t.co/nQgCpQTit5","date":"Mon Sep 25 16:28:47 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great seeing the crew from Otsego EMS/Rescue today. Thankful for the work that our Emergency Services do every day. https://t.co/dPRgrN5QQL","date":"Wed Sep 20 01:24:56 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It's time to build the Lock https://t.co/CCbGMi9uvg","date":"Tue Sep 19 21:56:28 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@WashTimes I've authored legislation - H.R. 2806 The Soo Locks Modernization Act - to authorize construction of a new Poe sized Lock.","date":"Thu Sep 14 14:30:25 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The @WashTimes published my op-ed today on the critical need to build a new Soo Lock. https://t.co/rgqTQesWxe","date":"Thu Sep 14 14:27:29 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happening now: https://t.co/fMnbWm6Tq5","date":"Tue Sep 12 14:56:33 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This somber day serves as a reminder - service before self. On this #PatriotsDay, may we never forget the sacrifices made, for all of us.","date":"Mon Sep 11 14:17:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Among the 3000 lives lost on 9/11 343 firefighters and 60 police officers paid the ultimate sacrifice, while helping their fellow man","date":"Mon Sep 11 14:13:07 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: https://t.co/nCiFH6UKX4","date":"Sat Sep 09 02:23:46 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"...with the @POTUS in crafting solutions to address gaps in our immigration policy.","date":"Wed Sep 06 17:01:47 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"sacrificing our national security or the rule of law. The House and Senate must work together...(4)","date":"Wed Sep 06 17:01:15 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"...and the Trump Admin is correct in asking Congress to address this issue. The United States can remain a welcoming nation without..(3)","date":"Wed Sep 06 16:59:55 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The Obama Administration exceeded its constitutional authority by unilaterally imposing DACA...(2)","date":"Wed Sep 06 16:59:00 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The Constitution is clear; Congress has the authority to create legislation, not the executive branch.(1)","date":"Wed Sep 06 16:57:47 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"On this Labor Day, I offer my most sincere \"Thank You\" to the workers who make the First District the greatest place to call home.","date":"Mon Sep 04 19:39:09 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"...firefighters and EMS, law enforcement officers and so many more. (5)","date":"Mon Sep 04 19:38:53 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"- teachers, retail and hospitality workers, baristas, h/c providers, miners, iron workers, manufacturers, loggers, construction workers(4)","date":"Mon Sep 04 19:38:03 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I've travelled thousands of miles over the past few months holding hundreds of meetings with the dedicated workers of the District...(3)","date":"Mon Sep 04 19:36:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Nowhere in the country will you find a more industrious and determined workforce than Michigan's First District. (2)","date":"Mon Sep 04 19:35:57 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today we honor the hard working men and women of northern Michigan and the Upper Peninsula. (1)","date":"Mon Sep 04 19:35:21 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happening now in Traverse City: \nVA Oversight and Investigation Field Hearing regarding VA Home Tele-health with @RepAnnieKuster https://t.co/dDWmOuG3LP","date":"Wed Aug 30 13:18:52 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Continued prayers for the outstanding crews from Air Station Traverse City being deployed to Houston to help with the rescue efforts. https://t.co/2SAInC2eUY","date":"Tue Aug 29 03:08:33 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Join me in keeping the people of Texas and all of the First Responders and Emergency workers in your thoughts and prayers.","date":"Sun Aug 27 23:14:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Col. Demas Craw was born and raised in Grand Traverse County. Served in WWI, payed the ultimate price in WWII, saving countless lives. https://t.co/EnhBd2YIXE","date":"Sun Aug 27 23:10:12 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for the great conversation and questions @TCChamber. Great to see you all today. https://t.co/lPtqPdNvEb","date":"Fri Aug 25 19:10:31 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Tune in to WTCM. On live with @ProudExDemocrat! https://t.co/kOPq37DP5K","date":"Fri Aug 25 12:42:11 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Stopped in to visit the great men and women @USCG Sector Sault today. Thanks for protecting and serving our great state. https://t.co/DFJKZpVUnt","date":"Thu Aug 24 23:29:54 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was great being there to support such a great project! We must protect our Great Lakes. #GLRI https://t.co/tiaZgapCXC","date":"Thu Aug 24 22:56:27 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Had a great time at Oswald's Bear Ranch yesterday evening in the Upper Peninsula. https://t.co/ncNPt0OLlH","date":"Thu Aug 24 13:10:03 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"If more elected officials would focus on legislating, rather than commentating, we could produce better results for the people of the U.S.","date":"Fri Aug 18 03:21:37 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Coming up with Craig Wurpel on WDBC in Escanaba. Tune-in!","date":"Thu Aug 17 12:14:49 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Talking current events on @MPShiels in 5 minutes. Tune in","date":"Thu Aug 17 11:03:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Had a very productive roundtable work session at the Iron Mountain VA Health Clinic today. https://t.co/a8Rh00mqBQ","date":"Wed Aug 16 20:42:42 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"These bigoted acts should be condemned and denounced by all Americans! https://t.co/LWxAreFInj","date":"Sun Aug 13 16:19:31 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"For my full statement regarding North Korea, visit: https://t.co/jfDp2EJU1p","date":"Fri Aug 11 16:01:40 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Sec. Mattis has shown, in no uncertain terms, that the U.S. will no longer lead from behind in areas of National security and defense.","date":"Fri Aug 11 15:59:53 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It is unacceptable to allow a nuclear ICBM capable of reaching our western shores into the hands of Dictator Kim Jong Un.","date":"Fri Aug 11 15:57:33 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It is imperative that the United States along with the international community, remain steadfast in the pursuit of a nuclear-free DPRK","date":"Fri Aug 11 15:55:25 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"You may not see it on the news but the 115th Congress has accomplished historic amounts in 2017. To learn more visit https://t.co/fJY07MG4YB https://t.co/9ovPOUMIyt","date":"Thu Aug 10 17:05:12 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We have to act immediately and decisively to ensure we win the fight against Asian carp. https://t.co/vrORYGI7pH","date":"Tue Aug 08 14:53:45 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We do not take for granted the great sacrifices made by this Nation's warriors, and are forever indebted to them for their service. https://t.co/YHjez5ZJCl","date":"Mon Aug 07 20:12:56 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you @POTUS for recognizing Michigander James McCloughan for his heroism today with the #MedalofHonor https://t.co/ilMDw0NpW0","date":"Mon Jul 31 20:57:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"What an amazing example of servant leadership. Imagine an America without faith...https://t.co/pk1upByC5u","date":"Fri Jul 28 14:49:03 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Room At The Inn in Marquette has served over 100,000 meals to the homeless...https://t.co/pk1upByC5u","date":"Fri Jul 28 14:48:30 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(3/3) Secretary Mattis will do his job. Congress can now focus on theirs.","date":"Wed Jul 26 18:57:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(2/3) reinforces my confidence in this @realDonaldTrump administration’s focus on, and commitment to, military readiness.","date":"Wed Jul 26 18:55:54 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(1/3) @realDonaldTrump decision to not fund elective transgender surgery...","date":"Wed Jul 26 18:55:19 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thoughts and prayers for a complete recovery for a true American hero @SenJohnMcCain","date":"Thu Jul 20 02:27:32 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(3/3) It also will give the Fish and Wildlife Service an extra $10.4 million to fight invasive Asian carp #GLRI #MI01","date":"Wed Jul 19 19:51:12 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(2/3) A bill passed out of committee that we fought for--it will fully fund the Great Lakes Restoration Initiative #GLRI #MI01","date":"Wed Jul 19 19:50:30 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(1/3) Amazing news was announced last night for our state's natural resources and the Great Lakes! #GLRI #MI01","date":"Wed Jul 19 19:49:08 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Glad to get started on our path to fiscal responsibility in the @housebudgetGOP hearing this morning #Budget2018 https://t.co/gFgJt3vmJp","date":"Wed Jul 19 14:31:46 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@mihomeless Please reach out to my office about this event--thanks!","date":"Tue Jul 18 21:29:46 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"There’s too much wasteful #spending in Washington. Our #budget calls for serious reforms to get our country back on the right fiscal path. https://t.co/BnDikegOhk","date":"Tue Jul 18 14:48:01 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Prepping for our @housebudgetGOP announcement #balancethebudget https://t.co/SpaBH7XIJx","date":"Tue Jul 18 14:27:35 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It’s time for deficit-neutral #taxreform, and our #budget makes that possible. #Budget press conference starts in 30 https://t.co/p24ednQBJU https://t.co/i5yarVWaQ4","date":"Tue Jul 18 14:03:03 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@TheRealKerberos @DrJScofield Here's a little more background on the #FY18NDAA and my votes. Lots of misinformation out there...\nhttps://t.co/kDfyoXavUa","date":"Mon Jul 17 23:49:11 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@dogtheCO1 @justinamash Here's a little more background on the #FY18NDAA and my votes. Lots of misinformation out there...\nhttps://t.co/kDfyoXavUa","date":"Mon Jul 17 23:48:18 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Here's a little more background on the #FY18NDAA and my votes. Lots of misinformation out there...\nhttps://t.co/kDfyoXavUa","date":"Mon Jul 17 18:34:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(3/3) After 40 yrs in #USMC I know firsthand the importance of investing in national security &amp; supporting men &amp; women in uniform #FY18NDAA","date":"Fri Jul 14 16:10:57 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(2/3) #FY18NDAA allows us to supply and train our troops, and to properly care for our troops and their families.","date":"Fri Jul 14 16:10:19 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(1/3) Today I was proud to vote in favor of #FY18NDAA. It fulfills Congress's Constitutional duty to provide for our common defense. https://t.co/ShrYm7eepi","date":"Fri Jul 14 16:09:50 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(3/3) I will continue my support and protection of the Lakes from all angles--everything from invasive species to research/conservation.","date":"Tue Jul 11 14:42:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(2/3) Whether viewing the shipwrecks in the bay, or on land learning about the ROV's &amp; educational programs, this facility is top notch.","date":"Tue Jul 11 14:36:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(1/3) What a beautiful northern Michigan day to visit the Thunder Bay National Marine Sanctuary. https://t.co/kFTSnv9iyq","date":"Tue Jul 11 14:35:38 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for having me today at the American Legion Post #219 pancake breakfast--great way to spend a Sunday! https://t.co/5nyylrpLMs","date":"Sun Jul 09 23:10:48 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"To say that I'm enjoying the @cherryfestival is an understatement! #CherryFestivalParade #MI01 https://t.co/3jnqQr8R48","date":"Sat Jul 08 20:19:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Loved seeing everyone out celebrating today at the @cherryfestival parade! Was a blast. https://t.co/0WNv9FKfZ3","date":"Sat Jul 08 18:46:26 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Had a great time learning about the importance of combating invasive species in Michigan! Thanks @uppcopower https://t.co/vbF4TXg4w9","date":"Thu Jul 06 21:53:49 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(2/2) True \"reflection\" is a part of this country's \ngreatness. Please be a participant. #ProudAmerican #Happy4thofJuly","date":"Tue Jul 04 16:12:28 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"(1/2) Happy Fourth of July! Take a few minutes while enjoying your holiday and reflect on what it means to be an American and a patriot. https://t.co/OxZw5FZkBH","date":"Tue Jul 04 16:10:30 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#SaveAmericanLives https://t.co/S89p9plAyh","date":"Thu Jun 29 18:38:40 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Spending my morning with @HouseVetAffairs protecting small business benefits for Veterans ... https://t.co/lgFo5N6arf","date":"Thu Jun 29 13:50:47 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"So happy I could be a part of this. Thanks @MIVeteran and thanks to every Veteran in Michigan and across the United States. https://t.co/Lsi7I1lwn5","date":"Wed Jun 28 17:38:27 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to join my colleagues on both sides of the aisle in elevating our political dialogue and each other ... https://t.co/R0IMq0gohX","date":"Wed Jun 28 12:53:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Learn about history, standards, and etiquette of the US flag with @LibraryCongress https://t.co/x7HJ8kohkk","date":"Tue Jun 27 20:30:56 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"border control = national security AND public safety https://t.co/Jh19GnYSHz","date":"Tue Jun 27 18:16:31 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Here's where to get help if you or someone you know is suffering from PTSD. #PTSDAwarenessDay \n\nhttps://t.co/nQPeMt316K","date":"Tue Jun 27 18:02:58 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"HAPPENING SOON-- https://t.co/pibmBqvdir","date":"Mon Jun 26 16:11:37 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Two good men. https://t.co/ucD8Jy0Xgt","date":"Thu Jun 22 18:59:45 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"2/2 Looking forward to his leadership as we address our invasive species issues in #MI1 and protect our Great Lakes!","date":"Thu Jun 22 18:22:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/2 It was a pleasure to welcome @SecretaryZinke back to the Hill during our @NatResources Committee hearing this morning. https://t.co/Tk0dcMhZ15","date":"Thu Jun 22 18:20:56 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"FYI. Good news for #MI1 and our tourism economy ... https://t.co/AXLftfazYw","date":"Thu Jun 22 18:15:00 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Honoring my friend @SteveScalise and helping save lives with the @RedCross at the Capitol Hill blood drive. https://t.co/RXIMrze6L7","date":"Thu Jun 22 17:48:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks to @SpeakerRyan @HouseVetAffairs @VetAffairsDems and @SecShulkin for making the VA work for Vets. Proud to have been a part of it-- https://t.co/pjLYQfYURl","date":"Thu Jun 22 02:12:18 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to join @RepMarcyKaptur @RepHuizenga and @SenStabenow in keeping Asian Carp out of the Great Lakes! https://t.co/p48NjNFVRI","date":"Wed Jun 21 21:08:41 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We've got grit. #MI1 https://t.co/fxfTSauGaQ","date":"Wed Jun 21 18:56:29 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"How do you operate effectively during times of disruption? Short answer: listen, then lead. Thanks for having me, @thomsonreuters #trgov https://t.co/9Zr1bJ93bV","date":"Wed Jun 21 17:46:25 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happening in just a little while-- https://t.co/jh9LVvZAws","date":"Wed Jun 21 17:25:15 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great news! Our prayers are with you, @SteveScalise -- https://t.co/efTqOqpxY0","date":"Wed Jun 21 17:22:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy #SummerSolstice, Michigan! https://t.co/ngKSRUo6KG","date":"Wed Jun 21 13:04:19 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for coming in and sharing your expertise @Elena_Palombo_ @MichBroadcaster https://t.co/2jvm56F4qz","date":"Tue Jun 20 18:51:48 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"GoFundMe Page For Capitol Police Officer Crystal Griner Aims for $20K https://t.co/Pip6eIfZcR via @RollCall","date":"Mon Jun 19 19:07:49 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to have worn the @BeachBumsTC jersey last night! https://t.co/LfwJtZ59vh","date":"Fri Jun 16 13:50:26 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/DseEBY2g4y","date":"Thu Jun 15 20:58:59 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My statement ahead of tonight's Congressional Baseball Game ... https://t.co/DKaD09nYHD","date":"Thu Jun 15 20:36:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"To the folks who made sure we all lived to fight another day ... https://t.co/yRAJIU0atI","date":"Thu Jun 15 20:03:28 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to going live with my friend @RepTomSuozzi in just a few to talk baseball and unity on @CNN 🇺🇸⚾️ https://t.co/mvsBAN5g3K","date":"Thu Jun 15 19:45:27 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Mine too, @DanMcPherson497 ... and thanks for your kind thoughts and words-- https://t.co/N4VAoapTQB","date":"Thu Jun 15 11:04:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Live now on @SpecialReport with my friend and one of today's heroes @RepBradWenstrup https://t.co/gAlmGBZxWP","date":"Wed Jun 14 22:09:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We're learning more about motive, but this is a good time to reflect on division and unity. We're all human. We're more the same than not.","date":"Wed Jun 14 13:40:04 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I was on scene, but I'm blessed to be safe, and I want to thank the security forces who were so quick to respond. They're the heroes here.","date":"Wed Jun 14 13:38:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Dismayed by the instance of violence at practice this a.m. for the Congressional baseball game. Prayers are with @SteveScalise and injured.","date":"Wed Jun 14 13:36:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thank you @lcaships ! https://t.co/bq0ikeKA68","date":"Tue Jun 13 11:49:23 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This is what the House is up to later this week--VA reforms that work for Veterans! Thanks @SecShulkin-- https://t.co/jHySdvogrN","date":"Mon Jun 12 16:37:41 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Woah. #MotivationMonday times 1k-- https://t.co/S4kYXdDTGJ","date":"Mon Jun 12 15:50:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It's Old Glory's time to shine. #FlagWeek https://t.co/5iDJvJsJLu","date":"Mon Jun 12 15:47:37 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@RepDianeBlack #MI1 has some of the Great(est) Lakes and fishing around! We'd be glad to have you anytime! #NationalFishingandBoatingWeek","date":"Fri Jun 09 15:06:42 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"I voted yesterday to rein in Wall St. and invigorate Main St. Corporate bailouts hurt small banks, credit unions, communities, and families. https://t.co/ah6COMRcha","date":"Fri Jun 09 15:00:06 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Don't miss what we're up to today in @HouseVetAffairs. This issue is too important ... https://t.co/az3U7z2VTg","date":"Wed Jun 07 14:44:47 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"D-Day: a reminder of what sacrifice looks like. #BandofBrothers #DDay https://t.co/lDFAHhAGa8","date":"Tue Jun 06 14:38:19 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Spent some of the morning talking #SooLocks funding and other infrastructure projects on the @mibigshow https://t.co/5NTxGTQ2Hw","date":"Tue Jun 06 13:01:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This is what we're all working for on @HouseVetAffairs ... let's see it through, @SecShulkin! https://t.co/qyPc4f4iI0","date":"Wed May 31 16:22:06 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Grateful for @RepMoolenaar's leadership. Investment in Soo Locks modernization = investment in economic and national security nationwide! https://t.co/dq5hYz6Sg9","date":"Tue May 30 17:35:39 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"No. https://t.co/Nle7sebPSA","date":"Tue May 30 16:06:11 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks, @SAAdvocacy! Proud to support AbilityOne's efforts to help folks find a greater sense of purpose! https://t.co/h9k1Rb7J60","date":"Tue May 30 16:04:29 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks, @dailystem! The pleasure was all mine! https://t.co/dVOIHGa7cA","date":"Tue May 30 16:02:25 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@RepAnnieKuster and I are working to protect business advantages for Veteran-owned businesses by weeding out fraudulent practices. https://t.co/Mg5F1ZAygl","date":"Tue May 30 16:01:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for hosting me, @michpca! You're out there helping people every day, and it's awesome to have the opportunity to learn from you! https://t.co/fAuNEP2KQE","date":"Tue May 30 15:55:42 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"A soldier’s story. This #MemorialDay, remember.  https://t.co/uogK7kyxWV","date":"Fri May 26 17:45:40 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It was a pleasure to meet with a public servant who is so dedicated to serving our Veterans--@SecShulkin thank you for putting Vets first! https://t.co/vNduNT4qFd","date":"Thu May 25 12:41:12 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Do them #honor https://t.co/R4h0gDsYd6","date":"Tue May 23 14:03:08 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We stand up against terrorism and stand with our British allies during this time of grief. #Manchester \n\nhttps://t.co/USH4as8WYK","date":"Tue May 23 13:47:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"\"Tune in\" tomorrow at 7:30 p.m. EST for my LIVE telephone town. Dial (231) 373-5594 to join the call! Looking forward to hearing from you! https://t.co/1LobaAVevQ","date":"Mon May 22 14:59:45 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to stand with Vets who've been exposed to toxic substances in the course of military service. You had our back, now we have yours-- https://t.co/tfRvV3nAWP","date":"Mon May 22 14:57:59 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"In honor of Military Appreciation Day and anticipation of #ArmedForcesDay this Saturday ... \n\nhttps://t.co/McnZILYCwA","date":"Fri May 19 17:17:09 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to honor our Michigan law enforcement officers on the House floor during #PoliceWeek2017 https://t.co/fEZ6MzIAzO","date":"Fri May 19 15:31:03 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks to @MIHospitalAssoc for coming in to talk quality, cost-effective, and accessible care for folks across the First District! https://t.co/WCKx3GftF0","date":"Fri May 19 15:27:26 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We need tax reform that's all about simplicity, efficiency, and accountability at the IRS-- https://t.co/KSMSquudsf","date":"Fri May 19 14:28:05 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to support our law enforcement officers! https://t.co/QNviyV0I6D","date":"Fri May 19 14:26:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks to the @dreamfound for the work they do on behalf of Vets like Ronald-- https://t.co/p43QOfp50F","date":"Tue May 16 11:51:07 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Let's honor the men and women who gave their all in service of others. #PoliceWeek https://t.co/uSwh2iXF8q via @freep","date":"Mon May 15 16:43:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My statement about Director Comey's dismissal: https://t.co/4OhYYHgbZt","date":"Wed May 10 22:15:48 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Think the #AHCA doesn't cover preexisting conditions? Think again. Here's how it works ...  \n\nhttps://t.co/bul7wA9Mjn via @WSJ","date":"Tue May 09 15:40:37 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My deepest condolences go out to the @LifeatLSSU community and to President Pleger's family and many friends. May his legacy live on ... https://t.co/HCDkzOABDV","date":"Mon May 08 18:31:08 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My take: the ACA is headed toward inevitable collapse. Today, the House stepped up and did something about it. #RepealAndReplace https://t.co/p2QOOwdId6","date":"Thu May 04 18:52:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Not so, @fliprutledge. The House unanimously passed a provision I cosponsored that eliminates AHCA exemptions for Members of Congress. https://t.co/YmbnS7J5O3","date":"Thu May 04 18:50:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Today, I made good on my campaign promise to #RepealAndReplace","date":"Thu May 04 18:49:10 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My statement on House passage of the American Health Care Act as amended: \n\nhttps://t.co/IghkRwdFTM","date":"Thu May 04 18:47:38 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to have cosponsored Rep. McSally's bill H.R. 2192! Makes sure no one--even Members of Congress--is above the law. Passed unanimously! https://t.co/GSJrOs9PZu","date":"Thu May 04 18:31:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#FosterYouthVoices\n\nhttps://t.co/f5m2SCyMxS","date":"Wed May 03 17:52:07 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"May is National Foster Care Month--time to recognize foster youth, parents, and the pros dedicated to finding forever homes for every child.","date":"Wed May 03 17:51:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We're making sure we never send our men and women into battle without the tools and training they need to come home safe after the mission. https://t.co/s2lzvHei4I","date":"Wed May 03 14:31:25 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"What I'm up to today in Washington-- https://t.co/tM0DI5W219","date":"Wed May 03 14:29:10 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As Members of Congress, we are obligated to live by the standards we set for the American people.\n\nhttps://t.co/ui0VtqxP7T","date":"Tue May 02 16:10:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Watch now! https://t.co/K7DWkvRBZX","date":"Tue May 02 01:11:33 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As a sovereign nation, we need to be able to secure our borders. https://t.co/On8kosbd1W","date":"Mon May 01 23:09:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Honored to be 1 of 650 Vets gathered at the @VVMF to pay tribute to those who served and those we lost during Vietnam. Welcome home ... https://t.co/LtCiXXdkMT","date":"Mon May 01 20:55:46 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This is progress. https://t.co/euidlh7XIk","date":"Fri Apr 28 15:20:18 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks @CreativeFuture! It's past time for Congress to modernize the copyright office-- https://t.co/y3PUp8JlAL","date":"Thu Apr 27 12:25:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Meeting some of my heroes in Alpena. These guys are dedicated. https://t.co/iLqlLQBdth","date":"Sat Apr 22 04:31:38 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"God's country. #MichiganOne https://t.co/4aODJTKVBx","date":"Sat Apr 22 04:30:33 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#SemperFi @RepTenney https://t.co/IjvlTt76tK","date":"Sat Apr 22 04:29:55 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@DaVita in Alpena is providing top-notch care to people in MI1! Pleasure to visit and to learn more about how they're serving the community! https://t.co/TNpC8R8Edq","date":"Fri Apr 21 18:14:04 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@winewingwoman Awesome to see folks of all ages and all political persuasions participating in the political dialogue! Keep it up! https://t.co/XgCVMtqBTx","date":"Fri Apr 21 03:08:54 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Gaylord town hall is just starting! Looking forward to some constructive dialogue. https://t.co/Mt3TrB0zRl","date":"Thu Apr 20 22:39:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@TLeightner it was great to see you in the crowd! Remembered you immediately from our meeting in D.C. Keep up the good work-- https://t.co/c0K4n3MaSs","date":"Thu Apr 20 19:39:55 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"STAFF: Rep. Bergman is on stage stage at his Town Hall in the Upper Peninsula!! https://t.co/IrYRr6dwdv","date":"Wed Apr 19 23:20:32 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Live on @wluctv6 before the Town Hall in Escanaba! https://t.co/DyrduY3oEl","date":"Wed Apr 19 22:03:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We're celebrating our Michigan State Police force today after 100 years of service! Grateful for all of our law enforcement officers-- https://t.co/qIkCIRTmhS","date":"Wed Apr 19 22:01:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great! Looking forward to hearing from you-- https://t.co/mcEpPAvhx1","date":"Wed Apr 19 19:18:58 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to a great day in the U.P. and a great event tonight in Escanaba! Hope you can make it--","date":"Wed Apr 19 11:46:32 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This is grit. #SemperFi https://t.co/cmEMaDC5cD","date":"Tue Apr 18 22:47:18 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It's #taxday, and it's time to think about #taxreform. Folks could do a lot with the time/money they spend navigating the complex tax code!","date":"Tue Apr 18 22:30:55 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Towns and communities across the 1st District are securing Michigan's future! Read to find out how: https://t.co/ttQbz3Ee6k via @dcexaminer","date":"Tue Apr 18 12:51:39 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great news for Grayling and job growth and economic development in #MI1. Looking forward to more of the same! \n\nhttps://t.co/Ii7fpuNtNT","date":"Fri Apr 14 20:53:20 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Click here for the details! \n\nhttps://t.co/mB8CfhM25g","date":"Tue Apr 11 13:35:07 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Excited to announce that I'll be hosting two town halls next week while I'm back in the district! Hope to see you there! https://t.co/14RwnPKw3O","date":"Tue Apr 11 13:34:06 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Bottom line: U.S. acted decisively and appropriately in the face of the Assad regime's cowardice. Bottom line: this nation leads.","date":"Fri Apr 07 18:52:18 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Forces took extraordinary measures to avoid casualties to civilians and casualties to airfield personnel.","date":"Fri Apr 07 18:48:28 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Russia was notified before the strikes, and precautions were taken to protect U.S. forces against any retaliatory attacks.","date":"Fri Apr 07 18:36:31 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The strike was intended to keep the Assad regime from EVER using chemical weapons again.","date":"Fri Apr 07 18:32:04 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Strike last night was proportional, given Assad's heinous acts against innocent civilians early this week.","date":"Fri Apr 07 18:29:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Just received a classified briefing on the situation in Syria from Chairman of the Joint Chiefs of Staff Gen. Joe Dunford.","date":"Fri Apr 07 18:28:30 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/Aw0HnnmrHN","date":"Fri Apr 07 16:29:43 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My statement about the situation in Syria. https://t.co/baOpiVB6F3","date":"Fri Apr 07 14:27:15 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#SemperFi, sir. Thank you for your service to our country. https://t.co/L2eXCnIAmz","date":"Thu Apr 06 20:03:41 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"These guys are putting out 🔥like it's their job. And it IS! Great to meet the #MI1 reps from the Michigan Fire Service! They're heroes! https://t.co/ZlVCs9GSaX","date":"Thu Apr 06 16:54:00 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"A dry land ecologist, an astrophysicist, and a Marine all walk into an office ... these incredible #MI1 women are doing incredible things! https://t.co/68SXdLMDGO","date":"Wed Apr 05 14:43:08 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Touching story. Worth a read. https://t.co/X7RVLtmy5v","date":"Wed Apr 05 13:32:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"As the Senate shifts toward \"nuclear option\" on Gorsuch confirmation, my thoughts: https://t.co/wNsEPqfLON","date":"Wed Apr 05 13:05:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Couldn't agree more. Hope my Michigan colleagues in the Senate do the right thing. https://t.co/vcAZdxFFPJ","date":"Tue Apr 04 22:30:37 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"My office is now accepting submissions for the annual Congressional Art Competition! Learn more here: https://t.co/fABrvoTpYq","date":"Tue Apr 04 19:36:39 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@TLeightner you are an inspiring and purpose-driven young man. Can't thank you enough for your dedication to ending Alzheimer's. #ENDAlz https://t.co/UiNFyoLWzH","date":"Fri Mar 31 21:26:56 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Here's how the magic happens (hint: proudly and beautifully at a @Connor_Sports mill in Amasa, MI):  https://t.co/jzEAMeytAI #FinalFour","date":"Fri Mar 31 17:26:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Final Four floors for men's and women's games are Michigan (and UP) made. Check it out: https://t.co/8uDXrESo1n via @freep #FinalFour","date":"Fri Mar 31 17:12:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy to, @erinnelizzabeth! Reach out to my D.C. office at 202 225 4735! https://t.co/ZDFwktXEbV","date":"Thu Mar 30 14:49:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Learning together so we can work together to find solutions for our Veterans. https://t.co/m7d7wEyDok","date":"Thu Mar 30 14:41:49 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Awesome STEM event for Michigan robotics teams this weekend at @LifeatLSSU. Check it out: https://t.co/v5fOPOhHs4","date":"Thu Mar 30 14:36:15 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"The Great Lakes are the lifeblood of MI. We HAVE to protect them, and I'm working hard to make sure GRLI dollars are in the budget--","date":"Thu Mar 30 11:27:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Fitting in is more about digging in and getting some things done for the First District--","date":"Thu Mar 30 11:21:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"LIVE now on @stevegrubershow talking budget, tax reform, and health care!","date":"Thu Mar 30 11:18:37 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great to meet you to talk jobs in MI-1, @MIsoftdrink ! https://t.co/hUVI8hWPep","date":"Thu Mar 30 11:17:11 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Check this out ... much deserved, long overdue.\n\nNATIONAL VIETNAM WAR VETERANS DAY – March 29 https://t.co/MwEyWpeqzn via @nationaldaycal","date":"Wed Mar 29 17:11:57 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks, @iava ... and thank you for your service. https://t.co/2nCZnzetys","date":"Wed Mar 29 16:10:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"4/4 That's what was happening here. The FCC was moving in on FTC jurisdiction for no reason and at no benefit to the internet user: you.","date":"Wed Mar 29 15:42:34 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"3/4 Think about it this way: it would be redundant and costly to ask your police dept. to fight fires. That's the fire dept.'s job.","date":"Wed Mar 29 15:38:19 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"2/4 Overturning the rule was about keeping the FCC from regulating in an area that already regulated by the Federal Trade Commission (FTC).","date":"Wed Mar 29 15:32:57 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/4 Lots of skewed information about Congress's vote yesterday in re: internet privacy regs.","date":"Wed Mar 29 15:30:34 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great story about bringing our boys home. https://t.co/QA8PiK8kln","date":"Wed Mar 29 15:24:27 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Miss the profile @MLive did about me and my friend and colleague @RepPaulMitchell? Read it here: https://t.co/AgpthE2StW","date":"Wed Mar 29 12:54:46 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Humbled to speak on behalf of my brothers and sisters on the 35th anniversary of the Vietnam Veterans Memorial groundbreaking. #SemperFi https://t.co/bHAaQFPoRt","date":"Tue Mar 28 17:53:59 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Gearing up for the Congressional Art Competition--open to high school students residing in the First District--details coming soon!","date":"Tue Mar 28 17:27:58 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Excited to announce/invite you to my second live telephone town hall! Thursday, March 30, 7:30 p.m. (EST). Join by dialing (231) 373-5594! https://t.co/ArZIx3AucE","date":"Tue Mar 28 17:23:49 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks, @HealthLakes! Proud to be part of an important effort! https://t.co/tRMrt7Ntqx","date":"Tue Mar 28 16:00:48 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Big things happening in Sault Ste. Marie! Main Street program acceptance could spark major downtown rejuvenation: https://t.co/WHl6M9OJZ4","date":"Tue Mar 28 15:52:35 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to meeting you too, @ashrog14! https://t.co/vqzPbnKpMF","date":"Tue Mar 28 15:37:30 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Vets across generations and conflicts. Thanks for coming in and talking #SheWhoBorneTheBattle @iava . https://t.co/VnTelexqoL","date":"Thu Mar 23 20:23:05 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This @DetroitNews editorial says Gorsuch is \"the very image of a thoughtful jurist.\" I agree. Read Here: https://t.co/b3t0QchfLz","date":"Wed Mar 22 15:18:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"2/2 Essential Air Services supports industry, boosts our economy, and promotes strong #MI1 communities. I'm all in for that--","date":"Tue Mar 21 14:39:11 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/2 ICYMI: My statement in opposition to the President's proposed Essential Air Services cuts--\n\nhttps://t.co/Wiy5dn2J5H","date":"Tue Mar 21 14:38:05 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"This isn't about partisan politics. It's about keeping promises, showing leadership, and preventing Obamacare collapse. #RepealANDReplace https://t.co/utDASHTbfh","date":"Tue Mar 21 14:35:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We made it! Happy Monday and Happy #FirstDayofSpring! https://t.co/5TZbLjZIkm","date":"Mon Mar 20 14:14:01 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to support our Vets by supporting this legislation! https://t.co/UKOQtVSX4B","date":"Thu Mar 16 20:28:12 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/2 Spoke on the House floor last night in favor of the VA Accountability First Act-- https://t.co/qGDEEofYbI","date":"Thu Mar 16 20:15:10 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"If you're in need of some inspiration--oldest living Pearl Harbor survivor, Ray Chavez, just turned 105 https://t.co/f13tXNQ8DO via @nbcnews","date":"Thu Mar 16 19:30:09 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"https://t.co/lf2id7LUmF","date":"Thu Mar 16 18:51:56 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Just wanted to share my thoughts about the President's proposed cuts in funding for the Great Lakes! #GreatLakes #MyMichigan1 https://t.co/xYXQuafLxr","date":"Thu Mar 16 17:49:17 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy Birthday and thank you @AmericanLegion for 98 years of dedicated service to our Veterans! #ForGod #ForCountry https://t.co/aNOQ2QFPBQ","date":"Wed Mar 15 22:09:09 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for coming in @SblackSarah @MichFarmBureau ! https://t.co/1XpG8pI2lu","date":"Wed Mar 15 21:31:37 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to be an original cosponsor of this important piece of legislation that promotes the best available care for our Veterans-- https://t.co/Hg2E4D0h7M","date":"Wed Mar 15 21:29:55 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great resource for Vets! https://t.co/GtUKVxBHHc","date":"Wed Mar 15 15:01:32 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"D.C. calls this \"snow.\" Not quite like it is in Watersmeet, but not bad for a quick 📸! #USCapitol #CapitolHill https://t.co/dHmD2mUjwz","date":"Wed Mar 15 14:58:59 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Want more info about what's going on in Washington and in the First District? Sign up to get my newsletter! \n\nhttps://t.co/bVLgBCe5Dr","date":"Tue Mar 14 22:49:00 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for your commitment to #GreatLakes restoration @GLCommission ! https://t.co/WHThtjmDFO","date":"Tue Mar 14 22:01:32 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Here are just a few reasons the Great Lakes are worth protecting. https://t.co/UTYtOIvMjv","date":"Sat Mar 11 22:32:43 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Hopeful that we can work with the Administration to properly fund the Great Lakes Restoration Initiative. We have a duty to protect the GL!","date":"Sat Mar 11 00:25:40 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@rickbbiking I'm with you--I signed a bipartisan letter to @POTUS last month calling for $300 million in funding for the Great Lakes! https://t.co/kQjw9wniMz","date":"Sat Mar 11 00:24:30 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"House GOP targets VA's 'bad apples' in vote next week https://t.co/hfpQoCbbIR via @DCExaminer","date":"Fri Mar 10 21:49:43 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Welcome @TwisaLisa -- the First District is glad to have you! https://t.co/IeDHbOw6Fg","date":"Fri Mar 10 17:20:08 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@RepValDemings : \"compromise is not a bad word.\" I couldn't agree more. This isn't about pride or party. It's about getting things done--","date":"Fri Mar 10 00:56:39 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Our Veterans step up for us, and together we can step up for them. Talking #unity with my colleague @RepValDemings a @BPC_Bipartisan -- https://t.co/zBcvN1igdg","date":"Fri Mar 10 00:55:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"3/3 Make sure that you take advantage of the services my staff provides. They're there because they're passionate about public service!","date":"Thu Mar 09 23:45:12 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"2/3 Having an issue with a federal agency? Need help navigating the process? My district staff can help!","date":"Thu Mar 09 23:43:59 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/3 ANNOUNCING: March Mobile Office Hours Across the First District \n\nhttps://t.co/Q27EP7Rbf3","date":"Thu Mar 09 23:43:09 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to joining @RepValDemings and @BPC_Bipartisan tonight to talk moving forward together--as a freshman class and as a country. https://t.co/foP8Fu1xF2","date":"Thu Mar 09 20:18:47 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Congrats! https://t.co/BvxxdZxp4Q","date":"Thu Mar 09 13:19:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks to Grand Traverse Industries for empowering people to be independent and reach their full potential! https://t.co/rpc63qqfG1","date":"Thu Mar 09 03:34:28 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Can't wait to hear from you! ☎️","date":"Mon Mar 06 17:43:11 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Otherwise, call (231) 373-5594 to join the call, hear what I've been working on in Congress, and ask about the issues that matter to you-- https://t.co/auJXxUyakm","date":"Mon Mar 06 17:39:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"If you've already spoken with my staff and asked to be added to the call out list, all you have to do to join is wait for a phone call!","date":"Mon Mar 06 17:35:15 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Don't miss my first live telephone town hall tomorrow, March 7 at 7:30 pm EST! https://t.co/le5PIl5S1R","date":"Mon Mar 06 17:32:58 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Any successful venture has to know what's working for it and what isn't and adjust accordingly. It's no different with government. #SCRUBAct https://t.co/WINBJ70vKQ","date":"Fri Mar 03 19:11:24 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for your service and for the incredible work that you do, @ConcernedVets ! https://t.co/C1T2kxULRf","date":"Thu Mar 02 23:51:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to be working with my incredible colleagues in Congress and with the incredible women who serve on my staff! #WomensHistoryMonth https://t.co/AE39fU30QQ","date":"Thu Mar 02 23:50:09 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"2/2 I stand with the Jewish community and condemn words and acts of hatred based on religion, race, gender, or national origin.","date":"Thu Mar 02 16:39:18 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/2 I'm with @POTUS and @SpeakerRyan on this-- https://t.co/cXFiiF3N46","date":"Thu Mar 02 16:38:33 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@NatReview gets the commitment to civility. No problem with passionate but dignified debate followed by a cup of ☕️-- https://t.co/Mtr8bEfwho","date":"Thu Mar 02 04:37:26 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Drug diversion isn't just wrong, it's dangerous ... https://t.co/hZWJkLjUJ0","date":"Thu Mar 02 04:30:42 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Keeping the #bipartisan spirit alive tonight at the @BPC_Bipartisan 10th anniversary reception. We have to move forward ... together. #BPC10","date":"Wed Mar 01 22:36:03 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Want to extend my sincere congratulations to @RepRyanZinke on his confirmation as @Interior Secretary! https://t.co/aX6yYTqGws","date":"Wed Mar 01 21:32:06 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: Had a conversation with @cspan about @POTUS #JointAddress before Congress--check it out! https://t.co/Pm8uijEOQE","date":"Wed Mar 01 20:46:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for coming in and speaking with me about what matters to Michigan's credit unions  @MICreditUnions https://t.co/aX9DDN5LlC","date":"Wed Mar 01 18:40:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks, @andrewlacombe @wluctv6 ! https://t.co/ml8Ij7FOao","date":"Wed Mar 01 16:08:46 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@AmericanLegion @legionbaseball it's true! See one, be one, lead one! https://t.co/CA0NRK7poU","date":"Wed Mar 01 16:06:41 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Listen here for my reaction with @michnewsnetwork to the President's joint address-- https://t.co/6X1NjR0j4j","date":"Wed Mar 01 06:27:54 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks for the opportunity, @McNamaraWWJ ! https://t.co/oIp7DpUppG","date":"Wed Mar 01 05:35:21 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: my reaction to the President's speech tonight before a joint session of Congress-- https://t.co/v6PXRx6jf8","date":"Wed Mar 01 05:32:48 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We can improve national security and address our readiness issues WHILE protecting taxpayer dollars--","date":"Wed Mar 01 02:53:42 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@POTUS vows to invest big in infrastructure. Time to modernize the Soo Locks. It's an economic/security must! #SooLocks #JointSesson","date":"Wed Mar 01 02:43:32 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Need to get rid of regs that aren't working and are hurting jobs and our economy--","date":"Wed Mar 01 02:27:38 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Need to make sure regulations working effectively and efficiently when they're working.","date":"Wed Mar 01 02:27:07 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@POTUS address to joint session starting now--","date":"Wed Mar 01 02:09:10 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@dcexaminer snapshot of what some of my fellow lawmakers and I are hoping to see tonight-- https://t.co/FKJh6L9fiF","date":"Wed Mar 01 00:37:41 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud that the freshman class has vowed to make tonight and every night in the 115th Congress about dignity and ideas. #Civility","date":"Wed Mar 01 00:26:31 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Also want to hear that Michigan #JOBS and infrastructure top the list of priorities for @POTUS and the White House. Thinking #SooLocks","date":"Tue Feb 28 23:55:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking to hear #ABetterWay to care for our Veterans, educate our children, and promote health and wellness for our people.","date":"Tue Feb 28 23:44:01 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Just a few more hours until the @POTUS #JointSession address--hoping to hear the President's vision for a unified America. 🇺🇸 https://t.co/nyXfqUX46O","date":"Tue Feb 28 23:37:05 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to my 1st hearing as Chairman of @HouseVetAffairs O &amp; I Subcommittee today to assess the VA's risk for drug diversion--","date":"Mon Feb 27 15:29:17 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Hope this means movement in the right direction for the #SooLocks https://t.co/6AmBIsnccZ","date":"Mon Feb 27 15:25:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"2/2 I'm proud to represent a district where people see each other as people and treat each other with dignity, no matter their differences.","date":"Sat Feb 25 05:57:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/2 One of the most important parts of living in a civil society: talking with folks who disagree and want to share their point of view. https://t.co/TDaIdazC8m","date":"Sat Feb 25 05:55:52 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Speaking to constituents and answering questions at the @PetoskeyChamber event this week--some great and thoughtful comments and questions-- https://t.co/x6qeRNjpEL","date":"Sat Feb 25 05:17:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Definitely don't get these views in DC-- https://t.co/xZe9O6S6kr","date":"Sat Feb 25 05:14:43 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Started this week in Alpena, spent some time in Traverse City, and then headed over the bridge to the #UP! Going strong in #MI01-- https://t.co/4C4dUNN8z4","date":"Sat Feb 25 05:13:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"That's great! Most of the events this week (including the game) have been public! Excited to hear from all of my 700,000+ constituents-- https://t.co/4ccfXn7L29","date":"Sat Feb 25 05:09:59 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Talking policy and Michigan priorities with Jack Hall this morning on Radio Results Network--good to see you, Jack! https://t.co/EPn0q4QLfd","date":"Sat Feb 25 05:01:57 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Humbling to tour the Jacobetti Home for Veterans today in Marquette. These are people who know what it means to honor our Vets--#HonorThem https://t.co/wyDkMAq3SH","date":"Sat Feb 25 04:58:36 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"A little non-partisan pizza at @VangosPizza before the game-- https://t.co/WwAQiVXMQt","date":"Sat Feb 25 04:54:45 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"A few more from the @NMUHockey game-- https://t.co/tTi8vp9NmQ","date":"Sat Feb 25 04:50:18 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great night at the @NMUHockey game and an honor to drop the puck and speak with folks from across #MI01! #GoCats https://t.co/macy0GoV7I","date":"Sat Feb 25 04:44:38 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks @BenMTaylor and @PetoskeyChamber! Glad to speak to folks on both sides of the aisle-- https://t.co/TD07v8dofD","date":"Sat Feb 25 04:34:20 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Wish you'd come on over, @jchapman06. Spoke to lots of First District folks tonight, and I would have loved for you to have been one-- https://t.co/dhtH3frNs3","date":"Sat Feb 25 04:22:18 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"3/3 I cosponsored H.R. 512 to help Vets get immediate updates about the status of benefits claims. Less talk. More action. Across the gov.","date":"Fri Feb 17 22:19:34 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"2/3 We've gotta streamline processes so that our Veterans get the care and the benefits they earned during service.","date":"Fri Feb 17 22:12:42 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"1/3 I've been in office for about a month, and already, my office has been flooded w requests from Vets for help w @DeptVetAffairs","date":"Fri Feb 17 22:11:40 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to working with @DrPhilRoe and @SecShulkin for a better, more streamlined and transparent @DeptVetAffairs. https://t.co/6mcrkHuD1z","date":"Fri Feb 17 21:43:50 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Congrats to MI-1's own Leticia Rocha for earning The Corps Network's Corpsmember of the Year Award! #ServiceFirst https://t.co/txtI3zjakX","date":"Wed Feb 15 20:31:02 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Wishing a Very Happy Valentine's Day to you and the people you love ... and especially to Cindy, the woman I love! #valentinesday2017","date":"Tue Feb 14 20:22:13 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Congrats, @RepDianeBlack! I'm sure @housebudgetGOP will do great things with you at the helm! https://t.co/LlOzTZtQEA","date":"Tue Feb 14 20:18:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Congrats, @RepTomPrice. I know you'll work hard at @HHSGov to make sure that EVERY American has quality healthcare that's affordable. https://t.co/suqanDl0Bs","date":"Fri Feb 10 17:29:11 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Thanks, @RepGallagher! Looking forward to working with our Armed Forces and industry to effectively/efficiently rebuild our fleet! #Seapower https://t.co/CHxEaKA2NH","date":"Fri Feb 10 16:38:42 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Awesome day at the @SaultI500 in Sault Ste. Marie. Lots of hard work goes into making this race a success. Glad to be there to celebrate-- https://t.co/x2DNCX8H8i","date":"Tue Feb 07 20:32:03 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@HouseVetAffairs Hearing today about the IT landscape. End goal is making sure these systems work for Vets in MI-1. https://t.co/yPDjEQGGnR","date":"Tue Feb 07 19:39:09 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Good to see my friend, General Neller, this morning-- https://t.co/iyy1Omt5aQ","date":"Tue Feb 07 19:36:48 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@BrentGreen24 that vote takes place exclusively in the Senate.","date":"Tue Feb 07 19:33:17 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Congrats to my fellow @HouseVetAffairs subcommittee chairman, @RepArrington! https://t.co/AoZF5ICpRH","date":"Tue Feb 07 14:45:19 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to working with my colleagues in Congress to make sure we're getting more @amphibwarships to our war fighters. https://t.co/sCuj06w3O4","date":"Tue Feb 07 14:25:01 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"We can do better. https://t.co/5dk3mOccjH","date":"Tue Feb 07 13:16:21 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"YOU should be in charge, not Washington. https://t.co/oRhpdx8DeL","date":"Tue Feb 07 13:12:41 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happening this a.m.: talking why we need more @amphibwarships and then learning more about IT at the VA at our 1st @HouseVetAffairs hearing-","date":"Tue Feb 07 13:11:56 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: talked @POTUS nominee for #SCOTUS with @UPABC10 \n\nhttps://t.co/8pL1A55r8G","date":"Thu Feb 02 20:48:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Don't miss my op-ed on ACA pros and cons in today's @RecordEagle. Time for health care that puts you in charge--\n\nhttps://t.co/KRLX3xjUWf","date":"Thu Feb 02 18:08:20 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Not a bad way at all to ring in year 70! Absolute pleasure to meet these students from Valley Forge Military Academy and College-- https://t.co/IJkvXkBrHp","date":"Thu Feb 02 17:44:45 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Congrats, @RepBradWenstrup! https://t.co/xziDdbfqtv","date":"Thu Feb 02 17:12:22 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Six more weeks of winter weather is nothing the First District can't handle. #bravingit #MyMichigan1\n\nhttps://t.co/K9o1AIt7Bh","date":"Thu Feb 02 14:43:25 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"#SCOTUS job is to uphold Constitution and secure individual liberties. Gorsuch's record inspires confidence. Great choice by @POTUS--","date":"Wed Feb 01 19:46:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud to serve @NatResources Subcommittees on Federal Lands, Oversight and Investigations, and Indian, Insular and Alaska Native Affairs!","date":"Tue Jan 31 18:18:10 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to working with @NatResources Subcommittee Chairmen @Raul_Labrador @RepLaMalfa @RepDLamborn @RepMcClintock and @RepGosar","date":"Tue Jan 31 18:12:26 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Celebrated life today w Marquette's own Yoopers for Life! They've been matching for the 10+ yrs! Honored to have them here! #MarchForLife https://t.co/mkhAanEJ9x","date":"Fri Jan 27 22:59:35 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"\"The opposite of love is not hate, it's indifference\"- Elie Wiesel #HolocaustRemembrance https://t.co/1FM2yxqcWj","date":"Fri Jan 27 19:28:47 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy 180th to the Great Lakes State and a great place to call home!\n\nhttps://t.co/ouqpBzF2jc","date":"Thu Jan 26 16:57:44 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Glad to see the executive and legislative branches working together for the people-- https://t.co/9JWHLmZ1Ds","date":"Wed Jan 25 13:24:49 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"@DanMcPherson497, Thank you. I'm honored. https://t.co/nwVQCtQJAy","date":"Tue Jan 24 23:42:57 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Proud of my vote today in support of life. #LetLoveGrow https://t.co/Agyy7Vm7Xo","date":"Tue Jan 24 22:27:01 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Something to think about ... https://t.co/daPvLhXn1c","date":"Tue Jan 24 20:51:15 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Incredible story about honoring the fallen and honoring their families. #HonorThem https://t.co/vwWIWO0AVE","date":"Tue Jan 24 19:05:51 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Looking forward to hearing what @POTUS Trump has to say a month into the new administration-- https://t.co/uyYgiZiqlz","date":"Tue Jan 24 15:41:49 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Great article, @SteveRussellOK. We've got to focus on keeping taxpayer dollars from being wasted--both in defense and domestic spending-- https://t.co/iavpdklKOp","date":"Tue Jan 24 14:08:29 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Happy 10th BDay @politico! https://t.co/h3J0Fcfouk","date":"Mon Jan 23 18:40:59 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Always eager to hear more about how we can provide affordable, quality, patient-centered care to EVERY American. https://t.co/HDKOpKAP66","date":"Mon Jan 23 18:39:42 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Can't wait to work with @POTUS to promote trade deals that level the playing field, increase exports, and elevate living standards. 3/3","date":"Mon Jan 23 17:40:43 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"TPP isn't fair or free trade. It hurts industry and undermines national sovereignty. 2/3","date":"Mon Jan 23 17:33:16 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Michigan makes some of the best products in the world, and I support trade deals that benefit our workers and promote economic security. 1/3","date":"Mon Jan 23 17:30:50 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"It's almost time! #inauguration2017 https://t.co/QeXB13M7xA","date":"Fri Jan 20 13:43:20 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Honor where honor is due. #HonorThem https://t.co/oGG00Hsf5J","date":"Thu Jan 19 20:49:57 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Can't make it to the #Inauguration? Don't worry! You can watch live here-- https://t.co/fD2xL4i5TZ","date":"Thu Jan 19 20:44:05 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"Gonna be in D.C. for the inauguration? Here's a guide to getting around! \n\nhttps://t.co/j76TNARS43","date":"Wed Jan 18 21:41:14 +0000 2017","user_id":"815241612154417152"},{"handle":"RepJackBergman","text":"ICYMI: Alex Olin, a remarkable young man with a knack for political history, will be my guest at #Inauguration2017.https://t.co/40kpElkCqG","date":"Wed Jan 18 20:25:13 +0000 2017","user_id":"815241612154417152"}]