[{"handle":"RepKinzinger","text":"These men have enlisted in the Ukrainian army, and thus are afforded legal combatant protections. As such, we expect members of the Legion to be treated in accordance with the Geneva convention. #UkraineArmy","date":"Wed Jun 15 16:53:31 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"The American people need to know what happened. Our goal @January6thCmte is to share the facts; and I believe our findings will impact the future of this country. And while the threat to our democracy remains, we as Americans must hold firm to the rule of law &amp; the truth. https://t.co/JoJsqJDPSH","date":"Tue Jun 14 23:56:38 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just to be clear: tomorrow’s hearing has been moved to next week. This change was made to space out the #January6thHearings; nothing else. I look forward to leading this hearing and presenting our findings to the American people.","date":"Tue Jun 14 18:03:22 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Donald Trump did not receive enough votes to win the 2020 election. He was told this repeatedly, as our witnesses shared, but he chose to declare victory anyway. His perpetuation of the Big Lie led to Jan 6. Those are the facts; the truth is not political. #January6thHearings https://t.co/WoePpODbnA","date":"Mon Jun 13 18:59:29 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Tonight, we’ll begin to uncover the facts of what happened &amp; lay them out for the American people. We owe it to the next generation to uphold our oath &amp; defend our democracy. Self-governance requires accountability &amp; responsibility—from each and every one of us.","date":"Fri Jun 10 00:03:02 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is what happened on January 6th. The world watched as a violent mob attacked the @uscapitol; unleashing their rage on our frontline defenders. It was an insurrection—&amp; it’s a moment in our history that we must ensure can never happen again.","date":"Thu Jun 09 21:07:28 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s been over 100 days since Russia wrongfully invaded Ukraine. It’s time to end this. The United States should join our allies in providing #Ukraine with the tools they need to firmly defeat Vladimir Putin and his barbaric regime.","date":"Tue Jun 07 21:15:31 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"This horrific massacre is disturbingly one of countless atrocities committed by the Assad regime. We must shed light on this &amp; hold these war criminals accountable. My letter w/ @RepBrendanBoyle calls on @POTUS to target sanctions on those responsible: https://t.co/e6jCSLN4EE.","date":"Fri Jun 03 21:06:47 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"In our effort to bolster supply chains &amp; spur innovation, we must keep my bill with ⁦@RepMalinowski⁩ that helps the US capitalize on welcoming highly-skilled Hong-Kongers. From both a policy &amp; a practical standpoint, China’s loss should be our gain. https://t.co/ReOGr4JXl7","date":"Thu Jun 02 20:54:46 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"As a strong Second Amendment defender, I believe we have to be the ones putting forward reasonable solutions to gun violence. I'm focused on saving lives &amp; I'm hopeful more of my colleagues will reach across the aisle to do the same. https://t.co/CXodjhlSnD https://t.co/DO4r81OoG8","date":"Thu Jun 02 16:38:56 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"To celebrate #MemorialDay is to remember and honor our fallen heroes—those who gave the last full measure of devotion in service to this great nation. Today, I’m thinking of my friend Capt. Andreas O’Keeffe and countless others who’ve made the ultimate sacrifice. #HonorThem","date":"Mon May 30 14:45:13 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Cheers to our friends in Georgia on 31 years of regained independence! The Georgian people know all too well the devastation Ukraine is facing against Russia’s aggression. We stand firmly in support of the sovereignty of these two nations &amp; value our continued friendship. 🇬🇪🇺🇸","date":"Thu May 26 20:25:54 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Last week, I spoke with @JohnBerman about the massacre in Buffalo. One week, and here we are again. We cannot ignore this; we cannot continue to feed people a steady diet of fear &amp; anger and not expect dangerous outcomes. https://t.co/7vkz8U4Mrh","date":"Wed May 25 20:50:40 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sickened by the news out of Texas. I’m at a loss and my heart is heavy.\n\nThis cannot continue to happen. We have to do something; utilizing the resources necessary to thwart these senseless crimes.","date":"Tue May 24 22:27:09 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Domestic terrorism is real. It's why we conduct lockdown drills for active shooters &amp; bomb threats in our schools. Wanting to dedicate resources to prevent these atrocities should not scare the American people; what should scare them is if we do nothing.","date":"Thu May 19 19:43:57 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"The baby formula shortage is reaching crisis levels &amp; we need the FDA to step up &amp; address this issue. With a 4month old at home, I know the impact it's having on families nationwide. At a time of such division, I hope we can come to an agreement on a solution for BABY FORMULA.","date":"Tue May 17 21:31:45 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"The polarization of our discourse &amp; the spreading of hate &amp; conspiracies online has created a dangerous breeding ground for extremists.\n\nWhat we witnessed in Buffalo last night was horrific; it was pure evil. My heart is with the victims, their families, &amp; the community.","date":"Sun May 15 22:23:42 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"I'm proud to know Dr. Attar, a Chicago MD who has risked his life to help those in dire need. From #Syria to #Ukraine, he's volunteered in their hospitals &amp; witnessed the devastation &amp; horror. In both places, innocent people are targeted by Putin with impunity. Enough is enough.","date":"Fri May 13 21:28:55 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Another heinous look at the true intentions of Russia’s war on Ukraine. This war crime and the countless others they’ve committed cannot go unchecked. Putin must be held accountable for these atrocities.","date":"Thu May 12 13:09:53 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing a very Happy Mother’s Day to my mom &amp; mother-in-law, and a special one to my wife, @sofiakinzinger, on her first year celebrating. Christian and I are beyond lucky to have you as our rock. We love you and appreciate you big time! https://t.co/G4wGbMfMYQ","date":"Sun May 08 16:12:39 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"How much time did @GOPLeader need to do the right thing? Is this why the VP wouldn’t call the cabinet? Timing?\n\nGiven how quickly he ran down to Mar-a-Lago to kiss the ring, I’d guess it wasn’t a timing issue, but a calculated sell-out in his desperate quest to become Speaker.","date":"Fri May 06 00:50:51 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Reminder: The war in Ukraine was unprovoked. Russia chose to attack the Ukrainian people &amp; are threatening WMD. My red line AUMF should deter Putin from such reckless actions in his desperate pursuit to rebuild the old Soviet Union—if not, we’ll be ready. https://t.co/zyAlZNoBJd","date":"Wed May 04 16:25:14 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Words matter, but so do our actions. I’m introducing this AUMF as a clear redline so @POTUS can take appropriate action if Russia uses chemical, biological, and/or nuclear weapons. We must stand up for humanity and we must stand with our allies. https://t.co/zyAlZNGcAL","date":"Sun May 01 15:19:22 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Honored to welcome @poroshenko to the #SedonaForum2022. We’re grateful for his insight, his service to #Ukraine, and the valuable time he spent with us today. We will continue to be an advocate &amp; dedicated partner for freedom. #SlavaUkraini","date":"Sat Apr 30 16:20:40 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Russia’s aggression on a sovereign nation isn’t new. We saw it in 2008 when they invaded Georgia 🇬🇪. As Putin’s failed campaign in Ukraine continues, we must show we stand with our allies. This week the House did so by passing my bill with @GerryConnolly, the Georgia Support Act.","date":"Fri Apr 29 17:13:33 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"The Ukrainian people are strong, but they need our help. Today, I met with Ukrainian MPs to discuss how best we can help in this fight. It’s important to remember that Putin’s ruthless war on Ukraine impacts all freedom-loving people and the advancement of democracy everywhere. https://t.co/LcHjAKraSs","date":"Wed Apr 27 22:43:47 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Trevor Reed is finally free. https://t.co/HmJyuxdfYI","date":"Wed Apr 27 15:29:04 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"We still haven’t heard the vision @elonmusk has for the Twitterverse, but I’m really hoping it includes an edit button. We need a SHORT grace period for our free speechin’ here, am I right? https://t.co/jUxtiCm0Nl","date":"Tue Apr 26 21:18:30 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s the last week to get your submissions in for the 2022 Congressional Art Competition. This annual contest is open to all of our #IL16 high school students &amp; more info can be found here: https://t.co/J4uYK4r648 https://t.co/zP84oqJxrz","date":"Mon Apr 25 17:21:12 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"It shouldn’t be a novel idea to tell the truth, to stand up for our democracy, and to serve with integrity. But it is. As a society, we must demand better of our leaders, our media, and ourselves. More from my op-ed here: https://t.co/5omehKViCi","date":"Mon Apr 18 15:13:18 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"“This is the day the Lord has made, let us rejoice and be glad.” Psalm 118:24\n\nFrom my family to yours, wishing you all a blessed Easter. May we remember the sacrifice of God, and rise each day with faith, hope, and love.","date":"Sun Apr 17 15:53:22 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"When it comes to Jan 6, I don’t expect to change minds on the truth of what happened. But years from now when my son learns about this in school, I’ll be able to look him in the eye, proud of the stand I’ve taken to defend democracy no matter the cost. https://t.co/JojlnTX36Z","date":"Fri Apr 15 18:30:02 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Authoritarians fear opposition more than anything else. Putin’s career was built on murdering &amp; detaining those who challenge him. While @vkaramurza advocates a brighter future for Russia, Putin remains hell bent on making his people--and millions of others--needlessly suffer.","date":"Tue Apr 12 18:45:21 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Peace is not possible with Putin. He won't stop his brutality because of sanctions. He will use chemical weapons &amp; any means necessary to win. This moment requires swift action, not continued fear &amp; weakness from the West. Every minute we delay is another life lost in #Ukraine.","date":"Tue Apr 12 13:43:41 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Given what Russia has done in Syria—namely aiding in Assad’s genocide—it’s pretty clear that Putin will double down on his war crimes in #Ukraine.","date":"Sat Apr 09 21:04:16 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"In our oversaturated news environment, it’s become all too easy to blindly trust those who may not have our best interests. From across the spectrum, we’re seeing too many performance artists in politics &amp; not enough truth. I’m calling them out here: https://t.co/TZr6xxRgk4","date":"Fri Apr 08 20:52:34 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Removing Russia from the @UN_HRC is long overdue. From their support of Assad to the genocide in Bucha, the Russian Federation has shown their disdain for human life. To those who refused to condemn the Kremlin's atrocities in Ukraine, here’s a fresh reminder of their war crimes:","date":"Fri Apr 08 14:59:05 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud to share that our #Illinois ambulance has made it into Ukraine with the help of @OSFHealthCare, @AMTsaveslives &amp; the Ukrainian Medical Association of North America. Thank you for working with our office to facilitate this valuable transfer. #StandWithUkraine https://t.co/kwyiqkAmo0","date":"Thu Apr 07 16:15:43 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"The horrific atrocities in #Bucha further show the barbaric brutality of Putin &amp; his regime. How Russia continues to sit on both @UN_HRC &amp; UNSC is a disgrace to the international community. We have a moral obligation to stand up for humanity &amp; call out the genocide in #Ukraine.","date":"Wed Apr 06 00:53:29 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"For years Putin has used energy as a weapon to coerce, manipulate, and create conflict among European governments. Proud to see our friends in Lithuania take this important step and firmly push back on Russia’s energy stranglehold. https://t.co/72sy8qb9ZG","date":"Mon Apr 04 19:59:58 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"The @January6thCmte needs to hear directly from Dan Scavino about his and President Trump’s role in inciting violence on January 6th. He has highly important information but has chosen to stiff-arm the American people and hide the truth. It's unlawful and inexcusable. https://t.co/S0YxF0aroT","date":"Wed Mar 30 16:31:55 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"An unprecedented attack on our democracy, the Trump-Eastman plan \"spurred violent attacks on the seat of our nation's government, led to the deaths of several law enforcement officers, and deepened public distrust in our political process.\"","date":"Mon Mar 28 19:22:44 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"A sad and shameful reminder to the world that the Taliban has not changed in over 20 years. \n\nEducation is hope, but once again, the Taliban takes that away—violating women’s rights and preventing girls in Afghanistan from having a future. https://t.co/ApoSl1OxXK","date":"Fri Mar 25 11:47:01 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"From refugee to the first female U.S. Secretary of State, Dr. Madeleine Albright was a trailblazer. She was one of the brightest minds we’ve ever had, a champion for human rights. In mourning her passing, may her incredible legacy continue to inspire us and future generations. https://t.co/7XyAx9Jn72","date":"Wed Mar 23 19:42:23 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"We cannot just sit back and watch the horrific atrocities mount in Mariupol. Once again, Putin is targeting children and innocent civilians for power, just as he did (and does) in Syria. It’s sickening and he must be stopped.","date":"Tue Mar 22 20:55:06 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"The House has lost a true legend and a dear friend. Don Young was an institution himself—the definition of a devoted public servant, tough as anything, a true champion for Alaska. My condolences are with Anne, his family, &amp; his staff as we join in mourning this loss.","date":"Sat Mar 19 14:13:53 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"We cannot allow Ukraine sovereignty to be walked over by a ruthless authoritarian. We know Putin will do anything for power; using any means necessary to break the Ukrainian spirit. Standing with Ukraine has to be more than just words. We must send the MiGs now.","date":"Thu Mar 17 22:59:46 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"A big thank you to all who participated in our annual St. Patrick’s Day veterans card drive this year. We received our most cards ever, and because of this incredible showing, we were able to share our appreciation for our local heroes at three #IL16 facilities. https://t.co/t9QsPDhQeZ","date":"Thu Mar 17 20:04:11 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud to announce the community projects across #IL16 that were included in the recent spending package approved by Congress and signed into law by the President. I look forward to seeing the incredible impact these efforts will have on our communities. https://t.co/qnPJhvMs4J","date":"Wed Mar 16 16:15:49 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today marks 11 years since the start of the Syrian War, and the brutality of Assad &amp; the targeted attacks by his friend Putin continue. Joint statement with my Friends of a Free Syria Caucus co-chair @RepBrendanBoyle here: https://t.co/QQ3HM22xCr https://t.co/7igK0p0uNy","date":"Tue Mar 15 22:15:52 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Unbelievably sad and at the same time, so infuriating. This blood—and that of the hundreds of Ukrainians killed in this unjust war—is on the hands of Vladimir Putin and all those who support him.","date":"Sun Mar 13 22:21:58 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sending my deepest condolences to the family and loved ones of Megan Bugg--a fierce advocate for #childhoodcancer &amp; a bright light of optimism who battled stage 4 cancer for the last 7 years. May her legacy continue to inspire us, and may she rest in eternal peace. https://t.co/HSKCcjUGsE","date":"Fri Mar 11 17:22:23 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is the sad but successful impact of Russia’s cyber operation that we’ve seen pushed and promoted on conservative outlets. The threat is real and it’s dangerous. Case in point: a sitting US Congressman is echoing Putin propaganda.","date":"Thu Mar 10 23:34:47 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"What is the red line with Putin? What will it take for the US to act? \n\nThe threat of Putin using chemical attacks in Ukraine is very real—we’ve seen him use it on the Syrian people for over a decade. We are beyond escalations; this is about humanity and doing what’s right.","date":"Thu Mar 10 02:49:27 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"The rationale is saving innocent lives. To recap: Putin said that sanctions, no fly zone, &amp; sending arms each constitute an act of war. Why are we letting this thug dictate our foreign policy? The NATO alliance was made for moments like these. We must send this aid &amp; stop Putin.","date":"Wed Mar 09 02:09:32 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Another reminder of how little Putin cares about human rights, in his own country or anywhere else. \n\nTo the women in Russia and Ukraine, and all around the world, who courageously stand up and speak out: we see you &amp; we are with you. #IWD","date":"Tue Mar 08 23:58:22 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"For years, I've called for the diversification of our energy supply &amp; that of our European allies. [see here: https://t.co/dQkn1kfEYM]\n\nIn this moment, we have to cut Russia at their knees by banning their oil imports. Next, we need to help our allies be more energy independent. https://t.co/QjmJFIDsZR","date":"Tue Mar 08 13:49:36 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Shortly after Russia's unjust, unprovoked invasion into Ukraine began--and the world saw Putin's reckless &amp; indiscriminate attacks on innocent people--I called for a no-fly zone. Here's why, and what steps we can &amp; should take next for humanity. https://t.co/0Qfp4gi1WB","date":"Mon Mar 07 00:48:48 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"After being banned by countless streaming platforms for censorship &amp; disinformation propaganda, the Russian State media outlet RT is going all in with Rumble, which now begs the question: ⁦@JDVance1⁩, is your support for Russia all about money? https://t.co/mYJVSQ7n8d","date":"Sat Mar 05 21:24:54 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is a grim reality and a stark reminder to those who are STILL siding with Putin, one of which is the same person who met with and tried to legitimize #Assad as he used chemical weapons against women and children. Beware of the pro-Russian propaganda.","date":"Fri Mar 04 21:31:24 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Yes, but we’ve known this. We—the entire world—watched as he barrel bombed Syrian schools &amp; hospitals, aiding Assad in horrific chemical attacks on Syrian children. Putin’s barbaric brutality has been on full display for decades &amp; it’s about damn time people wake up to it.","date":"Thu Mar 03 14:40:26 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"This moment is bigger than politics; it’s not about being right or wrong, liberal or conservative—this is about the good of the country and the world around us. \n\nRead my full #SOTU22 statement here: https://t.co/cAfc9Avn9Q","date":"Wed Mar 02 03:42:23 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Another war crime to add to the already long list for Putin. This gruesome attack was purposeful—he’s targeting civilians while claiming to be in negotiations. It’s barbaric and further reminder of his evil. He must be stopped.","date":"Mon Feb 28 13:01:42 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Ukrainians have shown a willingness &amp; fearless ability to push back against an overwhelming invading force. Russians have shown a willingness to protest the Putin regime’s reckless invasion.\n\nIn the words of the fallen Snake Island 🇺🇦 heroes:\n\nRussian warships, go f— yourself.","date":"Fri Feb 25 21:40:13 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"This courage speaks volumes, &amp; Putin is reacting. He will do anything to silence dissent at home in order to carry out his illegal invasion of Ukraine. The Russian people don’t want body bags of loved ones lining their streets—they deserve more than a war criminal in the Kremlin.","date":"Thu Feb 24 18:25:11 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"From poisoning countless political opponents &amp; his assassination of Nemtsov, to the brutal air strikes murdering thousands of Syrian citizens, we have seen who Putin is &amp; the impunity of his barbaric attacks on the world. He must be held accountable.\n\nWe stand with Ukraine. 🇺🇸🇺🇦","date":"Thu Feb 24 15:58:43 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"These Nord Stream 2 sanctions are long overdue, but critical to pushing back on Putin's aggression. \n\nTo those praising Putin's strength AND to those who say criticizing Biden is un-American, you're wrong and severely misguided. My full statement here: \nhttps://t.co/6GctSue84i","date":"Thu Feb 24 00:09:40 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Failing to shut down the Nord Stream 2 pipeline has given Putin the confidence to push the boundaries even further. His aggression is on full display &amp; now, the US must ensure that his violation of international agreements are met with more than punitive, symbolic sanctions.","date":"Tue Feb 22 00:05:30 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Another provocation by Russia, from the same old playbook Putin has been using for decades. Their actions speak volumes while their words continue to mock us with bold-faced lies. It’s time to see this clearly and take action.","date":"Thu Feb 17 17:47:29 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Happy anniversary to my forever valentine! So much has happened in our first two years of marriage, and I can’t imagine going through it all without this incredible woman—lucky doesn’t even begin to cover it. https://t.co/QFx3hYegZ2","date":"Tue Feb 15 19:23:14 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Between Russia interfering with NATO &amp; the Nord Stream 2 power grab, we’ve failed to push back sufficiently against Putin. We cannot appease his aggression or ignore the threat posed to millions of Ukrainians who desire democracy &amp; freedom. We must show strength &amp; solidarity. https://t.co/qdnKmCKPrU","date":"Sun Feb 13 22:50:03 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"What happened on January 6th was not ‘legitimate political discourse’ -- it was a violent insurrection and an attack on our democracy. I look forward to joining #TheView to discuss this and more. Tune in!","date":"Thu Feb 10 16:07:30 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"As I’ve said, if we’re willing to send our young men and women in uniform out to risk their lives for this country, the very least we in Congress can do is be willing to risk our careers to do what’s right. Our democracy is worth saving. https://t.co/iM0CplVCdC","date":"Sun Feb 06 20:56:37 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"I have no regrets about my decision to uphold my oath of office and defend the Constitution. I will continue to focus my efforts on standing for truth and working to fight the political matrix that’s led us to where we find ourselves today.","date":"Fri Feb 04 01:52:49 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"This operation shows that all who threaten the American people &amp; our allies will find no refuge in this world. Our global fight against terrorism continues, and it remains a generational battle.\n\nGod bless our troops who let us sleep easy at night. https://t.co/FuPtdqYciy","date":"Thu Feb 03 15:29:58 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Reminder: @January6thCmte will leave no stone unturned in our pursuit of the truth and to ensure full accountability. The former president’s comment about pardons is dangerous and reminds us, yet again, how unfit he is for office.","date":"Thu Feb 03 00:38:33 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"A hero taken much too soon, reminding us of the incredible sacrifice our men and women in uniform make every time they step out into the communities they serve. We must do more to stop these senseless attacks on our #ThinBlueLine.","date":"Sat Jan 29 00:53:07 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"America must push back against Russia’s malign activity and stand with #Ukraine. We know that Putin fears freedom and democracy—so now is the time to act with strength and real leadership. https://t.co/BbqGAKDUaQ","date":"Wed Jan 26 20:25:04 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thrilled to introduce Christian Adam Kinzinger to the world! Mom and baby are doing great, and Dad is over the moon! https://t.co/muFgvbw0vs","date":"Wed Jan 19 20:49:56 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today, we honor the life of Dr. Martin Luther King, Jr. and celebrate his legacy that continues to inspire millions of people. May we listen to his words and stand up for justice, freedom, peace, &amp; truth. #MLKDay2022 https://t.co/lH0k025PR1","date":"Mon Jan 17 15:43:38 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Waiving Congressional sanctions on NS2 is giving Putin the green light to threaten our allies. The failure to hold Russia accountable will only embolden the Kremlin. I urge @POTUS to stand with our European allies &amp; push back against Russia’s threats. https://t.co/KlgI4ioh8X","date":"Fri Jan 14 17:48:55 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"We must call out the lies &amp; conspiracies being spewed by those in positions of power &amp; influence.\n\n1) Ray Epps was not &amp; is not an FBI informant. 2) The 2020 election was not stolen; Joe Biden won.\n\nTruth &amp; integrity DOES matter. I just wish more in the GOP would see that.","date":"Wed Jan 12 14:49:55 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"We must never allow an authoritarian like Putin dictate the pathway to democracy &amp; to NATO for our friends in Eastern Europe — and @POTUS must make that clear to Russia. Failure to do so emboldens our adversaries &amp; weakens democracies worldwide. https://t.co/g9xdo7Mryv","date":"Tue Jan 11 17:37:19 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thank you is hardly enough for those who courageously put their lives on the line to serve &amp; protect us and our communities. To those who wear the uniform honorably—from #Illinois to our @CapitolPolice @DCPoliceDept &amp; beyond—we stand with you. #LawEnforcementAppreciationDay","date":"Sun Jan 09 22:54:38 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Doing the right thing comes with risk, as we’ve seen a lot in the last year, but I don’t regret a single stand I’ve taken for truth, accountability, democracy. \n\nI wish more of my fellow Republicans would see how important this moment is for America &amp; for future generations. https://t.co/3erzq53kwO","date":"Fri Jan 07 00:14:51 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"We cannot move on from January 6th without taking action to make sure it never happens again. And that starts by admitting the facts, calling out the lies, &amp; addressing the toxic tribalism plaguing this nation.\n\nReflecting on this day, one year later: https://t.co/STP5DxgfWB","date":"Thu Jan 06 15:55:45 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Four months have passed, and still, no response from the @StateDept @DeptofDefense. We need answers and accountability—our fellow Americans and Afghan Allies deserve better.","date":"Tue Jan 04 15:13:44 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing you all a very healthy, safe, and prosperous 2022! I’m looking forward to what the future holds, and most excited to become a father in the coming weeks. Take a minute today to count your blessings, and have a very #HappyNewYear!","date":"Sat Jan 01 16:54:39 +0000 2022","user_id":"219429281"},{"handle":"RepKinzinger","text":"May the light of Christmas Day shine brightly against the darkness—bringing you hope, joy, and peace.\n\nFrom my family to yours, wishing you all a very Merry Christmas! https://t.co/FBMPHwk84m","date":"Sat Dec 25 21:20:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Driving a zero-emission school bus is both energy efficient and super cool. \n\nBig thanks to @LionElectricCo for having me today, and for letting me tour their #IL16 facility in style 👍 https://t.co/KR2bhSrcas","date":"Mon Dec 20 20:42:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As I recently shared with ⁦@BillyHallowell⁩, I’ve been tested here in Congress &amp; in my faith. When the decision becomes truth-telling or winning re-election, the choice for me is easy. And I can sleep soundly knowing my path is walking in truth. https://t.co/Px3i5XVXDp","date":"Thu Dec 16 13:41:45 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Mark Meadows’ actions demonstrate his contempt for Congress, for the @January6thCmte, for his former colleagues, and for the integrity of the democratic process. His stonewalling forced us to take this action tonight—because no one is above the law.","date":"Tue Dec 14 01:23:57 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Continuing to pray for those impacted by the storms last night in #Illinois, as well as the five other states hit by the multiple tornadoes that ravaged communities last night.","date":"Sat Dec 11 20:23:12 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud to be an original cosponsor of this legislation. ⬇️⛽️","date":"Thu Dec 09 20:11:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"May we also remember this day as an example of America’s resilience, strength, and unwavering courage to stand up and fight back. #HonorThem","date":"Tue Dec 07 16:06:10 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A decorated WWII hero &amp; true statesman, Bob Dole dedicated his life to serving this country &amp; he served us well—with his kindness &amp; compassion, servant leadership &amp; love of country.\n\nMy condolences &amp; prayers are with the Dole family in mourning the loss of this great man.","date":"Mon Dec 06 00:38:21 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud to have two of my cybersecurity bills pass the House this week. Taken together, they'll strengthen our cyber posture by educating the public on how to safeguard against attacks &amp; by identifying vulnerabilities in our networks &amp; infrastructure. https://t.co/7ncI8u8cGZ","date":"Fri Dec 03 17:29:00 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The time for Congress to pass the HD Parity Act is long past due. Individuals &amp; families battling this horrible disease have waited long enough &amp; deserve relief. As sponsors of the legislation, my colleagues &amp; I penned an op-ed urging swift action: https://t.co/2OPXNqnUnG","date":"Wed Dec 01 19:51:17 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing a very happy #Hanukkah to all those celebrating here in #Illinois and around the world. May this Festival of Lights be a celebration of our many blessings, our resilience in dark times, and our shared hope for brighter days ahead.","date":"Tue Nov 30 23:33:22 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Happy Thanksgiving, everyone! I’m thankful for my wife, our growing family, and for where I am today. Looking back on the year, I’m grateful to be at peace with my choices, to know my mission, and to stand for truth. Thank you to all who serve and protect this great nation.","date":"Thu Nov 25 17:49:04 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As I have said countless times before, the United States owes our #AfghanAllies a debt that must be paid. With American forces safely out of country, the Biden Administration must account for the failure to keep our promises. Until our allies are safe, we must never give up. https://t.co/iHr46pNagx","date":"Wed Sep 01 15:43:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We need to know who organized &amp; paid for the rallies that led to the violent attack on @uscapitol, as well as what communication the organizers had with the WH &amp; Congress. The subpoenas issued by @January6thCmte this week will help us get answers for the American people.","date":"Tue Nov 23 21:07:37 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We’ve been through many challenging times as a nation, but despite our differences, our democracy has held. Read the #GettysburgAddress today and remember what’s at stake—and why it’s so important that we uphold our responsibility to the continuation of this great union. https://t.co/OpE7zxHU59","date":"Fri Nov 19 22:17:27 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We have to hold Members accountable who incite or glorify violence, who spread and perpetuate dangerous conspiracies. The failure to do so will take us one step closer to this fantasized violence becoming real.\n\nTo be clear, I’ll be voting yes on the Gosar censure resolution.","date":"Tue Nov 16 23:30:26 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Army Sgt. Jeremy Sherman of Watseka #IL16 was one of five American soldiers killed in a helicopter crash in Egypt last year.  Today, as we mark one year since his passing, I join his family in remembering this courageous young man who gave his life in service to our nation.","date":"Fri Nov 12 22:23:32 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Special #VeteransDay shout out to all the veterans who stood up and took action to help our Afghan allies, and all who continue to work behind the scenes to save lives in #Afghanistan &amp; help them as they transition to their new lives. #DigitalDunkirk https://t.co/9WGNzhXEWC","date":"Thu Nov 11 20:55:50 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The freedoms &amp; values we enjoy in this country, we owe to our veterans—to all the men &amp; women throughout our history who put on the uniform, sacrificing to serve &amp; defend our way of life. #HonorThem \n\nOn #VeteransDay &amp; every day, give thanks &amp; God Bless to our heroes. 🇺🇸","date":"Thu Nov 11 16:50:16 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We cannot keep doing politics as usual—it’s not working. The path we’re on is not sustainable, but we CAN change the system and the narrative. \n\nBig thanks to @secupp for the frank discussion here.","date":"Tue Nov 09 02:15:12 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"If leaders continue to spread the big lie &amp; downplay January 6, the guardrails of our democracy will be damaged beyond repair. That’s not an exaggeration—our democracy is in jeopardy. We have to turn things around, starting with truth &amp; accountability. https://t.co/hMChW3Of5e","date":"Sun Nov 07 22:12:33 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Earlier this year, the tragic loss of #Illinois native Ben Price shone a light on the neurological &amp; psychiatric impacts of a #COVID19 infection. After speaking with his family &amp; hearing stories from others, I knew something had to be done. https://t.co/JNZMyy0xpc","date":"Fri Nov 05 12:49:11 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@ChrisEvans @ASP Thanks, Chris! Appreciate the conversation and the work you’re doing with @ASP. 👍","date":"Wed Nov 03 15:11:44 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Look forward to discussing my decision, and my continued mission for truth and transparency. See you all in about 10 minutes!","date":"Sun Oct 31 13:00:38 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I’m proud to have served #Illinois for six terms and look forward to what's next. I'll continue to fight for truth and transparency, for principled leadership and proven solutions, for hope and opportunity.\n\nThank you for this great honor, #IL16. Here’s to the next chapter! https://t.co/vZu8NFET5e","date":"Fri Oct 29 15:53:50 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Great to see our GWOT veteran community working to find solutions. The tragic reality of veteran suicide needs to be addressed, as well as the stigmas that so many veterans face. Mental health matters and this support can make all the difference.","date":"Fri Oct 22 18:48:30 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Steve Bannon went out of his way to earn the resolution the House passed today to hold him in contempt of Congress, referring for prosecution for his reckless disregard for the law and the truth.\n\nAccountability matters. https://t.co/XNIWP6gEML","date":"Thu Oct 21 21:00:04 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Defying a congressional subpoena has consequences. Our work will not be stonewalled, and we will continue to uncover the facts and get answers for the American people. \n\nNo one is above the law.","date":"Tue Oct 19 23:42:25 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The life, impact, and legacy of Colin Powell will long be remembered and admired—we are a better nation for his dedication and leadership, for his guidance and love of country. My prayers are with his family and loved ones on this tremendous loss.","date":"Mon Oct 18 17:04:53 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"My full statement on the proposed congressional maps for Illinois: https://t.co/Ez4pHpykYY https://t.co/EoETgR124P","date":"Fri Oct 15 17:02:03 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"At a time when so much anger and vitriol surrounds us at every turn and tries to divide us even further, we have to remember that we will never agree 100% of the time. Accepting that, and learning to work on solutions where we can find agreement, is essential.","date":"Thu Oct 14 23:14:48 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We cannot in good conscience allow a criminal who used chemical weapons against children to be recognized by the international community. Assad &amp; his backers should not be rewarded for their senseless acts of violence &amp; cruelty. https://t.co/wxFLHzKEHz","date":"Tue Oct 12 19:41:59 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It evidently bears repeating: we will not be deterred by those who want to obstruct our efforts to get answers for the American people. \n\nOur democracy was attacked &amp; we have to ensure what happened on January 6 can never happen again.","date":"Fri Oct 08 20:11:44 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Congress has a broad investigative authority—&amp; so the @January6thCmte will use every avenue possible to ensure subpoenas are enforced.\n\nThe American people deserve answers &amp; that means we need ALL the facts about the events of that day &amp; all those leading up to it.","date":"Tue Oct 05 18:15:33 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s ironic that we celebrate #MFGDay21 today as the bipartisan #InfrastructureBill hangs in the balance. We NEED these investments. It’s why I intro’d the MADE Act to bring manufacturing home, spur our economy, secure supply chains &amp; support U.S. jobs. https://t.co/f6fZT4BMNv","date":"Fri Oct 01 18:38:14 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We have to break the rage cycle, and we need to hold ourselves accountable from falling into the clickbait of the internet. Appreciate the opportunity to advocate for independent thought on @1440WROK last week as we chatted about the issue of tribalism. https://t.co/Agu2Q4KXqi","date":"Tue Sep 28 19:55:54 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thank you to the INBA for this honor—&amp; for the incredible work our newscasters do to provide the people of #Illinois real, accurate reporting.\n\nAs I mentioned yesterday, it’s so important that we empower local news &amp; push back against conspiracies with truth &amp; transparency.","date":"Tue Sep 28 00:29:48 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This should come as a surprise to no one. The Taliban are certainly ‘professional’ terrorists and ‘businesslike’ in their brutality. White House officials, stop trying to normalize this regime. Our Afghan allies deserve better.","date":"Fri Sep 24 13:24:52 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Look forward to getting a full accounting of everything that happened in the Trump White House on, before, and after January 6th. \n\nAnd we’re just getting started.","date":"Fri Sep 24 00:18:08 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Diversifying our energy sources is critical to our energy independence &amp; economic prosperity. And ensuring we have clean, affordable, reliable energy--like #nuclear--is essential. I'm proud to support #NCEW21 &amp; will continue to advocate for #cleanenergy innovation &amp; policies. https://t.co/d6R8eBppVW","date":"Wed Sep 22 20:23:12 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Despite strong bipartisan support to stand by our friend and ally Israel, @SpeakerPelosi chose to play politics. \n\nI voted against this hyper-partisanship tonight, and urge my colleagues to negotiate a compromise in good-faith before the deadline.\n\nhttps://t.co/FVXEWzbYXC","date":"Wed Sep 22 01:17:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Last year, @ilfoodbank provided 100 million meals to our neighbors in need. I’m proud to have their service here in #IL16 &amp; to help raise awareness about food insecurity during this #HungerActionMonth. Learn how you can help be part of the solution here: https://t.co/eq7vEiZSik https://t.co/TeolS4EZlP","date":"Tue Sep 21 14:37:24 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Great meeting w/ Garcoa Labs to discuss supply chains. \n\nBack in May, I introduced a bipartisan bill to strengthen domestic #manufacturing; currently working it through the legislative process in the House. https://t.co/lbEvGJci25","date":"Mon Sep 20 18:58:44 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The freedoms we enjoy today are but one generation away from extinction. It’s on EACH of us to uphold &amp; defend our founding document, and teach our children about ‘the greatest vision of human freedom in history.’ 🇺🇸 #ConstitutionDay https://t.co/9rmBrps2bH","date":"Fri Sep 17 16:43:47 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"And... still waiting. cc: @SecDef @SecBlinken","date":"Wed Sep 15 14:20:03 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is unacceptable. We cannot turn our backs on our allies. \n\nI look forward to asking @SecBlinken about this today &amp; finding out what the Biden administration is actually doing to help our SIVs. @HouseForeignGOP #Afghanistan hearing starts soon, so be sure to tune in.","date":"Mon Sep 13 17:47:32 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As we mark 20 years since the #September11 attacks, let’s take the time to remember—the fear, the loss, the heroes, the devastation, the anger, the unity. Remember it all, and share it with others. We are stronger when we stand together. 🇺🇸 #NeverForget https://t.co/xCXq3u530p","date":"Sat Sep 11 14:58:52 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The events of #September11 changed the trajectory of my life completely and steered me to serve my country. Ahead of the 20th anniversary of that fateful day, I sat down with @washingtonpost to talk about the impact and where we are now as a nation. https://t.co/iBaAR07QBr","date":"Thu Sep 09 21:57:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Still no word from @StateDept @DeptofDefense on how many Americans remain in #Afghanistan, how many SIVs are pending approval, or how many people we left behind.","date":"Thu Sep 09 00:11:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing a happy #RoshHashanah to all those celebrating here in #IL16 and around the world. May your new year be filled with good health and great happiness.","date":"Wed Sep 08 03:25:16 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today we recognize our workers and all of their achievements, here in #IL16 and across the country. We are a better and stronger nation for the incredible effort, perseverance, and countless contributions of America’s workforce. #LaborDay https://t.co/NBxj4elaza","date":"Mon Sep 06 15:34:30 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Coming up next on @CNNSotu to discuss the fallout from #Afghanistan, the severity of the situation for our #AfghanAllies on the ground &amp; what veterans are doing to help, and the latest from the @January6thCmte.","date":"Sun Sep 05 13:34:13 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"With less than 10 days until the Byron plant is expected to shut down permanently, the Illinois House must come back to Springfield to pass the Senate bill &amp; put the measure on @GovPritzker. The decision to #savenuclear is critical for clean energy &amp; for our communities. #IL16","date":"Sat Sep 04 16:27:55 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As I have said countless times before, the United States owes our #AfghanAllies a debt that must be paid. With American forces safely out of country, the Biden Administration must account for the failure to keep our promises. Until our allies are safe, we must never give up. https://t.co/iHr46pNagx","date":"Wed Sep 01 15:43:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@greta Yes, still working to get the majority to take up my bipartisan bill and move it through the House.","date":"Thu Sep 02 13:08:55 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As I have said countless times before, the United States owes our #AfghanAllies a debt that must be paid. With American forces safely out of country, the Biden Administration must account for the failure to keep our promises. Until our allies are safe, we must never give up. https://t.co/iHr46pNagx","date":"Wed Sep 01 15:43:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is a surreal moment for many &amp; devastating for those left behind.\n\nTo our brave men &amp; women who stepped up to serve, we as a nation owe a constant debt of gratitude. You kept America safe &amp; showed two generations of Afghans a better world. \n\nMay God bless our troops. 🇺🇸","date":"Mon Aug 30 21:11:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Leaving #Afghanistan will not stop terrorism or leave the threats we face behind. Our failure to keep our promises to our Afghan allies will be a stain on America &amp; our history, &amp; put us in jeopardy for generations to come. More in @ForeignPolicy here: https://t.co/WYEdeNTg55","date":"Fri Aug 27 23:59:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/lY9A6gwZpw","date":"Fri Aug 27 18:35:50 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"May God bless our fallen &amp; their families. The loss of life is devastating, marking a heartbreaking day in this ongoing fight.\n\nWe must continue the evacuations until we get everyone we promised out. A retreat today would be the largest recruiting tool for terrorists worldwide. https://t.co/PAwadZGjrJ","date":"Thu Aug 26 18:41:46 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Urging swift action to stop this chaos &amp; gain control. Godspeed to our brave military personnel on the ground, as we pray for their safety &amp; that of our citizens and allies.","date":"Thu Aug 26 14:08:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"HAPPENING NOW: I'm holding a tele-townhall with #IL16 constituents to discuss #COVID19 vaccines &amp; the recent @US_FDA approval of @pfizer vaccine. \n\nTonight, I'm proud to be joined by the @ChiMedSoc to help me answer these questions. Be sure to tune in! https://t.co/Ng9hgPVtdh","date":"Tue Aug 24 23:19:20 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The decisions made by this Administration on our nuclear issues will have a substantial impact on the future of America's energy and climate policy. I remain hopeful ⁦@POTUS⁩ will act soon and help save our #nuclear plants.  https://t.co/1Lw7rW2Wuj","date":"Tue Aug 24 22:34:53 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just as @POTUS announced his refusal to extend help to our Afghan allies, I heard from folks on the ground that all valid SIVs were blocked from entering the airport. This is unacceptable. The human costs &amp; damages to America's global standing lay firmly on the Biden-Harris WH.","date":"Tue Aug 24 18:02:38 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"If Springfield lacks the will to save these nuclear plants &amp; if Congress cannot act quickly enough, then it’s time for ⁦the President⁩ to step in &amp; take action to support nuclear power. \n\nMy letter to ⁦@POTUS⁩ can be found here: https://t.co/UsPwYQKcEt","date":"Tue Aug 24 15:33:20 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The recent flooding in Gibson City has been devastating &amp; the severity of flood damage has been deemed 'beyond the capacity of state and local governments to address.' As such, I led a bipartisan IL delegation letter urging @SBAgov to help Ford County. https://t.co/kEXF5nbWoV","date":"Mon Aug 23 20:42:21 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Coming up next on #CNNSOTU to discuss this &amp; more.\n\nSo many failures in #Afghanistan, I hardly know where to begin. But right now, we need to show American strength against an emboldened &amp; empowered Taliban &amp; other terrorist groups. We cannot leave Americans &amp; allies behind.","date":"Sun Aug 22 13:05:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Incredibly proud &amp; grateful to our military; both for what they’re doing on the ground &amp; for what they’re enduring in the process. These photos are a perfect reminder that we are stronger together; this is humanity at its finest. #WorldHumanitarianDay","date":"Sat Aug 21 01:24:12 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is the grim reality we face &amp; @POTUS needs to act now. He needs to come up with a plan to secure safe passage for Americans stuck in #Afghanistan, as well as our allies. Start by taking control of the airport perimeter &amp; checkpoints. Push back &amp; make a stand for humanity.","date":"Fri Aug 20 17:04:08 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"That we still don’t know how many Americans remain stranded in #Afghanistan is alarming, but worse, there appears to be no real plan on HOW to get them past the Taliban &amp; out safely. This, on top of the thousands of SIVs being left behind, is unacceptable. https://t.co/OStOi9JDE5","date":"Wed Aug 18 23:02:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Back in February, we wrote @POTUS offering our support to help fix the SIV program to save our Afghan allies. Instead of communicating with Congress, he downplayed the threat to fulfill a campaign promise. This is shameful; a clear lack of leadership from our Commander-in-Chief. https://t.co/kyUqFn5AjV","date":"Wed Aug 18 19:42:09 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud of my fellow airmen. Always aiming higher.","date":"Wed Aug 18 01:54:16 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Truth lost a powerful advocate today &amp; we lost a good man to the terrible disease of cancer. Sofia &amp; I extend our deepest condolences to Paul's wife &amp; six children. We will continue to keep them in our prayers during this difficult time. Rest easy, friend. https://t.co/xfSzKpzxsn","date":"Mon Aug 16 19:32:59 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We must act NOW: we need to make it clear to the Taliban that we WILL be evacuating all those we need to, as long as it takes.  They have never defeated us on the battlefield… they know that.  We are still the US, and fully capable.","date":"Mon Aug 16 18:13:19 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"By incentivizing American companies to return their manufacturing to the US, we will not only bolster our national security, but support good paying American #jobs. Proud to introduce the MADE Act &amp; look forward to moving this bipartisan bill forward. https://t.co/f6fZT4BMNv","date":"Wed May 19 18:35:43 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Mr. President, address the nation TONIGHT.","date":"Sun Aug 15 23:03:43 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today is devastating, but now we have to do whatever we can to help our allies on the ground &amp; push the WH to facilitate SIVs.\n \nTo ALL our servicemen &amp; women who sacrificed in #Afghanistan, we are forever grateful. Today does NOT erase our mission. https://t.co/m5H1fdy2ki","date":"Sun Aug 15 19:15:53 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A sad day for peace, stability, and security—both in Afghanistan and here at home. Taliban rule brings danger &amp; devastation to the Afghan people and welcomes in a safe haven for terrorists worldwide. Utterly disastrous &amp; entirely preventable.","date":"Sun Aug 15 17:25:11 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Devastating floods impacting our #IL16 community. Grateful for our first responders &amp; local leaders—&amp; to the @RedCross for coming in to help.\n\nOur thoughts are with the Gibson City residents as we continue to monitor the situation &amp; urge all those affected to please, be safe.","date":"Sat Aug 14 15:32:20 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The sad, damaging result of keeping a long-held campaign promise. \n\nThese devastating developments in #Afghanistan are hard to watch, and were entirely avoidable.","date":"Thu Aug 12 19:32:00 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A strong national #infrastructure is vital for our ability to compete globally, foster local &amp; regional economic development, and create jobs. Let's get this bill before the House so we can rebuild, improve, and fortify America's infrastructure. https://t.co/3DcB1KNxFg","date":"Thu Aug 12 12:51:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As I’ve said before, the Taliban could not be trusted—not now, not at any time. What we’re seeing is the brutal regime taking back control, with executions of our Afghan allies &amp; politicians. We must do more to protect our allies; our SIVs. And quickly. #Afganistan","date":"Mon Aug 09 22:45:17 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The Purple Heart is the oldest military decoration, created by Gen. George Washington on this day in 1782. \n \nOn this #PurpleHeartDay, we honor the bravery of our service members &amp; remember with gratitude all those who have sacrificed for this great nation.","date":"Sun Aug 08 01:32:05 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It was an honor to speak to the graduating class of Vance AFB last month, the very place where I trained to become a pilot. Being there was humbling &amp; encouraging--reminding me that no matter the challenges or battles ahead, we must always AIM HIGH. https://t.co/RvF4avxduY","date":"Thu Aug 05 18:31:30 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The Assad regime and Iran must immediately cease the brutal siege and their ongoing military operations against nearly 50,000 innocent civilians in #Daraa.  It’s time for the Biden administration to take action and end the ongoing atrocities in #Syria","date":"Tue Aug 03 00:34:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sofia &amp; I extend our deepest condolences to the family &amp; loved ones of Officer Hashida. May we never forget his service &amp; sacrifice, or the role he played in protecting our democracy on 1/6.\n\nThis tragedy reminds us the importance of accountability &amp; uncovering the whole truth.","date":"Mon Aug 02 20:23:32 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A big thank you to all of our #IL16 interns for their hard work &amp; flexibility over the last year. #TeamKinz is especially grateful to have such an incredible group here with us this summer! #NationalInternDay 👏 https://t.co/wEBwZP2J0f","date":"Thu Jul 29 22:05:54 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Those who want to see democracy fail are emboldened when politicians backtrack, point fingers, and spread conspiracies.\n \nWe stand ready to assist where we can in order to help restore trust in Georgia’s 🇬🇪 democracy. https://t.co/A6DFxEEzJj","date":"Thu Jul 29 15:39:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As I said today, we are only here now because these heroes and their fellow officers on the front line were here for us--and this country--on January 6th. Thank you hardly begins to cover it, but we are forever grateful &amp; we will never forget.","date":"Tue Jul 27 23:32:30 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We never imagined this could happen: an attack, by our own people, fostered and encouraged by those granted power through the very system they sought to overturn. But as I said in my opening remarks, these officers won—they held the line and defended our democracy. https://t.co/hYXV2aG0nj","date":"Tue Jul 27 18:52:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"America was attacked, and we deserve to know why and how it happened. This moment is bigger than all of us—the future of our country is on the line. And we must be fearless in our pursuit of the truth.  https://t.co/MU5YrEqOgf","date":"Tue Jul 27 13:33:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today, I was asked to serve on the bipartisan January 6th Select Committee and I humbly accepted. When duty calls, I will always answer. https://t.co/MszEBc0V7I https://t.co/flIdSfYzZV","date":"Sun Jul 25 16:10:04 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing #TeamUSA all the best in the #TokyoOlympics — with a special shout out to all of our #Illinois Olympians! 👏👏👏","date":"Sat Jul 24 18:12:23 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I’ve heard from hundreds of Illinoisans about the ongoing passport backlog at @StateDept &amp; it needs to be addressed immediately. \n\nOur bill will help get transparency for our constituents &amp; ensure access to this important service. https://t.co/LAUdaa2nEk","date":"Thu Jul 22 17:00:43 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The WH agrees #NS2 is a Russian malign project, yet they continue to support its completion. Talk is cheap when your actions allow Putin to undermine the transatlantic alliance. We must stand with the vast majority of the EU in opposing this pipeline. https://t.co/LuftgQ3GRR","date":"Wed Jul 21 16:04:22 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Another giant leap for mankind &amp; an incredible feat. 🚀\n\nToday, 52 years after the first humans walked on the moon in #Apollo11, we celebrate the #NSFirstHumanFlight.\n\nBig congrats to @JeffBezos &amp; crew! The future of our space exploration is looking bright.","date":"Tue Jul 20 21:13:52 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Hello @DamienDevdarian i want to be clear, Members of Congress and I would never refuse to meet with the Prime Minister.  We were not in DC that week, so it would have been impossible. https://t.co/I1G1wn8boK","date":"Mon Jul 19 01:40:25 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is completely false.  We were critical, and often.  Now, it appears progress is slipping away and GEO govt seems to be openly violating agreements. \n\nGaribashvili ‘Never Heard’ Europe, U.S. Criticizing UNM-Era Judiciary https://t.co/bR0ookSlre via @CivilGe","date":"Sun Jul 18 12:12:47 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The violence in #Afghanistan is devastating—it’s painful to watch the Taliban attack relentlessly &amp; know that they’ll continue the onslaught until they have full control. We must honor our promise to protect our allies who served alongside US troops &amp; officials.","date":"Thu Jul 15 00:06:48 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"To strengthen @NATO, we must expand.\n \nIn @TheEconomist, we argue welcoming democratic countries in the Asia-Pacific region will bolster our alliance &amp; help counter a rising China. When democracy is threatened anywhere, it harms democracies everywhere. https://t.co/pKHfwdD6tv","date":"Wed Jul 14 17:00:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is horrible—yet it’s the reality of announcing the U.S. withdrawal from Afghanistan. Removing the peacekeepers and leaving the Afghan people without support is a grave mistake, Mr. President. https://t.co/E379OE6b2O","date":"Tue Jul 13 13:55:23 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Human rights &amp; freedoms have been oppressed for much too long in Cuba. \n\nIt’s time the communist regime recognize the God-given rights of the Cuban people.  https://t.co/KxUsefWQTZ","date":"Mon Jul 12 14:21:10 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today marks six months since the insurrection at the @uscapitol. It saddens me that so many have refused to speak up about what happened, but I’m at peace with my choices—with telling the truth &amp; making sure we have a full accounting of the events of January 6, 2021.","date":"Wed Jul 07 02:40:58 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I have been monitoring the violence in Tbilisi, and stand by our embassy’s statement.  I am committed to discovering who was behind the violence on the LGBT community. America believes in freedom.","date":"Tue Jul 06 18:27:20 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Happy birthday to our 43rd President of the United States—my friend, George W. Bush! Here’s to another year of health and happiness, with plenty of love and laughter.\n\nCheers to 75 years, Mr. President! https://t.co/SBPGisOXId","date":"Tue Jul 06 17:55:47 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing you all a safe &amp; happy #FourthofJuly! Today we celebrate our great nation, this land of opportunity—we give thanks to the brave men &amp; women who served &amp; sacrificed to secure our freedoms &amp; protect our democracy. Here’s to 🇺🇸 as we strive to become a more perfect Union. https://t.co/13HXNG69yF","date":"Sun Jul 04 15:09:05 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This HFAC markup is disappointing. It does nothing to advance our national security or address the greatest threat to the US, to democracy, &amp; to human dignity around the world. Having these partisan fights on full display shows weakness to the #CCP--&amp; we must do better. https://t.co/EXrpJ4YLv0","date":"Thu Jul 01 17:36:52 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is a must watch video.\n\nWe cannot ignore what happened on January 6th; we cannot ignore what caused it. #TheBigLie \n\nReminder: The 2020 election was not stolen. \nhttps://t.co/tXF1rQlYNt","date":"Thu Jul 01 15:50:57 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Donald Rumsfeld, my friend &amp; fellow Illinoisan, was a true public servant who loved this country fiercely. \n\nMy wife Sofia &amp; I send our deepest condolences to his family &amp; loved ones. https://t.co/w47unFCx3b https://t.co/zIGhrklF7s","date":"Thu Jul 01 01:25:08 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As I have said before, we cannot let fear stop us from doing what is right. While I believe an independent bipartisan commission is the best approach, I voted today in support of establishing a Select Committee for January 6th--because the truth matters. https://t.co/MMCpP31eWp https://t.co/ZnJxRCZYRI","date":"Wed Jun 30 20:07:33 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Urging residents of Morris, IL to heed the evacuation orders from local authorities and to please stay safe while emergency crews work to contain this fire. My staff and I will continue to monitor this situation here in #IL16.","date":"Tue Jun 29 19:16:55 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A cyberattack occurs every 39 seconds. And since the pandemic, cyber crime has increased drastically. We must protect ourselves &amp; our interests--&amp; it starts with cyber education. Proud to lead this effort with my colleagues to help prevent future attacks. https://t.co/is6De639DS","date":"Fri Jun 25 14:18:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The Senator from West Virginia is more concerned about the #nuclear plants in Illinois than our own Governor. #NuclearMatters https://t.co/PMyOTkAmXC","date":"Thu Jun 24 21:09:27 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Counterfeit products are hurting both consumers and businesses. We have to take a stand, and in Congress, I'm working to better protect Americans' privacy and intellectual property by demanding more transparency in the products we download or buy online. https://t.co/tfJRNUZf2v","date":"Wed Jun 23 17:25:19 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"On #WorldRefugeeDay, #Assad was once again attacking civilians in NW #Syria, adding to his 500k deathtoll. His brutality has forced 6.6 MILLION Syrians to become refugees &amp; left another 5.2M displaced. We must hold war criminals like #Assad accountable. https://t.co/BvJdg8HfUX","date":"Mon Jun 21 20:46:13 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Great meeting with constituents from @HDSA to talk about legislation @BillPascrell &amp; I sponsor in the House, the HD Parity Act. \n\nIndividuals suffering from Huntington's Disease &amp; their families cannot wait any longer—it's time for Congress to pass the HD Parity Act! https://t.co/AVrqsKVi4A","date":"Thu Jun 17 15:07:20 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is shameful and embarrassing.\n\nWhat the men and women of our @CapitolPolice and @DCPoliceDept went through that day to protect and serve in the face of a violent mob—it deserves to be recognized with the highest honor the House can bestow.","date":"Wed Jun 16 12:58:55 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thank you to @usfirepump for this effort &amp; to the other 80 different fire departments for stepping in to help our #Rockton community. https://t.co/fJto68rpr6","date":"Tue Jun 15 21:41:13 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"From day one, I’ve said that Springfield needs to act to save our nuclear fleet. Their inaction thus far has been damaging to many across #IL16. We know nuclear energy is essential in #Illinois &amp; I'm urging the Statehouse to do what’s right. https://t.co/AR3Lt83hfm","date":"Tue Jun 15 13:12:53 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Spoke with the Lubrizol team this afternoon and will continue to stay updated on their Chemtool facility in #IL16. A big thank you to our emergency first responders for their tireless efforts to secure the area and keep residents safe.","date":"Tue Jun 15 00:45:54 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A scary scene this morning in #IL16. Mandatory evacuations have been ordered and emergency crews are on the scene now. My staff and I will continue to monitor the situation as we learn more about what happened, and we'll keep the Rockton community in our prayers.","date":"Mon Jun 14 15:43:04 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Serving on ⁦@HouseForeign⁩ is a privilege—one that ⁦@Ilhan⁩ does not deserve. She has doubled down on equating the US &amp; Israel with terrorist organizations. These views are damaging &amp; dangerous—leadership cannot turn a blind eye any longer. https://t.co/h3mqrbvFpM","date":"Fri Jun 11 21:48:05 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"One of the best ways to protect America's supply chains and create jobs--while also addressing the root cause of migration--is to pass the MADE in the Americas Act. @VP 👀👇 https://t.co/lbEvGJci25","date":"Tue Jun 08 17:06:27 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"By waiving sanctions on NS2, downplaying the concerns of our CEEC allies, &amp; appeasing Putin as his cyber warriors attack the US, the Biden Admin has further emboldened authoritarians around the world. Can’t rebuild transatlantic partnerships this way. https://t.co/mizlcSTfZe","date":"Mon Jun 07 14:53:30 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"There’s a reason we call them the #GreatestGeneration and today, we remember their sacrifices in service to our nation on this day in 1944. \n\nThank you @NormandyInst for allowing me to share about my hero, Harry Kinzinger, in this #DDay77 tribute. https://t.co/4UpUe7PCH0","date":"Sun Jun 06 15:56:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"With 4 nuclear generating stations in #IL16, the delays in Springfield have serious implications on my constituents. In order to save Illinois’ clean energy future, we must save #nuclear. \n\nLearn more about my bill to do just that: https://t.co/oUKZRXqFQn","date":"Fri Jun 04 20:42:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Congrats to Noah Johnson from #IL16 on this very cool recognition from @NFLFootballOps—what a great tackle! Can’t wait for school sports to return in full this fall.","date":"Tue Jun 01 19:30:32 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We are the land of the free because of the brave. 🇺🇸\n\nOn Memorial Day, we remember those courageous men and women who made the ultimate sacrifice for this great nation. #HonorThem https://t.co/EFVve0ZeIO","date":"Mon May 31 13:26:30 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"After murdering 600,000 Syrian men, women, and children—and forcing 6 million to become refugees—it’s clear the Syrian people need change. This sham election means nothing. #AssadMustGo #FreeSyria https://t.co/Ps6OAXTkXE","date":"Sat May 29 17:17:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is why we need a January 6 commission. Four months after an insurrection at the Capitol, we’re hearing this language at another rally where so-called “leaders” are stoking fears &amp; anger and inciting violence.","date":"Fri May 28 14:18:24 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing our friends in Georgia 🇬🇪 all the best has they celebrate 30 years of regained independence this week. Proud to support their sovereignty and continued efforts for an enduring democracy. https://t.co/Tjpie0aj2y","date":"Thu May 27 15:26:18 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"While we disagree on the withdrawal from #Afghanistan, we can all agree that it would be wrong to abandon the Afghan men &amp; women who supported the US mission for nearly two decades--doing so would be a death sentence. We cannot leave them behind. https://t.co/NYiuzaz2oH","date":"Wed May 26 15:15:12 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just another example of an authoritarian trying to rewrite the rules of the road. The US and our allies must hold the Lukashenko regime accountable for the hijacking of a commercial airliner, and demand the release Roman Protasevich.","date":"Mon May 24 14:06:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"By incentivizing American companies to return their manufacturing to the US, we will not only bolster our national security, but support good paying American #jobs. Proud to introduce the MADE Act &amp; look forward to moving this bipartisan bill forward. https://t.co/f6fZT4BMNv","date":"Wed May 19 18:35:43 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I support a bipartisan January 6 commission. This should not be about party politics or become a partisan fight. It needs to be focused on truth and accountability. https://t.co/IL9oCYs2WL https://t.co/EeHnxJbTBz","date":"Tue May 18 17:43:05 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As a pilot, I love seeing the incredible feats in space exploration like the #MarsRover landing. So as a Congressman, I was thrilled to bring @NASAMars to #IL16 students—and we couldn’t be more grateful to Ann &amp; her team for making this event possible. https://t.co/Ip36T4svKn","date":"Mon May 17 23:55:02 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"You cannot unify a lie with truth. If you pretend like January 6th didn’t happen or if you pretend like the 2020 election was not legitimate, you are at direct odds with the truth. Discussing this &amp; more with @MeetThePress now, so be sure to tune in.","date":"Sun May 16 13:31:50 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Throughout the pandemic, our officers have continued to protect &amp; serve our communities, putting their lives on the line to keep us safe.\nThis #NationalPoliceWeek, a special thank you to all who serve in #IL16 &amp; all who defend our democracy here at @uscapitol. We appreciate you. https://t.co/KdyKULVs5S","date":"Thu May 13 15:56:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Israel has the right to defend itself. And should.\n\nAs Hamas continues to target civilians, the US must stand with our allies in the fight against terrorism. These indiscriminate attacks must stop &amp; I'm hopeful that cooler heads will prevail to deescalate this tragic situation.","date":"Thu May 13 00:17:02 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is leadership. \nThis is integrity.\nThis is Liz Cheney.\n\nAnd I’m damn proud to support her.","date":"Wed May 12 00:38:49 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I’m committed to telling the truth and pushing back on the conspiracy theories being peddled to the American people. \n\nThank you @PressClubDC for the opportunity to discuss this and the other major issues we’re facing as a nation. https://t.co/VtSB2QYkQq","date":"Mon May 10 18:11:40 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Horrific and a grim foreshadowing of the future in Afghanistan. Doesn’t take much to imagine what will happen when the US is gone...\n\nThe Taliban regime will restart their war against women, denying them basic human rights, setting the country back in deeply oppressive ways.","date":"Mon May 10 13:03:49 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Look forward to chatting with @jdickerson in about 5 minutes on #FaceTheNation. We’ve got plenty of things to cover, so be sure to tune in!","date":"Sun May 09 14:55:28 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"For all the love and support, patience and understanding, and so much more—thank you, Mom.\n\nWishing all the incredible moms out there a very Happy #MothersDay! https://t.co/tspOeL6Xbi","date":"Sun May 09 13:18:01 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud to introduce the REDUCE Act to help borrowers pay back their student loans quicker with a simple change, made in a responsible way. Learn more about my bipartisan bill with @RepStephMurphy here: https://t.co/6fvV7Ahz3k","date":"Fri May 07 14:58:19 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A must read letter from Officer Michael Fanone to Congress on his firsthand experience protecting the Capitol Complex on January 6, 2021. \n\nThe attack on the Capitol happened. It cannot be ignored or denied. And the officers on the front lines are heroes. https://t.co/xOlqH2Mzwj","date":"Wed May 05 18:56:58 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Leaving Afghanistan without a plan is reckless and undermines the many sacrifices of our military over the last 20 years, putting us all at greater risk.\n\nWe need to learn from our mistakes—not repeat them. https://t.co/lHHKoMzGyq","date":"Sat May 01 13:35:13 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing my colleague @RepCheri all the best in her next steps. We’ve worked together over the years to create #jobs in Rockford and put the interests of the community first. I’ve appreciated her shared commitment to a better political dialogue and her dedication to service.","date":"Fri Apr 30 18:58:55 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Marty was not just a trusted confidant, he was also a friend. His passion for his work was only surpassed by his love for his family and devotion to his community. With deepest sympathy, Sofia and I extend our prayers and heartfelt condolences to the entire Ozinga family.","date":"Fri Apr 30 00:50:46 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/jtVBuR79q9","date":"Thu Apr 29 18:54:37 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"How can we #DefendDemocracy and meet the challenge of Putin’s Russia head on? Thrilled to join @McCainInstitute #SedonaForum21 for such an important discussion today. https://t.co/ThwcUulww3 https://t.co/iPFoyKNcBT","date":"Wed Apr 28 20:38:21 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Final week to submit your 2021 Congressional Art Competition pieces! Looking forward to seeing the talent and creativity of our #IL16 students. More info can be found on my website here: https://t.co/3eDLFPB8nS https://t.co/oIItMRhz6D","date":"Tue Apr 27 15:52:44 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"After 7 years of population loss, not surprising that Illinois lost a House seat. High taxes, runaway regulatory environment &amp; corruption in Springfield play a major role in that decline. Here’s hoping @GovPritzker will honor his ‘fair maps’ promise for redistricting. #Census2020","date":"Mon Apr 26 20:40:05 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Rising drug costs is a top issue for my #IL16 constituents. We must ensure patients are getting the most affordable option &amp; that our policies encourage competition to drive costs down. Proud to partner w/ @RepSchrader on the BIOSIM Act to do just that. https://t.co/VSRvUMFA6d","date":"Fri Apr 23 20:37:23 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Celebrating #EarthDay here in Congress by introducing legislation that promotes clean mineral resourcing &amp; technology innovation. Learn more about our effort to lower our carbon footprint &amp; global emissions with a diverse source of CLEAN energy: https://t.co/0fZdgYmemO","date":"Thu Apr 22 21:05:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We need to address the underlying issue of the #DCStatehood debate: representation. It’s something I believe needs to be remedied. \n\nMy full statement on this issue can be found here: https://t.co/A1IAe6qpTD","date":"Thu Apr 22 15:00:12 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Once again, the Russian people are in the streets demanding more from their government. For the good of the Russian people, the Kremlin must end their malign activity &amp; release all those wrongfully detained. #FreeNavalnyNow #FreeTrevorReed #FreePaulWhelan https://t.co/3te2JVb629","date":"Wed Apr 21 15:37:45 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Energy diversity IS energy security. We need to have bipartisan conversations on the future of our national energy strategy, especially surrounding #nuclear power. Read my full remarks from today's #Energy hearing here: https://t.co/cdja16m3Mu","date":"Tue Apr 20 22:09:45 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I can confirm, these memorials are a must-see when you’re in #DC. 🇺🇸\n\nIn the meantime, you can view many of these &amp; other @NatlParkService sites virtually. I’ve shared some information &amp; links on my website here: https://t.co/FZy2dnjyjX","date":"Mon Apr 19 21:22:23 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"When elected Members of Congress advocate for more bigotry &amp; divisions, we must stand up and call it out. When Members of Congress advocate for more anger and confrontations, we must call that out, too. \n\nIt’s wrong, dangerous, &amp; damaging to our institution—&amp; our communities.","date":"Mon Apr 19 17:22:59 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today marks 100 days since the violent insurrection at the U.S. Capitol. It's a day we'll never forget; a day that democracy was attacked &amp; a day when our democracy held. Defending our Constitution &amp; the freedoms we hold dear is critical to the enduring spirit of our republic.","date":"Fri Apr 16 17:02:46 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I support WH sanctions on Russian officials for their attack on our democracy, but I’m dismayed at the failure to implement sanctions on Nord Stream 2--a Kremlin malign influence project. I urge @POTUS to stand up to Putin &amp; fully apply the NS2 sanctions. https://t.co/2hSQD7x8VC","date":"Thu Apr 15 17:27:10 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"To listen to our recent tele-townhall with @ChiMedSoc, please tune in here on my YouTube channel. We'll look forward to having another one soon, focusing again on #CovidVaccine questions. https://t.co/hUlkTquvTs","date":"Thu Apr 15 12:43:44 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A shortsighted decision and a grave mistake. Here's why protecting stability in Afghanistan helps protect American security, and why I believe this moment is more important than politics: https://t.co/lHHKoMzGyq","date":"Wed Apr 14 19:18:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The situation on the eastern border of #Ukraine and #Crimea is deeply concerning as we witness another Putin provocation. The US and #NATO must stand in support of our allies, and urge the Kremlin to end this aggressive escalation.","date":"Mon Apr 12 21:45:25 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Chief O’Shea @RockfordPD has been a stalwart in our community these last five years, and I’m incredibly grateful for his service and friendship. His leadership and dedication has made a lasting impact in Rockford, and on behalf of #IL16, I wish him all the best.","date":"Sun Apr 11 17:46:47 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Trevor Reed is a former US Marine &amp; TX native who was wrongfully detained in Russia &amp; sentenced to 9 years in prison--all on baseless accusations &amp; trumped up charges. Today, marking 600 days of his unjust imprisonment, I stand with his family &amp; call on Putin to #FreeTrevorReed. https://t.co/2iUNZN5zT1","date":"Wed Apr 07 19:39:23 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"“Greater love has no one than this, that someone lay down his life for his friends.” - John 15:13\n\nFrom my family to yours, may you have a healthy, happy, and most blessed Easter.","date":"Sun Apr 04 18:07:47 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Please join me in praying for our Capitol Police officers and first responders as we continue to learn more about what’s happened.","date":"Fri Apr 02 17:38:57 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Some of you may be celebrating #AprilFoolsDay, but here in Illinois, we’re singing “Surrender” &amp; rocking out to our local hall of famers on this #CheapTrickDay. No joke, it’s real &amp; we’re very Rockford proud of it. 🙌 #IL16 @CheapTrickRick https://t.co/tkZRJ2Nu5C","date":"Thu Apr 01 20:19:30 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"To all our doctors working tirelessly to care for us &amp; get us through this pandemic, THANK YOU! Special thanks to @ChiMedSoc who joined our tele-townhall last night to answer #IL16 q's about the #COVID19 vaccine. So grateful to our doctors on #NationalDoctorsDay &amp; every day.","date":"Tue Mar 30 22:14:10 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@jwharris Please send him my gratitude as well!","date":"Tue Mar 30 20:12:41 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s hard to put into words what the Vietnam Vets mean to servicemen like me--&amp; to America. They faced harsh conditions overseas &amp; sadly, here at home. On this #VietnamWarVeteransDay &amp; always, they deserve our utmost admiration &amp; gratitude. May we never forget their sacrifice. https://t.co/8jUU9PDIFu","date":"Mon Mar 29 20:38:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Millions of Burmese people are demanding the Junta step down. As they fight for their democracy, they are met with brutal tactics &amp; bullets. We cannot allow authoritarianism to spread; we need to stand up for a free &amp; democratic Burma. https://t.co/jh1HDCd4UU","date":"Sat Mar 27 18:27:43 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We’ve reached an inflection point &amp; it’s time to change course. I’m choosing hope &amp; optimism—a future first mission that celebrates who we are as Americans &amp; sees the endless possibilities we have if we recognize our failures &amp; vow to do better. ⁦ https://t.co/WNq7YuMhp2","date":"Sat Mar 27 00:19:11 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As we mark Belarus Freedom Day, I commend the thousands of men, women, &amp; children demanding a better tomorrow. Through determination, you will show the Lukashenko regime that they cannot silence your God given right to self-determination &amp; freedom. We #StandWithBelarus.","date":"Thu Mar 25 13:20:52 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As we mourn the lives taken in the senseless crimes in Atlanta and Boulder, we find hope in people like Officer Eric Talley—a true hero, who courageously and selflessly gave his life to save the lives of others. \n\nMay his service &amp; sacrifice never be forgotten.","date":"Wed Mar 24 18:50:28 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Starting today, my office will begin accepting submissions for the 2021 Congressional Art Competition. All high schools students from #IL16 are encouraged to participate. Looking forward to seeing the incredible talent &amp; creativity! \n\nFor details 👉 https://t.co/1wVQztcL9Q https://t.co/vMJptajzhm","date":"Wed Mar 24 17:26:03 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I’ve worked the southern border in the Guard &amp; I’ve seen the issues firsthand. Encouraging people to make this dangerous journey is wrong &amp; shortsighted. We need to enforce our border policies to ensure safety &amp; humanity for all. This is a crisis &amp; as a nation, we need to fix it.","date":"Tue Mar 23 13:36:21 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A strong American infrastructure is vital for us to compete globally, foster local economic development, &amp; create jobs. The #COVID19 pandemic showed the weakness in our broadband, especially in rural areas like here in IL. We must close the digital divide. https://t.co/cJtT2Hei0h","date":"Mon Mar 22 20:48:22 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Russia is not our ally; Putin is a murderer. He’s a tyrant who targets freedom-loving people &amp; their elections. He helped Assad kill over 50k children in Syria &amp; tortured activists in Belarus. He sows chaos &amp; acts with impunity across the globe.\n\nI’m rooting for America, always.","date":"Mon Mar 22 14:16:09 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Bipartisanship is critical in delivering results for the American people &amp; shows a shared commitment to putting the interests of the country first, for the greater good. Thank you to @BPC_Bipartisan for their recognition this year. https://t.co/znuFCi6T1G","date":"Wed Mar 17 01:24:58 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A decade of war in #Syria because of Bashar al Assad. His brutality has killed over 400k Syrians &amp; displaced millions. #Assad has targeted hospitals, used chemical weapons on children &amp; tortured countless civilians. It cannot be ignored; it must be a priority. @RepBrendanBoyle https://t.co/cWEx6Jner9","date":"Mon Mar 15 22:55:36 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This kindness is reaffirming. Yes, we disagree, but we still join together for the greater good. And that’s important. We have to be able to see the humanity in one another. If we can do that, if we can put the country first, then we can leave this world better for the future.👍","date":"Fri Mar 12 19:36:01 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today, I was reminded of that light--the goodness in the world. My Ottawa office has received over 235 cards for our veterans—and counting! I’m humbled &amp; blown away by this support for our #IL16 Veterans Card Drive &amp; want to thank everyone who has participated.👇 https://t.co/iNKVNaYdvh","date":"Fri Mar 12 19:36:00 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s an understatement to say that the last year has been tough. One year ago, offices/schools/businesses closed &amp; the reality of this pandemic came at us full force. Through tragedy &amp; hardship, the American spirit has been resilient—finding ways to see light in the darkness.👇","date":"Fri Mar 12 19:35:59 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Right now, 95% of Russia’s malign #NS2 pipeline is finished. The @StateDept must work on this NOW with Denmark and Central &amp; Eastern European countries to forcefully end #NordStream2. Failure to do so will give Putin his crown jewel &amp; the control he craves. https://t.co/In7EPuWLKz","date":"Thu Mar 11 21:18:18 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The vast majority of Americans believe in universal background checks. As a gun owner myself, I firmly support the Second Amendment but I also believe we have to be willing to make some changes for the greater good. \n\nRead my full statement on #HR8 here: https://t.co/UcrOJt8A0M","date":"Thu Mar 11 17:37:44 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Rural hospitals are critical in communities across #IL16 and the country. As we continue to battle #COVID19, we must take swift action to protect the critical healthcare infrastructure providing care in our rural communities. https://t.co/LsCsEyEris","date":"Thu Mar 11 15:22:36 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We owe it to the American people to WORK TOGETHER in doing everything we can to get them the #COVID relief they need. Bipartisanship is critical in effective legislating. \n\nPlease take the time to read my full statement on today's vote here: https://t.co/Ci0K3GERk3","date":"Wed Mar 10 20:35:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Glad to see our Lithuanian partners taking strong action against the corrupt CCP. I urge other central and eastern EU countries to join in standing for human rights in Hong Kong, Taiwan, and Xianjing. https://t.co/s4k0ARpqgm","date":"Wed Mar 10 18:16:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"For 10 YEARS, #Assad has committed horrific war crimes against the Syrian people. His relentless torture &amp; chemical weapon &amp; barrel bomb attacks on civilians cannot go unchecked. @POTUS #SpeakToSyrians &amp; act to hold Assad accountable. I nominate @RepBrendanBoyle &amp; @BarackObama.","date":"Wed Mar 10 03:31:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Perpetuating &amp; allowing this misinformation is reckless.\n\nThe truth: 76 million doses administered in the U.S. &amp; reports of death among 0.0018% of people after being vaccinated. As the @CDCgov has said there is \"no evidence that vaccination contributed to patient deaths.\"","date":"Tue Mar 09 16:25:50 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This #InternationalWomensDay, let’s celebrate programs like One Community Dreams in Malawi that supports girls’ education &amp; safety. \n\nIn Congress, I’m proud to cosponsor the Safe from the Start Act to address the needs of women &amp; girls in humanitarian crises around the globe. https://t.co/5tdvfdP5pn","date":"Mon Mar 08 22:10:04 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"My condolences are with the Price family. This is a tragic story, but one that needs to be shared as we continue to learn about #COVID19. A recent Oxford study found that almost 1 in 5 people with the virus receive a psychiatric diagnosis within 3 months. https://t.co/f0m6bimZMY","date":"Mon Mar 08 17:17:24 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just saw that today is a #NationalDayofUnplugging—a great reminder to take a step back &amp; reset. It’s important we recognize the toxicity on social media &amp; unplug that rage machine—a sentiment I shared back in May re: misinformation, lies, &amp; #QAnon: https://t.co/mapxGSlH3n","date":"Fri Mar 05 19:57:06 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Any occasion to celebrate our veterans is a good one--&amp; what better day to show how lucky we are to have our hometown heroes than on St. Patrick’s Day. ☘️\n \nPlease join me in participating in our #IL16 Veterans Card Drive. More details here: https://t.co/yf3op1th89 https://t.co/BG0NH5RgjA","date":"Thu Mar 04 21:17:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"China continues to take freedom from Hong Kongers, among millions of others. The authoritarian rule from the Communist party is denying basic human rights, punishing pro-democracy citizens, &amp; acting with more impunity than ever before. The WH needs to wake up to this threat.","date":"Thu Mar 04 15:22:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As we celebrate #ReadAcrossAmericaDay, let’s join #DrSeuss &amp; show kids \"when the voting is done, we are all still good friends—one for all &amp; all for one!\"\n\nBefore you peddle lies about a 'stolen election,' think about what it teaches our children.\n\nWe have to do better. https://t.co/mCBI46eUbo","date":"Wed Mar 03 01:51:11 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Always great to chat with @CaptainCons about my love for the Band of Brothers &amp; @UncleChaps.👍\n\nListen to our full conversation on @ZeroBlog30 about how our military days shaped our world views (&amp; our ability to disagree respectfully) &amp; how fear is destroying politics today.","date":"Tue Mar 02 19:36:46 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Congratulations to @RockfordFire Chief Derek Bergsten on being named Illinois Fire Chief of the Year. Thank you for serving the people of Rockford with such dedication &amp; courage. We’re proud to have your leadership in #IL16. https://t.co/9mJvc0zpC2","date":"Tue Mar 02 16:28:23 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Happy election day to the people of #ElSalvador!  Remember your rich history filled with victories over adversity that have threatened your democracy. Reject leaders that put their self interest first and denounce the politics of intimidation to defend the rule of law.","date":"Sun Feb 28 18:33:38 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JimHendren1 @usairforce Thanks for your service Senator","date":"Sat Feb 27 21:33:06 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"2) notice though they don’t blame antifa and BLM when they celebrate.","date":"Sat Feb 27 19:41:16 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"“Patriots pulling’ up knockin’ at the Capitol..”.  Sick.  The rot is deep.  #RestoreOurGOP","date":"Sat Feb 27 19:39:56 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I’m with Boehner here.  #RestoreOurGOP https://t.co/kNC4oYFxkP","date":"Sat Feb 27 06:03:59 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"“If there’s one thing the Republican Party has been good at, it’s snatching defeat from the jaws of victory.”  @DonaldJTrumpJr today at CPAC.  Yep, I agree. (Post Trump- GOP minority in senate, house, and lost the presidency.)  #RestoreOurGOP","date":"Sat Feb 27 04:25:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Idol worship isn’t conservative. #RestoreOurGOP https://t.co/ornxg6D8GU","date":"Fri Feb 26 17:56:21 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Rep. Miller put a militia sticker on his car and is suspected to have been at the insurrection. Our party needs to handle this and I support further investigation. #RestoreOurGOP #CountryOverParty","date":"Fri Feb 26 17:50:52 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Seven years ago today, Putin’s little green men occupied Crimea. It is time the US &amp; Europe take Vlad’s malign operations seriously. We must restore Ukraine’s sovereignty and stop the Nord Stream 2 pipeline. https://t.co/E0nWI8rDnh","date":"Fri Feb 26 16:37:08 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Debate issues like adults.  See the humanity in people, and treat them as you would like to be treated.  We all have to do better, and I will try to do my best to model that,","date":"Fri Feb 26 02:18:17 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Serenity_Sleeps @RichMass @CaptainCons @ZeroBlog30 @mtgreenee I definitely am not an enable of hers.","date":"Thu Feb 25 20:10:49 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@KeithBr61061175 @FarvaRodneyy @CaptainCons @ZeroBlog30 Ha I’ll take it.  Thanks Keith and stay warm somehow","date":"Thu Feb 25 20:10:21 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Spare me.  Face of a real warrior in politics @RepLizCheney https://t.co/hTBAJYEsfq #FoxNews","date":"Thu Feb 25 20:08:33 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@AndrewDevoss @CaptainCons @ZeroBlog30 That would confuse my wife too much, right @sofiakinzinger","date":"Thu Feb 25 20:00:43 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@emmykayandco @CaptainCons @ZeroBlog30 Keeping up the reputation started in 1908!","date":"Thu Feb 25 20:00:06 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JohnArtist14 @CaptainCons @ZeroBlog30 Thanks brother","date":"Thu Feb 25 19:59:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@SeanPS14 @CaptainCons @ZeroBlog30 https://t.co/oOCviiTLLO","date":"Thu Feb 25 19:58:27 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@beastofhumble @CaptainCons @ZeroBlog30 Send in resume!","date":"Thu Feb 25 19:56:57 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@AndrewDevoss @CaptainCons @ZeroBlog30 Why yes i am!","date":"Thu Feb 25 19:56:24 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@beastofhumble @CaptainCons @ZeroBlog30 Thanks!","date":"Thu Feb 25 19:55:52 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@CaptainCons @ZeroBlog30 Ask him if he’s a pilot","date":"Thu Feb 25 19:51:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@SeanPS14 @CaptainCons @ZeroBlog30 Dude yes.  Chillin on the moon would be outta this world (cue rimshot)","date":"Thu Feb 25 19:50:54 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s outrage for fame at the cost of human lives and sorrow.  We can debate issues like adults without reverting to “owning the (fill in the blank).”  We have to demand better of leaders.","date":"Thu Feb 25 19:49:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@FarvaRodneyy @CaptainCons @ZeroBlog30 I’m ok with it.  I just think state by state issue like i think the drinking age should again be.  But i support lifting banking blocks and allowing VAs to prescribe","date":"Thu Feb 25 19:47:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JustBlazer1989 @CaptainCons @ZeroBlog30 Ya it’s a process to present a competing vision. Trump seemed unthinkable a few years ago, maybe inspiration will likewise trend?  Summer will be a decent mile marker on trends","date":"Thu Feb 25 19:46:46 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@RichMass @CaptainCons @ZeroBlog30 @mtgreenee Those are all just floor games.  Stupid ones","date":"Thu Feb 25 19:45:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@sparta840 @CaptainCons @ZeroBlog30 @GOP They rarely succeed. Hopefully we can make the GOP great again (by inspiring and addition and ideas, not people)","date":"Thu Feb 25 19:44:53 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@mikestumpf_ @CaptainCons @ZeroBlog30 We address in the podcast.","date":"Thu Feb 25 19:44:06 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Razhole @CaptainCons @ZeroBlog30 It has an effect, but we should all focus on how to inspire, be adults, and think 21st century solutions and not worship people","date":"Thu Feb 25 19:43:49 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@abduncan4 @CaptainCons @ZeroBlog30 There are great organizations out there, but careful of the grifters and focus on those elevating dialogue. With honor is good","date":"Thu Feb 25 19:43:00 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@SeanPS14 @CaptainCons @ZeroBlog30 Yes.  Major Smith-Zinger","date":"Thu Feb 25 19:41:13 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@jholder43 @CaptainCons @ZeroBlog30 I’m in the Air Force.  I don’t know how DS’s yell","date":"Thu Feb 25 18:49:02 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JustBlazer1989 @CaptainCons @ZeroBlog30 Hopefully not much longer till we change the party to inspiration again","date":"Thu Feb 25 18:47:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@jholder43 @CaptainCons @ZeroBlog30 He’s a jerk","date":"Thu Feb 25 18:46:54 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@adam144001 @CaptainCons @ZeroBlog30 I’m working hard for that to be a NO.  State has to step up tho","date":"Thu Feb 25 18:46:25 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@SeanPS14 @CaptainCons @ZeroBlog30 Kinzinger force.  Cuz","date":"Thu Feb 25 18:45:56 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@thatguy0915 @CaptainCons @ZeroBlog30 Cons can’t cook","date":"Thu Feb 25 18:45:41 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The @CDCgov guidelines say it’s safe for students to return to in-person learning &amp; yet schools across the country remain closed. Every day that goes by without our students in the classroom is another day students fall further behind. It's time to go #BackToSchool.","date":"Thu Feb 25 18:07:31 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@senatorshoshana @RepMeijer Will be a podcast later!","date":"Thu Feb 25 17:55:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@joshuaicore Not if these future ones ever make it: wait never mind you win https://t.co/1rq07Ha7MM","date":"Thu Feb 25 15:47:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Of quality of life and better hair products there can be no debate. https://t.co/5QENIYVWix","date":"Thu Feb 25 15:44:12 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Johnny_Joey The challenge for this country isn’t any election.  It’s the fact that we hate each other, and pledge to tribes instead of nations.  That needs called out clearly, and that’s what i will do.  You’re a good man brother hope to see you again soon.","date":"Thu Feb 25 02:44:09 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Op-ed: An Unexpected GOP Impeachment Hero https://t.co/YNU7t2PgrU","date":"Thu Feb 25 02:41:45 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Johnny_Joey I do agree.  Be adults.  Escalation for attention will solve nothing and it’s why our system is so broken.  But it’s temporary, we will become normal again, stakes are too high","date":"Thu Feb 25 02:26:45 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is sad and I’m sorry this happened.  Rep. Newmans daughter is transgender, and this video and tweet represents the hate and fame driven politics of self-promotion at all evil costs. This garbage must end, in order to #RestoreOurGOP","date":"Thu Feb 25 01:57:02 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Important must-read thread from @RepFredUpton 👇👍","date":"Wed Feb 24 21:24:31 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Next step in the whitewash: “who is this ‘Q’ of which you speak? There is no website!” Deny, plead ignorance, misdirect... is there any question why people are confused?   Quit lying, accept reality and use your energy to make us a better country.  #Country1st #restoreourgop","date":"Wed Feb 24 02:32:50 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It's disgraceful for a sitting Senator to spread disinformation so blatantly. It's a disservice to the people he serves to continue lying to them like this. It's dangerous and it must stop.","date":"Tue Feb 23 23:03:38 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Incredibly Dumb move by Georgian Government against a legitimate political party.  Sad day for democracy in the Country of Georgia.","date":"Tue Feb 23 13:48:27 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I watched this raid live.  As the Co-chair of the Country of Georgia caucus, I am very concerned.  We just introduced again the Georgia Support Act.  That is not something that is automatic.","date":"Tue Feb 23 04:57:40 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is a very concerning move by the Govt of Georgia. Given the tense situation, I call on the Govt to stand down from this dramatic action.  We are all watching.","date":"Tue Feb 23 04:47:19 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It's time to put down the pitchforks &amp; get serious about the future of America's energy strategy. It will require thoughtful debate &amp; compromise—for the sake of the country &amp; our future. Read my letter to @POTUS (w/ @michaelcburgess @RepDanCrenshaw) here: https://t.co/YqUdzgEuio","date":"Tue Feb 23 01:05:03 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Why is Governor Pritzker slow-walking a $2 billion investment in our state that would create thousands of good paying jobs? This development has bipartisan support  AND provides a solution for traffic problems. It's a no brainer. https://t.co/HwRmcSemMX","date":"Mon Feb 22 21:03:08 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"America should never coddle evil.  \n\nTrump offered North Korea's Kim a ride home on Air Force One: report https://t.co/xOPZdjYCrp","date":"Sun Feb 21 22:39:45 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/kcRuzatFVI","date":"Sun Feb 21 16:05:51 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"74 million vote Trump.  81 million vote Biden.  Biden won by same electoral vote margin Trump won by in his 2016 “landslide.” My district: 65% for Kinzinger, only 56% for Trump.  Its clear, Trump lost, to win again we need not embrace him, but move on from him, and NOW.","date":"Sun Feb 21 16:01:10 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Jeanhively1 Yes.  I do believe that","date":"Sun Feb 21 15:44:59 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Good party, a good #censurefrenzy !!","date":"Sat Feb 20 14:35:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"#CensureFrenzy! https://t.co/YNMNsZQRs6","date":"Sat Feb 20 01:09:14 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Why do the hard work though, when you can have more fun by joining the #censurefrenzy ?!?!","date":"Sat Feb 20 00:53:14 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@LouiseMensch Hahahahah","date":"Fri Feb 19 22:42:17 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@chlorineshrimp Honor is forged in youth.  He’s and others like him, are the future of our honorable Republic","date":"Fri Feb 19 19:03:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just for reference this is the “only thing evil needs to prevail is good men to do nothing...” guy.","date":"Fri Feb 19 19:00:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A Republic: https://t.co/Zy246EjZnJ","date":"Fri Feb 19 18:21:51 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@RexHaskell Hahah no.  I’m not","date":"Fri Feb 19 17:27:06 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Great Idea!  Just say that (organization) censures (fill in name) for “believing that Trump lost”; that “The insurrection wasn’t by Democrats” and “thinking independently”.  Charge a dollar per copy and we can be rich!","date":"Fri Feb 19 17:15:00 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@DavidJamesHill Uh.  Wasn’t in it","date":"Fri Feb 19 04:59:10 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Given that i don’t represent any area within hours of here, I have concluded that the Madison GOP feels sad they haven’t been able to join the #censurefrenzy of everyone in the world.  #restoreourGOP","date":"Fri Feb 19 04:56:03 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Gunny60 Thank you!","date":"Thu Feb 18 22:52:14 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@REDVICTORY3 https://t.co/sG6VdH2rGU","date":"Thu Feb 18 22:51:40 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Congrats @NASA !!  Next step, can we fly a helicopter on Mars?  Stay tuned!  #merica #science #MarsLanding #notChina #norRussia","date":"Thu Feb 18 22:43:05 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"And they’re back... because they simply cannot and will not accept reality. Their refusal to admit this is all a hoax speaks volumes about the cult mentality of QAnon. It’s dangerous and damaging to our democracy.","date":"Thu Feb 18 18:49:01 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is really something we need to understand:  anti-semitism is rampant, repugnant, and needs to be called out.  Good work @RepRiggleman","date":"Thu Feb 18 16:59:16 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@vatrfv @RepRiggleman Thanks for your leadership!","date":"Thu Feb 18 16:49:41 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@MagillicuttyB @mtgreenee https://t.co/6HQmG70vKm","date":"Thu Feb 18 16:48:31 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TammyHumphries7 @mtgreenee So now it’s 80 million?  Creeps up there","date":"Thu Feb 18 16:48:02 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@mtgreenee https://t.co/D9nUo8oX1v","date":"Thu Feb 18 16:40:33 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@yesnicksearcy https://t.co/lSZ9mHsflg","date":"Thu Feb 18 03:04:38 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thanks for sharing, I’m sorry this happened. \n\nAdam Kinzinger, I Can Relate: When Politics Divides Families https://t.co/R0IpRVqEZ6","date":"Thu Feb 18 02:43:49 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Remember:  the hurricane was always going to hit Alabama too. Act natural they won’t notice.  #sharpiegate https://t.co/EcFpeBCoee","date":"Wed Feb 17 21:00:56 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@rreactor I never lost but Trump did.","date":"Wed Feb 17 20:32:49 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Trump lost.  Every Republican politician needs to say this. https://t.co/R14O4dZMGL via @businessinsider","date":"Wed Feb 17 19:53:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"And a big thank you to an incredible leader who I’m proud to call a friend: @LarryHogan. Appreciate your kind words in this #TIME100NEXT piece more than I could say!","date":"Wed Feb 17 17:33:19 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I’m humbled by this recognition &amp; honored to be named to TIME100 list of influential people for 2021. We need leadership in this country, and I'm at peace with my decisions &amp; the risks that come with standing for what is right. Thank you, @TIME. https://t.co/rDNFsudKli","date":"Wed Feb 17 14:16:37 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@LarrySabato @sjta_amy @NewYorker @BorowitzReport I’ll go ahead and pencil this in!","date":"Tue Feb 16 20:10:25 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Uh What?   Must have been in a different insurrection than I was. https://t.co/BICvN2sCrM","date":"Tue Feb 16 18:10:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Amen.","date":"Tue Feb 16 03:35:53 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@reidepstein Before it was trendy....","date":"Tue Feb 16 01:01:58 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thank you, @GretchenCarlson I’m ok, more sad that someone would be willing to choose a man over family.  And sad that it’s happening to so many.","date":"Tue Feb 16 00:21:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@markrobt True.  But lower base load and peak becomes even more unmanageable","date":"Mon Feb 15 19:43:47 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"With the terrible weather, it’s an important reminder of the need to keep Nuclear power in the mix.  If the closures in Illinois take place, we will be in an even worse place.  Thank you to the workers in #nuclearenergy today!  @NEI @Exelon #il16","date":"Mon Feb 15 19:34:22 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@PatCzyz But defended the constitution which sometimes, sadly, can be at odds","date":"Mon Feb 15 02:35:11 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sen. Cassidy is Country First.  https://t.co/Z37CenVKlv","date":"Mon Feb 15 02:21:32 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@CourtMattison Back in the normal days","date":"Sun Feb 14 15:16:28 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The damage being done to the state of our republic and the values we hold dear is unacceptable. We can and must do better for the sake of our democracy, and for the soul of our country. \n\nMy full statement here: https://t.co/bSCy2OJDWs","date":"Sat Feb 13 21:58:40 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Some free advice:  the future of the GOP rests in neither Trump nor Graham.  The country first GOP will defeat the Trump first GOP.  https://t.co/0LfRtKfJiK via @politico","date":"Sat Feb 13 13:42:25 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Absolutely.  If you have more information, you must now come forward with it.  This is your duty as an American.  History is watching.  And history judges perfectly","date":"Sat Feb 13 02:52:19 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Spewing misinformation like @KtthTodd did on Rush Limbaugh's Show is downright dangerous. Please don’t listen to talk radio hosts who use scare tactics to improve their ratings. For real data on the vaccine &amp; its extremely rare side effects, go to https://t.co/4jRT5gkIEi instead.","date":"Fri Feb 12 23:28:13 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Happy birthday to our 16th President &amp; Illinois’ own, Abraham Lincoln! May we remember his leadership and his unwavering commitment to doing what was right and just. https://t.co/G5MWwUEcnl","date":"Fri Feb 12 20:11:41 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"You can’t play both sides anymore Governor.  Pick Country First or Trump First.  https://t.co/FTHYYDQKAR","date":"Fri Feb 12 13:56:56 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@senatorshoshana @RepMeijer @FrankBednarz https://t.co/4NJjZRHRb6","date":"Fri Feb 12 03:21:31 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@FrankBednarz @senatorshoshana @RepMeijer Some of us have to work!","date":"Fri Feb 12 03:13:09 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@senatorshoshana @FrankBednarz @RepMeijer Friggin Meijer.....","date":"Fri Feb 12 03:12:44 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@senatorshoshana Also: https://t.co/sOEX0QCios","date":"Fri Feb 12 02:48:36 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@BlindMansBinary @senatorshoshana Just the sloths","date":"Fri Feb 12 02:47:32 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@senatorshoshana Don’t be sad","date":"Fri Feb 12 02:47:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Dear Jasper, \n\nPlease feel better so we can hang again. You rock. \n\nSincerely,\nAdam\nCc: @DanaPerino https://t.co/gYDfLkKuBj","date":"Fri Feb 12 01:00:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Fair warning:  if you spread this conspiracy you are prohibited from ever saying you support the police.  Let’s expose these conspiracies EARLY, before they take hold.  Acting like they don’t exist didn’t work.","date":"Fri Feb 12 00:18:09 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@kathrynw5 Ugh","date":"Fri Feb 12 00:12:51 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Boshnackttack1 @jack Yes","date":"Thu Feb 11 23:08:21 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"*TINDER.","date":"Thu Feb 11 23:07:46 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Boshnackttack1 Dang it","date":"Thu Feb 11 23:07:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@EatTravelRock The army of optimism!","date":"Thu Feb 11 23:06:20 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"By doing it for months and years prior, including tweeting to come Jan 6 “it’s gonna be wild.”  The speech lit the match on the assembled tender.  But remember “this is what happens when you steal and election....” (trump tweet AFTER.)","date":"Thu Feb 11 23:05:55 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The nation of Georgia is a great and important partner to the United States, serving on the front line of freedom against Russian aggression.","date":"Thu Feb 11 20:27:24 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@mtgreenee @AdamKinzinger Sorry in a meeting: 👇 https://t.co/nQlkVzkoKu","date":"Thu Feb 11 17:15:18 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/gEzPwhrCQp","date":"Thu Feb 11 02:45:57 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@mattgaetz Language","date":"Thu Feb 11 02:38:59 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Would be nice if @HawleyMO would actually put his Presidential ambitions (which will fail) aside for a moment to actually be a grown up Senator, come to terms with what he did, and seek redemption.  #RestoreOurGOP","date":"Wed Feb 10 23:25:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A tragic fact, but true.  And I predicted violence both in public and private multiple times prior to that day, because I simply read the words and tweets from Trump, and took them seriously.","date":"Wed Feb 10 21:22:26 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I also want to say, God Bless the Capitol police and DC Metro PD, for fighting like hell... to defend democracy, against those fighting like hell to destroy it.","date":"Wed Feb 10 21:19:27 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The prosecution is compelling.  Donald Trump incited and directed the insurrection.  He knew what he was doing.  I cannot imagine how any Senator could vote against removal.","date":"Wed Feb 10 21:08:20 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A stark reminder of the very serious issues we were dealing with before #COVID19, &amp; how many of those issues have worsened during the pandemic. The #opioidcrisis is an area Congress has been able to work on together--&amp; we cannot allow that bipartisan effort to stop.","date":"Wed Feb 10 17:41:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is sadly pathetic.  Instead of taking the censure, he tried to push the lie.  Tell the truth.  Stop the lies. https://t.co/GnlZ4qkTZi","date":"Wed Feb 10 03:31:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Ron Wright was a truly dedicated public servant, who loved his community and country deeply. His passing is a heartbreaking loss for all who knew him. Sofia and I, and my entire staff, are praying for his family, his staff, and his loved ones during this difficult time.","date":"Mon Feb 08 20:15:20 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"There’s hope... on the road... up ahead.   https://t.co/8Ud7qWoynb via @YouTube","date":"Sun Feb 07 21:15:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"True statement.","date":"Sun Feb 07 21:10:24 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Also waking up “literally laughing” is not normal.","date":"Fri Feb 05 15:14:54 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Truth bomb to GOP from Ben Sasse.  https://t.co/vN6CcKbsv4 via @YouTube","date":"Fri Feb 05 03:18:37 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Very good read from two great former members @BarbaraComstock and Rep. Boustany","date":"Thu Feb 04 20:15:45 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"We need leadership, and we need leaders like @RepLizCheney. Last night, she won big and for good reason. \n\nMy full statement here: https://t.co/VuWMtV4CJ4","date":"Thu Feb 04 15:14:56 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"No we voted.  You were just wrong by like, a huuuuuge margin.","date":"Thu Feb 04 02:24:20 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Acosta Correct","date":"Thu Feb 04 02:23:11 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Yep.  Big","date":"Thu Feb 04 02:21:28 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Great example:  the loudest isn’t always the majority.  Way to go Liz!","date":"Thu Feb 04 01:48:37 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today, we honor the service and sacrifice of Officer Brian Sicknick. He fought bravely in the face of pure evil, giving his life to defend our democracy from a ruthless mob. He protected our freedoms &amp; saved countless lives--we as a nation owe him an immense debt of gratitude. https://t.co/73DRRylzGD","date":"Wed Feb 03 21:13:45 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is what scared dictators do. They hide from the truth and silence their opposition. The Russian people deserve better than #Putin--and the US, EU, and our global allies must hold him and his cronies accountable. https://t.co/VdBgcuJo6m","date":"Tue Feb 02 19:45:40 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Head is positioned between the maps though so maybe a 7 for symmetry?","date":"Tue Feb 02 14:45:41 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The next generation will save this country.  Good work.","date":"Tue Feb 02 01:07:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud to join my colleagues on the @wef #DavosAgenda panel today, discussing how the foreign policy challenges of the United States can be addressed jointly by Congress now and in the future.\n\nTune in here: https://t.co/WTsfiZNXl4","date":"Fri Jan 29 17:39:23 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Too often we see conservative policies used as a litmus test for whether people are true Christians.\n\nToo often our political opponents are viewed as our enemies. \n\nThis has to stop. Now. \n\nMore from my conversation with @TheAtlantic here: https://t.co/2rMSCmVn9i","date":"Thu Jan 28 17:34:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"For an Administration that spends so much time calling for a one-size-fits-all approach on literally everything, I’m shocked Governor Pritkzer hasn’t used that approach in #Illinois. Every health dept. across IL has a different vaccine registration process &amp; form. What a mess.","date":"Wed Jan 27 23:48:50 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today, #WeRemember  the six million innocent victims of true evil. We honor them by sharing the truth of what happened and by standing firm in our commitment to combat hate &amp; bigotry in all its forms. https://t.co/81KMpK6Ijv","date":"Wed Jan 27 16:21:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Abortion remains one of the most divisive issues of our time. However, Americans from both sides of the divide agree that taxpayer funds should not be used. The Hyde Amendment has been in place for almost half a century &amp; it must be retained. My letter to Congressional Leaders: https://t.co/kNGVb5LB81","date":"Wed Jan 27 12:59:43 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"She is not a Republican. There are many who claim the title of Republican and have nothing in common with our core values.  They are RINOS.  She is a RINO.","date":"Wed Jan 27 04:05:33 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It can be hard to wrap our minds around the real-life horrors of forced human labor. But human trafficking IS happening, #IL16. And we must put a stop to it.\n\nIn Congress, I’m working to #EndHumanTrafficking &amp; help victims of this heinous crime: https://t.co/PycB6uEDVu","date":"Tue Jan 26 15:41:33 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This didn’t age well.","date":"Tue Jan 26 04:08:32 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@justinamash @GOPLeader That’s a good question","date":"Tue Jan 26 04:05:04 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Time for a restoration.... inspiration and aspiration is no more, conspiracies are.  I’m not giving up, I’m gonna do battle to #RestoreOurGOP   Who is with me?","date":"Mon Jan 25 23:17:19 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is GOP cancel culture.","date":"Mon Jan 25 02:09:56 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@BarbaraComstock They’re good at tanking stuff tho","date":"Sun Jan 24 23:56:22 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@LRecupito Accd to Wikipedia neither Maverick Nor Goose serve in a representative capacity.  Tragically Goose was killed in a training accident in 1986.","date":"Sun Jan 24 19:32:08 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"To be clear here, some in the Freedom Club (not all, some) have been trying to #cancel @RepLizCheney for years.  She doesn’t bend to their intimidation, because after all, they aren’t that intimidating.","date":"Sun Jan 24 19:18:06 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@dcexaminer @Liz_Cheney He literally does carry a beauty bag","date":"Sun Jan 24 18:38:23 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/08ArlMJxiB","date":"Sun Jan 24 18:37:38 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Msn2115 https://t.co/kWe42YLTc5","date":"Sun Jan 24 13:22:04 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Happy to discuss and vote on everyone’s role in this, and from the top down.  Liz didn’t attack the Capitol and needs not defend herself. Those like you who sold a lie, do.","date":"Sun Jan 24 13:12:36 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@ashvinlad I’m team Ashvin brother!","date":"Sat Jan 23 20:17:05 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wow.  This needs answers.  The Guard is filled with heroes, and they aren’t “in the way.”  https://t.co/TWv2kcD9Aq via @politico","date":"Fri Jan 22 01:10:24 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The peaceful transfer of power was threatened just two weeks ago. And though we continue to face deeply challenging times, our democracy is resilient.\n\nToday, Sofia and I send our heartfelt congratulations to President Biden and his Administration on this #InaugurationDay.","date":"Wed Jan 20 16:50:56 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@geekmikeOregon Then you we in a different era Guard. Both air and army guard and equal to and sometimes exceed their AD counterparts.  The Vietnam era guard stereotype was long shattered in post 9/11 era","date":"Tue Jan 19 17:18:18 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"And listen to what he says: \"A man dies when he refuses to stand up for that which is right. A man dies when he refuses to stand up for justice. A man dies when he refuses to take a stand for that which is true.” Watch the full speech here: https://t.co/9cbmWxfCyt","date":"Tue Jan 19 16:58:51 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As I shared on my Facebook page yesterday, this quote is largely and widely attributed to Dr. Martin Luther King Jr. but as I've learned, it is actually paraphrased from a speech he gave in Selma, AL on March 8, 1965. I encourage you all to look into the context of this speech.","date":"Tue Jan 19 16:58:51 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@joeross Out of 25,000.... very different than implying 75%.  I condemned politicizing military under Pres Trump and I’ll do it under Pres Biden","date":"Tue Jan 19 16:22:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As a proud guardsman, this is bad.  Let’s stop all the “high-scale-emotion-be-afraid” politics. https://t.co/fGAzEk0HJ2","date":"Tue Jan 19 16:12:13 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"The life &amp; legacy of Dr. King continues to inspire millions around the world. We are a better nation for his dedication to service, equality, &amp; justice for all. At this moment in history, we must find the courage to do what is right &amp; find ways to move forward—together. #MLKDay https://t.co/jomNYTWtpF","date":"Mon Jan 18 15:22:05 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Mind blown","date":"Mon Jan 18 02:25:56 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wow. Interesting line “Ted Cruz would want us to do this...”. https://t.co/YqfAKIuPjj via @YouTube","date":"Sun Jan 17 22:53:22 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is what a sinking ship sounds like on sonar translated into tweet.  Standard post-insurrection ops","date":"Sun Jan 17 15:16:10 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Great news, #IL16! The Hines VA Hospital has begun scheduling vaccines for our veterans 65 years and older. Please visit the @DeptVetAffairs #COVID19 vaccine website for more information here: https://t.co/uql9YJ4mS1","date":"Sat Jan 16 13:56:00 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@senatorshoshana Shhhhhhhh!","date":"Fri Jan 15 23:02:02 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JWishbon3 It’s my 6th term, but i will enjoy the honor of representing so many good people.","date":"Fri Jan 15 22:59:54 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I condemned the violence this summer and worked as a Guardsman to restore order.  BUT there is NO equivalency between the terrible destruction then, and an attempt to attack and destroy the very foundation of our freedom and democracy.  NONE.  #RestoreOurGOP","date":"Fri Jan 15 22:56:52 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@wutnxt https://t.co/xGd8z0Fskz","date":"Fri Jan 15 22:53:17 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Undiscl31222164 https://t.co/Ewu0EWalfx","date":"Fri Jan 15 22:52:51 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@LeonardWood8 https://t.co/fGzdqJG1kn","date":"Fri Jan 15 22:52:16 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@DanaWindowman56 https://t.co/IKPIzFo1RK","date":"Fri Jan 15 22:51:37 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"RT for one reason:  this quick video shows the rhetoric that crosses from metaphoric to actual.  I’ve been calling for toning it down for years... over time it becomes real and violent.  #RestoreOurGOP","date":"Fri Jan 15 22:50:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"These folks are absolute heroes.  Thanks for saving our lives, and Democracy ⁦@DCPoliceDept⁩ and ⁦@CapitolPolice⁩ .  If you don’t think this was insurrection and evil, I dare you to read.   https://t.co/UPkTKpiCKa","date":"Fri Jan 15 20:12:21 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"“Beware of false prophets, who come to you in sheep’s clothing, but inwardly are ravening wolves.” - Matthew 7:15 \n\nLeadership is needed across many sectors right now. And this hypocrisy by Franklin Graham isn’t it. https://t.co/Q4Nn2fJ13j","date":"Fri Jan 15 15:15:01 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Some say they love Pres Trump’s “strength” and speech.  I promise you he has no strength, just loud words.  @Liz_Cheney showed strength of conviction... to #restoreourgop we must be honest about where we have fallen, and how to return to our roots.","date":"Fri Jan 15 14:54:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Johnny_Joey Agreed on the AOC, but i believe that our party will soon realize the emporer has no clothes.  A party of cult of personality never lasts","date":"Thu Jan 14 04:41:32 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This name will be one forgotten by next January.  Politics for fame is headed out the door, the adults will return.","date":"Thu Jan 14 04:36:01 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@CousinDNA They got nothin on me","date":"Thu Jan 14 00:46:21 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/RZp9oXW8Ah","date":"Thu Jan 14 00:34:22 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Liz has more support now than she did two days ago.  She has gained immeasurable respect.  Since the discussion is opened though, we may have to also have a discussion about who in our party fomented this, and their roles as ranking members.","date":"Wed Jan 13 22:13:41 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It was a sobering moment to vote in support of impeachment today; to walk over to the U.S. Capitol, our symbol of democracy, and recall the violent insurrection we witnessed here just one week ago. This is not a vote I took lightly, but a vote I took confidently. I'm at peace.","date":"Wed Jan 13 21:55:55 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/DwKqkxhZw4","date":"Tue Jan 12 23:14:02 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@21WIRE https://t.co/LJ0Ya6wTtl","date":"Tue Jan 12 17:51:16 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I believe there is a huge burden now on Christian leaders, especially those who entertained the conspiracies, to lead the flock back into the truth.","date":"Tue Jan 12 16:31:41 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"You know sir?  You are absolutely correct.  You did act honorably, and while my point remains about the Church and the need for pastors to lead, you did not press those stolen election conspiracies.  I am sorry for including you in that.","date":"Tue Jan 12 16:27:59 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"“The Roman Road from Insurrection” · @drmoore https://t.co/G4a5LHx1Aj","date":"Tue Jan 12 16:20:28 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@AgnesClaire Well Hillary wasn’t a pastor, and this is my first insurrection.","date":"Tue Jan 12 14:35:49 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Only the Church Can Truly Defeat a Christian Insurrection https://t.co/3IlGI5DVJf","date":"Tue Jan 12 14:14:48 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Good case study.  David was called out about how wrong his tweet was given the failed insurrection.  Yet he sees the fact that the reach and retweets and followers were high as success.  Who knew junior high would be cool again?","date":"Mon Jan 11 04:55:40 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Officer Goodman deserves a medal","date":"Mon Jan 11 01:05:48 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Disgusted","date":"Sun Jan 10 19:40:38 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Here are why “conservatives” are losing twitter followers:  people are waking up to the lie and don’t want to hear it anymore.","date":"Sun Jan 10 16:46:04 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Inside the Capitol siege: How barricaded lawmakers and aides sounded urgent pleas for help as police lost control - The Washington Post https://t.co/KXpbVu816X","date":"Sun Jan 10 16:16:59 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I haven’t yet said this publically, but I want to now.  On Wednesday I felt literally and real evil as the insurrection went down.  It is not something that happens much, but I’ve never felt it stronger than that day.  Mass deception.","date":"Sun Jan 10 15:37:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Hi “Patriots” does this make you proud?  I would love to meet the guy attempting to pull this officers mask off... wouldn’t end well for him.  https://t.co/6hfMaOOLoo","date":"Sat Jan 09 15:50:18 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s all a scam folks.  #thegreatscam #RestoreOurGOP","date":"Sat Jan 09 15:16:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"David French\n\n“The most powerful man in the world incited an attack on our republic. \n\nThe free American citizens who work for Twitter responded with an action freely chosen.\n\nAnd MAGA voices wail about lost followers as evidence of totalitarianism. \n\nSnowflakes.”","date":"Sat Jan 09 15:14:03 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Not so good Jake, not so good.","date":"Sat Jan 09 15:12:27 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Really?  Is the implication part of the false flag narrative?  After seeing all the desire for a “patriot” party this doesn’t seem confusing.  Do better.","date":"Fri Jan 08 20:09:28 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I know one thing I’m at peace with... I didn’t cause an insurrection that killed 5 including a heroic Capitol Police officer beaten by a “patriot” with a fire extinguisher.","date":"Fri Jan 08 19:29:15 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sofia and I are heartbroken by the loss of US Capitol Police officer Brian Sicknick who was tragically killed by the insurrection on the Capitol.  This is incredibly tragic, needless, and stems from lying leaders.","date":"Fri Jan 08 12:12:27 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s with a heavy heart I am calling for the sake of our Democracy that the 25th Amendment be invoked.  My statement: https://t.co/yVyQrYcjuD","date":"Thu Jan 07 15:46:02 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"What happens next is up to us. We must reject the charades and tell the truth. Joe Biden won the presidential election, and as a nation, we need to move forward. https://t.co/hzzSU8jIHE","date":"Thu Jan 07 14:52:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is the gasps of desperation as their gravy train de-rails, their fame subsides, and the Americans awake to the grift.","date":"Thu Jan 07 13:43:41 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Second part of my floor statement","date":"Thu Jan 07 08:13:01 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Part one of my floor statement","date":"Thu Jan 07 08:12:36 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I’m embarrassed by some of my Republican colleagues on the floor.  They have defaulted to political points for fame and have failed to rise to this moment.","date":"Thu Jan 07 03:23:34 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Yep.  It’s the end.  There needs to be even more and there needs to be a discussion about who leads this party going forward.  On all levels","date":"Thu Jan 07 02:14:58 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I hope there are more to come.  People of good conscience need to follow that.","date":"Thu Jan 07 02:11:29 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@mtracey Then is was a dumb and pointless coup attempt","date":"Thu Jan 07 01:11:45 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wanna see what these “pro police” garbage clowns did?  Watch below","date":"Thu Jan 07 00:05:07 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Yes.  Leaders that led this should all resign so the adults and truth-tellers can #RestoreOurGOP","date":"Wed Jan 06 23:27:55 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Amid the chaos, my statement here: https://t.co/6CMZHeYhPq","date":"Wed Jan 06 21:53:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is a coup attempt.","date":"Wed Jan 06 19:24:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Republicans, how is this not like Antifa?  Side note thanks to the badass @CapitolPolice for protecting the peoples house from chaos.","date":"Wed Jan 06 18:54:01 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sounds like “constitutional loving people.”  No it’s not.","date":"Wed Jan 06 18:32:25 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I outright condemn this garbage.","date":"Wed Jan 06 17:51:38 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Told ya.  All about the Benjamins. https://t.co/oPMnw1NzAT","date":"Wed Jan 06 15:08:35 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is not necessarily a trick however.  Speaking time is granted to an objector and to one opposed to objection, not by party.","date":"Wed Jan 06 14:56:33 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@realDonaldTrump Not true","date":"Wed Jan 06 14:53:36 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today it seems that Republican house members that will not object to certification will get no speaking time, unless yielded by Democrats.  So while maybe 1/4 of the House objects, they will get 1/2 of speaking time.","date":"Wed Jan 06 14:52:00 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@EWErickson Willful","date":"Wed Jan 06 04:23:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@hepolavoice https://t.co/HdMdujuEii","date":"Wed Jan 06 03:55:03 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is an intervention fellow Republicans.  We hit bottom, I hope that soon we wake up like a Saturday morning after a Friday night bender, look around and mutter “what have we done.”","date":"Wed Jan 06 00:57:53 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Politicians can tell you what you want to hear, or the truth.  This is the truth.  1) Biden will be President, 2) no state sent any other electors or asked us to NOT certify, etc.   The Constitution must hold now, or it won’t hold at all.","date":"Wed Jan 06 00:51:03 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Truth from Mayor @davidfholt Sometimes it’s easier to pretend, but the truth is President Trump lost, and this won’t change January 6.  Love that or hate it, it’s a fact.  Leaders should lead, not give false hope.","date":"Mon Jan 04 23:12:19 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Do you agree?  If so speak out!  #RestoreOurGOP","date":"Mon Jan 04 02:36:22 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@7707Missumoo God bless him and you","date":"Mon Jan 04 01:59:19 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"If we ask people to give everything in defense of freedom, there really is no reason to be afraid to stand up to defend the peaceful transfer of power.  It’s not courageous, is my job.","date":"Mon Jan 04 01:51:32 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@grtcli Work with us and help us!","date":"Mon Jan 04 00:49:04 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is absolutely appalling.  To every member of Congress considering objecting to the election results, you cannot- in light of this- do so with a clean conscience.  #RestoreOurGOP","date":"Sun Jan 03 20:24:58 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Amen","date":"Sun Jan 03 16:51:05 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As the #117thCongress begins, there are areas we can find bipartisan agreement.  1) defend ourselves and our friends against Chinese aggression, 2) aggressively respond to the Russian hack.  3) defeat Covid, 4) restore our economy, 5) restore our dialogue.","date":"Sun Jan 03 15:18:22 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@AZGOP https://t.co/hfxB55r6K4","date":"Sun Jan 03 03:10:51 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"As my friend @FrankLuntz reminded you, Romney, McCain, and Flake actually won Arizona.  Sooooo","date":"Sun Jan 03 03:09:40 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@amc53149bekind Being the reincarnated son of God is hard wrk so he earned it.","date":"Sat Jan 02 18:26:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"To my Christian Bretheren, Lin Wood refers to himself as Jesus in one of the more insane things I have read.  “Beware of false prophets (profits) who come to you in sheep’s clothes but inwardly are ravening wolves.” Matthew 7:15","date":"Sat Jan 02 18:21:47 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Latest “proof” from the conspiracy folks.  Ballots “found in a warehouse.”  Now are “being shredded”. 1) absentee ballots aren’t all used, these are extras.  2) they are UNMARKED and sealed 3)  unused ballots are shredded.  4) come on man https://t.co/owBFZT2kkM","date":"Sat Jan 02 15:31:46 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@laurenboebert Another exhausting “hope to be famous” freshman.","date":"Sat Jan 02 15:01:02 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@ReduxVernon Ask trump, he asked us to a few times","date":"Sat Jan 02 03:49:30 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@dbongino It’s rare to meet someone who lost a house race in two states, and a senate race!","date":"Fri Jan 01 15:14:23 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"This was pre-grift https://t.co/BpWTOhNoHW","date":"Fri Jan 01 04:39:24 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"Are you talking about my military salary for 17 years?","date":"Fri Jan 01 04:11:08 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@BillBernardoni Thanks my man.  Happy new year friend","date":"Fri Jan 01 01:54:57 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@bnbatman @RepPaulMitchell Paul thank you for serving and representing until 11:59am Sunday!","date":"Fri Jan 01 01:01:14 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@RepPaulMitchell God bless ya","date":"Fri Jan 01 00:48:18 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@dandarling Thank you brother","date":"Fri Jan 01 00:27:13 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TurnbullDJTX Hahah.  Actually that was funny","date":"Fri Jan 01 00:26:36 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@trthseeker549 @magic_elfin @marklevinshow @ChooChooLife https://t.co/PImH1fzHr2","date":"Fri Jan 01 00:21:53 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@germantownpc @YouTube Thank you!","date":"Fri Jan 01 00:16:42 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@CathcartHotel @jaketapper @YouTube Amen to that","date":"Fri Jan 01 00:16:06 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@SARSCoV2virus @YouTube Thanks brother proud to represent you","date":"Fri Jan 01 00:15:36 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@barberdmier @YouTube https://t.co/3dUvKkjO7D","date":"Fri Jan 01 00:15:12 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@hollyodnyc @YouTube Holly, I got my pilots license in Lincoln!","date":"Fri Jan 01 00:13:39 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Andr_Hof @YouTube Danke.","date":"Fri Jan 01 00:13:03 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"@ccmpln @YouTube Thank you!  They do amazing work","date":"Fri Jan 01 00:12:44 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"I can stay quiet and take the easy path to re-election, or I can lead without fear.  I took an oath, and I owe it to my family, my country, and my God.  Here is the truth:  (full video click link) https://t.co/HX9tYFLV2x via @YouTube https://t.co/SPLwHfMgzR","date":"Fri Jan 01 00:00:58 +0000 2021","user_id":"219429281"},{"handle":"RepKinzinger","text":"A-friggin-men.  Despicable traitor that cost lives.","date":"Thu Dec 31 19:54:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Mark is The Godfather of “outrage for profit.”  For some reason he has been obsessed with me for a while.  👇","date":"Thu Dec 31 15:14:03 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Here are the Republicans planning to challenge the Electoral College results https://t.co/E7JKapvG24 https://t.co/gsDUDlveDb","date":"Thu Dec 31 14:29:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Whaaaaat?  But I thought.... (standby for deep state accusations).  This whole thing has been a scam for your money and attention.","date":"Thu Dec 31 14:24:31 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Internal monologue:  “I want to be President so I decided to try to get POTUS tweet saying I’m great even though I know this isn’t going anywhere, but hey... I’ll blame someone else when it fails.”","date":"Wed Dec 30 16:38:15 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just awful, awful news. Sofia and I are sending our prayers to Luke Letlow’s family and loved ones. A vibrant life cut short— a heartbreaking loss.","date":"Wed Dec 30 04:30:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TBonthala Tobins for pizza, Avantis for everything else!","date":"Tue Dec 29 01:29:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Oh but it will Frank.  He will raise money on this... that’s the whole point.","date":"Mon Dec 28 22:49:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Well, some have officially lost it.","date":"Mon Dec 28 19:33:27 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@endunamis @DC_Draino You’re going to come punch me?","date":"Mon Dec 28 03:24:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Brother you’re a friend, but the only thing I’m surrendering to is the Constitution and the will of the people.  I’m a fighter, and the Republic needs fighters to defend against descent into chaos. #RestoreOurGOP","date":"Mon Dec 28 02:50:05 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@DC_Draino https://t.co/BXMtcF2vP4","date":"Mon Dec 28 02:22:27 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Ok, not granting a megaphone but showing the world what’s happening.  This person has a lot of followers and is pushing the conspiracy that A MISSILE blew up the RV.  OMG.","date":"Sun Dec 27 15:39:02 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is another kind of misinformation and conspiracy being driven amongst the Q types.  Anyone who disagrees has something to hide, or is bought by China.  The fact that I’m among the biggest China hawks has no bearing compared to conspiracies.","date":"Sun Dec 27 14:16:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Praying for the victims and their families tonight after the heinous attack in our community. As we continue to learn more and hold the responsible party accountable, I want to thank the @RockfordPD for their swift action in apprehending the suspect. #IL16","date":"Sun Dec 27 03:46:53 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@CaliKatInCali I have and win every time","date":"Sun Dec 27 01:52:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Like “Adam.”  Maybe I’m not really an Adam?","date":"Sun Dec 27 01:44:03 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@BrianSchoeneman @trumpvi61308717 @mtgreenee @ProjectLincoln Agreed.  Sad we even have to say that.","date":"Sun Dec 27 01:42:59 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Haven’t yet figured why some of these conspiracy feeders use all caps or a bunch of quotes, or in this case, both.  Deep breath my man.","date":"Sun Dec 27 01:42:11 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@7707Missumoo @HeathMayo @mtgreenee Thank you.","date":"Sun Dec 27 01:32:09 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@timburchett @RepRiggleman https://t.co/PZ4yz78M58","date":"Sat Dec 26 18:12:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Usernonymous1 https://t.co/CWcy8BVzZR","date":"Sat Dec 26 15:11:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@RepPaulMitchell @RepKenBuck @realDonaldTrump Yep he hadn’t said a word","date":"Sat Dec 26 15:08:19 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@RepPaulMitchell @realDonaldTrump It’s scamtastic!","date":"Sat Dec 26 14:50:59 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@kennethmcneill @realDonaldTrump Ohhhhh burn","date":"Sat Dec 26 14:34:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"All this talk about Jan 6th from @realDonaldTrump and other congressional grifters is simply explained:  they will raise money and gain followers by blaming everyone else knowing full well they can’t do anything.  It’s sad, and an utter scam.  #restoreourgop","date":"Sat Dec 26 14:29:06 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@SkyMarshalKen Merry Christmas brother","date":"Sat Dec 26 01:43:06 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"We have faced many challenges this year, here at home &amp; around the world. But Christmas is a season of hope. We follow the North Star, we persevere through the darkness, &amp; we believe in God’s love. With faith in our hearts, may we all find peace &amp; joy. Merry Christmas, everyone!","date":"Fri Dec 25 17:04:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@UVAnthonyCSCS Guard mafia!","date":"Thu Dec 24 21:34:18 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@RyanFuss2 @dciszek19 Pretty hot in these rhinos! https://t.co/RuYvFV1hRm","date":"Thu Dec 24 21:33:25 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JaneLeeHunz 1) eye roll.  2) merry Christmas!","date":"Thu Dec 24 21:32:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Actually his team negotiated it then agreed.  THEN he changed his mind since twitter...","date":"Thu Dec 24 20:45:07 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@uweplus Sehr gut!","date":"Wed Dec 23 18:48:52 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Despite this funding package being long overdue, I was proud to vote in its favor because of the many provisions that will positively impact the American people facing the hardships of the COVID-19 pandemic. My full statement here: https://t.co/yFvKY3Elh9","date":"Tue Dec 22 15:55:09 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Read_N_Learn We’re in a moment, one where disasterous behavior is being legitimized, and it’s important to push back","date":"Tue Dec 22 02:55:16 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Applause is intoxicating... governing honorably is hard sometimes and has no adoring crowds, nor should it.","date":"Tue Dec 22 02:36:19 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@HartTimTimHart https://t.co/TJgJkdd2aa","date":"Mon Dec 21 21:33:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Mutual admiration society meeting","date":"Mon Dec 21 21:27:02 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"A brilliant must-read for those not completely gone in QAnon https://t.co/8zs8BNONqy","date":"Mon Dec 21 12:58:20 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The greatest source of zero-emission bulk power in America is at risk. My bill can help save nuclear plants that are on the chopping block--including Byron &amp; Dresden here in #IL16--by providing financial credits through an Emissions Avoidance Program. https://t.co/whHGgeNQlU","date":"Sun Dec 20 17:08:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Gen Z GOP: These Young Republicans Want to Reshape Their Party Post-Trum... https://t.co/XidcL8Jafz via @YouTube @genzgoporg","date":"Sun Dec 20 01:42:51 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TherealmommaG1 @POTUS A free American.... a congressman.... an off duty Reservist.  Ain’t the Soviet Union","date":"Sun Dec 20 01:40:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"I asked a good veteran (and fellow GOP) friend what he thought of all this talk of military in the elections.  He said it best: “Tell your friends we DO NOT HURT those we swore to protect.”  Amen brother.  Don’t let fear and mistrust infect you.","date":"Sat Dec 19 23:19:14 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The worst cyber attack in history, and @realDonaldTrump  has not said one word or tweeted a thing.  We need more action, and less airing of personal grievances.   https://t.co/qFkrtBtqmV","date":"Sat Dec 19 16:07:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@opendoorslowly1 I’m concerned about deep state jail, i guess","date":"Sat Dec 19 03:42:25 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@757Blackwell Uh oh.","date":"Sat Dec 19 03:41:50 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TarantulaTer Prolly to house the deep state","date":"Sat Dec 19 03:41:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"One of the Q conspiracies includes that GITMO is going to house the deep state when “the storm” happens.  So this guy is implying that I’m nervous cuz Its going to get me.  Ill expose these theories, and shine the light into the darkness. #RestoreOurGOP","date":"Sat Dec 19 03:33:48 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@kjthompson24 https://t.co/GuDlzmUApF","date":"Sat Dec 19 03:29:07 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@BearOfGrump Darn shame","date":"Sat Dec 19 03:26:11 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@cjtruth I’m not good at stats.  Or deep stats especially.","date":"Sat Dec 19 03:17:13 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@HerQLisa @GenFlynn Honor?","date":"Sat Dec 19 03:15:01 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@DocBender @GenFlynn Nope that was a comment directed at me","date":"Sat Dec 19 00:37:55 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@boiseoutspoken https://t.co/3Sx1HCXAvo","date":"Fri Dec 18 23:57:27 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is fantastic news for #Dixon, the 16th District, and the generations yet to hear the story of the Gipper and his deep belief in the spirit and leadership of America to a world desperate for her!","date":"Fri Dec 18 22:24:08 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TomRooney @RealMFlynnJr @GOP @GenFlynn The new era of twitter where we exchange rational discussion for F bombs and yelling into the internet","date":"Fri Dec 18 20:33:30 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"No.  The military will not be “deployed” to re-run an election.  It’s time for this to be shut down, and now.   Gen. Flynn has lost his moral authority to be taken seriously, and the GOP needs to stand up to it.  #RestoreOurGOP","date":"Fri Dec 18 15:32:41 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Svitoslav3 @PershingSoldier @TheDaytonian937 @The53rdRegiment @SalManzo1 @SaltyPatriotFL @NancyAmerican https://t.co/1izJQ0a7nT","date":"Thu Dec 17 13:15:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud to see the House pass the BRAVE Act &amp; send to the President's desk for signature. 🇺🇸 Every veteran who served honorably deserves a dignified farewell. And when it comes to veteran funeral expenses, we need to ensure the amount families get is consistent.","date":"Wed Dec 16 22:58:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Another reason why the President must sign the NDAA into law, it provides enhanced cyber protections &amp; capabilities to secure our nation. \n\nMy full, official statement can be found here: https://t.co/OIWxDeoB2G","date":"Wed Dec 16 14:47:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Jeff03956722 It’s supposed to be RINO, not rhino","date":"Wed Dec 16 12:33:20 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@overlordjonny You son of a.....","date":"Wed Dec 16 12:06:32 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/hiVlVgSO3d","date":"Wed Dec 16 12:05:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@NationGray https://t.co/Gzgr1ci3wu","date":"Wed Dec 16 12:04:16 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@NnPnemck https://t.co/uO0EsvhnQM","date":"Wed Dec 16 12:03:50 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@HunterCrowder6 @EvanMcMullin Dude delete that pic or “the storm” will get you too","date":"Wed Dec 16 02:13:05 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"For all the QAnon types let me get this off my chest:  1) I started ISIS with @EvanMcMullin 2) I spray Chemtrails.  3) I’m soon to be arrested by the storm.  4) Trust the plan (been 4 years of trust the plan...why stop now.).  5) #RestoreOurGOP","date":"Wed Dec 16 02:00:53 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Boziticus I did start ISIS and i also dispense chemtrails","date":"Tue Dec 15 23:39:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Boziticus https://t.co/CEr3wqmbiB","date":"Tue Dec 15 22:33:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Boziticus https://t.co/8V2SxLFJAV","date":"Tue Dec 15 22:29:07 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"To my GOP friends interested in the truth vs self delusional lies, let’s support @ReaganBattalion   #RestoreOurGOP","date":"Tue Dec 15 20:05:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"GREAT NEWS: Vaccinations are currently underway here in #Illinois. This historic moment is a major step forward in our fight against the #coronavirus. 👏 Big thank you to our frontline workers, our scientists, &amp; all those who played a role in making this swift action possible. https://t.co/HEFmoLGIFz","date":"Tue Dec 15 19:03:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@RepRiggleman https://t.co/vrHe2i5QRL","date":"Tue Dec 15 15:36:06 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@tgaeta2 Yes i am nervous since I’m in on the numbers letters conspiracy!!!  I’m hoping my chem trail making doesn’t come out","date":"Tue Dec 15 12:39:13 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JamesEa02677013 https://t.co/C3jPNxWw0L","date":"Tue Dec 15 12:36:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@RDERANKIN I’m not the one looking like an idiot here....","date":"Tue Dec 15 12:34:02 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Bonfiredesigns Please explain?  How I, a congressman, can run a fund and arm operation of isis with McCain?  Please...","date":"Tue Dec 15 12:33:32 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@qt_patri @realDonaldTrump https://t.co/sJ58wMQndj","date":"Tue Dec 15 12:31:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Claire14Maureen Just because?","date":"Tue Dec 15 12:31:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@DavidRDavidson You need some sleep","date":"Tue Dec 15 12:24:14 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Time to go on offense.  Russia should pay, and they will lose in this battle.  https://t.co/bHeTXjDCS9","date":"Tue Dec 15 02:51:05 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TimRunsHisMouth Great deflection.","date":"Mon Dec 14 12:37:30 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@youlied2America Pay attention before tweeting please","date":"Mon Dec 14 03:52:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"At 20 seconds he says “this is a phony pandemic.”  Remember when the WHO voted against declaring this a pandemic? Is Rep-elect Good and Dr. Tim Young pro-China?  Trump declared this a pandemic","date":"Mon Dec 14 03:50:03 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@charlievgordon https://t.co/2l1MgrxP2P","date":"Mon Dec 14 03:41:25 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"#RestoreOurGOP","date":"Sun Dec 13 19:35:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Amen","date":"Sun Dec 13 13:05:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Yawn.  Uh huh.  https://t.co/GDWM3HPQ2b","date":"Sun Dec 13 03:16:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@vetpatriot17 https://t.co/hNX5W3Naau","date":"Sat Dec 12 23:00:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@vetpatriot17 https://t.co/IF0zRydWqt","date":"Sat Dec 12 22:58:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@setholdmixon Ugh","date":"Sat Dec 12 22:32:37 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@liobserver @ali https://t.co/RtprZBMoi9","date":"Sat Dec 12 22:13:19 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Dayton89Jim https://t.co/Xgi0pMmaxW","date":"Sat Dec 12 22:12:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"We won’t be destroyed, we will #RestoreOurGOP","date":"Sat Dec 12 22:10:09 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@MikeSkriloff Good luck brother... rooting for you","date":"Sat Dec 12 22:08:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"You can disagree on the remedy, but it’s not a fake virus.  I just... are cheers and accolades really that addictive Rep-elect Good?   My party needs to take a breath and remember what we actually believe.  #RestoreOurGOP","date":"Sat Dec 12 22:05:18 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"I want to be clear:  the Supreme Court is not the deep state.  The case had no merit and was dispatched 9-0.  There was no win here.  Complaining and bellyaching is not a manly trait, it’s actually sad.  Real men accept a loss with grace.","date":"Sat Dec 12 16:31:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"I believe @TexasGOP should immediately retract this, apologize, and fire Allen West and anyone else associated with this.  My guy Abraham Lincoln and the Union soldiers already told you no.","date":"Sat Dec 12 00:44:13 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"So @DiamondandSilk just suggested a military overthrow.  Let that sink in, and do everything the opposite of any other suggestion people like this offer.  INSANE","date":"Sat Dec 12 00:02:38 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"As a member of the military, this is sick and unbelievable.  The military swears their allegiance to the Constitution, not anyone’s whims or desire to get retweets.","date":"Fri Dec 11 23:58:08 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Godspeed airman.","date":"Fri Dec 11 20:04:26 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@highlevelgenius https://t.co/52FSswPceV","date":"Fri Dec 11 03:37:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"A nickel on the grass.  Rest easy brother.... touch the face of God.  #115thFighterWing","date":"Fri Dec 11 02:43:03 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Excessive tweets will not change the election. We need to rise above the fray &amp; move forward as a nation. \n\nMy thoughts here: https://t.co/j2V4DWfDcq","date":"Thu Dec 10 21:59:06 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"As #COVID19 spikes in #IL16 &amp; across the country, more must be done to help American families.\n\nOur bicameral, bipartisan proposal has $$ for states, PPP, vaccines, unemployment, transportation, healthcare, @USPS, &amp; more. \n\nThis is the emergency relief we need—&amp; we need it now. https://t.co/XKFjMxAmJ0","date":"Thu Dec 10 14:35:44 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is why people don’t take some members of congress seriously.  Addiction to outrage tweets.","date":"Wed Dec 09 21:44:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@KaraHeuer Kara, helos are cool tho!  You have a pretty cool family and i knew that would be the case since we were kids!","date":"Wed Dec 09 14:25:20 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The Air Force flies above such petty rivalries.","date":"Wed Dec 09 13:33:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"My unit:  please keep in your prayers. Godspeed","date":"Wed Dec 09 13:16:15 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"A nickel on the grass for the legendary @GenChuckYeager. One of the all-time greats, a fearless pilot who inspired me and countless others to get our wings and seize the skies. God speed to this American hero, aviation pioneer, and certified ace. https://t.co/UU4KWjsNVi","date":"Tue Dec 08 13:49:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The election in Venezuela this weekend was a sham; it was not fair - it was not free. And it's the people of Venezuela who will suffer under the heavy-handed dictatorship of Maduro.","date":"Mon Dec 07 15:15:56 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@DaBaronVH https://t.co/wo7s0nB52K","date":"Mon Dec 07 01:35:31 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@realDonaldTrump https://t.co/ICSItGZTXK","date":"Sun Dec 06 01:37:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JaughnP https://t.co/KBcuIif0dl","date":"Sun Dec 06 01:26:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@tummycouch54 https://t.co/8Is1SQNOEW","date":"Sun Dec 06 01:25:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@jmichaelveit @DanProft @realDonaldTrump @catturd2 @AmyJacobson Sounds fun!","date":"Sun Dec 06 01:17:09 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Denouncing conspiracy theories and advocating for truth should not be a political or partisan approach. It should be the standard. https://t.co/nqkJT5imKC","date":"Sat Dec 05 20:22:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"About to speak on the House Floor in support of this important measure, introduced by @ConawayTX11, calling for the immediate release of Trevor Reed, our fellow American &amp; a former U.S. Marine, who is being wrongfully detained by the Russians.\n\nTune in here 👇@freetrevorreed","date":"Thu Dec 03 22:02:05 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@HartTimTimHart https://t.co/9bFc8aaF50","date":"Thu Dec 03 04:30:24 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@MZHemingway GOP voters get demoralized when lied to.","date":"Thu Dec 03 04:15:44 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Uh no.  It’s about deep sixing the NDAA (which is about the military and has been in conference for months) with something totally unrelated that has not been debated or thought through.  This is governing.","date":"Wed Dec 02 23:12:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Congratulations, @cathymcmorris! This is great news for @HouseCommerce as we continue our important work in the next Congress.","date":"Wed Dec 02 21:57:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@BeholdIsrael To those reading, this is not true and it’s from qanon.  You are amplifying conspiracies.","date":"Wed Dec 02 02:54:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@BuckGarrett4 It’s being repeated without any pushback. That has been the problem","date":"Wed Dec 02 02:26:27 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The people of #Illinois deserve action &amp; answers on the deadly #COVID19 outbreak at the LaSalle Veteran Home. The failures here are entirely unacceptable. And without question, our most vulnerable population deserves better than this.\nhttps://t.co/59QBXIqN92","date":"Mon Nov 30 18:30:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JeffLindenmann Caps lock is on","date":"Sun Nov 29 21:48:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@promises_kept_ Lots of people have their caps lock stuck on","date":"Sun Nov 29 21:42:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@LWiebeld Your caps lock is stuck on","date":"Sun Nov 29 21:42:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The @FBI did not rig the election.  If you find yourself believing they did, please stop, and say it out loud, and you will realize how silly it sounds.  @realDonaldTrump simply flooding the zone with baseless conspiracies again.","date":"Sun Nov 29 21:34:55 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Once again, FALSE.  Complete fabrication meant to confuse you:  Did Pennsylvania Record Many More Mail-In Votes than Ballots Requested? https://t.co/GGacRBOSOA # via @snopes","date":"Sat Nov 28 18:06:12 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"100%. Elections are important, accepting the results are too.  Please note: this list is of those who believe that win or lose, you accept the will of the people.  Saying an election is stolen doesn’t make it so.   Lies and conspiracies won’t work.","date":"Sat Nov 28 17:38:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@gianmvrco Please tell that to Iran.  Yemen, Syria, Lebanon, Iraq, etc have Many lost innocents at their hands.  The rational thing is to confront the people causing the violence VS a large scale war against soldiers simply doing a job.","date":"Sat Nov 28 17:27:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"On this #SmallBusinessSaturday, I want to send BIG congratulations to the Village Bakery in Oregon &amp; @KennayFarms in Rochelle for their designation to the #IllinoisMade program. Proud to have these local businesses here in #IL16! https://t.co/G3CmupTwIm","date":"Sat Nov 28 16:55:41 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Absolutely reckless of you to tweet this.  I’m happy he is dead.  I’m surprised that you aren’t happy too.  (Keep in mind these are the same people who predicted WW3 after we killed Solemani.)","date":"Sat Nov 28 02:11:54 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"My honor.","date":"Fri Nov 27 04:36:59 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/zPnTm0unX8","date":"Thu Nov 26 16:57:05 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"After Communist China detained the Uyghurs and put them in labor camps, @UNHumanRights gave them a seat on their Council. \n\nWonder what accolade they’ll get after this move by Xi to further repress religious belief and isolate the Chinese people from the outside world.","date":"Wed Nov 25 14:20:03 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Addressing mental health issues &amp; the vicious cycle of violence is an area Congress can agree. 👍\n\nThe Bipartisan Solution to Cyclical Violence Act is a perfect example of how we can work together to enact policies to positively impact our communities. https://t.co/h2PoPGcCDI","date":"Tue Nov 24 13:20:25 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Now would be a great time to denounce this, @gop how embarrassing.  Our party needs to be better than giving credence to these insane conspiracy theories.","date":"Mon Nov 23 15:51:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"For @realDonaldTrump  Fact check: States don't have more than 100% voter turnout in an election https://t.co/VpIBjG2PKy via @usatoday","date":"Mon Nov 23 15:00:16 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JedediahBila Absolutely","date":"Mon Nov 23 00:45:59 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Quite honestly there is a lot coming from all levels.  The Giuliani press conference was crazy.  Our nation is bigger than this... the next generation deserves a better example.  We owe it to them.","date":"Sun Nov 22 23:12:57 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This ladies and gentlemen is exactly why you need to fact check before believing hook line and sinker.  Sidney Powell was pedaling conspiracy garbage.","date":"Sun Nov 22 23:08:06 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"1) Covid is real, hospitals are overwhelmed.  2) Chemtrails are NOT real.  3) Wearing a mask protects others from you.  4) Wearing pants protects others from having to see you without them.  5) Neither are secret plans to control you.","date":"Sat Nov 21 23:02:48 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"I firmly believe we have a responsibility to do what’s right for the country, above all else.","date":"Sat Nov 21 18:35:48 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@guypbenson the damage could be long lasting","date":"Sat Nov 21 00:46:54 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s time for Speaker Mike Madigan to step down &amp; for @GovPritzker to speak up. The people of #Illinois deserve better than the systemically corrupt government led by Madigan and his enablers. Accountability is long overdue.","date":"Fri Nov 20 16:03:50 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just spoke with folks at Morris Hospital and the spike of #coronavirus cases is beyond alarming. Many hospitals are already at capacity, so please use precautions and be safe. #IL16 https://t.co/TRo20E1QEM","date":"Thu Nov 19 21:16:50 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today’s a good day to read the #GettysburgAddress.\n\nAt a time when things feel divided, #WeThePeople must stand united in our resolve to defend democracy &amp; preserve it for the future. That’s how we honor those who sacrificed to secure the freedoms &amp; values of this great nation. https://t.co/OEF4xzSXWs","date":"Thu Nov 19 16:07:49 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Removing U.S. troops from #Afghanistan without conditions is a mistake. It was a mistake when Obama did it in Iraq in 2011 (which led to our return to fight ISIS) and it’s a mistake now, @POTUS. \n\nMy full statement here: https://t.co/D1O0tsyH2R","date":"Tue Nov 17 00:37:52 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@mtgreenee https://t.co/Qrraz8XIGE","date":"Sat Nov 14 00:18:24 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sending my prayers to our fearless Dean of the House for a safe and swift recovery.","date":"Fri Nov 13 14:58:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"To all those who have served &amp; sacrificed, we thank you on this #VeteransDay &amp; every day. Having served alongside the best of the best, I’ve made it a priority in Congress to support &amp; advance the interests of our veterans &amp; their families. And that work continues. #HonorThem https://t.co/DF5HtD775s","date":"Wed Nov 11 21:26:44 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"My office is aware of the #COVID19 outbreak at the LaSalle Veterans Home in #IL16 and we will continue to support our VA community, keeping the residents and staff in our prayers for a safe and swift recovery. \n\nFull statement here: https://t.co/yO7fKnPu5s","date":"Sun Nov 08 13:36:55 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sofia and I extend our Congratulations to Joe Biden and Kamala Harris.  Our nation deserves two competing parties who can work together when possible, and compete honorably when not.","date":"Sat Nov 07 19:52:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Debunk alert:  The #WatermarkBallots conspiracy is false.  The federal government does not print ballots.","date":"Sat Nov 07 19:30:16 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TDG1ant @JoeSilverman7 https://t.co/8xp2fpaq66","date":"Sat Nov 07 01:00:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TDG1ant @JoeSilverman7 I flew special ops tankers at mcconnel?  News to me.  #factsmatter","date":"Sat Nov 07 00:16:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Reminder: the coronavirus pandemic continues to spike here in #Illinois &amp; across the country. In #IL16 counties, the number of confirmed #COVID19 cases reached 25k in just six weeks. ‼️ Stay vigilant and stay safe.","date":"Fri Nov 06 18:42:57 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"We want every vote counted, yes every legal vote (of course). But, if you have legit concerns about fraud present EVIDENCE and take it to court.  STOP Spreading debunked misinformation... This is getting insane.","date":"Fri Nov 06 00:07:12 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"RUMOR ALERT: Biden Did Not Receive 100% of 128K New Votes in Michigan https://t.co/yHmv2NOAys # via @snopes","date":"Thu Nov 05 15:11:07 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"No, Wisconsin Did Not Count More Votes Than Registered Voters in 2020 https://t.co/MBRKpnonVs # via @snopes","date":"Thu Nov 05 15:10:15 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Voter turnout for #Election2020 was incredible! Now, we need to be patient as every legal ballot is counted. When the results are confirmed, we must accept the outcomes with respect for our democracy, the process &amp; the people who work tirelessly to facilitate our elections.","date":"Wed Nov 04 19:20:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thank you #IL16 !","date":"Wed Nov 04 04:52:19 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"We live in the greatest country on Earth and today, millions of Americans will exercise their right to vote in a free &amp; fair election. This is special—&amp; it’s a reminder that our greatness stems from our freedoms. May God Bless the USA &amp; all those who defend her. 🇺🇸","date":"Tue Nov 03 22:01:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"No person (even remotely associated with the US Government) should ever talk to a RT reporter.  Pure garbage propaganda wrapped in a professional presentation.","date":"Sun Nov 01 19:15:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Listen.  Surrounding a bus with a mob doesn’t show strength, burning buildings with a mob doesn’t show strength.  Both show WEAKNESS and FEAR.  Strength is winning the argument at the ballot box.","date":"Sun Nov 01 15:47:59 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Watching our ally #Georgia ‘s elections.  I encourage all to vote, stay calm, and let the process work.  There is no place for cheating, intimidation, or vote buying in a free and fair election.   Our nations are strong + united, and America is hopeful for #Georgia ... @usingeo","date":"Sat Oct 31 13:50:05 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/bf0vSeMEcY","date":"Thu Oct 29 22:11:15 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Uh no.  The FBI knows what it’s doing here.  Don’t worry, the mobs on twitter will hate you no matter what you say, it’s not real life.  #TheMoreYouKnow","date":"Thu Oct 29 01:39:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"On this #NationalFirstRespondersDay and every day, I'm grateful to the brave men and women on the front lines who go above and beyond to keep us safe--especially in times like these. Thank you to ALL our first responders in #IL16 and across the country! https://t.co/Ss2nhWdk6D","date":"Wed Oct 28 21:08:05 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Addiction is a disease, not a moral failing. And as a society, we must do more to fight the stigma &amp; help those who are struggling. \n\nTwo years after it was signed into law, we continue to move #ForwardwithSUPPORT in our fight against the opioid epidemic. https://t.co/CtjFprigMG","date":"Mon Oct 26 21:14:52 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today is National #DrugTakeBackDay and an opportunity for Americans across the country to help prevent drug addiction and overdose deaths by safely disposing of their unused medications. Learn more about this effort @DEAHQ. https://t.co/xfcOm86EGS","date":"Sat Oct 24 19:58:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Amen.  True grace and humble leadership.","date":"Fri Oct 23 23:31:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@RepClayHiggins From one member of congress to another, maybe sit the next tweet out.  Wow.","date":"Fri Oct 23 23:24:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The United States cannot continue to sustain these attacks on our democracy and then not counter. Russia and Iran will not stop exploiting our cyber vulnerabilities unless we make them stop.  https://t.co/khsDkUIIE2","date":"Thu Oct 22 17:37:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Montel_Williams thanks for your tireless advocacy for @freetrevorreed and so many others.","date":"Wed Oct 21 17:40:07 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thank you to our @ilprincipals for their dedication to our students &amp; faculty, &amp; for taking the lead in education amid this pandemic. I'm proud to join in celebrating Principals Week during this National Principals Month of October. #principalstrong https://t.co/hakcZqK42k","date":"Mon Oct 19 17:19:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is typical of Russia to evade having to take responsibility for their reckless, deadly actions—and it’s completely unacceptable. \n\nThe victims of #MH17 &amp; their families deserve the truth, and they deserve justice.","date":"Sat Oct 17 21:25:20 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"ICYMI: I spoke with @CBSSunday (video below) about #QAnon &amp; the damage such conspiracy theories can have on our government &amp; our society as a whole. As I said in my recent op-ed on @Medium, QAnon has no place in Congress: https://t.co/2W4Jf0GDk8 https://t.co/bkLQMYq6u1","date":"Thu Oct 15 17:36:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Russia, China, Cuba elected to serve on the UN Human Rights Council — what an absolute disgrace.","date":"Wed Oct 14 00:11:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Happy birthday to our @USNavy! Thank you to our Navy veterans and to the men and women currently serving for their dedication and valor. Here’s to the next 245 years and beyond for the world’s largest naval force. #Navy245 https://t.co/y6uaxvljab","date":"Tue Oct 13 22:32:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing our friends a very happy #NationalTaiwanDay today!","date":"Sat Oct 10 18:50:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Last week, @HouseForeignGOP passed legislation calling for the immediate release of both Trevor Reed &amp; Austin Tice, two Americans being wrongfully detained by Russia &amp; Syria. Proud to support these measures &amp; help bring our fellow Americans home. #FreeTrevorReed #FreeAustinTice https://t.co/6PSiWCJmIh","date":"Thu Oct 08 17:08:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just because we're approaching November doesn’t mean we have to stop legislating by consensus-building. We need to get serious about good-faith negotiating in Congress &amp; we need to get serious about energy independence &amp; reducing emissions. #NuclearMatters https://t.co/hAkeznyd9M","date":"Wed Oct 07 15:26:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"As the son of a retired elementary teacher, I know how important a good education is for shaping the next generation. Today, we celebrate the incredible teachers in #IL16 &amp; around the world who work tirelessly to help give hope &amp; opportunity to our students. #WorldTeachersDay https://t.co/weqJVUUQu5","date":"Mon Oct 05 22:41:56 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"A true servant leader and strong advocate for the Rockford community. Sending my prayers and condolences to the McNamara family.","date":"Sun Oct 04 20:40:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Manufacturing creates thousands of jobs &amp; spurs strong economic growth here in Illinois &amp; across the country. I’m proud to represent this hardworking industry here in #IL16 &amp; remain committed to supporting them as we restore, rebuild, &amp; renew America. #MFGDay2020","date":"Fri Oct 02 18:08:37 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"It's our duty to come together &amp; address the urgent needs of those impacted by #COVID19. We've done so many times w/ bipartisan effort. But tonight, @SpeakerPelosi chose politics over the American people. I’m disappointed, &amp; I’m sure I’m not alone in that. https://t.co/9E2LYD0jKG","date":"Fri Oct 02 01:02:29 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud to join my colleagues on the #ChinaTaskForce in unveiling this comprehensive blueprint to counter the malign global behavior of the #CCP. My full statement on our final report can be found here: https://t.co/LbSUsSn2FE https://t.co/5z0EmruLxx","date":"Wed Sep 30 17:30:06 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Starting 🔜 @China_TaskForce @RepMcCaul unveils our final report on addressing the threats and vulnerabilities we face with China. 📺 Tune in to our 10am ET press conference with @GOPLeader here: https://t.co/TcskxJsLKI","date":"Wed Sep 30 13:50:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Impossible to address the true threat Russia poses if we only react to Putin’s attacks &amp; remain ignorant of his power grabs. Germany should see that now &amp; join us in placing sanctions on #NordStream2 to protect European security. My op-ed w/ @DennyHeck 👉https://t.co/JMwA0enYWI","date":"Tue Sep 29 20:40:03 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Congratulations to Luis Alberto Mendoza of Loves Park #IL16 on being named a @Carnegie_Hero for his heroic actions in saving a woman &amp; two children from a blazing fire last year. We're proud to have Luis in our community &amp; applaud his bravery. https://t.co/bKed4l4u9C","date":"Fri Sep 25 16:57:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Jefferson defeats Adams in 1800, setting up first peaceful power transition in America.  This is fundamental, and will be preserved.  I’ve taken the oath for military and Congress.  I will uphold that oath.","date":"Thu Sep 24 14:27:26 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"My statement on the passing of Justice Ruth Bader Ginsburg. May she rest in peace. https://t.co/pejMmZYwFB https://t.co/fYiQAC0zzc","date":"Sat Sep 19 02:15:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is great news for our farmers here in #Illinois &amp; across the country. Advancing our trade agreements helps to further strengthen the U.S.-Taiwan relationship, which is a benefit to all. Thank you, @iingwen! \nhttps://t.co/lVRHLCK7pA","date":"Fri Sep 18 19:54:08 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Let's celebrate #ConstitutionDay by reading the enduring document that established America's framework &amp; enshrined the principles of freedom we hold dear. In our continued effort to form a more perfect union, our civic education &amp; engagement is critical. https://t.co/7nLWF4E4oP","date":"Thu Sep 17 18:35:06 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Now more than ever, we need hope for the future &amp; a plan to get America moving again. That's exactly what the #CommitmentToAmerica is all about. Learn more about the @HouseGOP proposal that will rebuild, restore, and renew this great nation. https://t.co/KwRFKvGlwR","date":"Tue Sep 15 19:53:30 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Honored to be named a Congressional Champion by @indefchristians again this year, as we continue to work on putting forth policies that safeguard the human rights of all people, regardless of one's religion. https://t.co/bfD57lJry9","date":"Mon Sep 14 20:28:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"19 years ago today, America was attacked by terrorists who hate our freedom &amp; our hope.\n\nToday, we remember the innocent lives lost on #September11 &amp; all our brave first responders.\n\nMay we #NeverForget how we rallied together as a nation—united at a time when we felt so broken.","date":"Fri Sep 11 13:18:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"It's officially #BackToSchool season &amp; my office has restarted our internship program for the fall semester. \n\nAs we all continue to adjust to the challenges of #COVID19, I'm grateful to have our interns--like Tyler here from #IL16--making the most of this remote internship. 👍 https://t.co/9looWHvctA","date":"Wed Sep 09 21:43:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/KacIExA0ez","date":"Fri Sep 04 22:44:32 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"My statement on concerns with the country of Georgia’s upcoming election. https://t.co/olA4xQOcQq","date":"Thu Sep 03 22:50:01 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today, we celebrate the end of #WWII on this 75th anniversary of #VJDay -- the day when Japan surrendered to our allied forces. Today, we remember the courage and sacrifices of the Greatest Generation, and all they did to preserve &amp; defend our freedom.","date":"Wed Sep 02 22:29:05 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is great! I’ll never forget my first flying lesson and that feeling when I was about to fly on my own. ✈️","date":"Tue Sep 01 15:34:34 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The decision to close the Byron &amp; Dresden power stations in #IL16 is a gut-punch to the people of Illinois, devastating to zero-emissions nuclear energy, &amp; a sad casualty of the self-serving, corrupt politics of Mike Madigan's Springfield. https://t.co/wIOoNggHoZ https://t.co/ngrVMo39SC","date":"Thu Aug 27 14:35:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@carloslcurbelo I think you sound just fine my friend.","date":"Wed Aug 26 19:15:31 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Disturbing video.  A brief reminder to #Putin that we overwhelmed and killed hundreds of Russian in Syria a few years ago.  Not a game you will win.","date":"Wed Aug 26 16:49:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Destroying property, burning buildings, screaming at diners, riots, looting etc is not peaceful, not protected by the First Amendment, and should NOT be allowed to terrorize people of #Kenosha #Portland #DC #Chicago or anywhere.  Leaders must protect people and property now","date":"Wed Aug 26 00:32:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This week, I heard from farmers across #IL16 about the major issues impacting our agriculture community &amp; the economy overall. As I shared with @FarmWeekNow, we have to strengthen areas where we are vulnerable, especially in our supply chain. https://t.co/YLNxCzMu5b","date":"Fri Aug 21 21:44:11 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Disturbing to see what looks like another heinous, cowardly attack on someone who has stood up against the corrupt Putin regime &amp; speaks out for freedom. My prayers are with Alexei Navalny &amp; his family, for his health &amp; for justice to be served.","date":"Thu Aug 20 18:08:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Here is a reminder of QAnon’s track record, this is the first “drop” that shows all the “insider knowledge.”  Let’s be clear, Complete BS.  Whoever wrote this does not “love our country” they seek to mislead and destroy it, @realDonaldTrump https://t.co/1zTlQLshKE","date":"Thu Aug 20 01:58:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Every voice deserves to be heard. Today, we celebrate 100 years since the #19thAmendment was ratified, ensuring a woman's right to vote &amp; pushing us towards a more perfect union. We honor those who fought so fearlessly for this victory by continuing the fight for equality. https://t.co/L5Bm3si6ui","date":"Wed Aug 19 01:16:03 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The @USPS is a public service for the American people &amp; has been since our Founding. For years, the Postal Service has faced delivery problems, but these mail delays are especially concerning for our seniors &amp; rural communities in #IL16. The issue needs to be resolved swiftly.","date":"Tue Aug 18 01:06:51 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This was the point from the start.  We didn’t know who paid, or if both paid.  Those angry about Russian Bounties now hopefully realize killing Solemani of Iran was right to do, since he killed HUNDREDS of American soldiers.  Russia must pay a heavy price if they did as well.","date":"Mon Aug 17 13:19:06 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"How selfless.  \n\nRussia offers military help to Belarus https://t.co/umC3HkPJ7U","date":"Sun Aug 16 20:29:55 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"We have to be vigilant about bad actors like QAnon who spread misinformation &amp; sow chaos through social media. And we have to make it our responsibility to ensure these conspiracy theories don’t take root &amp; damage the foundation of our society. https://t.co/7CKZkjQ7mC","date":"Sun Aug 16 14:10:41 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Of course you are.  FYI 👇 https://t.co/8K40kcroD2","date":"Sun Aug 16 03:45:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"#Snowden is a traitor, and deserves prison time.  He is no hero.  This would be a mistake of massive proportions, and would send a signal that every “angsty clown” gets to reveal everything to our enemies.  Ever wonder why he is safe now.... in RUSSIA?","date":"Sun Aug 16 03:24:37 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Alarmed, though not surprised, of indications of impending #Russia invasion against the freedom-demanding people of #Belarus.  World must prepare crippling response to the #Putin regime. The Russian people deserve the truth.... many dead Russian soldiers hidden by Putin.","date":"Sat Aug 15 18:09:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Cernovich Epstein is dead.  I also hate hitler, polpot, Castro, John Wayne Gacy, etc. There.","date":"Wed Aug 12 20:27:31 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Qanon is a fabrication.  This “insider” has predicted so much incorrectly (but people don’t remember PAST predictions) so now has switched to vague generalities.  Could be Russian propaganda or a basement dweller.  Regardless, no place in Congress for these conspiracies.","date":"Wed Aug 12 15:01:50 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@such_politics THAT is a legit argument.  One i see merit in.  Not white supremacy in a battlefield won by the north.","date":"Tue Aug 11 02:40:02 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Yes Gettysburg, where the north won and turned the tide of the war and slavery.  I have no idea who on Earth thinks of Gettysburg as devotion to white supremacy.  “...dedicated to the proposition that all men are created equal.”  Republican Abraham Lincoln","date":"Tue Aug 11 02:33:57 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Still amazes me how many outright defend this. This is not first amendment expression, this is pure criminality.  Thanks to the @Chicago_Police for their work, and I hope @chicagosmayor and @GovPritzker start supporting you again.","date":"Mon Aug 10 14:05:28 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This week marks 12 years since Russia’s invasion of Georgia. I spoke with @MFAgovge @MiddleEastInst today about the need for de-occupation, &amp; shared this message to reaffirm U.S. support for Georgia’s sovereignty &amp; independence. https://t.co/paCXKFyLzt https://t.co/xXvmSKQmV6","date":"Sat Aug 08 01:33:12 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The Purple Heart is the nation's oldest military award, established by George Washington #OTD in 1782 ‘for military merit.’\n \nToday, we recognize #PurpleHeartDay to honor those who have been wounded or KIA for their courage &amp; sacrifice in service to this great nation. #HonorThem https://t.co/4aJ4hucbLB","date":"Fri Aug 07 17:05:27 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@NickJFuentes https://t.co/CiAXaQ03nU","date":"Wed Aug 05 03:24:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"As we continue to follow the breaking news out of Beirut, the source of the explosion remains unclear yet the damage is already extensive. Our prayers are with the victims and the people of Lebanon.","date":"Tue Aug 04 16:46:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wow.","date":"Tue Aug 04 16:30:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Ryan13Mike And the CCP vote!","date":"Sun Aug 02 19:15:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"#TikTok needs banned in the US, -or- an American company like Microsoft should be allowed to buy it so long as all ties cut with the Chinese Communist Party.","date":"Sun Aug 02 19:14:15 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Yes!!!  Nice work #SpaceX and #NASA!  @JimBridenstine and @elonmusk make us proud!  This is a new Golden age of space exploration.","date":"Sun Aug 02 18:52:44 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"During this #COVID19 pandemic, getting outside has never felt so important to our daily lives &amp; mental health. Our bipartisan efforts to invest in our public lands is critical &amp; long overdue. America is a beautiful country, so let’s take care of her. https://t.co/CsiTq0JcXv","date":"Fri Jul 31 16:20:29 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Watch now.","date":"Fri Jul 31 15:03:49 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is indeed disturbing.  The bounty specific issue is not cut and dry, but we know Russia has supplied Taliban under guise of “fighting ISIS.”  This at a minimum needs exposed and should lead to real consequences for Russians.","date":"Wed Jul 29 14:47:18 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@zombie_esq You guys need new material","date":"Wed Jul 29 03:36:16 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JordanAckerMI So rep Castro said we should pass a law preventing that kind of thing, so by definition the arrest isn’t illegal or that would imply the law exists.","date":"Wed Jul 29 03:35:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@MariManoogian As a state rep you should know better.  The law is the law, passed by people like you and I.","date":"Wed Jul 29 03:33:14 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Maybe stop the violence and rioting?","date":"Wed Jul 29 03:26:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"But..... peaceful protests!   Police using tear gas=criminal.  Explosive devices at police=protesting peacefully.","date":"Tue Jul 28 00:09:06 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TonesHyus @NRCC Ya i do see the irony.  But still.","date":"Mon Jul 27 22:45:16 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@CoreyHenson76 @NRCC I’m technically a “xennial” which is evidently a real thing","date":"Mon Jul 27 22:44:13 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"It was great to meet our 2020 #IL16 Art Competition Winner, Marlen Hueramo of Rochelle HS, &amp; congratulate her on this outstanding achievement.\n\nI look forward to welcoming Marlen to DC in the future, &amp; seeing her beautiful artwork on display in the halls of Congress. https://t.co/1lafmyHFn1","date":"Mon Jul 27 18:11:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@NRCC Also the Karen thing was funny for a couple weeks, now it’s way overplayed.","date":"Mon Jul 27 18:00:14 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"I agree with Kurt.  Stop.","date":"Mon Jul 27 17:46:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Every rioter takes video.  But they attack outsiders for doing the same.  This is standard ops for them.  They don’t want their tactics/evil exposed, and they can selectively edit their own videos.  How is this defensible?","date":"Sun Jul 26 04:18:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Earlier this year, I spoke with @ChrisEvans &amp; @MarkKassen about romance scams on social media. Misinformation runs rampant online &amp; it's something I'm working to address in Congress. I'm glad to see @ASP launch their unbiased platform for information. https://t.co/EMkv2zWJxP","date":"Fri Jul 24 17:39:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"May we remember their sacrifice &amp; dedicated service with gratitude for the heroes of our #ThinBlueLine. #HonorThem","date":"Fri Jul 24 15:32:16 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"A world where America takes a back seat to Chinese leadership is a world where democracy dies, freedom falters, &amp; authoritarian rule dominates the world. I applaud @SecPompeo for taking this stand today.","date":"Thu Jul 23 21:26:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Turkey ignored warnings from NATO members about this arms deal with Russia, &amp; now they must be held accountable for their actions. The Turkish regime needs to destroy the S-400 &amp; recommit to @NATO before the damage is irreparable. https://t.co/IjingFMa2h","date":"Thu Jul 23 14:43:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Last month, Congress passed legislation to extend the Paycheck Protection Program (PPP). There's currently $122B left in the fund, so if you're in need of this forgivable loan due to #COVID19, visit @SBAgov for more information: https://t.co/6FZQFwc4HK https://t.co/vj4VonPQIG","date":"Tue Jul 21 16:37:24 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Our global dependence on China's labor market allowed the CCP to consolidate power &amp; use it against us. Now, the U.S. must act BOLDLY to protect our critical supply infrastructure with a strategy that puts economic freedom first--for us &amp; our allies. https://t.co/TMyjJifkVK","date":"Mon Jul 20 16:12:07 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"It was a true honor to serve in Congress with @repjohnlewis &amp; my heartfelt prayers are with his family. An American icon, his legacy of courage &amp; sacrifice will continue to inspire us, his moral integrity &amp; dedication to justice will continue to be our guiding light.","date":"Sat Jul 18 14:36:48 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Cheers to 125 years of @NIUlive! We have a LOT of #HuskiePride here in #IL16 boasting the most NIU students, employees, &amp; vendors AND the 3rd most alumni. I'm honored to represent this great institution &amp; look forward to their continued excellence for our students &amp; community.","date":"Wed Jul 15 21:23:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wow.  Just wow.","date":"Wed Jul 15 02:08:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Getting trolled by Russian bots on Twitter? Yep, just a normal Tuesday.\n\nThis is what Putin does. He targets freedom-loving people, tries to meddle in democratic elections, &amp; sows chaos for his own personal gain. It’s pathetic, but hey, that’s the Putin regime.","date":"Tue Jul 14 15:39:59 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Religious convictions and beliefs = “whims” to @GovPritzker","date":"Wed Jul 08 16:27:20 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is a real opinion piece about racist traffic lights.  We should aggressively tackle actual injustice and feel free to openly discuss how we ALL feel, but stuff like this makes that more difficult.  This is moving from justice- to payback.","date":"Tue Jul 07 23:04:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Your service is commendable but does not immunize you from criticism especially as you inject yourself into the VP lists.   You called for a “national dialogue” on whether to tear down Washington monuments....","date":"Tue Jul 07 13:56:22 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Had a great time this morning visiting @CrusaderHealth in #IL16, hearing about how they‘ve adjusted so seamlessly to the challenges of #COVID19 &amp; utilized tele-health to better serve patients in our community. Thank you for all the great work you do! https://t.co/iT5bKunMJ8","date":"Mon Jul 06 19:44:20 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"No, her life was taken by a senseless murderer, and it’s unconscionable. This weekend, 15 people were killed in Chicago, where violence runs rampant. The city needs leadership, not a continued failure to take any responsibility.","date":"Mon Jul 06 14:09:16 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@ericswalwell https://t.co/yoYPzUqv8O","date":"Sun Jul 05 01:33:18 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Today, we celebrate this great nation &amp; all who worked hard &amp; sacrificed to secure our independence. As we continue striving towards a more perfect union, may God Bless the USA. On behalf of myself &amp; my wife Sofia, we wish you all a very safe &amp; happy Fourth of July! 🇺🇸","date":"Sat Jul 04 17:47:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@ProjectLincoln @milguy23 From the NYTimes. https://t.co/FDLTu7FJYY","date":"Sat Jul 04 02:55:22 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Can’t wait to watch.  The book was one of the best I’ve read, and @jaketapper has a real heart for these men.","date":"Sat Jul 04 01:36:13 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Ok.  I mean, please this is insane.  I’m proud of America, our history, and our people.  God Bless this amazing land.  (synopsis of replies to this tweet:  1: but trump, 2: what about (fill in issue);  3: Russia/virus/other non related issue. 4: statues comment. 5. Etc...).","date":"Sat Jul 04 01:01:22 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Color me surprised.  \n\nLos Angeles mayor admits protests caused a spike in coronavirus cases https://t.co/QDACnilFzu via @MailOnline","date":"Fri Jul 03 13:24:02 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"1/4: Real talk.  Despite President’s comments, this is no hoax.  Despite Democrats rage, Intel is complicated and not as cut and dry as it reads in articles.  Foreign policy should be free of politics...","date":"Thu Jul 02 00:18:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"2/4:  We killed Soleimani who is confirmed to have killed hundreds of Americans... yet some of those outraged over this were outraged that we killed him (and predicted WW3)...","date":"Thu Jul 02 00:18:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"4/4:  Let’s get to the bottom of this and take action if true; but as AMERICANS.  Many died so we can freely debate.  We dishonor them by putting our November “hopes and dreams” before our duty to lead a broken world and protect our people.","date":"Thu Jul 02 00:18:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"3/4:  Politics won’t save American lives.  I defended Obama many times on foreign policy against my own party, and yes, there are examples where we all fall short, but judging complex foreign policy issues through your disdain or love of POTUS is dangerous...","date":"Thu Jul 02 00:18:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"I have seen the intelligence &amp; I want to be clear: this is very serious &amp; deserves a strong reaction, if true. The NYT report does NOT paint the whole picture, and we need to put the politics aside. Our outrage should be directed at Putin.","date":"Wed Jul 01 16:19:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Congrats to Parliament of #Georgia on final passage of amendments, and commend those who participated to ensure passage. I continue to call on all parties to fully implement March 8th agreement, and thank @usingeo and Amb Degnen for continuing hard work and essential role.","date":"Mon Jun 29 13:21:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@jacque3125 Might make sense to look at prior tweet prior to posting.  Boop","date":"Sun Jun 28 22:48:18 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Chinese law allows access to data in China (where #tiktok is) that can be used to build a picture for blackmail, corporate espionage, influence, etc.  Far different than US companies (remember face swap app?)  Even some In Congress use it, sadly.  Be warned.","date":"Sun Jun 28 22:33:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Absolutely.","date":"Sun Jun 28 14:13:57 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@lyonssj55 Look one tweet earlier.  I’ll wait....","date":"Sat Jun 27 13:52:14 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@DavefromTO https://t.co/Trrn1PxU06","date":"Sat Jun 27 13:41:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Unreal.  This is no longer about anything but Marxist revolution.  We need to wake up.","date":"Sat Jun 27 13:39:20 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Russia is not a partner, and not to be negotiated with. @realdonaldtrump needs to immediately expose and handle this, and stop Russia’s shadow war cc: @jimsciutto  \n\nRussia Secretly Offered Afghan Militants Bounties to Kill U.S. Troops, Intelligence Says https://t.co/k6oZNKP2lG","date":"Fri Jun 26 22:45:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Despite its popularity in use, I‘ve become increasingly concerned by @zoom_us censoring users on behalf of the Chinese gov’t, as well as security vulnerabilities. Until we can alleviate these concerns, federal agencies should not conduct business on Zoom. https://t.co/jB8TtghxDv","date":"Fri Jun 26 16:28:12 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@doublehappi @Mleone127 https://t.co/PuOyuT1qlO","date":"Fri Jun 26 02:58:03 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Mleone127 https://t.co/g4I7KnD39X","date":"Fri Jun 26 01:25:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thank you to our law enforcement out there tonight defending this important piece of history, unveiled with a speech by none other than Frederick Douglass himself.","date":"Fri Jun 26 01:22:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Completion of the Nord Stream 2 pipeline would give Putin the ability to hold our allies hostage. Today, my colleagues &amp; I introduced legislation to expand sanctions on this project &amp; ensure that never happens. https://t.co/3sFh9XGTdK","date":"Thu Jun 25 20:08:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Toby38309489 https://t.co/vzQWyE92kj","date":"Wed Jun 24 03:12:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@darthruden https://t.co/i2Ihs03EHz","date":"Wed Jun 24 02:57:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Toby38309489 https://t.co/hiFbhr0w8v","date":"Wed Jun 24 02:06:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is Bolshevik, Marxist, and ignorant.  Yet somehow some will defend this sentiment. (Or attack Trump in their response instead.)","date":"Wed Jun 24 01:52:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Misinformation &amp; propaganda run rampant in authoritarian-ruled countries, and the @USAGMgov plays a critical role in pushing back with open-source information. I’m deeply concerned by this decision to fire the leadership of these outlets that serve as a lifeline to millions.","date":"Mon Jun 22 18:04:34 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The overreaction continues","date":"Sun Jun 21 21:34:31 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@BlairWeddings https://t.co/SdT8TxTw7d","date":"Sun Jun 21 20:58:28 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@erenpere That’s what i was thinking but you threw me for an existential loop","date":"Sun Jun 21 20:57:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@adam_theis https://t.co/u4z86o6u2l","date":"Sun Jun 21 20:50:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@pitacom He did try to get me to eat more veggies but i was a rebel","date":"Sun Jun 21 20:43:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@PakMeiSifu @AdamKinzinger Both","date":"Sun Jun 21 20:02:11 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@erenpere Sliiiiiighty","date":"Sun Jun 21 20:01:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@erenpere Don’t think so.... but ya he’s 6’4 and I’m slightly under that. Guess that makes me female?","date":"Sun Jun 21 20:01:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Happy Father’s Day to my favorite copilot, and to all of you! https://t.co/Y5MyuBhy4S","date":"Sun Jun 21 19:58:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Congratulations Georgia!  A long road, but well worth it.  To PM Gakharia, Speaker Talakvidze, leaders of the Opposition, and the citizens of Georgia, we stand with you!\n\nGeorgian Parliament Endorses Constitutional Amendments in First Reading https://t.co/D3eqnb4Wd5 via @CivilGe","date":"Sun Jun 21 15:15:41 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s important to remind people that TikTok (Chinese Company that abides by Chinese Govt laws) is a threat to US national security.","date":"Sun Jun 21 14:13:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Marxist weirdos.  Yep 100 %","date":"Sat Jun 20 13:48:53 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Anesthesia_Nerd Is this the same time I invented ISIS with the cia?","date":"Sat Jun 20 13:31:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@MCadiz8 Not that I’m aware","date":"Sat Jun 20 13:29:29 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is no longer about an issue, it’s about chaos and Bolshevik-ism.  It’s time for the police to stop this insanity, and for Dems to call it out\n\nProtesters tear down statues of Union general Ulysses S. Grant, national anthem lyricist Francis Scott Key https://t.co/OdbZ1WmPRf","date":"Sat Jun 20 13:21:55 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@stitchtawney88 @JackRoshco @TuttyBaker ^this","date":"Sat Jun 20 02:11:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@JackRoshco @TuttyBaker Sorry man.  Try again, unless everyone is protesting in their own home which didn’t seem the case","date":"Sat Jun 20 02:09:52 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TuttyBaker What part did i forget?","date":"Sat Jun 20 01:02:13 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"When demonstrating on a public street, you can’t demand police don’t watch, especially when some are destroying property and burning police precincts.  It’s the job to protect.  \n\nU.S. Watched George Floyd Protests in 15 Cities Using Aerial Surveillance https://t.co/6zmgeYpkRz","date":"Fri Jun 19 22:47:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Juneteenth should be a federal holiday, not just as a reminder of the evils of slavery and racism, but also of our nation's continued, imperfect path toward a more perfect union; a Union in which all people are created equal by God AND treated equally under the Law.","date":"Fri Jun 19 15:28:30 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is incredible.  American flag burned on Washington’s head and statue pulled down.  I’m proud to be an American.... we must not let Bolshevik mobs erase our history.","date":"Fri Jun 19 12:24:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"2). To my Democratic friends, the Guard was called in AFTER violence started at the request of (in my case) a Democratic Governor to allow peaceful protests.  Vilifying the Guard for your political needs is just wrong.","date":"Fri Jun 19 01:13:15 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"I offered to talk to Sen. Chris Murphy about this, but seems he was more interested in the headline.  The IG is “investigating” at his request.  Will be interesting to read his retraction when dismissed.  Proud to have protected my Guard family from above, they deserve no less.","date":"Fri Jun 19 01:02:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Here’s a reminder that we could have done DACA and border security, but the house freedom caucus” killed it.  Courts shouldn’t have to do our job. \n\n‘I thought you were my friend’: Immigration meltdown exposes GOP hostilities https://t.co/Wi8M82cJIM via @politico","date":"Thu Jun 18 15:07:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Well said","date":"Thu Jun 18 01:54:07 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Her faith was evident and she is with our Father in heaven.  God Bless you and your family my friend.","date":"Wed Jun 17 23:08:36 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Congratulations to our #IL16 2020 Congressional Art Competition Winner: Marlen Hueramo of Rochelle Township High School. Her artwork titled ‘El Loro’ will soon hang in the halls of the U.S. Capitol! 👉More on this &amp; our honorable mentions here: https://t.co/2Cvy0GXKrc https://t.co/6GsLha6VSe","date":"Tue Jun 16 16:02:14 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Godspeed.  America is blessed for his service and we grieve with you.","date":"Mon Jun 15 23:46:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"A twitter spat between and actor and congressman, a Senator challenging to a wrestling match, and we wonder why people feel disillusioned?  We all need to do better.","date":"Mon Jun 15 20:26:22 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This sentence is outrageous, and the result of a sham of a judicial process in Putin’s Russia.","date":"Mon Jun 15 16:23:50 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@jaketapper Agreed.  Stop","date":"Mon Jun 15 12:51:34 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@uniteandrebel Hey Jeffrey!  Care to elaborate on what you mean with the “bad aim” comment you tweeted at midnight?","date":"Mon Jun 15 11:18:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@perlmutations Kids...... knock it off, mom and I are trying to sleep.","date":"Mon Jun 15 02:25:37 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"FYI: this tweet was a response to @SteveScalise on a video he posted  noting the anniversary of when he was shot.  This is one of many like this.  We wonder why our dialogue is suffering?  Glad Steve is with us still and so is his family.","date":"Mon Jun 15 00:50:56 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"For 245 years, our @USArmy has served this nation proudly. Thank you to the men &amp; women who sacrifice for our freedom. Today, we celebrate both #ArmyBday and #FlagDay, honoring the Stars and Stripes &amp; all who defend the values we hold dear, that Old Glory 🇺🇸 represents. https://t.co/1eP94ab1KM","date":"Sun Jun 14 16:55:31 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Absolutely.  Glad you said it.  While negativity will have a role in dialogue, Americans desperately need inspiration, and real talk.","date":"Sat Jun 13 20:35:18 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Maybe time to get off @zoom_us since they are eager to please the Chinese Communist Party.  Who know what they allow to happen.","date":"Sat Jun 13 14:14:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@MacMommy88 @TraumaJunkie699 He is entirely wrong.  We have serious issues.   The worst in the world?  Hardly.  \n\nhttps://t.co/gipTWgKpCk","date":"Sat Jun 13 12:58:12 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@TraumaJunkie699 Uhhhhhh....","date":"Sat Jun 13 00:33:55 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"America is an amazing country.  We discovered aviation and conquered the moon, destroyed communism and set those behind the iron curtain free.  Today’s challenge is from within.  Let’s overcome division and pass our kids a nation even better than we inherited. #America","date":"Fri Jun 12 23:49:26 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Of course it does.  Can’t have things like “law” or “order” blasting into the minds of our youth.","date":"Fri Jun 12 23:01:38 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Stevegouk *you’re","date":"Fri Jun 12 22:57:02 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Here’s to you, the Class of 2020. I know this year didn't end how you imagined, but you did it--you graduated and THAT is something to be celebrated. Congratulations! #IL16 https://t.co/6oxXrc9Qea","date":"Fri Jun 12 18:50:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@beverstine “Gathering intel.”  From a Democratic Senator https://t.co/rVOcJg49z6","date":"Thu Jun 11 22:53:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@beverstine Googled it for ya.  Read the end.  \n\nhttps://t.co/CCSo8ah8ky","date":"Thu Jun 11 22:41:44 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"My full statement on the latest conspiracy theories: https://t.co/70FWo0ee8a https://t.co/3b7ZWGIYFS","date":"Thu Jun 11 22:21:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Real story that is actually about real words someone said:  \nCNN's Angela Rye: Washington, Jefferson Statues \"Need To Come Down\"  https://t.co/vrgYcezim9","date":"Thu Jun 11 13:02:37 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@Just_Here_4Food Petoria.  I think he ran out of food.","date":"Thu Jun 11 11:35:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just a few weeks ago there was outrage that conservatives would dare protest against state lockdowns.  But an autonomous zone is cool evidently.","date":"Thu Jun 11 11:26:08 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Three weeks after this story, Officer Mark Dallas responded to shots fired in Dixon High, and stopped a school shooting.  Defunding police is a bad idea, accd to history. \n\nIllinois plan: Replace armed school officers with therapists https://t.co/usIgZGREEB via @thesouthern","date":"Wed Jun 10 22:30:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is an overreaction.  #LivePD better stick around.","date":"Wed Jun 10 21:56:24 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"My full statement on the President’s decision to remove U.S. forces from Germany: https://t.co/j2FpXsgl3O https://t.co/rMxZzTFFt0","date":"Wed Jun 10 18:57:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"We are facing a moment in history that requires ALL of us to acknowledge the problem &amp; work together to resolve it. We can &amp; must do more to eradicate racial bias and we can &amp; must do so without the politics; without threats to defund our #ThinBlueLine. https://t.co/e0TKsKtEfZ","date":"Mon Jun 08 23:54:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sick of all these hurricanes.  #Defund the Weather Channel!","date":"Mon Jun 08 12:05:27 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Exactly what Chicago needs.... defunding the police.   It would be a violence free utopia except all those dang police funds.","date":"Mon Jun 08 03:17:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"By honoring our past, we secure our future. #DDay\n\nIn the early morning hours of June 6, 1944, our Allied forces stormed the beaches of Normandy, fighting valiantly to save the free world.\n\nToday, we remember all who courageously served &amp; sacrificed in this most daring mission. https://t.co/G6UxC9sQbr","date":"Sat Jun 06 14:40:55 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Because of this tweet, Gen. Rice of the Air National Guard ordered all these planes grounded.  They weren’t gathering intel or spying. Only have a camera.  Were protecting infrastructure, Army Guardsmen, and protesters, by DEMOCRATIC Governors in other states.  @realDonaldTrump","date":"Sat Jun 06 13:40:56 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is what I mean.  Removing people from a hotel who flew all the way from Utah and other places to defend you, while you let your pharmacies get ransacked is insane.  \n\nThe D.C. Mayor Just Kicked National Guard Troops Out of Local Hotels  https://t.co/XevLVF6j8X","date":"Fri Jun 05 20:41:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"6) Be sure to reject the politicians politicizing the Guard, and thank a Guardsman for their service today.","date":"Fri Jun 05 18:06:59 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"1)  Sadly, the Guard issue needs a thread:  The Guard started as a bunch of farmers who won our independence from the British.  The Guard is under the command of each governor, in the current moment many Democratic govs have called up their Guard.  Not partisan.","date":"Fri Jun 05 18:06:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"2)  Guard officers like me have both a Federal and State commission.  President can call the Guard to federal service for war, (Guard bore a lot of the war burden since 2001), and other areas, but not for riots.  Governors can.","date":"Fri Jun 05 18:06:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"4)  Just like the military wasn’t taking over Texas when the Jade Helm conspiracies spread, the Guard isn’t taking over DC.  Where the Guard is present in other areas there have been mostly peaceful protests.  In places like Chicago with no Guard there has been rampant looting.","date":"Fri Jun 05 18:06:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"3) POTUS is the Commander of DC guard since 1803, and acts as Gov of DC in that respect, and can use them as any Gov would.  Yes the Guard surrounded the Lincoln Memorial, and it remained free of vandalism, unlike the WW2 memorial a few days prior. Wish they had been there.","date":"Fri Jun 05 18:06:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"5)  The Guard is not faceless, it is made up of people from all backgrounds and careers.   They have been activated for Covid, hurricanes, counter narcotics, etc.  They are well trained and extremely disciplined.","date":"Fri Jun 05 18:06:58 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@speakerpelosi The Guard was not used when the protest started.  They were used when the violence did, and by some Democratic governors.  Feel free to ask your Guard questions to them as well, and refer to the Assumption Act of 1802 for chain of command details in DC.","date":"Fri Jun 05 15:12:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"My full statement: https://t.co/GHKUn8hQoD","date":"Thu Jun 04 01:07:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The right to protest does NOT cover\ndefacing US memorials, burning historic buildings, or looting from &amp; destroying businesses.\n\nThis heinous, violent rioting derails the real grievances that need to be addressed.\n\nWe need leadership &amp; we need order restored NOW!","date":"Mon Jun 01 15:27:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Nothing short of actual, real, genuine evil.","date":"Mon Jun 01 02:41:08 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"“Peace, be still.”","date":"Mon Jun 01 02:17:29 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Vandalizing the WW2 memorial.  Maybe we need a national history class on what was sacrificed to earn the right to peacefully protest.  Despicable.","date":"Mon Jun 01 01:53:56 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Fear leads to conflict, and conflict leads to more fear.  I have come to believe that unless we understand each other’s fears, we will never achieve true peace.","date":"Sat May 30 17:01:52 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Sam Johnson served our nation with fearless patriotism. He was more than an American hero--he was the embodiment of what's good &amp; true. As we mourn his passing, we know his legacy of unwavering love for God &amp; country will continue to inspire generations. https://t.co/opMQpmJWEl","date":"Thu May 28 02:22:55 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The Communist Party of China has used the #COVID19 pandemic to undermine the whole world &amp; that includes their own people. Reneging their promises to Hong Kong &amp; crushing any chance of independence is how the #CCP authoritarianism works &amp; it's about time we recognize it.","date":"Wed May 27 15:39:57 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Happy Independance Day to our great friends and allies, #Georgia!  You continue to fight for your freedom, and we stand with you against #Russia.","date":"Tue May 26 11:50:35 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Memorial Day reminds us that freedom is never free. We remember the selfless &amp; courageous service of our fallen heroes, and the loved ones they left behind. May we #HonorThem by carrying on their legacy of service to others &amp; share their deep love for this great nation. #Jolly51 https://t.co/MbqjtVucJl","date":"Mon May 25 16:44:25 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Unplug that rage machine, stop the conspiracies!  Two bit trolls will not do to us what armies couldn’t.","date":"Sun May 24 15:03:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"As we continue to fight through the #coronavirus, we cannot forget the struggles millions of Americans continue to face with #opioid abuse &amp; misuse. Thank you to the men &amp; women of our emergency services who serve our communities &amp; save countless lives every day. #EMSWeek","date":"Fri May 22 19:55:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"It’s time to #OpenIllinois in a way that ACTUALLY makes sense. The piecemeal approach isn’t working, @GovPritzker, just like your rule to criminalize business owners wasn’t working.","date":"Thu May 21 13:42:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Clickbait is everywhere and on social media, it can spread like wildfire. We have to rise above and unplug the rage machine that’s manufactured by trolls on the dark web. Take a deep breath and stay vigilant against these conspiracy theories. https://t.co/mapxGSlH3n","date":"Wed May 20 18:00:15 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Assuming they went to basic training and that was at least 1 day long, they get the GI Bill.  90 days total not at once.  If in their 6 year committment they do one more day of title 32 or 10, they get the three month reduced retirement. I’m a Guardsman  #notascandal","date":"Tue May 19 15:47:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"We need leadership on how to live AND work in this new normal. @MayoClinic says face masks reduce #COVID19 spread by 50-80% ‼️\nWearing a mask isn’t for you—it protects others from you. \nWearing a mask isn’t about stifling your freedom—it’s about saving lives AND our economy.","date":"Mon May 18 15:19:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"C’mon, @GovPritzker. It’s time to #OpenIllinois. Areas across the state have been ready for weeks, and they cannot wait any longer. It’s time.","date":"Mon May 18 13:35:01 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"On #PeaceOfficersMemorialDay, we remember the brave men and women of our #ThinBlueLine who made the ultimate sacrifice to protect our communities. To our #IL16 heroes in blue and those across the country, thank you for your service. #PoliceWeek2020 https://t.co/REou2ioQnU","date":"Fri May 15 19:09:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Schools may be closed in #IL16 but the 2020 Congressional Art Competition is still OPEN. Deadline has been extended to June 1st &amp; entries can now be sent via email. Can't wait to see the creativity! 🎨 For more information, please visit my website here: https://t.co/a7JTnIMH8L","date":"Wed May 13 21:05:25 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This is unacceptable. The Communist Party of China continues to put American lives at risk as they try to capitalize on the #COVID19 pandemic.\n\nWith their faulty manufacturing &amp; increased cyber attacks, the US needs to hold #China accountable &amp; address their threats head on.","date":"Wed May 13 15:11:20 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"GREAT NEWS! Julia Whitcomb is FINALLY off the cruise ship and reunited with her family. It's been a harrowing ordeal with many, many frustrations along the way. But right now, I'm just glad to know Julia is home safe. #IL16\nhttps://t.co/0VTT2By1VE","date":"Mon May 11 17:48:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Perfectly said.  It is imperative to finally implement this agreement and move on.","date":"Mon May 11 16:31:20 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing a very #HappyMothersDay to all the moms out there, especially to my mom Betty - the best of the best! https://t.co/UOLGJc17u6","date":"Sun May 10 18:24:31 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Here’s to the brave men and women who never gave up, never surrendered, and defeated the Nazis. On this #VEDay75, we celebrate all of our #WWII heroes and the sacrifices made by so many in the name of freedom. https://t.co/kWh6q8gj3k","date":"Fri May 08 21:46:51 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"For years, I‘ve worked to push for greater oversight in our relations with China &amp; take their threats against the U.S. to task. I appreciate this appointment by @GOPLeader &amp; look forward to working with my colleagues to strengthen our global security. https://t.co/bUvZnQfIzk","date":"Fri May 08 12:43:44 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"How kind of you- being as how you hid the virus.   Was it kind of you to force Italy to buy back with actual money the actual PPE they donated to you?  You abuse human rights, and try to profit on the misery you allowed to spread.  The world is over you.","date":"Wed May 06 22:44:29 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"To the nurses of #IL16 and all across the country, THANK YOU. #ThankYouNurses for the life-saving work you do every single day, for the compassion you show to our loved ones, for serving on the frontlines of the #COVID19 pandemic. #NationalNursesDay","date":"Wed May 06 19:31:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The Governors Plan smartly utilizes a regional approach.  I’m encouraged by this and hope as we move through the phases more flexibility will be given to local leaders. \n\nhttps://t.co/nXZ4s1HWf7","date":"Tue May 05 21:30:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"THIS. RIGHT. HERE.","date":"Sat May 02 19:03:51 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This #FeelGoodFriday, I'm giving a shout out to all those in #IL16 sewing masks to share with others, donating their time/resources to feed those in need, &amp; pulling double duty to help their community. 👏 #SchoolLunchHeroDay @StreatorHigh 👏 Full 🎥: https://t.co/7YL2xGsZ7s https://t.co/fChkGhT5iv","date":"Fri May 01 21:26:11 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Glad to hear @GovPritzker will modify his plan following our letter &amp; phone call yesterday on a phased reopening for #Illinois, starting with low-impact areas. We will continue to monitor and advise in the coming days and weeks. https://t.co/1HjxD7qf8x","date":"Fri May 01 14:11:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Many counties across #Illinois continue to report zero cases of #COVID19. As we continue to address areas where numbers are high, @GovPritzker must step up &amp; take a regional approach to create a safe reopening plan that balances safety AND employment. https://t.co/1HjxD7qf8x https://t.co/7J6XjRPPu5","date":"Thu Apr 30 18:38:22 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The extreme restrictions and nonsense excuses by the Infinity @CelebrityCruise have become deeply troubling &amp; frankly unacceptable.  My staff and I will continue to work with the Whitcomb family to bring Julia home safely &amp; soon.","date":"Thu Apr 30 00:44:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"What kind of insane, Communist sympathy is this garbage @CNN ?  Really?  I’m speechless.  \n\nhttps://t.co/7Ix0SuGiaU","date":"Wed Apr 29 13:56:43 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This #WorldImmunizationWeek reminds us that we must do more to ensure all people have access to vaccines. The #coronavirus has shown that diseases cross borders &amp; affect everyone. As we await a vaccine, we realize the importance of having such life-saving protections. https://t.co/alhP32g44E","date":"Mon Apr 27 20:45:24 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Here’s to the unsung heroes in our community, stepping up to help &amp; inspire during these uncertain times. This week’s #FeelGoodFriday shout-outs go to Kevin Lalley of Lee County EMA (cc: @MarkMadallas161) &amp; Principal Finnegan of @PrairieHill133. 👏👏👏 https://t.co/zUP7LrXKcT https://t.co/U2hrrGEeDe","date":"Fri Apr 24 20:03:55 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Fear can be a crippling thing, and as we face this global pandemic, the fear can be overwhelming. We have a long road ahead to getting our nation safely reopened, but I believe we are stronger than our fears and we WILL get through this together. https://t.co/1gPjvw2UP1","date":"Fri Apr 24 00:26:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"People are facing real hardships right now, and in order to move forward as a nation, we must work together. I'm glad to see the #PPP aid package pass the House today with the strong, bipartisan support it deserves. My full statement here: https://t.co/s2B70mu65A","date":"Thu Apr 23 22:48:39 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Social media is such an important part of our lives, especially now with #COVID19. But misinformation &amp; fraudulent activity have become real problems. So, today, I'm taking action to hold bad actors accountable &amp; make these companies more responsible. https://t.co/xBgVFGWh4B","date":"Thu Apr 23 16:40:44 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"As we pause today on #YomHaShoah to remember the six million lives taken by pure evil, may we honor their memory by reaffirming our commitment to combat hatred, antisemitism, and intolerance. Hate comes in many forms, but hate will NEVER win. #HolocaustRemembranceDay https://t.co/QnmEbUfvgN","date":"Wed Apr 22 01:06:24 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Big thank you to Taiwan for their generous donation of 100,000 surgical masks to our #Illinois frontline workers. The United States is fortunate to have such strong allies around the world, like Taiwan, to coordinate with and support as we all face this pandemic together.","date":"Tue Apr 21 18:20:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"When the Chinese gov’t tells me they “implemented control measures,” does that include the control of information; shutting out reporters &amp; silencing doctors? As the rest of the world works to fight this pandemic, China needs to come clean &amp; be honest about the #coronavirus. https://t.co/z8KJRC9WqJ","date":"Mon Apr 20 17:24:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Remember:  it was not until AFTER March 11 that @SpeakerPelosi began ANY restrictions or distancing in the Capitol despite calls to do so from some.  On March 11, we did get a recommendation on “mingling.”  She was not ahead of this. \n\nhttps://t.co/nAYv91h9yU","date":"Mon Apr 20 13:03:21 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"FEEL GOOD FRIDAY: This week, I’m proud to highlight a few Good Samaritans in #IL16 who have stepped up to support those on the front-lines of this #COVID19 pandemic. #InItTogether 👉 Full video here: https://t.co/RMnAFkMxlS https://t.co/n3nRXxLoI6","date":"Fri Apr 17 19:54:08 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The #PPP has just run out &amp; it must be addressed NOW to help our small businesses. To be clear, this funding is ENTIRELY separate from @IRSgov Economic Impact Payments--that money is still being sent. If you haven't received it yet, check the status on https://t.co/jS2862REnn.","date":"Fri Apr 17 16:46:05 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Great idea for a great cause!  Way to go (again!) @WhiskeyAcres","date":"Wed Apr 15 22:41:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Economic Impact Payments are going out now &amp; already making a difference. As always, please remain vigilant to avoid scams &amp; fraud. Learn more about the financial boost to every American as a result of Congress’s #coronavirus relief #CARESact here: https://t.co/QQgz4fdidl","date":"Wed Apr 15 18:41:57 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"REMINDER: Today is not *actually* #TaxDay. The @IRSnews  &amp; @USTreasury extended the filing deadline to July 15th to help taxpayers during this #COVID19 pandemic. Federal income tax payments can be deferred without penalties or interest. Get more info👉 https://t.co/1wZSXnJNGQ","date":"Wed Apr 15 14:29:27 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"We must get a full accounting from @chineseEmbinUS  on this, and answers to why for weeks  #chinahidthevirus  The Communist Party of China failed its own people, and the world.","date":"Tue Apr 14 12:55:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The #CARESAct allocated @USDA $35B to support farmers &amp; producers and provide economic help to rural areas &amp; nutrition support for the vulnerable. Thanks to the hard work &amp; dedication of our essential workers, families are able to stay home, stay safe, &amp; put food on the table. https://t.co/ib4AMryi9J","date":"Mon Apr 13 21:05:24 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"It is our faith that guides us and the Lord our God who sustains us. Alleluia! Wishing you and your loved ones a very happy #Easter Sunday. Be well and be safe, and may God bless you all. #IL16 #HeIsRisen https://t.co/eBLEfXKHmU","date":"Sun Apr 12 17:51:44 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Everyone is feeling the impact &amp; uncertainties of the #COVID19 pandemic, which can make it hard to find the positives. But the good is out there, I promise. So please join me on Facebook in shining a light on the feel-good moments in #IL16. We are all #InItTogether. https://t.co/jGYBLKtZe1","date":"Fri Apr 10 20:17:11 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Good news on this #GoodFriday 👉 Starting today, @HHSGov will distribute an additional $30 billion in #COVID19 relief funding to healthcare providers from the #CARESact funding. For #Illinois, this means over $1.2 million to 12,600+ providers. 👍\nhttps://t.co/5f6niHi8w6","date":"Fri Apr 10 16:23:48 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The #coronavirus pandemic is compounding on the already inhumane situation in #Syria. The barbaric brutality of Assad must stop &amp; now more than ever the Caesar Syria Civilian Protection Act needs to be enforced, for the good of the Syrian people. https://t.co/3GCEnOAXrc","date":"Thu Apr 09 15:21:13 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Be sure to take a look outside tonight because the biggest &amp; brightest moon of the year will rise &amp; reach peak illumination around 9:35pm CST. #PinkMoon If you can’t see it from where you are, check out the live-stream options here:","date":"Tue Apr 07 23:25:29 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Now more than ever, information sharing between government &amp; private sector is critical, especially when it comes to supply chain vulnerabilities. I’m proud to see my legislation become law &amp; help protect the security of our networks. #InItTogether https://t.co/bfffCcwk1K","date":"Tue Apr 07 13:13:11 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"I’m praying for our friend @BorisJohnson, and everyone with this terrible virus.  We are all in this together, and America and England stand together.","date":"Mon Apr 06 20:04:10 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"TAKE IT BACK, DANA!!","date":"Sun Apr 05 21:15:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"There’s a lot of news &amp; misinformation out there on #COVID19 &amp; it can be really overwhelming. To help, I've made a #coronavirus resource page on my website &amp; will continue to share important updates. We are #InItTogether &amp; we WILL get through this. https://t.co/QQgz4fdidl","date":"Fri Apr 03 16:40:01 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"While the rest of the world comes together to take action &amp; help stop this global pandemic, the Communist Party of China continues to cover-up its origin &amp; spread conspiracy theories rather than step up &amp; share with the world what they know about the virus.","date":"Thu Apr 02 12:21:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Great news! @WhiskeyAcres is back to work, restarting their production on making hand sanitizer for our local health facilities. #IL16 #InItTogether https://t.co/q8zU9d2uGk","date":"Wed Apr 01 20:24:46 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Get well my friend.","date":"Tue Mar 31 18:27:25 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@nuclear94 Nice work!","date":"Tue Mar 31 17:42:04 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The #2020Census is important to determine funding for our communities, especially in times of crises like we’re facing now. https://t.co/bEjZ4quFkN\n\nThe survey is quick &amp; easy to complete, so fill it out today! Learn more at the @uscensusbureau website.","date":"Tue Mar 31 17:09:33 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"To the men &amp; women on the front lines of this global health crisis, we thank you. #NationalDoctorsDay is a way to share our unwavering gratitude to the medical professionals in #IL16 &amp; across the country who are dedicated to saving lives &amp; fighting #COVID19. #InItTogether https://t.co/krOZvoDhtp","date":"Mon Mar 30 16:04:28 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"At a time when companies are stepping up to help their fellow Americans, @US_FDA is putting up roadblocks. This is not the time to change the rules &amp; prevent great distilleries like @WhiskeyAcres in #IL16 from providing a product so urgently needed. https://t.co/wQAvGkL64M","date":"Sun Mar 29 14:38:40 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Our region is going to be hit by severe storms today, #IL16. Be prepared, stay aware of changing weather conditions @weatherchannel @NWSChicago, know where to seek shelter, and please stay safe. More tips from @ReadyIllinois here: https://t.co/Rf8VGYispY","date":"Sat Mar 28 15:41:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Proud to see the House pass #CARESAct by voice today--a #coronavirus relief effort to save countless lives &amp; our economy. These are trying times, but we're #InItTogether &amp; the sacrifices we make now will put us on a stronger path to a brighter future. https://t.co/qlNSZN6zcR","date":"Fri Mar 27 20:00:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"American workers need relief—and not being able to access the #IDES website 💻 or get through to their hotline ☎️ is unacceptable. While I understand the surge happening, the state needs to get a handle on this with the resources they’ve received from the federal government.","date":"Thu Mar 26 16:48:23 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"No family should have to endure what the Levinson’s have these last 13 years. Bob Levinson was an American hero &amp; it’s shameful that he was left behind, wrongfully held by the Iranian regime. I stand w/ Bob’s family in seeking justice, starting w/ the swift return of his body.","date":"Thu Mar 26 01:20:50 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Wishing a very happy birthday to my bride, Sofia! 🎉 In five weeks of marriage, we're proving you CAN survive isolation together. 👍 Clearly, I'm a very lucky man. Cheers to my wife! https://t.co/G014bwBnVv","date":"Wed Mar 25 16:12:00 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Our agriculture community works tirelessly to provide for American families. In the midst of a global health crisis, they continue to be our rock. On #NationalAgDay &amp; every day, we celebrate our farmers, ranchers, producers, &amp; food suppliers in #IL16 &amp; across the country. https://t.co/iJKKTGG1rf","date":"Wed Mar 25 01:03:48 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Heroes don’t choose to be heroes, but when circumstances call and they run into danger, they earn that label.  These are the moments we realize our medical professional have been heroes all along.  Thank you!","date":"Tue Mar 24 23:02:45 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Great phone call with @A_Talakvadze about #Georgia and their fight against #covid19 as well as economic challenges we will all face.  Our friendship and bond remains as strong as ever. https://t.co/3HQZkhflLE","date":"Tue Mar 24 21:27:42 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"“Do Democrats even care?” That’s a good question, @WSJ. Hard to say when you’ve got @SpeakerPelosi holding a bipartisan #COVID19 relief bill as her own political hostage.","date":"Tue Mar 24 15:40:48 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thanks Dr. Brito!  We appreciate all your work and sharing this vital information with us!","date":"Mon Mar 23 23:00:47 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The Senate must act on the #CARESAct now. This is not the time for political posturing. This is a time for action. We must protect the critical healthcare infrastructure providing care within our communities, including rural areas. #COVID19 https://t.co/kNxXwUhVWw","date":"Mon Mar 23 16:10:13 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"My prayers for @MittRomney @RandPaul and every American facing this virus.  No petty shots please, until this all passes.","date":"Sun Mar 22 22:54:15 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"For more information on this order, please visit my website for a FAQs from the Governor's Office. The PDF Fact Sheet can be found under 'Illinois Response' on my 'Coronavirus Information' webpage here: https://t.co/QQgz4fdidl","date":"Fri Mar 20 22:53:03 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"The spread of the #coronavirus is very serious, and it needs to be contained. I know it’s not what we want to do, but a shelter in place is what we NEED to do—especially as we learn more about #COVID19. This is the right call, folks. Staying home WILL save lives.","date":"Fri Mar 20 21:22:11 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"This week, I’ve worked with colleagues across the aisle to take action on issues related to #Covid_19:\n📝 to @StateDept @USDA on visas for ag workers\n📝 for @SBAgov emergency💰\n📝 to @HHSGov @GovPritzker on PPE &amp; Medicaid\nMore info on these &amp; others here: https://t.co/QQgz4fdidl","date":"Fri Mar 20 18:53:48 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Thank you to all those on the front lines who are working tirelessly—risking their own lives—to keep us stocked, safe, and healthy - you are critical to our fight against the #coronavirus. #IL16 #InItTogether https://t.co/pCMwNwF5ra","date":"Fri Mar 20 15:30:07 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"There are many sick Americans today because #Chinahidthevirus","date":"Fri Mar 20 14:07:13 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"HEADS UP! These text messages are FAKE and should NOT be clicked on. Disturbing to see such spam efforts trying to take advantage of people during this pandemic. Stay vigilant, everyone. #InItTogether https://t.co/yvWY228KF0","date":"Thu Mar 19 17:13:32 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Dec 10: first COVID19 victim\nDec 31: Docs post on internet, promptly arrested by China. China orders destruction of samples.\nJan 21: First mention by China in China Daily newspaper\nJan 31: US travel restrictions\n\nFor two months, #Chinahidthevirus","date":"Thu Mar 19 15:09:01 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@steven_maines German.  Why do you ask?","date":"Thu Mar 19 13:31:24 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"interesting study.  It’s not about race at all, it’s about holding a foreign government accountable for actions that cost lives and money.","date":"Wed Mar 18 21:31:09 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Just going to leave this here from January from the WHO, courtesy of China when #Chinahidthevirus","date":"Wed Mar 18 15:50:17 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"With schools closed across Illinois due to #coronavirus concerns, kids need a creative outlet now more than ever. Starting today, my office will be collecting art submissions for the 2020 Congressional Art Competition. More details for #IL16 here: https://t.co/a7JTnIMH8L https://t.co/I7Xdkjq1US","date":"Wed Mar 18 15:12:19 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"https://t.co/dtxHWJTHiK","date":"Wed Mar 18 14:41:28 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"Daily reminder:  you are in your home now because #Chinahidthevirus","date":"Wed Mar 18 14:01:59 +0000 2020","user_id":"219429281"},{"handle":"RepKinzinger","text":"@ChixRivahVA @GrundyLaSalleIn Let’s explore.  Holding China accountable for hiding this is now xenophobic.  Why? We’re you upset when i made many statements condemning Russia?  Or Syrian Govt?  Or Turkey?  Why is it now wrong to engage in foreign policy?","date":"Wed Mar 18 13:42:48 +0000 2020","user_id":"219429281"}]